{
    "id": "https://semopenalex.org/work/W2937213596",
    "authors": [
        "Yuanbo Liang",
        "Dian Yuan",
        "Ammar Patel",
        "Vahab Solouki Bonab",
        "Vahid Karimkhani"
    ],
    "title": "Vitrimerization: A Novel Concept to Reprocess and Recycle Thermoset Waste via Dynamic Chemistry",
    "date": "2019-04-07",
    "abstract": "A new approach for reprocessing of existing thermoset waste is presented. This work demonstrates that unrecyclable thermoset materials can be reprocessed using the concept of associative dynamic bonding, vitrimers. The developed recycling methodology relies on swelling the thermoset network into a solution of a catalyst, which enables transesterification reactions allowing dynamic bond exchange between ester and hydroxyl groups within the thermoset network. Thermal and mechanical properties for recycled polyurethane and epoxy networks are studied and a strategy to maintain the properties of recycled materials is discussed. The developed methodology promises recycling and even upcycling and reprocessing of previously thought intractable materials. Moreover, processability of vitrimerized thermosets with common thermoplastic manufacturing methods opens up the possibility of tuning recycled networks by adding nanoparticles. This flexibility keeps the application window of recycled thermosets very broad.",
    "sections": [
        {
            "title": "Experimental Section",
            "paragraphs": [
                "Preparation of Neat Samples: Crosslinked polyurethane was synthesized by polymerizing polycaprolactone triol (Mw = 900 g mol−1) with 1,4‐phenylene diisocyanate (PPDI). 10 g polyol was degassed under vacuum at 80 °C overnight and then transferred into a sealed three neck reactor under nitrogen. 40 mL of DCM was added to the reactor and stirred to dissolve the polyol. In order to have excess OH groups in PU, the required amount of PPDI was calculated to maintain the [NCO]/[OH] ratio as 0.9. The PPDI was also dissolved in 40 mL of DCM. This PPDI solution was added to the polyol solution at 40 °C and stirred vigorously for 3 min. The solution was cast on a Teflon plate and the solvent was left to evaporate under nitrogen flow at room temperature for 48 h. The resulting films were placed in a vacuum oven at 80 °C for 24 h to remove any trace of solvent from the PU. A TGA temperature ramp confirmed that no solvent remained in the system.",
                "Epoxy networks were synthesized using diglycidyl ether of bisphenol A (DGEBA) and glutaric anhydride. The reactants were hand mixed together using a glass rod such that the ratio of [epoxy groups]:[anhydride groups] is 1:1. An imidazole catalyst was added at 1 wt% with respect to DGEBA to accelerate the reaction. The mixture was poured into a mold and cured at 80 °C and then 160 °C for 8 h each.",
                "Tensile Testing: Uniaxial tensile tests for PU were carried out at room temperature on a Zwick/Roell (Model Z0.5) with load cell of 100N on at least four samples at an extension rate of 10 mm min−1. Samples had dumbbell shape and were cut from films prepared by compression molding. Tensile tests for the epoxy system were conducted on a Zwick/Roell with a load cell of 500N at an extension rate of 1 mm min−1. Samples were rectangular shaped and were obtained from the minilab in a process that will be explained later in this paper.",
                "TGA: Thermal decomposition tests were run on samples on a Q500 TA instruments machine under N2 flow. Samples were ramped up to 700 °C at 10 °C min−1.",
                "Stress Relaxation: The Ares G2 Rheometer was used to measure the stress relaxation behavior of all samples. Samples were studied in parallel plate geometry at a temperature of 200 °C. Samples were subjected to a strain percentage following which the relaxation in storage modulus was observed with time. Care was taken to ensure that the strain values were within the viscoelastic regimes of all samples."
            ],
            "subsections": []
        },
        {
            "title": "Conflict Of Interest",
            "paragraphs": [
                "The authors declare no conflict of interest."
            ],
            "subsections": []
        }
    ]
}