{
    "id": "US20200277525",
    "authors": [
        "Tekle Fida",
        "Gerrit Voordouw",
        "Jaspreet Mand"
    ],
    "title": "SODIUM NITROPRUSSIDE AND NITRATE METABOLIC INHIBITION OF SULFATE-REDUCING MICROBES TO CONTROL SULFIDE PRODUCTION",
    "date": "2018-09-07 00:00:00",
    "abstract": "Combinations of a nitroprusside, such as sodium nitroprusside (SNP; Na2[Fe(CN)5NO].2H2O) and a nitrate, are provided, together with methods for the combined use of the nitroprusside and the nitrate as metabolic inhibitors of microbial cultures. The microbial cultures may include sulfate reducing bacteria (SRB) in aqueous culture. This metabolic inhibition may for example be implemented in the presence of a hydrocarbon, for example in an oil reservoir or in oil field systems and facilities. When applied to an SRB culture in the presence of a hydrocarbon, the combination of the nitroprusside and the nitrate may accordingly be used to ameliorate the biological formation of sulfides, particularly hydrogen sulfide.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "The invention is in the field of microbiology, particularly the use of inorganic compounds to regulate bacterial growth and activity."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 133,
                    "outline_medium": [
                        "define field of invention"
                    ],
                    "outline_short": [
                        "define field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Formation of hydrogen sulfide (H2S), a process commonly referred to as souring, results from the growth and activity of sulfate-reducing bacteria (SRB) and sulfate reducing archaea (SRA), collectively referred to as sulfate-reducing microorganisms (SRM). SRM anaerobically respire sulfate to sulfide as part of their energy metabolism. Souring is a common problem in the petroleum industry, in reservoirs and in surface processing facilities of oil production operations, under low- and high-temperature as well as saline or fresh water conditions. Depending on the pH, sulfide may be present as H2S in all three phases or as HS− and as S2− in the aqueous phase (Gieg et al., 2011). Souring must generally be controlled due to the increased risk to health and safety, deterioration of oil and gas quality, and biocorrosion of pipelines and steel infrastructure (Hubert et al., 2005; Tang et al., 2009; Vance and Thrasher, 2005). Souring is commonly controlled by the application of biocide or nitrate (Bødtker et al., 2008; Xue and Voordouw, 2015). Biocides, such as benzalkonium chloride (BAC), glutaraldehyde (Glut), bronopol, formaldehyde, cocodiamine (Coco), and tetrakishydroxymethyl phosphonium sulfate (THPS) are organic chemicals commonly applied to injection waters and production facilities to kill SRM and other microorganisms (Vance and Thrasher, 2005; Xue and Voordouw, 2015). Nitrate application enriches nitrate-reducing bacteria (NRB), which inhibit SRB by outcompeting for electron donors, increasing the redox potential, or producing nitrite which is an inhibitor of dissimilatory sulfite reductase (Dsr) responsible for reduction of sulfite to sulfide (Bødtker et al., 2008; Voordouw et al., 2009; Xue and Voordouw, 2015).",
                        "The application of biocides has several drawbacks including environmental concerns from non-target toxicity, and economics of application (Fraise, 2002; Telang et al., 1998; Whitham and Gilbert, 1993). Other problems are the need for high concentrations (slugs) and frequent (e.g. weekly) treatments, especially when dealing with biofilms (Kjellerup et al., 2005; Vance and Thrasher, 2005). Some biocides react with sulfide in reservoirs in a manner, which compromises their efficacy. Therefore, the choice of biocide and the optimal dosing strategy are important in the oil industry to maximize efficient control of souring.",
                        "Sodium nitroprusside (SNP; Na2[Fe(CN)5NO].2H2O) has been widely used as a vasodilating drug for treatment of pulmonary hypertension (Koslyk et al., 2015; Lim and Zaphiriou, 2016). A bactericidal effect of SNP has been reported for Pseudomonas aeruginosa, Clostridium sporogenes, and Bacillus subtilis (Barraud et al., 2006; Joannou et al., 1998; Moore et al., 2004). In studies of its physiological importance as a vasodilating drug, SNP has been reported to react with H2S biosynthesized in mammals during enzymatic metabolism of sulfhydryl proteins (Quiroga et al., 2011).",
                        "In the context of the present application, various terms are used in accordance with what is understood to be the ordinary meaning of those terms. For example, “petroleum” is a naturally occurring mixture consisting predominantly of hydrocarbons in the gaseous, liquid or solid phase. In the context of the present application, the words “petroleum” and “hydrocarbon” are used to refer to mixtures of widely varying composition. The production of petroleum from a reservoir necessarily involves the production of hydrocarbons, but is not limited to hydrocarbon production. Similarly, processes that produce hydrocarbons from a well will generally also produce components of petroleum fluids that are not hydrocarbons. In accordance with this usage, a process for producing petroleum or hydrocarbons is not necessarily a process that produces exclusively petroleum or hydrocarbons, respectively. “Fluids”, such as petroleum fluids, include both liquids and gases. Natural gas is the portion of petroleum that exists either in the gaseous phase or is in solution in crude oil in natural underground reservoirs, and which is gaseous at atmospheric conditions of pressure and temperature. Natural gas may include amounts of non-hydrocarbons.",
                        "It is a common practice to segregate petroleum substances of high viscosity and density into categories, such as “light oil”, “heavy oil” and “bitumen”. For example, some sources define “heavy oil” as a petroleum that has a mass density of greater than about 900 kg/m3. Bitumen is sometimes described as that portion of petroleum that exists in the semi-solid or solid phase in natural deposits, with a mass density greater than about 1,000 kg/m3 and a viscosity greater than 10,000 centipoise or 10 Pa·s measured at original temperature in the deposit and atmospheric pressure, on a gas-free basis. Although these terms are in common use, references to heavy oil and bitumen represent categories of convenience, and there is a continuum of properties between heavy oil and bitumen. Accordingly, references to heavy oil and/or bitumen herein include the continuum of such substances, and do not imply the existence of some fixed and universally recognized boundary between the two substances. In particular, the term “heavy oil” includes within its scope all “bitumen” including hydrocarbons that are present in semi-solid or solid form.",
                        "A reservoir is a subsurface (or subterranean) formation containing one or more natural accumulations (or deposits) of moveable petroleum, which are generally confined by relatively impermeable rock. An “oil sand” (or formerly “tar sand”) reservoir is generally comprised of strata of sand or sandstone containing petroleum. A reservoir represents one type of hydrocarbon-containing environment or system, which may support microbial growth or metabolism. Alternative hydrocarbon-containing environments or systems may include oil field production or other petroleum handling facilities. In these environments and systems, it is desirable to provide compositions and methods that may be used so as to ameliorate souring."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce souring problem",
                        "explain souring process",
                        "describe drawbacks of biocide application",
                        "discuss limitations of nitrate application",
                        "introduce sodium nitroprusside",
                        "describe bactericidal effect of SNP",
                        "explain SNP's reaction with H2S",
                        "define petroleum and hydrocarbon",
                        "define fluids and natural gas",
                        "categorize petroleum substances",
                        "define reservoir and oil sand reservoir",
                        "introduce need for souring control"
                    ],
                    "num_characters": 6043,
                    "outline_medium": [
                        "introduce souring problem",
                        "describe limitations of biocides",
                        "describe limitations of nitrate application",
                        "introduce sodium nitroprusside",
                        "define petroleum and related terms",
                        "describe reservoir and oil field systems"
                    ],
                    "outline_short": [
                        "describe souring problem",
                        "limitations of biocide application",
                        "introduce sodium nitroprusside"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Combinations of a nitroprusside, such as sodium nitroprusside (SNP; Na2[Fe(CN)5NO].2H2O) and a nitrate, may be used as metabolic inhibitors of microbial cultures, for example cultures that include sulfate reducing bacteria (SRB). As exemplified in aqueous SRB culture, this metabolic inhibition may for example be implemented in the presence of a hydrocarbon, for example in an oil reservoir or in oil field systems and facilities. When applied to an SRB culture in the presence of a hydrocarbon, the combination of SNP and a nitrate may accordingly be used to ameliorate the biological formation of sulfides, particularly hydrogen sulfide."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize invention"
                    ],
                    "num_characters": 640,
                    "outline_medium": [
                        "summarize invention"
                    ],
                    "outline_short": [
                        "summarize invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Compositions are provided that comprise a combination of a nitroprusside salt or a solvate thereof, such as SNP, with a nitrate salt or a solvate thereof, such as sodium nitrate. In select embodiments, synergistic combinations, for example of SNP and nitrate, may be provided, for example in aqueous solution, where the amounts of the nitroprusside and nitrate are synergistically effective to inhibit microbial metabolism. Methods are accordingly provided for the combined use of a nitroprusside salt or a solvate thereof, such as SNP, with a nitrate salt or a solvate thereof, such as sodium nitrate. In use, nitroprussides and nitrates may be combined in amounts that are effective to inhibit microbial metabolism, for example in microbial cultures that include sulfate reducing bacteria (SRB). As exemplified in aqueous SRB culture, this metabolic inhibition may for example be implemented in the presence of a hydrocarbon, for example in an oil reservoir or in connate or produced water environments. When applied to an SRB culture, the combination of SNP and a nitrate may accordingly be used to ameliorate the biological formation of sulfides, such as hydrogen sulfide. In the context of a hydrocarbon-containing environments or systems, such as an oil or gas reservoir or oil field production facilities, this may for example be implemented so as to ameliorate souring.",
                        "Nitroprusside salts available for use in accordance with alternative aspects of the present innovations may for example be an alkali salt, such as sodium nitroprusside or potassium nitroprusside, or a mixture or hydrate thereof, such as disodium nitroprusside dihydrate.",
                        "Nitrate salts available for use in accordance with alternative aspects of the present innovations may for example be alkali salts, such as sodium nitrate or potassium nitrate, or calcium nitrate, or mixtures thereof.",
                        "In select embodiments, SNP may be used in concentrations from 1-50 ppm in combination with 85 ppm nitrate, or from 26-131 ppm in the absence of nitrate, to inhibit the metabolism or growth of microbes, such as SRBs. This may for example be carried out in oil field systems (i.e. reservoirs and surface facilities). In select embodiments, this may for example be carried out so as to decrease, ameliorate or eliminate sulfides in sour systems.",
                        "In select embodiments, as exemplified herein, pulsing of 1 ppm SNP while continuously injecting 85 ppm of nitrate gave control of souring in oil bioreactors. Individually, souring control was achieved by using 50 ppm of SNP or 340 ppm of nitrate. These numbers indicate that SNP and nitrate, when applied together, are highly synergistic in inhibiting souring.",
                        "In the presence of sulfide, SNP may be used to inhibit steel corrosion, for example at concentrations of 0.5-1 mM (150-300 ppm). This inhibition of corrosion may for example be carried out with SNP applied so as to also control the metabolism or growth of microbes, such as SRB.",
                        "In an exemplified embodiment, growth and activity of SRB was completely inhibited by SNP concentrations, as low as 50 μM (14.9 ppm), when applied before the cells started growing in serum bottles (104 SRB/ml). Similarly, an SNP concentration of 0.5 mM (149 ppm) completely inhibited the growth of SRB consortia, when applied to mid-log phase cultures (107 SRB/ml).",
                        "In select embodiments, SNP may be used so as to react chemically with sulfide, and thereby remove sulfides, for example from aqueous environments, such as a hydrocarbon reservoir or a hydrocarbon processing facility.",
                        "In one embodiment, monitoring of most probable numbers (MPNs) indicated application of 0.5 mM (149 ppm) SNP for 1 h to actively growing cells killed SRB 109-fold and acid producing bacteria (APB) 107-fold. The growth and activity of mid-log phase thermophilic SRB consortia at 60° C. in the presence of 0.5 M NaCl was prevented by SNP concentrations as low as 50 μM (15 ppm). This illustrates that SNP could be used as souring inhibitor in both high temperature reservoirs and in reservoirs flooded with seawater, which may for example contain about 0.5 M NaCl."
                    ],
                    "subsections": [
                        {
                            "title": "Examples",
                            "paragraphs": [
                                "Materials and Methods",
                                "Bacterial Culture and Growth Medium",
                                "The bacterial culture used in this example was obtained from produced water samples designated 4PW, 14PW or 18PW of the Medicine Hat Glauconitic C (MHGC) oil field near Medicine Hat, Alberta, Canada. Coleville synthetic brine medium A or K [CSBA or CSBK (Callbeck et al., 2013; Hubert et al., 2003)], with an N2 (90% v/v) and CO2 (10%) (N2—CO2) headspace was used for enrichment and growth of SRB consortia. CSBK medium contained (g/L) (NaCl (1.5), KH2PO4 (0.05), NH4Cl (0.32), CaCl2.2H2O (0.21), MgCl2.5H2O (0.54), and KCl (0.1) whereas CSBA medium contained (g/L) (NaCl (30), KH2PO4 (0.2), NH4Cl (0.2), CaCl2.2H2O (0.15), MgCl2.5H2O (0.4), and KCl (0.5). The media were buffered with bicarbonate (NaHCO3, 30 mM). One ml each of trace elements and tungstate/selenite solution (Widdel et al., 1983) were added separately. The pH was adjusted to 7.4 using 2 M HCl. The serum bottles were sealed with butyl rubber septa and tightened with aluminum crimp seals. Sodium sulfate was used as the electron acceptor and volatile fatty acids (VFA: a mixture of acetate, propionate and butyrate), lactate, or MHGC heavy oil (API 16) were used as electron donor for enrichment of SRB at concentrations indicated below.",
                                "Souring Control in Bioreactors Containing Heavy Oil",
                                "Glass barrel columns (500 ml) were provided with a layer of glass wool and a layer of polymeric mesh and were then packed tightly with sand (Sigma-Aldrich, 50-70 mesh), followed by a top layer of glass wool (Gassara et al., 2015; Kryachko and Voordouw, 2014). The typical column had 6 sampling ports sealed with rubber stoppers and aluminum rings, allowing sampling at different positions along the flow path (FIG. 1). A larger stopper perforated with a syringe was used to seal the column outlet. Two Luer-Lock three-way valves were connected to the inlet and outlet syringe of the column. The columns were injected with CSBK under upward flow conditions using a Gilson MiniPuls 3 peristaltic pump to make them water wet. The columns were weighed before and after saturation to measure the pore volumes (typically 120 ml). The columns were then flooded with 1 PV of MHGC heavy oil, replacing about 0.95 PV of CSBK. Oil was then produced from the columns by injection of anoxic CSBK medium containing 2 mM sulfate from a 2 L medium reservoir at a rate of 0.5 PV per day until the column contained about 0.5 PV of residual oil. The columns were then injected with 1 PV of SRB consortia from MHGC produced water (18PW) enriched with CSBK containing MHGC oil with additional sulfate (5 mM). The columns were incubated for one month to allow cell proliferation, followed by a continuous flooding of CSBK-S(CSBK with 2 mM sulfate) at a rate of 0.25 PV per day. After establishment of constant souring (effluent sulfide concentrations approaching 2 mM), the medium was amended subsequently with 1 ppm SNP+43 ppm (0.5 mM) nitrate, 1 ppm SNP+85 ppm (1 mM) nitrate or 1 ppm SNP+170 ppm (2 mM) nitrate in duplicate bioreactors. To illustrate the SRB inhibitory effect of SNP and nitrate combination with SNP or nitrate alone, the bioreactors received subsequent concentrations of 10 and 50 ppm of SNP or 85, 170 and 340 ppm (4 mM) of nitrate. The bioreactors were treated with 2 PV at each concentration of SNP, nitrate or combinations. Sulfide and sulfate concentrations were then determined by sampling 300 ul of fluids from the different ports and from the effluent using syringe needles.",
                                "Determination of an Exemplary Minimum Inhibitory Concentration of SNP at Low Temperature in Batch Cultures",
                                "Two conditions were used to illustrate an exemplary minimum inhibitory concentration of SNP on SRB in batch culture in serum bottles. The first condition was the use of SNP on a nondense SRB culture at the start of growth. Different concentrations of SNP dihydrate (1, 10, 25, 50 μM; 10 μM=3 ppm) were added to 20 ml of CSBK medium containing 2 mM Na2SO4 and 3 mM of each VFA in 60 ml serum bottles closed with butyl rubber stoppers. SNP was added with a syringe attached to a 25-gauge needle from a 50 mM stock solution anaerobically prepared in CSBK medium in the dark. The bottles were then inoculated with 100 μl SRB consortia from 18PW already enriched for 96 h on CSBK medium with 3 mM VFA and 2 mM sulfate. In the second condition, SNP (10, 25, 50, 100, 500, 1000 μM; 1000 μM=298 ppm) was added to mid-log phase cultures of an SRB consortium. The cultures were grown in duplicate in 350 ml CSBK medium with 15 mM of each VFA and 10 mM sulfate in 500 ml bottles closed with butyl rubber stoppers and sealed with open top bottle caps. After reduction of about 5 mM sulfate (i.e. in midlog phase), 20 ml of the cultures together with about 10 ml headspace gas were transferred with a syringe to 60 ml serum bottles closed with butyl rubber stoppers and filled with N2—CO2. The selected concentrations of SNP were then immediately added to each bottle. The experiments were done in duplicate for each concentration and the bottles were incubated at 30° C. in the dark. Samples (0.5 ml) were periodically withdrawn and concentrations of sulfate, sulfide, SNP, nitrate, nitrite and protein were monitored as described below.",
                                "Determination of an Exemplary Minimum Inhibitory Concentration of SNP at High Temperature and Salinity in Serum Bottles",
                                "Similar experiments as for mesophilic SRB were conducted to illustrate the efficacy of SNP at high temperature and sea water salinity. Thermophilic SRB (tSRB) were obtained as an enrichment culture of produced water samples of the Terra Nova oil field. This oil field has a resident temperature of 95° C. and is located offshore from Newfoundland, Canada. The samples were enriched at 60° C. in CSBA medium containing 0.5 M NaCl, 10 mM sulfate and 20 mM lactate. The tSRB were grown in 400 ml CSBA medium with 20 mM lactate and 8 mM sulfate in a 500 ml bottle closed with a butyl rubber stopper and sealed with an open top bottle cap. After 4 mM sulfate was reduced, 20 ml of the culture were transferred with a syringe to 60 ml serum bottles closed with butyl rubber stoppers and filled with N2—CO2. SNP (either 25, 50, 100, 200, 500 or 1000 μM) was added immediately. Samples were incubated at 60° C. and sulfate reduction was monitored over time.",
                                "Chemical Reaction of SNP and Sulfide",
                                "A blue-colored product was observed immediately after addition of SNP to mid-log phase cultures indicating chemical reaction of SNP and sulfide. Therefore, the concentrations of SNP and sulfide before and after the reaction were determined, as indicated below. SRB were grown in CSBK medium containing 3 mM VFA and 2 mM sulfate at 30° C. After complete reduction of sulfate to sulfide, SNP (2 mM) was added. The concentrations of SNP and sulfide were then determined repeatedly over a 120 min period.",
                                "SNP Kill of SRB and Acid Producing Bacteria (APB)",
                                "An actively growing anaerobic culture of SRB, which also contained APB, was obtained from a continuous culture in CSBK medium with 4 mM lactate and 2 mM sulfate. Subcultures (10 ml) were transferred with a syringe to duplicate 60 ml serum bottles closed with butyl rubber stoppers and an N2—CO2 headspace. SNP was added to 0.5 mM (149 ppm). Controls without SNP were kept under the same conditions. After 10 min, 1 h and 24 h of exposure to SNP, aliquots (100 μl) of the cultures were serially diluted in triplicate in 48-well microtiter plates containing Postgate medium B (900 μl). Postgate medium B contains (g/L): KH2PO4 (0.5), NH4Cl (1.0), CaSO4 (1.0), MgSO4.7H2O (2.0), sodium lactate (4.0: 60% w/w), yeast extract (1.0), ascorbic acid (0.1), thioglycolate (0.1), FeSO4.7H2O (0.5). APB were enumerated by growing triplicates of the serially diluted samples on phenol red broth (Difco, BD). The samples were incubated anaerobically for 3 weeks at 30° C. in the hood. Wells exhibiting a black precipitate for or a yellow color were scored positive for growth of SRB and APB, respectively. Most probable numbers (MPNs) were derived from the data using appropriate statistical tables (Shen and Voordouw, 2015).",
                                "Corrosion Inhibition",
                                "Four different approaches were used to illustrate the corrosion inhibitory activity of SNP. The first approach was to test the concentration-dependent corrosivity of SNP on carbon steel coupons under abiotic conditions. One pre-cleaned, pre-weighed carbon steel coupon (a366, 2×1×0.1 cm) was added to 20 ml of CSBK medium with 2 mM sulfate and 3 mM VFA in 50 ml serum bottles with a headspace of N2—CO2. Different concentrations of SNP (0, 0.1, 0.5, 1, 1.5 and 2 mM; 1 mM=298 ppm) were then added to each bottle. The second approach was to determine whether SNP enhances or inhibits corrosion in a sour system. SRB consortia were grown in CSBK medium containing 2 mM sulfate and 3 mM VFA, as described above. After complete reduction of sulfate to about 2 mM sulfide, carbon steel coupons and different concentrations of SNP was added as described above. The third approach was to test corrosion rates when SNP was allowed to react with sulfide before it came in contact with steel. SNP (0.5 mM) was added to 20 ml of a sour SRB culture containing approximately 2 mM sulfide. Coupons were then added to this mixture within 1 min, 1 h or 24 h after mixing. The fourth approach was to test whether thiocyanate (SCN-) formed from SNP (Filipovic et al., 2013) decreases corrosion of carbon steel in the presence or absence of sulfide. Potassium thiocyanate (2 mM) was added to CSBK medium in the presence or absence of SNP (2 mM) and in the presence or absence of sulfide (2 mM) and SNP (2 mM). In all approaches, triplicate samples were incubated in the dark at 30° C. on a rocker for one month. Weight loss corrosion rates were measured following this incubation.",
                                "Comparison of SNP with Other Compounds",
                                "Different concentrations of SNP (5, 10, 20 or 40 ppm) were compared with the same concentrations of the compounds BAC, Glut, BAC_Glut (a combination of BAC and Glut), THPS and cocodiamine (Coco). The experiments were conducted in 19 ml CSBK medium containing 20 mM sulfate and 10 mM lactate in 25 ml Hungate tubes. To each tube, 5 carbon steel beads were added and the medium was inoculated with 1 ml of 4PW SRB consortia, obtained by enrichment from 4PW. After one month of incubation at room temperature, the concentrations of sulfate, sulfide and lactate and the corrosion rates were determined.",
                                "Analytical Methods",
                                "Samples (0.5 ml) were transferred to a microfuge tube and centrifuged at 17,000×g for 5 min. Concentrations of sulfate, nitrate and nitrite were determined from the clarified fluid with high-performance liquid chromatography (HPLC), using a Waters 1515 HPLC instrument equipped with a Waters 2489 UV/visible detector (for nitrate and nitrite) or a Waters 432 conductivity detector (for sulfate) and an IC-PAK Anion HC, 4.6×150-mm column (Waters, Japan) as described elsewhere (Grigoryan et al., 2008). The SNP concentration was determined, using a Waters 1515 HPLC instrument equipped with a Waters 2489 UV/visible detector and a Nova-PAK C18, 3.9×150-mm column (Waters, Japan). Methanol:water (95:5%) was used as the mobile phase for detection of SNP. Samples (100 μl) were diluted in 400 μl of the mobile phase and injected (50 μl) at a flow rate of 1 ml/min. The peak of SNP was detected at 210 nm and concentrations were estimated from known concentrations of SNP standards prepared in CSBK medium. The aqueous sulfide concentration was determined colorimetrically with N,N-dimethyl-p phenylenediamine reagent (Trueper and Schlegel, 1964).",
                                "Protein concentrations were determined as described elsewhere (Fida et al., 2014). Briefly, 0.5 ml of samples were pelleted by centrifugation at 17,000×g for 5 min. The cell pellets were suspended in 100 μl of 0.1 N NaOH, lysed by heating at 95° C. for 10 min and centrifuged for 1 min at 16,000×g to remove cell debris. The protein concentration was quantified with a Qubit fluorimeter (Invitrogen) using the Qubit protein assay Kit (Invitrogen)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce bacterial culture and growth medium",
                                "describe Coleville synthetic brine medium A or K",
                                "outline composition of CSBK medium",
                                "outline composition of CSBA medium",
                                "describe buffering with bicarbonate",
                                "describe addition of trace elements and tungstate/selenite solution",
                                "describe pH adjustment",
                                "describe serum bottle preparation",
                                "describe souring control in bioreactors containing heavy oil",
                                "describe glass barrel column preparation",
                                "describe injection of CSBK medium",
                                "describe flooding with MHGC heavy oil",
                                "describe injection of SRB consortia",
                                "describe incubation and flooding with CSBK-S",
                                "describe amendment with SNP and nitrate",
                                "describe sulfide and sulfate concentration determination",
                                "describe determination of minimum inhibitory concentration of SNP",
                                "describe addition of SNP to nondense SRB culture",
                                "describe addition of SNP to mid-log phase cultures",
                                "describe monitoring of sulfate, sulfide, SNP, nitrate, nitrite, and protein concentrations",
                                "describe chemical reaction of SNP and sulfide",
                                "describe SNP kill of SRB and acid producing bacteria",
                                "describe corrosion inhibition experiments",
                                "describe comparison of SNP with other compounds"
                            ],
                            "num_characters": 12054,
                            "outline_medium": [
                                "describe bacterial culture and growth medium",
                                "outline souring control in bioreactors containing heavy oil",
                                "determine minimum inhibitory concentration of SNP at low temperature",
                                "determine minimum inhibitory concentration of SNP at high temperature and salinity",
                                "describe chemical reaction of SNP and sulfide",
                                "determine SNP kill of SRB and acid producing bacteria",
                                "describe corrosion inhibition by SNP",
                                "compare SNP with other compounds",
                                "describe analytical methods for sulfate, nitrate, and nitrite",
                                "describe analytical methods for SNP",
                                "describe analytical methods for sulfide",
                                "describe analytical methods for protein"
                            ],
                            "outline_short": [
                                "describe bacterial culture and growth medium",
                                "describe souring control in bioreactors containing heavy oil",
                                "describe determination of minimum inhibitory concentration of SNP at low temperature in batch cultures",
                                "describe determination of minimum inhibitory concentration of SNP at high temperature and salinity in serum bottles",
                                "describe chemical reaction of SNP and sulfide",
                                "describe SNP kill of SRB and acid producing bacteria, corrosion inhibition, and comparison of SNP with other compounds"
                            ]
                        },
                        {
                            "title": "Results and Discussion",
                            "paragraphs": [
                                "Souring Control in Oil Bioreactors",
                                "Sulfide and sulfate concentrations in the effluent and at the different ports were recorded during flooding of oil-containing bioreactors, which contained an active SRB consortium, with CSBK-S. Injection of 2PV (240 ml) of CSBK-S with 85 ppm (1 mM) or 170 ppm (2 mM) of nitrate did not affect the sulfide concentration in the effluent (FIG. 2A). However, inhibition of sulfate reduction was observed with injection of 2 PV (240 ml) of 340 ppm (4 mM) of nitrate (FIG. 2A). Only partial conversion of sulfate to sulfide was observed at port 1, whereas almost complete conversion of sulfate to sulfide was observed at port 2 for all three nitrate concentrations (0, 85 and 170 ppm). The injection of 2 PV (240 ml) of CSBK-S with 50 ppm (0.17 mM) of SNP resulted in souring control, which lasted long after injection of SNP was terminated at 40 days (FIG. 2). Sulfide concentrations decreased to zero at 45 days and sulfate concentrations reached 2 mM at 48 days (FIG. 2B) after which sulfide concentrations in the effluent slowly increased again. In the absence of SNP partial reduction of sulfate to sulfide was observed at port 1. Amendment with 10 ppm of SNP pushed sulfate reduction to port 3 while 50 ppm completely inhibited sulfate reduction at all the ports and in the effluent (FIGS. 3C and 3D).",
                                "Hence, when used singly, 340 ppm of nitrate and 50 ppm of SNP inhibited sulfate reduction in bioreactors in which oil was the electron donor. However, combinations of nitrate and SNP proved to be more efficient. A combination of 1 ppm of SNP and 85 ppm (1 mM) of sodium nitrate inhibited souring in effluent of the bioreactors (FIG. 2C), as well as at ports 1 to 6 (FIGS. 3 E and F). Inhibition was also observed with 1 ppm of SNP and 170 ppm (2 mM) of sodium nitrate, but not in this example with 1 ppm of SNP and 43 ppm (0.5 mM) of sodium nitrate. (FIG. 2C, FIGS. 3 E and F). These results exemplify a strong synergistic inhibitory effect on SRB when SNP is used in combination with nitrate. This synergistic effect facilitates the use of minimized doses of SNP and/or nitrate to inhibit SRB, minimizing costs associated with souring control and decreasing potential environmental impacts from using higher doses. The result also indicate that, in the exemplified embodiments, SNP is not reacting in a significant fashion with oil components, so that it maintained an inhibitory activity in the presence of hydrocarbons. Therefore, as low as 1-10 ppm of SNP when combined with 100-200 ppm of nitrate can be used as a metabolic inhibitor of SRB activities in reservoirs where souring is detected.",
                                "Effect of SNP on Batch Cultures of Mesophilic SRB",
                                "The minimum concentration of SNP required to inhibit growth of SRB consortia in serum bottles is exemplified at the start and in the middle of the growth curve. When SNP was added to the culture at the start, very low concentrations (less than 25 μM; 7.45 ppm) were required to inhibit the growth of SRB. Sulfate reduction or sulfide accumulation was incomplete at 25 μM and was not observed at and above 50 μM (14.9 ppm) (FIG. 4A, 4B). This indicates that a minimum concentration of SNP may be determined for use in particular circumstances, and in the exemplified embodiment 50 μM of SNP is required to inhibit SRB activity when added to culture medium with little SRB biomass. Compared with other compounds, such as BAC, Glut, BAC_Glut, THPS and Coco, an SNP dosage of 10 ppm completely inhibited the metabolic activity and growth of SRB as judged by a low sulfide, and high sulfate and lactate concentrations (FIG. 5A-C), whereas other compounds were not effective at this low dosage.",
                                "When added to batch cultures of SRB in serum bottles at mid-log phase, an SNP concentration of 0.1 mM (29.8 ppm) extended the time needed for complete sulfate reduction from 5 to 20 days (FIGS. 6A and 6B). No sulfate reduction, or accumulation of sulfide was observed at SNP concentrations of 0.5 and 1.0 mM (FIGS. 6A and 6B). No increase in protein concentration was observed at these concentrations, illustrating that SNP inhibits the growth of SRB and other bacteria (FIG. 6C).",
                                "Accumulation of 0.1 and 0.2 mM nitrate was detected in mid-log phase cultures following addition of 0.5 or 1 mM SNP, respectively (FIG. 7), whereas accumulation of 0.1 mM nitrite was detected with 1 mM SNP only. Nitrate or nitrite accumulation was not detected in cultures to which lower concentrations of SNP were added.",
                                "Concentration-Dependent Inhibition of Thermophilic SRM",
                                "To illustrate the applicability of SNP at high temperature and salinity, concentration dependent inhibition of a culture of thermophilic sulfate-reducing microorganisms (tSRM) was determined at 60° C. in CSBA medium with 0.5 M NaCl. The inhibition of tSRM was observed al lower SNP concentrations than that of mesophilic SRB. Reduction of sulfate to sulfide was not observed at and above 0.05 mM SNP (FIG. 8A, 8B), whereas this was between 0.1 and to 0.5 mM for mSRB. SNP reacted chemically with sulfide at 60° C. as illustrated by the immediate decrease of sulfide concentration upon addition of SNP. This decrease was also observed at low temperature (FIG. 6B), but at higher SNP concentrations. These results illustrate that SNP inhibits and/or kills tSRM and removes sulfide already formed at high temperature conditions. This characteristic may for example be utilized in embodiments such as high temperature oil reservoirs flooded with seawater, which has approximately 0.5 M NaCl. Unlike at low temperature conditions, complete removal of sulfide was not observed at high temperature even in the presence of 1 mM SNP (FIG. 8).",
                                "Chemical Reaction of SNP with Sulfide",
                                "An important finding illustrated by this example is that SNP not only inhibits and kills SRB but, under certain conditions, may also chemically react with the sulfide formed. Addition of SNP to a sour system generated transient formation of multiple reaction products with distinct colors. Upon addition of 0.5 mM SNP to 2 mM sulfide, a Prussian blue type color was immediately formed, which changed to a dark blue color within a minute. In this example, the dark blue color changed to dark green within 1 h and then to a brownish color over 24 h, which remained stable. These changes in color indicated the occurrence of chemical reactions between SNP and sulfide, which is also evident from the disappearance of sulfide and removal of the typical H2S smell from the bottles. Addition of 2 mM SNP to 2 mM sulfide resulted in disappearance of all sulfide within 2 h and a decrease of SNP concentration from 2 to 1.2 mM (FIGS. 9A and 9B).",
                                "Effect of SNP on MPNs of SRB and APB",
                                "Determination of MPNs illustrates that SNP effectively killed SRB and APB. The killing of SRB was about 103-fold within 10 min and 109-fold or more after 1 h (FIG. 10A). Similarly, APB killing was about 103-fold within 10 min, 105- to 106-fold within 1 h and more than 109-fold after 24 h (FIG. 10B). The result illustrates that SNP kills SRB more effectively than APB.",
                                "SNP-Mediated Corrosion",
                                "The corrosivity of SNP was tested on steel coupons in the presence or absence of sulfide. General corrosion rates of coupons increased from 0.0015 to 0.009 mm/yr with increasing concentrations of SNP in the absence of sulfide (FIG. 11). Relative to other compounds, SNP was more corrosive to carbon steel beads in the absence of sulfide (FIG. 5D). Interestingly, addition of up to 1 mM SNP to a sour medium decreased the corrosion rates of carbon steel coupons from 0.008 to 0.002 mm/yr (FIG. 11). In particular, addition of 0.5 or 1 mM of SNP decreased corrosion to a rate comparable to that of the abiotic control with no sulfide or SNP (0.0018 mm/yr). These results illustrate that SNP may be used so as to decrease corrosion when added to a sour system."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "record sulfide and sulfate concentrations",
                                "observe inhibition of sulfate reduction",
                                "describe souring control with SNP",
                                "discuss effect of nitrate on souring control",
                                "illustrate synergistic inhibitory effect",
                                "determine minimum SNP concentration",
                                "compare SNP with other compounds",
                                "describe effect of SNP on batch cultures",
                                "observe accumulation of nitrate and nitrite",
                                "illustrate concentration-dependent inhibition",
                                "describe chemical reaction of SNP with sulfide",
                                "determine effect of SNP on MPNs of SRB and APB",
                                "illustrate SNP-mediated corrosion",
                                "compare corrosion rates with other compounds",
                                "discuss application of SNP in sour systems"
                            ],
                            "num_characters": 7843,
                            "outline_medium": [
                                "present souring control in oil bioreactors",
                                "discuss effect of SNP on batch cultures of mesophilic SRB",
                                "illustrate concentration-dependent inhibition of thermophilic SRM",
                                "describe chemical reaction of SNP with sulfide",
                                "discuss effect of SNP on MPNs of SRB and APB",
                                "present SNP-mediated corrosion",
                                "summarize results of souring control experiments"
                            ],
                            "outline_short": [
                                "present souring control experiments",
                                "discuss effect of SNP on SRB growth and inhibition",
                                "illustrate SNP-mediated corrosion and chemical reactions"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce compositions of nitroprusside salt and nitrate salt",
                        "describe synergistic combinations of nitroprusside and nitrate",
                        "outline methods for combined use of nitroprusside and nitrate",
                        "describe inhibition of microbial metabolism",
                        "exemplify application in oil reservoir or connate or produced water environments",
                        "describe nitroprusside salts available for use",
                        "describe nitrate salts available for use",
                        "outline concentrations of SNP and nitrate for inhibiting microbial growth"
                    ],
                    "num_characters": 4100,
                    "outline_medium": [
                        "introduce compositions of nitroprusside salts and nitrate salts",
                        "describe methods for combined use of nitroprusside salts and nitrate salts",
                        "provide examples of synergistic combinations of SNP and nitrate",
                        "describe applications of SNP and nitrate in oil field systems"
                    ],
                    "outline_short": [
                        "describe compositions of nitroprusside salts and nitrate salts",
                        "describe methods for combined use of nitroprusside salts and nitrate salts"
                    ]
                },
                {
                    "title": "CONCLUSIONS",
                    "paragraphs": [
                        "The foregoing Examples illustrate a strong synergistic effect of SNP and nitrate. Together, these are potent metabolic inhibitors of SRB activity, as exemplified in heavy-oil containing reservoir models. SNP also strongly inhibited SRB activity in batch cultures. In heavy-oil containing columns, SRB activity was completely inhibited by an SNP concentration of 1 ppm when combined with 170 ppm of nitrate. Individually, in the exemplified embodiment, 50 ppm of SNP and 340 ppm of nitrate were capable of complete inhibition of SRB activity in oil bioreactors. The low dose of 1 ppm of SNP, when combined with 170 ppm nitrate, to control souring in the presence of oil illustrates that the efficacy of SNP is sustained in the presence of hydrocarbons, such as oil or components thereof. In batch cultures in which VFA (not oil) were used as electron donor for sulfate reduction, SRB activity was completely inhibited by an SNP concentration of 0.05 mM (14.9 ppm) in serum bottles when applied early in the growth curve, whereas 0.5 mM (149 ppm) was capable of inhibiting mid-log phase cultures (5 mM sulfide). The MPNs of both SRB and APB were below the detection limit (109-fold decrease) after 24 h of exposure to 0.5 mM (149 ppm) SNP. SNP was also effective in controlling activity of tSRB at 60° C. and 0.5 M NaCl.",
                        "SNP is chemically reactive to steel in the absence of sulfide, which may be a factor taken into consideration when applying high concentration slugs to pipelines, for instance. Importantly, SNP inhibited steel corrosion when applied to a sour system at low concentration, which is of great importance in removing sulfide and protecting sulfide-mediated pipeline corrosion in sour reservoirs and oil processing facilities.",
                        "As exemplified, SNP concentrations from 0.1 to 0.5 mM (29.8 to 149 ppm) were effective both in inhibiting the growth of SRB and in eliminating sulfide by chemically reacting in sour systems (2 mM sulfide). Accordingly, in one aspect of the present innovation, lower concentrations of SNP may be used to inhibit SRB than the occupational exposure limit, such as 5 ppm. In some applications, SNP may be applied so as to have a relatively short half-life and decay into common C, N, O, and S containing compounds.",
                        "Although various embodiments of the invention are disclosed herein, many adaptations and modifications may be made within the scope of the invention in accordance with the common general knowledge of those skilled in this art. Such modifications include the substitution of known equivalents for any aspect of the invention in order to achieve the same result in substantially the same way. Numeric ranges are inclusive of the numbers defining the range. The word “comprising” is used herein as an open-ended term, substantially equivalent to the phrase “including, but not limited to”, and the word “comprises” has a corresponding meaning. As used herein, the singular forms “a”, “an” and “the” include plural referents unless the context clearly dictates otherwise. Thus, for example, reference to “a thing” includes more than one such thing. Citation of references herein is not an admission that such references are prior art to the present invention. Any priority document(s) and all publications, including but not limited to patents and patent applications, cited in this specification, or cited by the documents cited herein, are incorporated herein by reference as if each individual publication were specifically and individually indicated to be incorporated by reference herein and as though fully set forth herein. The invention includes all embodiments and variations substantially as hereinbefore described and with reference to the examples and drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "illustrate synergistic effect of SNP and nitrate",
                        "inhibit SRB activity in batch cultures",
                        "inhibit SRB activity in heavy-oil containing columns",
                        "control souring in presence of oil",
                        "inhibit SRB activity in VFA batch cultures",
                        "control activity of tSRB at 60° C and 0.5 M NaCl",
                        "inhibit steel corrosion in sour systems"
                    ],
                    "num_characters": 3724,
                    "outline_medium": [
                        "illustrate synergistic effect of SNP and nitrate",
                        "describe inhibition of SRB activity",
                        "discuss application of SNP in sour systems"
                    ],
                    "outline_short": [
                        "summarize synergistic effect of SNP and nitrate"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. Use of a nitroprusside and a nitrate in combination for the metabolic inhibition of a microbial culture.",
        "2. The use according to claim 1, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "3. The use according to claim 1, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "4. The use according to any one of claims 1 to 3, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "5. The use according to any one of claims 1 to 3, wherein the nitrate is sodium or potassium nitrate or solvate thereof.",
        "6. The use according to any one of claims 1 to 5, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "7. The use according to any one of claims 1 to 6, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "8. The use according to claim 7, wherein the SRM culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "9. The use according to claim 7 or 8, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "10. The use according to any one of claims 1 to 9, wherein the microbial culture is an aqueous microbial culture.",
        "11. The use according to claim 10, wherein the aqueous microbial culture is saline.",
        "12. The use according to claim 11, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "13. The use according to any one of claims 1 to 12, wherein the microbial culture comprises a metabolisable hydrocarbon.",
        "14. The use according to claim 13, wherein the hydrocarbon comprises an oil.",
        "15. The use according to claim 14, wherein the hydrocarbon comprises a heavy oil.",
        "16. The use according to any one of claims 13 to 15, wherein the microbial culture is in a hydrocarbon-containing system.",
        "17. The use according to claim 16, wherein the hydrocarbon-containing system comprises a reservoir.",
        "18. The use according to claim 16 or 17, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "19. The use according to any one of claims 13 to 18, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "20. Use of a nitroprusside for the metabolic inhibition of a microbial culture, wherein the microbial culture comprises a metabolisable hydrocarbon.",
        "21. The use according to claim 20, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "22. The use according to claim 20, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "23. The use according to any one of claims 20 to 22, wherein the nitroprusside is for use in combination with a nitrate.",
        "24. The use according to claim 23, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "25. The use according to claim 23, wherein the nitrate is sodium or potassium nitrate or a solvate thereof.",
        "26. The use according to any one of claims 23 to 25, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "27. The use according to any one of claims 20 to 26, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "28. The use according to claim 27, wherein the SRM culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "29. The use according to claim 27 or 28, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "30. The use according to any one of claims 20 to 29, wherein the microbial culture is an aqueous microbial culture.",
        "31. The use according to claim 30, wherein the aqueous microbial culture is saline.",
        "32. The use according to claim 31, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "33. The use according to any one of claims 20 to 32, wherein the metabolisable hydrocarbon comprises an oil.",
        "34. The use according to claim 33, wherein the hydrocarbon comprises a heavy oil.",
        "35. The use according to any one of claims 20 to 34, wherein the microbial culture is in a hydrocarbon-containing system.",
        "36. The use according to claim 35, wherein the hydrocarbon-containing system comprises a reservoir.",
        "37. The use according to claim 35 or 36, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "38. The use according to any one of claims 20 to 37, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "39. Use of a nitroprusside to inhibit metal corrosion in a hydrocarbon-containing system comprising a sulfide and a microbial culture, wherein the microbial culture comprises a metabolisable hydrocarbon.",
        "40. The use according to claim 39, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "41. The use according to claim 39, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "42. The use according to any one of claims 39 to 41, wherein the nitroprusside is for use in combination with a nitrate.",
        "43. The use according to claim 42, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "44. The use according to claim 43, wherein the nitrate is sodium or potassium nitrate or a solvate thereof.",
        "45. The use according to any one of claims 42 to 44, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "46. The use according to any one of claims 39 to 45, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "47. The use according to claim 46, wherein the SRM culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "48. The use according to claim 46 or 47, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "49. The use according to any one of claims 39 to 48, wherein the microbial culture is an aqueous microbial culture.",
        "50. The use according to claim 49, wherein the aqueous microbial culture is saline.",
        "51. The use according to claim 50, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "52. The use according to any one of claims 39 to 51, wherein the metabolisable hydrocarbon comprises an oil.",
        "53. The use according to claim 52, wherein the hydrocarbon comprises a heavy oil.",
        "54. The use according to any one of claims 39 to 53, wherein the hydrocarbon-containing system comprises a reservoir.",
        "55. The use according to any one of claims 39 to 54, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "56. The use according to any one of claims 39 to 55, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "57. The use according to any one of claims 1 to 56, wherein the nitroprusside is for use in an amount of at least 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 ppm.",
        "58. The use according to claim 57, wherein the nitroprusside is for use in combination with at least 100, 110, 120, 130, 140, 150, 160, 170, 180, 190 or 200 ppm nitrate.",
        "59. A method of inhibiting the metabolism of a microbial culture, comprising applying an effective amount of a combination of a nitroprusside and a nitrate to the microbial culture.",
        "60. The method of claim 59, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "61. The method of claim 59, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "62. The method of any one of claims 59 to 61, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "63. The method of any one of claims 59 to 61, wherein the nitrate is sodium or potassium nitrate or solvate thereof.",
        "64. The method of any one of claims 59 to 63, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "65. The method of any one of claims 59 to 64, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "66. The method of claim 65, wherein the SRB culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "67. The method of claim 65 or 66, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "68. The method of any one of claims 59 to 67, wherein the microbial culture is an aqueous microbial culture.",
        "69. The method of claim 68, wherein the aqueous microbial culture is saline.",
        "70. The method of claim 69, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "71. The method of any one of claims 59 to 70, wherein the microbial culture comprises a metabolisable hydrocarbon.",
        "72. The method of claim 71, wherein the hydrocarbon comprises an oil.",
        "73. The method of claim 72, wherein the hydrocarbon comprises a heavy oil.",
        "74. The method of any one of claims 71 to 73, wherein the microbial culture is in a hydrocarbon-containing system.",
        "75. The method of claim 74, wherein the hydrocarbon-containing system comprises a reservoir.",
        "76. The method of claim 74 or 75, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "77. The method of any one of claims 71 to 76, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "78. A method of inhibiting the metabolism of a microbial culture, wherein the microbial culture comprises a metabolisable hydrocarbon, comprising applying an effective amount of a nitroprusside to the microbial culture.",
        "79. The method of claim 78, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "80. The method of claim 78, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "81. The method of any one of claims 78 to 80, wherein the nitroprusside is for use in combination with a nitrate.",
        "82. The method of claim 81, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "83. The method of claim 81, wherein the nitrate is sodium or potassium nitrate or a solvate thereof.",
        "84. The method of any one of claims 81 to 83, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "85. The method of any one of claims 78 to 84, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "86. The method of claim 85, wherein the SRM culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "87. The method of claim 85 or 86, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "88. The method of any one of claims 78 to 87, wherein the microbial culture is an aqueous microbial culture.",
        "89. The method of claim 88, wherein the aqueous microbial culture is saline.",
        "90. The method of claim 89, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "91. The method of any one of claims 78 to 90, wherein the metabolisable hydrocarbon comprises an oil.",
        "92. The method of claim 91, wherein the hydrocarbon comprises a heavy oil.",
        "93. The method of any one of claims 78 to 92, wherein the microbial culture is in a hydrocarbon-containing system.",
        "94. The method of claim 93, wherein the hydrocarbon-containing system comprises a reservoir.",
        "95. The method of claim 93 or 94, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "96. The method of any one of claims 78 to 95, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "97. A method of inhibiting metal corrosion in a hydrocarbon-containing system comprising a sulfide and a microbial culture, wherein the microbial culture comprises a metabolisable hydrocarbon, and wherein the method comprises applying an effective amount of a nitroprusside to the microbial culture.",
        "98. The method of claim 97, wherein the nitroprusside is an alkali metal nitroprusside or a solvate thereof.",
        "99. The method of claim 97, wherein the nitroprusside is sodium nitroprusside (SNP) or a solvate thereof.",
        "100. The method of any one of claims 97 to 99, wherein the nitroprusside is for use in combination with a nitrate.",
        "101. The method of claim 100, wherein the nitrate is an alkali metal nitrate or solvate thereof.",
        "102. The method of claim 101, wherein the nitrate is sodium or potassium nitrate or a solvate thereof.",
        "103. The method of any one of claims 100 to 102, wherein the nitroprusside and the nitrate are for use in a synergistic combination, that synergistically inhibits the metabolism of the microbial culture.",
        "104. The method of any one of claims 97 to 103, wherein the microbial culture comprises a sulfate reducing microorganism (SRM), forming a SRM culture.",
        "105. The method of claim 104, wherein the SRM culture comprises one or more of a Desulfobacterales, Desulfovibrionales, Syntrophobacterales, Desulfotomaculum, Desulfosporomusa, Desulfosporosinus, Thermodesulfovibrio, Thermodesulfobacteria, Thermodesulfobium, Archaeoglobus, Thermocladium or Caldivirga species or other species of Bacteria or Archaea.",
        "106. The method of claim 104 or 105, wherein the production of sulfides by the SRB culture is inhibited by the nitroprusside and nitrate.",
        "107. The method of any one of claims 97 to 106, wherein the microbial culture is an aqueous microbial culture.",
        "108. The method of claim 107, wherein the aqueous microbial culture is saline.",
        "109. The method of claim 108, wherein the saline aqueous microbial culture comprises at least 0.1, 0.2, 0.3, 0.4 or 0.5 M NaCl",
        "110. The method of any one of claims 97 to 109, wherein the metabolisable hydrocarbon comprises an oil.",
        "111. The method of claim 110, wherein the hydrocarbon comprises a heavy oil.",
        "112. The method of any one of claims 97 to 111, wherein the hydrocarbon-containing system comprises a reservoir.",
        "113. The method of any one of claims 97 to 112, wherein the hydrocarbon-containing system comprises a petroleum handling facility.",
        "114. The method of any one of claims 97 to 113, wherein the production of sulfides from the metabolism of the hydrocarbon by the microbial culture is inhibited, or synergistically inhibited, by the nitroprusside and the nitrate.",
        "115. The method of any one of claims 59 to 114, wherein the nitroprusside is for use in an amount of at least 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 ppm.",
        "116. The method of claim 115, wherein the nitroprusside is for use in combination with at least 100, 110, 120, 130, 140, 150, 160, 170, 180, 190 or 200 ppm nitrate."
    ]
}