{
    "id": "US20170269077",
    "authors": [
        "John J. Rajasekaran",
        "Vasanth Jayaraman",
        "Kang Bei",
        "Tianhao Wang",
        "Karthik Krishna",
        "Hari Krishnan Krishnamurthy"
    ],
    "title": "PEPTIDE MICROARRAYS AND NOVEL BIOMARKERS FOR CELIAC DISEASE",
    "date": "2015-09-10 00:00:00",
    "abstract": "The present disclosure relates generally to biomarkers and peptide arrays, and, more particularly, to a method of using a peptide array to identify biomarkers for an autoimmune disease such as, e.g., celiac disease. Furthermore, a set of novel biomarkers for celiac disease, having high sensitivity and specificity, are disclosed in addition to method of treatment using the novel biomarkers.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The development of accurate, inexpensive, and high fidelity tools for biomarker discovery for routine diagnostic assays to detect the presence of an autoimmune disease is crucial to meet the clinical needs of early detection of disease for developing a preventative strategy. Detection of antibodies correlated with an autoimmune disease through binding to the biomarkers is one of the main approaches for the diagnosis of many diseases, including autoimmune disorders, infectious diseases, and cancers.1-3 Indeed, the development of antibody-based diagnostic assays has been intensively pursued for the diagnosis and treatment of disease, however only a small number of biomarkers have been identified as effective disease markers.1,4 There are many challenges to the development of biomarkers, such as heterogeneity of antibodies, variability of host responses, and reagents among others. However, improved methods of discovery of biomarkers and improved biomarkers for diagnosis and treatment of disease are needed to better identify and treat patient populations.",
                        "One such autoimmune disease is celiac disease. Celiac disease, also known as coeliac disease or celiac sprue (coeliac sprue), affects approximately 1% of people in Europe and North America. In many of those affected, celiac disease is unrecognised, but this clinical oversight is now being rectified with greater clinical awareness. A gluten free diet is the only current treatment for celiac disease, and because regular ingestion of as little as 50 mg of gluten (equivalent to 1/100th of a standard slice of bread) damages the small intestine, chronic inflammation of the small bowel is commonplace in subjects on a gluten free diet. Persistent inflammation of the small intestine has been shown to increase the risk of cancer, osteoporosis and death. As gluten is so widely used, for example, in commercial soups, sauces, ice-creams, etc., maintaining a gluten free diet is difficult. Therefore novel epitopes for diagnosis and treatment of celiac disease are needed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate biomarker discovery",
                        "describe limitations of current diagnostic assays",
                        "introduce celiac disease",
                        "highlight need for novel epitopes"
                    ],
                    "num_characters": 2039,
                    "outline_medium": [
                        "motivate biomarker discovery for autoimmune diseases",
                        "describe limitations of current biomarkers for celiac disease"
                    ],
                    "outline_short": [
                        "motivate biomarker discovery for autoimmune diseases"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Provided herein are novel polypeptide arrays for detection or diagnosis of celiac disease in a subject. In certain embodiments, an array of features attached to a surface at positionally-defined locations is provided, the features comprising at least one engineered polypeptide chain comprising at least two epitope sequences from a bioactive polypeptide that generates an immune response in subject having celiac disease, wherein the polypeptide chain further comprises at least one randomly generated polypeptide sequence. In an embodiment, the bioactive polypeptide is selected from the group consisting of: alpha gliadin, beta gliadin, gamma gliadin, and omega gliadin. In an embodiment, the at least one engineered polypeptide chain comprises at least 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 30, 40, 50, 60, 70, 80, 90, or 100 sequences selected from the group consisting of SEQ ID NOS: 1-127, or a biologically active fragment or variant of any one or more thereof.",
                        "In some embodiments, the features are from 6 to 15 amino acids in length. In an embodiment, the features are 12 amino acids in length. In some embodiments, the features attached to the surface of the array are configured to have at least 90% sensitivity and 90% specificity for detection of celiac disorder after contact of the features with a sample from a subject suspected of having celiac disorder. In some embodiments, each of the at least two discontinuous epitopes consists of three amino acids. In some embodiments, each of the at least two discontinuous epitopes consists of 3, 4, 5, 6, 7, 8, 9, 10, or 11 amino acids. In an embodiment, each of the at least two discontinuous epitopes consists of 3 amino acids with at least 20% sensitivity for binding to an antibody in a celiac positive sample, wherein the peptide chain is 7, 8, 9, 10, 11, 12, 13, 14, or 15 amino acids in length.",
                        "In some embodiments, the array further comprises at least 10,000 features, each feature is attached to a surface of the array at a different positionally-defined location, the positionally defined location of each feature corresponds to a positionally-defined location of a pillar, wherein the top surface of each pillar is at least 1 μm2 in size. In some embodiments, each feature comprises a different engineered peptide chain compared to the other features, each feature comprises at least 500 identical full-length peptide chains, wherein each identical full-length peptide chain has an engineered full-length of at least 7 amino acids in length, and the purity of each feature with regards to the fraction of full-length engineered peptide chains is a fraction F of the full-length engineered peptide chains of each feature having a engineered sequence and a engineered full-length sequence length N being characterized by F=10(N+1)·log(E/100%) with an average coupling efficiency E of at least 98.5% for coupling each amino acid of the engineered sequence, and the sequence length N being at least 7 amino acids in length, the fraction of the less than full-length engineered peptide chains equaling (1-F)",
                        "In some embodiments, the surface of the array comprises a substrate, the substrate comprising: a planar layer having an upper surface and a lower surface, and a plurality of pillars operatively coupled to the layer in the positionally-defined locations, wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between 1,000-5,000 angstroms, and wherein the plurality of pillars are present at a density of greater than 10,000/cm2.",
                        "Also provided herein is a method of identifying novel epitopes for binding to an antibody associated with an autoimmune disorder, the method comprising: synthesizing a plurality of polypeptides on a first array, the plurality of polypeptides comprising overlapping polypeptide sequences from a protein suspected of comprising epitopes that bind to an antibody associated with an immune disorder; contacting the first array with a first sample from a subject with the immune disorder; determining which of the overlapping polypeptide sequences are bound to an antibody from the first sample to generate binding data; analyzing the binding data to identify a plurality of continuous epitopes in the protein; further analyzing each of the plurality of continuous epitopes to identify a plurality of discontinuous epitope pairs with the highest sensitivity (false positive rate) of binding to the antibody from the sample, thereby identifying novel epitopes for binding to the antibody associated with the autoimmune disorder.",
                        "In some embodiments, the method of identifying novel epitopes for binding to an antibody associated with an autoimmune disorder further comprises synthesizing a plurality of synthetic polypeptides on a second array, each synthetic polypeptide comprising at least two of the plurality of discontinuous epitopes, each synthetic polypeptide further comprising a random polypeptide sequence; contacting the second array with a second sample from a subject with the immune disorder; determining the sensitivity (false positive rate) and specificity (false negative rate) of binding of antibodies from the second sample to each of the plurality of synthetic polypeptides; identifying the synthetic polypeptides with the highest sensitivity and/or specificity of binding to an antibody associated with the immune disorder, thereby identifying refined novel epitopes for binding to the antibody associated with the autoimmune disorder.",
                        "In some embodiments, the plurality of polypeptides comprises a deamidated polypeptide sequence from the protein. In an embodiment, the plurality of polypeptides are 6-15 amino acids in length. In an embodiment, the autoimmune disorder is celiac disease. In an embodiment, the antibodies from the first or second sample are IgA or IgG antibodies. In an embodiment, the synthetic polypeptide is 6-15 amino acids in length. In an embodiment, the synthetic polypeptide is 12 amino acids in length. In some embodiments the plurality of continuous epitopes each bind to an antibody in at least 20%, 30%, 40%, or 50% of samples comprising the autoimmune disorder.",
                        "Also provided herein is an array of features attached to a surface at positionally-defined locations, the features comprising at least one novel epitope identified by the methods disclosed herein.",
                        "Also provided herein is a method of identifying an autoimmune disorder in a subject, comprising: contacting a sample from the subject with an array of one or more of the embodiments described herein; and analyzing binding of antibodies in the sample to the features on the array to determine whether the subject has the autoimmune disorder. In some embodiments, the autoimmune disorder is celiac disease. In some embodiments, the method comprises a sensitivity (false positive rate) of detection of the autoimmune disorder of at least 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, or 99%. In some embodiments, the method comprises a specificity (false negative rate) of detection of the autoimmune disorder least 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, or 99%. In some embodiments, the method comprises a sensitivity of detection of the Marsh classification of celiac disorder in the subject of at least 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, or 99%.",
                        "Also provided herein are compositions comprising one or more isolated polypeptides comprising a sequence selected from the group consisting of SEQ ID NOS: 1-127, or biologically active fragments or variants of any one or more thereof.",
                        "Furthermore disclosed are substantially purified and/or recombinant polypeptides comprising an amino acid sequence selected from the group consisting of SEQ ID NOS: 1-127, biologically active fragments or variants of any one or more thereof.",
                        "Methods of treating celiac disorder or a celiac related disorder in a patient are disclosed, comprising administering to said patient a formulation comprising an amino acid sequence selected from the group consisting of SEQ ID NOS: 1-127, or biologically active fragments or variants of any one or more thereof.",
                        "Biomarkers for celiac disease are disclosed comprising a polypeptide epitope for a celiac antibody, wherein the polypeptide epitope is selected from the group consisting of SEQ ID NOS: 1-127, or biologically active fragments or variants of any one or more thereof.",
                        "In some embodiments, the disclosed methods for synthesizing arrays involves generalized de-protection with selective activation, providing benefits, such as a higher fidelity of peptide synthesis and a greatly reduced time requirement for each step. Thus, in some embodiments, it is this combination of high-fidelity synthesis, shorter processing time that may result in a much higher yield and the ability to generate a large number of chips quite inexpensively with very high fidelity required for diagnostic testing.",
                        "Celiac disease is a good model to explore the early stage of disease development as one of the representative autoimmune diseases, because the target protein, gluten, which storage proteins from wheat, barley, and rye, are well known to be immunogenic10-12. While the pathogenesis of celiac disease appears to be T-cell mediated,13 the diagnosis relies on the presence of self-reactive antibodies. The most common antibodies currently in use are directed against host proteins such as tissue transglutaminase (tTG) and endomysium10, and may serve as markers of autoimmunity rather than as participants in the initiation of the disease, which results from responses to gluten proteins.14 Further, the production of these antibodies can be used to predict the stage and severity of disease and to monitor dietary compliance; however, they lack the ability to discriminate amongst clinically relevant phenotypes. Gliadin specific antibodies provide examples that have not shown adequate sensitivity and specificity for the diagnosis of CD. Further, it is not understood how gliadin specific antibodies and epitopes contribute to the pathogenesis of celiac disease, especially in the early stage of development.15-18",
                        "How the pathogenic epitopes are recognized by B cells and evolved in celiac disease may help in understanding both the mechanism of disease initiation and to develop better clinical tools. Such epitopes of gliadin peptides may be modified by transglutaminase and evolved toward being more immunogenic to host. To demonstrate the possibility of a novel technology for identifying the biomarker for CD diagnosis, continuous epitopes of gliadin with post-translational modified peptide sequences, discontinuous peptide sequences, which were combined with peptide sequences of gliadin, and random 3- or 6-mer peptide sequences were synthesized. Methods for identifying the biomarker of CD diagnosis by the novel platform and technology with semiconductor high volume manufacturing process to generate continuous and discontinuous peptide sequences from the established antigen in an autoimmune disease are described herein.",
                        "One skilled in the art will readily recognize from the following discussion that alternative embodiments of the structures and methods illustrated herein may be employed without departing from the principles of the invention described herein."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce polypeptide arrays for celiac disease diagnosis",
                        "describe engineered polypeptide chains",
                        "specify bioactive polypeptide selection",
                        "define epitope sequences",
                        "describe feature attachment to array surface",
                        "specify feature length",
                        "describe sensitivity and specificity of features",
                        "introduce discontinuous epitopes",
                        "describe array configuration",
                        "specify pillar surface and size",
                        "describe method of identifying novel epitopes",
                        "synthesize polypeptides on first array",
                        "contact first array with sample",
                        "determine binding data",
                        "analyze binding data",
                        "identify continuous epitopes",
                        "identify discontinuous epitope pairs",
                        "synthesize synthetic polypeptides on second array",
                        "contact second array with sample",
                        "determine sensitivity and specificity",
                        "identify refined novel epitopes",
                        "provide array of features with novel epitopes"
                    ],
                    "num_characters": 11338,
                    "outline_medium": [
                        "introduce novel polypeptide arrays for celiac disease diagnosis",
                        "describe engineered polypeptide chains with epitope sequences",
                        "specify bioactive polypeptides for celiac disease",
                        "describe feature length and sensitivity",
                        "introduce array with positionally-defined locations",
                        "describe pillars on array surface",
                        "outline method for identifying novel epitopes",
                        "describe synthesizing polypeptides on array",
                        "outline method for identifying refined novel epitopes",
                        "introduce array for identifying autoimmune disorder",
                        "describe method for treating celiac disorder"
                    ],
                    "outline_short": [
                        "introduce novel polypeptide arrays for celiac disease diagnosis",
                        "describe engineered polypeptide chains with epitope sequences",
                        "outline array features and configurations",
                        "summarize method for identifying novel epitopes",
                        "describe applications of novel epitopes and arrays"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Terms and Definitions",
                            "paragraphs": [
                                "Terms used in the claims and specification are defined as set forth below unless otherwise specified.",
                                "As used herein the term “wafer” refers to a slice of semiconductor material, such as silicon or a germanium crystal generally used in the fabrication of integrated circuits. Wafers can be in a variety of sizes from, e.g., 25.4 mm (1 inch) to 300 mm (11.8 inches) along one dimension with thickness from, e.g., 275 μm to 775 μm.",
                                "As used herein the term “photoresist” or “resist” or “photoactive material” refers to a light-sensitive material that changes its solubility in a solution when exposed to ultra violet or deep ultra violet radiation. Photoresists are organic or inorganic compounds that are typically divided into two types: positive resists and negative resists. A positive resist is a type of photoresist in which the portion of the photoresist that is exposed to light becomes soluble to the photoresist developer. The portion of the photoresist that is unexposed remains insoluble to the photoresist developer. A negative resist is a type of photoresist in which the portion of the photoresist that is exposed to light becomes insoluble to the photoresist developer. The unexposed portion of the photoresist is dissolved by the photoresist developer.",
                                "As used herein the term “photomask” or “reticle” or “mask” refers to an opaque plate with transparent patterns or holes that allow light to pass through. In a typical exposing process, the pattern on a photomask is transferred onto a photoresist.",
                                "As used herein the term “coupling molecule” or “monomer molecule” includes any natural or artificially synthesized amino acid with its amino group protected with a fluorenylmethyloxycarbonyl group or a t-butoxycarbonyl group. These amino acids may have their side chains protected as an option. Examples of coupling molecules include Boc-Gly-Oh, Fmoc-Trp-Oh. Other examples are described below.",
                                "As used herein the term “coupling” or “coupling process” or “coupling step” refers to a process of forming a bond between two or more molecules such as a linking molecule or a coupling molecule. A bond can be a covalent bond such as a peptide bond. A peptide bond can be a chemical bond formed between two molecules when the carboxyl group of one coupling molecule reacts with the amino group of the other coupling molecule, releasing a molecule of water (H2O). This is a dehydration synthesis reaction (also known as a condensation reaction), and usually occurs between amino acids. The resulting CO—NH bond is called a peptide bond, and the resulting molecule is an amide.",
                                "As used herein the terms “biomolecule,” “polypeptide,” “peptide,” or “protein” are used interchangeably to describe a chain or polymer of amino acids that are linked together by bonds. Accordingly, the term “peptide” as used herein includes a dipeptide, tripeptide, oligopeptide, and polypeptide. The term “peptide” is not limited to any particular number of amino acids. In some embodiments, a peptide contains about 2 to about 50 amino acids, about 5 to about 40 amino acids, about 5 to about 20 amino acids, or about 7 to about 15 amino acids. A molecule, such as a protein or polypeptide, including an enzyme, can be a “native” or “wild-type” molecule, meaning that it occurs naturally in nature; or it may be a “mutant,” “variant,” “derivative,” or “modification,” meaning that it has been made, altered, derived, or is in some way different or changed from a native molecule or from another molecule such as a mutant.",
                                "As used herein the term “linker molecule” or “spacer molecule” includes any molecule that does not add any functionality to the resulting peptide but spaces and extends out the peptide from the substrate, thus increasing the distance between the substrate surface and the growing peptide. This generally reduces steric hindrance with the substrate for reactions involving the peptide (including uni-molecular folding reactions and multi-molecular binding reactions) and so improves performance of assays measuring one or more embodiments of peptide functionality.",
                                "As used herein the term “developer” refers to a solution that can selectively dissolve the materials that are either exposed or not exposed to light. Typically developers are water-based solutions with minute quantities of a base added. Examples include tetramethyl ammonium hydroxide in water-based developers. Developers are used for the initial pattern definition where a commercial photoresist is used. Use of developers is described in Example 1 below.",
                                "As used herein the term “protecting group” includes a group that is introduced into a molecule by chemical modification of a functional group in order to obtain chemoselectivity in a subsequent chemical reaction. Chemoselectivity refers to directing a chemical reaction along a desired path to obtain a pre-selected product as compared to another. For example, the use of tboc as a protecting group enables chemoselectivity for peptide synthesis using a light mask and a photoacid generator to selectively remove the protecting group and direct pre-determined peptide coupling reactions to occur at locations defined by the light mask.",
                                "As used herein the term “microarrays” refers to a substrate on which different probe molecules of protein or specific DNA binding sequences have been affixed at separate locations in an ordered manner thus forming a microscopic array.",
                                "As used herein the term “microarray system” refers to a system usually comprised of biomolecular probes formatted on a solid planar surface like glass, plastic or silicon chip plus the instruments needed to handle samples (automated robotics), to read the reporter molecules (scanners) and analyze the data (bioinformatic tools).",
                                "As used herein the term “patterned region” or “pattern” or “location” refers to a region on the substrate on which are grown different features. These patterns can be defined using photomasks.",
                                "As used herein the term “derivatization” refers to the process of chemically modifying a surface to make it suitable for biomolecular synthesis. Typically derivatization includes the following steps: making the substrate hydrophilic, adding an amino silane group, and attaching a linker molecule.",
                                "As used herein the term “capping” or “capping process” or “capping step” refers to the addition of a molecule that prevents the further reaction of the molecule to which it is attached. For example, to prevent the further formation of a peptide bond, the amino groups are typically capped with an acetic anhydride molecule.",
                                "As used herein the term “diffusion” refers to the spread of a chemical through random motion from regions of higher concentration to regions of lower concentration.",
                                "As used herein the term “dye molecule” refers to a dye which typically is a colored substance that can bind to a substrate. Dye molecules can be useful in detecting binding between a feature on an array and a molecule of interest.",
                                "As used herein, the terms “immunological binding” and “immunological binding properties” refer to the type of non-covalent interactions that occurs between an immunoglobulin molecule (or variant thereof such as an scFv) and an antigen for which the immunoglobulin is specific.",
                                "As used herein the term “biological sample” refers to a sample derived from biological tissue or fluid that can be assayed for an analyte(s) of interest. Such samples include, but are not limited to, sputum, amniotic fluid, blood, blood cells (e.g., white cells), tissue or fine needle biopsy samples, urine, peritoneal fluid, and pleural fluid, or cells therefrom. Biological samples may also include sections of tissues such as frozen sections taken for histological purposes. Although the sample is typically taken from a human patient, the assays can be used to detect analyte(s) of interest in samples from any organism (e.g., mammal, bacteria, virus, algae, or yeast) or mammal, such as dogs, cats, sheep, cattle, and pigs. The sample may be pretreated as necessary by dilution in an appropriate buffer solution or concentrated, if desired.",
                                "As used herein, the term “assay” refers to a type of biochemical test that measures the presence or concentration of a substance of interest in solutions that can contain a complex mixture of substances.",
                                "The term “subject” includes inter alia an individual, patient, target, host or recipient regardless of whether the subject is a human or non-human animal including mammalian species and also avian species. The term “subject”, therefore, includes a human, non-human primate (for example, gorilla, marmoset, African Green Monkey), livestock animal (for example, sheep, cow, pig, horse, donkey, goat), laboratory test animal (for example, rat, mouse, rabbit, guinea pig, hamster), companion animal (for example, dog, cat), captive wild animal (for example, fox, deer, game animals) and avian species including poultry birds (for example, chickens, ducks, geese, turkeys). The preferred subject, however, is a human.",
                                "The term “antigen” as used herein refers to a molecule that triggers an immune response by the immune system of a subject, e.g., the production of an antibody by the immune system and/or activation of the cellular arm of the immune system (e.g., activation of phagocytes, natural killer cells, and antigen-specific cytotoxic T-lymphocytes, along with release of various cytokines in response to an antigen). Antigens can be exogenous, endogenous or auto antigens. Exogenous antigens are those that have entered the body from outside through inhalation, ingestion or injection. Endogenous antigens are those that have been generated within previously-normal cells as a result of normal cell metabolism, or because of viral or intracellular bacterial infection. Auto antigens are those that are normal protein or protein complex present in the host body but can stimulate an immune response.",
                                "As used herein the term “epitope” or “immunoactive regions” refers to distinct molecular surface features of an antigen capable of being bound by component of the adaptive immune system, e.g., an antibody or T cell receptor. Antigenic molecules can present several surface features that can act as points of interaction for specific antibodies. Any such distinct molecular feature can constitute an epitope. Therefore, antigens have the potential to be bound by several distinct antibodies, each of which is specific to a particular epitope.",
                                "As used herein the term “antibody” or “immunoglobulin molecule” refers to a molecule naturally secreted by a particular type of cells of the immune system: B cells. There are five different, naturally occurring isotypes of antibodies, namely: IgA, IgM, IgG, IgD, and IgE.",
                                "As used herein the term “immune-related molecule” refers to a biological molecule involved in the activation or regulation of an immune response. These include, for example, an antibody, T cell receptor, or MHC complex (e.g., human leukocyte antigen).",
                                "As used herein, the term “inflammatory response molecule” refers to molecules that signal or mediate an inflammatory response, e.g., cytokines such as interleukin and tumor necrosis factor. Inflammatory response molecules include, for example, pro-inflammatory molecules.",
                                "As used herein, the term “autoimmune disorder” refers to any of a large group of diseases characterized by abnormal functioning of the immune system that causes a subject's immune system to damage the subject's own tissues. Celiac disorder, lupus erythematosis, and rheumatoid arthritis are examples of autoimmune disorders. Autoimmune disorders may be induced by environmental factors.",
                                "The term “percent identity” or “percent sequence identity,” in the context of two or more nucleic acid or polypeptide sequences, refer to two or more sequences or subsequences that have a specified percentage of nucleotides or amino acid residues that are the same, when compared and aligned for maximum correspondence, as measured using one of the sequence comparison algorithms described below (e.g., BLASTP and BLASTN or other algorithms available to persons of skill) or by visual inspection. Depending on the application, the percent “identity” can exist over a region of the sequence being compared, e.g., over a functional domain, or, alternatively, exist over the full length of the two sequences to be compared.",
                                "For sequence comparison, typically one sequence acts as a reference sequence to which test sequences are compared. When using a sequence comparison algorithm, test and reference sequences are input into a computer, subsequence coordinates are designated, if necessary, and sequence algorithm program parameters are designated. The sequence comparison algorithm then calculates the percent sequence identity for the test sequence(s) relative to the reference sequence, based on the designated program parameters.",
                                "Optimal alignment of sequences for comparison can be conducted, e.g., by the local homology algorithm of Smith & Waterman, Adv. Appl. Math. 2:482 (1981), by the homology alignment algorithm of Needleman & Wunsch, J. Mol. Biol. 48:443 (1970), by the search for similarity method of Pearson & Lipman, Proc. Nat'l. Acad. Sci. USA 85:2444 (1988), by computerized implementations of these algorithms (GAP, BESTFIT, FASTA, and TFASTA in the Wisconsin Genetics Software Package, Genetics Computer Group, 575 Science Dr., Madison, Wis.), or by visual inspection (see generally Ausubel et al., infra).",
                                "One example of an algorithm that is suitable for determining percent sequence identity and sequence similarity is the BLAST algorithm, which is described in Altschul et al., J. Mol. Biol. 215:403-410 (1990). Software for performing BLAST analyses is publicly available through the National Center for Biotechnology Information website. Percent identity scores can be calculated using default values for this program as available on the National Center for Biotechnology Information website as of the priority date of this application.",
                                "As used herein the term “biologically active fragment” or variant thereof refers to a polypeptide capable of generating a substantially equal or greater T cell response in a subject sensitive to gluten as the polypeptide (e.g., gliadin) from which it is derived. In another embodiment, biologically active fragments are capable of generating at least 50%, more preferably at least 75% of the T cell response in a subject sensitive to gluten as the polypeptide from which it is derived. In an embodiment, biologically active fragments are 14, 13, 12, 11, 10, 9, 8 and no less than 7 amino acids in length. Deletions and/or additions at either end of any of the peptides are particularly contemplated. Examples of biologically active fragments disclosed herein include SEQ ID NO: 1-127.",
                                "The term “celiac disease” refers to a chronic inflammatory disease of the small intestine. The disease encompasses a spectrum of conditions characterised by varying degrees of gluten sensitivity, including a severe form characterised by a flat small intestinal mucosa (hyperplastic villous atrophy) and other forms characterised by milder symptoms including fatigue, chronic diarrhea, malabsorption of nutrients, weight loss, abdominal distension, anemia as well as a substantially enhanced risk for the development of osteoporosis and intestinal malignancies (lymphoma and carcinoma).",
                                "The term “sensitive to gluten” refers to the state in which any one or more of the symptoms of celiac disease or an inappropriate T cell response are exhibited by a subject exposed to gluten, or peptide fragment thereof. In a subject who is not sensitive to gluten, there is little or no T cell response caused by ingestion of gluten. By contrast, in a subject sensitive to gluten there is an inappropriate CD4+ T cell mediated immune response to peptides derived from gluten after ingestion thereof.",
                                "The terms “immune tolerance”, “immunological tolerance”, “tolerance” or “desensitise” are here defined as to make a sensitised or hypersensitive subject, less sensitive, insensitive or nonreactive to gluten by reducing the immunological reactivity of a subject towards gluten. Immune tolerance may be generated, for example, by exposure of mucosal surfaces to tolerance-inducing antigenic fragments of gluten as defined herein. Mucosal administration of both high- and low-dose antigen may result in immune tolerance, in which the immune response to subsequent systemic administration of antigen is reduced. At least two mechanisms of immune tolerance may exist. Tolerance to high-doses of an antigen appears to occur by inactivation or clonal deletion of Th1 and Th2 cells. In contrast, tolerance to low doses of antigen leads to bystander immune suppression mediated by stimulation of Treg cells to produce suppressive cytokines such as interleukin-4 (IL-4), interleukin-10 (IL-10) and TGFβ.",
                                "The term “inducing immune tolerance” as used herein refers to bringing about, producing, or causing immune tolerance to gluten in a subject sensitive to gluten.",
                                "The term “hypersensitive” is here defined as abnormally susceptible physiologically to gluten.",
                                "The term “anergy” refers to a state of reversible unresponsiveness or hyporesponsiveness of a T cell (or B cell) to an antigen.",
                                "As used herein, “Treg” refers to a subclass of T cells whose major role is to bring T cell-mediated immunity during an immune reaction to an end, and to suppress auto-reactive T cells that escaped negative selection in the thymus. A “Treg response”, as used herein, is characterised by the differentiation and proliferation of the population of CD4+ or CD8+ Treg cells which express the forkhead family transcription factor FOXP3 (forkhead box p3) and/or the MHC Class II associated protein LAG-3, and/or express high levels of the IL-2 receptor alpha chain (CD25). There is also a minor population of MHC Class I-restricted CD8+ FOXP3-expressing Treg cells. The presence of Treg cells in the peripheral circulation or spleen may be determined by analysis of CD4+/CD25+ expression. This may conveniently be achieved using flow cytometry. In addition, Treg cells may be quantified by determining levels of FOXP3 mRNA in peripheral blood- or spleen-derived mononuclear cells by quantitative reverse transcriptase polymerase chain reaction (PCR). In addition, the induction of a Treg response in vivo may be assessed by the measurement of Treg-associated cytokines from peripheral blood- or lymph node-derived mononuclear lymphocytes. Treg cells typically show higher expression levels of the anti-inflammatory cytokines such as IL-10 and TGFβ and the presence of these mediators may be determined by methods known in the art, such as flow cytometry, immunohistochemical staining or ELISA.",
                                "The term “T cell stimulatory peptide” or “stimulatory peptide” refers to a peptide or epitope capable of activating a T cell.",
                                "The term “activate” or “activating” or “activation” in relation to a T cell refers to the presentation by an MHC molecule on one cell of an epitope to an appropriate T cell receptor on a second (T) cell, together with binding of a co-stimulatory molecule by the T cell, thereby eliciting a “T cell response”.",
                                "As used herein, “toxic peptide” refers to a peptide that stimulates T cell activation in a subject.",
                                "The term “expansion” as used herein refers to the proliferation and amplification of a T cell population following T cell activation.",
                                "The term “immunodominant” refers to a subunit of a peptide (epitope) that is most easily recognised by the immune system and thus most influences the specificity of an induced immune response, such as a T cell response “Immunodominant” may be used interchangeably with “dominant” herein.",
                                "As used herein, the term “modulating a T cell response” refers to regulating or adjusting a T cell response in a subject sensitive to gluten, such that the T cell response to gluten is reduced or lessened.",
                                "As used herein, “modifying cytokine secretion” refers to changing or altering somewhat the secretion of cytokines by a subject sensitive to gluten, such that the effects of gluten sensitivity in the subject are reduced or lessened. The term encompasses both increased secretion of a particular cytokine or combination of cytokines and decreased secretion of a particular cytokine or combination of cytokines.",
                                "As used herein, “epitope” refers to that portion of an antigen or a peptide that is recognized by the immune system, for example, a T cell receptor or the major histocompatibility complex (MHC) class I or class II, an antibody, a B cell receptor, which portion is sufficient for high affinity binding. Generally, a linear epitope for recognition will be at least about 3 amino acids in length, and may be 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 amino acids in length, or more.",
                                "The term “polyepitope” refers to the presence of two or more epitopes (peptides) linked in a single polypeptide chain.",
                                "As used herein, “antigen” and “immunogen” and variations thereof are generally used interchangeably and refer to the epitope-containing structure recognised by the immune system.",
                                "The term “gluten” or “gluten protein” encompasses alpha (α), beta (β), gamma (γ) and omega (ω) gliadins, and low and high molecular weight (LMW and HMW) glutenins in wheat, B, C and D hordeins in barley, β, γ and ω secalins in rye, and optionally avenins in oats. “Gluten peptides” are peptides derived from, or encompassed within, one or more of the gluten proteins.",
                                "The term “gliadin” refers to the aqueous alcohol-soluble fraction of gluten, particularly, but not exclusively, gluten derived from wheat, for example Triticum aestivum.",
                                "The term “glutenin” refers to the aqueous alcohol-insoluble fraction of gluten, particularly but not exclusively, gluten derived from wheat, for example Triticum aestivum.",
                                "As used herein, “hordein” or “barley hordein” refers to gluten derived from barley, Hordein vulgare.",
                                "As used herein, “secalin” or “rye secalin” refers to gluten derived from rye, Secale cerale.",
                                "As used herein, “avedin” or “oat avedin” refers to gluten derived from oats, Avena sativa. The terms “human leukocyte antigen” and “HLA” are here defined as a genetic fingerprint on human white blood cells and platelets, composed of proteins that play a critical role in activating the body's immune system to respond to foreign organisms. In humans and other animals, the HLA is also referred to as the “major histocompatibility complex” (MHC).",
                                "Tissue “transglutaminase” is a crucial factor in celiac disease because it promotes gluten-specific T cell responses. Tissue transglutaminase causes selective deamidation of gluten, which in turn, causes the generation of a series of gluten peptides that bind to HLA-DQ2 or -DQ8 molecules with high affinity. The resulting HLA-DQ2 (DQ8)-gluten peptide interaction triggers the proinflammatory CD4 T cell response. Thus, the term “deamidation” refers to the conversion of glutamine to glutamic acid, or to the conversion of asparagine to aspartic acid. As used herein, deamidation refers particularly to the conversion of glutamine to glutamic acid in gluten, a process that increases the propensity of gluten peptides to activate T cells.",
                                "As used herein, the term “agent” refers to a collection of peptides and/or polynucleotides. The peptides and/or polynucleotides may be in the same composition (such as a vaccine), in different compositions or a combination thereof (for example, the first and second peptide defined herein in one composition, and the third in a separate composition). If in different compositions, they will preferably be in close proximity, such as in a kit. Accordingly, the methods of the invention contemplate providing (for example administering to a subject) the individual component peptides and/or polynucleotides of an agent of the invention in a single composition (vaccine), or sequentially in different compositions or a combination thereof.",
                                "It must be noted that, as used in the specification and the appended claims, the singular forms “a,” “an,” and “the” include plural referents unless the context clearly dictates otherwise."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define wafer",
                                "define photoresist",
                                "define photomask",
                                "define coupling molecule",
                                "define coupling process",
                                "define biomolecule",
                                "define linker molecule",
                                "define developer",
                                "define protecting group",
                                "define microarrays",
                                "define microarray system",
                                "define patterned region",
                                "define derivatization",
                                "define capping process",
                                "define diffusion",
                                "define dye molecule",
                                "define immunological binding",
                                "define biological sample",
                                "define assay",
                                "define subject",
                                "define antigen",
                                "define epitope",
                                "define antibody",
                                "define immune-related molecule",
                                "define inflammatory response molecule",
                                "define autoimmune disorder",
                                "define percent identity",
                                "define biologically active fragment",
                                "define celiac disease",
                                "define sensitive to gluten",
                                "define immune tolerance",
                                "define induce immune tolerance",
                                "define hypersensitive",
                                "define anergy",
                                "define Treg",
                                "define T cell stimulatory peptide",
                                "define activate T cell",
                                "define toxic peptide",
                                "define expansion",
                                "define immunodominant",
                                "define modulate T cell response",
                                "define modify cytokine secretion",
                                "define epitope",
                                "define polyepitope",
                                "define antigen",
                                "define gluten",
                                "define gliadin",
                                "define human leukocyte antigen"
                            ],
                            "num_characters": 24114,
                            "outline_medium": [
                                "define wafer",
                                "define photoresist",
                                "define photomask",
                                "define coupling molecule",
                                "define coupling process",
                                "define biomolecule",
                                "define linker molecule",
                                "define developer",
                                "define protecting group",
                                "define microarrays",
                                "define microarray system",
                                "define patterned region",
                                "define derivatization",
                                "define capping process",
                                "define diffusion",
                                "define dye molecule",
                                "define immunological binding",
                                "define biological sample",
                                "define assay",
                                "define subject",
                                "define antigen",
                                "define epitope",
                                "define antibody",
                                "define immune-related molecule"
                            ],
                            "outline_short": [
                                "define wafer",
                                "define photoresist",
                                "define photomask",
                                "define coupling molecule",
                                "define biomolecule",
                                "define linker molecule",
                                "define developer",
                                "define protecting group",
                                "define microarrays",
                                "define patterned region",
                                "define derivatization",
                                "define epitope"
                            ]
                        },
                        {
                            "title": "Peptides",
                            "paragraphs": [
                                "The present disclosure relates to the following peptides and modifications thereof. Some embodiments include novel and selective polyepitode-containing peptides that are agents or vaccines for treating and diagnosing celiac disease. In some embodiments, the polyepitode-containing peptides are antigens that modulate a T cell response of a subject who is sensitive to gluten or who has celiac disease. Examples of these polyepitode-containing and celiac active peptides, which are optionally amidated at the C-termini, are provided in Tables 1 and 2.",
                                "Disclosed herein are methods of identifying novel bioactive sequences and the use of those bioactive sequences. Uses of the arrays or formulations comprising novel bioactive sequences disclosed herein can include research applications, therapeutic purposes, medical diagnostics, and/or stratifying one or more patients or subjects.",
                                "Biologically active variants include peptides which vary by one or more amino acids from the defined peptide, which are also known in the art as homologues. For example, a variant can comprise one or more amino acid substitutions in any one or more of the peptides. As used herein, “substituted” or “substitution” includes substitution, replacement, addition, insertion, omission and/or deletion (as such variants may also be fragments) of an amino acid residue(s). In particular, this refers to peptides having conservative substitution without losing, or significantly diminishing, their use in the methods of the invention. Preferably, biologically active variants are capable of generating a substantially equal or greater T cell response in a subject sensitive to gluten as the peptide from which it is derived. In another embodiment, biologically active variants are capable of generating at least 50%, more preferably at least 75% of the T cell response in a subject sensitive to gluten as the peptide from which it is derived.",
                                "Biologically active variants of the peptides may be identified by modifying the sequence of each peptide and then assaying the resulting peptide for the ability to stimulate an immune response, for example, production of T cells.",
                                "In an embodiment, no more than 5, more preferably no more than 4, more preferably no more than 3, more preferably no more than 2, and even more preferably only 1 amino acid in a defined peptide is varied (by substitution, deletion or addition), when compared to a peptide sequence defined herein.",
                                "In an alternate embodiment, the percentage identity between a particular sequence (variant) and a reference sequence (peptide defined herein) is at least about 60% or at least about 70% or at least about 80% or at least about 90% or at least about 95% or above such as at least about 96%, 97%, 98%, 99% or greater. Percentage identity can be determined using readily available software packages, such as BLAST (www.ncbi.nlm.nih.gov/) and GAP.Natural amino acids include alanine (A), arginine (R), asparagine (N), aspartic acid (D), cysteine (C), glutamine (Q), glutamic acid (E), glycine (G), histidine (H), isoleucine (I), leucine (L), lysine (K), methionine (M), phenylalanine (F), proline (P), serine (S), threonine (T), tryptophan (W), tyrosine (Y), valine (V), hydroxyproline (O and/or Hyp), isodityrosine (IDT), and di-isodityrosine (di-IDT). Hydroxyproline, isodityrosine, and di-isodityrosine are formed post-translationally. Use of natural amino acids, in particular the 20 genetically encoded amino acids, is particularly contemplated.",
                                "Substitutions may be conservative amino acid substitutions, in which the substituted amino acid has similar structural or chemical properties with the corresponding amino acid in the reference sequence. Alternatively, the substitutions may be non-conservative amino acid substitutions as long as the desired activity is maintained.",
                                "By way of example, conservative amino acid substitutions involve substitution of one aliphatic or hydrophobic amino acids, for example, alanine, valine, leucine and isoleucine, with another; substitution of one hydroxyl-containing amino acid, for example, serine and threonine, with another; substitution of one acidic residue, for example, glutamic acid or aspartic acid, with another; replacement of one amide-containing residue, for example, asparagine and glutamine, with another; replacement of one aromatic residue, for example, phenylalanine and tyrosine, with another; replacement of one basic residue, for example, lysine, arginine and histidine, with another; and replacement of one small amino acid, for example, alanine, serine, threonine, methionine, and glycine, with another.",
                                "Peptide variants may be produced by mutagenesis or other chemical methods. Alanine scanning is a useful technique for identifying important amino acids. In this technique, an amino acid residue is replaced by Ala and its effect on the peptide's activity is determined. For example, cysteine residues may be substituted to minimise dimerisation via disulfide linkages. Each of the amino acid residues of the peptide is analysed in this manner to determine the important regions of the peptide. Means for preparing such peptides are well understood in the art.",
                                "In addition to naturally occurring amino acids, non-naturally occurring amino acids, or modified amino acids, are also contemplated and within the scope of the invention. In fact, as used herein, “amino acid” refers to naturally occurring amino acids, non-naturally occurring amino acids, and amino acid analogues, and to the D or L stereoisomers of each.",
                                "The phrases “protecting group” and “blocking group” as used herein, refers to modifications to the peptide which protect it from undesirable chemical reactions, particularly in vivo. Examples of such protecting groups include esters of carboxylic acids and boronic acids, ethers of alcohols and acetals, and ketals of aldehydes and ketones. Examples of suitable groups include acyl protecting groups such as, for example, furoyl, formyl, adipyl, azelayl, suberyl, dansyl, acetyl, theyl, benzoyl, trifluoroacetyl, succinyl and methoxysuccinyl; aromatic urethane protecting groups such as, for example, benzyloxycarbonyl (Cbz); aliphatic urethane protecting groups such as, for example, t-butoxycarbonyl (Boc) or 9-fluorenylmethoxy-carbonyl (FMOC); pyroglutamate and amidation. Many other modifications providing increased potency, prolonged activity, ease of purification, and/or increased half-life will be known to the person skilled in the art.",
                                "In one embodiment, one of more glutamate residues of one or more of the peptides may be generated by tTG activity upon a peptide. In alternate embodiment, this reaction occurs in vivo following administration.",
                                "The peptides may comprise one or more modifications, which may be natural post-translation modifications or artificial modifications. The modification may provide a chemical moiety (typically by substitution of a hydrogen, for example, of a C—H bond), such as an amino, acetyl, acyl, carboxy, hydroxy or halogen (for example, fluorine) group, or a carbohydrate group. Typically, the modification is present on the N- or C-terminal. Furthermore, one or more of the peptides may be PEGylated, where the PEG (polyethyleneoxy group) provides for enhanced lifetime in the blood stream. One or more of the peptides may also be combined as a fusion or chimeric protein with other proteins, or with specific binding agents that allow targeting to specific moieties on a target cell.",
                                "Peptide variants may be obtained in which the peptide has been chemically modified at the level of amino acid side chains, of amino acid chirality, and/or of the peptide backbone",
                                "Certain peptides described herein may exist in particular geometric or stereoisomeric forms. The present invention contemplates all such forms, including cis-(Z) and trans-(E) isomers, R- and S-enantiomers, diastereomers, (D)-isomers, (L)-isomers, the racemic mixtures thereof, and other mixtures thereof, as, falling within the scope of the invention. Additional asymmetric carbon atoms may be present in a substituent, such as an alkyl group. All such isomers, as well as mixtures thereof, are intended to be included in this invention.",
                                "In another example, to prevent cleavage by peptidases, any one or more of the peptides may include a non cleavable peptide bond in place of a particularly sensitive peptide bond to provide a more stable peptide. Such non cleavable peptide bonds may include beta amino acids.",
                                "In certain embodiments, any one or more of the peptides may include a functional group, for example, in place of the scissile peptide bond, which facilitates inhibition of a serine-, cysteine- or aspartate-type protease, as appropriate. For example, the invention includes a peptidyl diketone or a peptidyl keto ester, a peptide haloalkylketone, a peptide sulfonyl fluoride, a peptidyl boronate, a peptide epoxide, a peptidyl diazomethane, a peptidyl phosphonate, isocoumarins, benzoxazin-4-ones, carbamates, isocyantes, isatoic anhydrides or the like. Such functional groups have been provided in other peptide molecules, and general routes for their synthesis are known.",
                                "A variant may be a mimetic. The term “mimetic” is intended to refer to a substance which has some chemical similarity to the molecule it mimics and retains a particular activity of interest (for example, inducing tolerance). The underlying rationale behind the use of peptide mimetics, is that the peptide backbone of proteins exists chiefly to orient amino acid side chains in such a way as to facilitate molecular interactions, such as those of T cell and MHC-peptide, antibody and antigen, enzyme and substrate or scaffolding proteins. A peptide mimetic is designed to permit molecular interactions similar to the natural molecule. Mimetics include olefins, phosphonates, aza-amino acid analogues and the like. Persons skilled in the art would readily appreciate methods for designing mimetics of peptides and would be able to utilise them to design mimetics of the peptides defined herein.",
                                "The peptides may be analysed by hydrophilicity analysis, which can be used to identify the hydrophobic and hydrophilic regions of the peptide, thus aiding in the design of peptides for experimental manipulation, such as in binding experiments, antibody synthesis, etc. Secondary structural analysis may also be performed to identify regions of a peptide that adopt specific structural motifs. Manipulation, translation, secondary structure prediction, hydrophilicity and hydrophobicity profiles, open reading frame prediction and plotting, and determination of sequence homologies, can be accomplished using computer software programs available in the art. Other methods of structural analysis including, but not limited to, X-ray crystallography, mass spectrometry and gas chromatography, computer modelling, optical rotary dispersion (ORD), or circular dichroism (CD) may also be used.",
                                "The peptides, fragments or variants may be in a salt form, preferably, a pharmaceutically acceptable salt form. “A pharmaceutically acceptable salt form” includes the conventional non-toxic salts or quaternary ammonium salts of a peptide, for example, from non-toxic organic or inorganic acids. Conventional non-toxic salts include, for example, those derived from inorganic acids such as hydrochloride, hydrobromic, sulphuric, sulfonic, phosphoric, nitric, and the like; and the salts prepared from organic acids such as acetic, propionic, succinic, glycolic, stearic, lactic, malic, tartaric, citric, ascorbic, palmitic, maleic, hydroxymaleic, phenylacetic, glutamic, benzoic, salicyclic, sulfanilic, 2-acetoxybenzoic, fumaric, toluenesulfonic, methanesulfonic, ethane disulfonic, oxalic, isothionic, and the like.",
                                "The peptides can be provided in the agent or vaccine as separate peptides or linked, for example, in a polyepitope structure. In one embodiment, the peptides may be presented in a single polypeptide chain (polyepitope string), i.e., in a linear or circular arrangement. In another embodiment, the peptides can be presented in a multiple antigen presentation system, particularly based on a dendrimer backbone such as polylysine. A polylysine backbone provides a non-linear, branched arrangement of epitopes. This system provides the advantage over a polyepitope string that the peptides do not interfere with each other or be liable to cleavage into cryptic epitopes and thus are able to induce a full T cell response.",
                                "Conjugates",
                                "One or more of the peptides may be conjugated to a compound using standard methods. Examples of compounds to which the peptides can be conjugated include but are not limited to a radioisotope, a fluorescent label, a chemiluminescent compound, an enzyme label, a free radical, an avidin-biotin label, a bacteriophage label, a compound that increases the half life of the peptide in a subject, an adjuvant, an MHC molecule or fragment thereof.",
                                "The compound may facilitate detection and/or isolation or increase immunogenicity of the conjugated peptide.",
                                "“Conjugated” as used herein means coupled via covalent or non-covalent bonds. While covalent bonds are preferred, the compound may also be linked to the peptide via complexation without covalent linkage, for example, via hydrogen bonds or electrostatic, hydrophobic, etc., interaction.",
                                "Typical radioactive isotopes include 3H, 125I, 131I 32P, 35S, 14C, 51Cr, 36Cl, 57Co, 58Co, 59Fe, 75Se, and 152Eu.",
                                "Typical fluorescent labels include fluorescein isothiocyanate, rhodamine, phycoerythrin, phycocyanin, allophycocyanin, o-phthaldehyde, and fluorescamine.",
                                "Typical chemiluminescent compounds include luminol, isoluminol, aromatic acridinium esters, imidazoles, acridinium salts, and the oxalate esters. Typical bioluminescent compounds include luciferin, luciferase, and aequorin.",
                                "Typical enzyme labels include alkaline phosphatase, beta-galactosidase, glucose-6-phosphate dehydrogenase, maleate dehydrogenase, glucose oxidase, and peroxidase.",
                                "In one embodiment, a non-specific linker is included between the compound and the peptide to which it is conjugated. Such a linker is not involved in peptide activity. Rather the linker may serve as a spacer between the peptide and a functional moiety. Uses for a linker include immobilization of the peptide, such as to aid purification or detection. Alternatively, a linker may allow attachment of a compound to the peptide that enables specific delivery of the peptide to a particular target, such as a cell or tissue, spatially or temporally. When used as a vaccine, one or more of the peptides may be coupled to a linker that serves as a spacer between the peptide and an immunogenic carrier, or permits improved coupling between the peptide and the immunogenic carrier and prevents the formation of cryptic epitopes.",
                                "In one embodiment, one or more of the peptides are covalently coupled to an adjuvant (immunogenic carrier protein), such as diphtheria toxoid (DT), keyhole limpet hemocyanin (KLH), tetanus toxoid (TT) or the nuclear protein of influenza virus (NP), to increase their immunogenicity, using any of several conjugation chemistries known in the art. A non-specific linker can be present between the peptide and the immunogenic carrier and is preferably joined to the peptide or co-synthesised to facilitate coupling to the immunogenic carrier and/or to serve as a spacer between the peptide and the immunogenic carrier.",
                                "When used as a diagnostic agent, one or more of the peptides are preferably conjugated to an immunogenic carrier that was not previously used for vaccination. When monitoring the success of vaccination, this prevents the diagnostic agent from reacting to antibodies that were formed against the carrier fraction of the vaccine.",
                                "In one embodiment, the compound is an MHC class II molecule or peptide binding fragment thereof. The MHC class II molecule may be purified from a biological sample. Alternatively, the MHC class II molecule may be recombinantly produced. A peptide binding fragment of the MHC class II molecule can be obtained, for example, by enzymatic cleavage of the purified or recombinant intact molecule. Alternatively, the peptide binding fragment may be recombinantly produced. In a preferred embodiment, the compound is a recombinant two domain MHC class II molecule.",
                                "In their most basic form, the two domain MHC class II molecule comprises the al and 131 domain of a mammalian MHC class II molecule wherein the amino terminus of the al domain is covalently linked to the carboxy terminus of the 131 domain and wherein the polypeptide does not include the α2 or β2 domains. The two domain MHC class II molecule is associated by covalent or non-covalent interaction with a peptide defined herein. In certain embodiments, the peptide is covalently linked to the amino terminus of the β1 domain of the class II molecule. The two domain MHC class II molecule may also comprise a detectable label, such as a fluorescent label, or a toxin. Where the detectable label or toxin is to be covalently linked to the MHC molecule in a directed manner (i.e., rather than being randomly attached) it will generally be linked to the carboxy terminus of the molecule so as to minimise interference with the peptide antigen linked at the amino terminus.",
                                "In vitro, the two domain MHC class II molecule may be used to detect and quantify T-cells, and regulate T-cell function. Thus, such molecules loaded with a selected peptide may be used to detect, monitor and quantify the population of T cells that are specific for that peptide. The two domain MHC class II molecule/peptide conjugate may also be used to induce anergy of gluten-specific T-cells, alleviating symptoms associated with celiac disease. Alternatively, such molecules may be conjugated with a toxin to more directly kill the disease-causing T cells. Suitable toxins include protein toxins (for example, ricin, diphtheria, and Pseudomonas toxin), chemotherapeutic agents (for example, doxorubicin, daunorubicin, methotrexate, cytotoxin, and antisense RNA), antibodies to a cytotoxic T-cell surface molecule, lipases, and radioisotopes emitting “hard”, for example, beta radiation.",
                                "Antigen Presenting Cells",
                                "The agent and/or peptides defined herein may be delivered by loading APCs with, for example, the first, second and third peptides, a biologically active fragment or variant of one or more thereof, and/or a polynucleotide encoding one or more thereof.",
                                "Preferably, the APCs are selected from the group consisting of dendritic cells, macrophages, B-lymphocytes and liver sinusoidal endothelial cells that express MHC class II molecules shared with the MHC phenotype of the subject. For example, the APCs may express HLA-DQ2 (for example, HLA DQA1*05 and HLA DQB1*02) and/or HLA DQ8. The APCs employed for this purpose may be isolated from the subject to whom they are to be delivered after loading, or they may be obtained from an allo-matched subject.",
                                "By “loading” an APC it is meant that the APC is incubated or transfected with the peptides, a biologically active fragment or variant of one or more thereof, or a polynucleotide encoding one or more thereof. Loading an APC can be achieved by using conventional nucleic acid transfection methods, such as lipid-mediated transfection, electroporation, and calcium phosphate transfection.",
                                "Peptide Production",
                                "The peptides can be prepared in any suitable manner. For example, the peptides can be recombinantly and/or synthetically produced.",
                                "The peptides may be synthesised by standard chemistry techniques, including synthesis by automated procedure using a commercially available peptide synthesiser. In general, peptide analogues are prepared by solid-phase peptide synthesis methodology which may involve coupling each protected amino acid residue to a resin support, preferably a 4-methylbenzhydrylamine resin, by activation with dicyclohexylcarbodiimide to yield a peptide with a C-terminal amide. Alternatively, a chloromethyl resin (Merrifield resin) may be used to yield a peptide with a free carboxylic acid at the C-terminal. After the last residue has been attached, the protected peptide-resin is treated with hydrogen fluoride to cleave the peptide from the resin, as well as deprotect the side chain functional groups. Crude product can be further purified by gel filtration, high pressure liquid chromatography (HPLC), partition chromatography, or ion-exchange chromatography.",
                                "If desired, and as outlined above, various groups may be introduced into the peptide of the agent during synthesis or during expression, which allow for linking to other molecules or to a surface. For example, cysteines can be used to make thioethers, histidines for linking to a metal ion complex, carboxyl groups for forming amides or esters, amino groups for forming amides, and the like.",
                                "The peptides may also be produced using cell-free translation systems. Standard translation systems, such as reticulocyte lysates and wheat germ extracts, use RNA as a template; whereas “coupled” and “linked” systems start with DNA templates, which are transcribed into RNA then translated.",
                                "Alternatively, the peptides may be produced by transfecting host cells with expression vectors that comprise a polynucleotide(s) that encodes one or more peptides.",
                                "For recombinant production, a recombinant construct comprising a sequence which encodes one or more of the peptides is introduced into host cells by conventional methods such as calcium phosphate transfection, DEAE-dextran mediated transfection, microinjection, cationic lipid-mediated transfection, electroporation, transduction, scrape lading, ballistic introduction or infection.",
                                "One or more of the peptides may be expressed in suitable host cells, such as, for example, mammalian cells (for example, COS, CHO, BHK, 293 HEK, VERO, HeLa, HepG2, MDCK, W138, or NIH 3T3 cells), yeast (for example, Saccharomyces or Pichia), bacteria (for example, E. coli, P. pastoris, or B. subtilis), insect cells (for example, baculovirus in Sf9 cells) or other cells under the control of appropriate promoters using conventional techniques. Following transformation of the suitable host strain and growth of the host strain to an appropriate cell density, the cells are harvested by centrifugation, disrupted by physical or chemical means, and the resulting crude extract retained for further purification of the peptide or variant thereof.",
                                "Suitable expression vectors include, for example, chromosomal, non-chromosomal and synthetic polynucleotides, for example, derivatives of SV40, bacterial plasmids, phage DNAs, yeast plasmids, vectors derived from combinations of plasmids and phage DNAs, viral DNA such as vaccinia viruses, adenovirus, adeno-associated virus, lentivirus, canary pox virus, fowl pox virus, pseudorabies, baculovirus, herpes virus and retrovirus. The polynucleotide may be introduced into the expression vector by conventional procedures known in the art.",
                                "The polynucleotide which encodes one or more peptides may be operatively linked to an expression control sequence, i.e., a promoter, which directs mRNA synthesis. Representative examples of such promoters include the LTR or SV40 promoter, the E. coli lac or trp, the phage lambda PL promoter and other promoters known to control expression of genes in prokaryotic or eukaryotic cells or in viruses. The expression vector may also contain a ribosome binding site for translation initiation and a transcription terminator.",
                                "The expression vectors may also include an origin of replication and a selectable marker, such as the ampicillin resistance gene of E. coli to permit selection of transformed cells, i.e., cells that are expressing the heterologous polynucleotide. The nucleic acid molecule encoding one or more of the peptides may be incorporated into the vector in frame with translation initiation and termination sequences.",
                                "One or more of the peptides can be recovered and purified from recombinant cell cultures (i.e., from the cells or culture medium) by well known methods including ammonium sulphate or ethanol precipitation, acid extraction, anion or cation exchange chromatography, phosphocellulose chromatography, hydrophobic interaction chromatography, affinity chromatography, hydroxyapatite chromatography, lectin chromatography, and HPLC. Well known techniques for refolding proteins may be employed to regenerate active conformation when the peptide is denatured during isolation and or purification.",
                                "To produce a glycosylated peptide, it is preferred that recombinant techniques be used. To produce a glycosylated peptide, it is preferred that mammalian cells such as, COS-7 and Hep-G2 cells be employed in the recombinant techniques.",
                                "The peptides can also be prepared by cleavage of longer peptides, especially from food extracts.",
                                "Pharmaceutically acceptable salts of the peptides can be synthesised from the peptides which contain a basic or acid moiety by conventional chemical methods. Generally, the salts are prepared by reacting the free base or acid with stoichiometric amounts or with an excess of the desired salt-forming inorganic or organic acid or base in a suitable solvent."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce peptides and modifications",
                                "describe polyepitode-containing peptides",
                                "provide examples of peptides",
                                "discuss uses of arrays or formulations",
                                "define biologically active variants",
                                "describe substitutions in variants",
                                "discuss conservative substitutions",
                                "provide examples of conservative substitutions",
                                "describe production of variants by mutagenesis",
                                "discuss alanine scanning",
                                "describe protecting groups",
                                "provide examples of protecting groups",
                                "discuss modifications to prevent cleavage",
                                "describe functional groups for protease inhibition",
                                "discuss mimetics",
                                "describe design of mimetics",
                                "discuss analysis of peptides",
                                "describe hydrophilicity analysis",
                                "discuss secondary structural analysis",
                                "describe computer software for analysis",
                                "discuss other methods of structural analysis",
                                "describe salt forms of peptides",
                                "provide examples of salt forms",
                                "discuss presentation of peptides in agents or vaccines",
                                "describe polyepitope structure",
                                "discuss multiple antigen presentation system",
                                "describe conjugates",
                                "discuss compounds for conjugation",
                                "describe radioactive isotopes",
                                "describe fluorescent labels",
                                "describe chemiluminescent compounds",
                                "describe enzyme labels",
                                "discuss linkers",
                                "describe uses of linkers",
                                "discuss conjugation to adjuvants",
                                "describe MHC class II molecules",
                                "discuss two domain MHC class II molecules",
                                "describe uses of two domain MHC class II molecules",
                                "discuss antigen presenting cells",
                                "describe loading of antigen presenting cells",
                                "discuss peptide production",
                                "describe synthetic production",
                                "describe recombinant production",
                                "discuss cell-free translation systems",
                                "describe transfection of host cells",
                                "discuss expression vectors",
                                "describe promoters",
                                "discuss recovery and purification of peptides",
                                "describe refolding of proteins",
                                "discuss production of glycosylated peptides"
                            ],
                            "num_characters": 25168,
                            "outline_medium": [
                                "introduce peptides and modifications",
                                "describe polyepitode-containing peptides for treating celiac disease",
                                "discuss uses of arrays or formulations of novel bioactive sequences",
                                "define biologically active variants of peptides",
                                "describe substitutions in biologically active variants",
                                "discuss production of biologically active variants",
                                "introduce alanine scanning technique",
                                "describe protecting groups and blocking groups",
                                "discuss modifications providing increased potency and half-life",
                                "introduce mimetics of peptides",
                                "describe hydrophilicity analysis and secondary structural analysis",
                                "discuss computer software programs for peptide analysis",
                                "introduce salt forms of peptides",
                                "describe conjugates of peptides with compounds",
                                "discuss radioactive isotopes as compounds",
                                "introduce fluorescent labels as compounds",
                                "describe chemiluminescent compounds",
                                "discuss enzyme labels as compounds",
                                "introduce non-specific linkers between compounds and peptides",
                                "describe conjugation of peptides to adjuvants",
                                "discuss conjugation of peptides to MHC class II molecules",
                                "introduce two domain MHC class II molecules",
                                "describe uses of two domain MHC class II molecules",
                                "discuss loading antigen presenting cells with peptides",
                                "introduce production of peptides by recombinant and synthetic methods"
                            ],
                            "outline_short": [
                                "define polyepitode-containing peptides",
                                "describe uses of arrays or formulations",
                                "introduce biologically active variants",
                                "explain substitutions in variants",
                                "describe production of variants",
                                "discuss protecting groups and modifications",
                                "introduce mimetics",
                                "describe analysis of peptides",
                                "discuss salt forms of peptides",
                                "introduce conjugates and compounds",
                                "describe linkers and immunogenic carriers",
                                "outline production of peptides"
                            ]
                        },
                        {
                            "title": "Methods of Identifying Bioactive Sequences",
                            "paragraphs": [
                                "Disclosed herein are novel epitope sequences generated by novel methods of epitope discovery and generation disclosed herein. In one embodiment, a method of generating novel epitope sequences involves discovery of continuous epitope sequences on a polypeptide capable of binding to antibodies or illiciting an immune response in an individual. Once epitope sequences are discovered, they are recombined with random sequences or other discovered epitope sequences to generate new synthetic polypeptide sequences with greater sensitivity and specificity for binding to antibodies associated with an autoimmune disorder than the native epitopes alone. In preferred embodiments, the process of generating and screening sequences is performed on a peptide array that is configured to contact a sample.",
                                "In some embodiments, as illustrated in FIG. 2, the method of identifying novel epitopes comprises the steps of: 1) generating a first plurality of overlapping polypeptide fragments each comprising portion of a native active protein or polypeptide that shows biological activity; 2) determining specificity and sensitivity of antibodies correlated with an autoimmune disorder to each polypeptide fragment by contacting an array comprising the polypeptide fragments with a sample from a subject having the autoimmune disorder; 3) selecting polypeptide fragments that exceed a pre-defined threshold value for sensitivity and/or specificity of binding, or have the greatest values of sensitivity and/or specificity of the collection of polypeptide fragments; 4) identifying from the polypeptide fragments identified in Step 3 the occurrence of epitope sequences within the polypeptide fragments; 5) generating a second plurality of synthetic polypeptides each comprising at least two of the epitope sequences in step 4, and optionally containing at least one random polypeptide sequence; 6) determining the specificity and sensitivity for each of the synthetic polypeptides generated in step 5 by contacting an array comprising the synthetic polypeptide fragments with a sample from a subject having the immune disorder; and 7) selecting synthetic polypeptides from step 6 exceeding a specificity and sensitivity threshold to use as biomarkers for the autoimmune disorder. Optionally, steps 5 through 7 may be repeated to further refine the sensitivity and/or specificity of the synthetic polypeptides to binding of an antibody associated with an autoimmune disorder. This method results in the generation of a plurality of novel bioactive polypeptides useful for diagnosis and treatment of an autoimmune disorder (e.g., celiac disease).",
                                "In one embodiment, the autoimmune disorder is celiac disease. In one embodiment, the protein having biological activity is a gliadin. In one embodiment, the gliadin is an α-gliadin, β-gliadin, γ-gliadin, or ω-gliadin.",
                                "Identification of Epitopes in on an Antigen",
                                "As disclosed herein, methods of identifying epitopes on a bioactive protein, such as gliadin, are provided and used for generation of novel bioactive polypeptide sequences for use in diagnosis and treatment of an autoimmune disease. In one embodiment, a full length bioactive polypeptide sequence is divided into overlapping polypeptide fragments of a discrete length. In one embodiment, each polypeptide fragment is from 6 to 15 amino acids in length. In one embodiment, each polypeptide fragment is 6, 7, 8, 9, 10, 11, 12, 13, 14, or 15 amino acids in length. In a preferred embodiment, each polypeptide fragment is 12 amino acids in length. The amount of overlap between polypeptide fragments of the full length bioactive polypeptide can be determined by step size between the polypeptide fragments, indicating the distance between each N-terminal or C-terminal amino acid of each polypeptide fragment as determined by the full length bioactive polypeptide. A diagram of an embodiment with a step size of 2 amino acids is shown in FIG. 1 with a polypeptide fragment length of 12 amino acids. This results in an overlap of 10 amino acids between neighboring polypeptide fragments. The overlap allows more precise determination of active epitope sequences on the bioactive polypeptide sequence. In some embodiments, the step size may vary, e.g., the step size may be 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, or 12 amino acids. In a preferred embodiment, the step size is 2 amino acids. One amino acid step size may also be used to improve precision at the cost of requiring generation of more fragment polypeptides.",
                                "Based upon the scheme of generation of polypeptide fragments discussed above, fragment polypeptides are synthesized on an array for screening against a sample with antibodies correlated with an autoimmune disorder. Binding of antibodies to fragment polypeptides on the array is detected via secondary antibody, although other methods of detection known to one of skill in the art will also suffice. Information about the binding of each polypeptide fragment to an antibody in a samples from a subject identified as having or not having the autoimmune disorder are compared to determine sensitivity and specificity of each peptide. Overlapping regions allow identification of epitope sequences. In one embodiment, the identified epitopes are from 3 to 11 amino acids in length. In one embodiment, each identified epitope is 3, 4, 5, 6, 7, 8, 9, 10, or 11 amino acids in length. In one preferred embodiment, each epitope is limited to 3 amino acids in length. In some embodiments, epitope pairs are identified in polypeptide fragments above a threshold of specificity and/or sensitivity of binding to autoimmune-positive samples. These epitope pairs are then used to generate synthetic sequences as described below.",
                                "Generation of Novel Bioactive Sequences",
                                "Using the epitopes identified from the native bioactive polypeptides described above, novel synthetic bioactive polypeptide sequences are generated and synthesized on an array for further screening. In one embodiment, each novel synthetic bioactive polypeptide comprises at least one epitope identified by the methods disclosed herein. In another embodiment, each novel synthetic bioactive polypeptide comprises at least two epitopes identified by the methods disclosed herein. In some embodiments, each novel synthetic bioactive polypeptide comprise two, three, four, or five epitopes identified by the method described herein. In some embodiments, each novel synthetic bioactive polypeptide comprises a randomly generated polypeptide sequence in addition to at least one or at least two epitope sequences. In some embodiments, the randomly generated sequence is 3, 6, 9, or 12 amino acids in length. IN a preferred embodiment, each novel synthetic bioactive polypeptide sequence comprise two 3 amino acid epitope sequences identified by the method disclosed herein, and at least one randomly generated polypeptide sequence to generate a 12 amino acid novel synthetic bioactive polypeptide sequence. In one embodiment, the novel synthetic bioactive polypeptide sequence is selected from SEQ ID NO: 1-127. In one embodiment, a plurality of novel synthetic bioactive polypeptide sequences is synthesized on an array for contact with a sample to determine sensitivity and specificity of each novel synthetic bioactive polypeptide sequence for detection of a sample with an autoimmune disorder. In one embodiment, novel synthetic bioactive polypeptides with a high sensitivity and/or specificity for detection of an autoimmune disorder are selected for further modification of random polypeptide sequence around the epitopes contained therein for screening on another polypeptide array. The methods described herein result in the generation of bioactive polypeptide sequences that act as epitopes for binding to an antibody associated with an autoimmune disease having a high sensitivity and/or specificity.",
                                "In one embodiment, a polypeptide array is generated with a plurality of synthetic bioactive polypeptide sequence provided herein. In one embodiment, the array has at least 4, 5, 6, 7, 8, 9, 10, 20, 30, 40, 50, 60, 70, 80, 90, or 100 novel synthetic bioactive polypeptide sequences generated by the methods disclosed herein. In one embodiment, the array has at least 4, 5, 6, 7, 8, 9, 10, 20, 30, 40, 50, 60, 70, 80, 90, or 100 polypeptides with a sequence selected from the group consisting of SEQ ID NO: 1-127. In one embodiment, the polypeptide array has a sensitivity of detection of an autoimmune disorder in a subject suspected of having the autoimmune disorder of greater than 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, or 99%. In one embodiment, the polypeptide array has a specificity of detection of an autoimmune disorder in a subject suspected of having the autoimmune disorder of greater than 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98%, or 99%."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "disclose novel epitope sequences",
                                "generate novel epitope sequences",
                                "discover continuous epitope sequences",
                                "recombine epitope sequences with random sequences",
                                "generate synthetic polypeptide sequences",
                                "illustrate method of identifying novel epitopes",
                                "generate overlapping polypeptide fragments",
                                "determine specificity and sensitivity of antibodies",
                                "select polypeptide fragments exceeding threshold",
                                "identify epitope sequences within polypeptide fragments",
                                "generate synthetic polypeptides with epitope sequences",
                                "determine specificity and sensitivity of synthetic polypeptides",
                                "select synthetic polypeptides exceeding threshold",
                                "identify epitopes on an antigen",
                                "generate novel bioactive sequences",
                                "synthesize novel synthetic bioactive polypeptide sequences",
                                "select novel synthetic bioactive polypeptides with high sensitivity and specificity"
                            ],
                            "num_characters": 8830,
                            "outline_medium": [
                                "generate novel epitope sequences",
                                "identify epitopes on an antigen",
                                "divide polypeptide into overlapping fragments",
                                "synthesize fragments on an array for screening",
                                "detect binding of antibodies to fragments",
                                "generate novel bioactive sequences using identified epitopes",
                                "synthesize novel sequences on an array for further screening",
                                "select sequences with high sensitivity and specificity"
                            ],
                            "outline_short": [
                                "generate novel epitope sequences",
                                "identify epitopes on an antigen",
                                "generate novel bioactive sequences",
                                "screen and select synthetic polypeptides"
                            ]
                        },
                        {
                            "title": "Bioactive Sequences and Methods of Use for Treatment",
                            "paragraphs": [
                                "Vaccines and Administration",
                                "The invention also provides a vaccine comprising the first, second and third peptides, a biologically active fragment or variant of one or more thereof, and/or a polynucleotide encoding one or more thereof. Also provided is a vaccine comprising a peptide of the invention and/or a polynucleotide of the invention.",
                                "As used herein, the term “vaccine” refers to a composition comprising or encoding peptides that can be administered to a subject sensitive to gluten to modulate the subject's response to gluten. The vaccine may reduce the immunological reactivity of a subject towards gluten. Preferably, the vaccine induces tolerance to gluten.",
                                "Administration of the vaccine to a subject may induce tolerance by clonal deletion of gluten-specific effector T cell populations, for example, gluten-specific CD4+ T cells, or by inactivation (anergy) of said T cells such that they become less responsive, preferably, unresponsive to subsequent exposure to gluten (or peptides thereof).",
                                "Alternatively, or in addition, administration of the vaccine may modify the cytokine secretion profile of the subject (for example, result in decreased IL-4, IL-2, TNFα and/or IFN-γ, and/or increased IL-10). The vaccine may induce suppressor T cell subpopulations, for example Treg cells, to produce IL-10 and/or TGFβ and thereby suppress gluten-specific effector T cells.",
                                "The vaccine of the invention can be used for prophylactic treatment of a subject capable of developing sensitivity to gluten, for example, diagnosed as carrying the HLA-DQ2 and/or HLA-DQ8 gene and/or ongoing treatment of a subject who is sensitive to gluten, for example, a subject who has celiac disease. There is considerable animal data to support the prophylactic activity of immunodominant peptides for various autoimmune and model immune conditions, for example, experimental allergic encephalitis.",
                                "As used herein, the term “treatment” includes abrogating, inhibiting, slowing, or reversing the progression of a disease or condition, or ameliorating or preventing a clinical symptom of the disease (for example, celiac disease) or condition.",
                                "The amount of vaccine (or agent, peptide, polynucleotide and/or APC) to be administered is referred to as the “effective amount”. The term “effective amount” means the amount sufficient to provide the desired therapeutic or physiological effect when administered under appropriate or sufficient conditions. Single or multiple doses may be administered. Undesirable effects, for example, side effects, are sometimes manifested along with the desired therapeutic effect; hence, a practitioner balances the potential benefits against the potential risks in determining an appropriate “effective amount”. The exact amount required will vary from subject to subject, depending on the species, age, size and general condition of the subject, mode of administration and the like. Thus, it may not be possible to specify an exact “effective amount”. However, an appropriate “effective amount” in any individual case may be determined by one of ordinary skill in the art using only routine experimentation.",
                                "The vaccine (or agent, peptide, polynucleotide and/or APC) modifies the T cell response to wheat, barley and rye in the subject, and preferably wheat, barley, rye and oats, as represented by gliadin, secalin, hordein, glutenin and optionally avedin proteins. Thus, a subject treated according to the invention preferably is able to eat at least wheat, rye, barley and optionally oats without a significant T cell response which would normally lead to symptoms of celiac disease.",
                                "The individual components of an agent of the invention may be administered in the same composition or in different compositions or a combination thereof (for example, the first and second peptide defined herein in one composition, and the third peptide in a separate composition). If in different compositions, they may be administered simultaneously or sequentially.",
                                "The agent or vaccine may include a pharmaceutically acceptable carrier. The term “pharmaceutically acceptable carrier” refers to molecular entities and compositions that do not produce an allergic, toxic or otherwise adverse reaction when administered to a subject, particularly a mammal, and more particularly a human. The pharmaceutically acceptable carrier may be solid or liquid. Useful examples of pharmaceutically acceptable carriers include, but are not limited to, diluents, excipients, solvents, surfactants, suspending agents, buffering agents, lubricating agents, adjuvants, vehicles, emulsifiers, absorbants, dispersion media, coatings, stabilizers, protective colloids, adhesives, thickeners, thixotropic agents, penetration agents, sequestering agents, isotonic and absorption delaying agents that do not affect the activity of the active agents of the invention.",
                                "The carrier can be any of those conventionally used and is limited only by chemico-physical considerations, such as solubility and lack of reactivity with the active agent, and by the route of administration. Suitable carriers for this invention include those conventionally used, for example, water, saline, aqueous dextrose, lactose, Ringer's solution, a buffered solution, hyaluronan, glycols, starch, cellulose, glucose, lactose, sucrose, gelatin, malt, rice, flour, chalk, silica gel, magnesium stearate, sodium stearate, glycerol monostearate, sodium chloride, glycerol, propylene glycol, water, ethanol, and the like. Liposomes may also be used as carriers.",
                                "Techniques for preparing pharmaceutical compositions are generally known in the art as exemplified by Remington's Pharmaceutical Sciences, 16th Ed. Mack Publishing Company, 1980.",
                                "The term “adjuvant” generally refers to an immunostimulatory substance designed to enhance the immunogenicity of one or more peptides defined herein. Preferably, the adjuvant does not produce a Th1 response and further, promotes immune tolerance and/or reduces inflammation. Suitable adjuvants include 1) an aluminium-based mineral salt adjuvant, for instance an Al(OH)3 gel or aluminium phosphate, but may also be a salt of calcium, iron or zinc; and 2) dexamethasone (Kang et al., 2008).",
                                "Administered may be orally, topically (percutaneous), parenterally, by inhalation spray or rectally in dosage unit formulations containing conventional non-toxic pharmaceutically acceptable carriers. The term “parenteral”, as used herein includes intravenous, intraarterial, intraperitoneal, intramuscular, subcutaneous, subconjunctival, intracavity, transdermal and subcutaneous injection, aerosol for administration to lungs or nasal cavity, or administration by infusion by, for example, osmotic pump.",
                                "The active compounds of the invention may be in a form suitable for oral use, for example, as tablets, troches, lozenges, aqueous or oily suspensions, dispersible powders or granules, emulsions, hard or soft capsules, or syrups or elixirs. Compositions intended for oral use may be prepared according to methods known to the art for the manufacture of pharmaceutical compositions and such compositions may contain one or more agents selected from the group consisting of sweetening agents, flavouring agents, colouring agents and preserving agents in order to provide pharmaceutically elegant and palatable preparations.",
                                "Tablets",
                                "Tablets containing the active ingredient in admixture with pharmaceutically acceptable excipients may also be manufactured by known methods. The excipients used may be for example, (1) inert diluents such as calcium carbonate, lactose, calcium phosphate or sodium phosphate; (2) granulating and disintegrating agents such as corn starch, or alginic acid; (3) binding agents such as starch, gelatin or acacia, and (4) lubricating agents such as magnesium stearate, stearic acid or talc. The tablets may be uncoated or they may be coated by known techniques to delay disintegration and absorption in the gastrointestinal tract and thereby provide a sustained action over a longer period. For example, a time delay material such as glyceryl monostearate or glyceryl distearate may be employed. They may also be coated to form osmotic therapeutic tablets for controlled release.",
                                "In some cases, formulations for oral use may be in the form of hard gelatin capsules wherein the active ingredient is mixed with an inert solid diluent, for example, calcium carbonate, calcium phosphate or kaolin. They may also be in the form of soft gelatin capsules wherein the active ingredient is mixed with water or an oil medium, for example peanut oil, liquid paraffin, or olive oil.",
                                "Aqueous Suspensions",
                                "Aqueous suspensions normally contain the active materials in admixture with excipients suitable for the manufacture of aqueous suspensions. Such excipients may include: (1) suspending agents such as sodium carboxymethylcellulose, methylcellulose, hydroxypropylmethylcellulose, sodium alginate, polyvinylpyrrolidone, gum tragacanth and gum acacia; or (2) dispersing or wetting agents such as PEG esters of C2-C18 fatty acids, Tween 80 or polyethylene oxide sorbitan monooleate, Brij or polyoxyethylene alcohol, Triton-X or Polyethylene glycol p-isooctylphenyl ether, Triton-N, and Triton A-20 or 4-(1,1,3,3-Tetramethylbutyl) phenol, polymer with formaldehyde and oxirane, DECON, Tris or 2-amino-2-hydroxymethyl-1,3-propanediol and Cremophor EL.",
                                "The aqueous suspensions may also contain one or more preservatives, for example, ethyl or n-propyl p-hydroxybenzoate; one or more colouring agents; one or more flavouring agents; and one or more sweetening agents such as sucrose, aspartame or saccharin.",
                                "Oily Suspensions",
                                "Oily suspension may be formulated by suspending the active ingredient in a vegetable oil, for example arachis oil, olive oil, sesame oil or coconut oil, a fish oil which contains omega 3 fatty acid, or in a mineral oil such as liquid paraffin. The oily suspensions may contain a thickening agent, for example beeswax, hard paraffin or cetyl alcohol. Sweetening agents and flavouring agents may be added to provide a palatable oral preparation. These compositions may be preserved by the addition of an antioxidant such as ascorbic acid.",
                                "Dispersible Powders and Granules",
                                "Dispersible powders and granules are suitable for the preparation of an aqueous suspension. They provide the active ingredient in a mixture with a dispersing or wetting agent, a suspending agent and one or more preservatives. Suitable dispersing or wetting agents and suspending agents are exemplified by those already mentioned above. Additional excipients, for example, those sweetening, flavouring and colouring agents described above may also be present.",
                                "Emulsion",
                                "The pharmaceutical composition(s) may also be in the form of oil-in-water emulsions. The oily phase may be a vegetable oil such as olive oil or arachis oils, or a mineral oil such as liquid paraffin or a mixture thereof. Suitable emulsifying agents include gum acacia, gum tragacanth, soy bean, lecithin, polyoxyethylene oxide sorbitan monooleate (Tween 80). The emulsions may also contain sweetening and flavouring agents.",
                                "Syrups and Elixirs",
                                "Syrups and elixirs may be formulated with sweetening agents, for example, glycerol, propylene glycol, sorbitol, aspartame or sucrose. Such formulations may also contain a demulcent, preservative, flavouring and colouring agents.",
                                "Injectables",
                                "The pharmaceutical composition(s) may be in the form of a sterile injectable aqueous or oleagenous suspension. This suspension may be formulated according to known methods using those suitable dispersing or wetting agents and suspending agents which have been mentioned above. The sterile injectable preparation may be a suspension in a non-toxic parenterally-acceptable diluent or solvent, for example as a solution in 1,3-butanediol. Among the acceptable carriers that may be employed are water, Ringer's solution and isotonic sodium chloride solution. In addition, sterile, fixed oils are conventionally employed as a solvent or suspending medium. For this purpose, any bland fixed oil may be employed including synthetic mono- or di-glycerides. In addition, fatty acids such as oleic acid find use in the preparation of injectables.",
                                "Compositions suitable for parenteral administration include, but are not limited to, aqueous and non-aqueous sterile injection solutions. Examples of appropriate delivery mechanisms for subcutaneous administration include, but are not limited to, implants, depots, needles, capsules, and osmotic pumps.",
                                "Sustained Release Compositions",
                                "Sustained-release compositions may be prepared. Suitable examples of sustained-release preparations include semipermeable matrices of solid hydrophobic polymers which matrices are in the form of shaped articles, for example, films, or microcapsules. Examples of sustained-release matrices include polyesters, hydrogels (for example, poly(2-hydroxyethyl-methacrylate), or poly(vinylalcohol)), polylactides, copolymers of L-glutamic acid and γ ethyl-L-glutamate, non-degradable ethylene-vinyl acetate, degradable lactic acid-glycolic acid copolymers such as the LUPRON DEPOT™ (injectable microspheres composed of lactic acid-glycolic acid copolymer and leuprolide acetate), and poly-D-(−)-3-hydroxybutyric acid. While polymers such as ethylene-vinyl acetate and lactic acid-glycolic acid enable release of molecules for over 100 days, certain hydrogels release proteins for shorter time periods.",
                                "The active agent may be entrapped in microcapsules prepared, for example, by coacervation techniques or by interfacial polymerization, for example, hydroxymethylcellulose or gelatin-microcapsules and poly-(methylmethacrylate) microcapsules, respectively, in colloidal drug delivery systems (for example, liposomes, albumin microspheres, microemulsions, nano-particles, and nanocapsules) or in macroemulsions.",
                                "Microencapsulation for sustained release has been successfully performed with human growth hormone (rhGH), interferon (rhIFN), interleukin-2, and MN rgp120. The sustained-release formulations of these proteins were developed using PLGA polymer due to its biocompatibility and wide range of biodegradable properties. The degradation products of PLGA, lactic and glycolic acids, can be cleared quickly within the human body. Moreover, the degradability of this polymer can be adjusted from months to years depending on its molecular weight and composition.",
                                "Gene Therapy",
                                "In a further embodiment, a polynucleotide encoding one or more peptides defined herein is inserted into a recombinant expression vector for the purposes of administration to the subject.",
                                "The term “recombinant expression vector” refers to a plasmid, virus or other vehicle known in the art that has been manipulated by insertion or incorporation nucleic acid encoding one or peptides. Such expression vectors contain a promoter sequence which facilitates the efficient transcription in the host of the inserted genetic sequence. The expression vector typically contains an origin of replication, a promoter, as well as specific genes which allow phenotypic selection of the transformed cells.",
                                "In one embodiment, the viral vector is derived from adeno-associated virus (AAV) and comprises a constitutive or regulatable promoter capable of driving sufficient levels of expression of the peptides defined herein. Preferably, the viral vector comprises inverted terminal repeat sequences of AAV, such as those described in WO 93/24641. In a preferred embodiment, the viral vector comprises polynucleotide sequences of the pTR-UF5 plasmid. The pTR-UF5 plasmid is a modified version of the pTR.sub.BS-UF/UF1/UF2/UFB series of plasmids (Zolotukiin et al., 1996; Klein et al., 1998).",
                                "Promoters useful with the subject invention include, for example, the cytomegalovirus immediate early promoter (CMV), the human elongation factor 1-α promoter (EF1), the small nuclear RNA promoters (U1a and U1b), α-myosin heavy chain promoter, Simian virus 40 promoter (SV40), Rous sarcoma virus promoter (RSV), adenovirus major late promoter, β-actin promoter and hybrid regulatory element comprising a CMV enhancer/β-actin promoter. These promoters have been shown to be active in a wide range of mammalian cells.",
                                "The promoters are operably linked with heterologous polynucleotide encoding one or more peptides defined herein. By “operably linked,” it is intended that the-promoter element is positioned relative to the coding sequence to be capable of effecting expression of the coding sequence.",
                                "Also contemplated for use with the vectors of the present invention are inducible and cell type specific promoters, for example, Tet-inducible promoters (Clontech, Palo Alto, Calif.) and VP16-LexA promoters (Nettelbeck et al., 1998).",
                                "Transcriptional enhancer elements which can function to increase levels of transcription from a given promoter can also be included in the vector Enhancers can generally be placed in either orientation, 3′ or 5′, with respect to promoter sequences. In addition to the natural enhancers, synthetic enhancers can be used in the present invention, for example, a synthetic enhancer randomly assembled from Spc5-12-derived elements including muscle-specific elements, serum response factor binding element (SRE), myocyte-specific enhancer factor-1 (MEF-1), myocyte-specific enhancer factor-2 (MEF-2), transcription enhancer factor-1 (TEF-1) and SP-1 (Li et al., 1999; Deshpande et al., 1997; Stewart et al., 1996; Mitchell and Tjian, 1989; Briggs et al., 1986; Pitluk et al., 1991) can be used in the vector.",
                                "The gene therapy methods can be performed by ex vivo or in vivo treatment of the patient's cells or tissues. Vectors can be introduced into suitable cells, cell lines or tissue using methods known in the art. The viral particles and vectors can be introduced into cells or tissue in vitro or in vivo. Methods contemplated include transfection, transduction, injection and inhalation, for example, vectors can be introduced into cells using liposomes containing the subject vectors, by direct transfection with vectors alone, electroporation or by particle bombardment.",
                                "Dosage",
                                "It is especially advantageous to formulate the active in dosage unit form for ease of administration and uniformity of dosage. “Dosage unit form” as used herein refers to physically discrete units suited as unitary dosages for the subject to be treated; each unit containing a predetermined quantity of active agent calculated to produce the desired therapeutic effect in association with the required pharmaceutical carrier. The specification for the dosage unit forms are dictated by and directly dependent on the unique characteristics of the active agent and the particular therapeutic effect to be achieved, and the limitations inherent in the art of compounding such an active agent for the treatment of subjects. Alternatively, the compositions may be presented in multi-dose form.",
                                "Examples of dosage units include sealed ampoules and vials and may be stored in a freeze-dried condition requiring only the addition of the sterile liquid carrier immediately prior to use.",
                                "The agent or vaccine may also be included in a container, pack, or dispenser together with instructions for administration.",
                                "The actual amount administered (or dose or dosage) and the rate and time-course of administration will depend on the nature and severity of the condition being treated. Prescription of treatment, for example, decisions on dosage, timing, frequency, etc., is within the responsibility of general practitioners or specialists (including human medical practitioner, veterinarian or medical scientist) and typically takes account of the disorder to be treated, the condition of the subject, the site of delivery, the method of administration and other factors known to practitioners. Examples of techniques and protocols can be found in Remington's Pharmaceutical Sciences, 18th Ed. (1990), Mack Publishing, Company, Easton, Pa., U.S.A.). The dose, dose frequency, duration, route of administration and need for maintenance therapy could be based upon the criteria for other peptide immunotherapeutics.",
                                "Effective amounts may be measured from ng/kg body weight to g/kg body weight per minute, hour, day, week or month.",
                                "When in vivo administration of an agent or vaccine of the invention is employed, normal dosage amounts may vary from about 10 ng/kg to up to 100 mg/kg of mammal body weight or more per day, preferably about 1 μg/kg/day to 10 mg/kg/day, depending upon the route of administration. Guidance as to particular dosages and methods of delivery is provided in the literature.",
                                "Toxicity and therapeutic efficacy of the agent or vaccine can be determined by standard pharmaceutical procedures in cell cultures or experimental animals by determining the IC50 and the maximal tolerated dose. The data obtained from these cell culture assays and animal studies can be used to formulate a range suitable for humans.",
                                "Diagnosis and Efficacy of Treatment",
                                "The peptides defined herein are also useful as a diagnostic agent.",
                                "In one example, gluten tolerance is assessed by measuring IL-10 and/or TGFβ secreted from stimulated cells, for example, Treg cells, exposed to the peptides defined herein. Treg cells are characterised by their capacity to produce large amounts of IL-10 and TGFβ. IL-10 is considered to be one of the main cytokines involved in immunosuppression; a target for suppression seems to be the transcriptional control of IL-2 in effector cells.",
                                "In another example, gluten tolerance is assessed by measuring IFNγ secreted from stimulated cells, for example, gluten-specific CD4+ T cells.",
                                "The diagnostic test may be performed in vitro using whole blood or cells isolated and/or fractionated therefrom.",
                                "In one example, the cells have been previously exposed to one or more of the peptides (either alone, conjugated to an MHC molecule or fragment thereof, or peptide loaded APC). In another example, the cells are stimulated in vitro by coincubation with the peptides (either alone, conjugated to an MHC molecule or fragment thereof, or peptide loaded APC).",
                                "The direct T cell mediated effects of the agent can be monitored by functional assays utilising cells isolated from peripheral blood or tissue (for example, the small intestine). Effects of peptide administration down stream to cognate T cells could be assessed using immune cell types, tissues, biological fluids (for example, plasma, intestinal secretions, urine or stool).",
                                "In general the biological effects of peptides recognised by cognate T cells are either pro-inflammatory or tolerogenic, depending on the dose regimen, mode of administration and whether the peptides are modified or co-administered with another compound that has immunological properties, for example, an adjuvant. These and other peptides selected for use in peptide based therapeutic vaccines are generally short (<29 amino acids), aqueous-soluble, without innate immune effects and recognised by a substantial proportion of pathogenic T ells. Based upon observations in animal models of T cell mediated disease and in other human diseases, initial administration would be followed by activation of cognate T cells. However, repeated administration of the agent is expected to induce T cell anergy and/or tolerance. Ongoing regular peptide administration would be expected to maintain tolerance to gluten, suppress inflammation in the small intestine and inhibit pro-inflammatory gluten-specific T cells throughout the body.",
                                "Hence, the key marker of therapeutic success would be the absence of inflammation in the small intestine following deliberate gluten ingestion. Surrogate markers of immunity likely to predict normal or inflamed intestinal tissue after gluten ingestion includes a wide range of assays utilizing pure or crude mixtures of immune cells, biological fluids, or tissue samples, to measure soluble or cell-associated proteins or small molecules associated with immune activation, inflammation, or tolerance. These assays are well-known to immunologists, immuno-histologists, and clinicians familiar with immune diseases in rodents, humans, and in particular, celiac disease. Markers, more specifically, that assess the activity of celiac disease and gluten-induced immunity include small bowel histology, serum IgA and IgG specific gliadin (protein or peptide) and for various host proteins including tTG.",
                                "Generic and specific markers of immunity in celiac disease that might be adapted for use in monitoring the peptide immunotherapy for celiac disease or for diagnosis of celiac disease include the following:",
                                "(a) Direct effects of peptides on the CD4+ T cell isolated from blood or tissue can be monitored ex vivolin vitro by peptide-stimulated cytokine release, T-cell proliferation, or determination of CD4+ T cell markers that may be altered in vivo.",
                                "(b) The frequency and phenotype of individual CD4+ T cells specific for the peptides or gluten generally can be assessed by direct enumeration of cells, for example, by FACS analysis. Oral ingestion of gluten in patients with celiac disease normally following a gluten free diet is known to stimulate T cells specific for the peptides and gluten generally. A clinical test such as gluten challenge may be used to assess the T cells induced in blood or other tissues. The phenotype of isolated T cells could then be assessed fresh or following short-term expansion in vitro. Assays of T cells may rely upon MHC-peptide complexes, antigen-stimulated intracellular cytokine, or other cell surface markers induced on antigen-activated T cells. Functional status of CD4+ T cells is correlated with the presence of various cell-surface and intra-cellular markers, for example, activation markers including CD25 and CD69, or of “tolerance” and regulatory T cell function, for example, GITR and FOXP3. Production of cytokines such as IFNγ, IL-4, IL-5 and IL-13, and of IL-17 would be considered pro-inflammatory for classic Th1, Th2 or Th17 pro-inflammatory immune responses. In contrast, secretion of IL-10 and TGFβ are associated with tolerogenic immune responses. It would be expected markers of pro-inflammatory immune responses would decline and/or markers of tolerogenic immune responses would strengthen.",
                                "(c) Effects of peptides on CD4+ T cells can also be measured using mixtures of cells, for example, whole blood, PBMC, mononuclear cells isolated from tissue, or using tissue incubated with the peptides. Assays capable of measuring individual or multiple proteins or RNA encoding relevant immunological or disease-associated proteins such as cytokines and chemokines could be assessed after short-term incubation with the peptides. Assays such as IFN-γ ELISpot using PBMC before and or after administration of gluten or peptides themselves to the patient, or multiplex assays of chemokines and cytokines using PBMC are capable of detecting the biological effects of peptide-specific T cells from patients. The therapeutic effect of the peptides would be indicated by a shift from markers associated with pro-inflammatory immune responses to markers associated with immune tolerance (for example, IL-10) and general reduction in pro-inflammatory markers such as IFN-γ.",
                                "(d) Effects of peptides on tissue may be practical; functional assays could take the form of direct application of peptide to the skin to assess delayed-type hypersensitivity, as in the Mantoux test for tuberculosis, which involves intradermal application of PPD (purified protein derivative) and assessment of the diameter of redness at the injection site 24-72 h later. The peptides may also be applied to other mucosal and skin sites to assess in the same manner. In clinical practice, it is both the peptide and grain derived protein-stimulated immune response that is important in celiac disease. For example, it is predicted that immunotherapy using the selected peptides would not only lead to suppression of the immune response stimulated by T cells specific for the peptides but also “tolerance” would be “infectious” and also lead to suppression of pro-inflammatory immunity to other gluten-derived peptides and gluten itself. Hence, the effects of the peptide therapy could also be monitored using gluten from various grains (wheat, rye, barley) in celiac disease, in place of peptide in the assays described above. Indeed, peptide therapy for cat-sensitive asthma has been monitored by such a skin test utilizing the whole protein antigen from which the therapeutic peptides are derived (Oldfield et al., 2002).",
                                "(e) Ultimately, the clinical effects of the peptide immunotherapy would be assessed by histologic examination of tissues exposed to dietary gluten, typically the small bowel, but in experimental settings oral and rectal mucosa have also bee assessed, and in principle other sites such as oesophagus and colon might also be assessed. Tissue from these sites could be collected by direct visualization, typically by endoscopic biopsy. Direct visualization by endoscopy has also been used to diagnose celiac disease according to the appearance of the mucosa-villous atrophy can be assessed by standard as well as magnifying and capsule endoscopy. Hence, the tolerogenic effects of the peptides may be assessed simply by detection of macroscopic tissue damage in the gastrointestinal tract.",
                                "(f) Immunoglobulin specific for the peptides or other gluten peptides, or autoantigens relevant to celiac disease would provide markers of gluten immunity relevant to disease activity, and to opsonising activity that may compromise the therapeutic effects of the peptides themselves.",
                                "(g) Presence of markers associated with anaphylaxis, such as peptide- or gluten-specific IgE or histamine release by peripheral blood basophils may also be used to predict complications of peptide immunotherapy and need to adjust or cease therapy.",
                                "Food Test",
                                "The invention also provides a method of determining whether a composition or food is capable of causing celiac disease, the method comprising detecting the presence of the agent of the invention, the peptide of the invention and/or the polynucleotide of the invention in the composition or a food sample. Typically this is performed by using a binding assay in which one or more compounds which bind one or more peptides defined herein in a specific manner is contacted with the composition and the formation of peptide/compound complex(es) is detected and used to ascertain the presence of the peptide(s). In one example, the compound is an antibody. Any suitable format of binding assay can be used. Typically, the assay utilises monoclonal antibodies to gluten peptides in a non-competitive, sandwich type ELISA. Food samples may first be extracted, optionally diluted and then tested in the assay.",
                                "The composition or food typically comprises material from a plant that expresses gluten. Such material may be a plant part, such as a harvested product (for example, seed). The material may be processed products of the plant material, such as a flour or food that comprises gluten. The processing of food material and testing in suitable binding assays is routine (see for example, Kricka, 1998). The composition or food material may be treated with tTG prior to being contacted with the compound.",
                                "In one embodiment, the composition or food material is contacted with at least 2, 3, 5, 10 or more antibodies which are specific for peptides defined herein in deamidated and/or non-deamidated form. Preferably, the antibodies are directed against sequences that are protease resistant and allow for the detection of α, β, γ and ω gliadins, and LMW and HMW glutenins in wheat, B, C and D hordeins in barley, β, γ and ω secalins in rye, and optionally avenins in oats.",
                                "Antibodies directed against the peptides/epitopes defined herein may be provided in kit form for use in an assay for the detection and/or quantification of gluten in foods.",
                                "Protease Identification",
                                "The present invention also provides a method of identifying a protease that can cleave a peptide as defined herein, the method comprising contacting the peptide with a protease under conditions to effect specific cleavage of the peptide to produce a proteolytic product and detecting the proteolytic product produced. In one example, the proteolytic product is detected, for example, using SDS-PAGE, HPLC, ELIZA, or Western Blot. In a further example, the peptide is fused to a fluorescent donor and a quenching acceptor so as to enable intramolecular resonance energy transfer between the fluorescent donor and the quenching acceptor. Upon cleavage, the donor and acceptor are separated, allowing detection of the donor's fluorescent emission. Typically the peptide separates the fluorescent donor and the quenching acceptor at a distance of less than about 100 angstroms. The fluorescent donor can be attached to the peptide's C-terminus, and the quenching acceptor can be attached to the peptide's N-terminus, or vice versa.",
                                "Methods of Use of Arrays with Bioactive Sequences",
                                "Any of the arrays described herein can be used as a research tool or in a research application. In one aspect, arrays can be used for high throughput screening assays. For example, enzyme substrates (i.e., peptides on a peptide array described herein) can be tested by subjecting the array to an enzyme and identifying the presence or absence of enzyme substrate(s) on the array, e.g., by detecting at least one change among the features of the array.",
                                "Arrays can also be used in screening assays for ligand binding, to determine substrate specificity, or for the identification of peptides that inhibit or activate proteins. Labeling techniques, protease assays, as well as binding assays useful for carrying out these methodologies are generally well-known to one of skill in the art.",
                                "In some embodiments, an array can be used to represent a known protein sequence as a sequence of overlapping peptides. For example, the amino acid sequence of a known protein is divided into overlapping sequence segments of any length and of any suitable overlapping frame, and peptides corresponding to the respective sequence segments are in-situ synthesized as disclosed herein. The individual peptide segments so synthesized can be arranged starting from the amino terminus of the known protein.",
                                "In some embodiments, an array is used in a method wherein the antigenic representation of the array includes at least one region where the whole antigen sequence of a known protein is spanned via epitope sliding; the immunoactive regions of the antigen are determined by contacting one or more clinical samples on the array or a plurality of different arrays, and the set of peptide sequences required to represent the known protein antigen are reduced.",
                                "In some embodiments, a sample is applied to an array having a plurality of random peptides. The random peptides can be screened and BLASTed to determine homologous domains with, e.g., a 90% or more identity to a given antigenic sequence. In some aspect, the whole antigenic sequence can then be synthesized and used to identify potential markers and/or causes of a disease of interest.",
                                "In some embodiments, an array is used for high throughput screening of one or more genetic factors. Proteins associated with a gene can be a potential antigen and antibodies against these gene related proteins can be used to estimate the relation between gene and a disease.",
                                "In another example, an array can be used to identify one or more biomarkers. Biomarkers can be used for the diagnosis, prognosis, treatment, and management of diseases. Biomarkers may be expressed, or absent, or at a different level in an individual, depending on the disease condition, stage of the disease, and response to disease treatment. Biomarkers can be, e.g., DNA, RNA, proteins (e.g., enzymes such as kinases), sugars, salts, fats, lipids, or ions.",
                                "Arrays can also be used for therapeutic purposes, e.g., identifying one or more bioactive agents. A method for identifying a bioactive agent can comprise applying a plurality of test compounds to an array and identifying at least one test compound as a bioactive agent. The test compounds can be small molecules, aptamers, oligonucleotides, chemicals, natural extracts, peptides, proteins, fragment of antibodies, antibody like molecules or antibodies. The bioactive agent can be a therapeutic agent or modifier of therapeutic targets. Therapeutic targets can include phosphatases, proteases, ligases, signal transduction molecules, transcription factors, protein transporters, protein sorters, cell surface receptors, secreted factors, and cytoskeleton proteins.",
                                "In another aspect, an array can be used to identify drug candidates for therapeutic use. For example, when one or more epitopes for specific antibodies are determined by an assay (e.g., a binding assay such as an ELISA), the epitopes can be used to develop a drug (e.g., a monoclonal neutralizing antibody) to target antibodies in disease.",
                                "In one aspect, also provided are arrays for use in medical diagnostics. An array can be used to determine a response to administration of drugs or vaccines. For example, an individual's response to a vaccine can be determined by detecting the antibody level of the individual by using an array with peptides representing epitopes recognized by the antibodies produced by the induced immune response. Another diagnostic use is to test an individual for the presence of biomarkers, wherein samples are taken from a subject and the sample is tested for the presence of one or more biomarkers.",
                                "Arrays can also be used to stratify patient populations based upon the presence or absence of a biomarker that indicates the likelihood a subject will respond to a therapeutic treatment. The arrays can be used to identify known biomarkers to determine the appropriate treatment group. For example, a sample from a subject with a condition can be applied to an array. Binding to the array may indicate the presence of a biomarker for a condition. Previous studies may indicate that the biomarker is associated with a positive outcome following a treatment, whereas absence of the biomarker is associated with a negative or neutral outcome following a treatment. Because the patient has the biomarker, a health care professional may stratify the patient into a group that receives the treatment.",
                                "In some embodiments, a method of detecting the presence or absence of a protein of interest in a sample can include obtaining an array disclosed herein and contacted with a sample suspected of comprising the protein of interest; and determining whether the protein of interest is present in the sample by detecting the presence or absence of binding to one or more features of the array.",
                                "In some embodiments, a method of identifying a vaccine candidate can include obtaining an array disclosed herein contacted with a sample derived from a subject previously administered the vaccine candidate, wherein the sample comprises a plurality of antibodies; and determining the binding specificity of the plurality of antibodies to one or more features of the array. In some embodiments, the features comprise a plurality of distinct, nested, overlapping peptide chains comprising subsequences derived from a source protein having a known sequence.",
                                "In one embodiment, a method of diagnosing and treating an autoimmune disorder is provided. In one embodiment, use of the peptide chip to detecting multiplex antibodies in a serum sample is provided. In some embodiments, this method is performed in a single assay. In some embodiments, this method is performed on a single peptide chip. In one embodiment, this method provides the ability to detect multiple chemokines from an autoimmune disorder. In one embodiment, this method provides the ability to identify the subtype and severity of an autoimmune disorder.",
                                "In one embodiment, methods of diagnosing using the peptide chip have a reproducibility of R2 greater than 0.95. In some embodiments, the methods of diagnosing an autoimmune disorder using the peptide chip have a specificity of greater than 0.99 and/or a sensitivity of greater than 0.99.",
                                "In one embodiment, the autoimmune disorder is celiac disease. In another embodiment, the autoimmune disorder is lupus erythematosis. In another embodiment, the autoimmune disorder is rheumatoid arthritis.",
                                "The peptide array disclosed herein may be used to identify epitopes related to autoimmune diseases. In one embodiment, the epitopes are B cell epitopes, T cell epitopes, or epitopes related to inflammatory response (e.g., TNF). Epitopes related to inflammatory response may be identified by the present invention using a cytokine assay. In one embodiment, the peptide sequences identified by this cytokine assay may be used in immunosuppressive vaccines. In other embodiments, the peptide sequences may be used as part of a peptide array to identify the presence of inflammatory molecules in a subject suspected of having an inflammatory disorder, e.g., an autoimmune disorder. In one embodiment, the peptide array may be used to identify B cell epitopes. In this embodiment, epitopes binding to antibodies from a sample associated with an autoimmune disorder are identified. These peptides are then used on another peptide array useful for diagnosis of an autoimmune disorder. In one embodiment, diagnosis of an autoimmune disorder includes identification of autoimmune disorder subtype. In some embodiments, the identified B cell epitopes are used to measure a patient's response to treatment of an autoimmune disorder. In one embodiment, T cell epitopes may be identified by the present invention using an MHC complex assay (e.g., a human leukocyte antigen assay). Epitopes identified as interacting with the MHC complex in a subject identified as having an autoimmune disorder may be used for treatment of the autoimmune disorder. Such peptides may be useful in a vaccine or other drugs for T cell regulation. A flow chart depicting the identification of epitope sequences and their use, according to several embodiments of the invention, is shown in FIG. 3.",
                                "In some embodiments the invention includes bioinformatic analysis of data to, e.g., identify informative sub-sequences, and subsequent synthesis and testing of synthetic peptide sequences useful for diagnosing a condition. These bioinformatic methods are carried out, in part, using a computer to accomplish one or more of the following steps: 1) generating subsequences from longer sequences; 2) tabulating and ranking the occurrence of subsequences in positive hits from samples bound to arrays of tiled naturally-occurring peptide sequences; 3) analyzing hits to arrays comprising synthetic sequences that include informative subsequences.",
                                "Unless specifically stated otherwise as apparent from the following discussion, it is appreciated that throughout the description, discussions utilizing terms such as “processing” or “computing” or “calculating” or “determining” or “displaying” or “analyzing” or “comparing” or “identifying” or the like, refer to the action and processes of a computer system, or similar electronic computing device, that manipulates and transforms data represented as physical (electronic) quantities within the computer system's registers and memories into other data similarly represented as physical (electronic) quantities within the computer system's registers and memories into other data similarly represented as physical quantities within the computer system memories or registers or other such information storage, transmission or display devices.",
                                "The present invention also relates to system apparatus for performing the operations herein. This apparatus may be specially constructed for the required purposes, or it may comprise a general purpose computer selectively activated or reconfigured by a computer program stored in the computer. Such a computer program may be stored in a computer readable storage medium, such as, but is not limited to, any type of disk including floppy disks, optical disks, CD-ROMs, and magnetic-optical disks, read-only memories (ROMs), random access memories (RAMs), EPROMs, EEPROMs, magnetic or optical cards, or any type of media suitable for storing electronic instructions, and each coupled to a computer system bus.",
                                "Various general purpose systems may be used with programs in accordance with the teachings herein, or it may prove convenient to construct more specialized apparatus to perform the required method procedures. The required structure for a variety of these systems will appear from the description below. In addition, the present invention is not described with reference to any particular programming language. It will be appreciated that a variety of programming languages may be used to implement the teachings of the invention as described herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define vaccine",
                                "describe vaccine composition",
                                "explain vaccine administration",
                                "describe vaccine effects on T cell response",
                                "define effective amount",
                                "describe factors affecting effective amount",
                                "explain vaccine modification of T cell response",
                                "describe individual component administration",
                                "define pharmaceutically acceptable carrier",
                                "list examples of pharmaceutically acceptable carriers",
                                "describe tablet preparation",
                                "list tablet excipients",
                                "describe tablet coating",
                                "describe hard gelatin capsules",
                                "describe soft gelatin capsules",
                                "describe aqueous suspensions",
                                "list aqueous suspension excipients",
                                "describe oily suspensions",
                                "list oily suspension excipients",
                                "describe dispersible powders and granules",
                                "list dispersible powder and granule excipients",
                                "describe emulsions",
                                "list emulsion excipients",
                                "describe syrups and elixirs",
                                "list syrup and elixir excipients",
                                "describe injectables",
                                "list injectable excipients",
                                "describe sustained release compositions",
                                "list sustained release matrix materials",
                                "describe microencapsulation",
                                "describe gene therapy",
                                "define recombinant expression vector",
                                "describe viral vector",
                                "list promoters",
                                "describe transcriptional enhancer elements",
                                "describe gene therapy methods",
                                "describe dosage unit form",
                                "describe container and instructions for administration",
                                "introduce bioactive sequences and methods of use for treatment",
                                "describe dosage and administration of bioactive sequences",
                                "discuss diagnosis and efficacy of treatment",
                                "introduce diagnostic test for gluten tolerance",
                                "describe in vitro diagnostic test using whole blood or cells",
                                "discuss direct T cell mediated effects of bioactive sequences",
                                "describe effects of bioactive sequences on CD4+ T cells",
                                "introduce functional assays for measuring effects of bioactive sequences",
                                "describe assays for measuring cytokine release and T cell proliferation",
                                "discuss effects of bioactive sequences on tissue",
                                "introduce histologic examination of tissues exposed to dietary gluten",
                                "describe immunoglobulin specific for bioactive sequences",
                                "discuss presence of markers associated with anaphylaxis",
                                "introduce food test for determining presence of bioactive sequences",
                                "describe binding assay for detecting bioactive sequences in food samples",
                                "discuss protease identification method",
                                "describe method of identifying protease that can cleave bioactive sequences",
                                "introduce methods of use of arrays with bioactive sequences",
                                "describe use of arrays as research tool or in research application",
                                "discuss high throughput screening assays using arrays",
                                "introduce labeling techniques and protease assays",
                                "describe use of arrays in screening assays for ligand binding",
                                "discuss identification of peptides that inhibit or activate proteins",
                                "introduce use of arrays in method of representing known protein sequence",
                                "describe use of arrays in method of determining immunoactive regions",
                                "discuss use of arrays in method of identifying biomarkers",
                                "introduce use of arrays in method of identifying bioactive agents",
                                "describe use of arrays in method of identifying drug candidates",
                                "discuss use of arrays in medical diagnostics",
                                "introduce use of arrays in determining response to administration of drugs or vaccines",
                                "describe use of arrays in stratifying patient populations",
                                "discuss use of arrays in detecting presence or absence of protein of interest",
                                "introduce use of arrays in identifying vaccine candidate",
                                "describe use of arrays in diagnosing and treating autoimmune disorder",
                                "discuss use of arrays in detecting multiplex antibodies in serum sample",
                                "introduce use of arrays in identifying epitopes related to autoimmune diseases",
                                "describe use of arrays in identifying B cell epitopes",
                                "discuss use of arrays in identifying T cell epitopes",
                                "introduce use of arrays in measuring patient's response to treatment",
                                "describe bioinformatic analysis of data",
                                "discuss generating subsequences from longer sequences",
                                "introduce tabulating and ranking occurrence of subsequences",
                                "describe analyzing hits to arrays comprising synthetic sequences",
                                "discuss system apparatus for performing operations",
                                "introduce computer program stored in computer readable storage medium",
                                "describe general purpose systems used with programs",
                                "discuss specialized apparatus to perform required method procedures",
                                "introduce structure for various systems",
                                "describe programming languages used to implement teachings",
                                "discuss variety of programming languages used",
                                "conclude patent application"
                            ],
                            "num_characters": 44913,
                            "outline_medium": [
                                "define vaccine",
                                "describe administration of vaccine",
                                "explain mechanism of tolerance induction",
                                "describe prophylactic and therapeutic uses",
                                "define treatment",
                                "describe effective amount",
                                "explain modification of T cell response",
                                "describe administration of individual components",
                                "define pharmaceutically acceptable carrier",
                                "describe techniques for preparing pharmaceutical compositions",
                                "describe adjuvants",
                                "describe routes of administration",
                                "describe oral formulations",
                                "describe aqueous suspensions",
                                "describe oily suspensions",
                                "describe dispersible powders and granules",
                                "describe emulsions",
                                "describe injectables",
                                "describe gene therapy",
                                "introduce bioactive sequences and methods of use for treatment",
                                "describe dosage and administration of bioactive sequences",
                                "discuss diagnosis and efficacy of treatment",
                                "introduce diagnostic test for gluten tolerance",
                                "describe in vitro and ex vivo methods for assessing T cell response",
                                "discuss markers of immunity and tolerance",
                                "describe methods for monitoring therapeutic effects",
                                "introduce food test for detecting gluten",
                                "describe binding assay for detecting gluten peptides",
                                "discuss protease identification method",
                                "introduce methods of use of arrays with bioactive sequences",
                                "describe high throughput screening assays",
                                "discuss ligand binding and substrate specificity assays",
                                "introduce array-based method for identifying biomarkers",
                                "describe method for identifying bioactive agents",
                                "discuss therapeutic uses of arrays",
                                "introduce medical diagnostic uses of arrays",
                                "describe method for detecting presence or absence of protein of interest",
                                "discuss method for identifying vaccine candidates",
                                "introduce method for diagnosing and treating autoimmune disorders",
                                "describe use of peptide chip for detecting multiplex antibodies",
                                "discuss epitope identification for autoimmune diseases",
                                "introduce bioinformatic analysis of data",
                                "describe computer-based methods for analyzing data",
                                "discuss system apparatus for performing operations"
                            ],
                            "outline_short": [
                                "define vaccine composition",
                                "describe administration and efficacy",
                                "outline treatment options",
                                "specify effective amount and dosage",
                                "describe pharmaceutical carriers and adjuvants",
                                "outline formulation options (tablets, capsules, suspensions, etc.)",
                                "describe injectable and sustained release compositions",
                                "outline gene therapy options",
                                "specify dosage unit forms and administration instructions",
                                "introduce bioactive sequences and methods of use for treatment",
                                "describe dosage and administration of bioactive sequences",
                                "motivate diagnostic test for gluten tolerance",
                                "describe in vitro diagnostic test using whole blood or cells",
                                "outline effects of peptides on CD4+ T cells",
                                "describe methods for monitoring therapeutic effects of peptides",
                                "introduce food test for detecting gluten",
                                "describe method of identifying protease that can cleave peptide",
                                "outline methods of use of arrays with bioactive sequences",
                                "describe high throughput screening assays using arrays",
                                "motivate use of arrays for therapeutic purposes",
                                "describe diagnostic and therapeutic applications of arrays"
                            ]
                        },
                        {
                            "title": "Compositions",
                            "paragraphs": [
                                "Formulations",
                                "Disclosed herein are formulations such as photoactive formulations (e.g., photoresist formulations), coupling formulations, and linker formulations. These formulations can be useful in the manufacture and/or use of, e.g., substrates and/or peptide arrays disclosed herein. Generally the components of each formulation disclosed herein are soluble in water at room temperature (app. 25° C.).",
                                "Photoactive Formulations",
                                "Disclosed herein are photoactive formulations. In one aspect, a photoactive formulation can include a chemical amplification resist formulation. In chemical amplification (CA) resists, the primary photochemical event produces a mobile catalyst that, typically during later postexposure baking (PEB), goes on to induce a cascade of material transforming secondary catalytic events within a 5-25 nm radius. Such chemical amplification thus makes possible an overall quantum yield (the number of material reactions divided by number of absorbed photons) of up to several hundred. A CA resist typically contains a small amount (app. 1-5% by weight) of radiation-sensitive catalyst precursor, e.g., a photoacid generator (PAG); a plurality of chemical groups that can react by elimination, addition, or rearrangement in the presence of catalyst; a polymer matrix able to disperse other components in a smooth clear film; and optional additives to improve performance or processability, e.g., surfactants, photosensitizers, and etch resistors.",
                                "In one aspect, a photoactive coupling formulation can include a photoactive compound. Photoactive compounds may include photobase or photoacid generators. Exposure of the photoactive compounds to electromagnetic radiation is a primary photochemical event that produces a compound that goes on to induce material transforming secondary reactions within a diffusion-limited radius. A photoactive coupling formulation may comprise a photoactive compound comprising a radiation-sensitive catalyst precursor, e.g., a photoacid generator (PAG); a plurality of chemical groups that can react by elimination, addition, or rearrangement in the presence of catalyst; and optional additives to improve performance or processability, e.g., surfactants, photosensitizers, and etch resistors.",
                                "In some embodiments, a photoactive coupling formulation includes a photobase generator and a photo sensitizer in a polymer matrix dispersed in a solvent. In some embodiments, the polymer in the composition of the photoresist is generally inert and non-crosslinking but the photoactive compounds will readily generate sufficient quantities of photobase upon exposure to electromagnetic radiation to bring about a desired reaction to produce a product at acceptable yield.",
                                "In some embodiments, a photoactive formulation is not chemically amplified, i.e., all acid generated is consumed in the reaction (e.g., all the tboc is deprotected and acid is consumed in the reaction). A tboc protected amino acid can be added along with a photoresist formulation to verify if chemical amplification occurs. In some embodiments, photosensitizers are optional when 248 nm is used.",
                                "In some embodiments, a photoactive formulation includes a water soluble photoacid generator and a water soluble photo sensitizer in a polymer matrix dispersed in water. In some embodiments, the polymer in the composition of the photoresist is generally inert and non-crosslinking but the photo reactive components will readily generate sufficient quantities of photoacid upon exposure in a deep ultra violet radiation tool to bring about a desired reaction to produce a product at acceptable yield.",
                                "In some embodiments, a photoactive formulation can include various components such as a water soluble photosensitizer, a water soluble photo active compound, a water soluble polymer, and a solvent. Specific examples of photoactive formulations are shown in Table 1.",
                                "Photosensitizers are generally added to a formulation to increase the sensitivity of the photoacid generator and bring the absorption spectrum of the formulation near deep UV (248 nm). In some embodiments, a water soluble photosensitizer can be a thioxanthenone. In some embodiments, a general thioxanthenone structure is shown below:",
                                "In some embodiments, the A, R1, R2, and R3 groups of the thioxanthenone structure shown above can be:",
                                "In some embodiments, a water soluble photosensitizer can be about 0.5-5% by weight of the total formulation concentration. In some embodiments, a water soluble photosensitizer can be about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a water soluble photoactive compound can be a photoacid generator (PAG) or a photobase generator (PBG). Photoacid generators (or PAGs) are cationic photoinitiators. A photoinitiator is a compound especially added to a formulation to convert absorbed light energy, UV or visible light, into chemical energy in the form of initiating species, e.g., free radicals or cations. Cationic photoinitiators are used extensively in optical lithography. The ability of some types of cationic photo initiators to serve as latent photochemical sources of very strong protonic or Lewis acids is generally the basis for their use in photo imaging applications. In some embodiments, a photoacid generator is a water soluble iodonium salt, a water soluble polonium salt, or a water soluble sulfonium salt. In some embodiments, a photoacid generator is (4-Methoxyphenyl)phenyliodonium or trifluoromethanesulfonate. In some embodiments, a photoacid generator is (2,4-dihydroxyphenyl)dimethylsulfonium triflate or (4 methoxyphenyl)dimethylsulfonium triflate, shown below:",
                                "In some embodiments, a photoacid generator is iodonium and sulfonium salts of triflates, phosphates and/or antimonates, 1,3-Bis[(2-nitrobenzyl)oxycarbonyl-4-piperidyl]propane, or 1,3-Bis[(1-(9-fluorenylmethoxycarbonyl)-4-piperidyl]propane. In some embodiments, a photoacid generator is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a photoacid generator is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a water soluble polymer is a water soluble non-crosslinking inert polymer. In some embodiments, a water soluble polymer is a polyvinyl pyrrolidone. The general structure of polyvinyl pyrrolidone is as follows, where n is any positive integer greater than 1:",
                                "In some embodiments, a water soluble polymer is a polymer of vinyl pyrrolidone. In some embodiments, a water soluble polymer is polyvinyl pyrrolidone. Poly vinyl pyrrollidone is soluble in water and other polar solvents. When dry it is a light flaky powder, which generally readily absorbs up to 40% of its weight in atmospheric water. In solution, it has excellent wetting properties and readily forms films.",
                                "In some embodiments, a water soluble polymer is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a water soluble polymer is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a solvent is water, ethyl lactate, or a combination thereof. In some embodiments, ethyl lactate can be dissolved in water to more than 50% to form a solvent. In some embodiments, a solvent can be about 10% propylene glycol methyl ether acetate (PGMEA) and about 90% DI water. In some embodiments, a solvent can include up to about 20% PGMEA.",
                                "In some embodiments, the solvent is about 80-90% by weight of the total formulation concentration. In some embodiments, the solvent is about less than 70, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, or greater than 99% by weight of the total formulation concentration.",
                                "The photoactive coupling formulation comprises coupling molecules. The coupling molecules can include amino acids. In some instances all peptides on an array described herein are composed of naturally occurring amino acids. In others, peptides on an array described herein can be composed of a combination of naturally occurring amino acids and non-naturally occurring amino acids. In other cases, peptides on an array can be composed solely from non-naturally occurring amino acids. Non-naturally occurring amino acids include peptidomimetics as well as D-amino acids. The R group can be found on a natural amino acid or a group that is similar in size to a natural amino acid R group. Additionally, unnatural amino acids, such as beta-alanine, phenylglycine, homoarginine, aminobutyric acid, aminohexanoic acid, aminoisobutyric acid, butylglycine, citrulline, cyclohexylalanine, diaminopropionic acid, hydroxyproline, norleucine, norvaline, ornithine, penicillamine, pyroglutamic acid, sarcosine, and thienylalanine can also be incorporated. These and other natural and unnatural amino acids are available from, for example, EMD Biosciences, Inc., San Diego, Calif. In some embodiments, a coupling molecule comprises a naturally occurring or artificial amino acid or polypeptide. Examples of coupling molecules include Boc-Glycine-OH and Boc-Histidine-OH. In some embodiments, the artificial amino acid is a D-amino acid. In some embodiments, a coupling molecule is 1-2% by weight of the total formulation concentration. In some embodiments, a coupling molecule is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling molecule is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration. In some embodiments, a coupling molecule comprises a protected group, e.g., a group protected via t-Boc or F-Moc chemistry. In most instances, increasing the concentration of a coupling molecule provides the best performance.",
                                "In some embodiments, a formulation can contain a t-Boc group that helps in chemical amplification of the initial acid generated upon post exposure baking. Thus, the formulation can include a tboc protected amino acid, e.g., in order to enhance the chemical amplification during post-exposure bake. In some embodiments, this t-Boc protected amino acid would make up about 0.5-1% by weight of the formulation. In some embodiments, a protected amino acid is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a protected amino acid is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a coupling reagent is carbodiimide or triazole. In some embodiments, a coupling reagent is N-Hydroxysuccinimide (NHS). In some embodiments, a coupling reagent is 2-4% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In any of the combinations above, the formulation can be completely water strippable even after photo exposure and bake. Thus, in some embodiments, only water is used to wash away the photoactive formulation after exposure and post bake.",
                                "Carboxylic Acid Activating Formulations",
                                "Disclosed herein are activating formulations for activating carboxylic acid so that it reacts with a free amino group of a biomolecule, e.g., an amino acid, peptide, or polypeptide. An activating formulation can include components such as a carboxylic acid group activating compound and a solvent. In some embodiments, the carboxylic acid group activating compound is a carbodiimide or a carbodiimide precursor. In some embodiments, the carbodiimide is 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide. In some embodiments, the carboxylic acid group activating compound is N-Hydroxysuccinimide [NHS]. In some embodiments, the carboxylic acid group activating compound is selected from: 1-Ethyl-3-(3-dimethylaminopropyl)carbodiimide [EDC], N-hydroxysuccinimide [NHS], 1,3-Diisopropylcarbodiimide [DIC], hydroxybenzotriazole [HOBt], 1-Hydroxy-7-azabenzotriazole [HOAt], (O-(7-azabenzotriazol-1-yl)-N,N,N′,N′-tetramethyluronium hexafluorophosphate) [HATU], benzotriazol-1-yl-oxytripyrrolidinophosphonium hexafluorophosphate [PyBOP], and N,N-Diisopropylethylamine [DIEA]. In some embodiments, the solvent is water. In some embodiments, the solvent is N-methylpyrrolidone [NMP]. In some embodiments, the carboxylic acid group activating compound converts the carboxylic acid to a carbonyl group (i.e., carboxylic acid group activation). In some embodiments, the carboxylic acid group is activated for 5, 10, 15, 20, 30, 45, or 60 minutes after exposure to an activation formulation.",
                                "In some embodiments, the activating formulation comprises 4% by weight of 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide and 2% by weight of N-hydroxysuccinimide [NHS]. dissolved in deionized water. In some embodiments, the activating formulation comprises 4% by weight of 1,3-Diisopropylcarbodiimide [DIC] and 2% by weight of hydroxybenzotriazole [HOBt] dissolved in NMP. In some embodiments, the activating formulation comprises 4% by weight of (O-(7-azabenzotriazol-1-yl)-N,N,N′,N′-tetramethyluronium hexafluorophosphate) (HATU) and 2% by weight of N,N-Diisopropylethylamine [DIEA] dissolved in NMP. In some embodiments, the activating formulation comprises 4% by weight of Benzotriazol-1-yl-oxytripyrrolidinophosphonium hexafluorophosphate [PyBOP] and 2% by weight of DIEA dissolved in NMP.",
                                "In some embodiments, the carboxylic acid group activating compound is a carbodiimide precursor. In one aspect, the carbodiimide precursor is converted to a carbodiimide through exposure to radiation, e.g., ultraviolet radiation. In one embodiment, the carbodiimide precursor is a thione. The carbodiimide precursor can also be referred to as a photoactivated carbodiimide. In one embodiment, photoactivated carbodiimides are used to provide site-specific activation of carboxylic acid groups on an array by spatially controlling exposure of the photoactivated carbodiimide solution to electromagnetic radiation at a preferred activation wavelength. In some embodiments, the preferred activation wavelength is 248 nm.",
                                "In some embodiments, the carbodiimide precursor is a thione that is converted to carbodiimide via photoactivation. In one aspect, the thione is converted to a hydroxymethyl phenyl carbodiimide after exposure to electromagnetic radiation. In some embodiments, the thione is 4,5-dihydro-4-(hydroxymethyl)-1-phenyl-1H-tetrazole-5-thione, 1-(3-(dimethylamino)propyl)-4-ethyl-1,4-dihydro-5H-tetrazole-5-thione, 1,4-Bis(2,2-dimethyl-1,3-dioxolan-4-ylmethyl)-1,4-dihydro-5H-tetrazole-5-thione, 4-cyclohexyl-1H-tetrazole-5(4H)-thione, or 1-phenyl-4-(piperidinomethyl) tetrazole-5(4H)-thione, and the like.",
                                "In some embodiments, the activating solution comprises a carbodiimide precursor, a solvent, and a polymer. In one embodiment, the carbodiimide precursor is 4,5-dihydro-4-(hydroxymethyl)-1-phenyl-1H-tetrazole-5-thione, 1-(3-(dimethylamino)propyl)-4-ethyl-1,4-dihydro-5H-tetrazole-5-thione, or 1,4-Bis(2,2-dimethyl-1,3-dioxolan-4-ylmethyl)-1,4-dihydro-5H-tetrazole-5-thione. In some embodiments, the carbodiimide precursor is present in the activation solution at a concentration of 2.5% by weight. In some embodiments the carbodiimide precursor is present in the activation solution at a concentration of 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, the solvent is water. In some embodiments, the solvent is about 80-90% by weight of the total formulation concentration. In some embodiments, the solvent is about less than 70, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, or greater than 99% by weight of the total formulation concentration.",
                                "In some embodiments, a polymer is a polyvinyl pyrrolidone and/or a polyvinyl alcohol. In some embodiments, a polymer is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a polymer is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a coupling reagent is a carbodiimide. In some embodiments, a coupling reagent is a triazole. In some embodiments, a coupling reagent is 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide. In some embodiments, a coupling reagent is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "Linker Formulations",
                                "Also disclosed herein is a linker formulation. A linker formulation can include components such as a solvent, a water soluble polymer, a water soluble linker molecule, and a water soluble coupling reagent. In some embodiments, the polymer is 1% by weight polyvinyl alcohol and 2.5% by weight poly vinyl pyrrollidone, the linker molecule is 1.25% by weight polyethylene oxide, the coupling reagent is 1% by weight 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide, and the solvent includes water. In some embodiments, the polymer is 0.5-5% by weight polyvinyl alcohol and 0.5-5% by weight poly vinyl pyrrollidone, the linker molecule is 0.5-5% by weight polyethylene oxide, the coupling reagent is 0.5-5% by weight 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide, and the solvent includes water.",
                                "In some embodiments, the solvent is water, an organic solvent, or a combination thereof. In some embodiments, the organic solvent is N-methyl pyrrolidone, dimethyl formamide, dichloromethane, dimethyl sulfoxide, or a combination thereof. In some embodiments, the solvent is about 80-90% by weight of the total formulation concentration. In some embodiments, the solvent is about less than 70, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, or greater than 99% by weight of the total formulation concentration.",
                                "In some embodiments, a water soluble polymer is a polyvinyl pyrrolidone and/or a polyvinyl alcohol. The general structure of polyvinyl alcohol is as follows, where n is any positive integer greater than 1:",
                                "In some embodiments, a water soluble polymer is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a water soluble polymer is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a coupling reagent is a water soluble carbodimide. In some embodiments, a coupling reagent is a water soluble triazole. In some embodiments, a coupling reagent is 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide. In some embodiments, a coupling reagent is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "A linker molecule can be a molecule inserted between a surface disclosed herein and peptide that is being synthesized via a coupling molecule. A linker molecule does not necessarily convey functionality to the resulting peptide, such as molecular recognition functionality, but can instead elongate the distance between the surface and the peptide to enhance the exposure of the peptide's functionality region(s) on the surface. In some embodiments, a linker can be about 4 to about 40 atoms long to provide exposure. The linker molecules can be, for example, aryl acetylene, ethylene glycol oligomers containing 2-10 monomer units, i.e. polyethylene glycols [PEGs], diamines, diacids, amino acids, and combinations thereof. Examples of diamines include ethylene diamine and diamino propane. Alternatively, linkers can be the same molecule type as that being synthesized (e.g., nascent polymers or various coupling molecules), such as polypeptides and polymers of amino acid derivatives such as for example, amino hexanoic acids. In some embodiments, a linker molecule is a molecule having a carboxylic group at a first end of the molecule and a protecting group at a second end of the molecule. In some embodiments, the protecting group is a t-Boc protecting group or an F-Moc protecting group. In some embodiments, a linker molecule is or includes an aryl acetylene, a polyethyleneglycol, a nascent polypeptide, a diamine, a diacid, a peptide, or combinations thereof. In some embodiments, a linker molecule is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a linker molecule is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "The unbound portion of a linker molecule, or free end of the linker molecule, can have a reactive functional group which is blocked, protected, or otherwise made unavailable for reaction by a removable protective group, e.g., t-Boc or F-Moc as noted above. The protecting group can be bound to a monomer, a polymer, or a linker molecule to protect a reactive functionality on the monomer, polymer, or linker molecule. Protective groups that can be used include all acid and base labile protecting groups. For example, peptide amine groups can be protected by t-butoxycarbonyl [t-BOC or BOC] or benzyloxycarbonyl [CBZ], both of which are acid labile, or by 9-fluorenylmethoxycarbonyl [FMOC], which is base labile.",
                                "Additional protecting groups that can be used include acid labile groups for protecting amino moieties: tert-amyloxycarbonyl, adamantyloxycarbonyl, 1-methylcyclobutyloxycarbonyl, 2-(p-biphenyl)propyl(2)oxycarbonyl, 2-(p-phenylazophenylyl)propyl(2)oxycarbonyl, alpha,alpha-dimethyl-3,5-dimethyloxybenzyloxy-carbonyl, 2-phenylpropyl(2)oxycarbonyl, 4-methyloxybenzyloxycarbonyl, furfuryloxycarbonyl, triphenylmethyl (trityl), p-toluenesulfenylaminocarbonyl, dimethylphosphinothioyl, diphenylphosphinothioyl, 2-benzoyl-1-methylvinyl, o-nitrophenylsulfenyl, and 1-naphthylidene; as base labile groups for protecting amino moieties: 9 fluorenylmethyloxycarbonyl, methylsulfonylethyloxycarbonyl, and 5-benzisoazolylmethyleneoxycarbonyl; as groups for protecting amino moieties that are labile when reduced: dithiasuccinoyl, p-toluene sulfonyl, and piperidino-oxycarbonyl; as groups for protecting amino moieties that are labile when oxidized: (ethylthio)carbonyl; as groups for protecting amino moieties that are labile to miscellaneous reagents, the appropriate agent is listed in parenthesis after the group: phthaloyl (hydrazine), trifluoroacetyl (piperidine), and chloroacetyl (2-aminothiophenol); acid labile groups for protecting carboxylic acids: tert-butyl ester; acid labile groups for protecting hydroxyl groups: dimethyltrityl. (See also, Greene, T. W., Protective Groups in Organic Synthesis, Wiley-Interscience, NY, (1981)).",
                                "Coupling Formulations",
                                "Also disclosed are coupling formulations. In some embodiments, a coupling formulation can include components such as a solvent, a water soluble polymer, a water soluble coupling molecule, a water soluble neutralization reagent, and a water soluble coupling reagent.",
                                "In some embodiments, a solvent is water, an organic solvent, or combination thereof. In some embodiments, the organic solvent is N-methyl pyrrolidone, dimethyl formamide or combinations thereof.",
                                "In some embodiments, a polymer is a water soluble vinyl pyrrolidone or a water soluble vinyl alcohol. In some embodiments, a polymer is 2.5-5% by weight of the total formulation concentration. In some embodiments, a polymer is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a polymer is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In some embodiments, a neutralization reagent can include Hunig's base. The structure of Hunig's base is:",
                                "In some embodiments, a neutralization reagent is 1-2% by weight of the total formulation concentration. In some embodiments, a neutralization reagent is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a neutralization reagent is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "The coupling molecules can include amino acids. In some embodiments, all peptides on an array described herein are composed of naturally occurring amino acids. In others, peptides on an array described herein can be composed of a combination of naturally occurring amino acids and non-naturally occurring amino acids. In other cases, peptides on an array can be composed solely from non-naturally occurring amino acids. Non-naturally occurring amino acids include peptidomimetics as well as D-amino acids. The R group can be found on a natural amino acid or a group that is similar in size to a natural amino acid R group. Additionally, unnatural amino acids, such as beta-alanine, phenylglycine, homoarginine, aminobutyric acid, aminohexanoic acid, aminoisobutyric acid, butylglycine, citrulline, cyclohexylalanine, diaminopropionic acid, hydroxyproline, norleucine, norvaline, ornithine, penicillamine, pyroglutamic acid, sarcosine, and thienylalanine can also be incorporated. These and other natural and unnatural amino acids are available from, for example, EMD Biosciences, Inc., San Diego, Calif. In some embodiments, a coupling molecule comprises a naturally occurring or artificial amino acid or polypeptide. Examples of coupling molecules include Boc-Glycine-OH and Boc-Histine-OH. In some embodiments, the artificial amino acid is a D-amino acid. In some embodiments, a coupling molecule is 1-2% by weight of the total formulation concentration. In some embodiments, a coupling molecule is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling molecule is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration. In some embodiments, a coupling molecule comprises a protected side group, e.g., a side group protected via t-Boc or F-Moc chemistry. In most instances, increasing the concentration of a coupling molecule provides the best performance.",
                                "In some embodiments, a coupling reagent is water soluble carbodimide or water soluble triazole. In some embodiments, a coupling reagent is 2-4% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about 0.5-5% by weight of the total formulation concentration. In some embodiments, a coupling reagent is about less than 0.1, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.0, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5.0, or greater than 5.0% by weight of the total formulation concentration.",
                                "In any of the combinations above, the formulation can be completely water strippable.",
                                "Substrates",
                                "Also disclosed herein are substrates. In some embodiments a substrate surface is planar (i.e., 2-dimensional). In some embodiments a substrate surface is functionalized with free carboxylic acid groups. In some embodiments, a substrate surface is functionalized with free amine groups. A surface that is functionalized with free amine groups can be converted to free carboxylic acid groups by reacting with activating the carboxylic acid groups of a molecule comprising at least two free carboxylic acid groups (e.g., converting the carboxylic acid group to a carbonyl group using carbodiimide) and reacting the molecule with the free amine groups attached to the surface of the substrate. In some embodiments, the molecule comprising multiple carboxylic acid groups is succinic anhydride, polyethylene glycol diacid, benzene-1,3,5-tricarboxylic acid, benzenehexacarboxylic acid, or carboxymethyl dextran.",
                                "In some embodiments, a substrate can include a porous layer (i.e., a 3-dimensional layer) comprising functional groups for binding a first monomer building block. In some embodiments, a substrate surface comprises pillars for peptide attachment or synthesis. In some embodiments, a porous layer is added to the top of the pillars.",
                                "Pillar Substrates",
                                "In some embodiments, a substrate can include a planar layer having an upper surface and a lower surface; and a plurality of pillars operatively coupled to the layer in positionally-defined locations, wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between about 1,000-5,000 angstroms, and wherein the plurality of pillars are present at a density of greater than about 10,000/cm2. An example of a substrate is shown in FIGS. 3B and 3C.",
                                "In some embodiments, the distance between the surface of each pillar and the upper surface of the later can be between about less than 1,000, 2,000, 3,000, 3,500, 4,500, 5,000, or greater than 5,000 angstroms (or any integer in between).",
                                "In some embodiments, the surface of each pillar is parallel to the upper surface of the layer. In some embodiments, the surface of each pillar is substantially parallel to the upper surface of the layer.",
                                "In some embodiments, the plurality of pillars are present at a density of greater than 500, 1,000, 2,000, 3,000, 4,000, 5,000, 6,000, 7,000, 8,000, 9,000, 10,000, 11,000, or 12,000/cm2 (or any integer in between). In some embodiments, the plurality of pillars are present at a density of greater than 10,000/cm2. In some embodiments, the plurality of pillars are present at a density of about 10,000/cm2 to about 2.5 million/cm2 (or any integer in between). In some embodiments, the plurality of pillars are present at a density of greater than 2.5 million/cm2.",
                                "In some embodiments, the surface area of each pillar surface is at least 1 μm2. In some embodiments, the surface area of each pillar surface can be at least 0.1, 0.5, 12, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 25, 30, 35, 40, 45, or 50 μm2 (or any integer in between). In some embodiments, the surface area of each pillar surface has a total area of less than 10,000 μm2. In some embodiments, the surface area of each pillar surface has a total area of less than 500, 1,000, 2,000, 3,000, 4,000, 5,000, 6,000, 7,000, 8,000, 9,000, 10,000, 11,000, or 12,000 μm2 (or any integer in between).",
                                "In some embodiments, the distance between the surface of each pillar and the lower surface of the layer is 2,000-7,000 angstroms. In some embodiments, the distance between the surface of each pillar and the lower surface of the layer is about less than 500, 1,000, 2,000, 3,000, 4,000, 5,000, 6,000, 7,000, 8,000, 9,000, 10,000, 11,000, 12,000, or greater than 12,000 angstroms (or any integer in between). In some embodiments, the distance between the surface of each pillar and the lower surface of the layer is 7,000, 3,000, 4,000, 5,000, 6,000, or 7,000 angstroms (or any integer in between).",
                                "In some embodiments, the layer is 1,000-2,000 angstroms thick. In some embodiments, the layer is about less than 500, 1,000, 2,000, 3,000, 4,000, 5,000, 6,000, 7,000, 8,000, 9,000, 10,000, 11,000, 12,000, or greater than 12,000 angstroms thick (or any integer in between).",
                                "In some embodiments, the center of each pillar is at least 2,000 angstroms from the center of any other pillar. In some embodiments, the center of each pillar is at least about 500, 1,000, 2,000, 3,000, or 4,000 angstroms (or any integer in between) from the center of any other pillar. In some embodiments, the center of each pillar is at least about 2 μm to 200 μm from the center of any other pillar.",
                                "In some embodiments, the planar layer comprises metal. In some embodiments, the metal is chromium. In some embodiments, the metal is chromium, titanium, aluminum, tungsten, gold, silver, tin, lead, thallium, indium, or a combination thereof. In some embodiments, the layer is at least 98.5-99% metal. In some embodiments, the layer is 100% metal. In some embodiments, the layer is at least about greater than 90, 91, 92, 93, 94, 95, 96, 97, 98, 98.5, or 99% metal. In some embodiments, the layer is a homogenous layer of metal.",
                                "In some embodiments, the planar layer comprises silicon, silicon dioxide, silicon nitride or the like. In some embodiments, at least one or each pillar comprises silicon. In some embodiments, at least one or each pillar comprises silicon dioxide or silicon nitride. In some embodiments, at least one or each pillar is at least 90, 91, 92, 93, 94, 95, 96, 97, 98, 98.5, or 99% silicon dioxide.",
                                "In some embodiments, a substrate can include a linker molecule having a free amino terminus attached to the surface of each pillar. In some embodiments, a substrate can include a linker molecule having a free amino terminus attached to the surface of at least one pillar. In some embodiments, a substrate can include a linker molecule having a protecting group attached to the surface of each pillar. In some embodiments, a substrate can include a linker molecule having a protecting group attached to the surface of at least one pillar. In some embodiments, a substrate can include a coupling molecule attached to the surface of at least one pillar. In some embodiments, a substrate can include a coupling molecule attached to the surface of each pillar. In some embodiments, a substrate can include a water soluble polymer in contact with the surface of at least one of said pillars. In some embodiments, a substrate can include a water soluble polymer in contact with the surface of each pillar. In some embodiments, a substrate can include a gelatinous form of a water soluble polymer in contact with the surface of at least one of said pillars. In some embodiments, a substrate can include a solid form of a water soluble polymer in contact with the surface of at least one of said pillars.",
                                "In some embodiments, the surface of at least one of said pillars of the substrate is derivatized. In some embodiments, a substrate can include a polymer chain attached to the surface of at least one of said pillars. In some embodiments, the polymer chain comprises a peptide chain. In some embodiments, the attachment to the surface of said at least one pillar is via a covalent bond.",
                                "In some embodiments, the surface of each pillar is square or rectangular in shape. In some embodiments, the substrate can be coupled to a silicon dioxide layer. The silicon dioxide layer can be about 0.5 μm to 3 μm thick. In some embodiments, the substrate can be coupled to a wafer, e.g., a silicon wafer. The silicon dioxide layer can be about 700 μm to 750 μm thick.",
                                "In some embodiments, a substrate can include a porous layer comprising functional groups for binding a first monomer building block.",
                                "Porous Layer Substrates",
                                "Porous layers which can be used are permeable, polymeric materials of porous structure which can have a functional group (which is native to the constituent polymer or which is introduced to the porous layer) for attachment of the first peptide building block. The functional group can comprise a free carboxylic acid group or a free amino group. For example, a porous layer can be comprised of porous silicon with functional groups for attachment of a polymer building block attached to the surface of the porous silicon. In another example, a porous layer may comprise a cross-linked polymeric material. In some embodiments, the porous layer may employ polystyrenes, saccharose, dextrans, polyacryloylmorpholine, polyacrylates, polymethylacrylates, polyacrylamides, polyacrylolpyrrolidone, polyvinylacetates, polyethyleneglycol, agaroses, sepharose, other conventional chromatography type materials and derivatives and mixtures thereof. In some embodiments, the porous layer building material is selected from: poly(vinyl alcohol), dextran, sodium alginate, poly(aspartic acid), poly(ethylene glycol), poly(ethylene oxide), poly(vinyl pyrrolidone), poly(acrylic acid), poly(acrylic acid)-sodium salt, poly(acrylamide), poly(N-isopropyl acrylamide), poly(hydroxyethyl acrylate), poly(acrylic acid), poly(sodium styrene sulfonate), poly(2-acrylamido-2-methyl-1-propanesulfonic acid), polysaccharides, and cellulose derivatives. Preferably the porous layer has a porosity of 10-80%. In one embodiment, the thickness of the porous layer ranges from 0.01 μm to about 1,000 μm. Pore sizes included in the porous layer may range from 2 nm to about 100 μm.",
                                "According to another aspect of the present invention there is provided a substrate comprising a porous polymeric material having a porosity from 10-80%, wherein reactive groups are chemically bound to the pore surfaces and are adapted in use to interact, e.g. by binding chemically, with a reactive species, e.g., deprotected monomeric building blocks or polymeric chains. In one embodiment the reactive group is a carboxylic acid group. The carboxylic acid group is free to bind, for example, an unprotected amine group of a peptide or polypeptide. In another embodiment, the reactive group is an amino group that is free to bind to, for example, an unprotected carboxylic acid group of a peptide or polypeptide.",
                                "In an embodiment, the porous layer is in contact with a support layer. The support layer comprises, for example, metal, plastic, silicon, silicon oxide, or silicon nitride. In another embodiment, the porous layer may be in contact with a patterned surface, such as on top of pillar substrates described above."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce formulations",
                                "define photoactive formulations",
                                "describe chemical amplification resists",
                                "detail radiation-sensitive catalyst precursor",
                                "list optional additives",
                                "introduce photoactive coupling formulations",
                                "describe photoactive compounds",
                                "detail photobase generators",
                                "describe photoactive coupling formulation components",
                                "introduce non-chemically amplified formulations",
                                "describe water soluble photoacid generators",
                                "detail water soluble photosensitizers",
                                "describe water soluble polymers",
                                "introduce solvent components",
                                "describe ethyl lactate solvents",
                                "detail propylene glycol methyl ether acetate solvents",
                                "define solvent concentration",
                                "describe coupling molecules",
                                "specify amino acid types",
                                "detail protected amino acid concentrations",
                                "introduce coupling reagents",
                                "specify carbodiimide concentrations",
                                "describe carboxylic acid activating formulations",
                                "detail carbodiimide precursors",
                                "specify photoactivated carbodiimide concentrations",
                                "describe thione conversion to carbodiimide",
                                "introduce activating solution components",
                                "specify carbodiimide precursor concentrations",
                                "describe polymer concentrations",
                                "introduce linker formulations",
                                "describe linker molecule concentrations",
                                "specify coupling reagent concentrations",
                                "detail solvent composition",
                                "describe organic solvent options",
                                "specify solvent concentrations",
                                "introduce water soluble polymers",
                                "describe polyvinyl pyrrolidone structure",
                                "describe polyvinyl alcohol structure",
                                "detail polyvinyl alcohol general structure",
                                "conclude linker formulations",
                                "define water soluble polymer",
                                "specify concentration of water soluble polymer",
                                "define coupling reagent",
                                "specify concentration of coupling reagent",
                                "define linker molecule",
                                "describe function of linker molecule",
                                "specify types of linker molecules",
                                "describe protecting groups",
                                "list examples of protecting groups",
                                "introduce coupling formulations",
                                "list components of coupling formulations",
                                "specify solvents",
                                "specify polymers",
                                "specify concentration of polymers",
                                "define neutralization reagent",
                                "specify concentration of neutralization reagent",
                                "define coupling molecule",
                                "specify concentration of coupling molecule",
                                "introduce substrates",
                                "describe substrate surfaces",
                                "describe functionalization of substrate surfaces",
                                "describe pillar substrates",
                                "define substrate composition",
                                "specify pillar characteristics",
                                "describe pillar surface properties",
                                "detail pillar density and distribution",
                                "specify layer thickness and material",
                                "describe pillar center-to-center distance",
                                "specify metal composition and purity",
                                "describe silicon-based layer composition",
                                "specify linker molecule attachment",
                                "describe coupling molecule attachment",
                                "specify water-soluble polymer attachment",
                                "describe pillar surface derivatization",
                                "specify polymer chain attachment",
                                "describe porous layer composition",
                                "specify porous layer functional groups",
                                "describe porous layer building materials",
                                "specify porous layer porosity and thickness",
                                "describe reactive group binding"
                            ],
                            "num_characters": 41143,
                            "outline_medium": [
                                "introduce formulations",
                                "define photoactive formulations",
                                "describe chemical amplification resists",
                                "describe photoactive coupling formulations",
                                "specify components of photoactive formulations",
                                "describe photosensitizers",
                                "describe photoacid generators",
                                "describe polymers and solvents",
                                "define photoactive coupling formulation",
                                "describe composition of photoactive coupling formulation",
                                "describe concentration of coupling molecule",
                                "describe protected amino acid",
                                "describe coupling reagent",
                                "introduce carboxylic acid activating formulations",
                                "describe composition of carboxylic acid activating formulations",
                                "describe carbodiimide precursor",
                                "describe activating solution",
                                "introduce linker formulations",
                                "describe composition of linker formulations",
                                "describe solvent",
                                "define water soluble polymer",
                                "describe coupling reagent",
                                "introduce linker molecule",
                                "discuss protecting groups",
                                "describe coupling formulations",
                                "detail solvent components",
                                "specify polymer components",
                                "describe neutralization reagent",
                                "introduce coupling molecules",
                                "describe substrates",
                                "detail substrate surface functionalization",
                                "define substrate composition",
                                "specify pillar dimensions and density",
                                "describe pillar surface properties",
                                "detail layer thickness and material",
                                "specify pillar spacing and arrangement",
                                "describe metal and silicon compositions",
                                "introduce linker and coupling molecules",
                                "define porous layer substrates and properties",
                                "describe reactive groups and binding interactions"
                            ],
                            "outline_short": [
                                "define formulations",
                                "describe photoactive formulations",
                                "detail components of photoactive formulations",
                                "specify examples of photoactive formulations",
                                "define photoactive coupling formulation",
                                "describe composition of photoactive coupling formulation",
                                "describe carboxylic acid activating formulations",
                                "describe carbodiimide precursor",
                                "describe linker formulations",
                                "describe composition of linker formulations",
                                "define water soluble polymer",
                                "describe linker molecule",
                                "outline coupling formulations",
                                "describe substrates",
                                "detail pillar substrates",
                                "define substrate composition",
                                "specify pillar characteristics",
                                "describe layer materials and properties",
                                "introduce porous layer substrates"
                            ]
                        },
                        {
                            "title": "Arrays",
                            "paragraphs": [
                                "Also disclosed herein are arrays. In some embodiments, an array can be a two-dimensional array. In some embodiments, a two-dimensional array can include features attached to a surface at positionally-defined locations, said features each comprising: a collection of peptide chains of determinable sequence and intended length, wherein within an individual feature, the fraction of peptide chains within said collection having the intended length is characterized by an average coupling efficiency for each coupling step of about 98%.",
                                "In some embodiments, the surface of the array is functionalized with free carboxylic acids. In some embodiments, the free carboxylic acids are activated to bind to amine groups, e.g., during polypeptide synthesis on the surface of the array. In some embodiments, the surface density of free carboxylic acid groups on the array is greater than 10/cm2, 100/cm2, 1,000/cm2, 10,000/cm2, 1,00,000/cm2, 1,000,000/cm2, or 10,000,000/cm2.",
                                "In some embodiments, an array can be a three-dimensional array, e.g., a porous array comprising features attached to the surface of the porous array. In some embodiments, the surface of a porous array includes external surfaces and surfaces defining pore volume within the porous array. In some embodiments, a three-dimensional array can include features attached to a surface at positionally-defined locations, said features each comprising: a collection of peptide chains of determinable sequence and intended length. In one embodiment, within an individual feature, the fraction of peptide chains within said collection having the intended length is characterized by an average coupling efficiency for each coupling step of greater than 98%.",
                                "In some embodiments, the average coupling efficiency for each coupling step is at least 98.5%. In some embodiments, the average coupling efficiency for each coupling step is at least 99%. In some embodiments, the average coupling efficiency for each coupling step is at least 90, 91, 92, 93, 94, 95, 96, 97, 98, 98.5, 98.6, 98.7, 98.8, 98.9, 99.0, 99.1, 99.2, 99.3, 99.4, 99.5, 99.6, 99.7, 99.8, 99.9, or 100%. In some embodiments, the coupling efficiency is substantially constant over each coupling cycle, and exceeds 98%. In some embodiments, the average coupling efficiency exceeds 98% for each coupling step used to synthesize a 4-mer, or a 5-mer, or a 6-mer, or a 7-mer or longer polypeptide. In some embodiments, the coupling efficiency is substantially constant and exceeds 98% for each coupling step used to synthesize a 4-mer, or a 5-mer, or a 6-mer, or a 7-mer or longer polypeptide.",
                                "In some embodiments, a surface includes a substrate disclosed herein. In some embodiments, a surface is a material or group of materials having rigidity or semi-rigidity. In some embodiments, a surface can be substantially flat, although in some embodiments it can be desirable to physically separate synthesis regions for different molecules or features with, for example, wells, raised regions, pins, pillars, etched trenches, or the like. In certain embodiments, a surface may be porous. Surface materials can include, for example, silicon, bio-compatible polymers such as, for example poly(methyl methacrylate) [PMMA] and polydimethylsiloxane [PDMS], glass, SiO2 (such as, for example, a thermal oxide silicon wafer such as that used by the semiconductor industry), quartz, silicon nitride, functionalized glass, gold, platinum, and aluminum. Functionalized surfaces include for example, amino-functionalized glass, carboxy functionalized glass, and hydroxy functionalized glass. Additionally, a surface may optionally be coated with one or more layers to provide a second surface for molecular attachment or functionalization, increased or decreased reactivity, binding detection, or other specialized application. Surface materials and or layer(s) can be porous or non-porous. For example, a surface can be comprised of porous silicon. Additionally, the surface can be a silicon wafer or chip such as those used in the semiconductor device fabrication industry. In the case of a wafer or chip, a plurality of arrays can be synthesized on the wafer.",
                                "In some embodiments, each peptide chain is from 5 to 60 amino acids in length. In some embodiments, each peptide chain is at least 5 amino acids in length. In some embodiments, each peptide chain is at least 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, or 60 amino acids in length. In some embodiments, each peptide chain is less than 5, at least 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, or greater than 60 amino acids in length. In some embodiments, each peptide chain comprises one or more L amino acids. In some embodiments, each peptide chain comprises one or more D amino acids. In some embodiments, each peptide chain comprises one or more naturally occurring amino acids. In some embodiments, each peptide chain comprises one or more synthetic amino acids.",
                                "In some embodiments, an array can include at least 1,000 different peptide chains attached to the surface. In some embodiments, an array can include at least 10,000 different peptide chains attached to the surface. In some embodiments, an array can include at least 100, 500, 1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10,000, or greater than 10,000 different peptide chains attached to the surface (or any integer in between).",
                                "In some embodiments, an array can include at least peptide density of at least 1,000 peptide chains attached to the surface per cm2. In some embodiments, an array can include at least 10,000 peptide chains/cm2. In some embodiments, an array can include at least 100, 500, 1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10,000, or greater than 10,000 peptide chains/cm2 (or any integer in between).",
                                "In some embodiments, each of the positionally-defined locations is at a different, known location that is physically separated from each of the other positionally-defined locations. In some embodiments, each of the positionally-defined locations is a positionally-distinguishable location. In some embodiments, each determinable sequence is a known sequence. In some embodiments, each determinable sequence is a distinct sequence.",
                                "In some embodiments, the features are covalently attached to the surface. In some embodiments, said peptide chains are attached to the surface through a linker molecule or a coupling molecule.",
                                "In some embodiments, the features comprise a plurality of distinct, nested, overlapping peptide chains comprising subsequences derived from a source protein having a known sequence. In some embodiments, each peptide chain in the plurality is substantially the same length. In some embodiments, each peptide chain in the plurality is the same length. In some embodiments, each peptide chain in the plurality is at least 5 amino acids in length. In some embodiments, each peptide chain in the plurality is at least 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, or 60 amino acids in length. In some embodiments, each peptide chain in the plurality is less than 5, at least 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, or greater than 60 amino acids in length. In some embodiments, at least one peptide chain in the plurality is at least 5 amino acids in length. In some embodiments, at least one peptide chain in the plurality is at least 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, or 60 amino acids in length. In some embodiments, at least one peptide chain in the plurality is less than 5, at least 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, or greater than 60 amino acids in length. In some embodiments, each polypeptide in a feature is substantially the same length. In some embodiments, each polypeptide in a feature is the same length. In some embodiments, the features comprise a plurality of peptide chains each having a random, determinable sequence of amino acids.",
                                "Methods of Manufacturing Arrays",
                                "Also disclosed herein are methods for manufacturing arrays. In some embodiments, the arrays disclosed herein can be synthesized in situ on a surface, e.g., a substrate disclosed herein. In some instances, the arrays are made using photolithography. For example, masks can be used to control radiation or light exposure to specific locations on a surface provided with linker molecules having protecting groups. In the exposed locations, the protecting groups are removed, resulting in one or more newly exposed reactive moieties on the linker. The surface is then contacted with a solution containing a coupling molecule. The coupling molecule can have at least one site that is reactive with the newly exposed reactive moiety on the linker and at least a second reactive site protected by one or more protecting groups. The desired coupling molecule is then coupled to the unprotected linker molecules. The process can be repeated to synthesize a large number of features in specific or positionally-defined locations on a surface (see, for example, U.S. Pat. No. 5,143,854 to Pirrung et al., U.S. Patent Application Publication Nos. 2007/0154946 (filed on Dec. 29, 2005), 2007/0122841 (filed on Nov. 30, 2005), 2007/0122842 (filed on Mar. 30, 2006), 2008/0108149 (filed on Oct. 23, 2006), and 2010/0093554 (filed on Jun. 2, 2008), each of which is herein incorporated by reference).",
                                "In some embodiments, a method of producing a two-dimensional array of features, can include obtaining a surface; and attaching the features to the surface, said features each comprising a collection of peptide chains of determinable sequence and intended length, wherein within an individual feature, the fraction of peptide chains within said collection having the intended length is characterized by an average coupling efficiency for each coupling step of at least about 98%. In some embodiments, the features are attached to the surface using a coupling formulation, comprising a solvent, a water soluble polymer, a water soluble coupling molecule, a water soluble neutralization reagent, and a water soluble coupling reagent. In some embodiments, the features are attached to the surface using a coupling formulation disclosed herein. In some embodiments, the coupling formulation is stripped away using water.",
                                "In some embodiments, a method of producing a two-dimensional array of features, can include obtaining a substrate comprising a planar layer comprising a metal and having an upper surface and a lower surface; and a plurality of pillars operatively coupled to the layer in positionally-defined locations, wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between about 1,000-5,000 angstroms, and wherein the plurality of pillars are present at a density of greater than about 10,000/cm2; and coupling through a series of coupling reactions the features to the plurality of pillars, said features each comprising a collection of peptide chains of determinable sequence and intended length, wherein within an individual feature, the fraction of peptide chains within said collection having the intended length is characterized by an average coupling efficiency for each coupling step of at least about 98% or about 98.5%. In some embodiments, the coupling efficiency is substantially constant over each coupling cycle, and exceeds 98% or exceeds 98.5%. In some embodiments the average coupling efficiency exceeds 98% or exceeds 98.5% for each coupling step used to synthesize a 4-mer, or a 5-mer, or a 6-mer, or a 7-mer or longer polypeptide. In some embodiments the coupling efficiency is substantially constant and exceeds 98% or exceeds 98.5% for each coupling step used to synthesize a 4-mer, or a 5-mer, or a 6-mer, or a 7-mer or longer polypeptide. Coupling steps used to synthesize. In some embodiments, the features are coupled to the pillars using a coupling formulation, comprising a solvent, a water soluble polymer, a water soluble coupling molecule, a water soluble neutralization reagent, and a water soluble coupling reagent. In some embodiments, the features are coupled using a coupling formulation disclosed herein. In some embodiments, the coupling formulation is stripped away using water. In some embodiments, the surface of each pillar is parallel to the upper surface of the layer. In some embodiments, the surface of each pillar is substantially parallel to the upper surface of the layer.",
                                "In some embodiments, a method of preparing a substrate for attachment of features, can include obtaining a substrate comprising a planar layer having an upper surface and a lower surface; and a plurality of pillars operatively coupled to the layer in positionally-defined locations, wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between about 1,000-5,000 angstroms, and wherein the plurality of pillars are present at a density of greater than about 10,000/cm2; and attaching one or more linker molecules to the plurality of pillars. In some embodiments, the linker molecule is attached using a linker formulation, comprising a solvent, a water soluble polymer, a water soluble linker molecule, and a water soluble coupling reagent. In some embodiments, the linker molecule is attached using a linker formulation disclosed herein. In some embodiments, linker molecule comprises a protecting group. In some embodiments, the surface of each pillar is parallel to the upper surface of the layer. In some embodiments, the surface of each pillar is substantially parallel to the upper surface of the layer.",
                                "In some embodiments, a method of preparing a surface for attachment of features, can include obtaining a surface and attaching a linker molecule to the surface using a linker formulation, comprising a solvent, a water soluble polymer, a water soluble linker molecule, and a water soluble coupling reagent. In some embodiments, linker molecule comprises a protecting group.",
                                "In some embodiments, a method of attaching a coupling reagent to a substrate, can include obtaining a substrate comprising a planar layer having an upper surface and a lower surface; and a plurality of pillars operatively coupled to the layer in positionally-defined locations, wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between 1,000-5,000 angstroms, wherein a linker molecule is attached to the surface of each pillar, and wherein the plurality of pillars are present at a density of greater than 10,000/cm2; and attaching the coupling reagent to one or more linker molecules. In some embodiments, the coupling reagent is attached to the one or more linker molecules using a coupling formulation, comprising: a solvent, a water soluble polymer, a water soluble coupling molecule, a water soluble neutralization reagent, and a water soluble coupling reagent. In some embodiments, the coupling reagent is attached to the one or more linker molecules using a coupling formulation disclosed herein. In some embodiments, at least one the linker molecule is a deprotected linker molecule. In some embodiments, the coupling reagent is an amino acid. In some embodiments, the coupling reagent comprises a protecting molecule. In some embodiments, the coupling formulation is stripped away using water. In some embodiments, the surface of each pillar is parallel to the upper surface of the layer. In some embodiments, the surface of each pillar is substantially parallel to the upper surface of the layer.",
                                "In some embodiments, a method of attaching a coupling reagent to a surface can include obtaining a surface having a linker molecule attached to the surface and attaching the coupling reagent to the linker molecule using a coupling formulation, comprising a solvent, a water soluble polymer, a water soluble coupling molecule, a water soluble neutralization reagent, and a water soluble coupling reagent. In some embodiments, the linker molecule is a deprotected linker molecule. In some embodiments, the coupling reagent is an amino acid. In some embodiments, the coupling reagent comprises a protecting molecule. In some embodiments, the coupling formulation is stripped away using water.",
                                "In some embodiments, a method of producing a three-dimensional (e.g., porous) array of features, can include obtaining a porous layer attached to a surface; and attaching the features to the porous layer, said features each comprising a collection of peptide chains of determinable sequence and intended length, wherein within an individual feature, the fraction of peptide chains within said collection having the intended length is characterized by an average coupling efficiency for each coupling step of at least about 98.5%. In some embodiments, the features are attached to the surface using a photoactive coupling formulation, comprising a photoactive compound, a coupling molecule, a coupling reagent, a polymer, and a solvent. In some embodiments, the features are attached to the surface using a photoactive coupling formulation disclosed herein. In some embodiments, the photoactive coupling formulation is stripped away using water.",
                                "In some embodiments, described herein is a process of manufacturing an array. A surface comprising attached carboxylic acid groups is provided. The surface is contacted with a photoactive coupling solution comprising a photoactive compound, a coupling molecule, a coupling reagent, a polymer, and a solvent. The surface is exposed to ultraviolet light in a deep ultra violet scanner tool according to a pattern defined by a photomask, wherein the locations exposed to ultraviolet light undergo photo base generation due to the presence of a photobase generator in the photoactive coupling solution. The expose energy can be from 1 mJ/cm2 to 100 mJ/cm2 in order to produce enough photobase.",
                                "The surface is post baked upon exposure in a post exposure bake module. Post exposure bake acts as a chemical amplification step. The baking step amplifies the initially generated photobase and also enhances the rate of diffusion to the substrate. The post bake temperature can vary between 75° Celsius to 115° Celsius, depending on the thickness of the porous surface, for at least 60 seconds and not usually exceeding 120 seconds. The free carboxylic acid group is coupled to the deprotected amine group of a free peptide or polypeptide, resulting in coupling of the free peptide or polypeptide to the carboxylic acid group attached to the surface. This surface may be a porous surface. The synthesis of peptides coupled to a carboxylic acid group attached to the surface occurs in an N→C synthesis orientation, with the amine group of free peptides attaching to carboxylic acid groups bound to the surface of the substrate. Alternatively, a diamine linker may be attached to a free carboxylic acid group to orient synthesis in a C→N direction, with the carboxylic acid group of free peptides attaching to amine groups bound to the surface of the substrate.",
                                "The photoactive coupling solution can now be stripped away. In some embodiments, provided herein is a method of stripping the photoresist completely with deionized (DI) water. This process is accomplished in a developer module. The wafer is spun on a vacuum chuck for, e.g., 60 seconds to 90 seconds and deionized water is dispensed through a nozzle for about 30 seconds.",
                                "The photoactive coupling formulation can be applied to the surface in a coupling spin module. A coupling spin module can typically have 20 nozzles or more to feed the photoactive coupling formulation. These nozzles can be made to dispense the photoactive coupling formulation by means of pressurizing the cylinders that hold these solutions or by a pump that dispenses the required amount. In some embodiments, the pump is employed to dispense 5-8 cc of the photoactive coupling formulation onto the substrate. The substrate is spun on a vacuum chuck for 15-30 seconds and the photoactive coupling formulation is dispensed. The spin speed can be set to 2000 to 2500 rpm.",
                                "Optionally, a cap film solution coat is applied on the surface to prevent the unreacted amino groups on the substrate from reacting with the next coupling molecule. The cap film coat solution can be prepared as follows: a solvent, a polymer, and a coupling molecule. The solvent that can be used can be an organic solvent like N methyl pyrrolidone, dimethyl formamide, or combinations thereof. The capping molecule is typically acetic anhydride and the polymer can be polyvinyl pyrrolidone, polyvinyl alcohol, polymethyl methacrylate, poly (methyl iso propenyl) ketone, or poly (2 methyl pentene 1 sulfone). In some embodiments, the capping molecule is ethanolamine.",
                                "This process is done in a capping spin module. A capping spin module can include one nozzle that can be made to dispense the cap film coat solution onto the substrate. This solution can be dispensed through pressurizing the cylinder that stores the cap film coat solution or through a pump that precisely dispenses the required amount. In some embodiments, a pump is used to dispense around 5-8 cc of the cap coat solution onto the substrate. The substrate is spun on a vacuum chuck for 15-30 seconds and the coupling formulation is dispensed. The spin speed can be set to 2000 to 2500 rpm.",
                                "The substrates with the capping solution are baked in a cap bake module. A capping bake module is a hot plate set up specifically to receive wafers just after the capping film coat is applied. In some embodiments, provided herein is a method of baking the spin coated capping coat solution in a hot plate to accelerate the capping reaction significantly. Hot plate baking generally reduces the capping time for amino acids to less than two minutes.",
                                "The byproducts of the capping reaction are stripped in a stripper module. A stripper module can include several nozzles, typically up to 10, set up to dispense organic solvents such as acetone, iso propyl alcohol, N methyl pyrrolidone, dimethyl formamide, DI water, etc. In some embodiments, the nozzles can be designated for acetone followed by isopropyl alcohol to be dispensed onto the spinning wafer. The spin speed is set to be 2000 to 2500 rpm for around 20 seconds.",
                                "This entire cycle can be repeated as desired with different coupling molecules each time to obtain a desired sequence.",
                                "In some embodiments, an array comprising a surface of free carboxylic acids is used to synthesize polypeptides in an N→C orientation. In one embodiment, the carboxylic acids on the surface of the substrate are activated (e.g., converted to a carbonyl) to allow them to bind to free amine groups on an amino acid. In one embodiment, activation of carboxylic acids on the group of the surface can be done by addition of a solution comprising a carbodiimide or succinimide to the surface of the array. In some embodiments, carboxylic acids can be activated by addition of a solution comprising 1-ethyl-3-(3-dimethylaminopropyl)carbodiimide [EDC], N-hydroxysuccinimide [NHS], 1,3-diisopropylcarbodiimide [DIC], hydroxybenzotriazole [HOBt], 1-Hydroxy-7-azabenzotriazole [HOAt], (O-(7-azabenzotriazol-1-yl)-N,N,N′,N′-tetramethyluronium hexafluorophosphate) [HATU], benzotriazol-1-yl-oxytripyrrolidinophosphonium hexafluorophosphate [PyBOP], or N,N-diisopropylethylamine [DIEA] to the surface of the array. The activation solution is washed away and the surface of the array is prepared for addition of an amino acid layer (i.e., one amino acid at each activated carboxylic acid group). Carboxylic acid groups remain activated for up to 2, 3, 4, 5, 6, 7, 8, 9, or 10 hours.",
                                "Addition of a solution comprising an amino acid with a free amine group to the activated carboxylic acid surface of the array results in binding of a single amino acid to each carboxylic acid group. In some embodiments, the amino acid comprises an amino acid with protected amine groups. Using a photosensitive chemical reaction, the protecting group can be removed from the amine group of selected amino acids at site-specific locations using a reticle. For example, Fmoc-protected amino acids are mixed in a solution comprising a photobase generator. Upon exposure of the solution on the array to a specific frequency of light at site-specific locations, the photobase generator will release a base which will deprotect the amino acid, resulting in coupling of the amino acid to the activated carboxylic acid group on the surface of the array. Another method involves using a protected base that is then unprotected by a photoacid released by a photoacid generator upon light exposure. In some embodiments, the protected base is N-Boc-piperidine or 1,4-bis(N-Boc)-piperazine.",
                                "After a completed layer of amino acids is coupled, remaining uncoupled activated carboxylic acids are capped to prevent nonspecific binding of amino acids on subsequent synthesis steps. The steps of activation, addition of an amino acid layer, and capping are repeated as necessary to synthesize the desired polypeptides at specific locations on the array.",
                                "In some embodiments, peptides synthesized in the N→C terminus direction can be capped with a diamine molecule to enhance binding properties of selected polypeptide sequences to a biological molecule, e.g., an antibody. In other embodiments, peptides synthesized in the C→N direction can be capped with a dicarboxylic acid molecule to enhance binding properties of selected sequences to a biological molecule.",
                                "While synthesizing polypeptides in parallel on the surface of an array, the method described herein ensures complete activation of carboxylic acid on the surface of the array. Due to stability of the activated ester for an extended period of time, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25 or more coupling cycles may be completed after a single activation step (e.g., to couple an entire layer of 2-25 or more different amino acids at different locations on the array). As the coupling occurs during hard bake (heating in a hot plate at 85-90° Celsius for 90 seconds immediately after coating) and due to the presence of excess amino acid in the solution, complete 100% deprotection of Fmoc-protected amino acid may not be required for significantly high coupling yields. After addition of all amino acids and capping, all free activated carboxylic acids are either coupled or capped, thus resulting in high efficiency and accuracy of polypeptide synthesis.",
                                "Methods of Use of Arrays",
                                "Also disclosed herein are methods of using substrates, formulations, and/or arrays. Uses of the arrays disclosed herein can include research applications, therapeutic purposes, medical diagnostics, and/or stratifying one or more patients.",
                                "Any of the arrays described herein can be used as a research tool or in a research application. In one aspect, arrays can be used for high throughput screening assays. For example, enzyme substrates (i.e., peptides on a peptide array described herein) can be tested by subjecting the array to an enzyme and identifying the presence or absence of enzyme substrate(s) on the array, e.g., by detecting at least one change among the features of the array.",
                                "Arrays can also be used in screening assays for ligand binding, to determine substrate specificity, or for the identification of peptides that inhibit or activate proteins. Labeling techniques, protease assays, as well as binding assays useful for carrying out these methodologies are generally well-known to one of skill in the art.",
                                "In some embodiments, an array can be used to represent a known protein sequence as a sequence of overlapping peptides. For example, the amino acid sequence of a known protein is divided into overlapping sequence segments of any length and of any suitable overlapping frame, and peptides corresponding to the respective sequence segments are in-situ synthesized as disclosed herein. The individual peptide segments so synthesized can be arranged starting from the amino terminus of the known protein.",
                                "In some embodiments, an array is used in a method wherein the antigenic representation of the array includes at least one region where the whole antigen sequence of a known protein is spanned via epitope sliding; the immunoactive regions of the antigen are determined by contacting one or more clinical samples on the array or a plurality of different arrays, and the set of peptide sequences required to represent the known protein antigen are reduced.",
                                "In some embodiments, a sample is applied to an array having a plurality of random peptides. The random peptides can be screened and BLASTed to determine homologous domains with, e.g., a 90% or more identity to a given antigenic sequence. In some aspect, the whole antigenic sequence can then be synthesized and used to identify potential markers and/or causes of a disease of interest.",
                                "In some embodiments, an array is used for high throughput screening of one or more genetic factors. Proteins associated with a gene can be a potential antigen and antibodies against these proteins can be used to estimate the relation between gene and a disease.",
                                "In another example, an array can be used to identify one or more biomarkers. Biomarkers can be used for the diagnosis, prognosis, treatment, and management of diseases. Biomarkers may be expressed, or absent, or at a different level in an individual, depending on the disease condition, stage of the disease, and response to disease treatment. Biomarkers can be, e.g., DNA, RNA, proteins (e.g., enzymes such as kinases), sugars, salts, fats, lipids, or ions.",
                                "Arrays can also be used for therapeutic purposes, e.g., identifying one or more bioactive agents. A method for identifying a bioactive agent can comprise applying a plurality of test compounds to an array and identifying at least one test compound as a bioactive agent. The test compounds can be small molecules, aptamers, oligonucleotides, chemicals, natural extracts, peptides, proteins, fragment of antibodies, antibody like molecules or antibodies. The bioactive agent can be a therapeutic agent or modifier of therapeutic targets. Therapeutic targets can include phosphatases, proteases, ligases, signal transduction molecules, transcription factors, protein transporters, protein sorters, cell surface receptors, secreted factors, and cytoskeleton proteins.",
                                "In another aspect, an array can be used to identify drug candidates for therapeutic use. For example, when one or more epitopes for specific antibodies are determined by an assay (e.g., a binding assay such as an ELISA), the epitopes can be used to develop a drug (e.g., a monoclonal neutralizing antibody) to target antibodies in disease.",
                                "In one aspect, also provided are arrays for use in medical diagnostics. An array can be used to determine a response to administration of drugs or vaccines. For example, an individual's response to a vaccine can be determined by detecting the antibody level of the individual by using an array with peptides representing epitopes recognized by the antibodies produced by the induced immune response. Another diagnostic use is to test an individual for the presence of biomarkers, wherein samples are taken from a subject and the sample is tested for the presence of one or more biomarkers.",
                                "Arrays can also be used to stratify patient populations based upon the presence or absence of a biomarker that indicates the likelihood a subject will respond to a therapeutic treatment. The arrays can be used to identify known biomarkers to determine the appropriate treatment group. For example, a sample from a subject with a condition can be applied to an array. Binding to the array may indicate the presence of a biomarker for a condition. Previous studies may indicate that the biomarker is associated with a positive outcome following a treatment, whereas absence of the biomarker is associated with a negative or neutral outcome following a treatment. Because the patient has the biomarker, a health care professional may stratify the patient into a group that receives the treatment.",
                                "In some embodiments, a method of detecting the presence or absence of a protein of interest (e.g., an antibody) in a sample can include obtaining an array disclosed herein and contacted with a sample suspected of comprising the protein of interest; and determining whether the protein of interest is present in the sample by detecting the presence or absence of binding to one or more features of the array. In some embodiments, the protein of interest can be obtained from a bodily fluid, such as amniotic fluid, aqueous humour, vitreous humour, bile, blood serum, breast milk, cerebrospinal fluid, cerumen, chyle, endolymph, perilymph, feces, female ejaculate, gastric acid, gastric juice, lymph, mucus, peritoneal fluid, pleural fluid, pus, saliva, sebum, semen, sweat, synovial fluid, tears, vaginal secretion, vomit, or urine.",
                                "In some embodiments, a method of identifying a vaccine candidate can include obtaining an array disclosed herein contacted with a sample derived from a subject previously administered the vaccine candidate, wherein the sample comprises a plurality of antibodies; and determining the binding specificity of the plurality of antibodies to one or more features of the array. In some embodiments, the features comprise a plurality of distinct, nested, overlapping peptide chains comprising subsequences derived from a source protein having a known sequence."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define two-dimensional array",
                                "describe features attached to surface",
                                "specify peptide chain sequence and length",
                                "detail surface functionalization",
                                "describe three-dimensional array",
                                "specify surface density of carboxylic acid groups",
                                "describe porous array features",
                                "specify average coupling efficiency",
                                "describe surface materials",
                                "specify peptide chain length ranges",
                                "describe array peptide density",
                                "specify positionally-defined locations",
                                "describe covalent attachment of features",
                                "detail nested, overlapping peptide chains",
                                "specify peptide chain length ranges",
                                "describe features with random sequences",
                                "describe methods of manufacturing arrays",
                                "synthesize arrays in situ on surface",
                                "use photolithography to control radiation",
                                "describe coupling molecule and linker molecules",
                                "repeat process to synthesize multiple features",
                                "obtain surface and attach features",
                                "use coupling formulation to attach features",
                                "strip away coupling formulation",
                                "obtain substrate with pillars and attach features",
                                "couple features to pillars using coupling formulation",
                                "strip away coupling formulation",
                                "prepare substrate for attachment of features",
                                "attach linker molecules to pillars",
                                "prepare surface for attachment of features",
                                "attach linker molecule to surface",
                                "attach coupling reagent to substrate",
                                "attach coupling reagent to linker molecules",
                                "strip away coupling formulation",
                                "attach coupling reagent to surface",
                                "produce three-dimensional array of features",
                                "attach features to porous layer",
                                "use photoactive coupling formulation",
                                "strip away photoactive coupling formulation",
                                "describe process of manufacturing an array",
                                "strip away photoresist with deionized water",
                                "describe arrays",
                                "introduce cap film solution coat",
                                "describe capping spin module",
                                "describe cap bake module",
                                "describe stripper module",
                                "describe entire cycle",
                                "introduce array for synthesizing polypeptides",
                                "describe activation of carboxylic acids",
                                "describe addition of amino acid layer",
                                "describe capping of remaining carboxylic acids",
                                "describe repetition of steps",
                                "describe capping with diamine molecule",
                                "describe capping with dicarboxylic acid molecule",
                                "describe method of synthesizing polypeptides",
                                "introduce methods of use of arrays",
                                "describe research applications",
                                "describe therapeutic purposes",
                                "describe medical diagnostics",
                                "describe stratifying patient populations",
                                "describe detecting presence or absence of protein",
                                "describe obtaining array and contacting with sample",
                                "describe determining binding specificity",
                                "describe identifying vaccine candidate",
                                "describe features of array",
                                "describe source protein with known sequence",
                                "conclude methods of use of arrays"
                            ],
                            "num_characters": 34120,
                            "outline_medium": [
                                "define two-dimensional array",
                                "describe features attached to surface",
                                "specify peptide chain length",
                                "describe surface functionalization",
                                "specify surface density of carboxylic acid groups",
                                "define three-dimensional array",
                                "describe features attached to porous array",
                                "specify average coupling efficiency",
                                "describe surface materials",
                                "specify peptide chain length range",
                                "describe array peptide density",
                                "specify positionally-defined locations",
                                "describe feature attachment to surface",
                                "specify nested, overlapping peptide chains",
                                "describe peptide chain length range",
                                "specify feature attachment through linker molecule",
                                "describe features with random, determinable sequence",
                                "specify array manufacturing methods",
                                "describe photolithography method",
                                "specify coupling formulation composition",
                                "describe arrays",
                                "introduce cap film solution coat",
                                "describe capping spin module",
                                "describe cap bake module",
                                "describe stripper module",
                                "describe array synthesis cycle",
                                "describe activation of carboxylic acids",
                                "describe addition of amino acid layer",
                                "describe capping of uncoupled carboxylic acids",
                                "describe methods of use of arrays",
                                "describe research applications",
                                "describe therapeutic purposes",
                                "describe medical diagnostics"
                            ],
                            "outline_short": [
                                "define arrays",
                                "describe two-dimensional arrays",
                                "describe three-dimensional arrays",
                                "specify surface materials",
                                "specify peptide chain lengths",
                                "specify peptide chain density",
                                "describe features attached to surfaces",
                                "describe covalent attachment of features",
                                "describe nested, overlapping peptide chains",
                                "describe random, determinable sequences of amino acids",
                                "describe arrays",
                                "motivate polypeptide synthesis",
                                "summarize synthesis process",
                                "describe methods of use",
                                "outline research applications",
                                "discuss therapeutic and diagnostic uses"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "The following examples illustrates a method of identifying biomarkers for celiac diseases. The biomarkers include a set of peptides obtained from known antigens in celiac disease, including, but not limited to alpha, beta, gamma, and omega gliadin, tissue transglutaminase (tTG), and the deamidated modification thereof. The method includes synthesizing a peptide library of 12-mer peptides based on these known celiac antigens. In some embodiments, sequences of the 12-mer peptides are identified by shifting through the amino acid sequences of the known celiac antigens by either two or three amino acid at a time. FIG. 1A illustrates identifying 12-mer sequences based on shifting by two amino acids along the alpha/beta gliadin sequence. FIG. 1B illustrates deaminating the 12-mer peptides one or two glutamines at a time to increase the size of the peptide library. The peptide library was then synthesized on a microarray, as described in more detail below, which were found to be significantly better than other conventional peptide synthesis techniques. The coupling yield during synthesis of the peptides on the array was continually monitored for peptide yield, purity and sequence fidelity using fluorescence, mass spectrometry, and monoclonal antibody binding substrate assays. To identify biomarkers based on B cell epitopes of native and deamidated gliadin derived peptides (GPs), peptide microarrays including 2.1 million different peptides from the peptide library of GPs, including triple duplicates of each peptide, were synthesized, picked and placed onto 96 pillar plates."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1: Wafer Substrate Preparation",
                            "paragraphs": [
                                "Prime grade 300 mm silicon wafers, having p-type boron, (1,0,0)-Orientation, 1-5 Ohm/cm and 725 μm thickness, were obtained from Process Specialties. The wafers were deposited with 1000 Å thermal oxide by dry oxidation at 1000° Celsius in a furnace under pure oxygen atmosphere for 2 hours. Commercial photoresist P5107 was spin coated on the wafers at 2000 rpm for 40 seconds using the Sokudo RF3S Coat/Develop Track. The wafers were exposed with an inverse zero layer mask using the Nikon NSR S205 KrF Scanner at a wavelength of 248 nm. This was followed by post exposure bake at 110° Celsius for 90 seconds and then developed using the developer NMD-3 at 2.38% (TOK America). Oxide etching was performed by wet oxide etch of the wafers using buffered hydrofluoric acid which was prepared by mixing 5 parts of 40 weight % of ammonium fluoride (Sigma) with 1 part of 49 weight % of hydrofluoric acid (Sigma) for 1 minute. The wafers were then stripped with Nanostrip (CyanTek) for 24 hours, finally washed with DI Water, and sonicated in DI Water for 10 minutes. This process as illustrated in FIG. 3A resulted in a substrate with a feature area that measured a height of 1000 Å containing thermal oxide while containing silicon in the non-feature area.",
                                "A DI 5000 AFM system was used to measure the roughness and calculate the density of the substrate. FIG. 3B shows the pillars and their dimensions formed after the process described above and illustrated in FIG. 3A. FIG. 3C illustrates the root mean square (RMS) roughness of the substrate. The density of the substrate was calculated to be approximately 100-150 pM."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare silicon wafers for peptide microarray synthesis",
                                "describe thermal oxide deposition and photoresist coating",
                                "detail wet oxide etching and substrate preparation"
                            ],
                            "num_characters": 1621,
                            "outline_medium": [
                                "prepare wafer substrate for peptide synthesis"
                            ],
                            "outline_short": [
                                "prepare wafer substrate for peptide synthesis"
                            ]
                        },
                        {
                            "title": "Example 2: Wafer Surface Derivatization",
                            "paragraphs": [
                                "Wafers were copiously washed with DI water for 5 minutes and spin coated with a solution containing 1.25% (v/v) of 3-aminopropyltriethoxysilane [APTES] (Sigma Aldrich) in N-methyl-pyrollidone [NMP] (BDH) and left at room temperature for 15 minutes. Curing of the wafers was done at 120° Celsius for 60 minutes under N2 atmosphere. Wafers were then spin coated with a coupling solution containing 2 weight % of Fmoc-Gly-OH (Anaspec), 2 weight % of HOBt (Anaspec) and 2 weight % of N,N′-diisopropylcarbodiimide [DIC] (Sigma Aldrich) in NMP and baked at 60° Celsius for 5 minutes. This enabled coupling of Fmoc-Glycine to the free amine present in APTES. Wafers were then rinsed with NMP and then capped with 50% (v/v) of Acetic Anhydride mixed with 50% of NMP to cap any remaining free amines which have not been coupled. Wafers were stripped with acetone (BDH) and isopropyl alcohol [IPA] (BDH). Fmoc protection of glycine was removed by spin coating the wafer with 5% (v/v) of piperidine (Sigma Aldrich) in NMP and baking at 80° Celsius for 300 seconds. The linker Fmoc-(PEG)4-COOH (Anaspec) was then coupled to the wafer surface by spin coating a coupling solution containing 2 weight % of the linker, 2 weight % of HOBt (Anaspec) and 2 weight % of N,N′-diisopropylcarbodiimide [DIC] in NMP and baked at 90° Celsius for 120 seconds. Wafers were then rinsed with NMP and subsequently capped with 50% (v/v) of acetic anhydride mixed with 50% of NMP to cap any remaining free amines. Wafers were stripped with acetone and IPA to complete the surface derivatization process."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe APTES coating and curing",
                                "detail Fmoc-Gly-OH coupling and linker attachment",
                                "illustrate surface derivatization process"
                            ],
                            "num_characters": 1571,
                            "outline_medium": [
                                "derivatize wafer surface for peptide coupling"
                            ],
                            "outline_short": [
                                "derivatize wafer surface for peptide coupling"
                            ]
                        },
                        {
                            "title": "Example 3: Peptide Array Synthesis",
                            "paragraphs": [
                                "The steps performed for synthesizing the peptides on the array are illustrated in FIG. 4 and described in detail above.",
                                "Activation Solution:",
                                "An amino acid activation solution was prepared as follows: 1% by weight of poly(methyl methacrylate) [PMMA] (Polysciences) was dissolved in N-methyl pyrollidone by sonication for 10 minutes. 2% by weight of Fmoc-amino acid (Anaspec) was then added to the solution followed by addition of 2% by weight of HOBt (Anaspec). Finally, 1% by weight of tetrazole thione was added to the solution. The solution was then filtered using a 0.05 μm filtration setup.",
                                "Carbodiimide Formation Mechanism:",
                                "The photo activated carbodiimide coupling was performed as follows:",
                                "Tetrazole thiones were used that upon exposure at 248 nm undergo a ring opening mechanism and release a carbodiimide that activates the carboxylic acid groups of amino acids being coupled to the wafer. Esters of -OBt or -OAt were formed upon addition of HOBt or HOAt. Thus, tetrazole thiones at 248 nm were used to photoactivate an amino acid to form a stable ester for efficient coupling.",
                                "Amino Acid Coupling:",
                                "A base resist solution containing 1 weight % of polymer and 3 weight % of piperidine dissolved in NMP was spin coated onto the wafer at 3000 rpm for 30 seconds and soft baked at 65° Celsius for 1 minute in a hot plate. Now the wafer was baked at 80° Celsius for 300 seconds. Fmoc protection was removed in all features leaving the unprotected amine group. The incoming amino acid activation solution was spin coated onto a wafer at 3000 rpm for 30 seconds and soft baked at 65° Celsius for 1 minute in a hot plate. Now the wafer was exposed using a reticle which exposes desired features for which the incoming amino acid needs to be coupled at an exposure dose of 120 mJ/cm2 and then hard baked at 85° Celsius for 90 seconds in a hot plate. As described above, tetrazole thione upon exposure releases a carbodiimide and selective activation of amino acid was achieved in the exposed features. Therefore, the incoming Fmoc-protected amino acid present in the activation solution was activated and coupled to the unprotected amine present on the wafer in the same step completing the coupling of one layer of amino acid. Each coupling layer comprises reticles for each incoming Fmoc amino acid to be coupled, which expose features independent of the other reticles used for the same layer. After coupling all amino acids for a particular layer, the wafer was then spin coated with a solution of 50 weight % of NMP and 50 weight % of acetic anhydride to cap any remaining unprotected amine of the wafer that had no amino acid coupled for this particular layer. The wafer was stripped in acetone and IPA to remove any base resist present on the surface after each step. The whole process was repeated for each individual coupling layer of amino acids designed to be coupled to complete the synthesis of peptide chains attached to the array surface.",
                                "Side Chain Protection Removal:",
                                "After the completion of peptide synthesis, any remaining side group protections present for any coupled amino acids were removed to enable biological activity of the peptide. A side chain protection removal solution was prepared by mixing 95 weight % trifluoroacetic acid [TFA] (Sigma Aldrich) and 5 weight % DI water. The wafers were reacted with the side chain protection removal solution for 90 mins. This step was followed by washing the wafer successively with TFA (for 5 mins), IPA (for 5 mins), NMP (for 5 mins), neutralize with 5 weight % of DIEA (Alfa Aesar) in NMP (for 5 mins), and followed by washing the wafer successively with NMP (for 5 mins) and IPA (for 5 mins)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe amino acid activation solution preparation",
                                "detail carbodiimide formation mechanism",
                                "illustrate amino acid coupling and Fmoc protection removal",
                                "describe side chain protection removal",
                                "detail peptide synthesis process",
                                "illustrate reticle exposure and amino acid coupling",
                                "describe capping and stripping process"
                            ],
                            "num_characters": 3673,
                            "outline_medium": [
                                "prepare amino acid activation solution",
                                "perform photoactivated carbodiimide coupling",
                                "synthesize peptides on array"
                            ],
                            "outline_short": [
                                "synthesize peptides on array"
                            ]
                        },
                        {
                            "title": "Example 4: Purity Analysis of Synthesized Peptides",
                            "paragraphs": [
                                "Mass Spectroscopy Analysis:",
                                "Peptide LKWLDSFTEQ (SEQ ID NO: 128 equals 1 in 24598PCT) was synthesized as described in Examples 1-3 and cleaved from the wafer substrate. The peptide was dissolved in 20-70% ceric ammonium nitrate [CAN] for 1.75 mins and loaded at 1.5 ml/min at 35° Celsius in a Phenomenex Luna column. The peptide mass was measured and matched the expected mass as shown in FIG. 5A.",
                                "Fluorescein Quality Control:",
                                "As a second control of the peptide synthesis process, end-of-line fluorescein quality control was performed. The final amino acid in each peptide sequence was deprotected by base (10% (v/v) of piperidine in NMP) for 20 minutes and coupled in a solution containing 1 weight % 5(6)-FAM (Anaspec), 2 weight % of DIC and 2 weight % of HOBt dissolved in NMP for 30 minutes. This was followed by washing steps successively with NMP (for 5 mins), ethanol (for 5 mins), mixture of 50 weight % EDA (Sigma Aldrich) and 50 weight % of ethanol for 30 mins, ethanol for 15 mins and IPA for 5 mins Based on the fluorescence signal of the probes the individual coupling yield of each amino acid coupling step and total coupling yield as described in more detail in the International Patent Application No. PCT/US2013/062773, the disclosure of which is hereby incorporated by reference in its entirety of all purpose. Examples for peptides LKWLDSFTEQ (SEQ ID NO: 128) and DKYYEPHLERA (SEQ ID NO: 129) are shown in FIGS. 5B and 5C."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe mass spectroscopy analysis",
                                "detail fluorescein quality control"
                            ],
                            "num_characters": 1443,
                            "outline_medium": [
                                "analyze peptide purity using mass spectroscopy and fluorescein quality control"
                            ],
                            "outline_short": [
                                "analyze purity of synthesized peptides"
                            ]
                        },
                        {
                            "title": "Example 5: Celiac Disease Sample Assay",
                            "paragraphs": [
                                "To discover a novel biomarker for the diagnosis of celiac disease (CD), sera was collected from three sources: a cohort collected as part of a previous study at Mayo Clinic2 (48 CD cases and 50 controls), a cohort from ARUP Labs (42 CD cases and 29 controls), and a commercially obtained cohort (12 rheumatoid arthritis (RA) cases and 7 systemic lupus erythematosus (SLE) cases). Further sera from a validation cohort (306 seropositive CD cases and 1590 controls), which was assembled in the previous study of the seropositivity of CD in a community19, were used for evaluating the diagnostic utility of identified or newly developed peptide sets from the cohort. Tables 3 and 4 show the demographic characteristics of the study population. All samples were handled by standard procedures and stored at −80° Celsius. All samples were probed using 1:101 Primary Antibody Dilution and 1:2000 Secondary Antibody Dilution and scanned on a Nikon Total Solution Platform consisting of Hamilton fluidics station and Gen 2 Microarray fluorescence scanner.",
                                "First, 188 sera samples from a set of 90 untreated patients with CD and 98 controls were analyzed for IgG and IgA reactivity to the GPs attached to the surface of the microarray for determining 3-mer amino acid subsequences that have the highest occurrences amongst GPs, which are most active for the celiac samples. Two distinct consensus GP sets (gliadin derived peptide sequences) were identified for discriminating CD from controls in the cohort, exhibiting 80% sensitivity and 85% specificity for a peptide set #1 for IgG reactivity, while 86% sensitivity and 89% specificity in peptide set #2 for IgA reactivity, as illustrated in Table 5."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe sera collection and handling",
                                "detail peptide microarray probing and scanning",
                                "illustrate IgG and IgA reactivity analysis"
                            ],
                            "num_characters": 1694,
                            "outline_medium": [
                                "analyze sera samples for IgG and IgA reactivity to gliadin-derived peptides"
                            ],
                            "outline_short": [
                                "analyze sera samples for celiac disease diagnosis"
                            ]
                        },
                        {
                            "title": "Example 6: Creation of Novel, Synthetic Biomarkers for CD Diagnosis",
                            "paragraphs": [
                                "A matrix table was generated, as illustrated in FIGS. 6A and 6B, showing the percentage of occurrence of among 3-mer subsequences included in the GPs most active for the celiac samples. To improve diagnostic accuracy for CD, a novel set of sequences was determined by combining 3-mer subsequences having a high occurrence rate included in this matrix table with other high-occurrence 3-mer sequences from the matrix table, random 3-mer or random 6-mer peptides to form 6-mer, 9-mer, 12-mer and 15-mer peptides, respectively. To assess the accuracies of the newly randomized peptide biomarker sequences (6-mers to 15-mers) for the CD diagnosis, random forest (RF),20 which is a statistical algorithm that creates voting classes of decision-making trees to evaluate the significance of each biomarker and classify samples, was used. The newly identified and RF-validated peptide sequences were then synthesized on a 110k peptide microarray with triple duplicates. 127 newly randomized and different peptides (SEQ ID NOS: 1-127) of these newly randomized peptide sequences displayed significantly improved sensitivity (IgG=97% or IgA=99%) and specificity (98% or 100%) (p<0.001) for CD diagnosis, when compared to the peptide set #1 and #2 from Example 5 using the current standard CD serology test with ELISA kits (Table 6). Table 1 and 2 lists the 127 peptides (SEQ ID NOS: 1-127) divided into sets #3 and #4 based on the peptides activity in either the IgG or the IgA assay, respectively. The cross-validated area under the curve of a Receiver Operating Characteristic (ROC) curve using these 127 peptide sequences for predicting CD autoimmunity (CDA) with IgA reactivity was 0.99, as illustrated in FIG. 7."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "generate matrix table of 3-mer subsequences",
                                "describe novel peptide sequence creation",
                                "detail random forest validation and peptide synthesis"
                            ],
                            "num_characters": 1707,
                            "outline_medium": [
                                "create novel biomarkers by combining high-occurrence 3-mer subsequences"
                            ],
                            "outline_short": [
                                "create novel biomarkers for CD diagnosis"
                            ]
                        },
                        {
                            "title": "Example 7: Relationship of Immune Reactivity of the Novel B Cell Epitopes with CD Severity",
                            "paragraphs": [
                                "To evaluate the correlation between duodenal pathology of CD and immune reactivity to the identified peptide sets, sera of 48 clinically proven CD cases were used. While none of the peptides in set #1 and set #2 from Example 5 could categorize sera samples based on the severity of enteropathy, 127 newly randomized peptides (SEQ ID NOS: 1-127) were able to distinguish between severe and less severe CD cases, as determined by the Marsh scoring system for small intestinal pathology, as illustrated in FIGS. 8 and 9."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "illustrate correlation between duodenal pathology and immune reactivity"
                            ],
                            "num_characters": 517,
                            "outline_medium": [
                                "evaluate correlation between immune reactivity and CD severity"
                            ],
                            "outline_short": [
                                "evaluate correlation between immune reactivity and CD severity"
                            ]
                        },
                        {
                            "title": "Example 8: Evaluation of the Novel B Cell Epitopes",
                            "paragraphs": [
                                "To validate the discriminative power of the novel peptides (SEQ ID NOS: 1-127) from the training cohort, sera from a population cohort of 1896 subjects were assayed in a blinded test. This cohort composed of 306 subjects with CDA and 1590 controls, who were tested with the current standard CD serology testing. CDA was defined with positivity to both tissue transglutaminase (tTG) IgA and endomysial antibodies (EMA), with a high predictive value for biopsy proven celiac disease. Of these 306 subjects (CDA), 33 individuals were subsequently diagnosed with CD during their follow up. The two novel synthetic peptides sets #3 and #4 comprising discontinuous gliadin sequences showed a high accuracy for distinguishing CDA cases from controls, achieving 99% sensitivity and 100% specificity (Table 6). In addition, CDA cases could be separated to a lower or a higher reactivity group based on antibody binding intensity, as illustrated in FIGS. 10A-10C, and the sera of all 33 subjects, who subsequently had clinically detected CD, exhibiting higher intensity than those who have not had CD detected subsequently.",
                                "To assess the training and validation set classification accuracies of the selected peptide biomarkers, random forest (RF)20 was used. Using the newly identified peptide biomarkers (SEQ ID NOS: 1-127) to diagnose the training set (n=188; 90 CD and 98 controls), RF had an overall accuracy of 98.9% [Out-of-Bag (OOB) Error 1.1%, a positive predictive value (PPV) of 100%, and a negative predictive value (NPV) of 98.2%]. When the same set of biomarkers were used to classify validating set sera (n=1896; 306 CDA and 1590 control), which played no part in the biomarker selection process, RF distinguished CDA samples from controls with equal accuracy (prediction error of 1.1%, PPV of 100.0%, and NPV of 98.2%). When these autoantibody biomarkers (SEQ ID NOS: 1-127) were used to classify all CD and control samples simultaneously (n=2084; 396 CD, 1688 control) in RF, they did so with a 99.1% sensitivity and 100% specificity.",
                                "In CD, some B-cell epitopes of gliadin have been shown to be linear.15 It is well recognized that antibodies recognize 3-dimensional structures that would not have affinity for the T-cell receptor when presented by antigen-presenting cells (APCs). Since immune response typifying CD may require proteins from wheat and like grains, the discovery power of this novel ultra through put platform was used to systematically search both linear continuous as well as discontinuous peptides derived from all known proteins. A set of novel epitopes was identified with a novel method with the set composed of discontinuous peptide sequences derived of the deamidated gliadin, that were recognized by the circulating antibodies found in the sera of patients with CD, showing high sensitivity and specificity for discriminating CD from controls. These 9-mer to 15-mer sequences, which are different from the known 33-mer gliadin sequence21, represent novel and heretofore unidentified B cell epitopes of gliadin. The identified peptides were subjected to a rigorous test of significance and predictive values by running a validation cohort from a community based samples that played no part in their selection with certain seropositive and other biopsy positive samples. Validation showed high accuracy of disease diagnosis and severity detection. For example, two sero-negative samples from the training cohort and six sero-negative samples were captured from the validation cohort increasing the sensitivity and specificity to 99% and 100% respectively. Furthermore, specific sequences were identified that allowed successful subgrouping according to severity, which is not possible by conventional antibodies.",
                                "The biomarker discovery via the platform of highly efficient mass manufacturing of ultra high density peptide microarrays presented here provides an efficient method to determine novel epitopes through mapping of antigens and combining the immunopotent sequences with random peptides. Peptide miroarrays based on 2.1 million of 9-mer to 15-mer peptides, each overlapping with three or six amino acids, were used to cover the immunogenic proteins with very high density maximizing the ability to identify informative peptides, and showed the effectiveness and utility of this technology on identification of unknown but novel epitopes that are recognized by patients with autoimmune disease. An advantage of this method includes the development of more precise diagnostic tests that can be incorporated into panels of testing for autoimmune diseases, including celiac disease. Moreover, the contribution of the individual amino acids of the antigen were evaluated for antibody binding, by designing microarrays of peptides containing lateral shifts of one amino acid, achieving higher mapping resolution for the target antigen.",
                                "All previous photolithography based microarray in situ synthesis methods5,22-24 are based on individually addressable deprotection step and then monomers coupling to those selective deprotected sites. The methods described herein involve generalized de-protection followed by selective activation, providing two advantages: 1) a far higher fidelity of peptide synthesis, and 2) a greatly reduced time requirement for each step. This permits a significantly higher number of steps, as many as 400, in the synthesis of a peptide microarray, leading with a very low yield loss. In some embodiment, the combination of high-fidelity and shorter reaction times result in a much higher yield and the ability to generate a large number of chips. Additional advantages include the cost savings due to high-fidelity that may be required for diagnostic testing. The method described herein utilizes the state of the art 248 nm semiconductor lithography semiconductor tools on a proven 300 mm silicon wafer platform. In some embodiments, a very high microarray density enables not only the molecular diversity needed for biomarker discovery but also to enable large scale biomarker validation. The method is well suited for mass manufacturing for routine diagnostics since the chips size can scale down to 0.5×0.5 mm2 fit any diagnostics well plate format, like 96, 384, 1396. This enables smaller size samples to be used for routine diagnostics.",
                                "The methods disclosed herein represent non-invasive, broadly availabile, low cost, and versatile methods by using the disclosed peptide microarrays, which are well-suited for routine health care diagnostic purposes and for providing a powerful novel tool for biomarker discovery.",
                                "While the invention has been particularly shown and described with reference to a preferred embodiment and various alternate embodiments, it will be understood by persons skilled in the relevant art that various changes in form and details can be made therein without departing from the spirit and scope of the invention.",
                                "All references, issued patents and patent applications cited within the body of the instant specification are hereby incorporated by reference in their entirety, for all purposes.",
                                "Finally, it should be noted that the language used in the specification has been principally selected for readability and instructional purposes, and may not have been selected to delineate or circumscribe the inventive subject matter. Accordingly, the disclosure of the present invention is intended to be illustrative, but not limiting, of the scope of the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe validation cohort and sera testing",
                                "detail random forest classification and accuracy",
                                "illustrate CDA case separation and antibody binding intensity",
                                "describe training and validation set classification",
                                "detail RF classification and prediction error",
                                "illustrate CD and control sample classification",
                                "describe novel epitope discovery and significance",
                                "detail validation cohort results and accuracy",
                                "illustrate sero-negative sample capture and sensitivity",
                                "describe subgrouping according to severity",
                                "detail biomarker discovery via peptide microarrays",
                                "illustrate advantages of the method",
                                "describe cost savings and high-fidelity synthesis",
                                "detail mass manufacturing and diagnostic applications"
                            ],
                            "num_characters": 7465,
                            "outline_medium": [
                                "validate novel peptides using a blinded test",
                                "evaluate discriminative power of novel peptides",
                                "assess training and validation set classification accuracies",
                                "identify novel epitopes using random forest algorithm",
                                "subgroup CD cases based on severity",
                                "discuss advantages of the method",
                                "conclude on the utility of the platform for biomarker discovery"
                            ],
                            "outline_short": [
                                "validate novel biomarkers for CD diagnosis",
                                "evaluate accuracy of novel biomarkers",
                                "discuss advantages of novel biomarkers"
                            ]
                        }
                    ],
                    "outline_long": [
                        "illustrate method of identifying biomarkers for celiac diseases",
                        "describe peptide library synthesis and microarray preparation",
                        "detail peptide microarray synthesis and surface derivatization"
                    ],
                    "num_characters": 1592,
                    "outline_medium": [
                        "illustrate method of identifying biomarkers for celiac diseases"
                    ],
                    "outline_short": [
                        "illustrate method of identifying biomarkers for celiac diseases"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An array of features attached to a surface at positionally-defined locations, said features comprising at least one engineered polypeptide chain comprising at least two epitope sequences from a bioactive polypeptide that generates an immune response in subject having celiac disease, wherein said polypeptide chain further comprises at least one randomly generated polypeptide sequence between at least two of the epitope sequences.",
        "2. The array of claim 1, wherein said bioactive polypeptide is selected from the group consisting of: alpha gliadin, beta gliadin, gamma gliadin, omega gliadin, and other wheat-related proteins or peptides.",
        "3. The array of claim 1, wherein said at least one engineered polypeptide chain comprises at least 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 30, 40, 50, 60, 70, 80, 90, or 100 sequences selected from the group consisting of SEQ ID NOS: 1-127.",
        "4. The array of claim 1, wherein said features are from 6 to 15 amino acids in length.",
        "5. The array of claim 1, wherein said features are 12 amino acids in length.",
        "6. The array of claim 1, wherein said features attached to the surface of the array are configured to have at least 90% sensitivity and 90% specificity for detection of celiac disorder after contact of said features with a sample from a subject suspected of having celiac disorder.",
        "7. (canceled)",
        "8. The array of claim 1, wherein each said at least two discontinuous epitopes consists of 3, 4, 5, 6, 7, 8, 9, 10, or 11 amino acids.",
        "9. The array of claim 1, wherein each of said at least two discontinuous epitopes consists of 3 amino acids with at least 20% sensitivity for binding to an antibody in a celiac positive sample, wherein said peptide chain is 12 amino acids in length.",
        "10. The array of claim 1 further comprising: at least 10,000 features, each feature is attached to a surface of the array at a different positionally-defined location, the positionally defined location of each feature corresponds to a positionally-defined location of a pillar, wherein the top surface of each pillar is at least 1 μm2 in size",
        "11. The array of claim 10, wherein each feature comprises a different engineered peptide chain compared to the other features, each feature comprises at least 500 identical full-length peptide chains, and wherein each identical full-length peptide chain has an engineered full-length of at least 7 amino acids in length, and the purity of each feature with regards to the fraction of full-length engineered peptide chains is a fraction F of the full-length engineered peptide chains of each feature having a engineered sequence and a engineered full-length sequence length N being characterized by F=10(N+1)·log(E/100%) with an average coupling efficiency E of at least 98.5% for coupling each amino acid of the engineered sequence, and the sequence length N being at least 7 amino acids in length, the fraction of the less than full-length engineered peptide chains equaling (1-F).",
        "12. The array of claim 10, wherein the surface comprises a substrate, the substrate comprising: a planar layer having an upper surface and a lower surface, and a plurality of pillars operatively coupled to the layer in the positionally-defined locations, and wherein each pillar has a planar surface extended from the layer, wherein the distance between the surface of each pillar and the upper surface of the layer is between 1,000-5,000 angstroms, and wherein the plurality of pillars are present at a density of greater than 10,000/cm2.",
        "13. A method of identifying novel epitopes for binding to an antibody associated with an autoimmune disorder, said method comprising:\nsynthesizing a plurality of polypeptides on a first array, said plurality of polypeptides comprising overlapping polypeptide sequences from a protein suspected of comprising epitopes that bind to an antibody associated with an immune disorder;\ncontacting said first array with a first sample from a subject with said immune disorder;\ndetermining which of said overlapping polypeptide sequences are bound to an antibody from said first sample to generate binding data;\nanalyzing said binding data to identify a plurality of continuous epitopes in said protein;\nfurther analyzing each of said plurality of continuous epitopes to identify a plurality of discontinuous epitope pairs with the highest sensitivity of binding to said antibody from said sample, thereby identifying novel epitopes for binding to said antibody associated with said autoimmune disorder; and\nsynthesizing a plurality of synthetic polypeptides on a second array, each synthetic polypeptide comprising at least two of said plurality of discontinuous epitopes, each synthetic polypeptide further comprising a random polypeptide sequence between at least two of said plurality of discontinuous epitopes.",
        "14. The method of claim 13, further comprising:\ncontacting said second array with a second sample from a subject with said immune disorder;\ndetermining the sensitivity and specificity of binding of antibodies from said second sample to each of said plurality of synthetic polypeptides; and\nidentifying the synthetic polypeptides with the highest sensitivity and/or specificity of binding to an antibody associated with said immune disorder, thereby identifying refined novel epitopes for binding to said antibody associated with said autoimmune disorder.",
        "15. The method of claim 13, wherein said plurality of polypeptides comprises a deamidated polypeptide sequence from said protein.",
        "16. The method of claim 13, wherein said plurality of polypeptides are 6-15 amino acids in length.",
        "17. The method of claim 13, wherein said autoimmune disorder is celiac disease.",
        "18. The method of claim 13, wherein said antibodies from said first or second sample are IgA or IgG antibodies.",
        "19. The method of claim 14, wherein said synthetic polypeptide is 6-15 amino acids in length.",
        "20. (canceled)",
        "21. The method of claim 13, wherein said plurality of continuous epitopes each bind to an antibody in at least 20%, 30%, 40%, or 50% of samples comprising said autoimmune disorder.",
        "22-27. (canceled)",
        "28. A substantially purified and/or recombinant peptide comprising an amino acid sequence selected from the group consisting of SEQ ID NOS: 1-127, or a biologically active fragment or variant of any one or more thereof.",
        "29-32. (canceled)"
    ]
}