{
    "id": "US20150315643",
    "authors": [
        "Anne O'Garra",
        "Chloe Bloom",
        "Matthew Paul Reddoch Berry",
        "Jacques F. Banchereau",
        "Damien Chaussabel",
        "Viginia Maria Pascual"
    ],
    "title": "BLOOD TRANSCRIPTIONAL SIGNATURES OF ACTIVE PULMONARY TUBERCULOSIS AND SARCOIDOSIS",
    "date": "2013-12-13 00:00:00",
    "abstract": "The present invention includes a method of determining a lung disease from a patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia comprising: obtaining a sample from whole blood of the patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia; detecting expression of (although not exclusive) six or more disease genes, markers, or probes selected from SEQ ID NOS.: 1 to 1446, wherein increased expression of mRNA of upregulated sarcoidosis, tuberculosis, lung cancer and pneumonia markers of SEQ ID NOS.: 1 to 1446 and/or decreased expression of mRNA of downregulated sarcoidosis, tuberculosis, lung cancer or pneumonia markers of SEQ ID NOS.: 1 to 1446 relative to the expression of the mRNAs from a normal sample; and determining the lung disease based on the expression level of the six or more disease markers of SEQ ID NOS.: 1 to 1446 based on a comparison of the expression level of sarcoidosis, tuberculosis, lung cancer, and pneumonia.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates in general to the field of medical diagnosis and medical treatment, and more particularly, to a novel blood transcriptional signatures to distinguish between active pulmonary tuberculosis, sarcoidosis, lung cancer and pneumonia."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field"
                    ],
                    "num_characters": 258,
                    "outline_medium": [
                        "define technical field"
                    ],
                    "outline_short": [
                        "define medical diagnosis"
                    ]
                },
                {
                    "title": "STATEMENT OF FEDERALLY FUNDED RESEARCH",
                    "paragraphs": [
                        "None."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "state none"
                    ],
                    "num_characters": 5,
                    "outline_medium": [
                        "state none"
                    ],
                    "outline_short": [
                        "none"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Without limiting the scope of the invention, its background is described in connection with transcriptional signatures. Over nine million new cases of active tuberculosis (TB), and 1.4 million deaths from TB, are estimated to occur around the world every year (1). One of the difficulties of curing pulmonary TB is the ability to diagnose the disease from other similar pulmonary diseases such as pulmonary sarcoidosis, community acquired pneumonia and lung cancer. TB and sarcoidosis are widespread multisystem diseases that preferentially involve the lung and present in a very similar clinical, radiological and histological manner. Distinguishing these diseases therefore often requires an invasive biopsy.",
                        "Granuloma formation is fundamental to both these diseases and although the aetiology of TB is well-recognised as the pathogen Mycobacterium tuberculosis, the predominant cause of sarcoidosis remains unknown (2). The underlying pathways of granulomatous inflammation are also poorly understood and there is little understanding of disease-specific differences. Both sarcoidosis and TB can affect adults within the same age group, who then present with similar pulmonary symptoms and radiological thoracic abnormalities (3, 4). TB can also display a similar presentation to other pulmonary infectious diseases such as community acquired pneumonia and other lung inflammatory disorders such as primary lung cancer. Due to the complexity of these diseases a systems biology approach offers the ability to help unravel the principal host immune responses. Peripheral blood has the capacity to reflect pathological and immunological changes in the body, and identification of disease-associated alterations can be determined by a blood transcriptional signature (5). In addition the applicants have published a IFN-inducible neutrophil blood transcriptional signature in active TB patients that is absent in the majority of latent individuals and healthy controls, that correlates significantly with the extent of lung radiographic disease (5) and is diminished upon treatment (5, 12).",
                        "Blood gene expression profiling has been successfully applied to other infectious and inflammatory disorders, such as systemic lupus erythematosus (SLE), to help understand disease mechanisms and improve diagnosis and treatment (5). Two recent studies have used blood transcriptional profiling for the comparison of pulmonary TB and sarcoidosis; both studies found the diseases had similar transcriptional responses, which involved the overexpression of IFN-inducible genes (9, 10). However, these studies did not differentiate signatures from other pulmonary diseases leaving to question if the transcriptional signatures were non-specific for pulmonary disorders."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate medical diagnosis",
                        "describe tuberculosis",
                        "describe sarcoidosis",
                        "limitations of current diagnosis",
                        "introduce blood transcriptional signatures"
                    ],
                    "num_characters": 2758,
                    "outline_medium": [
                        "motivate transcriptional signatures",
                        "discuss limitations of current diagnosis"
                    ],
                    "outline_short": [
                        "motivate transcriptional signatures"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "In one embodiment, the present invention includes a method of determining if a human subject is afflicted with pulmonary disease comprising: obtaining a sample from a subject suspected of having a pulmonary disease; determining the expression level of six or more genes from each of the following genes expressed in one or more of the following expression pathways: EIF2 signaling; mTOR signaling; regulation of eIF4 and p70s6K signaling; interferon signaling; antigen presentation pathways; T cell signaling pathways; and other signaling pathways; comparing the expression level of the six or more genes with the expression level of the same genes from individuals not afflicted with a pulmonary disease, and determining the level of expression of the six or more genes in the sample from the subject relative to the samples from individuals not afflicted with a pulmonary disease for the genes expressed in the one or more expression pathways, wherein co-expression of genes in the EIF2 signaling and mTOR signaling pathways are indicative of active sarcoidosis; co-expression of genes in the regulation of eIF4 and p70s6K signaling pathways is indicative of pneumonia; co-expression of genes in the interferon signaling and antigen presentation pathways are indicative of tuberculosis; and co-expression of genes in the T cell signaling pathways; and other signaling pathways is indicative of lung cancer. In one aspect, the genes associated with tuberculosis are selected from at least 3, 4, 5 or 6 genes selected from ANKRD22; FCGR1A; SERPING1; BATF2; FCGR1C; FCGR1B; LOC728744; IFITM3; EPSTI1; GBP5; IF144L; GBP6; GBP1; LOC400759; IFIT3; AIM2; SEPT4; C1QB; GBP1; RSAD2; RTP4; CARD17; IFIT3; CASP5; CEACAM1; CARD17; ISG15; IF127; TIMM10; WARS; IF16; TNFAIP6; PSTPIP2; IF144; SCO2; FBXO6; FER1L3; CXCL10; DHRS9; OAS1; STAT1; HP; DHRS9; CEACAM1; SLC26A8; CACNA1E; OLFM4; and APOL6, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with tuberculosis and not active sarcoidosis, pneumonia or lung cancer are selected from C1QB; IF127; SMARCD3; SOCS1; KCNJ15; LPCAT2; ZDHHC19; FYB; SP140; IFITM1; ALAS2; CEACAM6; OAS2; C1QC; LOC100133565; ITGA2B; LY6E; SP140; CASP7; GADD45G; FRMD3; CMPK2; AQP10; CXCL14; ITPRIPL2; FAS; XK; CARD16; SLAMF8; SELP; NDN; OAS2; TAPBP; BPI; DHX58; GAS6; CPT1B; CD300C; LILRA6; USF1; C2; 38231.0; NFXL1; GCH1; CCR1; OAS2; CCR2; F2RL1; SNX20; and ARAP2, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with active sarcoidosis are selected from FCGR1A; ANKRD22; FCGR1C; FCGR1B; SERPING1; FCGR1B; BATF2; GBP5; GBP1; IFIT3; ANKRD22; LOC728744; GBP1; EPSTI1; IF144L; INDO; IFITM3; GBP6; RSAD2; DHRS9; TNFAIP6; IFIT3; P2RY14; DHRS9; IDO1; STAT1; WARS; TIMM10; P2RY14; LOC389386; FER1L3; IFIT3; RTP4; SCO2; GBP4; IFIT1; LAP3; OASL; CEACAM1; LIMK2; CASP5; STAT1; CCL23; WARS; ATF3; IF16; PSTPIP2; ASPRV1; FBXO6; and CXCL10, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with active sarcoidosis and not tuberculosis, pneumonia or lung cancer are selected from CCL23; PIK3R6; EMR4; CCDC146; KLF4; GRINA; SLC4A1; PLA2G7; GRAMD1B; RAPGEF1; NXNL1; TRIM58; GABBR1; TAGLN; KLF4; MFAP3L; LOC641798; RIPK2; LOC650840; FLJ43093; ASAP2; C15orf26; REC8; KIAA0319L; GRINA; FLJ30092; BTN2A1; HIF1A; LOC440313; HOXA1; LOC645153; ST3GAL6; LONRF1; PPP1R3B; MPPE1; LOC652699; LOC646144; SGMS1; BMP2K; SLC31A1; ARSB; CAMK1D; ICAM4; HIF1A; LOC641996; RNASE10; PI15; SLC30A1; LOC389124; and ATP1A3, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with pneumonia are selected from OLFM4; LTF; VNN1; HP; DEFA4; OPLAH; CEACAM8; DEFA1B; ELANE; C19orf59; ARG1; CDK5RAP2; DEFA1B; DEFA3; DEFA1B; FCGR1A; MMP8; FCGR1B; SLPI; SLC26A8; MAPK14; CAMP; NLRC4; FCAR; RNASE3; FCGR1B; NAIP; OLR1; FCGR1C; ANXA3; DEFA1; PGLYRP1; TCN1; ANKDD1A; COL17A1; SLC26A8; TMEM144; SAMD14; MAPK14; RETN; NAIP; GPR84; CASP5; MPO; MMP9; CR1; MYL9; CLEC4D; ITGAX; and ANKRD22, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with pneumonia and not tuberculosis, active sarcoidosis, or lung cancer are selected from DEFA4; ELANE; MMP8; OLR1; COL17A1; RETN; GPR84; LOC100134379; TACSTD2; SLC2A11; LOC100130904; MCTP2; AZU1; DACH1; GADD45A; NSUN7; CR1; CDK5RAP2; LOC284648; GPR177; CLEC5A; UPB1; SLC2A5; GPR177; APP; LAMC1; REPS2; PIK3CB; SMPDL3A; UBE2C; NDUFAF3; CDC20; CTSK; RAB13; LOC651524; TMEM176A; PDGFC; ATP9A; SV2A; SPOCD1; MARCO; CCDC109A; NUSAP1; SLCO4C1; CYP27A1; LOC644615; PKM2; BMX; PADI4; and NAMPT, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with lung cancer are selected from ARG1; TPST1; FCGR1A; C19orf59; SLPI; FCGR1B; IL1R1; FCGR1C; TDRD9; SLC26A8; FCGR1B; CLEC4D; LOC100132858; SLC22A4; LOC100133177; SIPA1L2; ANXA3; LIMK2; TMEM88; MMP9; ASPRV1; MANSC1; TLR5; CD163; CAMP; LOC642816; DPRXP4; LOC643313; NTN3; MRVI1; F5; SOCS3; TncRNA; MIR21; LOC100170939; LOC100129904; GRB10; ASGR2; LOC642780; LOC400499; FCAR; KREMEN1; SLC22A4; CR1; LOC730234; SLC26A8; C7orf53; VNN1; NLRC4; and LOC400499, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with lung cancer and not tuberculosis, active sarcoidosis, or pneumonia are selected from TPST1; MRVI1; C7orf53; ECHDC3; LOC651612; LOC100134660; TIAM2; KIAA1026; HECW2; TLE3; TBC1D24; LOC441193; CD163; RFX2; LOC100134688; LOC642342; FKBP9L; PHF20L1; LOC402176; CD163; OSBPL1A; PRMT5; UBTD1; ADORA3; SH2D3C; RBP7; ERGIC1; TMEM45B; CUX1; TREM1; C1GALT1C1; MAML3; C15orf29; DSC2; RRP12; LRP3; HDAC7A; FOS; C14orf4; LIPN; MAP1LC3B2; LOC400793; LOC647834; PHF20L1; CCNJL; SLC12A6; FLJ42957; CCDC147; SLC25A40; and LOC649270, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes. In another aspect, the genes associated with lung cancer and not tuberculosis, active sarcoidosis, or pneumonia are selected from wherein the genes associated with lung cancer and not tuberculosis, active sarcoidosis, or pneumonia are selected from Table 1 by: parsing the genes into the expression pathways, and determining that the subject is afflicted with a pulmonary disease selected from tuberculosis, sarcoidosis, cancer or pneumonia based on the gene expression from a sample obtained from the subject when compared to the level of expression of the genes in each of the expression pathways. In another aspect, the specificity is 90 percent or greater and sensitivity is 80 percent or greater for a diagnosis of tuberculosis or sarcoidosis. In another aspect, the method further comprises a method for displaying if the patient has tuberculosis or sarcoidosis aggregating the expression data from the 3, 4, 5, 6 or more genes into a single visual display of a vector of expression for tuberculosis, sarcoidosis, cancer or an infectious pulmonary disease. In another aspect, the method further comprises the step of detecting and evaluating 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes for the analysis. In another aspect, the method further comprises the step of detecting and evaluating the EIF2 signaling; mTOR signaling; regulation of eIF4 and p70s6K signaling; interferon signaling; antigen presentation pathways; T cell signaling pathways; and other signaling pathways from 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes that are upregulated or downregulated and are selected from UBE2J2; ALPL; JMJD6; FCER1G; LILRA5; LY96; FCGR1C; C10orf33; GPR109B; PROK2; PIM3; SH3GLB1; DUSP3; PPAP2C; SLPI; MCTP1; KIF1B; FLJ32255; BAGE5; IFITM1; GPR109A; IF135; LOC653591; KREMEN1; IL18R1; CACNA1E; ABCA2; CEACAM1; MXD4; TncRNA; LMNB1; H2AFJ; HP; ZNF438; FCER1A; SLC22A4; DISC1; MEFV; ABCA1; ITPRIPL2; KCNJ15; LOC728519; ERLIN1; NLRC4; B4GALT5; LOC653610; HIST2H2BE; AIM2; P2RY10; CCR3; EMR4P; NTN3; C1QB; TAOK1; FCGR1B; GATA2; FKBP5; DGAT2; TLR5; CARD17; INCA; MSL3L1; ESPN; LOC645159; C19orf59; CDK5RAP2; PLSCR1; RGL4; IFI30; LOC641710; GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.: 754); LOC100008589; LOC100008589; SMARCD3; NGFRAP1; LOC100132394; OPLAH; CACNG6; LILRB4; HIST2H2AA4; CYP1B1; PGS1; SPATA13; PFKFB3; HIST1H3D; SNORA73B; SLC26A8; SULT1B1; ADM; HIST2H2AA3; HIST2H2AA3; GYG1; CST7; EMR4; LILRA6; MEF2D; IFITM3; MSL3; DHRS13; EMR4; C16orf57; HIST2H2AC; EEF1D; TDRD9; GPR97; ZNF792; LOC100134364; SRGAP3; FCGR1A; HPSE; LOC728417; LOC728417; MIR21; HIST1H2BG; COP1; SMARCD3; LOC441763; ZSCAN18; GNG8; MTRF1L; ANKRD33; PLAC8; PLAC8; SLC26A8; AGTRAP; FLJ43093; LPCAT2; AGTRAP; S100A12; SVIL; LILRA5; LILRA5; ZFP91; CLC; LOC100133565; LTB4R; SEPT04; ANXA3; BHLHB2; IL4R; IFNAR1; MAZ; GCCCCCTAATTGACTGAATGGAACCCCTCTTGACCAAAGTGACCCCAGAA (SEQ ID NO.: 1379); OSM; and optionally excluding at least one of ADM, SEPT4, IFITM1, FCER1G, MED2F, CDK5RAP2 or CARD16. In another aspect, the genes that are downregulated are selected from MEF2D; BHLHB2; CLC; FCER1A; SRGAP3; FLJ43093; CCR3; EMR4; ZNF792; C10orf33; CACNG6; P2RY10; GATA2; EMR4P; ESPN; EMR4; MXD4; and ZSCAN18. In another aspect, the interferon inducible genes are selected from CD274; CXCL10; GBP1; GBP2; GBP5; IF116; IF135; IF144; IF144L; IF16; IFIH1; IFIT2; IFIT3; IFIT5; IFITM1; IFITM3; IRF7; OAS1; OAS2; OAS3; SOCS1; STAT1; STAT2; TAP1; and TAP2. In another aspect, the sample is a blood, peripheral blood mononuclear cells, sputum, or lung biopsy. In another aspect, the expression level comprises a mRNA expression level and is quantitated by a method selected from the group consisting of polymerase chain reaction, real time polymerase chain reaction, reverse transcriptase polymerase chain reaction, hybridization, probe hybridization and gene expression array. In another aspect, the expression level is determined using at least one technique selected from the group consisting of polymerase chain reaction, heteroduplex analysis, single stand conformational polymorphism analysis, ligase chain reaction, comparative genome hybridization, Southern blotting, Northern blotting, Western blotting, enzyme-linked immunosorbent assay, fluorescent resonance energy-transfer and sequencing. In another aspect, the expression level is determined by microarray analysis that comprises use of oligonucleotides that hybridize to mRNA transcripts or cDNAs for the six or more genes, and wherein the oligonucleotides are disposed or directly synthesized on the surface of a chip or wafer. In another aspect, the oligonucleotides are about 10 to about 50 nucleotides in length. In another aspect, the method further comprises the step of using the determined comparative gene product information to formulate at least one of diagnosis, a prognosis or a treatment plan. In another aspect, the patient's disease state is further determined by radiological analysis of the patient's lungs. In another aspect, the method further comprises the step of determining a treated patient gene expression dataset after the patient has been treated and determining if the treated patient gene expression dataset has returned to a normal gene expression dataset thereby determining if the patient has been treated.",
                        "Another embodiment of the present invention includes a method of determining a lung disease from a patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia comprising: obtaining a sample from the patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia; detecting expression of 3, 4, 5, 6 or more disease genes, markers, or probes of Table 1 (SEQ ID NOS.: 1 to 1446), wherein increased expression of mRNA of upregulated sarcoidosis, tuberculosis, lung cancer and pneumonia markers of Table 1 and/or decreased expression of mRNA of downregulated sarcoidosis, tuberculosis, lung cancer or pneumonia markers of Table 1 relative to the expression of the mRNAs from a normal sample; and determining the lung disease based on the expression level of the six or more disease markers of Table 1 based on a comparison of the expression level of sarcoidosis, tuberculosis, lung cancer, and pneumonia. In one aspect, the method further comprises the step of selecting 3, 4, 5, 6 or more genes that are differentially expressed between sarcoidosis, tuberculosis, lung cancer, and pneumonia. In another aspect, the method further comprises the step of differentiating between sarcoidosis that is active sarcoidosis and inactive sarcoidosis by determining the expression levels of six or more genes, markers, or probes selected from: TMEM144; FBLN5; FBLN5; ERI1; CXCR3; GLUL; LOC728728; KLHDC8B; KCNJ15; RNF125; CCNB1IP1; PSG9; LOC100170939; QPCT; CD177; LOC400499; LOC400499; LOC100134634; TMEM88; LOC729028; EPSTI1; INSC; LOC728484; ERP27; CCDC109A; LOC729580; C2; TTRAP; ALPL; MAEA; COX10; GPR84; TRMT11; ANKRD22; MATK; TBC1D24; LILRA5; TMEM176B; CAMP; PKIA; PFTK1; TPM2; TPM2; PRKCQ; PSTPIP2; LOC129607; APRT; VAMPS; FCGR1C; SHKBP1; CD79B; SIGIRR; FKBP9L; LOC729660; WDR74; LOC646434; LOC647834; RECK; MGST1; PIWIL4; LILRB1; FCGR1B; NOC3L; ZNF83; FCGBP; SNORD13; LOC642267; GBP5; EOMES; BST1; C5; CHMP7; ETV7; ILVBL; LOC728262; GNLY; LOC388572; GATA1; MYBL1; LOC441124; LOC441124; IL12RB1; BRIX1; GAS6; GAS6; LOC100133740; GPSM1; C6orf129; IER3; MAPK14; PROK1; GPR109B; SASP; LOC728093; PROK2; CTSW; ABHD2; LOC100130775; SLITRK4; FBXW2; RTTN; TAF15; FUT7; DUSP3; LOC399715; LOC642161; LOC100129541; TCTN1; SLAMF8; TGM2; ECE1; CD38; INPP4B; ID3; CR1; CR1; TAPBP; PPAP2C; MBOAT2; MS4A2; FAM176B; LOC390183; SERPING1; LOC441743; H1F0; SOD2; LOC642828; POLB; TSPAN9; ORMDL3; FER1L3; LBH; PNKD; SLPI; SIRPB1; LOC389386; REC8; GNLY; GNLY; FOLR3; LOC730286; SKAP1; SELP; DHX30; KIAA1618; NQO2; ANKRD46; LOC646301; LOC400464; LOC100134703; C20orf106; SLC25A38; YPEL1; IL1R1; EPHA1; CHD6; LIMK2; LOC643733; LOC441550; MGC3020; ANKRD9; NOD2; MCTP1; BANK1; ZNF30; FBXO7; FBXO7; ABLIM1; LAMP3; CEBPE; LOC646909; BCL11B; TRIM58; SAMD3; SAMD3; MYOF; TTPAL; LOC642934; FLJ32255; LOC642073; CAMKK2; OAS2; RASGRP1; CAPG; LOC648343; CETP; CETP; CXCR7; UBASH3A; LOC284648; IL1R2; AGK; GTPBP8; LEF1; LEF1; GPR109A; IF135; IRF7; IRF7; SP4; IL2RB; ABLIM1; TAPBP; MAL; TCEA3; KREMEN1; KREMEN1; VNN1; GBP1; GBP1; UBE2C; DET1; ANKRD36; DEFA4; GCH1; IL7R; TMCO3; FBXO6; LACTB; LOC730953; LOC285296; IL18R1; PRR5; LOC400061; TSEN2; MGC15763; SH3YL1; ZNF337; AFF3; TYMS; ZCCHC14; SLC6A12; LY6E; KLF12; LOC100132317; TYW3; BTLA; SLC24A4; NCALD; ORAI2; ITGB3BP; GYPE; DOCKS; RASGRP4; LOC339290; PRF1; TGFBR3; LGALS9; LGALS9; BATF2; MGC57346; TXK; DHX58; EPB41L3; LOC100132499; LOC100129674; GDPD5; ACP2; C3AR1; APOB48R; UTRN; SLC2A14; CLEC4D; PKM2; CDCA5; CACNA1E; OSBPL3; SLC22A15; VPREB3; LOC642780; MEGF6; LOC93622; PFAS; LOC729389; CREBZF; IMPDH1; DHRS3; AXIN2; DDX60L; TMTC1; ABCA2; CEACAM1; CEACAM1; FLJ42957; SIAH2; DDAH2; C13orf18; TAGLN; LCN2; RELB; NR1I2; BEND7; PIK3C2B; IF16; DUT; SETD6; LOC100131572; TNRC6A; LOC399744; MAPK13; TAP2; CCDC15; TncRNA; SIPA1L2; HIST1H4E; PTPRE; ELANE; TGM2; ARSD; LOC651451; CYFIP1; CYFIP1; LOC642255; ASCC2; ZNF827; STAB1; LMNB1; MAP4K1; PSMB9; ATF3; CPEB4; ATP5S; CD5; SYTL2; H2AFJ; HP; SORT1; KLHL18; HIST1H2BK; KRTAP19-6; RNASE2; LOC100134393; C11orf82; BLK; CD160; LOC100128460; CD19; ZNF438; MBNL3; MBNL3; LOC729010; NAGA; FCER1A; C6orf25; SLC22A4; LOC729686; CTSL1; BCL11A; ACTA2; KIAA1632; UBE2C; CASP4; SLC22A4; SFT2D2; TLR2; C10orf105; EIF2AK2; TATDN1; RAB24; FAH; DISC1; LOC641848; ARG1; LCK; WDFY3; RNF165; MLKL; LOC100132673; ANKDD1A; MSRB3; LOC100134379; MEFV; C12orf57; CCDC102A; LOC731777; LOC729040; TBC1D8; KLRF1; KLRF1; ABCA1; LOC650761; LOC653867; LOC648710; SLC2A11; LOC652578; GPR114; MANSC1; MANSC1; DGKA; LIN7A; ITPRIPL2; ANO9; KCNJ15; KCNJ15; LOC389386; LOC100132960; LOC643332; SF11; ABCE1; ABCE1; SERPINA1; OR2W3; ABI3; LOC400759; LOC728519; LOC654053; LOC649553; HSD17B8; C16orf30; GADD45G; TPST1; GNG7; SV2A; LOC649946; LOC100129697; RARRES3; C8orf83; TNFSF13B; SNRPD3; LOC645232; PI3; WDFY1; LOC100133678; BAMBI; POPS; TARBP1; IRAK3; ZNF7; NLRC4; SKAP1; GAS7; C12orf29; KLRD1; ABHD15; CCDC146; CASP5; AARS2; LOC642103; LOC730385; GAR1; MAF; ARAP2; C16orf7; HLA-C; FLJ22662; DACH1; CRY1; CRY1; LRRC25; KIAA0564; UPF3A; MARCO; SRPRB; MAD1L1; LOC653610; P4HTM; CCL4L1; LAPTM4B; MAPK14; CD96; TLR7; KCNMB1; P2RX7; LOC650140; LOC791120; LTF; C3orf75; GPX7; SPRYD5; MOV10; EEF1B2; CTDSPL; HIST2H2BE; SLC38A1; AIM2; LOC100130904; LOC650546; P2RY10; ILSRA; MMP8; LOC100128485; RPS23; HDAC7; GUCY1A3; TGFA; NAIP; NAIP; NELL2; SIDT1; SLAMF1; MAPK14; CCR3; MKNK1; D4S234E; NBN; LOC654346; FGFBP2; BTLA; LRRN3; MT2A; LOC728790; LOC646672; NTN3; CD8A; CD8A; ZBP1; LDOC1L; CHM; LOC440731; LOC100131787; TNFRSF10C; LOC651612; STX11; LOC100128060; C1QB; PVRL2; ZMYND15; TRAPPC2P1; SECTM1; TRAT1; CAMKK2; CXCR5; CD163; FAS; RPL12P6; LOC100134734; CD36; FCGR1B; NR3C2; CSGALNACT2; GATA2; EBI2; EBI2; FKBP5; CRISPLD2; LOC152195; LOC100132199; DGAT2; SCML1; LSS; CIITA; SAP30; TLR5; NAMPT; GZMK; CARD17; INCA; MSL3L1; CD8A; MIIP; SRPK1; SLC6A6; C10orf119; C17orf60; LOC642816; AKR1C3; LHFPL2; CR1; KIAA1026; CCDC91; FAM102A; FAM102A; UPRT; PLEKHA1; CACNA2D3; DDX10; RPL23A; C2orf44; LSP1; C7orf53; DNAJC5; SLAIN1; CDKN1C; HIATL1; CRELD1; ZNHIT6; TIFA; ARL4C; PIGU; MEF2A; PIK3CB; CDK5RAP2; FLNB; GRAP; BATF; CYP4F3; KIR2DL3; C19orf59; NRG1; PPP2R2B; CDK5RAP2; PLSCR1; UBL7; HES4; ZNF256; DKFZp761E198; SAMD14; BAG3; PARP14; MS4A7; ECHDC3; OCIAD2; LOC90925; RGL4; PARP9; PARP9; CD151; SAAL1; LOC388076; SIGLEC5; LRIG1; PTGDR; PTGDR; NBPF8; NHS; ACSL1; HK3; SNX20; F2RL1; F2RL1; PARP12; LOC441506; MFGE8; SERPINA10; FAM69A; IL4R; KIAA1671; OAS3; PRR5; TMEM194; MS4A1; MTHFD2; LOC400793; CEACAM1; APP; RRBP1; SLCO4C1; XAF1; XAF1; SLC2A6; ZNF831; ZNF831; POLR1C; GLT1D1; VDR; IFIT5; SNHG8; TOP1MT; UPP1; SYTL2; LOC440359; KLRB1; MTMR3; S1PR1; FYB; CDC20; MEX3C; FAM168B; SLC4A7; CD79B; FAM84B; LOC100134688; LOC651738; PLAGL1; TIMM10; LOC641710; TRAF5; TAP1; FCRL2; SRC; RALGAPA1; OCIAD2; PON2; LOC730029; LOC100134768; LOC100134241; LOC26010; PLA2G12A; BACH1; DSC1; NOB1; LOC645693; LOC643313; BTBD11; REPS2; ZNF23; C18orf55; APOL2; APOL2; PASK; FER1L3; U2AF1; LOC285359; SIGLEC14; ARL1; C19orf62; NCR3; HOXB2; RNF135; IFIT1; KLF12; LILRB2; LOC728835; GSN; LOC100008589; LOC100008589; FLJ14213; SH2D3C; LOC100133177; HIST2H2AB; KIAA1618; C21orf2; CREB5; FAS; MTF1; RSAD2; ANPEP; C14orf179; TXNL4B; MYL9; MYL9; LOC100130828; LOC391019; ITGA2B; KLRC3; RASGRP2; NDST1; LOC388344; IF16; OAS1; OAS1; TRIM10; LIMK2; LIMK2; ATP5S; SMARCD3; PHC2; SOX8; LCK; SAMD9L; EHBP1; E2F2; CEACAM6; LOC100132394; LOC728014; LOC728014; SIRPG; OPLAH; FTHL2; CXorf21; CACNG6; C11orf75; LY9; LILRB4; STAT2; RAB20; SOCS1; PLOD2; UGDH; MAK16; ITGB3; DHRS9; PLEKHF1; ASAP1IT1; PSME2; LOC100128269; ALX1; BAK1; XPO4; CD247; FAM43A; ICOS; ISG15; HIST2H2AA4; CD79A; SLC25A4; TMEM158; GPR18; LAP3; TNFSF13B; TC2N; HSF2; CD7; C20orf3; HLA-DRB3; SESN1; LOC347376; P2RY14; P2RY14; P2RY14; CYP1B1; IFIT3; IFIT3; RPL13L; LOC729423; DBN1; TTC27; DPH5; GPR141; RBBP8; LOC654350; SLC30A1; PRSS23; JAM3; GNPDA2; IL7R; ACAD11; LOC642788; ALPK1; LOC439949; BCAT1; ATPGD1; TREML1; PECR; SPATA13; MAN1C1; ID01; TSEN54; SCRN1; LOC441193; LOC202134; KIAA0319L; MOSC1; PFKFB3; GNB4; ANKRD22; PROS1; CD40LG; RIOK2; AFF1; HIST1H3D; SLC26A8; SLC26A8; RNASE3; UBE2L6; UBE2L6; SSH1; KRBA1; SLC25A23; DTX3L; DOK3; SULT1B1; RASGRP4; ALOX15B; ADM; LOC391825; LOC730234; HIST2H2AA3; HIST2H2AA3; LIMK2; MMRN1; FKBP1A; GYG1; ASF1A; CD248; CD3G; DEFA1; EPHX2; CST7; ABLIM3; ANKRD55; SLC45A3; RAB33B; LILRA6; LILRA6; SPTLC2; CDA; PGD; LOC100130769; ECHDC2; KIF20B; B3GNT8; PYHIN1; LBH; LBH; BPI; GAR1; ST3GAL4; TMEM19; DHRS12; DHRS12; FAM26F; FCRLA; OSBPL7; CTSB; ALDH1A1; SRRD; TOLLIP; ICAM1; LAX1; CASP7; ZDHHC19; LOC732371; DENND1A; EMR2; LOC643308; ADA; LOC646527; LOC643313; GZMB; OLIG2; HLA-DPB1; MX1; THOC3; TRPM6; GK; JAK2; ARHGEF11; ARHGEF11; HOMER2; TACSTD2; CA4; GAA; IFITM3; CLYBL; CLYBL; MME; ZNF408; STAT1; STAT1; PNPLA7; INDO; PDZD8; PDGFD; CTSL1; HOMER3; CEP78; SBK1; ALG9; IL1R2; RAB40B; MMP23B; PGLYRP1; UHRF1; IF144L; PARP10; PARP10; GOLGA8A; CCR7; HEMGN; TCF7; CLUAP1; LOC390735; LOC641849; TYMP; DEFA1B; DEFA1B; DEFA1B; REPS2; REPS2; OSBPL1A; C11orf1; MCTP2; EMR4; LOC653316; FCRL6; MRPS26; RHOBTB3; DIRC2; CD27; PLEKHG4; CDH6; C4orf23; HIST2H2AC; SLC7A6; SLC7A6; SLAMF6; RETN; FAIM3; TMEM99; LOC728411; TMEM194A; NAPEPLD; ACOX1; CTLA4; SCO2; STK3; FLT3LG; VASP; FBXO31; TDRD9; TDRD9; LOC646144; NUSAP1; GPR97; GPR97; GPR97; EMR1; SLAMF6; CCDC106; ODF3B; LOC100129904; PADI4; LOC100132858; PIK3AP1; ZNF792; DIP2A; OSCAR; CLIC3; FANCE; TECPR2; P2RY10; ADORA3; IL18RAP; DEFA3; BRSK1; LOC647691; S1PR5; CPA3; BMX; DDX58; RHOBTB1; TNFRSF25; LOC730387; OLR1; HERC5; STAT1; NELF; STAP1; ZNF516; ARHGAP26; TIMP2; FCGR1A; RHOH; IF144; MTX3; CD74; LCK; TLR4; DSC2; CXorf45; ENPP4; CD300C; OASL; HPSE; MTHFD2; GSTM2; OLFM4; ABHD12B; LOC728417; LOC728417; FCAR; GTPBP3; KLF4; HOPX; THBD; HIST1H2BG; LOC730995; NOP56; ZBTB9; NLRC3; LOC100134083; COP1; CARD16; SP140; CD96; POLD2; IL32; LOC728744; FZD2; ZAP70; PYHIN1; SCARF1; IF127; PFKFB2; PAM; WARS; TCN1; LOC649839; MMP9; TMEM194A; TAP2; C17orf87; LOC728650; PNMA3; CPT1B; LTBP3; CCDC34; PRAGMIN; C9orf91; SMPDL3A; GPR56; C14orf147; SMARCD3; FAM119A; LOC642334; ENOSF1; FAR2; LOC441763; TESC; CECR6; KIAA1598; GPR109B; LRRN3; RNF213; LRP3; ASGR2; ASGR2; ZSCAN18; MCOLN2; IFIT2; PLCH2; MAP7; GBP4; MGMT; GAL3ST4; C2orf89; TXNDC3; IFIH1; PRRG4; LOC641693; LOC728093; TNFAIP8L1; AP3M2; BACH2; BACH2; C9orf123; CACNA1I; LOC100132287; CAMK1D; ANKRD33; CCR6; ALDH1A1; LOC100132797; CD163; ESAM; FCAR; TCN2; CD6; CD3E; CCDC76; MS4A1; IFIT1; MED13L; SLC26A8; NOV; FLJ20035; UGT1A3; LOC653600; LOC642684; KIAA0319L; KLRD1; TRIM22; C4orf18; TSPAN3; TSPAN3; DNAJC3; AGTRAP; LOC646786; NCALD; TTC25; TSPAN5; ZNF559; NFKB2; LOC652616; HLA-DOA; WARS; GBP2; AUTS2; IGF2BP3; OASL; DYSF; FLJ43093; MS4A14; TGFB1I1; RAD51C; CALD1; LOC730281; MUC1; C14orf124; RPL14; APOL6; KCTD12; ITGAX; IFIT3; LPCAT2; ZNF529; AGTRAP; LOC402112; LOC100134822; SH2D1B; MPO; LOC100131967; LOC440459; FAM44B; ACOT9; LOC729915; PDZK1IP1; S100A12; RAB3IL1; TMEM204; CXCL10; TSR1; MXD3; LILRA5; CKAP4; C6orf190; ECGF1; LDLRAP1; GRB10; FCRL3; LOC731275; ZFP91; CTRL; BCL6; SAMD3; LOC647436; CLC; GK; LOC100133565; OAS2; LOC644937; SIRPD; GPBAR1; GNL3; CD79B; ELF2; GAA; CD47; NMT2; MATR3; TMEM107; GCM1; RORA; MGAM; LOC100132491; KRT72; SEPT04; ACADVL; ANXA3; MEGF9; MEGF9; PTPRJ; HLA-DRB4; FFAR2; PML; HLA-DQA1; CEACAM8; SH3KBP1; TRPM2; CUX1; LOC648390; SUV39H1; USF1; VAPA; ALOX15; CD79A; DPRXP4; LOC652750; ECM1; ST6GAL1; KLHL3; RTP4; FAM179A; HDC; SACS; C9orf72; C9orf72; LOC652726; PVRIG; PPP1R16B; NSUN7; NSUN7; ZNF783; LOC441013; LOC100129343; OSM; UNC93B1; DNAJC30; FLJ14166; C9orf72; SAMD4A; F5; PARP15; PAFAH2; COL17A1; TYMP; LOC389672; ABCB1; LOC644852; TARP; SLAMF7; FRMD3; LOC648984; PLAUR; LOC100132119; KLRG1; INTS2; MYC; HIST1H4H; C9orf45; GBP6; KIFAP3; HSPC159; SOCS3; GOLGA8B; LOC100133583; ARL4A; ASNS; ITGAX; LOC153561; GSTM1; OAS2; OAS2; TRIM25; ABHD14A; LOC642342; GPR56; C4orf18; AK1; PIK3R6; HSPE1; ASPHD2; DHRS9; GRN; BOAT; LOC100134300; SDSL; TNFAIP6; LOC402176; LOC441019; FAM134B; ZNF573, GGGGTAACACAGAGTGCCCTTATGAAGGAGTTGGAGATCCTgcaaggaag (SEQ ID NO.:69); AAACCCGTCACCCAGATCGTCAGCGCCGAGGCCTGGGGTAGAGCAGGTGA (SEQ ID NO.:87); TGTTCTTCCCCATGTCCTGGATGCCACTGGAAGTGCACACTGCTTGTATG (SEQ ID NO.:93); CCCTGGAAAGCTCCCCGACAACCTCCACTGCCATTACCCACTAGGCAAGT (SEQ ID NO.:95); CCTCCAGTGGTTTAGGCAGGACCCTGGGAAAGGTCTCACATCTCTGTTGC (SEQ ID NO.:174); GCACCATGCATGGAGTCAGCCATTTCTCTAGGAACCTTGATTCCTGTCTG (SEQ ID NO.:193); CCCCACGCCTGTTTGTATTGGGAGCTCTGGACCAATAGTGTCTCTCCTAG (SEQ ID NO.:196); CCAGCCACTCTACTCAAGGGGCATATATTTTGGCATGAGGTGGGATAGAG (SEQ ID NO.:240); gcatgtgtatgatgtgtgtgcgtcggaccgcttctaggctactaagtgtc (SEQ ID NO.:257); AGGGGCAGTATACTCTTATCAGTGCGAGGTAGCTGGGGCCTGTGATAGTT (SEQ ID NO.:299); CAAGCCTGGCAGTAAATCCGAATATCCAGAACCCTGACCCTGCCGTGTAC (SEQ ID NO.:319); CAGCATGTAGGGCAGTGCTTGCACGTAGCATCTGGTGCCTAACCAGTGTT (SEQ ID NO.:336); CTGAGGTTATGTACAACCAACTCTCAGAATTCAGACTTCCTGCAGCTGCC (SEQ ID NO.:370); GTAGGCCCCCAAAGTGCCGTCTTTCCCTAGCATTTTACTCAATGTTTGCC (SEQ ID NO.:392); GAATCAAGGAGGTCAAGTAAGGTCACAGGGGCACTTGGGTTGAGCCAGGG (SEQ ID NO.:437); CCCCAGATGGTTCCAAATATTCCTTACCTCGTTTGGTTCCCAAGTCACAG (SEQ ID NO.:450); GAATAGAAACCAGACAGCAATTCTTTAGTTCCAGCCACCATTCGCCCCAC (SEQ ID NO.:454); TCAACAAAGAGGTGCTGACCTGAGAGTAGGGCACATAACCTCAGCCACTG (SEQ ID NO.:471); ATGTAGATGGGGAGTGACCACCGCCAACAGAAGTGTGGCCATCTTGCCCG (SEQ ID NO.:535); CTTTGGGCACCATTTGGATATAGTTAGTGGTGGTTTAGCTATGGCGTTCC (SEQ ID NO.:609); GGCAAATTCCGGGTATGCACTCAACTTCGGCAAAGGCACCTCGCTGTTGG (SEQ ID NO.:637); GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.:754); AGTAAACCCATATATCCAGAACCCTGACCCTGCCGTGTACCAGCTGAGAG (SEQ ID NO.:800); CCTGTGGCAAGCCAGCAAGATGGCCCTGGTGACAGCAAAAGAAACTGCAC (SEQ ID NO.:837); CCAGGTGCCGCCCACTCTTGACGTGATACTTACCGTCAATGCTCCTTACC (SEQ ID NO.:876); GCCTAAACCAGGTATGCCAATCTGTCTTGTGTCCACATACTAACAGAGGG (SEQ ID NO.:924); AGCCAAGACAGCAGCTCTACATCCTTACCTAGGTAATTCAGGCATGCGCC (SEQ ID NO.:947); CACATGGCAAATGCCTCCTTTCACAATAGAGCATGGTGCTGTTTCCTCAC (SEQ ID NO.:954); TATTGCAGCCATCCATCTTGGGGGCTCATCCATCACACCCGGGTTGCTAG (SEQ ID NO.:1010); CTGGGCTGTGGTATTTGGGTGATCTTTACATTCTTCAGACTCATGTGTGT (SEQ ID NO.:1035); GCTACAAACAAGCTCATCTTTGGAACTGGCACTCTGCTTGCTGTCCAGCC (SEQ ID NO.:1081); CCTACTCCTACAGTGCCTTGCATTCCGTAGCTGCTCAGTACATTAACCCA (SEQ ID NO.:1116); CAGGGTATGAAAGTGCCCATTTCTAGCCAACATTAGATACCCTCAGTCTC (SEQ ID NO.:1157); TGGCCACATTTGTCTCAAACTCAAGTCTACACATTTCTCTCTCTTTTCCC (SEQ ID NO.:1227); GTACCGTCAGCAACCTGGACAGAGCCTGACACTGATCGCAACTGCAAATC (SEQ ID NO.:1276); and Gccccctaattgactgaatggaacccctcttgaccaaagtgaccccagaa (SEQ ID NO.:1379). In another aspect, the method further comprises the step of differentiating between sarcoidosis and tuberculosis, lung cancer or pneumonia by determining the expression levels of the following genes, markers, or probes: PHF20L1; LOC400304; SELM; DPM2; RPLP1; SF1; ZNF683; CTTN; PTCRA; SNORA28; RPGRIP1; GPR160; PPIA; DNASE1L1; HEMGN; RAB13; NFIA; LOC728843; LOC100134660; LOC100132564; HIP1; PRMT1; PDGFC; NCRNA00085; NFATC3; GIMAP7; LOC100130905; AKAP7; TLE3; NRSN2; RPL37; CSTA; C20orf107; TMEM169; GCAT; TMEM176A; CMTM5; C3orf26; FANCD2; C9orf114; TIAM2; LOC644615; PADI2; GRINA; CHST13; ANGPT1; KIF27; ZNF550; PIK3C2A; NR1H3; ALG8; SLC2A5; ITGB5; OPN3; UBE2O; RIN3; LOC100129203; B3GNT1; NEK8; SLC38A5; GPR183; LOC728748; LOC646966; FAM159A; LOC441073; CCNC; MRPL9; SLC37A1; NSUN5; GHRL; ALAS2; MPZL2; RNF13; SUMO1P1; UHRF2; RNY4; LOC651524; KBTBD8; ZNF224; OLIG1; TNFRSF4; BEND7; LOC728323; ARHGAP24; CCCTGCCCTCATGTTGCTTTGGGTCTAGTGGAGGAGAGAGACAGATAAGC (SEQ ID NO.:1447); CAAGTTCTTAACCATCCCGGGTTCCAGTGGTTACAGAGTTCTGCCCTGGG; (SEQ ID NO.:1448) and TGCATGAGATCACACAACTAGGCGGTGACTGAGTCCAACACACCAAAGCC (SEQ ID NO.:1449). In another aspect, the method further comprises the step of differentiating between sarcoidosis that is active and sarcoidosis that is inactive by determining the expression levels of the following genes, markers, or probes: LOC442132; HOXA1; LOC652102; PPIE; C22orf27; TEX10; LMTK2; LOC283663; SUCNR1; COLQ; HLA-DOB; SAMSN1; INPP5E; CYP4F3; CRYZ; CDC14A; LOC653061; KIR2DL4; PCYOX1L; TCEAL3; FRRS1; PHF17; PDK4; LOC440313; ZNF260; SLFN13; VASH1; GM2A; ASAP2; VARS2; RPL14; KIR2DL1; SBDSP; S1PR3; and METTL1; CCAGGAGGCCGAACACTTCTTTCTGCTTTCTTGACATCCGCTCACCAGGC (SEQ ID NO.:1450), and TTCCAGGGCACGAGTTCGAGGCCAGCCTGGTCCACATGGGTCGGaaaaaa (SEQ ID NO.:1451). In another aspect, the method further comprises the step of using 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 144, 150, 200, 250, 300, 400, 500, 600, 700, 800, 900, 1,000, 1,100, 1,200, 1,300, 1,400, or 1,446 genes selected from SEQ ID NOS.: 1 to 1446 to determine if the patient has at least one of tuberculosis, sarcoidosis, cancer or pneumonia.",
                        "Yet another embodiment of the present invention includes a method for determining the effectiveness of a treating a sarcoidosis patient comprising: obtaining a sample from a subject suspected of having a pulmonary disease; determining the expression level of 3, 4, 5, 6 or more genes selected from IL1R2; GRB10; CEACAM4; SIPA1L2; BMX; IL1RAP; REPS2; ANXA3; MMP9; PHC2; HAUS4; DUSP1; CA4; SAMSN1; KLHL2; ACSL1; NSUN7; IL18RAP; GNG10; SMAP2; MGAM; LIN7A; IRAK3; USP10; CEBPD; TGFA; FOS; MANSC1; SLC26A8; ROPN1L; GPR97; NAMPT; MRVI1; KCNJ15; KLHL8; GNG10; MEGF9; GPR160; B4GALT5; STEAP4; LRG1; F5; PHTF1; HMGB2; DGAT2; SLC11A1; QPCT; PANX2; GPR141; or LMNB1; wherein overexpression of the genes is indicative of a reduction in sarcoidosis.",
                        "Another embodiment of the present invention includes a method of identifying a subject with a pulmonary disease comprising: obtaining a sample from a subject suspected of having a pulmonary disease; determining the expression level of six or more genes from each of the following genes selected from: UBE2J2; ALPL; JMJD6; FCER1G; LILRA5; LY96; FCGR1C; C10orf33; GPR109B; PROK2; PIM3; SH3GLB1; DUSP3; PPAP2C; SLPI; MCTP1; KIF1B; FLJ32255; BAGE5; IFITM1; GPR109A; IF135; LOC653591; KREMEN1; IL18R1; CACNA1E; ABCA2; CEACAM1; MXD4; TncRNA; LMNB1; H2AFJ; HP; ZNF438; FCER1A; SLC22A4; DISC1; MEFV; ABCA1; ITPRIPL2; KCNJ15; LOC728519; ERLIN1; NLRC4; B4GALT5; LOC653610; HIST2H2BE; AIM2; P2RY10; CCR3; EMR4P; NTN3; C1QB; TAOK1; FCGR1B; GATA2; FKBP5; DGAT2; TLR5; CARD17; INCA; MSL3L1; ESPN; LOC645159; C19orf59; CDK5RAP2; PLSCR1; RGL4; IFI30; LOC641710; GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.: 754); LOC100008589; LOC100008589; SMARCD3; NGFRAP1; LOC100132394; OPLAH; CACNG6; LILRB4; HIST2H2AA4; CYP1B1; PGS1; SPATA13; PFKFB3; HIST1H3D; SNORA73B; SLC26A8; SULT1B1; ADM; HIST2H2AA3; HIST2H2AA3; GYG1; CST7; EMR4; LILRA6; MEF2D; IFITM3; MSL3; DHRS13; EMR4; C16orf57; HIST2H2AC; EEF1D; TDRD9; GPR97; ZNF792; LOC100134364; SRGAP3; FCGR1A; HPSE; LOC728417; LOC728417; MIR21; HIST1H2BG; COP1; SMARCD3; LOC441763; ZSCAN18; GNG8; MTRF1L; ANKRD33; PLAC8; PLAC8; SLC26A8; AGTRAP; FLJ43093; LPCAT2; AGTRAP; S100A12; SVIL; LILRA5; LILRA5; ZFP91; CLC; LOC100133565; LTB4R; SEPT04; ANXA3; BHLHB2; IL4R; IFNAR1; MAZ; gccccctaattgactgaatggaacccctcttgaccaaagtgaccccagaa (SEQ ID NO.: 1379); comparing the expression level of the 3, 4, 5, 6 or more genes with the expression level of the same genes from individuals not afflicted with a pulmonary disease, and determining the level of expression of the six or more genes in the sample from the subject relative to the samples from individuals not afflicted with a pulmonary disease for the genes expressed in the one or more expression pathways, selected from: EIF2 signaling and mTOR signaling pathways are indicative of active sarcoidosis; co-expression of genes in the regulation of eIF4 and p70s6K signaling pathways is indicative of pneumonia; co-expression of genes in the interferon signaling and antigen presentation pathways are indicative of tuberculosis; and co-expression of genes in the T cell signaling pathways; and other signaling pathways is indicative of lung cancer. In one aspect, the genes that are downregulated are selected from MEF2D; BHLHB2; CLC; FCER1A; SRGAP3; FLJ43093; CCR3; EMR4; ZNF792; C10orf33; CACNG6; P2RY10; GATA2; EMR4P; ESPN; EMR4; MXD4; and ZSCAN18. In another aspect, the method further comprises a method for displaying if the patient has tuberculosis, sarcoidosis, cancer or pneumonia by aggregating the expression data from the six or more genes into a single visual display of a vector of expression for tuberculosis, sarcoidosis, cancer or pneumonia. In another aspect, the method further comprises the step of detecting and evaluating 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes for the analysis. In another aspect, the sample is a blood, peripheral blood mononuclear cells, sputum, or lung biopsy. In another aspect, the expression level comprises an mRNA expression level and is quantitated by a method selected from the group consisting of polymerase chain reaction, real time polymerase chain reaction, reverse transcriptase polymerase chain reaction, hybridization, probe hybridization and gene expression array. In another aspect, the expression level is determined using at least one technique selected from polymerase chain reaction, heteroduplex analysis, single stand conformational polymorphism analysis, ligase chain reaction, comparative genome hybridization, Southern blotting, Northern blotting, Western blotting, enzyme-linked immunosorbent assay, fluorescent resonance energy-transfer and sequencing. In another aspect, the expression level is determined by microarray analysis that comprises use of oligonucleotides that hybridize to mRNA transcripts or cDNAs for the six or more genes, and wherein the oligonucleotides are disposed or directly synthesized on the surface of a chip or wafer. In another aspect, the oligonucleotides are about 10 to about 50 nucleotides in length. In another aspect, the method further comprises the step of using the determined comparative gene product information to formulate at least one of diagnosis, a prognosis or a treatment plan. In another aspect, the patient's disease state is further determined by radiological analysis of the patient's lungs. In another aspect, the method further comprises step of determining a treated patient gene expression dataset after the patient has been treated and determining if the treated patient gene expression dataset has returned to a normal gene or a changed gene expression dataset thereby determining if the patient has been treated. In another aspect, a non-overlapping set of genes is used to distinguish between Tb, sarcoidosis, pneumonia and lung cancer, versus, Tb, active sarcoidosis, non-active sarcoidosis, pneumonia and lung cancer are selected from Table 11, 12 or both. Yet another embodiment of the present invention includes a computer readable medium comprising computer-executable instructions for performing the methods of the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce pulmonary disease diagnosis method",
                        "obtain sample from subject suspected of having pulmonary disease",
                        "determine expression level of six or more genes",
                        "compare expression level with healthy individuals",
                        "determine co-expression of genes in EIF2 signaling pathway",
                        "determine co-expression of genes in mTOR signaling pathway",
                        "determine co-expression of genes in regulation of eIF4 and p70s6K signaling pathway",
                        "determine co-expression of genes in interferon signaling pathway",
                        "determine co-expression of genes in antigen presentation pathways",
                        "determine co-expression of genes in T cell signaling pathways",
                        "determine co-expression of genes in other signaling pathways",
                        "associate co-expression with pulmonary diseases",
                        "select genes associated with tuberculosis",
                        "select genes associated with active sarcoidosis",
                        "select genes associated with pneumonia",
                        "select genes associated with lung cancer",
                        "evaluate genes in aggregate or in pathways",
                        "select genes associated with tuberculosis and not other diseases",
                        "select genes associated with active sarcoidosis and not other diseases",
                        "select genes associated with pneumonia and not other diseases",
                        "select genes associated with lung cancer and not other diseases",
                        "display diagnosis results in a single visual display",
                        "detect and evaluate additional genes for analysis",
                        "determine specificity and sensitivity of diagnosis method",
                        "define lung disease diagnosis method",
                        "describe sample collection",
                        "outline gene expression detection",
                        "specify disease gene markers",
                        "detail expression level comparison",
                        "describe active and inactive sarcoidosis differentiation",
                        "list disease markers for sarcoidosis, tuberculosis, lung cancer, and pneumonia",
                        "specify genes for disease marker selection",
                        "outline disease diagnosis based on gene expression",
                        "describe gene selection for disease marker detection",
                        "detail gene expression analysis",
                        "specify disease diagnosis based on gene expression levels",
                        "outline disease marker detection",
                        "describe gene selection for disease diagnosis",
                        "detail disease diagnosis method",
                        "summarize lung disease diagnosis method",
                        "list genes associated with diseases",
                        "list genes associated with tuberculosis",
                        "list genes associated with sarcoidosis",
                        "list genes associated with lung cancer",
                        "list genes associated with pneumonia",
                        "differentiate between sarcoidosis and tuberculosis",
                        "differentiate between sarcoidosis and lung cancer",
                        "differentiate between sarcoidosis and pneumonia",
                        "differentiate between active and inactive sarcoidosis",
                        "list genes associated with active sarcoidosis",
                        "list genes associated with inactive sarcoidosis",
                        "use gene expression levels to diagnose diseases",
                        "use gene expression levels to differentiate between diseases",
                        "use gene expression levels to monitor disease activity",
                        "use gene expression levels to predict disease outcome",
                        "use gene expression levels to develop personalized treatment plans",
                        "introduce invention",
                        "describe method for determining effectiveness of treating sarcoidosis",
                        "describe method for identifying subject with pulmonary disease",
                        "list genes for determining expression level",
                        "describe comparison of expression levels",
                        "describe determination of disease state",
                        "describe display of expression data",
                        "describe detection and evaluation of additional genes",
                        "describe sample types",
                        "describe methods for determining expression level",
                        "describe use of microarray analysis",
                        "describe use of determined information for diagnosis, prognosis, or treatment plan"
                    ],
                    "num_characters": 34985,
                    "outline_medium": [
                        "introduce pulmonary disease diagnosis method",
                        "obtain sample from subject suspected of having pulmonary disease",
                        "determine expression level of six or more genes",
                        "compare expression level with healthy individuals",
                        "determine co-expression of genes in signaling pathways",
                        "associate co-expression with specific pulmonary diseases",
                        "select genes associated with tuberculosis",
                        "select genes associated with active sarcoidosis",
                        "select genes associated with pneumonia",
                        "select genes associated with lung cancer",
                        "evaluate genes in aggregate or in pathways",
                        "determine diagnosis based on gene expression",
                        "define lung disease diagnosis method",
                        "describe sample collection and preparation",
                        "outline gene expression detection",
                        "specify disease marker selection",
                        "detail disease diagnosis based on marker expression",
                        "provide optional step for differentiating active and inactive sarcoidosis",
                        "list genes, markers, and probes used in the method",
                        "conclude method for determining lung disease",
                        "list genes associated with diseases",
                        "describe method for differentiating between diseases",
                        "specify genes for differentiating between sarcoidosis and tuberculosis, lung cancer, or pneumonia",
                        "specify genes for differentiating between active and inactive sarcoidosis",
                        "describe use of multiple genes for disease diagnosis",
                        "provide specific gene sequences for disease diagnosis",
                        "list additional genes associated with diseases",
                        "describe method for determining presence of diseases using multiple genes",
                        "define sarcoidosis diagnosis method",
                        "motivate gene expression analysis",
                        "summarize pulmonary disease identification method",
                        "describe gene selection and expression analysis",
                        "outline disease diagnosis and treatment plan",
                        "introduce computer-readable medium for method implementation"
                    ],
                    "outline_short": [
                        "introduce pulmonary disease diagnosis method",
                        "describe gene expression analysis for disease diagnosis",
                        "specify genes associated with tuberculosis",
                        "specify genes associated with active sarcoidosis",
                        "specify genes associated with pneumonia and lung cancer",
                        "outline method variations and additional steps",
                        "describe method of determining lung disease",
                        "list disease genes, markers, or probes",
                        "outline steps of method",
                        "provide additional embodiments of method",
                        "list genes associated with diseases",
                        "describe method for differentiating between diseases",
                        "specify genes for differentiating between active and inactive sarcoidosis",
                        "provide options for number of genes to use in diagnosis",
                        "define pulmonary disease diagnosis method",
                        "motivate gene expression analysis",
                        "describe embodiments of the invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "While the making and using of various embodiments of the present invention are discussed in detail below, it should be appreciated that the present invention provides many applicable inventive concepts that can be embodied in a wide variety of specific contexts. The specific embodiments discussed herein are merely illustrative of specific ways to make and use the invention and do not delimit the scope of the invention.",
                        "To facilitate the understanding of this invention, a number of terms are defined below. Terms defined herein have meanings as commonly understood by a person of ordinary skill in the areas relevant to the present invention. Terms such as “a”, “an” and “the” are not intended to refer to only a singular entity, but include the general class of which a specific example may be used for illustration. The terminology herein is used to describe specific embodiments of the invention, but their usage does not delimit the invention, except as outlined in the claims.",
                        "The present invention provides methods, compositions, biomarkers and tests for evaluating the immunopathogenesis underlying TB and other pulmonary diseases, by comparing the blood transcriptional responses in pulmonary TB patients to that found in pulmonary sarcoidosis, pneumonia and lung cancer patients. It also provides for the first time a complete, reproducible comparison of blood transcriptional responses before and after treatment in each disease, and examining the transcriptional responses seen in the different leucocyte populations of the granulomatous diseases. In addition the present inventors investigated the association between the clinical heterogeneity of sarcoidosis and the observed blood transcriptional heterogeneity.",
                        "As used herein, the term “array” refers to a solid support or substrate with one or more peptides or nucleic acid probes attached to the support. Arrays typically have one or more different nucleic acid or peptide probes that are coupled to a surface of a substrate in different, known locations. These arrays, also described as “microarrays” or “gene-chips” that may have 10,000; 20,000, 30,000; or 40,000 different identifiable genes based on the known genome, e.g., the human genome. These pan-arrays are used to detect the entire “transcriptome” or transcriptional pool of genes that are expressed or found in a sample, e.g., nucleic acids that are expressed as RNA, mRNA and the like that may be subjected to RT and/or RT-PCR to made a complementary set of DNA replicons. The microarray is well known in the art, for example, U.S. Pat. Nos. 5,445,934 and 5,744,305. The term also includes all the devices so called in Schena (ed.), DNA Microarrays: A Practical Approach (Practical Approach Series), Oxford University Press (1999) (ISBN: 0199637768); Nature Genet. 21(1)(suppl):1-60 (1999); and Schena (ed.), Microarray Biochip: Tools and Technology, Eaton Publishing Company/BioTechniques Books Division (2000) (ISBN: 1881299376)(relevant portions incorporated herein by reference), the disclosures of which are incorporated herein by reference in their entirety. Arrays may be produced using mechanical synthesis methods, light directed synthesis methods and the like that incorporate a combination of non-lithographic and/or photolithographic methods and solid phase synthesis methods. In one embodiment, the present invention includes simplified arrays that can include a limited number of probes, e.g., 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 144, 150, 200, 250, 300, 400, 500, 600, 700, 800, 900, 1,000, 1,100, 1,200, 1,300, 1,400, or even 1,446 genes or probes in a customized or customizable microarray adapted for pulmonary disease detection, diagnosis and evaluation.",
                        "As used herein the term “biomarker” refers to a specific biochemical in the body that has a particular molecular feature to make it useful for diagnosing and measuring the progress of disease or the effects of treatment. Certain biomarkers form part of the present invention and are attached to this application as Lengthy Tables, that are included herewith and the content incorporated herein by reference. The text file Symbol-Regulation-ID.txt is 47Kb and Symbol-Sequence-ID.txt provide the list of 1446 probe sequences and genes that are associated with the majority of the same. Also included herewith is a list of 1359 genes that overlay in certain conditions as described hereinbelow.",
                        "Various techniques for the synthesis of these nucleic acid arrays have been described, e.g., fabricated on a surface of virtually any shape or even a multiplicity of surfaces. Arrays may be peptides or nucleic acids on beads, gels, polymeric surfaces, fibers such as fiber optics, glass or any other appropriate substrate. Arrays may be packaged in such a manner as to allow for diagnostics or other manipulation of an all inclusive device, see for example, U.S. Pat. No. 6,955,788, relevant portions incorporated herein by reference.",
                        "As used herein, the term “disease” refers to a physiological state of an organism with any abnormal biological state of a cell. Disease includes, but is not limited to, an interruption, cessation or disorder of cells, tissues, body functions, systems or organs that may be inherent, inherited, caused by an infection, caused by abnormal cell function, abnormal cell division and the like. A disease that leads to a “disease state” is generally detrimental to the biological system, that is, the host of the disease. With respect to the present invention, any biological state, such as an infection (e.g., viral, bacterial, fungal, helminthic, etc.), inflammation, autoinflammation, autoimmunity, anaphylaxis, allergies, premalignancy, malignancy, surgical, transplantation, physiological, and the like that is associated with a disease or disorder is considered to be a disease state. A pathological state is generally the equivalent of a disease state. Disease states may also be categorized into different levels of disease state. As used herein, the level of a disease or disease state is an arbitrary measure reflecting the progression of a disease or disease state as well as the physiological response upon, during and after treatment. Generally, a disease or disease state will progress through levels or stages, wherein the affects of the disease become increasingly severe. The level of a disease state may be impacted by the physiological state of cells in the sample. As used herein, the terms “module”, “modular transcriptional vectors”, or “vectors of gene expression” refer to transcriptional expression data that reflects a proportion of differentially expressed genes having a common gene expression pathway (e.g., interferon inducible genes), are typically expressed only or predominantly in a certain cell type (e.g., genes expressed by neutrophils), or are grouped into a module of genes to yield, in the aggregate a single vector of gene expression, such that the overall expression is expressed as a single vector that includes both a direction (under expressed or over expressed) and intensity of the under or over expression. For example, for each module the proportion of transcripts differentially expressed between at least two groups (e.g., healthy subjects versus patients, or certain patients of a first disease versus a group of patients with a second disease). The vector of expression is derived from the comparison of two or more groups of samples. The first analytical step is used for the selection of disease-specific sets of transcripts within each module. Next, there is the “expression level.” The group comparison for a given disease provides the list of differentially expressed transcripts for each module. It was found that different diseases yield different subsets of modular transcripts. With this expression level it is then possible to calculate a vector of expression for each of the module(s) for a single sample by averaging expression values of disease-specific subsets of genes identified as being differentially expressed. This approach permits the generation of maps of modular expression vectors for a single sample, e.g., those described in the module maps disclosed herein. These vector of expression or module maps represent an averaged expression level for each module (instead of a proportion of differentially expressed genes) that can be derived for each sample. An example of the vector of gene expression is shown in, e.g., FIG. 6A.",
                        "Using the present invention it is possible to identify and distinguish pulmonary diseases not only at the module-level, but also at the gene-level; i.e., two, three or four diseases can have for certain modules the same vector (identical proportion of differentially expressed transcripts, identical “polarity”), but the gene composition of the vector can still be disease-specific, and vice versa. Gene-level expression provides the distinct advantage of greatly increasing the resolution of the analysis.",
                        "Gene expression monitoring systems for use with the present invention may include customized gene arrays with a limited and/or basic number of genes that are specific and/or customized for the one or more target diseases. Unlike the general, pan-genome arrays that are in customary use, the present invention provides for not only the use of these general pan-arrays for retrospective gene and genome analysis without the need to use a specific platform, but more importantly, it provides for the development of customized arrays that provide an optimal gene set for analysis without the need for the thousands of other, non-relevant genes. One distinct advantage of the optimized arrays and modules of the present invention over the existing art is a reduction in the financial costs (e.g., cost per assay, materials, equipment, time, personnel, training, etc.), and more importantly, the environmental cost of manufacturing pan-arrays where the vast majority of the data is irrelevant. The modules of the present invention allow for the first time the design of simple, custom arrays that provide optimal data with the least number of probes while maximizing the signal to noise ratio. By eliminating the total number of genes for analysis, it is possible to, e.g., eliminate the need to manufacture thousands of expensive platinum masks for photolithography during the manufacture of pan-genetic chips that provide vast amounts of irrelevant data. Using the present invention it is possible to completely avoid the need for microarrays if the limited probe set(s) of the present invention are used with, e.g., digital optical chemistry arrays, ball bead arrays, beads (e.g., Luminex), multiplex PCR, quantitiative PCR, run-on assays, Northern blot analysis, or even, for protein analysis, e.g., Western blot analysis, 2-D and 3-D gel protein expression, MALDI, MALDI-TOF, fluorescence activated cell sorting (FACS) (cell surface or intracellular), enzyme linked immunosorbent assays (ELISA), chemiluminescence studies, enzymatic assays, proliferation studies or any other method, apparatus and system for the determination and/or analysis of gene expression that are readily commercially available.",
                        "As used herein, the term “differentially expressed” refers to the measurement of a cellular constituent (e.g., nucleic acid, protein, enzymatic activity and the like) that varies in two or more samples, e.g., between a disease sample and a normal sample. The cellular constituent may be on or off (present or absent), upregulated relative to a reference or downregulated relative to the reference. For use with gene-chips or gene-arrays, differential gene expression of nucleic acids, e.g., mRNA or other RNAs (miRNA, siRNA, hnRNA, rRNA, tRNA, etc.) may be used to distinguish between cell types or nucleic acids. Most commonly, the measurement of the transcriptional state of a cell is accomplished by quantitative reverse transcriptase (RT) and/or quantitative reverse transcriptase-polymerase chain reaction (RT-PCR), genomic expression analysis, post-translational analysis, modifications to genomic DNA, translocations, in situ hybridization and the like.",
                        "As used herein, the terms “therapy” or “therapeutic regimen” refer to those medical steps taken to alleviate or alter a disease state, e.g., a course of treatment intended to reduce or eliminate the affects or symptoms of a disease using pharmacological, surgical, dietary and/or other techniques. A therapeutic regimen may include a prescribed dosage of one or more drugs or surgery. Therapies will most often be beneficial and reduce the disease state but in many instances the effect of a therapy will have non-desirable or side-effects. The effect of therapy will also be impacted by the physiological state of the host, e.g., age, gender, genetics, weight, other disease conditions, etc.",
                        "As used herein, the term “pharmacological state” or “pharmacological status” refers to those samples from diseased individuals that will be, are and/or were treated with one or more drugs, surgery and the like that may affect the pharmacological state of one or more nucleic acids in a sample, e.g., newly transcribed, stabilized and/or destabilized as a result of the pharmacological intervention. The pharmacological state of a sample relates to changes in the biological status before, during and/or after drug treatment and may serve as a diagnostic or prognostic function, as taught herein. Some changes following drug treatment or surgery may be relevant to the disease state and/or may be unrelated side-effects of the therapy. Changes in the pharmacological state are the likely results of the duration of therapy, types and doses of drugs prescribed, degree of compliance with a given course of therapy, and/or un-prescribed drugs ingested.",
                        "As used herein, the term “biological state” refers to the state of the transcriptome (that is the entire collection of RNA transcripts) of the cellular sample isolated and purified for the analysis of changes in expression. The biological state reflects the physiological state of the cells in the blood sample by measuring the abundance and/or activity of cellular constituents, characterizing according to morphological phenotype or a combination of the methods for the detection of transcripts. As used herein, the term “expression profile” refers to the relative abundance of RNA, DNA abundances or activity levels. The expression profile can be a measurement for example of the transcriptional state or the translational state by any number of methods and using any of a number of gene-chips, gene arrays, beads, multiplex PCR, quantitiative PCR, run-on assays, Northern blot analysis, or using RNA-seq, nanostring, nanopore RNA sequencing etc. Apparatus and system for the determination and/or analysis of gene expression that are readily commercially available.",
                        "As used herein the term “gene” is used to refer to a functional protein, polypeptide or peptide-encoding unit. As will be understood by those in the art, this functional term includes both genomic sequences, cDNA sequences, or fragments or combinations thereof, as well as gene products, including those that may have been altered by the hand of man. Purified genes, nucleic acids, protein and the like are used to refer to these entities when identified and separated from at least one contaminating nucleic acid or protein with which it is ordinarily associated.",
                        "As used herein, the term “transcriptional state” of a sample includes the identities and relative abundances of the RNA species, especially mRNAs present in the sample. The entire transcriptional state of a sample, that is the combination of identity and abundance of RNA, is also referred to herein as the transcriptome. Generally, a substantial fraction of all the relative constituents of the entire set of RNA species in the sample are measured.",
                        "Regarding the “expression level,” the group comparison for a given disease provides the list of differentially expressed transcripts. It was found that different diseases yield different subsets of gene transcripts as demonstrated herein.",
                        "Gene expression monitoring systems for use with the present invention may include customized gene arrays with a limited and/or basic number of genes that are specific and/or customized for the one or more target diseases. Unlike the general, pan-genome arrays that are in customary use, the present invention provides for not only the use of these general pan-arrays for retrospective gene and genome analysis without the need to use a specific platform, but more importantly, it provides for the development of customized arrays that provide an optimal gene set for analysis without the need for the thousands of other, non-relevant genes. One distinct advantage of the optimized arrays and gene sets of the present invention over the existing art is a reduction in the financial costs (e.g., cost per assay, materials, equipment, time, personnel, training, etc.), and more importantly, the environmental cost of manufacturing pan-arrays where the vast majority of the data is irrelevant. By eliminating the total number of genes for analysis, it is possible to, e.g., eliminate the need to manufacture thousands of expensive platinum masks for photolithography during the manufacture of pan-genetic chips that provide vast amounts of irrelevant data. Using the present invention it is possible to completely avoid the need for microarrays if the limited probe set(s) of the present invention are used with, e.g., digital optical chemistry arrays, ball bead arrays, multiplex PCR, quantitiative PCR, “RNA-seq” for measuring mRNA levels using next-generation sequencing technologies, nanostring-type technologies or any other method, apparatus and system for the determination and/or analysis of gene expression that are readily commercially available.",
                        "The “molecular fingerprinting system” of the present invention may be used to facilitate and conduct a comparative analysis of expression in different cells or tissues, different subpopulations of the same cells or tissues, different physiological states of the same cells or tissue, different developmental stages of the same cells or tissue, or different cell populations of the same tissue against other diseases and/or normal cell controls. In some cases, the normal or wild-type expression data may be from samples analyzed at or about the same time or it may be expression data obtained or culled from existing gene array expression databases, e.g., public databases such as the NCBI Gene Expression Omnibus database.",
                        "As used herein, the term “differentially expressed” refers to the measurement of a cellular constituent (e.g., nucleic acid, protein, enzymatic activity and the like) that varies in two or more samples, e.g., between a disease sample and a normal sample. The cellular constituent may be on or off (present or absent), upregulated relative to a reference or downregulated relative to the reference. For use with gene-chips or gene-arrays, differential gene expression of nucleic acids, e.g., mRNA or other RNAs (miRNA, siRNA, hnRNA, rRNA, tRNA, etc.) may be used to distinguish between cell types or nucleic acids. Most commonly, the measurement of the transcriptional state of a cell is accomplished by quantitative reverse transcriptase (RT) and/or quantitative reverse transcriptase-polymerase chain reaction (RT-PCR), genomic expression analysis, post-translational analysis, modifications to genomic DNA, translocations, in situ hybridization and the like.",
                        "The skilled artisan will appreciate readily that samples may be obtained from a variety of sources including, e.g., single cells, a collection of cells, tissue, cell culture and the like. In certain cases, it may even be possible to isolate sufficient RNA from cells found in, e.g., urine, blood, saliva, tissue or biopsy samples and the like. In certain circumstances, enough cells and/or RNA may be obtained from: mucosal secretion, feces, tears, blood plasma, peritoneal fluid, interstitial fluid, intradural, cerebrospinal fluid, sweat or other bodily fluids. The nucleic acid source, e.g., from tissue or cell sources, may include a tissue biopsy sample, one or more sorted cell populations, cell culture, cell clones, transformed cells, biopies or a single cell. The tissue source may include, e.g., brain, liver, heart, kidney, lung, spleen, retina, bone, neural, lymph node, endocrine gland, reproductive organ, blood, nerve, vascular tissue, and olfactory epithelium.",
                        "The present invention includes the following basic components, which may be used alone or in combination, namely, one or more data mining algorithms, one novel algorithm specifically developed for this TB treatment monitoring, the Temporal Molecular Response; the characterization of blood leukocyte transcriptional gene sets; the use of aggregated gene transcripts in multivariate analyses for the molecular diagnostic/prognostic of human diseases; and/or visualization of transcriptional gene set-level data and results. Using the present invention it is also possible to develop and analyze composite transcriptional markers. The composite transcriptional markers for individual patients in the absence of control sample analysis may be further aggregated into a reduced multivariate score.",
                        "An explosion in data acquisition rates has spurred the development of mining tools and algorithms for the exploitation of microarray data and biomedical knowledge. Approaches aimed at uncovering the function of transcriptional systems constitute promising methods for the identification of robust molecular signatures of disease. Indeed, such analyses can transform the perception of large-scale transcriptional studies by taking the conceptualization of microarray data past the level of individual genes or lists of genes.",
                        "The present inventors have recognized that current microarray-based research is facing significant challenges with the analysis of data that are notoriously “noisy,” that is, data that is difficult to interpret and does not compare well across laboratories and platforms. A widely accepted approach for the analysis of microarray data begins with the identification of subsets of genes differentially expressed between study groups. Next, the users try subsequently to “make sense” out of resulting gene lists using the novel Temporal Molecular Response discovery algorithms and existing scientific knowledge and by validating in independent sample sets and in different microarray analyses.",
                        "Pulmonary tuberculosis (PTB) is a major and increasing cause of morbidity and mortality worldwide caused by Mycobacterium tuberculosis (M. tuberculosis). However, the majority of individuals infected with M. tuberculosis remain asymptomatic, retaining the infection in a latent form and it is thought that this latent state is maintained by an active immune response. Blood is the pipeline of the immune system, and as such is the ideal biologic material from which the health and immune status of an individual can be established.",
                        "Blood represents a reservoir and a migration compartment for cells of the innate and the adaptive immune systems, including neutrophils, dendritic cells and monocytes, or B and T lymphocytes, respectively, which during infection will have been exposed to infectious agents in the tissue. For this reason whole blood from infected individuals provides an accessible source of clinically relevant material where an unbiased molecular phenotype can be obtained using gene expression microarrays for the study of cancer in tissues autoimmunity), and inflammation, infectious disease, or in blood or tissue. Microarray analyses of gene expression in blood leucocytes have identified diagnostic and prognostic gene expression signatures, which have led to a better understanding of mechanisms of disease onset and responses to treatment. These microarray approaches have been attempted for the study of active and latent TB but as yet have yielded small numbers of differentially expressed genes only, and in relatively small numbers of patients, therefore not reaching statistical significance, which may not be robust enough to distinguish between other inflammatory and infectious diseases. The present inventors recognized that a neutrophil driven blood transcriptional signature in active TB patients was missing in the majority of Latent TB individuals and in healthy controls. For this description see, also, the study of Berry et al., 2010 (5), by the present inventors. This signature of active TB was reflective of lung radiographic disease and was diminished after 2 months of treatment (5) and more recently the present inventors have shown that the blood transcriptional signature of TB was diminished as early as 2 weeks after commencement of treatment (12). The signature was dominated by interferon-inducible genes, and at a modular level the active TB signature (5, 12) was distinct from other infectious or autoimmune diseases (5).",
                        "In the present findings and the basis of this application the blood transcriptional profiles of the pulmonary granulomatous diseases (TB and sarcoidosis) clustered together but distinctly from the similar pulmonary diseases pneumonia and lung cancer.",
                        "It has previously been shown that TB and sarcoidosis have similar transcriptional profiles however no published studies have determined if this similar blood gene expression profile is due to generalized transcriptional activity associated with pulmonary diseases or due to specific host responses associated with TB and sarcoidosis. Therefore, we recruited three cohorts of TB and sarcoidosis patients (Training, Test and Validation Sets) alongside patients with similar pulmonary diseases community acquired pneumonia and lung cancer. On average the sarcoidosis patients presented with a milder and more chronic presentation than the TB and pneumonia patients. There was little difference in the demographics and clinical characteristics of the participants in the Training and Test Sets.",
                        "Unbiased analysis followed by unsupervised hierarchical clustering of the blood transcriptional profiles from all the Training Set participants clearly demonstrated that the TB and sarcoidosis patients transcriptional profiles clustered together but distinctly from the pneumonia and cancer patients transcriptional profiles which themselves clustered together (3422 transcripts). Adding a statistical filter generated 1446 differentially expressed transcripts. Applying unsupervised hierarchical clustering of the 1446-transcripts and the Training Set samples again showed the same clustering pattern. This finding was verified in an independent cohort, the Test Set, which likewise showed the TB and most sarcoidosis patients clustered together while the pneumonia and lung cancer patients also clustered together but separately from the granulomatous diseases (FIG. 1). Clustering was not influenced by ethnicity or gender (data not shown).",
                        "FIG. 1. The pulmonary granulomatous diseases, TB and sarcoidosis, display similar transcriptional signatures to each other but distinct from pneumonia and lung cancer. 1446-transcripts were differentially expressed in the whole blood of the Training Set healthy controls, pulmonary TB patients, pulmonary sarcoidosis patients, pneumonia patients and lung cancer patients. The clustering of the 1446-transcripts were tested in an independent cohort from which they were derived from, the Test Set. The heatmap shows the transcripts and patients' profiles as organised by the unbiased algorithm of unsupervised hierarchical clustering. A dotted line is added to the heatmap to help visualisation of the main clusters generated by the clustering algorithm. Transcript intensity values are normalised to the median of all transcripts. Red transcripts are relatively over-abundant and blue transcripts under-abundant. The coloured bar at the bottom of the heatmap indicates which group the profile belongs to.",
                        "Distinct biological pathways were found to be associated with the pulmonary granulomatous diseases differing from those associated with the acute pulmonary diseases, pneumonias and chronic lung diseases, lung cancers.",
                        "Having established by the derived 1446-transcript signature that the pulmonary granulomatous diseases had similar transcriptional profiles to each other but different to those of the pneumonia and lung cancer patients we wished to determine the main biological pathways associated with the 1446-transcripts in relation to each disease (SEQ ID NOS.:1 to 1,446). The 1446 unsupervised clustering revealed three main clusters of transcripts as can be seen from the vertical dendrogram (FIG. 2). Ingenuity Pathway Analysis (IPA) of the main clusters of transcripts revealed that the TB and sarcoidosis samples were associated with over-abundance of the interferon signalling pathway and other immune response pathways (FIG. 2). However the pneumonia and lung cancer samples were associated with over-abundance of pathways linked with inflammation. All four diseases associated with under-abundance of T and B cell pathways. Using the 1,446 genes or probes, the skilled artisan can select subsets of genes that will best differentiate between two, three or four pulmonary diseases by taking advantage of both the level of expression but also whether the gene is over- or under-expressed. As taught herein, certain subsets are demonstrated to be unique to certain pulmonary diseases, but can also be used to identify if a patient or subject has one, two, three or four of the pulmonary diseases.",
                        "FIG. 2. Three dominant clusters of transcripts in the unsupervised clustering of the 1446 transcripts are associated with distinct Ingenuity Pathway Analysis canonical pathways. Each of the three dominant clusters of transcripts is associated with different study groups in the Training Set. The top transcript cluster is over-abundant in the pneumonia and lung cancer patients and significantly associated with IPA pathways relating to inflammation (Fisher's exact p<0.05 Benjamini Hochberg). The middle transcript cluster is over-abundant in the TB and sarcoidosis patients and significantly associated with interferon signalling and other immune response IPA pathways (Fisher's exact p<0.05 Benjamini Hochberg). The bottom transcript cluster is under-abundant in all the patients and significantly associated with T and B cell IPA pathways (Fisher's exact p<0.05 Benjamini Hochberg).",
                        "The sarcoidosis patients' heterogeneous transcriptional profiles were explained by their clinical phenotype.",
                        "From the unsupervised clustering of the 1446-transcripts it can be seen that the sarcoidosis patients fell into two groups, those that clustered with the TB patients and those that clustered with the healthy controls (FIG. 1). As the blood transcriptional profile is a snap shot view of the host's immune response we applied the same approach to clinically phenotyping the patients to understand if their clinical classification correlates with their transcriptional profile. However there is no consensus on how to reliably assess disease activity and current classification systems all require continuous follow-up of the patient over a prolonged period of time before their activity status can be stated (1). Therefore a clinical classification was devised decision tree based on clinical variables that are both routinely measure in sarcoidosis patients and have been shown to be associated with disease activity (data not shown). Using exactly the same analysis strategy as for the 1446-transcripts, but this time with the sarcoidosis patients classified as either active or non-active, 1396-transcripts were found to be differentially expressed across all the disease groups. FIGS. 3A and 3B shows the results from the sarcoidosis patients clinically classified as active sarcoidosis display similar transcriptional signatures to the TB patients but are very distinct from the transcriptional signatures of the clinically classified non-active sarcoidosis patients which in turn resemble the healthy controls. 1396-transcripts are differentially expressed in the whole blood of healthy controls, pulmonary TB patients, active sarcoidosis patients, non-active sarcoidosis patients, pneumonia patients and lung cancer patients. FIG. 3A shows the 1396 transcripts and Training Set patients' profiles are organised by unsupervised hierarchical clustering. A dotted line is added to the heatmap to clarify the main clusters generated by the clustering algorithm. Transcript intensity values are normalised to the median of all transcripts. FIG. 3B shows the molecular distance to health of the 1396 transcripts in the Training and Test sets demonstrates the quantification of transcriptional change relative to the controls. The mean and SEM was compared between each disease group (ANOVA with Tukey's multiple comparison test).",
                        "Unsupervised hierarchical clustering again showed the same clustering pattern as seen with the 1446-transcripts (FIG. 3A). Applying the clinical classification decision tree it could be seen that those sarcoidosis patients clustering with the TB patients had been classified as active and those with the healthy controls as non-active. This was further validated in two independent cohorts, the Test and Validation Sets (data not shown). In addition, it was found that the applied clinical classification decision tree was able to predict if the sarcoidosis patients' transcriptional profiles clustered with the TB patients or the healthy controls better than any routinely measured single clinical variable (data not shown). Furthermore the clinical classification decision tree was still superior in its clustering predictive ability even if the single clinical variables with the highest predictive values were used in conjunction with each other or even when used together with the clinical classification criteria (data not shown). Molecular distance to health (MDTH) demonstrates the quantification of transcriptional change relative to the controls (FIG. 3B) (2). By applying this algorithm to all the disease groups for the 1396-transcripts it could be seen that the non-active sarcoidosis MDTH score was not significantly different from the controls, however the active sarcoidosis MDTH score was significantly different from the controls. In addition the TB patients' MDTH score was significantly higher than active sarcoidosis patients' score. Lung cancer and pneumonia both had significantly higher scores than the controls with pneumonia significantly higher than cancer. Pneumonia and TB had the highest MDTH scores. The significant differences in the MDTH scores between the patient groups suggest there is a quantitative as well as qualitative difference in blood transcriptional signatures between these similar pulmonary diseases.",
                        "Three different data mining strategies showed the same findings that both TB and active sarcoidosis were dominated by IFN-inducible genes, in contrast to pneumonia and lung cancer, which were dominated by inflammatory genes.",
                        "To further understand the biological pathways associated with each disease group we undertook three different data mining strategies to ensure our findings were robust and consistent. The three approaches applied were: modular analysis, Ingenuity Pathway Analysis and annotation of the top differentially expressed genes for each disease group.",
                        "To carry out modular analysis all detectable genes (15,212 transcripts) in the whole Training set dataset were analysed. Each module corresponds to a set of co-regulated genes that were assigned biological functions by unbiased literature profiling (3). FIGS. 4A to 4E shows modular analysis of the Training Set shows the similarity of the biological pathways associated with TB and sarcoidosis (particularly overexpression of the IFN modules), differing from pneumonia and lung cancer (particularly overexpression of the inflammation modules). FIG. 4A shows gene expression levels of all transcripts that were significantly detected compared to background hybridisation (15,212 transcripts, p<0.01) were compared in the Training Set between each patient group: TB, active sarcoidosis, non-active sarcoidosis, pneumonia, lung cancer, to the healthy controls. Each module corresponds to a set of co-regulated genes that were assigned biological functions by unbiased literature profiling. A red dot indicates significant over-abundance of transcripts and a blue dot indicates significant under-abundance (p<0.05). The colour intensity correlates with the percentage of genes in that module that are significantly differentially expressed. The modular analysis can also be represented in graphical form as shown in 4B-E, including both the Training and Test Set samples. FIG. 4B shows the percentage of genes significantly overexpressed in the 3 IFN modules for each disease. FIG. 4C shows the fold change of the expression of the genes present in the IFN modules compared to the controls. FIG. 4D shows the percentage of genes significantly overexpressed in the 5 inflammation modules for each disease. FIG. 4E shows the fold change of the expression of the genes present in the inflammation modules compared to the controls. TB and active sarcoidosis show significant overexpression of the IFN modules compared to the other pulmonary disease groups (FIG. 4A). In contrast the pneumonia and cancer patients showed significant overexpression of the inflammation modules compared to TB and active sarcoidosis. These findings were then verified by modular analysis of the Test Set (Figure E7). The modular analysis therefore also substantiates our results determined from pathways linked to the 1446-transcripts signature described earlier (FIG. 2). TB patients showed a significant increase in the number of IFN genes (FIG. 4B), and their degree of expression (FIG. 4C), compared to the active sarcoidosis patients, demonstrating a quantitative difference in the IFN-inducible signature between TB and active sarcoidosis (FIG. 4B-C) The same genes in the IFN module that were overexpressed in the active sarcoidosis patients were also overexpressed in the TB patients (data not shown). Pneumonia and lung cancer showed a significant increase in the number of genes present in the inflammation modules (FIG. 4D), and their degree of expression (FIG. 4E), in comparison to TB and active sarcoidosis (FIG. 4A, D-E). Pneumonia patients also showed a significant overexpression of the number of genes present in the neutrophil module compared to all the other pulmonary diseases (Figure E8). Whole blood gene expression may correlate with the blood's cell composition or with the gene expression in particular cellular populations. For the neutrophil genes there was a significant correlation between the neutrophil module and the neutrophil count for all the pneumonia patients versus controls (Pearson's correlation, p<0.0001). The second data mining approach, comparison IPA, only used those genes that were differentially expressed between each disease group and a set of controls matched by ethnicity and gender (≧1.5 fold change from the mean of the controls, Mann Whitney Benjamini Hochberg p<0.01; TB=2524, active sarcoidosis=1391, pneumonia=2801 and lung cancer=1626 differentially expressed transcripts). FIG. 5A shows a comparison Ingenuity Pathway Analysis of the four disease groups compared to their matched controls reveals the four most significant pathways. Differentially expressed genes were derived from the Training Set by comparing each disease to healthy controls matched for ethnicity and gender: TB=2524, active sarcoidosis=1391, pneumonia=2801 and lung cancer=1626 transcripts (≧1.5 fold change from the mean of the controls, Mann Whitney Benjamini Hochberg p<0.01). FIG. 5A shows the IPA canonical pathways was used to determined the most significant pathways (i-iv) associated with each disease relative to the other diseases (Fisher's exact Benjamini Hochberg). The bottom x-axis and bars of each graph indicates the log(p-value) and the top x-axis and line indicates the percentage of genes present in the pathway. The genes in the EIF2 signalling pathway are predominately under-abundant genes however the genes in the other three pathways are predominantly over-abundant relative to the controls. Pathways above the blue dotted line are significant (p<0.05). FIGS. 5B, 5C and 5D show the interferon signalling IPA pathway is overlaid onto each disease group. Coloured genes are differentially expressed in that disease group compared to their matched controls (Fisher's exact p<0.05). Red genes represent over-abundance and green under-abundance.",
                        "The Comparison IPA reveals the most significant pathways when comparing across the diseases. The top four significant pathways were related to protein synthesis (EIF2 signalling) and immune response pathways (interferon signalling, role of pattern recognition receptors in recognition of bacteria and viruses and antigen presentation pathway)(FIG. 5A). The prominence of the EIF2 signalling pathway was driven by the pneumonia patients. The genes were significantly under-abundant in the pneumonia patients compared to the other pulmonary diseases. Many other genes related to protein synthesis (including eukaryotic initiation factors and ribosomal proteins) and the unfolded protein response (a stress response to excessive protein synthesis), were also significantly under-abundant in the pneumonia patients compared to the other pulmonary diseases, e.g. PERK, CHOP, ABCE1 (data not shown). The significance of the three immune response pathways was driven predominantly by the TB patients, but also by the sarcoidosis patients. The pathways were more significant (bottom x-axis bar graph in FIG. 5A) and contained a higher number of genes (top x-axis line graph in FIG. 5A) in both TB and active sarcoidosis than compared to the other pulmonary diseases, again demonstrating the similarity of the biological pathways underlying these pulmonary granulomatous diseases. However the interferon signalling pathway was more significant (bottom x-axis bar graph FIG. 5A) and contained a higher number of genes in the TB than the active sarcoidosis patients and were not represented in pneumonia and lung cancer (top x-axis line graph FIG. 5A, FIG. 5B and FIG. 5C).",
                        "The third data mining strategy just examined the top 50 over-abundant differentially expressed transcripts for each disease. It could be seen that the transcripts correlate well with the findings from the modular and IPA analysis as both the TB and active sarcoidosis top 50 over-abundant transcripts were dominated by IFN-inducible genes e.g. IFITM3 (SEQ ID NO.:989), IFIT3 (SEQ ID NO.:1279), GBP1 (SEQ ID NO.:226), GBP6 (SEQ ID NO.:1409), CXCL10 (SEQ ID NO.:1298), OAS1 (SEQ ID NO.:790), STAT1 (SEQ ID NO.:995), IFI44L (SEQ ID NO.:1013), FCGR1B (SEQ ID NO.:63) (Table 6). However the expression fold change was much higher in the TB patients than the active sarcoidosis patients. In addition the pneumonia top 50 over-abundant transcripts were dominated by antimicrobial neutrophil-related genes e.g., ELANE (SEQ ID NO.:330), DEFA1B (SEQ ID NO.:1024), MMP8 (SEQ ID NO.:521), CAMP (SEQ ID NO.:40), DEFA3 (SEQ ID NO.:1088), DEFA4 (SEQ ID NO.:231), MPO (SEQ ID NO.:1287), LTF (SEQ ID NO.:506). The genes FCGR1A, B and C ((SEQ ID NO.:1109, 63, 50, respectively)) were over-abundant in the top 50 transcripts of all four pulmonary diseases. A 4-set Venn diagram of the differentially expressed genes was able to demonstrate the unique genes for each disease group (FIG. 9 and Table 7). There were over three times the number of unique TB genes than unique active sarcoidosis genes of which only the TB unique genes were significantly associated with the IPA IFN-signalling pathway. The unique pneumonia genes were associated with an under-abundance of pathways related to protein synthesis. The unique lung cancer genes were associated with over-abundance of inflammation related pathways. The overlapping genes common to all four disease groups were significantly associated with under-abundance of T and B cell pathways.",
                        "TB and pneumonia patients after treatment showed a diminishment of their transcriptional profiles to resemble the controls however the sarcoidosis patients who respond to glucocorticoids showed a significant increase in their transcriptional activity.",
                        "FIGS. 6A to 6D show both modular analysis and molecular distance to health reveal that the blood transcriptome of the pneumonia and TB patients after successfully completing treatment are no different from the healthy controls however the sarcoidosis patients show an overexpression of inflammation genes during a clinically successful response to glucocorticoids. FIG. 6A shows a modular analysis for gene expression levels of all transcripts that were significantly detected compared to background hybridisation (p<0.01) were compared between the healthy controls and each of the following the patient groups: pre-treatment pneumonia, post-treatment pneumonia patients and pre-treatment sarcoidosis, inadequate treatment response sarcoidosis and good treatment response sarcoidosis patients. A red dot indicates significant over-abundance of transcripts and a blue dot indicates under-abundance (p<0.05). The colour intensity correlates with the percentage of genes in that module that are significantly differentially expressed. MDTH demonstrates the quantification of transcriptional change after treatment in the 1446-transcripts relative to controls for pre-treatment pneumonia, post-treatment pneumonia patients, pre-treatment TB and post-treatment TB and and pre-treatment sarcoidosis, inadequate treatment response sarcoidosis and good treatment response sarcoidosis patients. The mean and SEM was compared between each disease group (ANOVA with Tukey's multiple comparison test). FIG. 6B, Pneumonia patients; FIG. 6C, TB patients from the Bloom et al, 2012 (12), study carried out in South Africa, the controls in this study were participants with latent TB; FIG. 6D Sarcoidosis patients.",
                        "More specifically, having determined the blood transcriptional signatures of untreated patients with the pulmonary granulomatous diseases TB and sarcoidosis and the infectious disease community and acute lung diseases of acquired pneumonia we next sought to examine their transcriptional response to treatment. The pneumonia patients were all followed-up at least 6 weeks after their hospital discharge and showed a good clinical response to their treatment with standard antibiotics (clinical data not shown but available). Using two completely different data mining strategies, modular analysis (all detectable transcripts were analysed) and MDTH (only the 1446-transcripts were analysed), it could be seen that the pneumonia patients after successful treatment showed a reversal of their transcriptional profiles such that there was no significant difference between the pneumonia post-treatment transcriptional profiles and the healthy controls (FIGS. 6A & B). We have previously studied the blood transcriptional response of a cohort of active TB patients from South Africa before and after successful anti-TB treatment (4). Therefore we used the same 1446-transcripts that were derived from this present study to assess the transcriptional response of these South African TB patients before and after treatment, compared to their latent TB controls. The MDTH score of the untreated active TB patients were significantly different from the latent TB controls however the transcriptional response after treatment again reversed with no significant difference between the treated active TB patients and the latent TB controls (FIG. 6C).",
                        "The treated sarcoidosis patients showed a variable clinical response after immunosuppressive treatment initiation as determined by their practising physician (clinical data not shown but available). If the physician increased their treatment at their clinic follow-up the patient was categorised as having an ‘inadequate treatment response’ but if the physician continued the same treatment or reduced their treatment this was categorised as having a ‘good treatment response’. Applying the same two data mining strategies as used for the pneumonia patients it could clearly be seen that the sarcoidosis patients who had a good clinical response to glucocorticoids had a significant overexpression of inflammatory genes that was not seen when the same or the different sarcoidosis patients had an inadequate response to immunosuppressive treatment (FIGS. 6A & D). The majority of the inflammatory genes that were overexpressed in the untreated pneumonia and lung cancer patients were also overexpressed in the good-treatment response sarcoidosis patients (Table 8), but many more transcripts were overexpressed in the good-treatment response sarcoidosis patients (clinical data not shown but available). The term inflammation comprises many forms and therefore there is a diversity of genes that are called inflammatory. Interestingly many of the top 50 overexpressed inflammatory genes in the good-treatment response sarcoidosis patients are known to be anti-inflammatory genes which are invariably induced alongside proinflammatory genes in what is termed an inflammatory response, e.g., IL1R2 (SEQ ID NO.:1007), DUSP1, IL18R (SEQ ID NO.:239), C-FOS, IκBα and MAPK1, as well as pro-inflammatory genes (Table 8).",
                        "The interferon-inducible genes were most abundant in the neutrophils in both TB and sarcoidosis. It was previously shown in the Berry, et al., 2010 publication (5) that the active TB signature was dominated by a neutrophil-driven IFN-inducible gene profile, consisting of both IFN-γ and type I IFN-αβ signalling (5). Therefore the inventors identified the main cell populations driving the IFN-inducible signature in the active sarcoidosis patients. A new cohort of patients (TB and active sarcoidosis) were recruited and controls to test the same IFN-inducible genes as used in the Berry, et al., 2010 publication (5) in the purified leucocyte populations of TB and sarcoidosis patients who had an IFN-inducible signature present in whole blood (Table 9).",
                        "FIGS. 7A to 7E show that interferon-inducible gene expression is most abundant in the neutrophils in both TB and sarcoidosis. The expression of interferon-inducible genes was measured in purified leucocyte populations from whole blood. FIG. 7A is a heatmap that shows the expression of IFN-inducible transcripts, from the Berry, et al., 2010 study (5), for each disease group normalised to the controls for that cell type. FIG. 7B shows the expression fold change in the TB samples of the same IFN-inducible transcripts. FIG. 7C shows the expression fold change in the sarcoidosis samples of the same IFN-inducible transcripts. FIG. 7D shows the expression fold change in the TB samples of all the genes present in the three interferon modules compared to the controls. FIG. 7E shows the expression fold change in the sarcoidosis samples of all the genes present in the three interferon modules compared to the controls.",
                        "Again the neutrophils displayed the highest relative abundance of IFN-inducible genes in active TB (FIGS. 7A, 7B & 7D). The neutrophils also had the highest abundance of IFN-inducible genes in the sarcoidosis patients, although to a lesser extent than was seen in the TB patients (FIGS. 7A, 7C & 7E). The monocytes showed a higher abundance of IFN-inducible genes than the lymphocytes in both the TB and sarcoidosis patients (FIG. 7A-E), as previously shown (5).",
                        "FIG. 8 shows the results for each of the pulmonary diseases using the genes expressed in a neutrophil module. FIG. 8A shows the percentage of genes significantly overexpressed in the neutrophil module for each disease in both the Training and Test set. FIG. 8B shows the fold change of the expression of the genes present in the neutrophil module compared to the controls.",
                        "FIG. 9 is a 4-set Venn diagram comparing the differentially expressed genes for each disease group compared to their ethnicity and gender matched controls. Differentially expressed genes were derived from the Training Set by comparing each disease to healthy controls matched for ethnicity and gender: TB=2524, active sarcoidosis=1391, pneumonia=2801 and lung cancer=1626 transcripts (≧1.5 fold change from the mean of the controls, Mann Whitney Benjamini Hochberg p<0.01). The 4-set Venn diagram was created using Venny (13). IPA canonical pathways was used to determined the most significant pathways associated with the unique transcripts for each disease (Fisher's exact p<0.05). Active Sarc=active sarcoidosis.",
                        "FIG. 10A is a Venn diagram comparing the gene lists used in the class prediction. The gene lists were obtained from this study (144 Illumina probes), Maertzdorf, et al., study (8) (100 Agilent probes of which only 76 probes were recognised as genes using NIH DAVID Gene ID Conversion Tool) and Koth, et al., study (7) (50 genes obtained from a Affymetrix platform although analysis also included data obtained from alternative studies from GEO databases which used other microarray platforms the majority from the Berry et al, 2010 (5) by current applicants). In the Illumina platform used to compare these lists some genes are represented by more than one transcript for example the 50 genes in Koth et al study (7) translate to 77 Illumina probes/transcripts.",
                        "144-transcripts were able to distinguish with good sensitivity and specificity the TB patients from the other pulmonary diseases and healthy controls.",
                        "Although the transcriptional profiles of the TB and active sarcoidosis patients appeared very similar we wished to determine if a gene list could distinguish the TB samples, from all the other patient and control samples. Therefore we compared the TB transcriptional profiles to the most similar group, active sarcoidosis, to derive a set of differentially expressed genes. 144 transcripts were differentially expressed between the TB and active sarcoidosis transcriptional profiles from the Training Set (significance analysis of microarray q<0.05, fold change≧1.5). Many of the transcripts were IFN-inducible genes and were all over-abundant in the TB profiles compared to the active sarcoidosis profiles (Table 2). Two recent publications also described gene lists that could distinguish TB from all sarcoidosis patients (7, 8). These previously published gene lists were derived from different cohorts and used different microarray platforms. We used a class prediction machine learned algorithm, support vector machines (SVM), to test our gene list and the two previously published gene lists for their ability to predict whether a transcriptional profile belonged to a TB patient or not. The prediction model is built using the transcriptional signature from samples with known disease-types to predict the classification of a new collection of samples. The SVM model should therefore be built in one study cohort and run in an independent cohort to prevent over-fitting the predictive signature. This was possible for all our cohorts. Where the study cohorts used a different microarray platform the SVM model had to be re-built in that cohort. However to reduce the effects of over-fitting the same parameters were used every time the SVM model was built.",
                        "The 144 Illumina transcripts showed good sensitivity (above 80%) and specificity (above 90%) in all three independent cohorts from our study (Training, Test and Validation Sets) and when using an external cohort from the Maertzdorf et al study. The 100 Agilent transcripts from the Maertzdorf et al 2012 study were also tested (7). Only 76 of these transcripts were recognised as genes by NIH DAVID Gene ID Conversion Tool. The same SVM parameters as used earlier were then applied using the Maertzdorf et al transcripts in our three independent cohorts (Training, Test and Validation Sets). The sensitivity however was much lower (45-56%), with similar specificity (above 90%). The 50 genes from the Koth et al 2011 (7) study run using an Affymetrix platform were also tested. The same SVM parameters were again applied to all our independent cohorts (Training, Test and Validation Sets). The sensitivity of this gene list was also lower (75-45%), with similar specificity (above 87%), than for our 144-transcripts. Neither the Koth et al 2011 (7) or the Maertzdorf et al 2012 (8) studies reported testing their derived gene lists in independent cohorts. As these study tested the 144-transcripts list from the present applicants (Bloom, O'Garra et al., to be submitted), in both internal and external independent cohorts this is likely to have improved the validity of the transcript list as a discriminative marker, and may explain why there was little overlap between their gene lists or overlap with the present applicants' 144 gene list (Figure E10). Tables 3, 4 and 5. Class prediction. Class prediction was performed using support vector machines (SVM).",
                        "Table 2 (above) shows the 144 transcripts derived from the Training Set which were then used to build the SVM model, the model was then run in the other four cohorts Table 3 (just below).",
                        "Table 4 (below). The 100 Agilent transcripts from the Maertzdorf et al study (8) translated to 76 recognised genes using the DAVID gene converter. The SVM model was built in the Training Set and run in the Test and Validation Sets.",
                        "Table 5 (below) shows the 50 genes from the Koth et al study (7) were used to build the last SVM model in the Training Set and run in the Test and Validation Sets. N/A=not applicable.",
                        "Table 6 (below). The top 50 differentially expressed transcripts for each disease compared to matched controls (from the present applicants' study). Differentially expressed genes were derived from the Training Set by comparing each disease to healthy controls matched for ethnicity and gender: TB=2524, active sarcoidosis=1391, pneumonia=2801 and lung cancer=1626 transcripts (≧1.5 fold change from the mean of the controls, Mann Whitney Benjamini Hochberg p<0.01).",
                        "Table 7 (below). The top 50 differentially expressed transcripts unique for each disease as determined by the 4-set Venn diagram (from the present applicants study). Differentially expressed genes were derived from the Training Set by comparing each disease to healthy controls matched for ethnicity and gender (≧1.5 fold change from the mean of the controls, Mann Whitney Benjamini Hochberg p<0.01). A 4-set Venn diagram was used to identify genes that were unique for each disease.",
                        "Table 8 (below). Top 50 overexpressed genes in the inflammation modules in the good-treatment response sarcoidosis patients",
                        "FIG. 10B is a Venn diagram comparing the genes that distinguish between Tb, sarcoidosis, pneumonia and lung cancer, versus, Tb, active sarcoidosis, non-active sarcoidosis, pneumonia and lung cancer. The overlapping 1359 genes are included in the attached electronic table.",
                        "Thus, in certain embodiments, the present invention includes the identification and/or differentiation of pulmonary diseases using the genes in the Tables of the present invention. Specifically, the skilled artisan will be able to differentiate the pulmonary diseases using 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 144, 150, 200, 250, 300, 400, 500, 600, 700, 800, 900, 1,000, 1,100, 1,200, 1,300, 1,400, or even 1,446 genes listed in the tables contained herein and filed herewith (genes, probes, and SEQ ID NOs incorporated herein by reference). The genes may be selected based on ease of use or accessibility, based on the genes that are most predictive (e.g., using the tables of the present invention), and/or based, in order of importance from top to bottom, of the lists provided for use in the analysis.",
                        "Study population and inclusion criteria. The majority of the TB patients were recruited from Royal Free Hospital, NHS Health Care Trust, London. The sarcoidosis patients were recruited from Royal Free Hospital, John Radcliffe Hospital in Oxford, St Mary's Hospital, Imperial College NHS Health Care Trust, and Barnet Hospital in London and the Avicenne Hospital in Paris. The pneumonia patients were recruited from Royal Free Hospital, NHS Health Care Trust, London. The lung cancer patients and 5 of the TB patients in the Test Set were recruited by the Lyon Collaborative Network, France. All patients were recruited consecutively over time such that the Training Set was recruited first followed by the Test Set, Validation Set and lastly the patients' samples that were used in the cell purification. Additional blood gene expression data were obtained from pulmonary and latent TB patients recruited and analysed in our earlier study, and additionally reanalysed in the current study, as presented in FIG. 6C (11).",
                        "The inclusion criteria were specific for each disease. Pulmonary TB patients: culture confirmed Mycobacterium tuberculosis in either sputum or bronchoalveolar lavage; pulmonary sarcoidosis: diagnosis made by a sarcoidosis specialist, granuloma's on biopsy, compatible clinical and radiological findings (within 6 months of recruitment) according to the WASOG guidelines (9); community acquired pneumonia patients: fulfilled the British Thoracic Society guidelines for diagnosis (10); lung cancer patients: diagnosis by a lung cancer specialist, histological and radiological features consistent with primary lung cancer; healthy controls: their gender, ethnicity and age were similar to the patients, negative QuantiFERON-TB Gold In-Tube (QFT) (Cellestis) test. The exclusion criteria for all patients and healthy controls included significant other medical history (including any immunosuppression such as HIV infection), aged below 18 years or pregnant. Patients were recruited between September 2009 and March 2012. Patients were recruited before commencing treatment unless otherwise stated. This study was approved by the Central London 3 Research Ethics Committee (09/H0716/4), and Ethical permission from CPP Sud-Est IV, France, CCPPRB, Pitié-salpétrierè Hospital, Paris. All participants gave written informed consent.",
                        "IFNγ release assay testing. The QFT M. tubercusosis antigen specific IFN-gamma release assay (IGRA) Assay (Cellestis) was performed according to the manufacturer's instructions.",
                        "Gene expression profiling. 3 ml of whole blood were collected into Tempus tubes (Applied Biosystems/Ambion) by standard phlebotomy, vigorously mixed immediately after collection, and stored between −20 and −80° C. before RNA extraction. RNA was isolated using 1.5 ml whole blood and the MagMAX-96 Blood RNA Isolation Kit (Applied Biosystems/Ambion) according to the manufacturer's instructions. 250 μg of isolated total RNA was globin reduced using the GLOBINclear 96-well format kit (Applied Biosystems/Ambion) according to the manufacturer's instructions. Total and globin-reduced RNA integrity was assessed using an Agilent 2100 Bioanalyzer (Agilent Technologies). RNA yield was assessed using a NanoDrop8000 spectrophotometer (NanoDrop Products, Thermo Fisher Scientific). Biotinylated, amplified antisense complementary RNA (cRNA) targets were then prepared from 200-250 ng of the globin-reduced RNA using the Illumina CustomPrep RNA amplification kit (Applied Biosystems/Ambion). 750 ng of labelled cRNA was hybridized overnight to Illumina Human HT-12 V4 BeadChip arrays (Illumina), which contained more than 47,000 probes. The arrays were washed, blocked, stained and scanned on an Illumina iScan, as per manufacturer's instructions. GenomeStudio (Illumina) was then used to perform quality control and generate signal intensity values.",
                        "Cell purification and RNA processing for microarray. Whole blood was collected in sodium heparin. Peripheral blood mononuclear cells (PBMCs) were separated from the granulocytes/erythrocytes using a Lymphoprep™ (Axis-Shield) density gradient. Monocytes (CD14+), CD4+ T cells (CD4+) and CD8+T cells (CD8+) were isolated sequentially from the PBMCs using magnetic antibody-coupled (MACS) whole blood beads (Miltenyi Biotec, Germany) according to manufacturer's instructions. Neutrophils were isolated from the granulocyte/erythrocyte layer after red blood cell lysis using the CD15+MACS beads (Miltenyi Biotec, Germany). RNA was extracted from whole blood (5′ Prime PerfectPure Kit) or separated cell populations (Qiagen RNeasy Mini Kit). Total RNA integrity and yield was assessed as described above. Biotinylated, amplified antisense complementary RNA (cRNA) targets were then prepared from 50 ng of total RNA using the NuGEN WT-Ovation™ RNA Amplification and Encore BiotinIL Module (NuGEN Technologies, Inc). Amplifed RNA was purified using the Qiagen MinElute PCR purification kit (Qiagen, Germany). cRNA was then handled as described above.",
                        "Raw data processing. After microarray raw data were processed using GeneSpring GX version 11.5 (Agilent Technologies) and the following was applied to all analyses. After background subtraction each probe was attributed a flag to denote its signal intensity detection p-value. Flags were used to filter out probe sets that did not result in a ‘present’ call in at least 10% of the samples, where the ‘present’ lower cut off=0.99. Signal values were then set to a threshold level of 10, log 2 transformed, and per-chip normalised using 75th percentile shift algorithm. Next per-gene normalisation was applied by dividing each messenger RNA transcript by the median intensity of all the samples. All statistical analysis was performed after this stage. Raw microarray data has been deposited with GEO (Accession number GSE). All data collected and analysed in the experiments adhere to the Minimal Information About a Microarray Experiment (MIAME) guidelines.",
                        "Data analysis. GeneSpring 11.5 was used to select transcripts that displayed expression variability from the median of all transcripts (unsupervised analysis). A filter was set to include only transcripts that had at least twofold changes from the median and present in ≧10% of the samples. Unsupervised analysis was used to derive the 3422-transcripts. Applying a non-parametric statistical filter (Kruskal Wallis test with a FDR (Benjamini Hochberg)=0.01), after the unsupervised analysis, generated the 1446-transcript and 1396-transcript signatures. The two signatures differed only in which groups the statistical filter was applied across; 1446, five groups (TB, sarcoidosis, pneumonia, lung cancer and controls) and 1396, six groups (TB, active sarcoidosis, non-active sarcoidosis, pneumonia, lung cancer and controls).",
                        "Differentially expressed genes for each disease were derived by comparing each disease to a set of controls matched for ethnicity and gender within a 10% difference. GeneSpring 11.5 was used to select transcripts that were ≧1.5 fold different in expression from the mean of the controls and statistically significant (Mann Whitney unpaired FDR (Benjamini Hochberg)=0.01). Comparison Ingenuity Pathway Analysis (IPA) (Ingenuity Systems, Inc., Redwood, Calif.) was used to determine the most significant canonical pathways associated with the differentially expressed genes of each disease relative to the other diseases (Fisher's exact FDR (Benjamini Hochberg)=0.05). The bottom x-axis and bars of each comparison IPA graph indicated the log(p-value) and the top x-axis and line indicated the percentage of genes present in the pathway.",
                        "Molecular distance to health (MDTH) was determined as previously described (12), and then applied to different transcriptional signatures. Transcriptional modular analysis was applied as previously described (12). The raw expression levels of all transcripts significantly detected from background hybridisation were compared between each sample and all the controls present in that dataset. The percentage of significantly expressed genes in each module were represented by the colour intensity (Student t-test, p<0.05), red indicates overexpression and blue indicates underexpression. The mean percentage of significant genes and the mean fold change of these genes compared to the controls in specified modules were also shown in graphical form. MDTH and modular analysis were calculated in Microsoft Excel 2010. GraphPad Prism version 5 for Windows was used to generate the graphs.",
                        "Differentially expressed genes between the Training Set TB patients and active sarcoidosis patients were derived using the non-parametric Significance Analysis of Microarrays (q<0.05) and ≧1.5 fold expression change. Class prediction was performed within GeneSpring 11.5 using the machine learned algorithm support vector machines (SVM). The model was built using sample classifiers ‘TB’ or ‘not TB’. The SVM model should be built in one study cohort and run in an independent cohort to prevent over-fitting the predictive signature. This was possible for all the cohorts from our study. Where the study cohorts used a different microarray platform the SVM model had to be re-built in that cohort. To reduce the effects of over-fitting the same SVM parameters were always used. The kernel type used was linear, maximum iterations 100,000, cost 100, ratio 1 and validation type N-fold where N=3 with 10 repeats.",
                        "Univariate and multivariate regression analysis were calculated using STATA 9 (StataCorp 2005. Stata Statistical Software: Release 9. College Station, Tex.; StataCorp LP). In the multivariate regression analysis where there were missing data points (serum ACE and HRCT disease activity) to prevent list-wise deletion dummy variable adjustment was used.",
                        "It is contemplated that any embodiment discussed in this specification can be implemented with respect to any method, kit, reagent, or composition of the invention, and vice versa. Furthermore, compositions of the invention can be used to achieve methods of the invention.",
                        "It will be understood that particular embodiments described herein are shown by way of illustration and not as limitations of the invention. The principal features of this invention can be employed in various embodiments without departing from the scope of the invention. Those skilled in the art will recognize, or be able to ascertain using no more than routine experimentation, numerous equivalents to the specific procedures described herein. Such equivalents are considered to be within the scope of this invention and are covered by the claims.",
                        "All publications and patent applications mentioned in the specification are indicative of the level of skill of those skilled in the art to which this invention pertains. All publications and patent applications are herein incorporated by reference to the same extent as if each individual publication or patent application was specifically and individually indicated to be incorporated by reference.",
                        "The use of the word “a” or “an” when used in conjunction with the term “comprising” in the claims and/or the specification may mean “one,” but it is also consistent with the meaning of “one or more,” “at least one,” and “one or more than one.” The use of the term “or” in the claims is used to mean “and/or” unless explicitly indicated to refer to alternatives only or the alternatives are mutually exclusive, although the disclosure supports a definition that refers to only alternatives and “and/or.” Throughout this application, the term “about” is used to indicate that a value includes the inherent variation of error for the device, the method being employed to determine the value, or the variation that exists among the study subjects.",
                        "As used in this specification and claim(s), the words “comprising” (and any form of comprising, such as “comprise” and “comprises”), “having” (and any form of having, such as “have” and “has”), “including” (and any form of including, such as “includes” and “include”) or “containing” (and any form of containing, such as “contains” and “contain”) are inclusive or open-ended and do not exclude additional, unrecited elements or method steps.",
                        "The term “or combinations thereof” as used herein refers to all permutations and combinations of the listed items preceding the term. For example, “A, B, C, or combinations thereof” is intended to include at least one of: A, B, C, AB, AC, BC, or ABC, and if order is important in a particular context, also BA, CA, CB, CBA, BCA, ACB, BAC, or CAB. Continuing with this example, expressly included are combinations that contain repeats of one or more item or term, such as BB, AAA, AB, BBC, AAABCCCC, CBBAAA, CABABB, and so forth. The skilled artisan will understand that typically there is no limit on the number of items or terms in any combination, unless otherwise apparent from the context. In certain embodiments, the present invention may also include methods and compositions in which the transition phrase “consisting essentially of” or “consisting of” may also be used.",
                        "As used herein, words of approximation such as, without limitation, “about”, “substantial” or “substantially” refers to a condition that when so modified is understood to not necessarily be absolute or perfect but would be considered close enough to those of ordinary skill in the art to warrant designating the condition as being present. The extent to which the description may vary will depend on how great a change can be instituted and still have one of ordinary skilled in the art recognize the modified feature as still having the required characteristics and capabilities of the unmodified feature. In general, but subject to the preceding discussion, a numerical value herein that is modified by a word of approximation such as “about” may vary from the stated value by at least ±1, 2, 3, 4, 5, 6, 7, 10, 12 or 15%.",
                        "All of the compositions and/or methods disclosed and claimed herein can be made and executed without undue experimentation in light of the present disclosure. While the compositions and methods of this invention have been described in terms of preferred embodiments, it will be apparent to those of skill in the art that variations may be applied to the compositions and/or methods and in the steps or in the sequence of steps of the method described herein without departing from the concept, spirit and scope of the invention. All such similar substitutes and modifications apparent to those skilled in the art are deemed to be within the spirit, scope and concept of the invention as defined by the appended claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce invention scope",
                        "define terms",
                        "describe array technology",
                        "define biomarker",
                        "describe disease states",
                        "define module and vector of gene expression",
                        "explain gene expression monitoring systems",
                        "describe customized gene arrays",
                        "highlight advantages of optimized arrays",
                        "define differentially expressed",
                        "describe therapy and therapeutic regimen",
                        "define pharmacological state",
                        "define biological state",
                        "describe expression profile",
                        "define gene",
                        "describe transcriptional state",
                        "explain expression level",
                        "describe gene expression monitoring systems",
                        "highlight advantages of customized arrays",
                        "describe molecular fingerprinting system",
                        "explain comparative analysis",
                        "describe normal or wild-type expression data",
                        "define differentially expressed",
                        "describe measurement of cellular constituents",
                        "explain gene expression analysis",
                        "describe sample sources",
                        "describe RNA isolation",
                        "list bodily fluids for RNA isolation",
                        "describe tissue sources",
                        "list tissue sources",
                        "describe cell sources",
                        "list cell sources",
                        "describe nucleic acid sources",
                        "list nucleic acid sources",
                        "describe tissue biopsy sample",
                        "describe sorted cell populations",
                        "describe cell culture",
                        "describe cell clones",
                        "describe transformed cells",
                        "describe biopsies",
                        "describe single cell",
                        "introduce invention components",
                        "describe data mining tools",
                        "motivate microarray data analysis",
                        "describe challenges in microarray data analysis",
                        "introduce pulmonary tuberculosis",
                        "describe blood as a biologic material",
                        "motivate gene expression microarrays",
                        "describe previous microarray approaches for TB",
                        "introduce neutrophil driven blood transcriptional signature",
                        "describe study of Berry et al.",
                        "describe blood transcriptional profiles of pulmonary granulomatous diseases",
                        "introduce unsupervised hierarchical clustering",
                        "describe clustering results",
                        "describe Ingenuity Pathway Analysis",
                        "describe biological pathways associated with pulmonary granulomatous diseases",
                        "describe clinical classification of sarcoidosis patients",
                        "describe molecular distance to health",
                        "describe data mining strategies",
                        "describe modular analysis",
                        "describe Ingenuity Pathway Analysis",
                        "describe annotation of top differentially expressed genes",
                        "describe modular analysis results",
                        "describe Ingenuity Pathway Analysis results",
                        "describe annotation results",
                        "describe comparison of data mining strategies",
                        "describe IPA canonical pathways",
                        "describe EIF2 signalling pathway",
                        "describe immune response pathways",
                        "describe interferon signalling pathway",
                        "describe role of pattern recognition receptors",
                        "describe antigen presentation pathway",
                        "describe top differentially expressed transcripts",
                        "describe IFN-inducible genes",
                        "describe antimicrobial neutrophil-related genes",
                        "describe 4-set Venn diagram",
                        "describe unique genes for each disease group",
                        "describe IPA IFN-signalling pathway",
                        "describe protein synthesis pathways",
                        "describe inflammation related pathways",
                        "describe T and B cell pathways",
                        "describe composite transcriptional markers",
                        "describe reduced multivariate score",
                        "describe visualization of transcriptional gene set-level data",
                        "describe development and analysis of composite transcriptional markers",
                        "describe application of Temporal Molecular Response discovery algorithms",
                        "describe validation in independent sample sets",
                        "describe microarray analyses of gene expression in blood leucocytes",
                        "describe transcriptional profiles of patients with pulmonary diseases",
                        "show modular analysis and molecular distance to health",
                        "analyze transcriptional response to treatment in pneumonia patients",
                        "analyze transcriptional response to treatment in TB patients",
                        "analyze transcriptional response to treatment in sarcoidosis patients",
                        "identify overexpressed inflammatory genes in good-treatment response sarcoidosis patients",
                        "analyze interferon-inducible gene expression in neutrophils",
                        "show heatmap of interferon-inducible gene expression",
                        "show expression fold change in TB samples",
                        "show expression fold change in sarcoidosis samples",
                        "analyze expression of interferon-inducible genes in different cell types",
                        "show results for each pulmonary disease using genes expressed in neutrophil module",
                        "compare differentially expressed genes for each disease group",
                        "identify unique transcripts for each disease",
                        "determine most significant pathways associated with unique transcripts",
                        "compare gene lists used in class prediction",
                        "describe 144-transcripts that distinguish TB patients from other pulmonary diseases and healthy controls",
                        "compare TB transcriptional profiles to active sarcoidosis profiles",
                        "test gene lists for ability to predict TB patients",
                        "describe class prediction using support vector machines",
                        "show results of class prediction using 144-transcripts",
                        "show results of class prediction using 100 Agilent transcripts",
                        "show results of class prediction using 50 genes from Koth et al study",
                        "describe top 50 differentially expressed transcripts for each disease",
                        "describe top 50 differentially expressed transcripts unique for each disease",
                        "describe top 50 overexpressed genes in inflammation modules",
                        "show Venn diagram comparing genes that distinguish between different diseases",
                        "describe overlapping genes between different disease groups",
                        "provide electronic table of overlapping genes",
                        "identify pulmonary diseases",
                        "differentiate pulmonary diseases",
                        "describe study population",
                        "outline inclusion criteria",
                        "outline exclusion criteria",
                        "describe patient recruitment",
                        "describe IFNγ release assay testing",
                        "describe gene expression profiling",
                        "describe RNA extraction",
                        "describe RNA processing for microarray",
                        "describe cell purification",
                        "describe RNA processing for microarray",
                        "describe raw data processing",
                        "describe data analysis",
                        "describe unsupervised analysis",
                        "describe supervised analysis",
                        "describe differentially expressed genes",
                        "describe Ingenuity Pathway Analysis",
                        "describe molecular distance to health",
                        "describe transcriptional modular analysis",
                        "describe class prediction",
                        "describe univariate and multivariate regression analysis",
                        "contemplate embodiments",
                        "describe scope of invention",
                        "describe equivalents",
                        "incorporate publications by reference",
                        "define \"a\" and \"an\"",
                        "define \"or\"",
                        "define \"about\"",
                        "define \"comprising\" and similar terms",
                        "define \"or combinations thereof\""
                    ],
                    "num_characters": 74718,
                    "outline_medium": [
                        "introduce invention scope",
                        "define terms",
                        "describe array technology",
                        "define biomarker",
                        "describe disease states",
                        "define module and vector of gene expression",
                        "explain gene expression monitoring systems",
                        "describe customized gene arrays",
                        "define differentially expressed",
                        "describe therapy and therapeutic regimen",
                        "define pharmacological state",
                        "define biological state",
                        "describe expression profile",
                        "define gene",
                        "describe transcriptional state",
                        "explain gene expression monitoring systems",
                        "describe molecular fingerprinting system",
                        "define differentially expressed",
                        "describe sample sources",
                        "conclude invention description",
                        "introduce background of TB treatment monitoring",
                        "describe challenges in microarray data analysis",
                        "motivate Temporal Molecular Response discovery algorithms",
                        "describe blood as ideal biologic material for immune system analysis",
                        "summarize microarray approaches for disease study",
                        "introduce study of Berry et al. (2010)",
                        "describe blood transcriptional signature of active TB",
                        "describe clustering of pulmonary granulomatous diseases",
                        "identify distinct biological pathways associated with diseases",
                        "describe Ingenuity Pathway Analysis of main clusters",
                        "explain clinical classification of sarcoidosis patients",
                        "describe unsupervised hierarchical clustering of 1396-transcripts",
                        "quantify transcriptional change relative to controls",
                        "describe three data mining strategies",
                        "apply modular analysis to understand biological pathways",
                        "describe Ingenuity Pathway Analysis of disease groups",
                        "annotate top differentially expressed genes for each disease group",
                        "compare IPA results across diseases",
                        "describe EIF2 signalling pathway",
                        "describe immune response pathways",
                        "examine top 50 over-abundant differentially expressed transcripts",
                        "correlate transcripts with modular and IPA analysis",
                        "describe 4-set Venn diagram of differentially expressed genes",
                        "describe transcriptional profiles of patients with pulmonary diseases",
                        "show modular analysis and molecular distance to health",
                        "analyze transcriptional response to treatment in pneumonia patients",
                        "analyze transcriptional response to treatment in TB patients",
                        "analyze transcriptional response to treatment in sarcoidosis patients",
                        "identify inflammatory genes in good-treatment response sarcoidosis patients",
                        "analyze interferon-inducible gene expression in neutrophils",
                        "show results for each pulmonary disease using genes expressed in neutrophil module",
                        "compare differentially expressed genes for each disease group",
                        "describe class prediction using support vector machines",
                        "compare gene lists from different studies",
                        "show performance of 144-transcripts in distinguishing TB patients",
                        "show performance of gene lists from other studies",
                        "provide tables and figures summarizing results",
                        "describe invention scope",
                        "introduce study population and inclusion criteria",
                        "detail patient recruitment and sample collection",
                        "describe IFNγ release assay testing",
                        "outline gene expression profiling",
                        "detail cell purification and RNA processing",
                        "describe raw data processing",
                        "outline data analysis",
                        "derive differentially expressed genes",
                        "perform molecular distance to health analysis",
                        "apply transcriptional modular analysis",
                        "derive class prediction model",
                        "perform univariate and multivariate regression analysis",
                        "discuss invention embodiments and scope",
                        "provide disclaimer and definitions"
                    ],
                    "outline_short": [
                        "introduce scope of invention",
                        "define key terms",
                        "describe microarray technology",
                        "explain biomarkers and disease states",
                        "introduce modular transcriptional vectors",
                        "describe gene expression monitoring systems",
                        "explain pharmacological state and biological state",
                        "define gene and transcriptional state",
                        "discuss customized gene arrays and cost benefits",
                        "outline molecular fingerprinting system",
                        "introduce background of TB treatment monitoring",
                        "describe challenges in microarray data analysis",
                        "motivate blood transcriptional signature for disease diagnosis",
                        "summarize study of Berry et al. (2010)",
                        "describe clustering of blood transcriptional profiles",
                        "analyze biological pathways associated with pulmonary diseases",
                        "explain clinical classification of sarcoidosis patients",
                        "describe molecular distance to health analysis",
                        "summarize three data mining strategies",
                        "describe modular analysis of biological pathways",
                        "summarize findings from data mining strategies",
                        "describe transcriptional response to treatment",
                        "analyze blood transcriptional signatures of pulmonary diseases",
                        "examine interferon-inducible gene expression in neutrophils",
                        "compare gene lists for distinguishing TB from other diseases",
                        "test gene lists using support vector machines",
                        "summarize class prediction results",
                        "provide additional tables and figures",
                        "describe pulmonary disease diagnosis",
                        "detail study population and inclusion criteria",
                        "outline gene expression profiling and RNA processing",
                        "explain raw data processing and statistical analysis",
                        "discuss data analysis and molecular distance to health",
                        "describe class prediction and regression analysis",
                        "provide general statements on invention scope and claims"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of determining if a human subject is afflicted with pulmonary disease comprising:\nobtaining a sample from a subject suspected of having a pulmonary disease;\ndetermining the expression level of six or more genes from each of the following genes expressed in one or more of the following expression pathways:\nEIF2 signaling; mTOR signaling; regulation of eIF4 and p70s6K signaling; interferon signaling; antigen presentation pathways; T cell signaling pathways; and other signaling pathways;\ncomparing the expression level of the six or more genes with the expression level of the same genes from individuals not afflicted with a pulmonary disease, and\ndetermining the level of expression of the six or more genes in the sample from the subject relative to the samples from individuals not afflicted with a pulmonary disease for the genes expressed in the one or more expression pathways,\nwherein co-expression of genes in the EIF2 signaling and mTOR signaling pathways are indicative of active sarcoidosis; co-expression of genes in the regulation of eIF4 and p70s6K signaling pathways is indicative of pneumonia; co-expression of genes in the interferon signaling and antigen presentation pathways are indicative of tuberculosis; and co-expression of genes in the T cell signaling pathways; and other signaling pathways is indicative of lung cancer.",
        "2. The method of claim 1, wherein the genes associated with tuberculosis are selected from at least 3, 4, 5 or 6 genes selected from ANKRD22; FCGR1A; SERPING1; BATF2; FCGR1C; FCGR1B; LOC728744; IFITM3; EPSTI1; GBP5; IF144L; GBP6; GBP1; LOC400759; IFIT3; AIM2; SEPT4; C1QB; GBP1; RSAD2; RTP4; CARD17; IFIT3; CASP5; CEACAM1; CARD17; ISG15; IF127; TIMM10; WARS; IF16; TNFAIP6; PSTPIP2; IF144; SCO2; FBXO6; FER1L3; CXCL10; DHRS9; OAS1; STAT1; HP; DHRS9; CEACAM1; SLC26A8; CACNA1E; OLFM4; and APOL6, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "3. The method of claim 1, wherein the genes associated with tuberculosis and not active sarcoidosis, pneumonia or lung cancer are selected from C1QB; IF127; SMARCD3; SOCS1; KCNJ15; LPCAT2; ZDHHC19; FYB; SP140; IFITM1; ALAS2; CEACAM6; OAS2; C1QC; LOC100133565; ITGA2B; LY6E; SP140; CASP7; GADD45G; FRMD3; CMPK2; AQP10; CXCL14; ITPRIPL2; FAS; XK; CARD16; SLAMF8; SELP; NDN; OAS2; TAPBP; BPI; DHX58; GAS6; CPT1B; CD300C; LILRA6; USF1; C2; 38231.0; NFXL1; GCH1; CCR1; OAS2; CCR2; F2RL1; SNX20; and ARAP2, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "4. The method of claim 1, wherein the genes associated with active sarcoidosis are selected from FCGR1A; ANKRD22; FCGR1C; FCGR1B; SERPING1; FCGR1B; BATF2; GBP5; GBP1; IFIT3; ANKRD22; LOC728744; GBP1; EPSTI1; IF144L; INDO; IFITM3; GBP6; RSAD2; DHRS9; TNFAIP6; IFIT3; P2RY14; DHRS9; ID01; STAT1; WARS; TIMM10; P2RY14; LOC389386; FER1L3; IFIT3; RTP4; SCO2; GBP4; IFIT1; LAP3; OASL; CEACAM1; LIMK2; CASP5; STAT1; CCL23; WARS; ATF3; IF16; PSTPIP2; ASPRV1; FBXO6; and CXCL10, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "5. The method of claim 1, wherein the genes associated with active sarcoidosis and not tuberculosis, pneumonia or lung cancer are selected from CCL23; PIK3R6; EMR4; CCDC146; KLF4; GRINA; SLC4A1; PLA2G7; GRAMD1B; RAPGEF1; NXNL1; TRIM58; GABBR1; TAGLN; KLF4; MFAP3L; LOC641798; RIPK2; LOC650840; FLJ43093; ASAP2; C15orf26; REC8; KIAA0319L; GRINA; FLJ30092; BTN2A1; HIF1A; LOC440313; HOXA1; LOC645153; ST3GAL6; LONRF1; PPP1R3B; MPPE1; LOC652699; LOC646144; SGMS1; BMP2K; SLC31A1; ARSB; CAMK1D; ICAM4; HIF1A; LOC641996; RNASE10; PI15; SLC30A1; LOC389124; and ATP1A3, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "6. The method of claim 1, wherein the genes associated with pneumonia are selected from OLFM4; LTF; VNN1; HP; DEFA4; OPLAH; CEACAM8; DEFA1B; ELANE; C19orf59; ARG1; CDK5RAP2; DEFA1B; DEFA3; DEFA1B; FCGR1A; MMP8; FCGR1B; SLPI; SLC26A8; MAPK14; CAMP; NLRC4; FCAR; RNASE3; FCGR1B; NAIP; OLR1; FCGR1C; ANXA3; DEFA1; PGLYRP1; TCN1; ANKDD1A; COL17A1; SLC26A8; TMEM144; SAMD14; MAPK14; RETN; NAIP; GPR84; CASP5; MPO; MMP9; CR1; MYL9; CLEC4D; ITGAX; and ANKRD22, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "7. The method of claim 1, wherein the genes associated with pneumonia and not tuberculosis, active sarcoidosis, or lung cancer are selected from DEFA4; ELANE; MMP8; OLR1; COL17A1; RETN; GPR84; LOC100134379; TACSTD2; SLC2A11; LOC100130904; MCTP2; AZU1; DACH1; GADD45A; NSUN7; CR1; CDK5RAP2; LOC284648; GPR177; CLEC5A; UPB1; SLC2A5; GPR177; APP; LAMC1; REPS2; PIK3CB; SMPDL3A; UBE2C; NDUFAF3; CDC20; CTSK; RAB13; LOC651524; TMEM176A; PDGFC; ATP9A; SV2A; SPOCD1; MARCO; CCDC109A; NUSAP1; SLCO4C1; CYP27A1; LOC644615; PKM2; BMX; PADI4; and NAMPT, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "8. The method of claim 1, wherein the genes associated with lung cancer are selected from ARG1; TPST1; FCGR1A; C19orf59; SLPI; FCGR1B; IL1R1; FCGR1C; TDRD9; SLC26A8; FCGR1B; CLEC4D; LOC100132858; SLC22A4; LOC100133177; SIPA1L2; ANXA3; LIMK2; TMEM88; MMP9; ASPRV1; MANSC1; TLR5; CD163; CAMP; LOC642816; DPRXP4; LOC643313; NTN3; MRVI1; F5; SOCS3; TncRNA; MIR21; LOC100170939; LOC100129904; GRB10; ASGR2; LOC642780; LOC400499; FCAR; KREMEN1; SLC22A4; CR1; LOC730234; SLC26A8; C7orf53; VNN1; NLRC4; and LOC400499, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "9. The method of claim 1, wherein the genes associated with lung cancer and not tuberculosis, active sarcoidosis, or pneumonia are selected from TPST1; MRVI1; C7orf53; ECHDC3; LOC651612; LOC100134660; TIAM2; KIAA1026; HECW2; TLE3; TBC1D24; LOC441193; CD163; RFX2; LOC100134688; LOC642342; FKBP9L; PHF20L1; LOC402176; CD163; OSBPL1A; PRMT5; UBTD1; ADORA3; SH2D3C; RBP7; ERGIC1; TMEM45B; CUX1; TREM1; C1GALT1C1; MAML3; C15orf29; DSC2; RRP12; LRP3; HDAC7A; FOS; C14orf4; LIPN; MAP1LC3B2; LOC400793; LOC647834; PHF20L1; CCNJL; SLC12A6; FLJ42957; CCDC147; SLC25A40; and LOC649270, wherein the genes are evaluated at least one of: in aggregate, in the order listed, aggregated into pathways, or selected from 7, 8, 9, 10, 11, 12, 13, 15, 20, 25, 35, 40, 45, or 49 genes.",
        "10. The method of claim 1, wherein the genes associated with lung cancer and not tuberculosis, active sarcoidosis, or pneumonia are selected from Table 1 by:\nparsing the genes into the expression pathways, and\ndetermining that the subject is afflicted with a pulmonary disease selected from tuberculosis, sarcoidosis, cancer or pneumonia based on the gene expression from a sample obtained from the subject when compared to the level of expression of the genes in each of the expression pathways.",
        "11. The method of claim 1, wherein the specificity is 90 percent or greater and sensitivity is 80 percent or greater for a diagnosis of tuberculosis or sarcoidosis.",
        "12. The method of claim 1, further comprising a method for displaying if the patient has tuberculosis or sarcoidosis aggregating the expression data from the 3, 4, 5, 6 or more genes into a single visual display of a vector of expression for tuberculosis, sarcoidosis, cancer or an infectious pulmonary disease.",
        "13. The method of claim 1, further comprising the step of detecting and evaluating 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes for the analysis.",
        "14. The method of claim 1, further comprising the step of detecting and evaluating the EIF2 signaling; mTOR signaling; regulation of eIF4 and p70s6K signaling; interferon signaling; antigen presentation pathways; T cell signaling pathways; and other signaling pathways from 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes that are upregulated or downregulated and are selected from UBE2J2; ALPL; JMJD6; FCER1G; LILRA5; LY96; FCGR1C; C10orf33; GPR109B; PROK2; PIM3; SH3GLB1; DUSP3; PPAP2C; SLPI; MCTP1; KIF1B; FLJ32255; BAGE5; IFITM1; GPR109A; IF135; LOC653591; KREMEN1; IL18R1; CACNA1E; ABCA2; CEACAM1; MXD4; TncRNA; LMNB1; H2AFJ; HP; ZNF438; FCER1A; SLC22A4; DISC1; MEFV; ABCA1; ITPRIPL2; KCNJ15; LOC728519; ERLIN1; NLRC4; B4GALT5; LOC653610; HIST2H2BE; AIM2; P2RY10; CCR3; EMR4P; NTN3; C1QB; TAOK1; FCGR1B; GATA2; FKBP5; DGAT2; TLR5; CARD17; INCA; MSL3L1; ESPN; LOC645159; C19orf59; CDK5RAP2; PLSCR1; RGL4; IFI30; LOC641710; GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.: 754); LOC100008589; LOC100008589; SMARCD3; NGFRAP1; LOC100132394; OPLAH; CACNG6; LILRB4; HIST2H2AA4; CYP1B1; PGS1; SPATA13; PFKFB3; HIST1H3D; SNORA73B; SLC26A8; SULT1B1; ADM; HIST2H2AA3; HIST2H2AA3; GYG1; CST7; EMR4; LILRA6; MEF2D; IFITM3; MSL3; DHRS13; EMR4; C16orf57; HIST2H2AC; EEF1D; TDRD9; GPR97; ZNF792; LOC100134364; SRGAP3; FCGR1A; HPSE; LOC728417; LOC728417; MIR21; HIST1H2BG; COP1; SMARCD3; LOC441763; ZSCAN18; GNG8; MTRF1L; ANKRD33; PLAC8; PLAC8; SLC26A8; AGTRAP; FLJ43093; LPCAT2; AGTRAP; S100A12; SVIL; LILRA5; LILRA5; ZFP91; CLC; LOC100133565; LTB4R; SEPT04; ANXA3; BHLHB2; IL4R; IFNAR1; MAZ; GCCCCCTAATTGACTGAATGGAACCCCTCTTGACCAAAGTGACCCCAGAA (SEQ ID NO.: 1379); OSM; and optionally excluding at least one of ADM, SEPT4, IFITM1, FCER1G, MED2F, CDK5RAP2 or CARD16.",
        "15. The method of claim 14, wherein the genes that are downregulated are selected from MEF2D; BHLHB2; CLC; FCER1A; SRGAP3; FLJ43093; CCR3; EMR4; ZNF792; C10orf33; CACNG6; P2RY10; GATA2; EMR4P; ESPN; EMR4; MXD4; and ZSCAN18.",
        "16. The method of claim 14, wherein the interferon inducible genes are selected from CD274; CXCL10; GBP1; GBP2; GBP5; IF116; IF135; IF144; IF144L; IF16; IFIH1; IFIT2; IFIT3; IFIT5; IFITM1; IFITM3; IRF7; OAS1; OAS2; OAS3; SOCS1; STAT1; STAT2; TAP1; and TAP2.",
        "17. The method of claim 1, wherein the sample is a blood, peripheral blood mononuclear cells, sputum, or lung biopsy.",
        "18. The method of claim 1, wherein the expression level comprises a mRNA expression level and is quantitated by a method selected from the group consisting of polymerase chain reaction, real time polymerase chain reaction, reverse transcriptase polymerase chain reaction, hybridization, probe hybridization and gene expression array.",
        "19. The method of claim 1, wherein the expression level is determined using at least one technique selected from the group consisting of polymerase chain reaction, heteroduplex analysis, single stand conformational polymorphism analysis, ligase chain reaction, comparative genome hybridization, Southern blotting, Northern blotting, Western blotting, enzyme-linked immunosorbent assay, fluorescent resonance energy-transfer and sequencing.",
        "20. The method of claim 1, wherein the expression level is determined by microarray analysis that comprises use of oligonucleotides that hybridize to mRNA transcripts or cDNAs for the six or more genes, and wherein the oligonucleotides are disposed or directly synthesized on the surface of a chip or wafer.",
        "21. The method of claim 20, wherein the oligonucleotides are about 10 to about 50 nucleotides in length.",
        "22. The method of claim 1, further comprising the step of using the determined comparative gene product information to formulate at least one of diagnosis, a prognosis or a treatment plan.",
        "23. The method of claim 1, wherein the patient's disease state is further determined by radiological analysis of the patient's lungs.",
        "24. The method of claim 1, further comprising the step of determining a treated patient gene expression dataset after the patient has been treated and determining if the treated patient gene expression dataset has returned to a normal gene expression dataset thereby determining if the patient has been treated.",
        "25. A method of determining a lung disease from a patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia comprising:\nobtaining a sample from the patient suspected of sarcoidosis, tuberculosis, lung cancer or pneumonia;\ndetecting expression of 3, 4, 5, 6 or more disease genes, markers, or probes of Table 1 (SEQ ID NOS.: 1 to 1446), wherein increased expression of mRNA of upregulated sarcoidosis, tuberculosis, lung cancer and pneumonia markers of Table 1 and/or decreased expression of mRNA of downregulated sarcoidosis, tuberculosis, lung cancer or pneumonia markers of Table 1 relative to the expression of the mRNAs from a normal sample; and\ndetermining the lung disease based on the expression level of the six or more disease markers of Table 1 based on a comparison of the expression level of sarcoidosis, tuberculosis, lung cancer, and pneumonia.",
        "26. The method of claim 25, further comprising the step of selecting 3, 4, 5, 6 or more genes that are differentially expressed between sarcoidosis, tuberculosis, lung cancer, and pneumonia.",
        "27. The method of claim 25, further comprising the step of differentiating between sarcoidosis that is active sarcoidosis and inactive sarcoidosis by determining the expression levels of six or more genes, markers, or probes selected from: TMEM144; FBLN5; FBLN5; ERI1; CXCR3; GLUL; LOC728728; KLHDC8B; KCNJ15; RNF125; CCNB1IP1; PSG9; LOC100170939; QPCT; CD177; LOC400499; LOC400499; LOC100134634; TMEM88; LOC729028; EPSTI1; INSC; LOC728484; ERP27; CCDC109A; LOC729580; C2; TTRAP; ALPL; MAEA; COX10; GPR84; TRMT11; ANKRD22; MATK; TBC1D24; LILRA5; TMEM176B; CAMP; PKIA; PFTK1; TPM2; TPM2; PRKCQ; PSTPIP2; LOC129607; APRT; VAMPS; FCGR1C; SHKBP1; CD79B; SIGIRR; FKBP9L; LOC729660; WDR74; LOC646434; LOC647834; RECK; MGST1; PIWIL4; LILRB1; FCGR1B; NOC3L; ZNF83; FCGBP; SNORD13; LOC642267; GBP5; EOMES; C5; CHMP7; ETV7; ILVBL; LOC728262; GNLY; LOC388572; GATA1; MYBL1; LOC441124; IL12RB1; BRIX1; GAS6; GAS6; LOC100133740; GPSM1; C6orf129; IER3; MAPK14; PROK1; GPR109B; SASP; LOC728093; PROK2; CTSW; ABHD2; LOC100130775; SLITRK4; FBXW2; RTTN; TAF15; FUT7; DUSP3; LOC399715; LOC642161; TCTN1; SLAMF8; TGM2; ECE1; CD38; INPP4B; ID3; CR1; CR1; TAPBP; PPAP2C; MBOAT2; MS4A2; FAM176B; LOC390183; SERPING1; LOC441743; H1F0; SOD2; LOC642828; POLB; TSPAN9; ORMDL3; FER1L3; LBH; PNKD; SLPI; SIRPB1; LOC389386; REC8; GNLY; GNLY; FOLR3; LOC730286; SKAP1; SELP; DHX30; KIAA1618; NQO2; ANKRD46; LOC646301; LOC400464; LOC100134703; C20orf106; SLC25A38; YPEL1; IL1R1; EPHA1; CHD6; LIMK2; LOC643733; LOC441550; MGC3020; ANKRD9; NOD2; MCTP1; BANK1; ZNF30; FBXO7; FBXO7; ABLIM1; LAMP3; CEBPE; LOC646909; BCL11B; TRIM58; SAMD3; SAMD3; MYOF; TTPAL; LOC642934; FLJ32255; LOC642073; CAMKK2; OAS2; RASGRP1; CAPG; LOC648343; CETP; CETP; CXCR7; UBASH3A; LOC284648; IL1R2; AGK; GTPBP8; LEF1; LEF1; GPR109A; IF135; IRF7; IRF7; SP4; IL2RB; ABLIM1; TAPBP; MAL; TCEA3; KREMEN1; KREMEN1; VNN1; GBP1; GBP1; UBE2C; DET1; ANKRD36; DEFA4; GCH1; IL7R; TMCO3; FBXO6; LACTB; LOC730953; LOC285296; IL18R1; PRR5; LOC400061; TSEN2; MGC15763; SH3YL1; ZNF337; AFF3; TYMS; ZCCHC14; SLC6A12; LY6E; KLF12; LOC100132317; TYW3; BTLA; SLC24A4; NCALD; ORAI2; ITGB3BP; GYPE; DOCKS; RASGRP4; LOC339290; PRF1; TGFBR3; LGALS9; LGALS9; BATF2; MGC57346; TXK; DHX58; EPB41L3; LOC100132499; LOC100129674; GDPD5; ACP2; C3AR1; APOB48R; UTRN; SLC2A14; CLEC4D; PKM2; CDCA5; CACNA1E; OSBPL3; SLC22A15; VPREB3; LOC642780; MEGF6; LOC93622; PFAS; LOC729389; CREBZF; IMPDH1; DHRS3; AXIN2; DDX60L; TMTC1; ABCA2; CEACAM1; CEACAM1; FLJ42957; SIAH2; DDAH2; C13orf18; TAGLN; LCN2; RELB; NR1I2; BEND7; PIK3C2B; IF16; DUT; SETD6; LOC100131572; TNRC6A; LOC399744; MAPK13; TAP2; CCDC15; TncRNA; SIPA1L2; HIST1H4E; PTPRE; ELANE; TGM2; ARSD; LOC651451; CYFIP1; CYFIP1; LOC642255; ASCC2; ZNF827; STAB1; LMNB1; MAP4K1; PSMB9; ATF3; CPEB4; ATP5S; CD5; SYTL2; H2AFJ; HP; SORT1; KLHL18; HIST1H2BK; KRTAP19-6; RNASE2; LOC100134393; C11orf82; BLK; CD160; LOC100128460; CD19; ZNF438; MBNL3; MBNL3; LOC729010; NAGA; FCER1A; C6orf25; SLC22A4; LOC729686; CTSL1; BCL11A; ACTA2; KIAA1632; UBE2C; CASP4; SLC22A4; SFT2D2; TLR2; C10orf105; EIF2AK2; TATDN1; RAB24; FAH; DISC1; LOC641848; ARG1; LCK; WDFY3; RNF165; MLKL; LOC100132673; ANKDD1A; MSRB3; LOC100134379; MEFV; C12orf57; CCDC102A; LOC731777; LOC729040; TBC1D8; KLRF1; KLRF1; ABCA1; LOC650761; LOC653867; LOC648710; SLC2A11; LOC652578; GPR114; MANSC1; MANSC1; DGKA; LIN7A; ITPRIPL2; ANO9; KCNJ15; KCNJ15; LOC389386; LOC100132960; LOC643332; SFI1; ABCE1; ABCE1; SERPINA1; OR2W3; ABI3; LOC400759; LOC728519; LOC654053; LOC649553; HSD17B8; C16orf30; GADD45G; TPST1; GNG7; SV2A; LOC649946; LOC100129697; RARRES3; C8orf83; TNFSF13B; SNRPD3; LOC645232; PI3; WDFY1; LOC100133678; BAMBI; POPS; TARBP1; IRAK3; ZNF7; NLRC4; SKAP1; GAS7; C12orf29; KLRD1; ABHD15; CCDC146; CASP5; AARS2; LOC642103; LOC730385; GAR1; MAF; ARAP2; C16orf7; HLA-C; FLJ22662; DACH1; CRY1; CRY1; LRRC25; KIAA0564; UPF3A; MARCO; SRPRB; MAD1L1; LOC653610; P4HTM; CCL4L1; LAPTM4B; MAPK14; CD96; TLR7; KCNMB1; P2RX7; LOC650140; LOC791120; LTF; C3orf75; GPX7; SPRYD5; EEF1B2; CTDSPL; HIST2H2BE; SLC38A1; AIM2; LOC100130904; LOC650546; P2RY10; ILSRA; MMP8; LOC100128485; RPS23; HDAC7; GUCY1A3; TGFA; NAIP; NAIP; NELL2; SIDT1; SLAMF1; MAPK14; CCR3; MKNK1; D4S234E; NBN; LOC654346; FGFBP2; BTLA; LRRN3; MT2A; LOC728790; LOC646672; NTN3; CD8A; CD8A; ZBP1; LDOC1L; CHM; LOC440731; LOC100131787; TNFRSF10C; LOC651612; STX11; LOC100128060; C1QB; PVRL2; ZMYND15; TRAPPC2P1; SECTM1; TRAT1; CAMKK2; CXCR5; CD163; FAS; RPL12P6; LOC100134734; CD36; FCGR1B; NR3C2; CSGALNACT2; GATA2; EBI2; EBI2; FKBP5; CRISPLD2; LOC152195; LOC100132199; DGAT2; SCML1; LSS; CIITA; SAP30; TLR5; NAMPT; GZMK; CARD17; INCA; MSL3L1; CD8A; MIIP; SRPK1; SLC6A6; C10orf119; C17orf60; LOC642816; AKR1C3; LHFPL2; CR1; KIAA1026; CCDC91; FAM102A; FAM102A; UPRT; PLEKHA1; CACNA2D3; DDX10; RPL23A; C2orf44; LSP1; C7orf53; DNAJC5; SLAIN1; CDKN1C; HIATL1; CRELD1; ZNHIT6; TIFA; ARL4C; PIGU; MEF2A; PIK3CB; CDK5RAP2; FLNB; GRAP; BATF; CYP4F3; KIR2DL3; C19orf59; NRG1; PPP2R2B; CDK5RAP2; PLSCR1; UBL7; HES4; ZNF256; DKFZp761E198; SAMD14; BAG3; PARP14; MS4A7; ECHDC3; OCIAD2; LOC90925; RGL4; PARP9; PARP9; CD151; SAAL1; LOC388076; SIGLEC5; LRIG1; PTGDR; PTGDR; NBPF8; NHS; ACSL1; HK3; SNX20; F2RL1; F2RL1; PARP12; LOC441506; MFGE8; SERPINA10; FAM69A; IL4R; KIAA1671; OAS3; PRR5; TMEM194; MS4A1; MTHFD2; LOC400793; CEACAM1; APP; RRBP1; SLCO4C1; XAF1; XAF1; SLC2A6; ZNF831; ZNF831; POLR1C; GLT1D1; VDR; IFIT5; SNHG8; TOP1MT; UPP1; SYTL2; LOC440359; KLRB1; MTMR3; S1PR1; FYB; CDC20; MEX3C; FAM168B; SLC4A7; CD79B; FAM84B; LOC100134688; LOC651738; PLAGL1; TIMM10; LOC641710; TRAF5; TAP1; FCRL2; SRC; RALGAPA1; OCIAD2; PON2; LOC730029; LOC100134768; LOC100134241; LOC26010; PLA2G12A; BACH1; DSC1; NOB1; LOC645693; LOC643313; BTBD11; REPS2; ZNF23; C18orf55; APOL2; APOL2; PASK; FER1L3; U2AF1; LOC285359; SIGLEC14; ARL1; C19orf62; NCR3; HOXB2; RNF135; IFIT1; KLF12; LILRB2; LOC728835; GSN; LOC100008589; LOC100008589; FLJ14213; SH2D3C; LOC100133177; HIST2H2AB; KIAA1618; C21orf2; CREB5; FAS; RSAD2; ANPEP; C14orf179; TXNL4B; MYL9; MYL9; LOC100130828; LOC391019; ITGA2B; KLRC3; RASGRP2; NDST1; LOC388344; IF16; OAS1; OAS1; TRIM10; LIMK2; LIMK2; ATP5S; SMARCD3; PHC2; SOX8; LCK; SAMD9L; EHBP1; E2F2; CEACAM6; LOC100132394; LOC728014; LOC728014; SIRPG; OPLAH; FTHL2; CXorf21; CACNG6; C11orf75; LY9; LILRB4; STAT2; RAB20; SOCS1; PLOD2; UGDH; MAK16; ITGB3; DHRS9; PLEKHF1; ASAP1IT1; PSME2; LOC100128269; ALX1; BAK1; XPO4; CD247; FAM43A; ICOS; ISG15; HIST2H2AA4; CD79A; SLC25A4; TMEM158; GPR18; LAP3; TNFSF13B; TC2N; HSF2; CD7; C20orf3; HLA-DRB3; SESN1; LOC347376; P2RY14; P2RY14; P2RY14; CYP1B1; IFIT3; IFIT3; RPL13L; LOC729423; DBN1; TTC27; DPH5; GPR141; RBBP8; LOC654350; SLC30A1; PRSS23; JAM3; GNPDA2; IL7R; ACAD11; LOC642788; ALPK1; LOC439949; BCAT1; ATPGD1; TREML1; PECR; SPATA13; MAN1C1; ID01; TSEN54; SCRN1; LOC441193; LOC202134; KIAA0319L; MOSC1; PFKFB3; GNB4; ANKRD22; PROS1; CD40LG; RIOK2; AFF1; HIST1H3D; SLC26A8; SLC26A8; RNASE3; UBE2L6; UBE2L6; SSH1; KRBA1; SLC25A23; DTX3L; DOK3; SULT1B1; RASGRP4; ALOX15B; ADM; LOC391825; LOC730234; HIST2H2AA3; HIST2H2AA3; LIMK2; MMRN1; FKBP1A; GYG1; ASF1A; CD248; CD3G; DEFA1; EPHX2; CST7; ABLIM3; ANKRD55; SLC45A3; RAB33B; LILRA6; LILRA6; SPTLC2; CDA; PGD; LOC100130769; ECHDC2; KIF20B; B3GNT8; PYHIN1; LBH; LBH; BPI; GAR1; ST3GAL4; TMEM19; DHRS12; DHRS12; FAM26F; FCRLA; OSBPL7; CTSB; ALDH1A1; SRRD; TOLLIP; ICAM1; LAX1; CASP7; ZDHHC19; LOC732371; DENND1A; EMR2; LOC643308; ADA; LOC646527; LOC643313; GZMB; OLIG2; HLA-DPB1; MX1; THOC3; TRPM6; GK; JAK2; ARHGEF11; ARHGEF11; HOMER2; TACSTD2; CA4; GAA; IFITM3; CLYBL; CLYBL; MME; ZNF408; STAT1; STAT1; PNPLA7; INDO; PDZD8; PDGFD; CTSL1; HOMER3; CEP78; SBK1; ALG9; IL1R2; RAB40B; MMP23B; PGLYRP1; UHRF1; IF144L; PARP10; PARP10; GOLGA8A; CCR7; HEMGN; TCF7; CLUAP1; LOC390735; LOC641849; TYMP; DEFA1B; DEFA1B; DEFA1B; REPS2; REPS2; OSBPL1A; C11orf1; MCTP2; EMR4; LOC653316; FCRL6; MRPS26; RHOBTB3; DIRC2; CD27; PLEKHG4; CDH6; C4orf23; HIST2H2AC; SLC7A6; SLC7A6; SLAMF6; RETN; FAIM3; TMEM99; LOC728411; TMEM194A; NAPEPLD; ACOX1; CTLA4; SCO2; STK3; FLT3LG; VASP; FBXO31; TDRD9; TDRD9; LOC646144; NUSAP1; GPR97; GPR97; GPR97; EMR1; SLAMF6; CCDC106; ODF3B; LOC100129904; PADI4; LOC100132858; PIK3AP1; ZNF792; DIP2A; OSCAR; CLIC3; FANCE; TECPR2; P2RY10; ADORA3; IL18RAP; DEFA3; BRSK1; LOC647691; S1PR5; CPA3; BMX; DDX58; RHOBTB1; TNFRSF25; LOC730387; OLR1; HERC5; STAT1; NELF; STAP1; ZNF516; ARHGAP26; TIMP2; FCGR1A; RHOH; IF144; MTX3; CD74; LCK; TLR4; DSC2; CXorf45; ENPP4; CD300C; OASL; HPSE; MTHFD2; GSTM2; OLFM4; ABHD12B; LOC728417; LOC728417; FCAR; GTPBP3; KLF4; HOPX; THBD; HIST1H2BG; LOC730995; NOP56; ZBTB9; NLRC3; LOC100134083; COP1; CARD16; SP140; CD96; POLD2; IL32; LOC728744; FZD2; ZAP70; PYHIN1; SCARF1; IF127; PFKFB2; PAM; WARS; TCN1; LOC649839; MMP9; TMEM194A; TAP2; C17orf87; LOC728650; PNMA3; CPT1B; LTBP3; CCDC34; PRAGMIN; C9orf91; SMPDL3A; GPR56; C14orf147; SMARCD3; FAM119A; LOC642334; ENOSF1; FAR2; LOC441763; TESC; CECR6; KIAA1598; GPR109B; LRRN3; RNF213; ASGR2; ASGR2; ZSCAN18; MCOLN2; IFIT2; PLCH2; MAP7; GBP4; MGMT; GAL3ST4; C2orf89; TXNDC3; IFIH1; PRRG4; LOC641693; LOC728093; TNFAIP8L1; AP3M2; BACH2; BACH2; C9orf123; CACNA1I; LOC100132287; CAMK1D; ANKRD33; CCR6; ALDH1A1; LOC100132797; CD163; ESAM; FCAR; TCN2; CD6; CD3E; CCDC76; MS4A1; IFIT1; MED13L; SLC26A8; NOV; FLJ20035; UGT1A3; LOC653600; LOC642684; KIAA0319L; KLRD1; TRIM22; C4orf18; TSPAN3; TSPAN3; DNAJC3; AGTRAP; LOC646786; NCALD; TTC25; TSPAN5; ZNF559; NFKB2; LOC652616; HLA-DOA; WARS; GBP2; AUTS2; IGF2BP3; OASL; DYSF; FLJ43093; MS4A14; TGFB1I1; RAD51C; CALD1; LOC730281; MUC1; C14orf124; RPL14; APOL6; KCTD12; ITGAX; IFIT3; LPCAT2; ZNF529; AGTRAP; LOC402112; LOC100134822; SH2D1B; MPO; LOC100131967; LOC440459; FAM44B; ACOT9; LOC729915; PDZK1IP1; S100A12; RAB3IL1; TMEM204; CXCL10; TSR1; MXD3; LILRA5; CKAP4; C6orf190; ECGF1; LDLRAP1; GRB10; FCRL3; LOC731275; ZFP91; BCL6; SAMD3; LOC647436; CLC; GK; LOC100133565; OAS2; LOC644937; SIRPD; GPBAR1; GNL3; CD79B; ELF2; GAA; CD47; NMT2; MATR3; TMEM107; GCM1; RORA; MGAM; LOC100132491; KRT72; SEPT04; ACADVL; ANXA3; MEGF9; MEGF9; PTPRJ; HLA-DRB4; FFAR2; PML; HLA-DQA1; CEACAM8; SH3KBP1; TRPM2; CUX1; SUV39H1; USF1; VAPA; ALOX15; CD79A; DPRXP4; LOC652750; ECM1; ST6GAL1; KLHL3; RTP4; FAM179A; HDC; SACS; C9orf72; C9orf72; LOC652726; PVRIG; PPP1R16B; NSUN7; NSUN7; ZNF783; LOC441013; LOC100129343; OSM; UNC93B1; DNAJC30; FLJ14166; C9orf72; SAMD4A; F5; PARP15; PAFAH2; COL17A1; TYMP; LOC389672; ABCB1; LOC644852; TARP; SLAMF7; FRMD3; LOC648984; PLAUR; LOC100132119; KLRG1; INTS2; MYC; HIST1H4H; C9orf45; GBP6; KIFAP3; HSPC159; SOCS3; GOLGA8B; LOC100133583; ARL4A; ASNS; ITGAX; LOC153561; GSTM1; OAS2; OAS2; TRIM25; ABHD14A; LOC642342; GPR56; C4orf18; AK1; PIK3R6; HSPE1; ASPHD2; DHRS9; GRN; BOAT; LOC100134300; SDSL; TNFAIP6; LOC402176; LOC441019; FAM134B; ZNF573, GGGGTAACACAGAGTGCCCTTATGAAGGAGTTGGAGATCCTgcaaggaag (SEQ ID NO.:69); AAACCCGTCACCCAGATCGTCAGCGCCGAGGCCTGGGGTAGAGCAGGTGA (SEQ ID NO.:87); TGTTCTTCCCCATGTCCTGGATGCCACTGGAAGTGCACACTGCTTGTATG (SEQ ID NO.:93); CCCTGGAAAGCTCCCCGACAACCTCCACTGCCATTACCCACTAGGCAAGT (SEQ ID NO.:95); CCTCCAGTGGTTTAGGCAGGACCCTGGGAAAGGTCTCACATCTCTGTTGC (SEQ ID NO.:174); GCACCATGCATGGAGTCAGCCATTTCTCTAGGAACCTTGATTCCTGTCTG (SEQ ID NO.:193); CCCCACGCCTGTTTGTATTGGGAGCTCTGGACCAATAGTGTCTCTCCTAG (SEQ ID NO.:196); CCAGCCACTCTACTCAAGGGGCATATATTTTGGCATGAGGTGGGATAGAG (SEQ ID NO.:240); gcatgtgtatgatgtgtgtgcgtcggaccgcttctaggctactaagtgtc (SEQ ID NO.:257); AGGGGCAGTATACTCTTATCAGTGCGAGGTAGCTGGGGCCTGTGATAGTT (SEQ ID NO.:299); CAAGCCTGGCAGTAAATCCGAATATCCAGAACCCTGACCCTGCCGTGTAC (SEQ ID NO.:319); CAGCATGTAGGGCAGTGCTTGCACGTAGCATCTGGTGCCTAACCAGTGTT (SEQ ID NO.:336); CTGAGGTTATGTACAACCAACTCTCAGAATTCAGACTTCCTGCAGCTGCC (SEQ ID NO.:370); GTAGGCCCCCAAAGTGCCGTCTTTCCCTAGCATTTTACTCAATGTTTGCC (SEQ ID NO.:392); GAATCAAGGAGGTCAAGTAAGGTCACAGGGGCACTTGGGTTGAGCCAGGG (SEQ ID NO.:437); CCCCAGATGGTTCCAAATATTCCTTACCTCGTTTGGTTCCCAAGTCACAG (SEQ ID NO.:450); GAATAGAAACCAGACAGCAATTCTTTAGTTCCAGCCACCATTCGCCCCAC (SEQ ID NO.:454); TCAACAAAGAGGTGCTGACCTGAGAGTAGGGCACATAACCTCAGCCACTG (SEQ ID NO.:471); ATGTAGATGGGGAGTGACCACCGCCAACAGAAGTGTGGCCATCTTGCCCG (SEQ ID NO.:535); CTTTGGGCACCATTTGGATATAGTTAGTGGTGGTTTAGCTATGGCGTTCC (SEQ ID NO.:609); GGCAAATTCCGGGTATGCACTCAACTTCGGCAAAGGCACCTCGCTGTTGG (SEQ ID NO.:637); GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.:754); AGTAAACCCATATATCCAGAACCCTGACCCTGCCGTGTACCAGCTGAGAG (SEQ ID NO.:800); CCTGTGGCAAGCCAGCAAGATGGCCCTGGTGACAGCAAAAGAAACTGCAC (SEQ ID NO.:837); CCAGGTGCCGCCCACTCTTGACGTGATACTTACCGTCAATGCTCCTTACC (SEQ ID NO.:876); GCCTAAACCAGGTATGCCAATCTGTCTTGTGTCCACATACTAACAGAGGG (SEQ ID NO.:924); AGCCAAGACAGCAGCTCTACATCCTTACCTAGGTAATTCAGGCATGCGCC (SEQ ID NO.:947); CACATGGCAAATGCCTCCTTTCACAATAGAGCATGGTGCTGTTTCCTCAC (SEQ ID NO.:954); TATTGCAGCCATCCATCTTGGGGGCTCATCCATCACACCCGGGTTGCTAG (SEQ ID NO.:1010); CTGGGCTGTGGTATTTGGGTGATCTTTACATTCTTCAGACTCATGTGTGT (SEQ ID NO.:1035); GCTACAAACAAGCTCATCTTTGGAACTGGCACTCTGCTTGCTGTCCAGCC (SEQ ID NO.:1081); CCTACTCCTACAGTGCCTTGCATTCCGTAGCTGCTCAGTACATTAACCCA (SEQ ID NO.:1116); CAGGGTATGAAAGTGCCCATTTCTAGCCAACATTAGATACCCTCAGTCTC (SEQ ID NO.:1157); TGGCCACATTTGTCTCAAACTCAAGTCTACACATTTCTCTCTCTTTTCCC (SEQ ID NO.:1227); GTACCGTCAGCAACCTGGACAGAGCCTGACACTGATCGCAACTGCAAATC (SEQ ID NO.:1276); and Gccccctaattgactgaatggaacccctcttgaccaaagtgaccccagaa (SEQ ID NO.:1379).",
        "28. The method of claim 25, further comprising the step of differentiating between sarcoidosis and tuberculosis, lung cancer or pneumonia by determining the expression levels of the following genes, markers, or probes: PHF20L1; LOC400304; SELM; DPM2; RPLP1; SF1; ZNF683; CTTN; PTCRA; SNORA28; RPGRIP1; GPR160; PPIA; DNASE1L1; HEMGN; RAB13; NFIA; LOC728843; LOC100134660; LOC100132564; HIP1; PRMT1; PDGFC; NCRNA00085; NFATC3; GIMAP7; LOC100130905; AKAP7; TLE3; NRSN2; RPL37; CSTA; C20orf107; TMEM169; GCAT; TMEM176A; CMTM5; C3orf26; FANCD2; C9orf114; TIAM2; LOC644615; PADI2; GRINA; CHST13; ANGPT1; KIF27; ZNF550; PIK3C2A; NR1H3; ALG8; SLC2A5; ITGB5; OPN3; UBE2O; RIN3; LOC100129203; B3GNT1; NEK8; SLC38A5; GPR183; LOC728748; LOC646966; FAM159A; LOC441073; CCNC; MRPL9; SLC37A1; NSUN5; GHRL; ALAS2; MPZL2; RNF13; SUMO1P1; UHRF2; RNY4; LOC651524; ZNF224; OLIG1; TNFRSF4; BEND7; LOC728323; ARHGAP24; CCCTGCCCTCATGTTGCTTTGGGTCTAGTGGAGGAGAGAGACAGATAAGC (SEQ ID NO.:1447); CAAGTTCTTAACCATCCCGGGTTCCAGTGGTTACAGAGTTCTGCCCTGGG; (SEQ ID NO.:1448) and TGCATGAGATCACACAACTAGGCGGTGACTGAGTCCAACACACCAAAGCC (SEQ ID NO.:1449).",
        "29. The method of claim 25, further comprising the step of differentiating between sarcoidosis that is active and sarcoidosis that is inactive by determining the expression levels of the following genes, markers, or probes: LOC442132; HOXA1; LOC652102; PPIE; C22orf27; TEX10; LMTK2; LOC283663; SUCNR1; COLQ; HLA-DOB; SAMSN1; INPP5E; CYP4F3; CRYZ; CDC14A; LOC653061; KIR2DL4; PCYOX1L; TCEAL3; FRRS1; PHF17; PDK4; LOC440313; ZNF260; SLFN13; VASH1; GM2A; ASAP2; VARS2; RPL14; KIR2DL1; SBDSP; S1PR3; and METTL1; CCAGGAGGCCGAACACTTCTTTCTGCTTTCTTGACATCCGCTCACCAGGC (SEQ ID NO.:1452), and TTCCAGGGCACGAGTTCGAGGCCAGCCTGGTCCACATGGGTCGGaaaaaa (SEQ ID NO.:1451).",
        "30. The method of claim 25, further comprising the step of using 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 144, 150, 200, 250, 300, 400, 500, 600, 700, 800, 900, 1,000, 1,100, 1,200, 1,300, 1,400, or 1,446 genes selected from SEQ ID NOS.: 1 to 1446 to determine if the patient has at least one of tuberculosis, sarcoidosis, cancer or pneumonia.",
        "31. A method for determining the effectiveness of a treating a sarcoidosis patient comprising:\nobtaining a sample from a subject suspected of having a pulmonary disease;\ndetermining the expression level of 3, 4, 5, 6 or more genes selected from IL1R2; GRB10; CEACAM4; SIPA1L2; BMX; IL1RAP; REPS2; ANXA3; MMP9; PHC2; HAUS4; DUSP1; CA4; SAMSN1; KLHL2; ACSL1; NSUN7; IL18RAP; GNG10; SMAP2; MGAM; LIN7A; IRAK3; USP10; CEBPD; TGFA; FOS; MANSC1; SLC26A8; ROPN1L; GPR97; NAMPT; MRVI1; KCNJ15; KLHL8; GNG10; MEGF9; GPR160; B4GALT5; STEAP4; LRG1; F5; PHTF1; HMGB2; DGAT2; SLC11A1; QPCT; PANX2; GPR141; or LMNB1; wherein overexpression of the genes is indicative of a reduction in sarcoidosis.",
        "32. A method of identifying a subject with a pulmonary disease comprising:\nobtaining a sample from a subject suspected of having a pulmonary disease;\ndetermining the expression level of six or more genes from each of the following genes selected from: UBE2J2; ALPL; JMJD6; FCER1G; LILRA5; LY96; FCGR1C; C10orf33; GPR109B; PROK2; PIM3; SH3GLB1; DUSP3; PPAP2C; SLPI; MCTP1; KIF1B; FLJ32255; BAGE5; IFITM1; GPR109A; IF135; LOC653591; KREMEN1; IL18R1; CACNA1E; ABCA2; CEACAM1; MXD4; TncRNA; LMNB1; H2AFJ; HP; ZNF438; FCER1A; SLC22A4; DISC1; MEFV; ABCA1; ITPRIPL2; KCNJ15; LOC728519; ERLIN1; NLRC4; B4GALT5; LOC653610; HIST2H2BE; AIM2; P2RY10; CCR3; EMR4P; NTN3; C1QB; TAOK1; FCGR1B; GATA2; FKBP5; DGAT2; TLR5; CARD17; INCA; MSL3L1; ESPN; LOC645159; C19orf59; CDK5RAP2; PLSCR1; RGL4; IFI30; LOC641710; GAGGCTTTCAGGTAGGAGGACAATGGTAGCACTGTAGGTCCCCAGTGTCG (SEQ ID NO.: 754); LOC100008589; LOC100008589; SMARCD3; NGFRAP1; LOC100132394; OPLAH; CACNG6; LILRB4; HIST2H2AA4; CYP1B1; PGS1; SPATA13; PFKFB3; HIST1H3D; SNORA73B; SLC26A8; SULT1B1; ADM; HIST2H2AA3; HIST2H2AA3; GYG1; CST7; EMR4; LILRA6; MEF2D; IFITM3; MSL3; DHRS13; EMR4; C16orf57; HIST2H2AC; EEF1D; TDRD9; GPR97; ZNF792; LOC100134364; SRGAP3; FCGR1A; HPSE; LOC728417; LOC728417; MIR21; HIST1H2BG; COP1; SMARCD3; LOC441763; ZSCAN18; GNG8; MTRF1L; ANKRD33; PLAC8; PLAC8; SLC26A8; AGTRAP; FLJ43093; LPCAT2; AGTRAP; S100A12; SVIL; LILRA5; LILRA5; ZFP91; CLC; LOC100133565; LTB4R; SEPT04; ANXA3; BHLHB2; IL4R; IFNAR1; MAZ; gccccctaattgactgaatggaacccctcttgaccaaagtgaccccagaa (SEQ ID NO.: 1379);\ncomparing the expression level of the 3, 4, 5, 6 or more genes with the expression level of the same genes from individuals not afflicted with a pulmonary disease, and\ndetermining the level of expression of the six or more genes in the sample from the subject relative to the samples from individuals not afflicted with a pulmonary disease for the genes expressed in the one or more expression pathways, selected from: EIF2 signaling and mTOR signaling pathways are indicative of active sarcoidosis; co-expression of genes in the regulation of eIF4 and p70s6K signaling pathways is indicative of pneumonia; co-expression of genes in the interferon signaling and antigen presentation pathways are indicative of tuberculosis; and co-expression of genes in the T cell signaling pathways; and other signaling pathways is indicative of lung cancer.",
        "33. The method of claim 32, wherein the genes that are downregulated are selected from MEF2D; BHLHB2; CLC; FCER1A; SRGAP3; FLJ43093; CCR3; EMR4; ZNF792; C10orf33; CACNG6; P2RY10; GATA2; EMR4P; ESPN; EMR4; MXD4; and ZSCAN18.",
        "34. The method of claim 32, further comprising a method for displaying if the patient has tuberculosis, sarcoidosis, cancer or pneumonia by aggregating the expression data from the six or more genes into a single visual display of a vector of expression for tuberculosis, sarcoidosis, cancer or pneumonia.",
        "35. The method of claim 32, further comprising the step of detecting and evaluating 7, 8, 9, 10, 12, 15, 20, 25, 35, 50, 75, 90, 100, 125, or 144 genes for the analysis.",
        "36. The method of claim 32, wherein the sample is a blood, peripheral blood mononuclear cells, sputum, or lung biopsy.",
        "37. The method of claim 32, wherein the expression level comprises an mRNA expression level and is quantitated by a method selected from the group consisting of polymerase chain reaction, real time polymerase chain reaction, reverse transcriptase polymerase chain reaction, hybridization, probe hybridization and gene expression array.",
        "38. The method of claim 32, wherein the expression level is determined using at least one technique selected from polymerase chain reaction, heteroduplex analysis, single stand conformational polymorphism analysis, ligase chain reaction, comparative genome hybridization, Southern blotting, Northern blotting, Western blotting, enzyme-linked immunosorbent assay, fluorescent resonance energy-transfer and sequencing.",
        "39. The method of claim 32, wherein the expression level is determined by microarray analysis that comprises use of oligonucleotides that hybridize to mRNA transcripts or cDNAs for the six or more genes, and wherein the oligonucleotides are disposed or directly synthesized on the surface of a chip or wafer.",
        "40. The method of claim 39, wherein the oligonucleotides are about 10 to about 50 nucleotides in length.",
        "41. The method of claim 32, further comprising the step of using the determined comparative gene product information to formulate at least one of diagnosis, a prognosis or a treatment plan.",
        "42. The method of claim 32, wherein the patient's disease state is further determined by radiological analysis of the patient's lungs.",
        "43. The method of claim 32, further comprising the step of determining a treated patient gene expression dataset after the patient has been treated and determining if the treated patient gene expression dataset has returned to a normal gene or a changed gene expression dataset thereby determining if the patient has been treated.",
        "44. The method of claim 32, wherein a non-overlapping set of genes is used to distinguish between Tb, sarcoidosis, pneumonia and lung cancer, versus, Tb, active sarcoidosis, non-active sarcoidosis, pneumonia and lung cancer are selected from Table 11, 12 or both.",
        "45. A computer readable medium comprising computer-executable instructions for performing the method of claim 1."
    ]
}