{
    "id": "https://semopenalex.org/work/W4362699142",
    "authors": [
        "Tajamul Hussain",
        "Salman A. Alrokayan",
        "Salman Alamery",
        "Fouzi Mouffouk",
        "Haseeb A. Khan",
        "Khalid M. Abu‐Salah"
    ],
    "title": "Self-Assembled Copolymeric Nanowires as a New Class of 3D Scaffold for Stem Cells Growth and Proliferation",
    "date": "2023-04-06",
    "abstract": "Stem cell therapy has emerged as the most vibrant area of research, due to the capacity of stem cells for self-renewal and differentiation into different types of cell lines upon their culture. But lately, scientists become increasingly aware of the limitations of conventional 2D culture and stem cell culture media, due to several key drawbacks associated with this model, such as immune response upon transplantation, animal pathogen contamination, and complication, during developmental studies due to undefined factors in the cultural media. In this study, an attempt has been made to develop a new type of polymeric 3D scaffold based on the self-assembly of a star-like amphiphilic copolymer of poly(caprolactone)–poly(ethylene oxide) unit into nanowires (nanofibers), that have a scale similar to the native extracellular matrix and are capable of mimicking the extracellular microenvironment where the functional properties of stem cells can be observed and manipulated. The obtained data showed that polymeric-based nanofibers can be used as a 3D scaffold for mouse embryonic stem cells (mESCs) growth without losing their stem cell phenotype. The results obtained suggest that the polymeric 3D scaffolds (nanofibers) not only support stem cells’ growth and proliferation but also preserve the mESC pluripotency.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Polymeric nanofibers represent an exciting class of materials that has drawn substantial attention recently, particularly in the field of stem cell and tissue engineering. Such emphasis can be interpreted by the ability of these materials to mimic the arrangement of fibers and fibrils of the extracellular matrix (ECM), making them suitable for a wide range of medical applications, in particular stem cell-based tissue engineering and medical textile materials [1]. Increasingly, researchers believe that stem cell technology has the potential to drastically change our approach concerning disease treatment [2,3]. Unfortunately, stem cells are very sensitive to micro and nanoenvironment changes, which make finding a material that mimics the embryonic stem cell niche properly a major challenge. During the past few years, many attempts have been made to build an appropriate artificial scaffold that mimics the stem cell niche and allows a better understanding and improvement of stem cell therapies. For instance, Webster et al. [4] demonstrated the ability of carbon nanotubes in a polymer matrix to support orthopedic implants and neuronal cell growth and function. When different cell types are cultured on carbon nanofibers reinforced polycarbonate urethane composite, they can result in an increase in neuronal cell numbers and the case of osteoblast cells, further bone-forming. Despite the huge success of this system, the fate of carbon nanotubes remains unclear due to safety concerns that these materials still present in terms of toxicity, biocompatibility, and biodegradability [5].",
                "Self-assembled peptide-based animal sources into nanofibrillar materials have been widely investigated recently for selective application, such as differentiation and growth in both in vitro and in vivo for a wide range of cells, such as neural progenitor cells [6,7], primary bovine pulmonary artery endothelial cells [8], mouse osteoblastic cells [9], and human mesenchymal cells [10].",
                "A nanofiber network of a self-assembling RAD16-I peptide scaffold developed by Garreta et al. [11] proved to enhance the formation of an mES cell niche and remarkably enhance the frequency of Oct4 positive mES cell colonies compared to the ones cultured on the 2D system suggesting that the 3D-system culture condition enhanced the maintenance of cells with the embryonic phenotype in comparison with 2D scaffold. The 3D biomaterial-based scaffold mentioned earlier seems to have great potential; unfortunately, problems related to the formation of such constructs in living organisms have not yet been investigated in-depth. Also, the immunogenicity of such constructs still constitutes a hurdle difficult to overcome. Recently 3D scaffolds based on synthetic polymers gained a lot of intention mainly because of their biodegradability, biocompatibility, and flexibility in terms of functionalization with desired biomolecules. Also, polymeric materials can generate a more favorable microenvironment for stem cell development, by providing a complex network of nanofibers, gaps, and pores through which oxygen, hormones, and nutrients are delivered and waste products filtered away [12]. Nur-E-Kamal et al. [13] reported the construction of a 3D nanofibrillar surface composed of polyamide nanofibers (Ultra-Web) that can promote the proliferation and self-renewal of mES cells. Moreover, the alkaline phosphatase (ALP) staining of mES cell colonies revealed that stained colonies were significantly larger for mES cells cultured on Ultra-Web compared to the mES cells cultured on plain coverslips, which provides evidence that dimensionality plays an important role in maintaining stemness in proliferating mES cells. Ouyang et al. [14] showed the potential of poly(ethylene terephthalate) fibrous-based matrix to grow and maintain undifferentiated ES cells. The use of bioconjugate amphiphilic copolymers to generate 3D scaffolds for stem cell growth and differentiation is a fairly new concept when compared with what has been developed by other groups so far, especially in the field of stem cell biology and regenerative medicine. Therefore, the key advantage of this new synthetic structure over the existing 2D scaffolds is its ability to resemble a living body than any other cell culture system, which means that the new synthetic structure can provide a more conducive microenvironment for stem cell culture (or tissue engineering), which eliminates animal byproducts and their deleterious effects, normally occurring in traditional culture systems.",
                "Here, we report the synthesis of poly(caprolactone)-bpoly(ethylene oxide) star-polymer and the capability of this new biodegradable amphiphilic copolymer to be converted into a 3D scaffold (nanofiber network) through a molecular self-assembly process to support mouse embryonic stem cells (mESCs) growth and later their differentiation. In this study, we evaluated the capacity of the mesenchymal stem cells (mESCs) to adhere to fibronectin-conjugated nanofibers and proliferate without losing their stem cell phenotype. We have achieved this by measuring the proliferation of the cells and also quantifying the stem cell markers and cell pluripotency features."
            ],
            "subsections": []
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [
                "2.1. Reagents and Instruments. All reagents and solvents for synthesis were reagent grade and were used without further purification unless stated otherwise. Methacrylic acid (Fluka) was distilled at low pressure in a Büchi Glass Oven B-585 microdistiller before use. Azobisisobutyronitrile (AIBN) (Fluka) was recrystallized from methanol and dried under a vacuum at room temperature. GRGDS (Sigma) was dissolved in Mili-Q water to a concentration of 5 mg/ml. Polymer isolation and identification were performed as described in the reference. AIBN was purchased from Fluka, crystallized from methanol, and dried under vacuum at room temperature. Anhydrous sodium sulfate and hydrochloric acid were purchased from Panreac. Methanol for gel permeation chromatography (GPC) was Merck, highperformance liquid chromatography grade. For dialysis and GPC, Mili-Q water was used. The dialysis cassettes were Pierce Biotech, 10 k molecular weight cutoff. mESCs were purchased from Stem Cell Tech (MSC-001F all cells). The fetal bovine serum for mESCs qualified and Dulbecco's modified Eagle's medium with low glucose was purchased from Life Technologies. All experiments were carried out using the same batch number. RNA was extracted using RNeasy extraction Kit from Invitrogen. Primers were designed using the Invitrogen Custom DNA Oligos and purchased from Eurofins MWG/Operon. High-capacity cDNA reverse transcription kit and Fast SYBR Green Master Mix were obtained from Applied Biosystems (Carlsbad, USA). Quantitative PCR was carried out using the Fast Real-Time PCR System 7900HT. The CyQUANT ® Cell Proliferation Assay Kit was purchased from Molecular Probes, Invitrogen. Cell culture flasks and plates were purchased from Thermo Fisher. Polycaprolactone (PCL) (average M n ∼ 530) (0.68 mmol) and triethylamine (1.36 mmol) were dissolved in 150 ml dried tetrahydrofuran (THF). Then acryloyl chloride (1.36 mmol) was added slowly to the mixture at 0°C. The reaction was kept at 0°C for 5 hr, and then at 25°C for 2 days. The polymer was then precipitated by the addition of methanol and recovered via a filtration process and dried overnight, under vacuum, at 40°C. Poly(ethylene oxide) (PEG) (average M n ∼ 1,000) (0.68 mmol) and triethylamine (1.36 mmol) were dissolved in 150 ml dried THF. Then methyl acryloyl chloride (1.36 mmol) was added slowly to the mixture at 0°C. The reaction was kept at 0°C for 5 hr, and then at 25°C for 2 days. The polymer was then precipitated by the addition of methanol and recovered via filtration process and dried overnight, under vacuum, at 40°C. 2.4. ATRP Polymerization. Compound 1 (45 equivalents) was dissolved in 10 ml of THF. And 45 equivalents of both PCL macromonomers and PEG macromonomers (1 equivalent) of AIBN were added to the solution. After the mixture was heated to 60°C, under stirring, for 4 days. The flask was then cooled down, and 10 ml of THF was added to the mixture. The polymer was then separated from the supernatant by centrifugation at 15,000 RPM for 30 min, followed by decantation. This procedure was repeated twice to yield a white solid that was vacuum dried, at 30°C, for 24 hr. 1H NMR (DMSO) 1.12 (s,"
            ],
            "subsections": [
                {
                    "title": "PCL Macromonomer Synthesis.",
                    "paragraphs": [
                        "GPC analysis (PSSNa standards) reveals a monomodal molecular weight distribution; te = 23.07 min with an average M n (GPC, PSSNa standards) around 14 kDa, which has been confirmed with MALDI.",
                        "2.5. Bioconjugated with Fibronectin. Bioconjugation of PEG with fibronectin was performed as follows: 40 mg of PEGhydroxysuccinimide ester was added to a solution containing 10 μg of fibronectin in 0.1 M bicarbonate buffer (500 μl, pH = 8.3). The mixture was gently stirred for 5 days in slow tilt rotation at 4°C. 2.6. Polymeric Nanowires Formation. The assembly of copolymer into nanowire was achieved as follows: poly(caprolactone)-b-poly (ethylene oxide) star-polymer 100 mg with 30 mg PEGfibronectin was dissolved in dimethylformamide (DMF), the solution was then stirred for 3 hr. Deionized water will be added at a rate of 10 µl every 5 s for a total of 1.6 ml to induce the nanowire formation. The aqueous solution was then dialyzed against deionized water for 4 days. Throughout the last step, the synthetic amphiphilic copolymer undergoes selfassembly into well-ordered and homogenous soft nanowires, often 1-2 µm long and 30 nm diameter as characterized by transmission electron microscope (TEM). 2.7. Cell Cultivation. mESCs were seeded in 3 wells of a 6-well plate at 50,000 cells/well with poly(star)-fibronectin nanowires and left for 24 and 48 hr in culture. The cells were removed from the poly(star)-fibronectin nanowires by washing the nanowires with a medium. For control experiments, cells were seeded in mouse embryonic fibroblasts (MEFs) in 3 wells of a 6-well plate at 50,000 cells/well. The total number of cells and the viability of the cells were determined using propidium iodide incubation."
                    ],
                    "subsections": []
                },
                {
                    "title": "Proliferation and Viability",
                    "paragraphs": [
                        "Assays. The ability of the poly(star)-fibronectin nanowires to support mES cells in an undifferentiated state will be tested by evaluating the growth and viability of these cells along with their morphology. In this study, undifferentiated mESCs (50,000 cells/well) were seeded on 100, 50 μg/ml poly(star)-fibronectin nanowires and on MEFs in standard tissue culture grade polystyrene (TCPS) 6-well plate for 2 and 3 days. Flow cytometry was utilized to determine the total number of cells, and the viability of the cells was determined using propidium iodide incubation.",
                        "For the flow cytometry, the culture medium was removed, and then the cells were washed and trypsinized. The cells were collected in a polystyrene tube and then incubated with propidium iodide (5 μg/ml) before analysis by modular, benchtop flow cytometer from Becton Dickinson Immunocytometry System. The viability is the ratio between the number of viable cells and the total number of cells. Cell proliferation was determined as the ratio between viable cells and initial cell number.",
                        "2.9. Alkaline Phosphatase Assay. The pluripotency of mESCs was determined by ALP staining performed on day 3 of culture, using an Alkaline Phosphatase Live Stain (Thermo Fischer Scientist) in accordance with the manufacturer's manual. In brief, the cells were fixed with citrate/acetone/ formaldehyde solution for 4 min, and then washed twice with Milli-Q water, then cells are stained with ALP staining solution for 30 min and counterstained with hematoxylin for 4 min. The morphology of the colonies and ALP-positive cells was assessed with an inverted light microscope.",
                        "2.10. Cells Proliferation. Cells were cultivated in 3 wells of a 6-well plate at 0.5 × 10 6 with polymeric nanofibers and left for 24 and 48 hr in culture. The cells were detached from the polymeric nanofibers by washing off the nanofibers several times with a medium solution. For control experiments, cells were seeded in a monolayer without polymeric nanofibers in 3 wells of a 6-well plate at 0.5 × 10 6 . Cells were detached with trypsin and counted with trypan blue. Experiments were repeated at least three times."
                    ],
                    "subsections": []
                },
                {
                    "title": "Q-RT-PCR for Stem Cell and Cell Adhesion Markers.",
                    "paragraphs": [
                        "mESCs were cultivated at a density of 0.25 × 10E 6 per well on 6-well plates, with or without star-like amphiphilic copolymer of poly(caprolactone)-poly(ethylene oxide)-based nanofibers (3 wells each). The same number of cells was kept as a pellet at -80°C to be served as a control. The cells seeded without nanofibers were detached with trypsin. Cells were then centrifuged, and the pellet was resuspended in buffer RLT (which contains guanidine thiocyanate). Complementary DNA from each well was synthesized from 500 ng of RNA using high-capacity cDNA reverse transcription. Ten nanograms of cDNA were amplified with Syber Green and loaded in a Fast Real-Time PCR System 7900HT Light Cycler system (Roche). All samples were run in triplicate in 20 µl reactions. The standard PCR conditions were 12 min at 93°C, followed by 45 cycles at 93°C for 20 s, 60°C for 1 min, and 70°C for 40 s. Initial validations were carried out. Stem cell adhesion markers (HSPG2, CD29, and syndecan/CD138) and cell markers for MSC (Oct4, cKit, and CD105) were tested (Table 1 shows the sequence of the primers used). Expression levels of these six target genes were calculated by the comparative Ct method (2 -ΔΔCt formula), after being normalized to the Ct value of the beta-actin housekeeping gene. The levels of beta-actin were similar in all samples (data not shown)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results and Discussion",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Synthesis and Characterization of Block Copolymer",
                    "paragraphs": [
                        "Nanofibers. The goal of the present work was to develop a new artificial 3D scaffold to support stem cell growth by converting amphiphilic copolymers into a 3D network of nanowires using a molecular self-assembly process. The assembly of these copolymers into nanofiber was achieved as follows: poly(caprolactone)-b-poly(ethylene oxide) starpolymer (40 mg) were dissolved in DMF, and the solution was then stirred for 3 hr. Deionized water was added at a rate of 10 µl every 5 s for a total of 1.6 ml to induce the nanowire formation. The aqueous solution was then dialyzed against deionized water for 4 days. Throughout the last step, the synthetic amphiphilic copolymer, undergo self-assembly into wellordered and homogenous soft nanowires, often 1-2 µm long and 30 nm diameter (Figure 1(a)); at high concentration, these nanowires tend to be predisposed to form 3D scaffold with tiny gaps and pores (Figure 1(b)), through which oxygen, hormones, and nutrients can be delivered and waste products to be filtered away to increase in vivo like characteristic of these artificial structures [15]. To identify the mechanism by which these nanowires are fashioned, a series of experiments was conducted using TEM and a small single neutron diffraction technique. The data collected from these technics suggest that the building mechanism of the nanofiber assembly depends on many factors: the solvent-removal procedure, polymer concentration, polymer, and solvent nature. In general, the micellization of amphiphilic materials can be triggered during the dialyzed process (water removal), where slow removal of the organic phase provokes a micellization process that later leads to the formation of the nanowires. By using small-angle scattering instrument or small-angle neutron diffraction (SAND) analysis, we can observe the dependence of the nanowire formation rate on the ratio of water/organic solvent present in the solution, as depicted in Figure 2. The cylindrical shapes can be observed in a lower percentage of the organic solvent compared with water.",
                        "The impact of the polymer concentration was evaluated by SAND. A series of samples with different copolymer concentrations were prepared. As depicted in Figure 3, the neutron diffraction plots clearly show that the transition from spherical micelles to nanofibers depends heavily on the initial concentrations of the polymer. Therefore, the higher the polymer concentration in the solution, the faster the nanofiber formation. Furthermore, the transition of the copolymer macromolecules from spherical shapes to elongated nanofibers was probed by TEM, and the images show clearly, that samples with low concentration (0.1-0.20 mg/ml of the PCL-PEO+ DMF 15 mg/ml 0.15 ml DMF + 0.7 ml D2O (0.75 mg/ml) 0.1 ml DMF + 0.75 ml D2O (0.75 mg/ml) 0.05 ml DMF + 0.8 ml D2O (0.75 mg/ml)",
                        "FIGURE 2: Small-angle neutron diffraction (SAND) neutron diffraction plots of block copolymer in D2O at different concentrations of organic solvent/D2O. copolymer) do not contain any nanowire structures, except for polymeric micelles that appears to be the predominate geometrical form in these samples, however under certain condition such as long time storage, we observed the formation of some nanowire, and that is probably due to the reduction of the initial volume of the samples as a result of the evaporation factor or to a very slow micelles pileup process. However, when the concentration reached 0.7 mg/ml, we started to observe the formation of cylindrical-shaped micelles. The increase in polymer concentration provokes a significant increase in intermicelle interactions prompting a series of fusions between micelles (micelle stacking) that leads to the elongation of the cylindrical-shaped micelle into nanofibers (Figure 4), which become with time the dominant structures in the solution. It is also interesting to note that once the fibers are formed, they are stable in water even if overall polymer concentrations are below the critical fiber concentration, which is 0.7 mg/ml. The last factor that we believe has a big impact on the size and shape of the nanofibers is the molecular structure of the amphiphilic copolymer. It is well-known that the self-assembly of the amphiphilic copolymer into nanowires depends mainly on the weight fraction w of the hydrophilic block relative to the total copolymer molecular weight. For poly(ethylene oxide) (PEO)-based diblock in aqueous solution, where w EO ∼ 45%-55% leads to the assembly of main nanowires, but higher w gives predominantly spherical micelles, and lower w yields vesicles [16]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Fibronectin-Conjugated Fiber (Functionalized Fiber).",
                    "paragraphs": [
                        "Stem cells and developmental biologists have become increasingly aware of the limitations of conventional 2D stem cell culture, due to several key drawbacks of these systems. In this respect, copolymeric nanofibers covered with fibronectin may represent an alternative solution for these problems. The key advantage of this new synthetic structure, over the existing 2D systems, is its ability to be more like a living body than any other cell culture system, which means that the new synthetic structure can provide a more conducive microenvironment for stem cell growth. The first step toward the fabrication of this artificial scaffold is the synthesis of bioconjugated nanowires with fibronectin. Fibronectin is a cell-surface and serum-derived glycoprotein and has numerous effects on cells in vitro. At concentrations as low as 1-50 µg/ml, it can promote the adhesion, spreading, and migration of fibroblasts and certain other cells and induce transformed cells to flatten and appear normal. Additionally, fibronectin can influence the differentiation of chondrocytes and myoblasts. The preparation of bioconjugated nanowires with human fibronectin was carried out by conjugating PEG 20000 with the fibronectin to form PEG-fibronectin, followed by mixing PEG-fibronectin with the amphiphilic copolymer start with a ratio of 1-3.3. The resulting solution was then placed in a dialysis cassette and dialyzed against deionized water for 4 days at 4°C to yield a fibronectin-conjugated nanowire. To confirm the presence of fibronectin on the surface of the nanowires, fibronectinconjugated nanowires were first deposited on the surface of the petri dish, then a solution of amine-reactive fluorescent dye (Alexa Fluor ® 488 carboxylic acid, succinimidyl ester) was added to the petri dish and left for 4 hr, to allow the tethering reaction between the dye and the proteins to occur. After several washing, images of fibronectin conjugated nanowires were taken by fluorescence microscope. A control experiment was performed using block copolymer nanowires without fibronectin using the same procedure. As depicted in Figure 5, the fluorescence observed in Figure 5(b) confirms the bioconjugation of the nanowires with fibronectin. This fluorescence is indicative in contrast to its control showed no fluorescence activity was observed in the case of pure nanowires (Figure 5(c))."
                    ],
                    "subsections": []
                },
                {
                    "title": "Nanofibers Promote the Proliferation of mES Cells",
                    "paragraphs": [
                        "Colonies. To assess the poly(star)-fibronectin nanowires to sustain mESCs cultures, we investigated the poly(star)-fibronectin nanowire's ability to support mES cells adhesion and growth. Undifferentiated mES cells were cultured for 2 and 3 days on various concentrations of poly(star)-fibronectin nanowires and compared to cell cultures in MEFs, gelatin, and standard polystyrene as a control experiment. The morphology, viability, and proliferation of these cells were investigated. After 3 days of incubation on nanowires, the microscope visualization showed the appearance of a new colony with clear and defined borders, tightly packed and dome-shaped, similar to these colonies obtained with MEFs (Figure 6), which represents a good indication that these cells kept their pluripotency feature. In addition, the obtained results concern the mES cells' proliferation on the nanowires for 48 hr was similar to commercials culture media such as MEFs. This appears to indicate that the polymeric nanowires could be used as an Polymer + D2O 6.5 mg/ml 2.5 mg/ml 1.25 mg/ml 0.75 mg/ml 0.5 mg/ml 0.35 mg/ml 0.25 mg/ml 0.15 mg/ml 0.005 mg/ml  alternative to commercial culture media supporting mES cell growth.",
                        "To determine the long-term impact of poly(star)-fibronectin nanowires on mES cells in terms of pluripotency, an ALP test was carried out using cultured mES cells in 50 and 100 µg/ml of poly(star)-fibronectin nanowires and in control conditions. ALP staining indicated that ALP activity was present in all mES cells cultured on poly(star)-fibronectin nanowires independently of the time of culture (2 or 3 days). In fact, mES cells cultured on poly(star)-fibronectin nanowires resemble the colonies that form when mES cells are cultured on a monolayer of fibroblasts where all cells are ALP positive and colonies are dome-shaped (Figure 7). These results suggest that nanofibers can be used as an alternative to conventional gelatin to support the growth of undifferentiated ES cell cultures.",
                        "Quantitative RT-PCR was carried out to verify the effect of polymeric nanofiber on the cell adhesion markers and the expression of stem cell markers (Figure 8). Cells were characterized for these markers in both conditions. mESCs are reported to be positive for CD105, Oct4, and cKit [17]. Furthermore, cell adhesion markers HSPG2, CD29, and CD138 are directly engaged in cell adhesion. These markers promote cell attachment within the ECM [18]. Proteoglycans are considered essential constituents of the ECM that are involved in cell proliferation, differentiation, and gene  expression [19]. Cell marker CD29 was also reported to be expressed in the human MSCs [16]. Where CD138 was demonstrated to promote the proliferation of undifferentiated adipocyte progenitor and inhibit their adipogenic differentiation [20]. Figure 8 shows that all examined markers increased when cells were seeded with polymeric nanofiber at 24 and 48 hr. These data showed an increase in the expression of the stem cell markers (Oct4, cKit, and CD105)  and adhesion markers (proteoglycan, CD29, and syndecan/ CD138), although the decrease in CD138 and CD29 was not significant in cells grown in the polymeric nanofiber. However, a significant reduction in the expression of Oct4, CD138, and CD29 was observed in cells seeded in a monolayer and without polymeric nanofiber. These polymeric nanofibers 3D scaffolds delineate a promising tool for stem cell growth without compromising their stem cell markers. This will improve the adhesion of the cells in vivo when cells are transplanted to target organs. The increase in the cell adhesion markers expression improves the homing and the engraftment capacities of the cells within the targeted organ [21,22]. The number of cells forming aggregates was doubled in number (0.96 × 10E 6 ) in comparison to the seeding density (0.5 × 10E 6 ) (Figure 9). The viability of the cells at 48 hr forming aggregates with polymeric nanofiber was 94% compared with the viability of the cells grown without polymeric nanofiber and in monolayer (90%). Furthermore, the vast majority of the cells seeded were retrieved only by a series of washing with a medium instead of trypsinization, since the integrity of these polymeric nanofiber scaffolds can be easily destroyed by simple washing, which limits the denaturation of the surface protein of the cells. No cells remained on the polymeric nanofiber scaffolds when analyzed under the microscope."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "We grew stem cells on a star-like amphiphilic copolymer of poly(caprolactone)-poly(ethylene oxide) nanofiber-based scaffold, which is a cheap material and easy to prepare. The 3D scaffold allowed the growth of the mESCs and the maintenance of their stem cell characteristics (cell pluripotency). Polymeric nanofibers allowed cell-cell attachment and cell-nanofibers attachment. Growing the cells in 3D scaffold has great potential for regenerative medicine as it mimics the in vivo environment. Another advantage of the cotton scaffold is that the cells are not trypsinized, which will avoid any denaturation of the surface protein of the cells. We also identified two MSCs subpopulations that had different gene expression profiles. This has a big impact on the in vivo application of MSCs for regenerative medicine.   "
            ],
            "subsections": []
        },
        {
            "title": "Funding",
            "paragraphs": [
                "This project was funded by the National Plan for Science, Technology and Innovation (MAARIFAH), King Abdulaziz City for Science and Technology, Kingdom of Saudi Arabia, Award Number (14-BIO-1066-02)."
            ],
            "subsections": []
        },
        {
            "title": "Data Availability",
            "paragraphs": [
                "Data are available from the corresponding author."
            ],
            "subsections": []
        },
        {
            "title": "Conflicts of Interest",
            "paragraphs": [
                "The authors declare that they have no conflicts of interest."
            ],
            "subsections": []
        }
    ]
}