{
    "id": "https://semopenalex.org/work/W2195415107",
    "authors": [
        "Xu Wang",
        "James M. Piret",
        "Ju Hun Yeon",
        "Lindsay Machan",
        "Thomas F. Burke",
        "Christian J. Kastrup",
        "Jesse Q. Zhang",
        "Alexander E. St. John",
        "James R. Baylis",
        "Diana Chien",
        "Esther B. Lim",
        "Amir Kazerooni",
        "Nathan White",
        "Lee Anna",
        "Max H. Thomson"
    ],
    "title": "Self-propelled particles that transport cargo through flowing blood and halt hemorrhage",
    "date": "2015-10-02",
    "abstract": "Delivering therapeutics deep into damaged tissue during bleeding is challenging because of the outward flow of blood. When coagulants cannot reach and clot blood at its source, uncontrolled bleeding can occur and increase surgical complications and fatalities. Self-propelling particles have been proposed as a strategy for transporting agents upstream through blood. Many nanoparticle and microparticle systems exhibiting autonomous or collective movement have been developed, but propulsion has not been used successfully in blood or used in vivo to transport therapeutics. We show that simple gas-generating microparticles consisting of carbonate and tranexamic acid traveled through aqueous solutions at velocities of up to 1.5 cm/s and delivered therapeutics millimeters into the vasculature of wounds. The particles transported themselves through a combination of lateral propulsion, buoyant rise, and convection. When loaded with active thrombin, these particles worked effectively as a hemostatic agent and halted severe hemorrhage in multiple animal models of intraoperative and traumatic bleeding. Many medical applications have been suggested for self-propelling particles, and the findings of this study show that the active self-fueled transport of particles can function in vivo to enhance drug delivery.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "Uncontrolled bleeding occurs in many clinical conditions, including surgical and dental procedures, severe nosebleed, postpartum hemorrhage, trauma, and hemophilia (1)(2)(3). The primary concern during severe bleeding is controlling blood loss, but controlling secondary bleeding and infection and promoting tissue repair are also important. These concerns could be addressed by quickly delivering therapeutics, such as coagulants, antifibrinolytics, antimicrobials, or growth factors, to the damaged vasculature (4,5). However, systemic delivery of these therapeutics via injections or local delivery of these therapeutics via intravascular catheters is often impractical. Delivering agents topically is also limited by biophysical barriers; it is difficult to transport agents against blood flow, especially far enough upstream to reach leaking vessels. We hypothesize that therapeutics formulated into water-reactive particles that release gas to transport themselves can be delivered upstream through blood flow and directly address hemorrhage.",
                "Many particle systems that exhibit active autonomous and collective movement have been developed for broad potential uses (6)(7)(8)(9)(10)(11)(12). Chemically driven self-propelling particles, sometimes termed \"catalytic microengines,\" often rely on gas generation for propulsion, although other mechanisms, such as ultrasound or magnetically driven swimmers, have been used (13,14). Several limitations have prevented these selfpropelling particles from being used to deliver therapeutics in vivo. These particles typically propel at velocities many orders of magnitude slower than blood flow or rely on fuels (often hydrogen peroxide) dispersed in the solution (9,10). The transport of therapeutics through whole blood by catalytic microengines was recently reported to be unachievable, although noncatalytic self-fueled particles that can transport through gastric fluids have been developed (6,7,15). To develop selffueled particles suitable for transport through blood, we chose materials that react vigorously to produce gas in most aqueous solutions. Calcium carbonate (CaCO 3 ) is commonly used in antacid tablets and drug formulations, rapidly produces carbon dioxide (CO 2 ) in acidic solutions, and forms porous microparticles that adsorb protein, making it an ideal substance for self-fueled particles (16). We report that CaCO 3 -based microparticles actively transport through blood and can carry functional protein cargo through wounds and into the vasculature. This is the first report of self-fueled particles being used in vivo to transport through blood, and the findings demonstrate that propulsion is a viable mechanism for targeting the delivery of therapeutics into wounds."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS AND DISCUSSION",
            "paragraphs": [
                "When CaCO 3 microparticles were mixed with a solid organic acid, they rapidly traveled through aqueous solutions (Fig. 1A). CaCO 3 particles were mixed with the organic acid protonated tranexamic acid (TXA-NH 3 + ) (1:1 molar ratio) and injected into buffered saline solution or whole blood (Fig. 1B). The particles reacted vigorously, rising buoyantly and spreading laterally both below and at the surface within seconds (Fig. 1, C andD). The transport of particles, referred to here as \"propulsion,\" occurred from a combination of particles rising buoyantly and propelling laterally and the large convection generated by the rapid production of gas bubbles (17). The reaction was self-buffering because much of TXA-NH 3 + was neutralized as the particles were partially consumed and converted into CO 2 . Propulsion also occurred when other solid organic acids, such as citric acid and malic acid, were substituted for TXA-NH 3 + (figs. S1 to S3). When CaCO 3 particles were mixed with neutral tranexamic acid (TXA-NH 2 ), which did not protonate carbonate, they did not propel. Similar to other types of gas-releasing fuels used in propelled particles, this CO 2 -releasing mixture could be incorporated into a larger object and propel it (9,10,18). A 10-mg steel hull containing the fuel propelled at 0.2 mm/s despite having a mass 10 times greater than that of the fuel (Fig. 1E).",
                "Porous CaCO 3 microparticles capable of adsorbing molecular cargos were prepared by controlled precipitation through the addition of aqueous Na 2 CO 3 to aqueous CaCl 2 (16). The particles had spherical geometries with an average diameter of 10 mm (Fig. 1F). Nonporous particulates of CaCO 3 and Na 2 CO 3 also propelled but could not load high concentrations of cargo (Fig. 2A and figs. S1 to S3). To initially test whether porous microparticles could propel and carry fluorescent cargos through blood in vivo, we applied them to a site of bleeding in a mouse model of hemorrhage. A portion of the mouse tail was amputated, and propelling microparticles containing fluorescent nanoparticles or fluorescein isothiocyanate (FITC)-dextran were applied.",
                "Histological sections of the intact tail showed fluorescent particles up to 1 cm deep in the vasculature, confirming transport and delivery through blood in vivo (Fig. 1, G andH). Propelled particles transported through blood vessels and colocalized with red blood cells past the surface of the tail wound (fig. S4). When nonpropelling CaCO 3 microparticles were tested, particles were not found past the surface of the tail. Because of the multiple mechanisms of propulsion and the complex nature of blood flow in wounds, particles were not expected to maintain their velocity in a single direction. No signs of pain or distress were observed even when particles and TXA-NH 3 + were injected intravenously, and the histological analysis of lung tissues showed no difference from controls, suggesting that major embolism or severe toxicity did not occur (fig. S5). However, additional work is required to rigorously evaluate safety and toxicity for specific applications. Although the propulsion of catalytic microengines in blood was previously considered unachievable (6, 7), our results show that generating gas from particles can achieve this. To understand the range of potential applications for propelling CaCO 3 particles, we measured the velocities of particles in stagnant and flowing solutions (Fig. 2). CaCO 3 particles were injected at the bottom of a container containing an aqueous organic acid, and particle trajectories were imaged (Fig. 2A). Particles usually reacted as aggregates with a diameter (mean ± SD) of 0.4 ± 0.2 mm, breaking apart into individual particles as they traveled (figs. S1 and S2). Particles had upward velocities of 71 ± 23 mm/s and lateral velocities of 3.6 ± 3.5 mm/s, among the fastest reported for self-propelling particles (9,10). This upward velocity of particles mimics the gravitatic movement used by some microorganisms to propel upward against gravity (19). Particle velocity increased with bubble volume (Fig. 2B). Images showed that CaCO 3 particles were attached to the bottom of CO 2 bubbles and were buoyantly carried upward as they reacted (Fig. 2C). When particles were intentionally clumped together into larger, heavier aggregates, they sank and propelled laterally with similar horizontal velocities of ~3 mm/s (fig. S3). These results may imply that other gas-releasing self-propelled particles of low density may rise buoyantly if the reaction rate is high and large bubbles are produced.",
                "The forces expected to cause upward transport were considered: the buoyant force of CO 2 bubbles and the drag force opposing motion (Supplementary Materials). The buoyant force F buoy is given by F buoy = rgV, where r is the density of the aqueous solution, g is the acceleration due to gravity, and V is the bubble volume. The CO 2 bubbles were modeled as oblate spheroids. The Reynolds number for this system ranges between 1 and 100; therefore, the drag force F drag is approxi-mated by F drag ≈ ½rAv 2 C D , where A is the frontal area of the bubble, v is the upward velocity, and C D is the coefficient of drag. Equating F buoy to F drag gives v ≈ (4gr/3C D ) 1/2 , where r is the bubble radius. Despite simplifying assumptions and deriving them from first principles, this relationship is remarkably consistent with the observed particle velocities and bubble radii, successfully predicting the one-half power regression of the data within 10% (Fig. 2B). The model does not describe many important aspects of the behavior of particles in flowing solutions or wounds (such as turbulent or pulsating flow) or in heterogeneous solutions (such as blood) (20).",
                "To determine whether the particles were capable of transporting upstream against blood flow, we mixed CaCO 3 and TXA-NH 3 + together and applied them to an aqueous solution flowing through a glass capillary at velocities between 0.06 and 5.9 mm/s (Fig. 2D). Particles applied at the bottom of the tube traveled upward, and the fraction of the tube occupied by particles and accompanying bubbles was measured (Fig. 2E). The propelling particles successfully opposed flow velocities of up to 3.0 mm/s. Fluorescence images showed that fluorescent CaCO 3 particles reached the top of the flowing solution (fig. S6). To determine the flow velocity of blood through which particles could travel, we injected them into a stream of whole blood in a microfluidic channel (Fig. 2, F andG). The maximum distance that particles traveled through flowing and stagnant blood was measured. In stagnant blood oriented perpendicular to gravity, particles traveled to a maximum distance of 3.9 mm at a velocity of 0.54 mm/s (movie S1). Through blood flowing at 0.4 mm/s, a large portion of particles consistently traveled upstream at various angles relative to gravity. When the flow was 1.8 mm/s and parallel to the direction of gravity, 13% of particles propelled upstream to a maximum distance of 6 mm. Particles were capable of transporting over a distance of 1 m upstream through blood (fig. S7). Physiological flow velocities are about 1 mm/s in capillaries and up to 10 to 100 mm/s in larger arteries but are variable and can be much lower in wounds when bleeding originates from these vessels (21). On the basis of these values, CaCO 3 particles appear capable of propelling through flow velocities present in wounds and small vessels, but likely not against blood flowing through large arteries. This may help contain the particles near wound sites and prevent them from entering the systemic circulation.",
                "The ability to transport molecular cargos through blood could address an unmet need for materials that effectively halt severe bleeding. Bleeding can be minimized with antifibrinolytics (such as tranexamic acid) or with intravascular catheters that embolize the vasculature (22). However, when vessels cannot be targeted with catheters or when bleeding must be stopped immediately, more traditional approaches are attempted. The wound can be packed with dressings or powders containing gelatin, modified cellulose, or zeolites (23,24). Intraoper-atively, thrombin can be applied topically, in solution, or with gelatin (25,26). However, these methods are not highly effective during severe bleeding or when external blood loss originates inside a cavity (24).",
                "To create propelling particles that clot blood, we adsorbed thrombin (a serine protease that activates the coagulation system and directly cleaves fibrinogen) onto porous particles. Particles were loaded with 0.9 mmol of active thrombin per gram of CaCO 3 , of which about 0.6 mmol was loosely bound and could be removed upon washing with lowstringency buffer (fig. S8A). These thrombin-loaded particles, added alone or combined with either TXA-NH 3 + (\"propelled thrombin\") or TXA-NH 2 (\"nonpropelled thrombin\"), rapidly clotted blood, and the activities of thrombin in propelled and nonpropelled formulations were similar (fig. S8). Tranexamic acid can contribute to the stabilization of clots by inhibiting clot lysis, although this process occurs much slower than clot initiation by thrombin. To test whether the propelled thrombin particles could clot flowing plasma, we applied the particles to the bottom of a glass capillary tube where plasma flowed between 0.006 and 3.4 mm/s (Fig. 3A). A microfluidic system was used to control the flow of plasma and to detect occlusion of flow through the capillary tube (fig. S9). The propelled thrombin occluded flow at velocities about 10 times faster than nonpropelled thrombin. At a physiologically relevant flow velocity of 3 mm/s, the particles propelled upward against flow, accumulated high in the tubing, and initiated clotting (Fig. 3C). Nonpropelled thrombin only occluded flow at very slow velocities (up to 0.06 mm/s) and showed no difference from controls at velocities of 0.6 mm/s and above, where the background occlusion times were 30 min. Without propulsion, thrombin was able to form a clot at the exit of the tubing, but it was easily pushed out and was unable to permanently occlude flow. Thrombin clotted flowing plasma four times faster when it was adsorbed onto propelled particles compared to when it was nonabsorbed and mechanically mixed with the particles; however, both of these gas-generating formulations clotted faster than thrombin adsorbed on nonpropelled particles (fig. S8). In a separate experiment, when plasma was flowed perpendicular to gravity at 0.125 mm/s, propulsion still significantly decreased time to occlusion, which occurred in 4 min with propelled thrombin but took 14 min with nonpropelled thrombin (Fig. 3, B andD). Together, these results show that thrombin initiates clotting faster when propelled because it is delivered upstream both by direct transport (as cargo loaded onto the propelled particles) and likely by the convective effects of gas generation.",
                "The self-propelling particles were tested for their ability to halt hemorrhage in two murine models. First, in a model of amputation, mouse tails were transected 8 mm from the tip, causing severe hemorrhage (27). Propelled or nonpropelled thrombin particles were applied for 30 s at the site of amputation, and bleeding was monitored for 10 min in warm saline. Control mice were not treated after the amputation. The propelled thrombin significantly decreased bleeding time compared to the other groups (Fig. 4A and fig. S10). Among mice that received propelled thrombin, seven of nine (78%) stopped bleeding during the observation. In contrast, in the groups that received nonpropelled thrombin and no treatment, only three of nine (33%) and two of eight (25%) mice stopped bleeding, respectively. During a single-dose test for toxicity that lasted 3 days, all treated mice remained healthy. Compared to untreated mice, they showed no signs of distress or tissue necrosis and no increase in the infiltration of inflammatory cells in histological sections of the tail (fig. S11).",
                "The transport of particles in spatially unconfined systems is mostly upward as a result of buoyant rise. If the transport of particles in wounds only occurred upward, it could potentially limit the use of particles to very specific clinical scenarios where bleeding is in the direction of gravity. To test whether propelled thrombin could be efficacious in a wide variety of wound geometries, including wounds with an unfavorable orientation relative to gravity where transport by convection and lateral propulsion would play a role, we used a second murine model and a porcine model. In the second murine model of hemorrhage, particles were applied to punctured livers. Mice were laid supine, incisions were made to the median lobe of each liver, and bleeding occurred opposite the direction of gravity (Fig. 4B). Wounds received propelled thrombin, a clinically used solution of recombinant thrombin, propelled particles without thrombin, or no treatment. Propelled thrombin significantly decreased blood loss compared to the other groups (Fig. 4C).",
                "In a separate cohort of mice, livers were analyzed histologically after fluorescent nanoparticles had been incorporated into CaCO 3 . Because of the substantial sample variability in blood loss and tissue damage in tail wounds, accumulation of particles was rigorously quantified using this liver puncture model of bleeding (28). Ten times more particles were localized in the liver wound with propelled thrombin than with nonpropelled thrombin (Fig. 4, D to F). Enhanced transport and delivery downward into the wounds occurred because the reaction of ~100,000 particles and the resulting local convection rapidly distributed them throughout the blood and wound.",
                "To test whether self-propelling particles could prevent death from catastrophic bleeding, we used a porcine model of traumatic femoral artery hemorrhage (29). The femoral arteries of pigs were surgically exposed, and punch holes 5 mm in diameter were inflicted to induce rapid high-pressure arterial bleeding (Fig. 4G). Without hemostatic intervention at the bleeding site, pigs quickly died of hemorrhagic shock (n = 0 of 5; 0% survival at 3 hours). Alternatively, when a gauze containing propelled thrombin was packed above the bleeding artery, there was 100% (5 of 5) survival, whereas only 40% (2 of 5) of pigs survived to 3 hours when they were treated with a gauze containing nonpropelled thrombin (Fig. 4H and fig. S12). The propelled and nonpropelled thrombin gauzes were identical formulations, except that the propelled sample contained TXA-NH 3 + , whereas the nonpropelled sample contained TXA-NH 2 and did not produce CO 2 . No external pressure was applied after packing, and CO 2 freely escaped the wounds."
            ],
            "subsections": []
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "We have developed a simple self-fueled particle system for delivering cargo through flowing aqueous solutions. This system is functional; the propelled particles delivered a coagulation enzyme and halted bleeding in three animal models of severe hemorrhage. The efficacy seen in these models demonstrates that gas generation can effectively transport particles throughout blood in diverse scenarios. This material may be particularly useful in treating external or intraoperative bleeding that originates internally, such as in the uterus, sinus, gastrointestinal tract, or abdomen, where traditional topical agents are less effective. In this work, we focused on delivering coagulants because bleeding is an important health problem, with trauma being the leading cause of death in young people worldwide and with postpartum hemorrhage being one of the leading causes of death in mothers during childbirth (30,31). This system may have far-reaching applications for the delivery of therapeutics other than coagulants to sites of injury and hemorrhage. CaCO 3 adsorbs biomolecules nonspecifically; therefore, a wide range of therapeutics can be loaded and propelled. CaCO 3 particles are also scalable to submicrometer diameters and larger quantities (32). The by-products of the reaction, including CO 2 , are inert and soluble in blood. Initial applications in drug delivery may include locally distributing therapeutics in complex vascular geometries when injected via drug-eluting intravascular catheters or transporting therapeutics through blood and into exposed tissue during surgery, such as tumor resection. Numerous medical applications have been suggested for selfpropelling particles, and the findings from this study provide evidence that these applications may be achieved."
            ],
            "subsections": []
        },
        {
            "title": "MATERIALS AND METHODS",
            "paragraphs": [
                "Additional methods for the supplementary data can be found in the Supplementary Materials."
            ],
            "subsections": [
                {
                    "title": "Preparing propulsion reagents",
                    "paragraphs": [
                        "To generate porous CaCO 3 microparticles, a solution of Na 2 CO 3 (0.33 M in 50 ml of water) was quickly added to a rapidly stirring solution of CaCl 2 (0.33 M in 50 ml of water) (16). Precipitated CaCO 3 microparticles were collected by centrifugation at 3000g for 10 min and washed with deionized water. To make fluorescent microparticles loaded with FITC-dextran or dark-red fluorescent (660/680) polystyrene nanoparticles (200 nm), the fluorescent agent was added to the CaCl 2 solution before precipitation at 50 mM for FITC-dextran (4 kDa) or at 0.2 mg/ml for nanoparticles. To generate TXA-NH 3 + , concentrated HCl was added to 0.5 M TXA-NH 2 until the pH reached 4.3, and then the solid TXA-NH 3 + was collected after lyophilization. To adsorb thrombin onto the particles, the particles were suspended at 10% (w/v) in a solution of bovine thrombin (447 mM) buffered with 10 mM Hepes. The suspension was incubated at 4°C for 1 hour. The particles were purified by centrifugation at 10,000g for 5 min and lyophilized. To obtain mixtures capable of propelling, the CaCO 3 particles were then added to TXA-NH 3 + at an equal molar ratio."
                    ],
                    "subsections": []
                },
                {
                    "title": "Measuring the velocities of CaCO 3 particulates and porous CaCO 3 microparticles",
                    "paragraphs": [
                        "We tested the velocities of both porous CaCO 3 microparticles and CaCO 3 particulates as obtained from the manufacturer. Particle velocities were measured after injection into 1 M citric acid at 16 mm below the surface. Particles were imaged at time intervals of 35 ms. Particulates and porous microparticles were separately mixed with TXA-NH 3 + (1:1 molar ratio), yielding mixtures that propelled when injected into solutions with neutral pH. Propelling mixture was injected similarly into phosphate-buffered saline containing 50 mM sodium citrate (PBS-citrate), heparinized and citrated whole blood, or a solution of washed and concentrated red blood cells in PBS-citrate. Citrate was used to prevent blood clotting upon addition of Ca 2+ and to prevent precipitation of calcium phosphate. The surface of the blood or buffer was imaged, and the time at which the particles were observed at the surface was recorded to calculate the average upward velocity of the mixture. The steel hull was made of a 2-mm piece of an 18-gauge steel needle that was closed at one end. About 1 mg of the CaCO 3 /TXA-NH 3 + mixture was loaded into the hull and submerged in an aqueous solution containing 1.5 M citric acid, 33% glycerol (v/v), and bovine serum albumin (16.4 "
                    ],
                    "subsections": [
                        {
                            "title": "mM).",
                            "paragraphs": [
                                "Measuring the propulsion of CaCO 3 microparticles against flow using microfluidics An in vitro microfluidic system was used to assess the particles' ability to propel through flowing water. Water containing 0.1% Tween-20 was flowed, using a syringe pump, at velocities between 0.06 and 5.9 mm/s. The solution was fed through a microfluidic device made of polydimethylsiloxane (PDMS), which contained a \"Y-shaped\" junction. At the ends of the junction, polytetrafluoroethylene tubing connected the device to glass capillaries (10 cm long, internal diameter of 0.8 mm). The propelled particle mixture was applied at the end of one of the capillaries, and the transit and accumulation of particles and bubbles were imaged over the length of the capillary. The cross-sectional area of particles and bubbles was recorded for 30 s in the region 4 to 7 cm upstream of the site of particle application (Fig. 2E).",
                                "To determine the ability of particles to propel against flowing whole blood, citrated whole blood was flowed at velocities between 0 and 1.8 mm/s through a PDMS microfluidic channel positioned at 0°, 40°, and 90°. At 90°, the channel was parallel to the direction of gravity. Blood was flowed downward while the movement of particles upstream was measured. Particles were injected into the middle of the channel via a catheter, and the movement of particles and bubbles was imaged by optical microscopy. In experiments testing propulsion in horizontal devices, steps were taken to minimize any error in leveling. The microscope stage was leveled using a spirit level. The microfluidic devices were flat because the silicon wafer templates were also flat. The glass capillaries used in the clotting experiments were flat. To further minimize systematic errors in leveling and unintended irregularities in device construction, the devices were rotated by 180°in a plane normal to gravity between measurements. Velocities and displacements of particles were quantified in both directions, and these measurements were averaged. The maximum distance that particles traveled against flow and the fraction of particles that traveled against flow were measured. The microfluidic channel extended 6 mm past the injection site; thus, 6 mm was the maximum distance traveled by particles in this experiment.",
                                "Measuring flow and occlusion times in an in vitro bleeding model using microfluidics Citrated human blood plasma was recalcified by adding calcium-rich saline (40 mM CaCl 2 and 90 mM NaCl) to plasma (1:3 volumetric ratio). Recalcified blood plasma was flowed through glass capillaries (10 cm long, internal diameter of 0.8 mm) coated with poly-L-lysine (PLL), and the propelling particles (20 mg) were applied to the end of one of the capillaries. The capillaries were coated with 0.01% PLL for 1 hour and dried for 1 hour at 60°C; PLL enhanced the adhesion of the clot to the capillary and increased background occlusion times. Plasma was held in plastic syringe reservoirs and flowed into the capillaries via polyethylene tubing. Particles (20 mg) containing combinations of CaCO 3 , thrombin, and TXA-NH 3 + were applied while plasma was flowing through. A microfluidic system loaded with oil was used upstream of the syringes of plasma to control flow rates through the capillaries and to detect occlusion of the capillaries with clotted blood plasma. The oil contained 10% PFO (1H,1H,2H,2H-perfluoro-1-octanol), which was used as surfactant. The movement of tracer particles was monitored with optical microscopy to determine when occlusion and clotting occurred. Times of clot initiation were compared between groups using Mann-Whitney U test."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Analyzing bleeding times in a mouse model of amputation and hemorrhage",
                    "paragraphs": [
                        "All procedures involving animals were approved by the University of British Columbia Animal Care Committee and performed in accordance with the guidelines established by the Canadian Council on Animal Care. BALB/c mice weighing 20 to 25 g were anesthesized via isoflurane inhalation. Tails were transected 8 mm from the tip and then subjected to either no treatment or treatment with either nonpropelled thrombin or propelled thrombin particles for 30 s (thrombin ~1.8 × 10 -5 mg/g, CaCO 3 0.5 mg/g, and tranexamic acid 0.5 mg/g; ~1,000,000 particles). Bleeding was recorded over a 10-min observation period while the tails were immersed in citrated saline. Because some mice did not stop bleeding during the 10-min observation, total time clotted was plotted for each treatment group (fig. S10). For example, each mouse that did not stop bleeding had a total time clotted of zero. To determine the statistical significance of bleeding time, total time clotted was compared using Mann-Whitney U test.",
                        "Quantifying blood loss in a mouse model of liver puncture and hemorrhage Livers were accessed via a transverse incision about 3 cm in length. Two lacerations, each 2 mm long and 2 mm deep, were made on each liver using a 2-mm ophthalmic knife. Blood loss was quantified from each laceration independently. Blood was collected on preweighed filter papers immediately after injury until bleeding stopped. Filter papers (~2 cm by 2 cm) were arranged to line the site of puncture before incision. Each laceration bled for 30 s before either the CaCO 3 mixture (2 to 3 mg) or a freshly reconstituted recombinant thrombin solution (20 ml) was applied (thrombin ~1.8 × 10 -6 mg/g, CaCO 3 0.05 mg/g, and tranexamic acid 0.05 mg/g; ~100,000 particles). The particles (in powder form) were applied to this liver model of bleeding, whereas no pressure was applied. The particles freely moved through blood in any direction. Blood losses were compared by Mann-Whitney U test. To confirm that changes in filter paper mass correlated with the volumes of blood soaked, known volumes of fresh blood were soaked onto preweighed filter papers (fig. S13).",
                        "To measure the delivery of propelled CaCO 3 into the sites of liver injury, the livers of a separate cohort of mice were accessed and similarly injured. Immediately after injury, 2 to 3 mg of propelled or nonpropelled CaCO 3 microparticles (~100,000 particles) containing dark-red fluorescent nanoparticles and thrombin were applied. Once bleeding stopped, the livers were collected. Histological sections were viewed with an epifluorescence microscope, and the amount of fluorescent nanoparticles was quantified using ImageJ software. Fluorescent intensities were compared to a standard containing a known mass of the particles to calculate the mass of CaCO 3 delivered to each wound."
                    ],
                    "subsections": []
                },
                {
                    "title": "Porcine model of lethal traumatic hemorrhage",
                    "paragraphs": [
                        "To prepare a gauze loaded with CaCO 3 and adsorbed thrombin, 8 g of CaCO 3 microparticles was suspended in 8 ml of glycine-buffered saline (GBS) (40 mM glycine and 171 mM NaCl, pH 7.2) containing human thrombin (0.06 mg/ml; specific activity ~4000 U/mg) and incubated on ice for 20 min. The suspension was diluted with an additional 8 ml of GBS, poured onto 3-g strips of Kerlix gauze, and lyophilized. To prepare a propelled or nonpropelled thrombin gauze, these dressings were combined with 3-g strips of Kerlix gauze containing either TXA-NH 3 + (4.7 g) or TXA-NH 2 (4.7 g), respectively (CaCO 3 ~267 mg/kg, tranexamic acid 157 mg/kg, and human thrombin 1.67 × 10 -2 mg/kg). The doses of CaCO 3 and tranexamic acid reflected the maximum amount of material that could be loaded onto the gauze. The dose of thrombin was similar to the therapeutic doses of commercially available thrombin products. Gauzes were trimmed to standard length and width using a gauze template, which was previously found to tightly pack the bleeding wound cavity.",
                        "A modified porcine bleeding model developed by the U.S. military to test topical hemostatic agents was used in these experiments (26). After induction of anesthesia with inhaled isoflurane, the left femoral artery and vein were cannulated for arterial blood pressure monitoring and administration of resuscitation fluids (fig. S14). The injury site was prepped by a 4-cm skin incision on the right hindlimb to access the femoral artery, which remained exposed while the adductor muscles were kept intact. The exposed artery was bathed in 2% lidocaine to dilate and prevent vasospasm after injury. The artery was clamped proximally and distally, and a 5-mm biopsy punch was used to create an arteriotomy on the anterior wall of the artery. The clamps were removed to allow for 30 s of free bleeding. Bleeding wounds were packed with the selected gauze to tightly fill the wound cavity. Compression and repacking of wounds were not performed. At 3.5 min after the onset of hemorrhage, all animals received one bolus of hydroxyethyl starch solution (15 ml/kg, Hextend; Hospira Inc.) infused over 15 min. Lactated Ringer electrolyte solution (Hospira Inc.) was infused as needed (3 ml/kg/min up to a maximum of 100 ml/kg/min) to achieve or maintain a mean arterial pressure (MAP) of ≥60 mmHg. Animals were observed for 3 hours, and blood was collected using preweighed gauze. Blood loss and MAP were measured serially. Animals were euthanized under anesthesia if they survived to 3 hours or if the arterial pressure waveform was lost, indicating loss of cardiac activity."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "SUPPLEMENTARY MATERIALS",
            "paragraphs": [
                "Supplementary material for this article is available at http://advances.sciencemag.org/cgi/ content/full/1/9/e1500379/DC1 Materials and Methods Fig. S1. Velocities of CaCO 3 particulates and porous microparticles.  "
            ],
            "subsections": []
        }
    ]
}