{
    "id": "https://semopenalex.org/work/W2761264021",
    "authors": [
        "Gerald I. Shulman",
        "Douglas L. Rothman",
        "Xian‐Man Zhang",
        "Gary W. Cline",
        "Liang Peng",
        "Kitt Falk Petersen",
        "Rachel J. Perry",
        "Gina M. Butrico",
        "Yong Liang Wang"
    ],
    "title": "Non-invasive assessment of hepatic mitochondrial metabolism by positional isotopomer NMR tracer analysis (PINTA)",
    "date": "2017-10-06",
    "abstract": "Hepatic mitochondria play a central role in the regulation of intermediary metabolism and maintenance of normoglycemia, and there is great interest in assessing rates of hepatic mitochondrial citrate synthase flux (V CS) and pyruvate carboxylase flux (V PC) in vivo. Here, we show that a positional isotopomer NMR tracer analysis (PINTA) method can be used to non-invasively assess rates of V CS and V PC fluxes using a combined NMR/gas chromatography-mass spectrometry analysis of plasma following infusion of [3-13C]lactate and glucose tracer. PINTA measures V CS and V PC fluxes over a wide range of physiological conditions with minimal pyruvate cycling and detects increased hepatic V CS following treatment with a liver-targeted mitochondrial uncoupler. Finally, validation studies in humans demonstrate that the V PC/V CS ratio measured by PINTA is similar to that determined by in vivo NMR spectroscopy. This method will provide investigators with a relatively simple tool to non-invasively examine the role of altered hepatic mitochondrial metabolism.Liver mitochondrial metabolism plays an important role for glucose and lipid homeostasis and its alterations contribute to metabolic disorders, including fatty liver and diabetes. Here Perry et al. develop a method for the measurement of hepatic fluxes by using lactate and glucose tracers in combination with NMR spectroscopy.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Hepatic mitochondrial function plays a critical role in the regulation of liver and whole-body glucose and fat metabolism and there is great interest in understanding the potential role for alterations in hepatic mitochondrial activity in the pathogenesis of non-alcoholic fatty liver disease (NAFLD), non-alcoholic steatohepatitis (NASH) and type 2 diabetes (T2D) as well for the evaluation of potential novel therapies targeting hepatic mitochondrial fat oxidation to treat these diseases. Although recent studies by our group have demonstrated the utility of in vivo 13C magnetic resonance spectroscopy (MRS) to directly assess rates of hepatic mitochondrial oxidation flux (VCS) and pyruvate carboxylase flux (VPC) in humans1, 2, application of this method is expensive, time- and labor-intensive, and requires an in vivo wide-bore (>0.8 m), high-field (≥4 Tesla) magnetic resonance imaging system modified to do 13C MRS, which is available at only a few academic medical centers worldwide. To date the only non-invasive tracer method that has been described to assess hepatic mitochondrial fluxes in vivo utilizes [13C3]propionate3–6. A disadvantage of the propionate method is that it can alter hepatic mitochondrial metabolism in part through generation of high concentrations of propionyl-CoA7, 8. A key motivation for this study is to develop an alternative non-invasive tracer method to model hepatic metabolism in vivo with minimal perturbation of hepatic mitochondrial metabolism.",
                "To address this unmet need, we have developed a simple positional isotopomer Nuclear Magnetic Resonance (NMR) tracer analysis (PINTA) method by which hepatic glucose production, anaplerosis and citrate synthase flux can be non-invasively assessed based on NMR and gas chromatography/mass spectrometry (GC/MS) analysis of plasma following an infusion of [3-13C]lactate (Supplementary Fig. 1a, b). To validate this method, we performed independent cross-validation studies and observed an excellent correlation (P < 10−15, R2 = 0.99) between VPC/VCS calculated using PINTA and our previous ex vivo NMR tracer technique in rats9, 10, and similar VPC/VCS ratios measured in healthy human subjects using two independent tracer methods (infusion of [3-13C]lactate or [1-13C]acetate1, 2). Validation studies demonstrate the ability of the PINTA method to measure an increase in VCS flux following treatment with a controlled-release mitochondrial protonophore (CRMP), which promoted liver-targeted mitochondrial uncoupling11 and an increase in the VPC/VEGP ratio after an extended fast. Taken together these data demonstrate that the PINTA method is sufficiently sensitive to demonstrate meaningful differences in hepatic mitochondrial flux rates in various physiological and pathophysiological states in both humans and rodent models of diabetes, NAFLD/NASH and other metabolic diseases. Furthermore, this method will be very useful for assessing target engagement for novel therapies that are currently being developed to promote increased hepatic mitochondrial fatty acid oxidation for the treatment of NAFLD/NASH and T2D."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Vpc/Vcs And Vpc/Vegp Are Similar By Pinta And Ex Vivo Nmr",
                    "paragraphs": [
                        "Analysis of plasma lactate and glucose enrichment in the rat studies confirmed unchanged plasma lactate concentrations and steady-state enrichment after 2 h of isotope infusion (Supplementary Fig. 2a, b). The hepatic glucose and glutamate data obtained from all rats in this study are shown in Supplementary Tables 1 and 2. Linear regression analysis demonstrated a strong correlation between the hepatic VPC/VCS ratio measured with PINTA and that generated with our previously established ex vivo NMR method1, 10 (R2 = 0.99, slope = 0.98) in seven different groups of rats: (1) chow-fed rats; (2) high-fat-fed rats; (3) rats undergoing a hyperinsulinemic-euglycemic clamp to mimic postprandial hyperinsulinemia, and rats treated with: (4) glucagon; (5) epinephrine; (6) malic enzyme (ME) inhibitor; and (7) CRMP to promote increased hepatic mitochondrial oxidation (Fig. 1). We next compared the correlation between VPC/VEGP ratios measured with ex vivo and PINTA analysis and confirmed a strong linear relationship between the two ratios (R2 = 0.84, slope = 0.92) (Fig. 2).Fig. 1VPC/VCS ratios measured by PINTA and ex vivo NMR. This ratio is identical whether measured by PINTA or ex vivo NMR analysis of rat liversFig. 2VPC/VEGP ratios measured by PINTA and ex vivo NMR. This ratio correlates tightly when measured by PINTA with the VPC/VEGP ratio determined using ex vivo NMR analysis"
                    ],
                    "subsections": []
                },
                {
                    "title": "Plasma Can Be Used For Pinta Analysis",
                    "paragraphs": [
                        "Next, in order to investigate whether this method could be applied to non-invasively measure hepatic fluxes in humans, we first confirmed a strong correlation between liver and plasma glucose enrichment in rat samples (Supplementary Fig. 2c, d), demonstrating that the plasma glucose enrichment can be used as a surrogate for hepatic glucose enrichment in cases where non-invasive measurement of fluxes is of particular importance. We then measured the VPC/VCS ratio in three healthy human subjects following a 12 h overnight fast, and found that the two methods (in vivo NMR analysis of positional glutamate enrichment1 or PINTA analysis of plasma glucose) gave similar results, with VPC/VCS ~ 1.5–1.9 using both methods (Fig. 3, Supplementary Fig. 3a, b). The VPC/VEGP ratio was 0.50 ± 0.02, consistent with previous measurements of gluconeogenic contributions to endogenous glucose production in humans following an overnight fast12.Fig. 3VPC/VCS ratios in healthy human control subjects. The measured ratios are comparable as measured by in vivo NMR at 4 T or by PINTA. Data are presented as the mean ± S.E.M. of n = 3"
                    ],
                    "subsections": []
                },
                {
                    "title": "Pinta Yields Expected Changes In Fluxes With Known Perturbations",
                    "paragraphs": [
                        "Next, to validate that the PINTA method is sensitive enough to detect expected differences in fluxes with alterations in hepatic mitochondrial oxidation we assessed the effect of a controlled-release mitochondrial protonophore, which we have previously demonstrated safely promotes liver-targeted mitochondrial uncoupling in vivo11, and found that this intervention increased VCS flux two-fold and suppressed both EGP and VPC fluxes (Table 1). We then measured the VPC/VEGP ratio in glycogen-depleted rats fasted for 48 h and compared the VPC/VEGP flux ratio to rats that had fasted for just 6 h, after a prior fast and refeeding to increase liver glycogen content similar to the recently-fed state (Supplementary Fig. 4). PINTA measurements demonstrated that VPC/VEGP increased six-fold in hepatic glycogen-depleted rats fasted for 48 h, with the percentage of glucose production from pyruvate carboxylase flux increasing from ~13 to ~80% (Fig. 4).Table 1PINTA detects increased VCS flux in high-fat-fed rats treated with a liver-targeted mitochondrial uncoupler Parameter  Control  CRMP VPC/VCS1.50 ± 270.48 ± 0.12**VPC/VEGP0.79 ± 0.050.60 ± 0.06*EGP (μmol/(kg BW-min))39 ± 133 ± 1**VPC (μmol/(kg BW-min))31 ± 320 ± 2**VCS (μmol/(kg BW-min))23 ± 449 ± 9*VPC/VCS and VPC/VEGP ratios, as well as absolute rates of endogenous glucose production (EGP), VPC, and VCS flux were all measured using PINTA analysis of livers from rats infused with [3-13C]lactate. *P < 0.05, **P < 0.01 by the two-tailed unpaired Student’s t-test. Data are the mean ± S.E.M. of n = 5–6Fig. 4VPC/VEGP increases with an extended fast. The VPC/VEGP ratios measured using the two techniques are identical in both 6 and 48 h fasted rats. Data are the mean ± S.E.M. of n = 4 rats per time point"
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Alterations in hepatic fatty acid metabolism play a critical role in the pathogenesis of hepatic insulin resistance and increased rates of gluconeogenesis in patients with T2D13–15 and alterations in hepatic mitochondrial metabolism have been proposed to play a key role in the pathogenesis of NAFLD6, 16, 17 and NASH18. Furthermore liver-targeted agents to promote increased hepatic fatty acid oxidation through inhibition of acetyl-CoA carboxylase19, 20 and liver-targeted11, 21, 22 and untargeted23 mitochondrial uncoupling agents are currently being developed to treat NAFLD/NASH and T2D. Thus there is great interest in developing non-invasive methods to assess rates of hepatic mitochondrial fatty acid oxidation and gluconeogenesis in vivo. Here we show that by simply assessing the positional isotopomer enrichments of the C4 and C5 carbons of plasma glucose by a combined 13C NMR/GC-MS method following an infusion of [3-13C]lactate we can non-invasively assess rates of hepatic mitochondrial oxidative (VCS) and gluconeogenic fluxes from pyruvate (VPC) in awake rodents and humans. Furthermore, by combining these VPC/VCS relative flux measurements with assessment of endogenous glucose production and assessment of the ratio of VPC/VEGP enrichment calculated from the m + 1 and m + 2 enrichments of glucose, we can estimate absolute rates of VCS flux and VPC flux.",
                "To validate this method we first measured the ratio of hepatic pyruvate carboxylase flux to hepatic citrate synthase flux (VPC/VCS) using two methods following a steady-state infusion of [3-13C]lactate and [3-3H]glucose, comparing data obtained using our previously established ex vivo NMR analysis1, 7, 11 to the newly developed PINTA analysis (Supplementary Tables 1 and 2) in seven groups of rats undergoing various physiological perturbations which could alter hepatic mitochondrial activity: (1) control chow-fed; (2) insulin-resistant high-fat-fed; (3) hyperinsulinemic-euglycemic clamped; (4) glucagon infused; (5) epinephrine-infused; (6) ME inhibitor7 treated; and (7) liver-targeted mitochondrial uncoupler (CRMP11) treated rats. Using this approach, we observed a 1:1 correlation (Fig. 1; R2 = 0.99, slope = 0.98) for VPC/VCS using these two methods. Both methods rely on a similar small set of assumptions, including having reached steady state in the metabolites of interest and negligible enrichment in [1-13C]pyruvate, [1-13C]alanine, and [1-13C]acetyl-CoA. We have validated these assumptions in the current study by demonstrating stability of glucose enrichment in both rats and humans (Supplementary Figs. 2b and 3a) and confirming minimal hepatic bicarbonate enrichment (1.5 ± 0.1%).",
                "Next, we used our PINTA and ex vivo NMR methods to calculate the ratio of VPC/VEGP. We observed a strong correlation (Fig. 2; R2 = 0.84, slope = 0.92) between ratios calculated using the two methods in all groups of rats. The calculation of this flux requires a different but related set of assumptions. PINTA measurement of VPC/VEGP assumes, in addition to achievement of steady state, a binomial probability analysis describing the distribution of 13C-glucose isotopomers resulting from the synthesis of two 13C-labeled trioses, and the presence of just one gluconeogenic precursor pool enrichment. The ex vivo NMR method, as we have described and validated10, assumes the presence of rapidly equilibrating small pools in the TCA cycle that are unperturbed by the tracer24, complete equilibration of C2 and C3 OAA25, and that the enrichment of malate reflects that of OAA. The strong correlation between two methods with differing assumptions is reassuring regarding the applicability of each method; however, future studies—ideally comparing PINTA with [3-13C]lactate tracer to an alternative stable isotope tracer—will be required to test the utility of PINTA in additional settings. Taken together these data demonstrate that the analysis of glucose by the PINTA method (Supplementary Tables 1 and 2) closely approximates the VPC/VCS and VPC/VEGP ratios measured using an invasive method that requires rapidly snap freezing 3–4 g of liver tissue in rodents within 10 s of intravenously administered anesthesia.",
                "The primary goal of this report is to present a non-invasive method to measure hepatic oxidative and gluconeogenic fluxes that can be applied to humans. To examine the potential of PINTA to serve this purpose, we used two independent and complementary methods to calculate the ratio of VPC/VCS in humans infused with [1-13C]acetate and [3-13C]lactate in separate studies. We have previously reported extensive validation studies to support the use of this method for measuring hepatic fluxes in vivo1, 2 and now demonstrate that PINTA measures the ratio VPC/VCS similar to that determined using in vivo NMR analysis.",
                "Next, in order to confirm the sensitivity of PINTA measurements to expected changes in mitochondrial flux rates, we performed a validation study utilizing treatment with a liver-targeted mitochondrial uncoupling agent, CRMP, which we have previously established can selectively increase rates of hepatic mitochondrial oxidation in vivo without inducing hyperthermia or any associated hepatic or systemic toxicities11, 21, 26, 27. As compared to vehicle-treated control rats, animals treated with CRMP exhibited a 2.5-fold increase in hepatic VCS flux consistent with its effects to increase hepatic tricarboxylic acid cycle activity through uncoupling of mitochondrial oxidative-phosphorylation activity. This 2.5-fold increase in rates of hepatic mitochondrial oxidation induced by CRMP was associated with a ~70% reduction in the VPC/VCS ratio and ~10 and ~30% reductions in rates of endogenous glucose production and VPC flux, respectively (Table 1). Finally, we examined VPC/VEGP flux in glycogen-replete rats fasted for 6 h and compared this ratio to glycogen-depleted rats fasted for 48 h. An extended fast increased VPC/VEGP flux six-fold, consistent with a shift in reliance upon increased mitochondrial pyruvate carboxylase flux for glucose production in the absence of hepatic glycogen. These data demonstrate that the PINTA method is sufficiently sensitive to detect expected differences in both relative and absolute VPC/VCS fluxes as well as in the ratio VPC/VEGP with previously characterized physiological perturbations.",
                "The selection of isotope is always a critical factor in any tracer metabolic study and [3-13C]lactate has many advantages over other stable isotopes that have been used to assess hepatic mitochondrial and glucose metabolism. First, plasma lactate concentrations are 10–100 fold greater than the plasma concentrations of glycerol, acetate or propionate and therefore significant 13C enrichment in hepatic lactate and its intraheptocellular metabolites can be achieved without significantly perturbing whole-body lactate metabolism. Furthermore, compared to glycerol, acetate and propionate, lactate has the lowest periportal perivenous gradient across the liver bed and therefore hepatocellular flux determinations using this isotope will be least impacted by any heterogeneity of mixing of tracer between periportal and perivenous hepatocytes28–30. In addition, [U-13C]propionate, when administered at doses commonly used to trace hepatic mitochondrial metabolism in human and animal studies, markedly increases plasma propionate concentrations, hepatic TCA cycle intermediates and hepatocellular propionyl CoA concentrations, a potent allosteric activator of pyruvate carboxylase leading to profound alterations in hepatic mitochondrial fluxes7. In contrast [3-13C]lactate can be infused at a rate that provides sufficient label to measure hepatic mitochondrial fluxes without significantly altering hepatocellular mitochondrial metabolites/fluxes7, 8. Because of its reliance on the assumption that pyruvate cycling is minimal the PINTA method would be of limited utility in settings where pyruvate kinase (PK) and/or ME flux is high relative to pyruvate carboxylase flux. To address this assumption, we have previously assessed rates of VPK+ME flux and found these rates to be very low compared to rates of VPC+PDH flux in healthy control subjects and insulin-resistant subjects with NAFLD following an overnight fast2. Consistent with these prior studies, we found in this study that VPK+ME flux relative to VPC+PDH flux is less than 6% in overnight fasted rodents (Supplementary Table 1), which we find using a complete equation including these fluxes will have minimal impact on our estimates of VPC and VCS fluxes. This finding makes teleological sense in that rates of hepatic glycolysis (VPK) would be expected to be minimal relative to rates of VPC flux under fasting conditions in order to provide maximal net flux through gluconeogenesis to support obligate glucose-utilizing organs like the brain and renal medulla while minimizing energy dissipation due to futile cycling. However, under other conditions such as hyperthyroidism, which significantly increases rates of hepatic pyruvate cycling due to increased VME flux31, 32, as well as under hyperglycemic-hyperinsulinemic conditions, when rates of hepatic glycolysis would be expected to be significantly increased, it will be necessary to adjust these PINTA determined rates of VPC/VCS flux using the equation provided in the Methods.",
                "The use of the PINTA method to measure VPC flux also has advantages over the 2H2O method33–36 to measure gluconeogenic flux rates. In addition to the improved specificity afforded by measuring VPC instead of total gluconeogenesis, infusion of [3-13C]lactate is practically simpler for both investigator and subject: the 2H2O method requires dosing of 2H2O several hours prior to assessment of gluconeogenesis in order to allow adequate time for 2H2O equilibration in the whole-body water space. Furthermore, 2H2O administration is often associated with dizziness, nystagmus, nausea and occasional vomiting, which can be a limiting factor in the clinical setting.",
                "In summary, here we describe a non-invasive (PINTA) method to measure rates of hepatic mitochondrial oxidation and pyruvate carboxylase flux in vivo during an infusion of [3-13C]lactate in combination with a glucose tracer to assess rates of endogenous glucose production. It is anticipated that this method will provide investigators with a relatively simple and widely available means of examining the role of altered hepatic mitochondrial and glucose metabolism in various physiologic and pathophysiologic states in humans and rodent models of diabetes as well as to examine target engagement for novel therapies that are currently being developed to promote increased rates of hepatic fatty acid oxidation for the treatment of NASH and T2D."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Animal Studies",
                    "paragraphs": [
                        "All experiments were approved by the Yale University Institutional Animal Care and Use Committee. Male Sprague-Dawley rats (~10 weeks of age) were ordered from Charles River (Wilmington, MA) at ~300 g and fed regular chow unless otherwise specified. High-fat-fed rats ordered at the same age and weight were given ad lib access to a safflower oil-based high-fat diet (Dyets, Bethlehem, PA, #112245) for 4 weeks, the latter 2 weeks of which they were treated with either a controlled-release mitochondrial protonophore11 (1 mg/kg in a small amount (~200 mg) of peanut butter) or the same amount of peanut butter vehicle each day. Before studies, rats underwent surgery under general isoflurane anesthesia to place polyethylene catheters in the jugular vein and common carotid artery (PE90 and PE50 tubing, respectively; Instech, Plymouth Meeting, PA). After 1 week, recovery was verified by confirming that the rats had regained their pre-surgical weight. Unless otherwise specified, all experiments were performed following an overnight fast (16 h food withdrawal before euthanasia). In both the rodent and human studies, data are represented as the mean of two technical replicates for each subject (i.e., two technical replicates per biological replicate). Sample sizes were selected to give power to detect moderate to large differences between groups (n = 5–6 per group), and all animals were included in the final analysis."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human Studies",
                    "paragraphs": [
                        "All protocols were approved by the Yale University Human Investigation Committee, and written informed consent was obtained from each participant after explanation of the purpose, nature, and potential complications of the study. We studied three healthy, normal weight men (<4% hepatic triglyceride); this sample size was chosen to give sufficient power to detect large differences between groups and to demonstrate the practical feasibility of this tracer method."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tracer Studies",
                    "paragraphs": [
                        "All rats were infused with [3-13C]lactate (Sigma, St. Louis, MO; 120 μmol/(kg-min) prime for 5 min, 40 μmol/(kg-min) continuous infusion) and [3-3H]glucose (PerkinElmer, Waltham, MA; 0.45 μCi/(kg-min) prime for 5 min, 0.15 μCi/(kg-min) for 120 min. Certain rats were treated with interventions (ME inhibitor, hydroxymalonate, Sigma, 200 mg/kg by IP injection at time zero of the tracer infusion; glucagon, Sigma, 5 ng/(kg-min) by continuous intra-arterial infusion throughout the tracer infusion; epinephrine, Sigma, 2 μg/(kg-min) by continuous intra-arterial infusion throughout the tracer infusion; and hyperinsulinemic-euglycemic clamp: insulin prime 40 mU/kg at time zero of the clamp and 4 mU/(kg-min) infusion throughout the tracer infusion, with a variable glucose infusion rate infused to maintain euglycemia ~100–110 mg/dl) as previously described7 following randomization to groups using a random number generator. The investigator performing the animal studies was not blinded for practical reasons, but the investigators analyzing fluxes were blinded as to the group allocation. Some of the rats utilized in this study (control, ME inhibitor, glucagon, epinephrine and clamp) have yielded previously published data (EGP, VPK+ME/(VPC+PDH))7; however, the fluxes presented in this study have not been analyzed or reported previously.",
                        "In the human studies, each subject participated in two studies, each following a 12 h overnight fast, and received an IV infusion of [1-13C]acetate (13 μmol/(kg-min)) or [3-13C]lactate (36.1 μmol/(kg-min)) on separate occasions2, 37. VPC/VCS was determined by measuring the rate of incorporation of [1-13C]acetate into [1-13C] and [5-13C]glutamate using in vivo MRS2 during the [1-13C]acetate infusions, and by PINTA analysis of a plasma sample obtained at steady-state in the [3-13C]lactate infusions. The VPC/VEGP ratio was measured by PINTA analysis of steady-state plasma after a [3-13C]lactate infusion. The VPC/VCS ratio from these subjects has been published as a subset of the data included in our previous paper2; however, the PINTA analysis of these subjects has not been performed or reported previously."
                    ],
                    "subsections": []
                },
                {
                    "title": "Flux Modeling: Pinta",
                    "paragraphs": [
                        "Our flux calculations require the following equations using [13C] glucose positional enrichment in plasma or liver, determined by NMR and GC/MS mass spectrometry as described below. The labeling patterns associated with the fluxes and the relevant pathways are shown in Supplementary Fig. 1. VPC is the rate of pyruvate carboxylase flux as determined from the anaplerotic flow into OAA. VCS is defined as the flux of the citrate synthase reaction in the citric acid cycle. As discussed previously the calculated anaplerotic flux can also include ME flux but under the conditions studied we have shown that ME flux is negligible compared to anaplerotic flux2, 7. Table 2 shows the equations used to calculate relative fluxes by PINTA.Table 2Flux modeling ratios (VPC/VEGP, Eq. (1), and VPC/VCS, Eq. (2)) used in the PINTA method Ratio  Calculation  \\(\\frac{V_{PC}}{V_{CS}}\\)  \\(\\left( \\frac{\\left\\lbrack {5 -^{13}C} \\right\\rbrack glucose}{2*\\left( {\\left\\lbrack {4 -^{13}C} \\right\\rbrack glucose} \\right)} \\right) - 1\\)  (1) \\(\\frac{V_{PC}}{V_{EGP}}\\)  \\(\\frac{G2}{XFE^{2}}\\)  (2)With G2 and XFE as defined belowThe derivations and further definitions of these equations are given below"
                    ],
                    "subsections": []
                },
                {
                    "title": "Calculation Of Vpc/Vcs",
                    "paragraphs": [
                        "The ratio of \\(\\frac{V_{PC}}{V_{CS}}\\)  (Eq. (1)) was calculated as described below based on a model of hepatic metabolism developed by Katz for radiolabeled isotopes38. In this calculation, we assume that the flux from PC will continue through PEPCK and subsequent gluconeogenic reactions, and end up in liver glucose. We note that this will be a maximum estimate of the PC contribution due to the possibility of futile cycling where PEP is converted by PK into pyruvate. Our previous in vivo animal and human studies suggest that VPK+ME flux is relatively low compared to VPC flux under fasting conditions2, 7. Consistent with these prior studies we find that VPK+ME flux/VPC+PDH flux is relatively low (<15%) under several physiologic conditions (Supplementary Table 1) and that these low rates of pyruvate cycling will have a minimal impact of our estimated VPC/VCS ratio.",
                        "In order to avoid any impact of pentose cycling on our estimate of the VPC/VCS ratio we examine only the relative 13C labeling in carbons C4 and C5 of glucose, which would not be expected to be significantly impacted by pentose cycling.",
                        "The isotope balance equation of the [1-13C]oxaloacetate pool is given by Eq. (3):\\[\\frac{\\partial\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA}{\\partial t} = \\frac{1}{2}*\\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate*V_{PC} + \\frac{1}{2}*\\left( {\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA + \\left\\lbrack {1 -^{13}C} \\right\\rbrack acetylCoA} \\right)*V_{CS} - \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left( {V_{PC} + V_{CS}} \\right).\\] Equation (3) may be simplified with the following assumptions as described38:i)Metabolic and isotopic steady state.ii)[1-13C]pyruvate ~ 0.iii)[1-13C]acetyl-CoA ~ 0.iv)Complete scrambling of enrichment between [2-13C]OAA and [3-13C]OAA, as well as between [1-13C]OAA and [4-13C]OAA by fumarase.",
                        "The first assumption was tested by confirming the stability of the glucose labeling in the plasma at the time of sampling (Supplementary Figs. 2b and 3a). The absence of significant label in bicarbonate (which we found to be 1.5 ± 0.1% in rats infused with 40 μmol/(kg-min) of [3-13C] lactate (plasma lactate enrichment ~45%)) supports assumptions (ii) and (iii). Assumption (iv) was tested by confirming equal enrichment in C2 and C3 glutamate (Supplementary Table 2).",
                        "With these assumptions the equation reduces to Eq. (4)\\[\\frac{\\partial\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA}{\\partial t} = \\frac{1}{2}*\\left( {\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA*V_{CS}} \\right) - \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left( {V_{PC} + V_{CS}} \\right).\\] At steady-state, \\(\\frac{\\partial\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA}{\\partial t} = 0.\\)  Rearranging yields Eq. (5)\\[\\frac{V_{PC}}{V_{CS}} = \\left( \\frac{\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA}{2*\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA} \\right) - 1.\\] Substitution of the fractional 13C enrichment of C6 glucose for C3 OAA and the fractional enrichment of C4 glucose for C1 OAA into Eq. (5) yields Eq. (6):\\[\\frac{V_{PC}}{V_{CS}} = \\left( \\frac{\\left\\lbrack {6 -^{13}C} \\right\\rbrack glucose}{2*\\left( {\\left\\lbrack {4 -^{13}C} \\right\\rbrack glucose} \\right)} \\right) - 1.\\] To avoid any potential impact of glyceroneogenesis39, 40 from [3-13C]lactate, which would label C1 and C6 glucose, and based on assumption (iv), we further modified Eq. (6) to generate Eq. (7):\\[\\frac{V_{PC}}{V_{CS}} = \\left( \\frac{\\left\\lbrack {5 -^{13}C} \\right\\rbrack glucose}{2*\\left( {\\left\\lbrack {4 -^{13}C} \\right\\rbrack glucose} \\right)} \\right) - 1.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Expanded Derivation Of Vpc/Vcs",
                    "paragraphs": [
                        "Below we present a complete derivation to assess the potential effect of pyruvate recycling and other minor fluxes we did not include in our (VPC/VCS) calculations:Dilution of labeling at the level of α-ketoglutarate (via unlabeled glutamine entering the glutamate pool and exchanging).Production of labeled [1-13C]pyruvate due to futile cycling between OAA and pyruvate through ME (VME) or the combined action of PEP carboxykinase and PK.Flow of unlabeled mass into the TCA cycle at the level of succinate (Vsuc).",
                        "If pyruvate cycling is included there will be significant 13C enrichment in [1-13C]pyruvate, [2-13C]pyruvate, and [1-13C]acetyl-CoA. The isotope balance equation of [1-13C]OAA is given by Eq. (8)\\[\\frac{\\delta\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA}{\\delta t} = \\frac{1}{2}*\\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate*V_{PC} + \\frac{1}{2}*\\left( {\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA + \\left\\lbrack {1 -^{13}C} \\right\\rbrack acetyl - CoA} \\right)*\\left( {V_{suc} + V_{CS}} \\right) - \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left( {V_{PC} + V_{CS} + V_{Suc}} \\right).\\]",
                        "Under conditions where a substrate such as propionate that enters the TCA cycle at the level of succinate is not given VCS ~ VCS + VSuc so that Eq. (8) can be simplified to Eq. (9):\\[\\frac{\\delta\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA}{\\delta t} = \\frac{1}{2}*\\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate*V_{PC} + \\frac{1}{2}*\\left( {\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA + \\left\\lbrack {1 -^{13}C} \\right\\rbrack acetyl - CoA} \\right)*V_{CS} - \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left( {V_{PC} + V_{CS}} \\right).\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Relationship Between Α-Ketoglutarate And Oaa Labeling",
                    "paragraphs": [
                        "Dilution of label at the level of α-ketoglutarate due to unlabeled glutamine entering glutamate and exchanging with α-ketoglutarate through AAT is given by Eq. (10):\\[K1 = \\frac{\\left\\lbrack {2 -^{13}C} \\right\\rbrack\\alpha KG}{\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA}.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Relationship Between [1-13C]Acetyl-Coa And [2-13C]Pyuvate Labeling",
                    "paragraphs": [
                        "The labeling of Acetyl-CoA relative to pyruvate is reduced by the fraction of acetyl-CoA coming from unlabeled sources such as lipids. On the basis of mass balance this reduction is given by Eq. (11)\\[\\left\\lbrack {1 -^{13}C} \\right\\rbrack acetyl - CoA = \\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate*\\frac{V_{PDH}}{V_{CS}} = \\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate*K_{2},\\] where\\[K_{2} = \\frac{V_{PDH}}{V_{CS}}.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Relationship Between [1-13C]Oaa And [1-13C]Pyruvate",
                    "paragraphs": [
                        "[1-13C]pyruvate can be created from [1-13C]OAA either through ME (VME) or the combined actions of PEP carboxykinase and PK (VPK). We define total pyruvate recycling as given by Eq. (13)\\[V_{PK+ME} = V_{PK} + V_{ME}.\\] At steady state the isotope balance equation for [1-13C]pyruvate is given by Eq. (14):\\[0 = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*V_{PK + ME} - \\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate*\\left( {V_{PK + ME} + V_{PDH} + V_{PC} + V_{Lacr}} \\right),\\] which can be rearranged to Eq. (15)\\[\\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left\\lbrack \\frac{V_{PK + ME}}{V_{PK + ME} + V_{PC} + V_{PDH} + V_{Lacr}} \\right\\rbrack,\\] in which VLacr denotes the loss of pyruvate from the liver via reverse transport of lactate and alanine.",
                        "The ratio in brackets in Eq. (15) can be expressed in terms of a constant K3 yielding Eq. (16),\\[\\left\\lbrack {1 -^{13}C} \\right\\rbrack pyruvate = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*K_{3},\\] where\\[K_{3} = \\frac{V_{PK + ME}}{V_{PK + ME} + V_{PC} + V_{PDH} + V_{Lacr}}.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Relationship Between [3-13C]Oaa And [2-13C]Pyruvate",
                    "paragraphs": [
                        "Labeling in [2-13C]pyruvate may also arise from pyruvate recycling as described below. At steady state, the isotopic balance equation for [2-13C]pyruvate is given by Eq. (18):\\[0 = \\left\\lbrack {2 -^{13}C} \\right\\rbrack OAA*V_{PK+ME} - \\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate*\\left( {V_{PK+ME} + V_{PC} + V_{PDH} + V_{Lacr}} \\right).\\] Rearranging yields Eq. (19),\\[\\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate = \\left\\lbrack {2 -^{13}C} \\right\\rbrack OAA*\\left\\lbrack \\frac{V_{PK+ME}}{V_{PK+ME} + V_{PC} + V_{PDH} + V_{Lacr}} \\right\\rbrack\\] where VLacr is the loss of pyruvate from the liver via reverse transport of lactate and alanine.",
                        "The ratio in brackets can be expressed in terms of a constant K3 yielding\\[\\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate = K_{3}*\\left\\lbrack {2 -^{13}C} \\right\\rbrack OAA.\\] Due to fumarase and ME reversibility we and others have found that [2-13C]OAA ~ [3-13C]OAA so that Eq. (19), substituting in K3 from Eq. (17), can be replaced with Eq. (21)\\[\\left\\lbrack {2 -^{13}C} \\right\\rbrack pyruvate = K_{3}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Derivation Of The Steady-State Solution",
                    "paragraphs": [
                        "Substituting for [1-13C]pyruvate and [1-13C]acetyl-CoA (~0 based on assumption i) in Eq. (3) at steady state using the relations derived above (Eqs. (11) and (15)) gives Eq. (22)\\[0 = \\frac{1}{2}*K_{3}*\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*V_{PC} + \\frac{1}{2}*K_{1}*\\left( {\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA + K_{2}*K_{3}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA} \\right)*V_{CS} - \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left. \\left( {V_{PC} + V_{CS}} \\right) \\right),\\] which can be rearranged to Eq. (23)\\[0 = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left( {0.5*K_{3}*V_{PC} - V_{PC} - V_{CS}} \\right) + \\frac{1}{2}*K_{1}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA*\\left( {1 + K_{2}*K_{3}} \\right)*V_{CS}.\\] Dividing by VCS yields\\[0 = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left\\lbrack {\\left( {0.5*K_{3}*\\frac{V_{PC}}{V_{CS}} - \\frac{V_{PC}}{V_{CS}}} \\right) - 1} \\right\\rbrack + \\frac{1}{2}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA*K_{1}\\left( {1 + K_{2}*K_{3}} \\right),\\] \\[0 = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left\\lbrack {\\left( {0.5*K_{3} - 1} \\right)*\\frac{V_{PC}}{V_{CS}} - 1} \\right\\rbrack + \\frac{1}{2}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA*K_{1}\\left( {1 + K_{2}*K_{3}} \\right)\\] On the basis of the published work we expect minimal dilution at α-ketoglutarate under these conditions1, so that\\[\\left. K_{1} \\right.\\sim 1.\\] Furthermore based on published work2–4 as well as our present results (Supplementary Table 1)\\[K_{2} = \\frac{V_{PDH}}{V_{CS}} < 0.1,\\] \\[K_{3} = \\frac{V_{PK+ME}}{V_{PK+ME} + V_{PDH} + V_{PC} + V_{Lacr}} < 0.1.\\] Substituting K1 = 1 and setting the K2K3 term to ~0 yields Eq. (29):\\[0 = \\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA*\\left\\lbrack {\\left( {0.5*K_{3} - 1} \\right)*\\frac{V_{PC}}{V_{CS}} - 1} \\right\\rbrack + \\frac{1}{2}*\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA,\\] which can be rearranged to\\[\\frac{V_{PC}}{V_{CS}} = \\left\\lbrack {0.5*\\frac{\\left\\lbrack {3 -^{13}C} \\right\\rbrack OAA}{\\left\\lbrack {1 -^{13}C} \\right\\rbrack OAA} - 1} \\right\\rbrack*\\frac{1}{1 - 0.5*K_{3}}.\\]",
                        "Note that based on the experimental measurements of VPK+ME under these conditions (Supplementary Table 1) we anticipate a 5% or less impact of pyruvate recycling on the calculated (VPC/VCS) ratio. In the maximum case where VPC = VPK+ME (no gluconeogenesis, just pyruvate recycling) K3 = 1 and VPC/VCS will be underestimated by a factor of 2."
                    ],
                    "subsections": []
                },
                {
                    "title": "Calculation Of Vpc/Vegp",
                    "paragraphs": [
                        "Endogenous glucose production (EGP) is the sum of gluconeogenesis (GNG) and glycogenolysis (GlyNG). The fractional contribution of GNG to EGP can be determined by an infusion of [3-13C]lactate to label the triose pool, and the subsequent synthesis and Mass Isotopomer Distribution Analysis (MIDA) of plasma 13C-glucose41. MIDA analysis is based on the probability of unlabeled (T), and singly labeled triose phosphates (T*) combining to form unlabeled glucose (G0 from TT), singly labeled glucose (G1 from TT* and T*T), and doubly labeled glucose molecule (G2 from T*T*).",
                        "Since, the sum of the unlabeled, G0, and labeled, G1 and G2, glucose isotopomers is equal to 1, the distribution of the combination of T and T* can be described by the binomial relationship:\\[1 = T^{2} + 2\\left( {T^{*}T} \\right) + \\left( T^{*} \\right)^{2}.\\]",
                        "This can also be expressed in terms of the p, the probability of triose phosphate enriched with 13C above natural abundance, and q = (1 − p), the probability of triose phosphate that is not enriched above natural abundance.",
                        "As glucose is synthesized from combining two trioses with enrichments of p and q, the isotopomer distribution of glucose (G0, G1 and G2) is\\[\\left( {p + q} \\right)^{2} = p^{2} + 2pq + q^{2},\\] where G2 = p2, G1 = 2pq and G0 = q2.",
                        "From the mass spectrum, we can determine the ratio of G2/G1 and from above, we have\\[G2\\slash G1 = p^{2}\\slash 2pq.\\] Substituting (1 − p) for q, we have\\[G2\\slash G1 = p^{2}\\slash 2p\\left( {1 - p} \\right) = p\\slash 2\\left( {1 - p} \\right).\\]",
                        "Solving for p, or XFE, the fractional triose enrichment, in terms of the ratio of the enrichments of doubly labeled 13C-glucose arising from the condensation of two-singly labeled trioses, G2, and singly labeled 13C-glucose, G1, we have\\[p = {XFE} = 1\\slash\\left( \\left( {1 + \\left( {1\\slash\\left( {2G{2\\slash}G1} \\right)} \\right)} \\right) \\right..\\] The contribution of pyruvate carboxylase flux to EGP, VPC/VEGP, is then:\\[V_{PC}\\slash V_{EGP} = {G2\\slash XF}E^{2}\\]",
                        "The key assumptions are:i.A binomial probability analysis describes the distribution of 13C-glucose isotopomers resulting from the synthesis of two 13C-labeled trioses.ii.One gluconeogenic precursor pool enrichment (if not, VPC/VEGP is underestimated).iii.Triose phosphates are equilibrated (if not, VPC/VEGP is overestimated).iv.Using [13C]lactate as the tracer to label the triose pool does not include the contribution of glycerol to gluconeogenesis, and hence represents VPC/VEGP, as validated in Fig. 2.",
                        "In addition to these assumptions, the MIDA calculation defines G2 glucose (enriched with 2-13C atoms) as originating from the condensation of 2 trioses, each labeled with a single 13C-atom. However, the use of 13C-lactate as the tracer, and its subsequent passage through the TCA cycle (with entry through PC and PDH) will lead to trioses containing two 13C atoms. Therefore in addition to determining the total m + 1 and m + 2 enrichment in glucose (GC-MS:CI of glucose pentaacetate, m/z 331− > 338), enrichment in the glucose C4-C5-C6 fragment was determined by GC-MS analysis in the EI mode of the glucose aldonitrile pentapropionate derivative by monitoring m/z 259− > 26542. We corrected for any C2 glucose synthesized from 13C2-trioses by analysis of the enrichment in the glucose C4C5C6 fragment according to the following equation:\\[Corrected\\;\\left\\lbrack {m + 2} \\right\\rbrack\\; glucose = Measured\\;\\left\\lbrack {m + 2} \\right\\rbrack\\; glucose - 2*C4C5C6\\;\\left\\lbrack {m + 2} \\right\\rbrack\\; glucose.\\]"
                    ],
                    "subsections": []
                },
                {
                    "title": "Flux Modeling: Ex Vivo Nmr1,10 Of Hepatic Tissue",
                    "paragraphs": [
                        "Our flux calculations employ the following equations (Table 3).Table 3Flux modeling ratios used in the ex vivo NMR method Ratio  Calculation  \\(\\frac{V_{PC}}{V_{EGP}}\\)  \\(\\frac{C5\\; glucose}{C2\\; malate}\\)  (38) \\(\\frac{V_{PC}}{V_{CS}}\\)  \\(\\frac{\\frac{1}{2}*\\left( {C2\\; malate + C3\\; malate} \\right) - C4\\; glutamate}{C3\\; alanine - \\left( {C2\\; malate + C3\\; malate} \\right)}\\)  (39)"
                    ],
                    "subsections": []
                },
                {
                    "title": "Absolute Vpc And Vcs Flux Rates",
                    "paragraphs": [
                        "In rats, in which [3-3H]glucose was used as the tracer for glucose turnover, EGP was measured as previously described43. Based on our previous study in which we demonstrated that net renal gluconeogenesis is negligible, we assume that all gluconeogenesis occurs in the liver10.",
                        "Combining the relative flux estimations for \\(\\frac{V_{PC}}{V_{EGP}}\\)  and \\(\\frac{V_{CS}}{V_{PC}}\\)  described above with rates of endogenous glucose production (VEGP) yields absolute flux rates for VPC and VCS as follows (Table 4).Table 4Calculation of hepatic mitochondrial fluxes (VPC, VCS) with PINTA Flux  Calculation  V PC \\(V_{EGP}*\\frac{V_{PC}}{V_{EGP}}\\)  (40) V CS \\(V_{PC}*\\left( \\frac{V_{CS}}{V_{PC}} \\right)\\)  (41)"
                    ],
                    "subsections": []
                },
                {
                    "title": "Nmr, Gc/Ms And Lc/Ms-Ms Analyses",
                    "paragraphs": [
                        "We used GC/MS to measure m + 1 and m + 2 [13C] glucose enrichment. The total m + 1 and m + 2 [13C] glucose enrichment was measured using a pentaacetate derivative: plasma or liver samples were deproteinized using five volumes of methanol, dried and derivatized with 75 μl of 1:1 acetic anhydride:pyridine. After heating to 65 °C for 20 min, the reaction was terminated by adding 25 μl methanol, and m + 1 and m + 2 (as well as m + 3…m + 6) were determined by GC/MS (CI mode, m/z 331 [m], 332 [m + 1], 333 [m + 2],…337 [m + 6]). The m + 1 and m + 2 [13C] enrichments of the glucose C4C5C6 fragment were determined by generating the aldonitrile pentapropionate derivative: plasma or NMR liver extract samples were dried under N2 gas, and 50 μl hydroxylamine hydrochloride (20 mg/ml in pyridine) were added. The samples were heated at 90 °C for 60 min, then 100 μl propionic anhydride was added, after which the samples were heated at 60 °C for 30 min. Finally the samples were evaporated under N2 gas, resuspended in ethyl acetate, and the m + 1 and m + 2 enrichment of the glucose C4C5C6 fragment was measured by GC/MS42.",
                        "[13C]malate enrichment was also measured by GC/MS. A 50–100 mg liver tissue sample was weighed in a 2.0 ml microcentrifuge tube with a metal bead, and 1.0 ml of pre-chilled methanol/water (50:50, v/v) solution was added, followed by disruption at 30 Hz for 1.0 min (Qiagen Tissue Lyser, Valencia, CA) and centrifugation (4,000 r.p.m.) at 4 °C for 10 min. The supernatant was dried in a Speed Vac, and 75 μl n-butanol 4 N HCl was added into each residual sample. The resulting mixtures were heated for 30 min at 65 °C. The solvent was removed by a steady-flow of nitrogen gas at room temperature and the dried samples were acetylated with 100 μl trifluoroacetic anhydride in methylene chloride (1:7 v/v) solution. The total and C2 + C3 malate enrichments were determined by GC/MS (EI mode, m/z 213 for the total and 186 for the C1C2C3 fragment). The C2 + C3 malate enrichment was determined according to Eq. (42), which relies on the assumption that the C4 enrichment is approximately equal to the C1 enrichment of malate\\[{AP}E_{C2C3} = {AP}E_{total} - 2*\\left( {{AP}E_{total} - {AP}E_{C1C2C3}} \\right).\\]",
                        "[13C]alanine enrichment was measured by GC/MS as we have described7. [13C] NMR spectroscopy using the Bruker Topspin system was utilized to measure relative positional 13C-enrichment of glucose7, and combined with the total [13C] glucose enrichment ([m + 1] + 2 * [m + 2]) measured by GC/MS to calculate the positional enrichment of [13C] glucose.",
                        "Total [13C]glutamate enrichment was determined by LC-MS/MS. Approximately 100 mg of liver tissue was weighed out and homogenized in 500 μl ice-cold methanol using a TissueLyser, then centrifuged at 4,000 r.p.m. for 10 min. The supernatant was then purified by centrifugation (4,000 r.p.m., 10 min) through the Pall Nanosep filter (100 K) (Port Washington, NY). Glutamate 13C enrichment ([m + 1], [m + 2]) was then assessed by LC-MS/MS using an AB Sciex QTRAP 6500 (Framingham, MA), equipped with a Shimadzu ultra-fast liquid chromatography (UFLC) system (Columbia, MD) and electrospray ionization (ESI) source with negative-ion detection. The measured ion pairs were 146/128 (m0), 147/129 (m + 1) and 148/130 (m + 2).",
                        "Positional enrichment of glucose, glutamate, and alanine was measured by 13C NMR. The samples were run on the AVANCE 500-MHz NMR spectrometer (Bruker Instruments, Billerica, MA). Spectra were acquired with relaxation time = 1 s, dummy scans = 4, and number of scans = 25,000. Correction factors for differences in T1 relaxation times were determined from fully relaxed spectra of standard glucose, glutamate and alanine solutions. The total enrichment measured by GC/MS (glucose and alanine) or LC-MS/MS (glutamate) was divided algebraically between the carbons of each molecule based on the relative areas of the 13C NMR peaks: the NMR fraction of the total label in each carbon was calculated, and then multiplied by the total enrichment ([m + 1] APE + 2*[m + 2] APE + 1.1% APE * n, where n is the number of carbons in the molecule of interest). The chemical shifts of each peak are shown in Table 5.Table 5Chemical shifts of peaks examined by 13C NMR Peak  Chemical shift (p.p.m.) α − C1 glucose92.3β − C1 glucose96.8α − C2,α − C5 glucose72.5β − C2 glucose75.0α − C3 glucose73.6β − C3 glucose76.6α,β − C4 glucose70.5β − C5 glucose76.8α,β − C6 glucose61.5C1 glutamate175.8C2 glutamate55.6C3 glutamate28.5C4 glutamate34.6C5 glutamate182.0C2 alanine51.7C3 alanine17.3",
                        "13C enrichment in C1 alanine was assumed to be negligible and the total alanine 13C enrichment was divided between carbons 2 and 3."
                    ],
                    "subsections": []
                },
                {
                    "title": "Liver Glycogen Content",
                    "paragraphs": [
                        "Hepatic glycogen concentrations were analyzed following amyloglucosidase digestion and measurement of glucose concentrations in the digest as previously described44."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "GraphPad Prism version 7.0 was used to perform all statistical analysis. Comparisons of two groups were performed using the two-tailed unpaired Student’s t-test, while a simple linear regression was performed to analyze linear correlations. Differences with P-value < 0.05 were considered significant. GraphPad Prism software confirmed that the variances were not significantly different between groups compared using a student t-test, and a normal distribution was assumed."
                    ],
                    "subsections": []
                },
                {
                    "title": "Data Availability",
                    "paragraphs": [
                        "The data that support the findings of this study are available from the corresponding author (G.I.S.) upon reasonable request."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Electronic Supplementary Material",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "",
                    "paragraphs": [
                        ""
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}