{
    "id": "https://semopenalex.org/work/W4226549712",
    "authors": [
        "Hao Chen",
        "Han Zhang",
        "Marios Savvides",
        "Yongxin Zhang",
        "Fangyi Chen",
        "Shentong Mo",
        "Chenchen Zhu",
        "Uzair Ahmed",
        "Zaiwang Li",
        "Jiachen Dou"
    ],
    "title": "Unitail: Detecting, Reading, and Matching in Retail Scene",
    "date": "2022-01-01",
    "abstract": "To make full use of computer vision technology in stores, it is required to consider the actual needs that fit the characteristics of the retail scene. Pursuing this goal, we introduce the United Retail Datasets (Unitail), a large-scale benchmark of basic visual tasks on products that challenges algorithms for detecting, reading, and matching. With 1.8M quadrilateral-shaped instances annotated, the Unitail offers a detection dataset to align product appearance better. Furthermore, it provides a gallery-style OCR dataset containing 1454 product categories, 30k text regions, and 21k transcriptions to enable robust reading on products and motivate enhanced product matching. Besides benchmarking the datasets using various start-of-the-arts, we customize a new detector for product detection and provide a simple OCR-based matching solution that verifies its effectiveness. The Unitail and its evaluation server is publicly available at https://unitedretail.github.io .",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "With the rise of deep learning, numerous computer vision algorithms have been developed and have pushed many real-world applications to a satisfactory level. Currently, various visual sensors (fixed cameras, robots, drones, mobile phones, etc.) are deployed in retail stores, enabling advanced computer vision methods in shopping and restocking. Scene Product Recognition (SPR) is the foundation module in most of these frameworks, such as planogram compliance, out-of-stock managing, and automatic check-out.",
                "SPR refers to the automatic detection and recognition of products in complex retail scenes. It comprises steps that first localize products and then recognize them via the localized appearance, analogous to many recognition tasks. However, scene products have their characteristics: they are densely-packed, low-shot, fine-grained, and widely-categorized. These innate characteristics result in obvious challenges and will be a continuing problem. Recent datasets in retail scenes follow the typical setting in the common scene to initiate the momentum of research in SPR. For instance, the SKU110k dataset [18], which has recently enabled large-scale product detection, is following the MS-COCO [37] style annotation and evaluation metric. Despite their significant value, the underpaid attention to the SPR's characteristics leads us to the question: what is the next advance towards SPR?",
                "Firstly, traditional detection targets poorly comply with the actual needs, causing improper image alignment of the product appearances. Detection targets in common scenes [37,66,12,10] are usually defined as covering the utmost visible entirety of an object with a minimal rectangle box. This format is inherited by most existing retail datasets [18,63,15,59,2]. However, because occlusion occurs more frequently between products (the densely-packed characteristic), improper alignments can easily hinder the detection performance. Detectors equipped with Non-Maximum Suppression (NMS) suffer from the overlaps among the axisaligned rectangular bounding boxes (AABB) and rotated rectangular bounding boxes (RBOX). Moreover, poor alignment leads to inconsistent image registration of the same products, which brings extra difficulties to accurate recognition.",
                "Secondly, even in the well-aligned cases, products from intra-classes require discriminative features due to their fine-grained characteristic. On the one hand, a slight variation in the product packaging can significantly change the product price, especially for the visually similar but textually different regions such as brand/model, flavour/version, ingredient/material, count/net weight. This requires SPR algorithms to pay attention to the particular text patterns. On the other hand, due to the labelling effort on thousands of categories per store (the widely-categorized characteristic), the available samples per category are scarce (the low-shot characteristic), which degrades the SPR robustness. These two constraints are in conjunction with our empirical observation that visual classifiers could frequently make mistakes when products look similar but vary in text information.",
                "In this paper, we introduce the United Retail Datasets (Unitail) that responds to these issues. The Unitail is a comprehensive benchmark composed of two datasets: Unitail-Det and Unitail-OCR, and currently supports four tasks in real-world retail scene: Product Detection, Text Detection, Text Recognition, and Product Matching. (Fig. 1) Unitail-Det, as one of the largest quadrilateral object detection datasets in terms of instance number and the only existing product dataset in quadrilateral annotations by far, is designed to support well-aligned product detection. Unitail-Det enjoys two key features: 1. Bounding boxes of products are densely annotated in the quadrilateral style that cover the frontal face of products. Practically, Quadrilaterals (QUADs) adequately reflect the shapes and poses of most products regardless of the viewing angles, and efficiently cover the irregular shapes. The frontal faces of products provide distinguishable visual information and keep the appearances consistent. 2. In order to evaluate the robustness of the detectors across stores, the test set consists of two subsets to support both origin-domain and cross-domain evaluation. While one subset shares the domain Fig. 1: The Unitail is a large-scale benchmark in retail scene that consists of two sub-datasets and supports four basic tasks.",
                "with the training set, the other is independently collected from other different stores, with diverse optical sensors, and from various camera perspectives.",
                "Unitail-OCR (Optical Character Recognition) aims to drive research and applications using visual texts as representations for products. This direction is partially inspired by the customers' behavior: people can glance and recognize ice cream but need to scrutinize the flavor and calories to make a purchase. It is organized into three tasks: text detection, text recognition, and product matching. Product images in Unitail-OCR are selected from the Unitail-Det and benefit from the quadrilateral aligned annotations. Each is equipped with onproduct text location and textual contents together with its category. Due to the product's low-shot and widely-categorized characteristics, product recognition is operated by matching within an open-set gallery. To the best of our knowledge, Unitail-OCR is the first dataset to support OCR models' training and evaluation on the retail products, and it is experimentally verified to fill in the domain blank; when evaluated on a wide variety of product texts, models trained on Unitail-OCR outperform those trained on common scene texts [26]. It is also the first dataset that enables the exploration of text-based solutions to product matching.",
                "Based on the proposed Unitail, we design two baselines. To detect products, we analyze the limitation of applying generic object detectors in the retail scene and design RetailDet to detect quadrilateral products. To match products using visual texts on 2D space, we encode text features with spatial positional encoding and use Hungarian Algorithm [31] that calculates optimal assignment plans between varying text sequences.",
                "Our contributions are summarized in three folds: (1) we introduce the Unitail, a comprehensive benchmark for well-aligned textually enhanced SPR. (2) We benchmark the tasks of Unitail with various off-the-shelf methods, including [76,62,61,34,41,65,47,21,55,54,70,33,32,13,23,22,57,44]. (3) we design two baselines for product detection and text-based product matching."
            ],
            "subsections": []
        },
        {
            "title": "Related Work",
            "paragraphs": [
                "The retail scene has drawn attention to the computer vision community for an extended period. The early evolution of product datasets [40,29,52] facilitates reliable training and evaluation and drives research in this challenging field. Recently, large-scale datasets [6,18] has enabled deep learning based approaches. Datasets related to SPR can be split into two groups: product detection and product recognition. We address each in this section.",
                "Product Detection Datasets Detection is the first step in SPR entailing the presence of products that are typically represented by rectangular bounding boxes. The GroZi-120 [40] was created using in situ and in vitro data to study the product detection and recognition with 120 grocery products varying in color, size, and shape. The D2S [14] is an instance segmentation benchmark for sparsely-placed product detection, with 21000 images and 72447 instances. The SKU110k [18] and the SKU110k-r [45] provide 11762 images with 1.7M on-shelf product instances; they are annotated with axis-aligned bounding boxes and rotated bounding boxes, respectively.",
                "For the detection of coarsely categorized products, The RPC [63] is designed for checkout scenarios containing 0.4M instances and 200 products. The Grocery Shelves dataset [59] took 354 shelf images and 13k instances, and around 3k instances are noted in 10 brand classes. The Locount [2] simultaneously considers the detection and counting for groups of products, with an impressive number of 1.9M instances and 140 categories.",
                "Despite the significant values of these datasets, we are still challenged by the availability of optimal bounding boxes. In the proposed Unitail-Det, we aim to shape products into quadrilaterals whose appearances are well aligned. The dataset also provides evaluation targets in the origin-domain and cross-domain, bringing algorithms closer to practical deployment.",
                "Product Recognition Datasets Multiple product recognition datasets have been built over the past decades. Early ones have limitations in the diversity of categories and amount of images, such as the SOIL-47 [29] containing 47 categories, the Supermarket Produce Datasets [52] with 15 categories, and the Freiburg Groceries [25] covering 25 categories. Recent collections like Products-6K [17] and Products-10K [1] focus on large-scale data, which satisfy the training of deep learning algorithms. AliProducts [6] is crawled from web sources by searching 50K product names, consequently containing 2.5 million noisy images without human annotations. The ABO [8] dataset covers 576 categories that studies the 3D object understanding. The Grozi-3.2K [15] contains 80 fine-grained grocery categories and 8350 images for multi-label classification. To the best of our knowledge, there is a lack of a dataset that encourages leveraging both visual and textual information for product recognition.",
                "OCR on Retail Products Product recognition by texts is challenging. The lack of datasets obstructs the relevant research on this topic. The most relevant dataset is Products-6K [17] where the Google Cloud Vision API is employed to extract the textual information to enhance products' descriptions. But the texts were not labelled by human annotators, and text location information is missing, so it is infeasible to support any advance to OCR related tasks.",
                "There are a couple of attempts that use off-the-shelf OCR models for assisted shopping. [16] presented a system on which users search products by name and OCR models return the texts on products so that a product list ranked by word histogram is generated for the users. [43] recognize texts and then apply text embedding and language models to extract features for product verification.",
                "Other Related Datasets Many OCR datasets [56,42,7,26,27,38,51,69,24,20] exist prior to Unitail-OCR. Typically, an OCR dataset supports text detection and text recognition and so enables text spotting. The ICDAR2015 [26] and CTW1500 [38] are two widely applied benchmarks for training and evaluating OCR models in common scene. The ICDAR2015 has 1,000 training and 500 testing images causally shot indoor and outdoor with word-level annotations for each text. The CTW1500 contains 10k text (3.5k of them are curved boxes) in 1500 images collected from the internet. Compared to them, Unitail-OCR is the first that focuses on product texts and supports object-level matching task at the same time. Product texts are usually artistic words with substantial character distortions, which are hard to be localize and recognize.",
                "3 The Unitail"
            ],
            "subsections": [
                {
                    "title": "Unitail-Det",
                    "paragraphs": [
                        "Image Collection Practically, the industry utilizes a variety of sensors under different conditions for product detection. The resolution and camera angles cover an extensive range by different sensors. For example, fixed cameras are mounted on the ceiling in most cases, and customers prefer to photograph with mobile devices. The product categories in different stores also span a great range. With these factors in mind, we collect images from two sources to support origindomain and cross-domain detection. In the origin domain, training and testing  images are supposed to share the same domain and are taken from similar perspectives in the same stores by the same sensors. As a result, we select the 11,744 images from the prior largest product dataset, SKU110k [18], to form the origin domain. In the cross domain, we collect 500 images in different stores through multiple sensors, covering unseen categories and camera angles.",
                        "Annotation We annotate each product with a quadrilateral style bounding box, denoted as QUAD. Fig. 2 is an illustration of its advance. A QUAD refers to 4 points p tl , p tr , p br , p bl with 8 degrees of freedom (x tl , y tl , x tr , y tr , x br , y br , x bl , y bl ). For regular products shaped mainly in cuboid and cylinder, the (x tl ,y tl ) is defined as the top-left corners of their frontal faces, and the other points represent the rest 3 corners in clockwise order. For spherical, cones, and other shapes whose corners are difficult to identify, and for irregularly shaped products where so defined quadrilateral box cannot cover the entire frontal face, we first draw the minimum AABB and then adjust the four corners according to the camera perspective. As belabored, the frontal face of a product has the most representative information and is also critical for appearance consistency, but we still annotate the side face if the front face is invisible.",
                        "Totally, 1,777,108 QUADs are annotated by 13 well-trained annotators in 3 rounds of verification. The origin-domain is split to training (8,216 images, 1,215,013 QUADs), validation (588 images, 92,128 QUADs), and origin-domain testing set (2,940 images, 432,896 QUADs). The cross-domain supports a testing set (500 images, 37,071 QUADs). Their density and scale are shown in Fig. 3 3.2 Unitail-OCR Gallery and Testing Suite A product gallery setup is a common practice in the retail industry for product matching applications. All known categories are first registered in the gallery. In case of a query product, the matching algorithms find the top ranked category in the gallery. The gallery of Unitail-OCR contains Fig. 4: Unitail-OCR statistical graphic. The pie chart reflects sections that source images were collected from. The bar chart is a histogram for the count of words on products. The font size of the words reflects the frequency of occurrence.",
                        "1454 fine-grained and one-shot product categories. Among these products, 10709 text regions and 7565 legible text transcriptions (words) are annotated. This enables the gallery to act as the training source and the matching reference.",
                        "The testing suite contains four components: 1. 3012 products labeled with 18972 text regions for text detection. 2. Among the pre-localized text regions, 13416 legible word-level transcriptions for text recognition. 3. 10k product samples from the 1454 categories for general evaluation on product matching. 4. From the 10k products, we select 2.4k fine-grained samples (visually similar for humans) for hard-example evaluation on product matching."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Image Collection and Annotation",
            "paragraphs": [
                "Images are gathered from the Unitail-Det cross-domain and cropped and affine transformed according to the quadrilateral bounding boxes to form an upright appearance. We remove the low-quality images with low resolution and high blurriness. Some products kept in the Unitail-OCR might exclude text regions, like those from the produce and clothes departments. We randomly select one sample from each category to form the product gallery, and the remaining is further augmented by randomly adjusting the brightness and cropping for matching purposes.",
                "We annotate 29681 text regions from 4466 products as quadrilateral text boxes. Fig. 4 shows the statistics. The bounding boxes are first classified as legible or illegible. For the 20981 legible ones, the alphanumeric transcriptions are annotated ignoring letter case and symbols. Numerical values with units are commonly seen on products such as 120mg, and we regard them as entire words. We also provide a vocabulary that covers all words present. The usage of vocabulary is more practical in our case than in other scenes [26], because the presence of products and texts are usually known in advance by the store owner."
            ],
            "subsections": [
                {
                    "title": "Tasks and Evaluation Metrics",
                    "paragraphs": [
                        "Product Detection Task The goal is to detect products as quadrilaterals from complex backgrounds. Unitail-Det supports the training and evaluation.",
                        "We use the geometric mean of mean average precision (mAP) calculated on the origin-domain test set and cross-domain test set as the primary metric for the product detection, where the mAP is calculated in MS-COCO style [37]. Compared to arithmetic mean, the geometric mean is more sensitive when the model overfits to origin-domain but gains low performance on the cross-domain.",
                        "Text Detection Task The goal is to detect text regions from pre-localized product images. Unitail-OCR supports the training and evaluation.",
                        "We adopt the widely used precision, recall and hmean [26,38] for evaluation.",
                        "Text Recogniton Task The goal is to recognize words over a set of prelocalized text regions. Unitail-OCR supports the training and evaluation. We adopt the normalized edit distance (NED) [27] and word-level accuracy for evaluation. The edit distance between two words is defined by the minimum number of characters edited (insert, delete or substitute) required to change one into the other, then it is normalized by the length of the word and averaged on all ground-truths.",
                        "Product Matching Task The goal is to recognize products by matching a set of query samples to the Unitail-OCR gallery. The task is split into two tracks: Hard Example Track, which is evaluated on 2.5k selected hard examples; this track is designed for scenarios in which products are visually similar (for example pharmacy stores). And General Track, which is conducted on all 10k samples.",
                        "We adopt the top-1 accuracy as the evaluation metric.",
                        "4 Two Baselines Designed for The Unitail"
                    ],
                    "subsections": []
                },
                {
                    "title": "A Customized Detector for Product Detection",
                    "paragraphs": [
                        "Recent studies [71,58,74,28,4] on generic object detection apply prior-art DenseBoxstyle head [23] to multiple feature pyramid levels. The feature pyramid is generated via feature pyramid network (FPN) [35] and contains different levels that are gradually down-sampled but semantically enhanced. An anchor-free detection head is then attached to classify each pixel on the feature pyramid and predict axis-aligned bounding boxes (AABB).",
                        "During training, assigning ground-truths to each feature pixels on the feature pyramid plays a key role. On each pyramid level, the centerness [58] is widely used. It is an indicator to value how far a pixel locates from the center of a ground-truth: the farther, the more likely it is to predict an inaccurate box, and the lower centerness score it gains. Across pyramid levels, various strategies are proposed to determine which level should be assigned, and they are grouped into scale-based and loss-based strategies. The scale-based [35,28,50,58] assigns ground-truths to different levels in terms of their scales. The larger scale, the higher level is assigned so that the needs of receptive field and resolution of feature maps are balanced. The loss-based like Soft Selection [74] assigns groundtruths by calculating their losses on all levels, and trains an auxiliary network that re-weights the losses. Our design, RetailDet, adopts the DenseBox style architecture but predicts the four corners of quadrilateral by 8-channel regression head. During training, we found the prior assignment strategies unsuitable for quadrilateral products, which is specified below. Centerness The previous definition of the centerness [58,74] is shown in Eq.1,",
                        "by the Eq.1 and Fig. 5(a), a location p keeps the same distance to the left/right boundaries (d l p = d r p ) and to the top/bottom boundaries (d t p = d b p ) will gain the highest centerness 1, and other pixels gain degraded score by Eq.1.",
                        "Limitation When adopting the same centerness to quadrilaterals, as shown in Fig. 5(b), the center can be far away from a distant corner, which leads to unbalanced regression difficulty and lack of receptive field from that corner.",
                        "Our Solution We first re-define the center as the center of gravity (Fig. 5(c)), because it is the geometric center and represents the mean position of all the points in the shape, which mitigates the unbalanced regression difficulties. We then propose Eq.2 to calculate the quad-centerness for any p,",
                        "where the d l/r/t/b g denotes the distances between the gravity center g and the left/right/top/bottom boundaries. The d l/r/t/b p denotes the distances between the p and the boundaries. If p locates on the gravity center, its quad-centerness gains the highest value as 1. Otherwise, it is gradually degraded (See Fig. 5 (d)).",
                        "It is mentionable that when applied to AABB, Eq.2 is mathematically equivalent to Eq.1, which is proved in supplementary."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Soft Selection",
            "paragraphs": [
                "The loss-based Soft Selection in [74] outperforms scale-based strategies on generic objects because it assigns ground-truths to multiple levels and re-weights their losses. This is achieved by calculating losses for each object on all levels and using the losses to train an auxiliary network that predicts the re-weighting factors.",
                "Limitation Instances per image are numerous in densely-packed retail scene, and Soft Selection is highly inefficient (5×slower) due to the auxiliary network.",
                "Our Solution Can we maintain the merit of Soft Selection while accelerating the assignment? We approach this issue by mimicking the loss re-weighting mechanism of the auxiliary network using scale-based calculation. This is feasible because we find the Soft Selection, in essence, follows scale-based law (detailed in supplementary). Thus, we design Soft Scale (SS) in Eq.3,4,5,6. For an arbitrary shaped object O with area area O , SS assigns it to two adjacent levels l i and l j by Eq.3,4 and calculates the loss-reweighting factors F li , F lj by Eq.5,6.",
                "where 224 is the ImageNet pre-training size. Objects with exact area 224 2 is assigned to l org , in which case l i = l j = l org . If an object is with area 223 2 , SS assigns it to l org with F lorg = 0.994, and also to (l org -1) with F (lorg-1) = 0.006.",
                "In this work we fix l org to be level 5 of feature pyramid. SS operates rapidly as scale-based strategies and keeps the loss-reweighting like Soft Selection."
            ],
            "subsections": [
                {
                    "title": "A Simple Baseline for Product Matching",
                    "paragraphs": [
                        "A number of directions can be explored on this new task, while in this paper, we design the simplest solution to verify the motivation: people glance and recognize the product, and if products looks similar, they further scrutinize the text (if appears) to make decision. To this end, we first apply a well-trained image classifier that extracts visual features f v gi from each gallery image g i and feature f v p from query image p, and calculate the cosine similarity between each pair (f v gi , f v p ) (termed as sim v i ). If the highest ranking value sim v 1 and the second highest",
                        ", we then read on products and calculate the textual similarity (termed as sim t ) to make decision by Eq.7,",
                        "where threshold t and coefficient w are tuned on validation set.",
                        "Our design focuses on how to calculate sim t . We denote the on-product texts obtained from ground-truth or OCR prediction as S = {s 1 , s 2 , . . . , s N } where  N varies. People may propose to utilize sequence-to-one models (like BERT [9]) to encode S into a fixed length feature vector f ∈ R d . As shown in Fig. 6 (a), a text detector is followed by a text recognizer predicting n = 5 words, and the 5 words are fed into the BERT to encode a feature vector f p ∈ R d . For each gallery image g, the same process is operated to get a feature vector f g ∈ R d , and sim t (f p , f g ) is calculated by the cosine similarity.",
                        "But this design does not perform well because errors from OCR models (especially from text recognizer) are propagated to the BERT causing poor feature encoding. Moreover, the positional information of text boxes is lost in the sequence. So we design a new method in Fig. 6 (b). Rather than using the n recognized words, we use the n intermediate feature vectors from the text recognizer to mitigate propagated errors. For example, CREAM is confused as CRE4w, but the intermediate feature should maintain information on A and M , which is more robust than the false prediction. Each feature is then added by a 2D positional encoding [46,3] whose calculation is based on the location of the corresponding text. It encodes the spatial information into the feature and it is predefined to keep the same dimension as the intermediate feature. Finally, we get a sequence that contains the n encoded features f 1∼n . As shown we get S p = {f 1 p , f 2 p , f 3 p , f 4 p , f 5 p } from a query product and S g = {f 1 g , f 2 g , f 3 g , f 4 g } from a gallery reference. Inspired by the Hungarian Algorithm [31], we design Eq.8 to directly calculate the similarity between two sequence with varying length:",
                        "where the X is a n × m boolean matrix where j X ij = 1, i X ij = 1. Eq.8 maximizes the summation of cosine similarities from assigned feature pairs, and the assignment is optimized by X."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Experiments",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Benchmarking The Unitail",
                    "paragraphs": [
                        "The implementation is detailed in the supplementary materials.",
                        "Quadrilateral Product Detection Along with the proposed RetailDet, we build baselines by borrowing the existing detectors capable of detecting quadrilaterals, mainly from the textual and aerial scenes [10]. These methods can be grouped into segmentation based methods [76,62,61,34,21] and regression based methods [41,65,47]. Segmentation methods consider QUADs as per-pixel classification masks for each region of interest, while regression methods directly regress the bounding boxes. Table 1 shows their performances. Overall, regression based methods outperform segmentation based methods because most products can be well aligned by quadrilaterals, and the learning on segmentation mask involves extra difficulties. The RetailDet outperforms other detectors by a large margin. All detectors achieve degraded results in the cross-domain as opposed to the origin-domain, confirming that domain shift exists among stores. Text Detection & Text Recognition We benchmark the tasks of text detection and text recognition in Table 2 and Table 3, respectively. For each of the listed algorithms, it is trained under two setting: one is following a common setting that trained on SynthText [20] and ICDAR2015(IC15) [26] for text detection and on Synth90K [24] and SynthText for text recognition, another is trained/finetuned on the Unitail. As shown all algorithms achieve better performance if trained on the Unitail, this verifies that texts in the retail domain are better handled by the proposed dataset."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Method",
            "paragraphs": [
                "Training Set R P hmean DBNet [34]  PW: methods use public available weights. NED: Normalized Edit Distance, the lower the better. Acc: word top-1 Accuracy, the higher the better."
            ],
            "subsections": []
        },
        {
            "title": "Product Matching",
            "paragraphs": [
                "The product matching results are shown in Table 4. With just texts across all 1454 categories, the method in Fig. 6(b) reaches 31.71% and 47.81% on the Hard Example Track and the General Track, respectively. The result is convincing that only textual information is a strong representation for the product, but this new direction clearly requires further exploration.",
                "Moreover, the textual information improves the regular visual classifier using the method proposed in Sec.4.2. In the hard example track, the improvement of textual information is significant (+1.76 ∼ 2.75%) since the similar-looking products which are hard for regular classifier could be easier distinguished by texts. In the general track, the improvement drops (+0.56 ∼ 0.94%) due to the limited ability of the textual matching algorithm.  56.2 CenterNet [11] 55.8 ATSS [71] 57.4 FCOS [58] 54.4 SAPD [74] 55.7 Faster-RCNN+FPN [50] 54.0 Reppoints [68] 55.6 Cascade-RCNN+Rong [53] 58.7 RetailDet++ (Ours) 59.0"
            ],
            "subsections": [
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "RetailDet Table 5 shows that the RetailDet achieves state-of-the-art results on product detection benchmark SKU110k [18]. The SKU110k and the Unitail-Det share the same training images but with different annotations (QUAD vs AABB), and the origin-domain mAP on the SKU110k is 59.0 and 61.3 on the Unitail-Det (not included in Table .1). The difference is mainly for the reason that QUAD is a natural fit for products as a smoother regression target, and it avoids densely-packed overlaps which makes post-processing easier.",
                        "Difficulty of The Text Based Product Matching Since the proposed matching pipeline is not end-to-end trained, errors are accumulated by the text detector (0.773 recall and 0.871 precision for DBNet) and text recognizer (0.772 for ABINet). Some products in the dataset do not contain texts (2%), and many words are partially or fully illegible. This requires further study on topics such as: attention mechanism on text regions, end-to-end framework for text spotting based product recognition, and one-shot learning based sequence matching."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "In this work, we introduce the United Retail Datasets (Unitail), a large-scale benchmark aims at supporting well-aligned textually enhanced scene product recognition. It involves quadrilateral product instances, on-product texts, product matching gallery, and testing suite. We also design two baselines that take advantages of the Unitail and provide comprehensive benchmark experiments on various state-of-the-art methods.  "
            ],
            "subsections": []
        },
        {
            "title": "B.1 Unitail-Det",
            "paragraphs": [
                "Annotation Method We consider quadrilaterals as proper fits to products. The bounding box is common for localizing objects and reflects their shape in detection tasks. Axis-aligned rectangles are popular because they satisfy the minimum requirement for learning targets with minimum labeling efforts. Annotations with more accurate localization and appearance alignment are needed in this task. While segmentation masks are another level of accuracy for annotating scene objects, they are not cost-friendly, and the direct regression on bounding boxes is easier for densely-packed products than the segmentation methods verified in the benchmark.",
                "To ensure the quality of annotation, annotators follow a strictly defined guide. Illustrated in Fig. 7, products localized far away from the camera and with a size less than 8 × 8 pixels are not treated as positive. Instead, we annotate ignoring masks covering the distant regions for these products. Cuboid and cylinder (boxes, cans, bottles), as the majority in stores, enjoy normal quadrilaterals defined in the paper; spherical and cones whose corners are difficult to identify, along with irregularly shaped products and distorted bags are expected to be affine-transformed back into an upright position. In those cases, we first draw the minimum AABB to cover them and then adjust the four corners according to the camera perspective. Only the visible part is annotated if another product or tag blocks one product. Many products have multiple faces observable, and only the frontal face of the products is practically annotated. Labelme [60] is applied as an annotation tool. The aspect ratio of a rectangle is commonly defined as w h . We measure the aspect ratio of QUAD as in Eq.9",
                "where t, b, l, r are lengths of top, bottom, left, and right edge, respectively. Fig. 8 (c) illustrates the aspect ratio. Most ratios are around 0.3 -0.6, which is in line The interior angles of any convex QUAD add up to 360 degrees of arc. The standard deviation of these angles (std a ) is a qualified reflection of the QUAD shape. For rectangles, std a = 0. For a extreme QUAD looks close to a line segment, std a = 90. In the origin-domain of QuadRetail, the std a = 6.24. In the cross-domain, the std a = 12.73. This means the images from the cross-domain are from taken from tougher angles."
            ],
            "subsections": []
        },
        {
            "title": "B.2 Unitail-OCR",
            "paragraphs": [
                "Unitail-OCR consists of a gallery and a testing suite to support text detection, text recognition, and product recognition.",
                "Annotation Method We start by cropping products from the Unitail-Det cross-domain. Since the crops are in quadrilaterals, they are further transformed to form upright appearances. Products with scales larger than 15×15 are further selected. The categorization is organized by two hierarchical stages. In the first stage, ten supercategories (food, dairy, paper goods, canned, produce, clothing, Technology, Pharmacy, Care, other) are defined to classify the products coarsely. In the second stage, we first apply a strong pre-trained model trained with a bag of tricks to group the product into 6k clusters and correct them by human annotators. During the correction, we do not accept blurred products that are hard to identify. Many fine-grained categories rely on textual information, and the blurred ones that are difficult to read are filtered out. After the categorization, we label each product with word-level text boxes, following the annotation method in ICDAR2015 [26]. We annotate 29681 text regions from 4466 products as quadrilateral text boxes. The bounding boxes are classified as legible or illegible. The alphanumeric transcriptions 0 ∼ 9, a ∼ z are annotated for the legible ones. A vocabulary covers all words in the gallery and the testing suite are attached with the dataset."
            ],
            "subsections": []
        },
        {
            "title": "C.1 Off-the-shelf Algorithms",
            "paragraphs": [
                "We conduct experiments using multiple codebases including mmdetection [5] for FCOS, SAPD, ATSS; mmocr [30] for DBNet, FCENet, PSENet, CRNN, NRTR, RobustScanner, SAR, SATRN, ABINet; AlphaRotate [67] for RIDet and RS-Det; maskrcnn benchmark [39] for maskrcnn and Gliding Vertex; timm [64] for efficientnet, ResNet, and ResNet-IBN. To be more specific, models for product detection tasks are trained on 4 NVIDIA Titan RTX GPUs with two images per GPU. For fair comparison, the training schedule is 12 epochs with an initial learning rate of 0.01 divided by 10 at the 9th and the 11th epoch. Unless otherwise specified, the input images are scaled to 1200 and randomly horizontally flipped without any other augmentation. The Convex Hull and Shoelace Formula are implemented in CUDA to calculate the exact IOU of QUADs. Up to 400 detections per image are allowed to evaluate. For text detection models, we respect their optimized training setting for ICDAR2015 based on their officially released paper or code, but change the input image size to 1333 × 800. For text recognition, we finetune the publicly available weights on Unitial-OCR for 10 epochs."
            ],
            "subsections": []
        },
        {
            "title": "C.2 RetailDet and RetailDet++",
            "paragraphs": [
                "Base Network Our design of base network applies prior-art DenseBox-style head [23] to multiple feature pyramid levels. The feature pyramid is generated via feature pyramid network (FPN) [35] which utilizes a deep convolutional network as the backbone. As an image is fed into the backbone, several feature maps are extracted to compose the initial feature pyramid. This work adopts the ResNet family as the backbone, and the extracted feature maps are from C 3 to C 5 . The feature maps after FPN are denoted as P 3 , P 4 , P 5 . An anchor-free detection head is attached then. The head contains two branches. One is a binary classification branch to predict a heatmap for product/background. Another is a regression branch to predict the offset from the pixel location to the four corner points of the QUAD. Each branch consists of 3 stacks of convolutional layers followed by another c channel convolutional layer, where c equals to 1 for the classification branch and 8 for the regression branch.",
                "Corner Refinement Module RetailDet++ is the RetailDet enhanced with Corner Refinement Module (CRM) and deeper backbone. Here, we introduce the CRM. For each predicted QUAD from the RetailDet, we get the locations of its four corners and center. Then we apply the bilinear interpolation to extract feature of 5 points (4 corners, one center) from the feature map generated by the 3rd stacked convolution in the regression branch. These features are concatenated and fed into a 1 × 1 convolutional layer to predict the offsets between groundtruth and the former predictions. The same operation and convolution are also inserted in the classification branch to predict retail/background as a 2nd-stage classification. During testing, we combine the regression results from the two stages but only use the classification result from the first stage. CRM shares the spirits with Faster-RCNN [50], BorderDet [48] and Reppoints [68], but we find that the 5 points as mentioned above are enough for quadrilateral products, and the 2nd-stage classification helps training though not involved in testing.",
                "Losses During training, we first shrink QUADs by a ratio α = 0.3 according to the gravity centers. If one feature pixel locates inside the shrunk QUAD, the pixel is considered responsible for learning the ground-truth. We utilize f ocal loss [36] for classification and SmoothL 1 loss for regression, and we reweight both losses by the production of quad-centerness and level reweighting factor F . The total loss is the summation of the classification and regression losses. If two-stage, additional f ocal loss and L 1 loss for CRM are added to the total loss."
            ],
            "subsections": []
        },
        {
            "title": "D Discussion",
            "paragraphs": [
                "D.1 Proof: Eq.2 Is Equivalent to Eq.2 on Rectangles When QUAD is specialized to Rectangles, in Eq.2,",
                ", similarly to d t and d b , then, Eq.2 is mathematically equivalent to Eq.1."
            ],
            "subsections": []
        },
        {
            "title": "D.2 Analysis on Soft Selection",
            "paragraphs": [
                "Soft Selection is a loss-based strategy, where training losses of ground-truths indicate their pyramid level. It first assigns each object to all pyramid levels P 3 , P 4 , P 5 and calculates loss l for each level P l . l=3,4,5. Then, the level that produces the minimal loss is converted to a one-hot vector, i.e., (1,0,0) if the minimal loss is from P 3 ; and (0,1,0) if it is from P 4 , and so on. The vector is used as the ground-truth to train an auxiliary network that simultaneously predicts a vector (F 3 , F 4 , F 5 ). Each element F l is a down-weighting factor for loss l . The final loss of each object is l (F l • loss l ).",
                "By Soft Selection, the minimal loss from level l indicates that the auxiliary network is trained to generate a relatively larger F l , but we find the loss not independent of scales. On the contrary, object scale inherently determines which level will produce the minimal loss. We claim the reason as follows. First, when assigning objects (e.g. object A with size 8 × 8 and B with size 16 × 16) to pyramid, their regression targets (denoted as T A , T B ) are normalized by the level stride. Specifically, on a lower level like P 3 , the target is divided by stride 8, while on a higher level like P 4 , the target is divided by 16, and so on. Therefore, when assigning A to P 3 and P 4 , T A is 1 × 1 and 0.5 × 0.5, respectively; when assigning B, T B is 2 × 2 and 1 × 1, respectively. Note that all levels share the detection head. Apparently, the combination of T A = 1 × 1 and T B = 1 × 1 Table 7: Detection performance on SKU110k-r.",
                "leads to the smallest regression difficulty for the regression head. Naturally, it produces minimal regression losses, which means the smaller object is assigned to a lower level. Second, since A has a smaller scale, it requires more local finegrained information beneficial for classification, which is more available from high-resolution lower levels. In comparison, B has a larger scale and needs a larger receptive field, which is more available from higher levels. Therefore, the \"loss-based\" Soft Selection, in essence, follows the scale-based law. Nevertheless, why does Soft Selection outperforms scale-based strategies? We credit the improvement to its loss-reweighting mechanism. This mechanism involves multiple levels during training and reweights the loss in terms of the regression and classification difficulties, making optimization easier. Since the pyramid is discrete, if an object scale falls into the gap of two adjacent levels, both levels' difficulties will be similar. The auxiliary network has opportunities to learn to predict proper F l for both levels. The analysis motivates us to abandon the auxiliary network and design Soft Scale (SS)."
            ],
            "subsections": []
        },
        {
            "title": "E.1 RetailDet",
            "paragraphs": [
                "On SKU110k-R The result of RetailDet on SKU110k-R is compared with other methods in Table .7. RetailDet outperforms the state-of-the-art detectors CenterNet [72], DRN [45] and CFA [19] on SKU110k-r where products are in RBOX style. Following CFA, we use multi-scale training."
            ],
            "subsections": []
        },
        {
            "title": "Ablation Study Table.8 shows the improvement of each component brings to",
            "paragraphs": [
                "RetailDet. The Quad-Centerness (QC), Soft-Scale (SS) and Corner Refinement Module (CRM) gradually improve the mAP by 2.1, 1.0, 2.4 in the origin domain and 1.8, 0.6, 3.2 in the cross domain. And the improvement is consistent under different IOU thresholds."
            ],
            "subsections": []
        },
        {
            "title": "E.2 Inference Speed",
            "paragraphs": [
                "We report the inference speed of the key models in Table 9    "
            ],
            "subsections": []
        },
        {
            "title": "E.3 Qualitative Results",
            "paragraphs": [
                "We visualize the product detection results in Fig. 9, Fig. 10, and Fig. 11. The detector is our RetailDet two-stage variant with ResNext101. The average testing speed is 2.8FPS. We only visualize the QUADs with confident scores higher than 0.3. We show some failure cases in the cross domain in We show the OCR results from DBNet and ABINet in Fig. 13."
            ],
            "subsections": []
        }
    ]
}