{
    "id": "https://semopenalex.org/work/W2224766666",
    "authors": [
        "Richard R. Grote",
        "Lee C. Bassett"
    ],
    "title": "Single-mode optical waveguides on native high-refractive-index substrates",
    "date": "2016-10-01",
    "abstract": "High-refractive-index semiconductor optical waveguides form the basis for modern photonic integrated circuits (PICs) , but the conventional methods of achieving optical confinement require a thick lower-refractive-index support layer that impedes large-scale co-integration with electronics. To address this challenge, we present a general architecture for single-mode waveguides that confine light in a high-refractive-index material on a native substrate. Our waveguide consists of a high-aspect-ratio fin of the guiding material surrounded by lower-refractive-index dielectrics and is compatible with standard top-down fabrication techniques. The proposed waveguide geometry removes the need for a buried-oxide-layer in silicon photonics, as well as the InGaAsP layer in InP-based PICs and will allow for photonic integration on emerging material platforms such as diamond and SiC.",
    "sections": [
        {
            "title": "Single-mode optical waveguides on native high-refractive-index substrates",
            "paragraphs": [
                "High-refractive-index semiconductor optical waveguides form the basis for modern photonic integrated circuits (PICs). However, conventional methods for achieving optical confinement require a thick lower-refractive-index support layer that impedes large-scale co-integration with electronics and limits the materials on which PICs can be fabricated. To address this challenge, we present a general architecture for single-mode waveguides that confine light in a high-refractive-index material on a native substrate. The waveguide consists of a high-aspect-ratio fin of the guiding material surrounded by lower-refractive-index dielectrics and is compatible with standard top-down fabrication techniques. This letter describes a physically intuitive, semi-analytical, effective index model for designing fin waveguides, which is confirmed with fully vectorial numerical simulations. Design examples are presented for diamond and silicon at visible and telecommunications wavelengths, respectively, along with calculations of propagation loss due to bending, scattering, and substrate leakage. Potential methods of fabrication are also discussed. The proposed waveguide geometry allows PICs to be fabricated alongside silicon CMOS electronics on the same wafer, removes the need for heteroepitaxy in III-V PICs, and will enable wafer-scale photonic integration on emerging material platforms such as diamond and SiC. C 2016 Author(s). All article content, except where otherwise noted, is licensed under a Creative Commons Attribution (CC BY) license (http://creativecommons.org/licenses/by/4.0/). [http://dx.doi.org/10.1063/1.4955065] Photonic integrated circuits (PICs) are rapidly being developed for high-refractive index materials that allow for tight optical confinement, small on-chip bend radii, and strong light-matter interactions. For example, high-performance PICs in both silicon 1 and InP 2,3 platforms are playing an increasingly important role in data applications with the potential to enable exascale computing 4 and on-chip core-to-core optical communication. 5 Similarly, wide-band gap semiconductors, such as diamond [6][7][8][9][10][11][12][13] and SiC, 14 have emerged as promising materials for a plethora of new PIC applications. Among these are non-linear optics [12][13][14] and integrated quantum information processing, [8][9][10][11]15 which is enabled by the presence of spin defects with desirable quantum properties. 16,17 Common to all of these applications is a need for low-propagation-loss single-mode waveguides that can be fabricated on a high-refractive-index substrate in a scalable fashion. While a high refractive index is beneficial for optical design, it also requires a buried lower-refractive-index layer and the transfer or growth of thin films of high-index material, 1-3,6-8,10,12-14,18 free-standing structures, 9,11,19 or pedestals 20 to minimize optical power leakage from the waveguide into the substrate. These approaches limit the device robustness, uniformity, and scalability required for the development of dense PICs on wide-bandgap semiconductors.",
                "Even on mature PIC platforms, optical confinement presents significant technological challenges. In silicon photonics, the buried-oxide-layer thickness required for optical confinement is much larger than the optimum for VLSI electronics, making co-integration difficult. 5,18,19 For FIG. 1. The fin waveguide: An example of a fin waveguide on a diamond substrate designed for λ = 637 nm. The geometry supports a single mode when n f > n H > n L . The profile of the confined optical mode shown in cross section has been calculated using finite difference method.",
                "InP-based PICs, optical confinement is limited by the low index contrast between InP and InGaAsP. 2,3 Here, we propose a new type of waveguide optimized for high-index substrates that utilizes stacked dielectric layers to confine light in the top of a fin of high-index material. An example of a SiO 2 /Si 3 N 4 stack on a diamond fin/substrate at a wavelength of λ = 637 nm is shown in Fig. 1. Although the refractive index of both the buffer and confinement layers (n L = n SiO 2 ≈ 1.45 and n H = n Si 3 N 4 ≈ 2.0, respectively) is lower than that of the fin and substrate (n f = n diamond ≈ 2.4), the proposed design achieves confinement by engineering the effective index, resulting in an optical mode confined within the high-index material (diamond in the case of Fig. 1). This waveguide mode is a localized eigenmode that can propagate without leaking power into the underlying substrate, while the waveguide itself can be fabricated using conventional top-down lithography, etching, dielectric deposition, and planarization techniques. Though optical confinement has been achieved by effective index variations in many contexts, including high-Q cavities formed by photonic crystal waveguides 21 and photonic crystal fibers, 22 our application of this approach to vertically stacked slab waveguides obviates the need for a buried low-index layer, providing a pathway towards large-area, scalable PICs on native substrates.",
                "Figures 2(a) and 2(b) illustrate an intuitive physical picture that accounts for optical confinement in the fin waveguide geometry using the effective index method, 23 the results of which are confirmed using a fully vectorial finite difference method. 24 By treating the two-dimensional cross section of the ẑ-invariant waveguide dielectric topology in Fig. 2 This treatment is a key to understanding the nature of confinement in the fin structure: a fin mode exists when the effective index of the two-dimensionally confined structure, n eff , satisfies the condition:",
                ", n H }, as indicated by the green and blue shaded regions in Fig. 2(c). When this condition is not met, the confined modes are degenerate with a continuum of radiation modes and become leaky, as indicated by the gray hatched region in Fig. 2(c). In essence, vertical confinement of the fin waveguide mode is achieved by total internal reflection at the interface between slab waveguides rather than the interface between homogeneous media. As a consequence of the effective index confinement in the fin structure, only a single mode in x is supported for the refractive index values chosen in Fig. 2(c). Higher-order modes can be confined for a different choice of material indices, but only if higher-order modes of Slab 1 are contained in the blue or green shaded region of Fig. 2(c), i.e., they must have an effective index larger than the lowest-order mode of Slab 2.",
                "The supported modes of the two-dimensionally confined structure are found by solving for the modes of the ŷ-confined slab waveguide in Fig. 2(b). The resulting fin mode dispersion as a function of normalized waveguide height, h/λ [Fig. 2(d)], has two distinct regions that depend on the fin width, w, Region I : n x eff,2 < n H ; w < w symm (green shading), Region II : n x eff,2 > n H ; w > w symm (blue shading). The boundary between these two regions occurs when n x eff,2 = n H at a width that we label w = w symm , which is indicated by a vertical red line in Fig. 2(c) and the red dispersion curve (w symm /λ = 0.25) in Fig. 2(d). For an asymmetric slab waveguide, the higher-refractive-index cladding determines both the cutoff condition and the effective mode width. In Region I, the properties of the asymmetric waveguide are determined by n H , while in Region II, this role is taken by n x eff,2 . The change in cutoff condition between the two regions causes the inflection point in the cutoff height [boundary for the multimode region in Fig. 2(d)] at w symm . While the fin waveguide can only be single or few mode in width, it can be multimode in height, as indicated in Fig. 2(d).",
                "The dispersion curves provide the allowable geometry and wavelength at which confined modes are supported. Within these constraints, the mode area, A eff , and confinement factor, Γ, which quantifies the overlap between the optical mode and the guiding material, provide useful design metrics for maximizing light-matter interactions in fin waveguides. 25 In Fig 3(a), we calculate A eff for a series of w/λ and plot the minimum, A min , along with the corresponding height, h min /λ. Mode intensity profiles for three values of w/λ are also shown in Fig. 3(a), and the corresponding Γ at A min is plotted in Fig. 3(b).",
                "In Region I most of the field penetration occurs in the confinement layer, relaxing the requirements on the buffer layer thickness for low leakage at the expense of reduced Γ. Conversely, in Region II A min increases with w/λ, Γ approaches unity, and the mode extends within the fin into the buffer layer. Waveguides designed in this region may be desirable for high-power applications. The tightest confinement (smallest A min ) occurs at w symm , which also corresponds to the maximum group index, N g = c/v g , where c is the vacuum speed of light and v g is the modal group velocity, making w = w symm an ideal design criterion for maximizing light-matter interactions. 25 The waveguide properties in Figs. 2 and3 have been calculated for the lowest-order mode with the dominant electric field component along x, commonly referred to as the quasi-TE mode. Discussion of the lowest order quasi-TM mode (dominant electric field component along ŷ), higher order modes, and further details of our semi-analytical and numerical calculations are provided in the supplementary material. 25 To illustrate the potential of the fin waveguide, we explore geometries in two important material platforms for PICs: diamond and silicon. The diamond waveguide is designed with an SiO 2 buffer layer, a conformal 200 nm-thick Si 3 N 4 confinement layer, and SiO 2 overcladding for single-mode operation at λ = 637 nm. The operating wavelength corresponds to the nitrogen-vacancy center zero phonon line, 8 which is used to achieve coherent spin-light interactions 26 and distributed entanglement 27 between diamond spins. We design the waveguide for the tightest confinement with w = w symm as discussed above. The waveguide dispersion and group index are shown in Fig. 4(a), along with the waveguide dimensions and calculated mode intensity profile at λ = 637 nm. For a buffer layer thickness exceeding 1.0 µm (total fin height 1.35 µm, corresponding to an aspect ratio >6.75:1) the calculated propagation loss due to substrate leakage is <0.15 dB/cm, which is small enough that scattering due to fabrication imperfections in a realistic device would be expected to dominate (see below). The bending loss for a radius of 10 µm is determined to be <0.03 dB per 90 • bend with a buffer layer thickness of 1.0 µm, corresponding to an unloaded Q exceeding 60 000 for a 20 µm-diameter ring resonator.",
                "Similarly, the silicon waveguide depicted in Fig. 4(b) is designed for minimum mode area at λ = 1.55 µm for telecommunications applications. With a buffer layer thickness exceeding 1.5 µm (fin aspect ratio >9.75:1), the propagation loss due to substrate leakage is calculated to be <0.1 dB/cm. The bending loss for a radius of 10 µm is determined to be <0.1 dB per 90 • bend with a buffer layer of 1.5 µm, corresponding to an unloaded Q exceeding 10,000 for a 20 µm-diameter ring resonator.",
                "The predictions above ignore scattering losses due to sidewall roughness, which is a consequence of the dry etching techniques commonly used to fabricate waveguides. In comparison to conventional silicon waveguides, we find that the maximal-confinement fin architecture exhibits similar propagation loss due to sidewall roughness compared to a 500 nm × 250 nm channel waveguide clad with air or SiO 2 . Results of these calculations, additional details of fin waveguide modeling, and a design example for SiC are provided in the supplementary material. 25 Figure 4(c) depicts a process flow for fabricating fin waveguides on an arbitrary high-index substrate. All of the steps are well-established, top-down fabrication techniques that can be applied to a wide range of materials. The required aspect ratios of the fins in Figs. 4(a) and 4(b) can be achieved through anisotropic inductively coupled plasma reactive ion etching (ICP-RIE), for which aspect ratios exceeding 10:1 in diamond 28 and 50:1 in Si 29 have been demonstrated. High-aspectratio fins are already employed in InP-based PICs, 30 where the fin waveguide design can provide an alternative to the conventional InGaAsP guiding layer, leading to higher confinement and smaller mode area.",
                "The dielectric stack can be fabricated using standard lithography, deposition, and planarization techniques [Fig. 4(c)], following a similar process flow to that used for high-aspect-ratio (>10:1) CMOS FinFETs. 31 Indeed, all of the required steps are silicon-CMOS compatible, providing exciting opportunities for the realization of electronic-photonic co-integration and novel device structures. For example, high-speed active devices in CMOS-compatible silicon PICs could be achieved through alignment of the fin waveguide with vertical p-i-n junctions. 32 Although the examples in Figs. 4(a) and 4(b) use a SiO 2 /Si 3 N 4 dielectric stack, the fin waveguide can be designed for any pair of materials with n H > n L . Further details about the fabrication methods, alternative dielectric materials, and CMOS-compatible implementations are provided in the supplementary material. 25 One challenge with the proposed architecture is the incorporation of devices that are typically multimode, such as Y-branches and grating couplers, since higher-order modes in x are leaky. We envision a solution to this challenge in the form of supermode devices, where multimode propagation is achieved by coupled arrays of single-mode waveguides.",
                "In summary, we have proposed a new waveguide design for native high-refractive-index substrates. This method is compatible with standard fabrication processes and alleviates the need for a buried low-index layer, providing a potential route for CMOS-compatible co-integration of silicon photonics with VLSI electronics. Furthermore, the geometry can be adapted for any high-index substrate material, which will lead to rapid development of PICs on emerging materials platforms for nonlinear photonics, quantum information processing, and sensing applications."
            ],
            "subsections": []
        }
    ]
}