{
    "id": "US20220259298",
    "authors": [
        "Katsu Takahashi",
        "Manabu Sugai",
        "Yoshihito Tokita",
        "Junichi Takagi",
        "Emiko Mihara"
    ],
    "title": "Neutralizing Antibody for Tooth Regeneration Treatment Targeting USAG-1 Molecule",
    "date": "2020-07-10 00:00:00",
    "abstract": "Provided are: an antibody which specifically binds to and neutralizes USAG-1 or an antigen-binding fragment thereof; and a pharmaceutical composition containing the antibody or the antigen-binding fragment.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a neutralizing antibody targeting USAG-1 for the treatment of tooth agenesis or tooth regeneration."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce tooth agenesis treatment"
                    ],
                    "num_characters": 132,
                    "outline_medium": [
                        "introduce technical field"
                    ],
                    "outline_short": [
                        "introduce tooth agenesis treatment"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "In the majority of patients, acquired diseases such as dental caries and periodontal disease result in tooth agenesis (patients with loss of teeth). As high as 1% incidence rate of congenital tooth agenesis is also reported. Currently, the only treatment method for missing teeth is prosthetic treatment which includes dental implants and dentures, and there is no fundamental treatment method. Numerous studies of tooth regeneration using tissue engineering approaches have been reported. Various cells such as stem cells (Non-Patent Literature 1) are used as cell sources. In addition, in order to allow teeth made in vitro to function in the oral cavity, an “organ primordium method” (Non-Patent Literature 2), a cell manipulation technology for regenerating a dental organ primordium (the rudiment of the organ) in a collagen gel, has been reported. However, owing to cost and safety problems for securing cell sources, tissue engineering approaches have not reached clinical application.",
                        "A large number of causative genes for congenital tooth agenesis have been identified, and many of them are common to both human and mouse. For example, RUNX2, MSX1, EDA, WNT10A, PAX9, AXIN2 etc. are known. Among the listed genes, WNT10A gene has been reported to cause congenital tooth agenesis in the largest number of patients. EDA gene is a causative gene for anhidrotic ectodermal dysplasia, which is a representative disease of syndromic congenital tooth agenesis. Congenital tooth agenesis is caused by tooth development stopped prematurely due to defect in the causative gene and suppression of the function of the causative gene."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe tooth agenesis problem",
                        "limitations of current treatments",
                        "prior art in tooth regeneration"
                    ],
                    "num_characters": 1631,
                    "outline_medium": [
                        "describe tooth agenesis"
                    ],
                    "outline_short": [
                        "summarize tooth agenesis causes and limitations"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Problem to be Solved by Invention",
                            "paragraphs": [
                                "From a therapeutic viewpoint, the inventors conceived of a novel treatment method to treat congenital tooth agenesis. The new approach promotes differentiation induction from the state of tooth development that has been stopped prematurely to form a complete tooth. Object of the present invention is to provide a technique for treating tooth agenesis which comprises utilizing the differentiation induction inherent in a tooth organ, instead of utilizing surgical tissue transplantation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "identify problem of tooth agenesis"
                            ],
                            "num_characters": 488,
                            "outline_medium": [
                                "state problem"
                            ],
                            "outline_short": [
                                "identify tooth agenesis treatment problem"
                            ]
                        },
                        {
                            "title": "Solution for Problem",
                            "paragraphs": [
                                "As a result of diligent research, the present inventors succeeded in developing a neutralizing antibody targeting USAG-1. Furthermore, they found that administration of the antibody regenerated missing teeth in congenital tooth agenesis model mice and formed supernumerary teeth in congenital tooth agenesis model mice or wild-type mice. Thus the present invention was completed.",
                                "That is, the present invention relates to:",
                                "[1] An antibody or antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1;",
                                "[2] The antibody or antigen fragment thereof according to [1], which specifically binds to USAG-1 and neutralizes BMP signaling inhibitory activity of USAG-1;",
                                "[3] The antibody or antigen fragment thereof according to [1] or [2], which specifically binds to USAG-1 and neutralizes WNT signaling inhibitory activity of USAG-1;",
                                "[4] The antibody or antigen-binding fragment thereof according to any one of [1] to [3], which comprises:",
                                "(a) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively;",
                                "(b) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively;",
                                "(c) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively;",
                                "(d) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively; or",
                                "(e) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively;",
                                "[5] The antibody or antigen-binding fragment thereof according to any one of [1] to [4], which comprises:",
                                "(f) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4;",
                                "(g) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14;",
                                "(h) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24;",
                                "(i) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41; or",
                                "(j) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51;",
                                "[6] The antibody or antigen-binding fragment thereof according to any one of [1] to [3], which comprises:",
                                "(k) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively;",
                                "(l) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively;",
                                "(m) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively;",
                                "(n) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively; or",
                                "(o) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively;",
                                "[7] The antibody or antigen-binding fragment thereof according to any one of [1] to [3] and [6], which comprises:",
                                "(p) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4;",
                                "(q) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14;",
                                "(r) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24;",
                                "(s) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41; or",
                                "(t) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51;",
                                "[8] An antibody or antigen-binding fragment thereof that competes with the antibody or antigen-binding fragment thereof according to any one of [4] to [7] for binding to USAG-1;",
                                "[9] The antibody or antigen-binding fragment thereof according to any one of [1] to [8], wherein the antibody is a humanized antibody or a chimeric antibody; and",
                                "[10] A pharmaceutical composition for dental regenerative therapy, which comprises the antibody or antigen-binding fragment thereof according to any one of [1] to [9]."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "propose neutralizing antibody targeting USAG-1",
                                "describe antibody's effect on tooth regeneration",
                                "define antibody or antigen-binding fragment",
                                "specify antibody's binding to USAG-1",
                                "describe antibody's neutralization of BMP signaling",
                                "describe antibody's neutralization of WNT signaling",
                                "specify heavy chain complementarity determining regions",
                                "specify light chain complementarity determining regions",
                                "specify heavy chain variable region",
                                "specify light chain variable region",
                                "describe antibody's composition",
                                "describe antibody's binding to USAG-1 and neutralization",
                                "specify heavy chain and light chain complementarity determining regions",
                                "specify heavy chain and light chain variable regions",
                                "describe antibody that competes with USAG-1 binding",
                                "specify humanized or chimeric antibody",
                                "describe pharmaceutical composition for dental regenerative therapy",
                                "specify antibody's use in tooth regenerative therapy",
                                "describe clinical application of antibody treatment"
                            ],
                            "num_characters": 9749,
                            "outline_medium": [
                                "introduce neutralizing antibody",
                                "describe antibody's effect",
                                "specify antibody's target",
                                "describe antibody's structure",
                                "specify antibody's sequence",
                                "describe antibody's binding",
                                "describe antibody's competition",
                                "specify antibody's type",
                                "describe pharmaceutical composition"
                            ],
                            "outline_short": [
                                "introduce neutralizing antibody targeting USAG-1",
                                "describe antibody's effect on tooth regeneration",
                                "list antibody's characteristics",
                                "outline pharmaceutical composition"
                            ]
                        },
                        {
                            "title": "Effects of the Invention",
                            "paragraphs": [
                                "In the present invention, we succeeded in regenerating teeth in vivo by using an antibody preparation. Treatment with the antibody preparation of the present invention can be clinically applied as a tooth regenerative therapy in a general dental and oral surgical approach such as conventional tooth extraction, orthodontics, and tooth transplantation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe benefits of tooth regenerative therapy"
                            ],
                            "num_characters": 352,
                            "outline_medium": [
                                "describe effects of invention"
                            ],
                            "outline_short": [
                                "highlight clinical application of invention"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "MODE FOR CARRYING OUT THE INVENTION",
                    "paragraphs": [
                        "USAG-1 (Uterine Sensitization Associated Gene-1) is a bone morphogenetic protein (BMP) antagonist and a Wnt antagonist, and is also called Sostdc-1, Ectodin, or Wise. It is known that in USAG-1 deficient model mice, an increase in BMP signaling is observed, leading to the formation of supernumerary teeth. The present inventors crossed a Runx2-deficient mouse, which is a model mouse for congenital tooth agenesis, with a USAG-1 gene-deficient mouse, which is a model mouse for supernumerary teeth (teeth exceeding the normal number of teeth), to produce a double-knockout mouse. As a result of analysis of the double-knockout mouse, it was found that tooth formation was recovered. Thus it was suggested that inhibition of USAG-1 could treat tooth agenesis.",
                        "This time, the present inventors crossed congenital tooth agenesis model mice lacking causative genes Msx1, Eda and Wnt10a other than Runx2 with an USAG-1 gene-deficient mouse that was newly created by CRISPER-CAS9 system as a model mouse for supernumerary teeth, to produce double-knockout mice. As a result of analysis of the double-knockout mice, it was found that tooth formation was recovered in all the tooth agenesis model mice. Thus it was shown that the treatment by inhibition of USAG-1 can be applied to patients with congenital tooth agenesis caused by various gene mutations.",
                        "Then, in the present invention, a human USAG-1 recombinant protein whose activity was confirmed was used as an antigen to produce antibodies. Thus antibodies that specifically bind to USAG-1 were obtained. These antibodies were found to increase BMP signaling and/or Wnt signaling.",
                        "Therefore, an aspect of the present invention provides an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, that is, an anti-USAG-1 neutralizing antibody and an antigen-binding fragment thereof. As used herein unless otherwise specified, USAG-1 means mammalian USAG-1. Examples of the mammal include, but not limited to, a human, a dog, a cat, a horse, a mouse, a ferret, a suncus, a pig, and a monkey, and a human is preferable.",
                        "As used herein, neutralizing refers to inhibiting the function of USAG-1. The functions of USAG-1 include, for example, BMP signaling inhibitory activity (also referred to as “BMP antagonist activity”) and Wnt signaling inhibitory activity (also referred to as “Wnt antagonist activity”). The antibody or antigen-binding fragment thereof of the present disclosure inhibits the BMP signaling inhibitory activity and/or the Wnt signaling inhibitory activity of USAG-1. Therefore, the antibody or antigen-binding fragment thereof of the present disclosure neutralizes either or both of the BMP signaling inhibitory activity of USAG-1 and the Wnt signaling inhibitory activity of USAG-1. For example, the antibody or antigen-binding fragment thereof of the present disclosure includes, but not limited to, an antibody or an antigen-binding fragment thereof that specifically binds to USAG-1 and neutralizes the BMP signaling inhibitory activity of USAG-1 and does not neutralize the Wnt signaling inhibitory activity of USAG-1, and an antibody or an antigen-binding fragment thereof that specifically binds to USAG-1 to neutralize the Wnt signaling inhibitory activity of USAG-1 and does not neutralize the BMP signaling inhibitory activity of USAG-1. As used herein, “inhibition” includes suppression and reduction.",
                        "The neutralizing activity of an antibody or an antigen-binding fragment may be determined by a conventional method. The activity of neutralizing the BMP antagonist activity of USAG-1 (also referred to as “BMP antagonist neutralizing activity”) can be measured in vitro by, for example, an ALP (alkaline phosphatase) assay or a reporter assay. In the ALP assay, for example, osteoblast progenitor cells and the like are cultured in the presence of BMP with addition of USAG-1 protein and an antibody or an antigen-binding fragment thereof, and ALP generated when differentiation into osteoblasts is induced is measured. The activity of neutralizing the Wnt antagonist activity of USAG-1 (also referred to as “Wnt antagonist neutralizing activity”) can be determined in vitro, for example, by a reporter assay. In the reporter assay, for example, a vector containing a promoter region that reacts with BMP or Wnt, ligated to a reporter gene such as luciferase is introduced into a cell, the cell is cultured in the presence of BMP or Wnt with addition of USAG-1 protein and an antibody or an antigen-binding fragment thereof, and expressed luciferase activity is measured. The BMP antagonist activity to be neutralized by the anti-USAG-1 antibody or antigen-binding fragment thereof of the present disclosure may be an antagonist activity against any BMP family. For example, the anti-USAG-1 antibody or antigen-binding fragment thereof of the present disclosure may neutralize the antagonist activity against BMP2, BMP4, BMP6, BMP7, etc. The Wnt antagonist activity to be neutralized by the anti-USAG-1 antibody or antigen-binding fragment thereof of the present disclosure may be an antagonist activity against any Wnt family. For example, the anti-USAG-1 antibody or antigen-binding fragment thereof of the present disclosure may neutralize the antagonist activity against Wnt-1, Wnt-3, etc.",
                        "Furthermore, in the present invention, five of the obtained antibodies, namely antibody A, antibody B, antibody C, antibody D and antibody E were sequenced and analyzed. Then, the variable regions and complementarity determining regions of each antibody were determined. Antibody A comprises a heavy chain comprising an amino acid sequence set forth in SEQ ID NO: 1 and a light chain comprising an amino acid sequence set forth in SEQ ID NO: 2, and the heavy chain comprises a heavy chain variable region (SEQ ID NO: 3) comprising heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7, and the light chain comprises a light chain variable regions (SEQ ID NO: 4) comprising light chain complementarity determining regions set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10. The antibody B comprises a heavy chain comprising an amino acid sequence set forth in SEQ ID NO: 11 and a light chain comprising an amino acid sequence set forth in SEQ ID NO: 12, and the heavy chain comprises a heavy chain variable region (SEQ ID NO: 13) comprising heavy chain complementarity determining regions set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17, and the light chain comprises a light chain variable regions (SEQ ID NO: 14) comprising light chain complementarity determining regions set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20. The antibody C comprises a heavy chain comprising an amino acid sequence set forth in SEQ ID NO: 21 and a light chain comprising an amino acid sequence set forth in SEQ ID NO: 22, and the heavy chain comprises a heavy chain variable region (SEQ ID NO: 23) comprising heavy chain complementarity determining regions set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27, and the light chain comprises a light chain variable regions (SEQ ID NO: 24) comprising light chain complementarity determining regions set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30. The antibody D comprises a heavy chain comprising an amino acid sequence set forth in SEQ ID NO: 38 and a light chain comprising an amino acid sequence set forth in SEQ ID NO: 39, and the heavy chain comprises a heavy chain variable region (SEQ ID NO: 40) comprising heavy chain complementarity determining regions set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44, and the light chain comprises a light chain variable regions (SEQ ID NO: 41) comprising light chain complementarity determining regions set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47. The antibody E comprises a heavy chain comprising an amino acid sequence set forth in SEQ ID NO: 48 and a light chain comprising an amino acid sequence set forth in SEQ ID NO: 49, and the heavy chain comprises a heavy chain variable region (SEQ ID NO: 50) comprising heavy chain complementarity determining regions set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54, and the light chain comprises a light chain variable regions (SEQ ID NO: 51) comprising light chain complementarity determining regions set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57. The antibody A, antibody B and antibody C particularly have BMP antagonist neutralizing activity. The antibody C particularly has both BMP antagonist neutralizing activity and Wnt antagonist neutralizing activity. The antibody D and antibody E particularly have Wnt antagonist neutralizing activity.",
                        "Therefore, in an aspect of the present invention, antibody A, antibody B, antibody C, antibody D, and antibody E and their mutants are provided as the antibody or antigen-binding fragment thereof of the present disclosure. An example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody A or a mutant includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 4. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1 and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 4.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 4, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 3 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 4, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 4. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 4.",
                        "A further example of antibody A or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 4, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 3 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 4, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "An example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody B or a mutant includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 14. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 14.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 14, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 13 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 14, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 14. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 14.",
                        "A further example of antibody B or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 14, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 13 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 14, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "An example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively or three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively, or three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody C or a mutant includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 24. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 24.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 24, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 23 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 24, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 24. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 24.",
                        "A further example of antibody C or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 24, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 23 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 24, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "An example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody D or a mutant includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 41. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 41.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 41, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 40 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 41, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 47 and SEQ ID NO: 48 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 41. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 41.",
                        "A further example of antibody D or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 41, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 40 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 41, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "An example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively or three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody E or a mutant includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 51. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 51.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 51, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 50 or a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 51, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions comprising amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions consisting of amino acid sequences having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively. Still more preferably provides is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions comprising amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises three heavy chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively and three light chain complementarity determining regions consisting of amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region comprising an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 51. More preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region consisting of an amino acid sequence having at least 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% or 99% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51. Still more preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, and comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 51.",
                        "A further example of antibody E or a mutant thereof includes an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region comprising an amino acid sequence set forth in SEQ ID NO: 51, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences. Preferably provided is an antibody or an antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1, comprises a heavy chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 50 and a light chain variable region consisting of an amino acid sequence set forth in SEQ ID NO: 51, and comprises substitution, deletion, insertion or addition of one to several amino acid residues in at least one of the above-mentioned amino acid sequences.",
                        "As used herein, the term “several” means about 2 to 10, and preferably means, depending on the length of an amino acid sequence, about 2 to 7, for example, 3, 4, 5, or 6. As used herein, the “substitution” may be a conservative or non-conservative substitution, and preferably a conservative substitution. Conservative substitution is known to those skilled in the art, and refers to a substitution that does not affect the biological activity of the resulting molecule. Examples of conservative amino acid substitution include a substitution of alanine to glycine or serine, a substitution of arginine to lysine or histidine, a substitution of asparagine to glutamine or histidine, a substitution of aspartic acid to glutamic acid or asparagine, a substitution of cysteine to serine or alanine, a substitution of glutamine to asparagine, a substitution of glutamic acid to aspartic acid or glutamine, a substitution of glycine to alanine, a substitution of histidine to asparagine or glutamine, a substitution of isoleucine to leucine or valine, a substitution of leucine to isoleucine or valine, a substitution of lysine to arginine or histidine, a substitution of methionine to leucine, isoleucine or tyrosine, a substitution of phenylalanine to tyrosine, methionine or leucine, a substitution of proline to alanine, a substitution of serine to threonine, a substitution of threonine to serine, a substitution of tryptophan to tyrosine or phenylalanine, a substitution of tyrosine to tryptophan or phenylalanine, and a substitution of valine to isoleucine or leucine.",
                        "As used herein, the sequence identity may be determined in optimal alignment of two sequences according to a conventional method. For example, the sequence identity may be determined using an algorithm known in the art, such as BLAST or FASTA. The antibody or antigen-binding fragment thereof of the present disclosure may comprise substitution, deletion, insertion or addition of an amino acid residue(s) within the above-mentioned range of sequence identity.",
                        "Further, in another aspect of the present invention, an antibody or an antigen-binding fragment thereof that binds to a whole extent or a part of the same epitope as an epitope on USAG-1 to which the antibody A, antibody B, antibody C, antibody D or antibody E, or a mutant thereof, or an antigen-binding fragment thereof binds is provided as the antibody or antigen-binding fragment thereof of the present disclosure. Furthermore, the present invention provides an antibody or an antigen-binding fragment thereof that competes with the antibody A, antibody B, antibody C, antibody D or antibody E, or a mutant thereof, or an antigen-binding fragment thereof for binding to USAG-1 or for binding to a whole extent or a part of an epitope on USAG-1.",
                        "Furthermore, in the present invention, the antibody A was found to recognize and bind a polypeptide (epitope) comprising VNDKTRTQRI (SEQ ID NO: 31) on human USAG-1 (corresponding to a sequence of the 134th to 143rd amino acids of human USAG-1 protein). Therefore, an antibody or an antigen-binding fragment thereof that binds to a USAG-1 polypeptide comprising the amino acid sequence set forth in SEQ ID NO: 31 is also an aspect of the antibody or antigen-binding fragment thereof of the present disclosure. Further, an antibody or an antigen-binding fragment thereof that competes with the antibody A or a mutant thereof or an antigen-binding fragment thereof for binding to a USAG-1 polypeptide comprising the amino acid sequence set forth in SEQ ID NO: 31 is also an aspect of the antibody or antigen-binding fragment thereof of the present disclosure. For example, the USAG-1 polypeptide may be a polypeptide consisting of the amino acid sequence set forth in SEQ ID NO: 31. The USAG-1 polypeptide comprising the amino acid sequence set forth in SEQ ID NO: 31 may be substantially the same polypeptide as the USAG-1 polypeptide comprising the amino acid sequence set forth in SEQ ID NO: 31. Examples of the substantially same polypeptide include a polypeptide located at the corresponding positions on USAG-1 protein of an animal other than human.",
                        "As used herein, the term “competition” means that an antibody or an antigen-binding fragment thereof competes with a reference antibody (e.g., antibody A, antibody B, antibody C, antibody D, antibody E, or a mutant thereof, or an antigen-binding fragment thereof) in a binding assay using an USAG-1 protein or polypeptide. For example, if a test antibody or an antigen-binding fragment thereof reduces the binding of a reference antibody to an USAG-1 protein or polypeptide in the binding assay, the test antibody “competes” with the reference antibody. An antibody that competes with a reference antibody, for example, reduces the binding of the reference antibody to an antigen protein or polypeptide by at least about 40%, preferably at least about 50%, more preferably at least about 60%, still more preferably at least about 80%, or still more preferably at least 90%. The competitive binding assay can be performed by known methods in the art including, but not limited to, ELISA, flow cytometry, SPR (surface plasmon resonance), and BLI (Bio-Layer Interferometry).",
                        "Epitope binning is a technique for classifying two or more antibodies based on their epitopes, for example, by using SPR or BLI. In epitope binning, for example, an antigen protein (target) is added to a biosensor on which a reference antibody is immobilized to allow the reference antibody to bind the target, the biosensor holding a complex of the reference antibody and the target is reacted with a test antibody, and then, binding of the test antibody to the biosensor (i.e., binding of the test antibody to the target captured by the reference antibody immobilized on the biosensor) and dissociation of the binding are analyzed. If the test antibody shares the same epitope with the reference antibody, the test antibody cannot bind to the biosensor because the epitope on the target is already occupied by the binding of the reference antibody. Conversely, if the test antibody recognizes a different epitope from that recognized by the reference antibody, the test antibody can bind to the biosensor. Furthermore, if the test antibody recognizes a region sterically close to an epitope recognized by the reference antibody, the test antibody cannot bind to the biosensor because the binding of the reference antibody to the target interferes with the binding of the test antibody to the epitope. Thus, use of epitope binning enables to determine whether two or more antibody clones compete for binding to a target protein.",
                        "The antibody or antigen-binding fragment thereof of the present disclosure binds to USAG-1 or a whole extent or a part of an epitope on USAG-1 at a KD of for example 1 μM or less, preferably 100 nM or less, more preferably 50 nM or less, still more preferably 30 nM or less, still more preferably 10 nM or less, still more preferably 8 nM or less, or still more preferably 5 nM or less.",
                        "In the present invention, the antibody is preferably an isolated antibody. In the present invention, the antibody may be a polyclonal antibody or a monoclonal antibody. In the present invention, the antibody may be a human antibody, a humanized antibody, a chimeric antibody, or a multispecific antibody (for example, a bispecific antibody). The humanized antibody includes a human immunoglobulin (recipient antibody) in which the complementarity determining regions (CDRs) of a recipient are replaced by residues from the CDRs of a non-human species (donor antibody) having desired specificity, affinity and binding ability. Optionally, the Fv framework region (FR) residues of the human immunoglobulin may be replaced by the corresponding non-human residues. In addition, the humanized antibody may comprise residues that are not found in the recipient antibody or the donor antibody. Generally, humanized antibodies comprise at least one variable region, typically two variable regions, in which all or substantially all CDRs are replaced by non-human immunoglobulin CDRs and all or substantially all of FR regions consist of human immunoglobulin sequences. The chimeric antibody includes an antibody produced by a genetic recombination technique in which variable regions derived from a donor antibody are linked to constant regions of a recipient antibody. The above antibodies can be produced by methods known in the art.",
                        "In the present invention, examples of the antigen-binding fragment include, but not limited to, F(ab′)2, Fab′, Fab, Fv, rIgG, Fd, a linear antibody, ScFv, Fv-clasp, a minibody, a diabody, a triabody, a tetrabody, a single domain antibody (nanobody), and a multispecific antibody formed from antibody fragments. The antibody fragments can be prepared by methods known in the art.",
                        "An isolated nucleic acid encoding the antibody or antigen-binding fragment thereof of the present disclosure is also included in the present invention.",
                        "The antibody or antigen-binding fragment thereof of the present disclosure specifically binds to USAG-1 to inhibit the function of USAG-1 and then induce tooth formation. Accordingly, another aspect of the present invention provides a pharmaceutical composition for dental regeneration therapy comprising the antibody or antigen-binding fragment thereof of the present disclosure. The dental regeneration includes, for example, regeneration of a missing tooth (recovery of a missing tooth), and formation of a new tooth such as a third dentition.",
                        "The pharmaceutical composition of the present disclosure may contain a pharmaceutically acceptable carrier, and an additive such as a stabilizer or an excipient, in addition to the antibody or antigen-binding fragment thereof of the present disclosure. Examples of the pharmaceutically acceptable carrier include, but not limited to, physiological saline, buffer, glycol, glycerol, gelatin, gelatin hydrogel, polylactic acid, collagen sponge, agarose, polyvinyl alcohol, alginic acid, fibrin gel, an ethylene-vinyl acetate copolymer, and a lactic acid-glycolic acid copolymer. Examples of the additive include, but not limited to, a carbohydrate such as glucose, sucrose or dextran, an antioxidant such as ascorbic acid or glutathione, a chelating agent, and a low molecular weight protein. Those skilled in the art can appropriately select the carrier and additive as mentioned above based on an administration form, administration route or the like of the pharmaceutical composition. Pharmaceutical composition of the present disclosure can be produced using the antibody or antigen-binding fragment thereof, and the additive as appropriate by a conventional method.",
                        "Examples of the form of the pharmaceutical composition of the present disclosure include a tablet, a powder, a capsule, a granule, a syrup, a sustained release tablet, a sustained release capsule, an enteric coated drug, an intercalating drug, an infusion, and an injection. A preferable example thereof is an injection. The pharmaceutical composition of the present disclosure is systemically or topically administered. The administration route may be appropriately selected by those skilled in the art, and examples thereof include, but not limited to, oral, nasal, subcutaneous, intravenous, intramuscular, and intraosseous administration. The pharmaceutical composition of the present disclosure may be locally administered, for example, to the site of tooth formation.",
                        "In the present invention, the dental regenerative therapy includes the treatment of congenital tooth agenesis and the treatment of acquired tooth loss. Congenital tooth agenesis that can be treated with the pharmaceutical composition of the present disclosure is not particularly limited, and may also include congenital tooth agenesis due to any causative gene. Examples of congenital tooth agenesis that can be treated with the pharmaceutical composition of the present disclosure include, but not limited to, congenital tooth agenesis whose causative gene is RUNX2, MSX1, EDA, WNT10A, PAX9, or AXIN2. Preferable examples thereof include congenital tooth agenesis whose causative gene is RUNX2, MSX1, EDA, or WNT10A. Further, the antibody of the present disclosure induced the formation of supernumerary teeth in wild-type mice. Therefore, the pharmaceutical composition of the present disclosure can induce tooth formation even in normal individuals in which the causative gene of tooth agenesis is not deficient and individuals losing teeth after birth.",
                        "Pharmaceutical composition of the present disclosure may be administered to a mammal. Examples of the mammal include a human, a dog, a cat, a horse, a mouse, a ferret, a suncus, a pig, and a monkey. A preferable example thereof is a human.",
                        "A dose of the pharmaceutical composition of the present disclosure is not particularly limited. The dose can be appropriately determined by those skilled in the art based on the amount of the antibody or antigen-binding fragment thereof of the present disclosure contained in the pharmaceutical composition, the body weight of a subject to be administered, etc. so that a desired dose of the antibody or antigen-binding fragment thereof of the present disclosure can be administered. For example, the antibody or antigen-binding fragment thereof of the present disclosure is administered in an amount that produces a neutralizing activity such that BMP signaling is increased by at least 30%, preferably at least 60% and/or a neutralizing activity such that Wnt signaling is increased by at least 30%, preferably at least 60%, as compared with the case where the antibody or antigen-binding fragment thereof of the present disclosure is not administered. The neutralizing activities may be determined based on the activity measured in vitro by, for example, an ALP assay or a reporter assay.",
                        "A further aspect of the present invention provides a method of regenerating a tooth which comprises administering the antibody or antigen-binding fragment thereof of the present disclosure to a subject in need. The above-mentioned pharmaceutical composition can be used as the antibody or antigen-binding fragment thereof of the present disclosure. The subject in need is a subject having a missing tooth, and examples of the subject include mammals as mentioned above. A route of administration and a dose of the antibody or antigen-binding fragment thereof of the present disclosure, and the treatment for tooth regeneration are as described above for the pharmaceutical composition of the present disclosure.",
                        "Hereinafter, the present invention will be described in more detail with reference to Examples which the present invention is not limited to."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Preparation of Antibody 1**",
                                "For preparation of mouse USAG-1 neutralizing antibodies, a human USAG-1 protein derived from an Escherichia coli expression system (R & D systems) was used as an antigen. In a Wnt reporter assay using HEK293 cells, the Wnt inhibitory activity of the Escherichia coli expression system-derived human USAG-1 protein was confirmed (FIG. 1). In an ALP assay with addition of BMP7 using C2C12 cells, the BMP inhibitory activity of the Escherichia coli expression system-derived human USAG-1 protein was confirmed (FIG. 2). For preparation of mouse USAG-1 neutralizing antibodies, three lines of supernumerary tooth model mice, USAG-1KO mice (#116, #118, #138) were newly established using CRISPR-CAS9 (FIG. 3). The neutralizing antibodies were prepared using USAG-1 KO (#116) mice by an iliac lymph node method in ITM Co., Ltd.",
                                "Primary screening of 284 wells was performed by ELISA using the immunizing antigen, and a large number of positive wells were found (FIG. 4-1 and FIG. 4-2). Based on a cutoff value of 0.7, 79 clones were selected. After expansion, ELISA was performed using the immunizing antigen and a mouse USAG-1 protein derived from a CHO cell expression system that was prepared by Sysmex Corporation. When a cut-off value of absorbance was set to 0.025 or more, positive wells were found in about half of the clones (FIG. 4-1 and FIG. 4-2). As a result of measurement of antibody subclasses, they were found to be IgG1, 2a, 2b, and 2c (FIG. 4-1 and FIG. 4-2).",
                                "The neutralizing activity of each antibody was confirmed as follows. In an experimental system in which an ALP activity in C2C12 cells increased by addition of 300 ng/ml of BMP7 (manufactured by R & D systems) was suppressed by addition of 300 ng/ml of a mammalian cell expression system-derived rat USAG-1 protein (manufactured by MyBiosource), each antibody was added to confirm neutralization of the suppressed ALP activity. The antibodies were classified into a group of those having mild neutralizing activity (*: 60-100% neutralizing activity), a group of those having moderate neutralizing activity (**: 100-140% neutralizing activity), and a group of those having high neutralizing activity (***: 140% or more neutralizing activity). For a BMP reporter assay, a commercially available cell line incorporating BRE-Luc, BMP Responsive Reporter Osteoblast Cell Line (Briter cell) (manufactured by Kerafast, Inc.) was used. In an experimental system in which a luciferase activity expressed by addition of 300 ng/ml of BMP7 was suppressed by addition of 300 ng/ml of the mammalian cell expression system-derived rat USAG-1 protein, each antibody was added to confirm neutralization of the suppressed luciferase activity. The antibodies were classified into a group of those having mild neutralizing activity (*: 40-60% neutralizing activity) and a group of those having moderate neutralizing activity (**: 60% or more neutralizing activity). For the WNT reporter assay, an expression plasmid for expressing a TOP-Flash reporter gene having a DNA sequence to bind transcription factor TCF that activates downstream of the WNT signaling, a WNT1 gene, and a reporter gene under the control of an HSV-thymidine kinase promoter for obtaining an internal standard value was introduced into HEK293 cells, and the cells were cultured with addition of the mammalian cell expression system-derived rat USAG-1 protein at a concentration (EC50) for producing 50% of the maximum inhibitory effect on Wnt signaling. An addition amount of the USAG-1 protein was determined in advance. A culture supernatant of an antibody-producing hybridoma was added to the cells so as to be 25%, 20% or 10% in a medium for screening. The experiment was performed three times for evaluation. When added at 25%, the antibodies were classified into a group of those having mild neutralizing activity (*: a luminescence correction value of 1.5-2.0) and a group of those having moderate neutralizing activity (**: a luminescence correction value of 2.0 or more). When added at 20%, the antibodies were classified into a group of those having mild neutralizing activity (*: a luminescence correction value of 1-1.1) and a group of those having moderate neutralizing activity (**: a luminescence correction value of 1.1 or more). When added at 10%, the antibodies were classified into a group of those having mild neutralizing activity (*: a luminescence correction value of 1-1.1) and a group of those having moderate neutralizing activity (**: a luminescence correction value of 1.1 or more). The % of neutralizing activity was calculated based on the activity (100%) under the condition of no addition of USAG-1 protein. Neutralizing activity based on the luminescence value was calculated as a value relative to the activity (1) when no antibody was added.",
                                "As measured by the WNT and BMP reporter assays and the BMP7 ALP assay, there were three types of neutralizing antibodies: antibodies that activate either BMP or WNT signaling, and antibodies that simultaneously activate both BMP and WNT signaling. Six antibodies were selected based on the measurement results of neutralizing activity (FIG. 4-1 and FIG. 4-2). The activity of one clone disappeared during expansion and purification processes. Finally, 5 kinds of mouse anti-USAG-1 neutralizing antibodies (E12, E16, E37, E48, E57) were obtained.",
                                "Of these, E37 (referred to as antibody A) and E57 (referred to as antibody B) were sequenced. A full-length heavy chain sequence containing a signal sequence and a full-length light chain sequence containing a signal sequence of antibody A are shown in SEQ ID NO: 1 and SEQ ID NO: 2, respectively. A full-length heavy chain sequence containing a signal sequence and a full-length light chain sequence containing a signal sequence of antibody B are shown in SEQ ID NO: 11 and SEQ ID NO: 12, respectively. Variable regions of antibodies A and B are shown in FIG. 14."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare antibody 1",
                                "confirm Wnt inhibitory activity",
                                "confirm BMP inhibitory activity",
                                "establish USAG-1KO mice",
                                "prepare neutralizing antibodies",
                                "perform primary screening",
                                "select positive clones",
                                "measure antibody subclasses",
                                "confirm neutralizing activity",
                                "classify antibodies by neutralizing activity",
                                "obtain 5 kinds of mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "num_characters": 5946,
                            "outline_medium": [
                                "prepare antibody 1",
                                "confirm Wnt inhibitory activity",
                                "confirm BMP inhibitory activity",
                                "select and classify neutralizing antibodies",
                                "obtain 5 kinds of mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "outline_short": [
                                "prepare mouse USAG-1 neutralizing antibodies",
                                "characterize neutralizing activity"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**In Vitro Test of Antibody—1**",
                                "A mouse USAG-1 (WISE) recombinant protein with a PA tag added to the N-terminal was transiently expressed in Expi293F cells, and a stable expression line was established. Affinity purification was performed using a PA tag system to obtain 0.2 mg of PA-mUSAG-1 (WISE) from 150 mL of a culture supernatant (FIG. 5). The purified PA-mUSAG-1 (WISE) protein was shown to have a molecular weight of about 28 kDa, which is close to the theoretical value (24 kDa), by electrophoresis under reduction (R) and non-reduction (NR). The N-terminal PA-tagged mouse USAG-1 (WISE) protein derived from the mammalian cell Expi293F cell expression system showed dose-dependent WNT signaling inhibitory activity in the WNT reporter assay (FIG. 6) and dose-dependent BMP signaling inhibitory activity in the BMP ALP assay (FIG. 7). The mouse USAG-1 protein whose activity was confirmed was used to confirm the neutralizing activity of 5 mouse anti-USAG-1 neutralizing antibodies (E12, E16, E37, E48, E57). In the WNT reporter assay, cells into which a vector containing a luciferase gene ligated to a promoter and a vector for expressing Wnt1 were introduced were cultured in a medium with addition of 1.7 μg of the mouse USAG-1 recombinant protein and the antibody in an amount of 1/1000, 1/300 or 1/100 of the medium, and luciferase activity was measured. In the BMP ALP assay, C2C12 cells were cultured with 30 ng/ml of the mouse USAG-1 recombinant protein and a 1-fold (30 ng/ml), 10-fold (300 ng/ml) or 100-fold (3 μg/ml) amount of the antibody in the presence of 30 ng/ml of BMP7, and ALP activity was measured.",
                                "As a result, in the WNT reporter assay, the existence of antibodies that dose-dependently neutralized the WNT signaling inhibitory activity of the mouse USAG-1 was found (FIG. 8). In the BMP ALP assay, the existence of antibodies that dose-dependently neutralized the BMP signaling inhibitory activity of the mouse USAG-1 was found (FIG. 9)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "express and purify PA-mUSAG-1 protein",
                                "confirm WNT and BMP signaling inhibitory activity",
                                "confirm neutralizing activity of 5 mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "num_characters": 1973,
                            "outline_medium": [
                                "confirm neutralizing activity of 5 mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "outline_short": [
                                "test antibody in vitro"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**In Vivo Administration Test of Antibody—1**",
                                "A congenital tooth agenesis model mouse with homozygous EDA-deficiency has high loss (about 90%) of a mandibular third molar (M3). A single dose of the mouse anti-USAG-1 neutralizing antibody A (E37) was intraperitoneally administered to mother mice pregnant with congenital tooth agenesis model mouse due to EDA deficiency. As a result, loss of the mandibular third molar (M3) was recovered in 7 out of 8 born EDA-deficient mice (FIG. 10). No supernumerary tooth was observed in the congenital tooth agenesis model mouse with EDA deficiency to which the mouse anti-USAG-1 neutralizing antibody A was administered. Therefore, it was found that the antibody A can recover a missing tooth. Here, the term “recovery” means that a born EDA-deficient mouse has a tooth at the site (does not lose M3) where a tooth is normally lost in an EDA-deficient mouse."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "administer antibody A to congenital tooth agenesis model mice"
                            ],
                            "num_characters": 899,
                            "outline_medium": [
                                "administer antibody A to congenital tooth agenesis model mice"
                            ],
                            "outline_short": [
                                "test antibody in vivo"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**In Vivo Administration Test of Antibody—2**",
                                "A single dose of the mouse anti-USAG-1 neutralizing antibody B (E57) was intraperitoneally administered to mother mice pregnant with congenital tooth agenesis model mouse due to EDA deficiency. As a result, formation of a supernumerary tooth at an anterior tooth site or a fused tooth at a maxillary molar site was induced in 2 out of 3 born EDA-deficient homozygous mice (FIG. 10). In 5 out of 5 born EDA-deficient heterozygous mice, a supernumerary tooth at an anterior tooth site or a fused tooth at a molar site was observed. Furthermore, when the mouse anti-USAG-1 neutralizing antibody B (E57) was intraperitoneally administered in a single dose to mother mice pregnant with wild-type mice, a supernumerary tooth at an anterior tooth site or a fused tooth at a molar site was observed in 11 out of 12 born wild-type mice (FIG. 11). Therefore, it was found that the antibody B can increase the number of teeth in EDA-deficient homozygous mice, EDA-deficient heterozygous mice, and wild-type mice."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "administer antibody B to congenital tooth agenesis model mice",
                                "observe formation of supernumerary teeth"
                            ],
                            "num_characters": 1048,
                            "outline_medium": [
                                "administer antibody B to congenital tooth agenesis model mice"
                            ],
                            "outline_short": [
                                "test antibody in vivo"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**In Vivo Administration Test of Antibody—3**",
                                "A mixture of the five types of anti-USAG-1 neutralizing antibodies obtained in Example 1 including the antibodies A and B was intraperitoneally administered in a single dose to mother mice pregnant with Wnt10a-deficient mice which are tooth agenesis model mice. As a result, a supernumerary tooth was formed at maxillary anterior tooth site (FIG. 10)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "administer mixture of 5 antibodies to Wnt10a-deficient mice"
                            ],
                            "num_characters": 398,
                            "outline_medium": [
                                "administer mixture of 5 antibodies to Wnt10a-deficient mice"
                            ],
                            "outline_short": [
                                "test antibody mixture in vivo"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Data on Human USAG-1 Recognition by Antibody**",
                                "This Example was performed to confirm that the five types of mouse anti-USAG-1 (WISE) neutralizing antibodies (E12, E16, E37, E48, E57) obtained using the Escherichia coli expression system-derived human USAG-1 protein as an antigen in Example 1 recognize human USAG-1 protein. A binding assay was performed using mouse/human N-terminal PA-tagged USAG-1 proteins. Each of the five mouse anti-USAG-1 (WISE) neutralizing antibodies (E12, E16, E37, E48, E57) obtained in Example 1 (5 μg in 1 ml PBS) was captured on Protein A sepharose (30 μl) (room temperature, 2.5 hours). A culture supernatant (1 mL) of Expi293F cells transiently expressing a human or mouse N-terminal PA-tagged USAG-1 (WISE) recombinant protein and NZ1 sepharose (30 μl) were added to the Protein A sepharose, and then incubated (room temperature, 2.5 hours). Washing with a PBS buffer was performed 3 times to remove unbound proteins. All proteins bound to the sepharose were eluted, and bands were detected by SDS-PAGE electrophoresis. As a result, it was found that all of the five antibodies bound not only to the mouse USAG-1 but also to the human USAG-1 protein (FIG. 12).",
                                "Furthermore, a human FLAG-tagged USAG-1 cDNA was transiently forcibly expressed in HEK293 cells, and then subjected to immunostaining using 5 types of mouse anti-USAG-1 neutralizing antibodies (E12, E16, E37, E48, E57). As a result, clear positive reaction was observed when the neutralizing antibodies (E12, E37, E57) were used. Therefore, it was found that both the mouse anti-USAG-1 neutralizing antibody A (E37) and the mouse anti-USAG-1 neutralizing antibody B (E57) whose efficacy was confirmed in vivo recognize the human USAG-1 protein. (FIG. 13)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform binding assay using mouse/human N-terminal PA-tagged USAG-1 proteins",
                                "confirm recognition of human USAG-1 protein by 5 mouse anti-USAG-1 neutralizing antibodies",
                                "perform immunostaining using 5 mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "num_characters": 1754,
                            "outline_medium": [
                                "confirm recognition of human USAG-1 by 5 mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "outline_short": [
                                "confirm human USAG-1 recognition by antibody"
                            ]
                        },
                        {
                            "title": "Example 7",
                            "paragraphs": [
                                "**Preparation of Antibody—2**",
                                "For preparation of mouse USAG-1 neutralizing antibodies, a rat USAG-1 protein derived from a baculovirus expression system was used as an antigen. The neutralizing antibodies were prepared by the iliac lymph node method using USAG-1 KO (#116) mice. The baculovirus expression system-derived rat USAG-1 protein was shown to have BMP inhibitory activity and Wnt inhibitory activity in the same manner as described in Example 1. Primary screening of the obtained antibody clones was performed by ELISA using the immunizing antigen (the baculovirus expression system-derived rat USAG-1 protein) and the Escherichia coli expression system-derived human USAG-1 protein, and a large number of positive wells were found. Based on a cut-off value of 1.0, 111 clones were selected. After expansion, the clones were subjected to sandwich ELISA using the immunizing antigen. When a cut-off value of absorbance was set to 0.5 or more (His tag) or 1.4 or more (Myc tag), positive wells were found in about half of the clones. As a result of measurement of antibody subclasses, they were found to be IgG1, 2a, 2b, and G3. Further, the neutralizing activity of the obtained antibodies was measured in the same manner as described in Example 1. Finally, four types of mouse anti-USAG-1 neutralizing antibodies (B14, B48, B103, B108) were obtained.",
                                "Further, in the same manner as in Example 6, a binding assay was performed using moue/human N-terminal PA-tagged USAG-1 proteins to confirm that the obtained mouse anti-USAG-1 neutralizing antibodies (B14, B48, B103, B108) recognize the human USAG-1 protein. Each of the mouse anti-USAG-1 neutralizing antibodies [5 μg in 250 μl protein A/G IgG binding buffer (Pierce™)+250 μl PBS] was captured on Protein A sepharose (30 μl) (room temperature, 1.5 hours). A culture supernatant (0.75 mL) of Expi293F cells transiently expressing a human or mouse N-terminal PA-tagged USAG-1 (WISE) recombinant protein was added to the Protein A sepharose, and then incubated (room temperature, 2 hours). Washing with a PBS buffer was performed 3 times to remove unbound proteins. All proteins bound to the sepharose were eluted, and bands were detected by SDS-PAGE electrophoresis and CBB (Coomassie Brilliant Blue) staining. As a result, all of the tested mouse anti-USAG-1 neutralizing antibodies bound to both the mouse USAG-1 and the human USAG-1 protein (FIG. 15), though the binding of B103 and B108 was weaker than that of B14 and B48.",
                                "Of these, B14 (referred to as antibody C) was sequenced. A full-length heavy chain sequence containing a signal sequence and a full-length light chain sequence containing a signal sequence of antibody C are shown in SEQ ID NO: 21 and SEQ ID NO: 22, respectively. Variable regions of antibody C are shown in FIG. 21. Further, B48 (referred to as antibody D) and B103 (referred to as antibody E) were sequenced. Full-length heavy chain sequences containing a signal sequence of antibodies D and E are shown in SEQ ID NO: 38 and SEQ ID NO: 48, respectively. Full-length light chain sequences containing a signal sequence of antibodies D and E are shown in SEQ ID NO: 39 and SEQ ID NO: 49, respectively. Variable regions of antibodies D and E are shown in FIG. 22."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare mouse USAG-1 neutralizing antibodies using rat USAG-1 protein",
                                "perform primary screening by ELISA",
                                "select positive clones",
                                "measure antibody subclasses",
                                "confirm neutralizing activity",
                                "obtain 4 types of mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "num_characters": 3251,
                            "outline_medium": [
                                "prepare mouse USAG-1 neutralizing antibodies using rat USAG-1 protein",
                                "select and classify neutralizing antibodies",
                                "confirm recognition of human USAG-1 by 4 mouse anti-USAG-1 neutralizing antibodies"
                            ],
                            "outline_short": [
                                "prepare additional mouse USAG-1 neutralizing antibodies"
                            ]
                        },
                        {
                            "title": "Example 8",
                            "paragraphs": [
                                "**Epitope Binning**",
                                "The five mouse USAG-1 neutralizing antibodies (E12, E16, E37, E48, E57) selected in Example 1 and the neutralizing antibodies (B14, B48, B103, B108) prepared in Example 7 were subjected to epitope binning. FIG. 16 shows comparison of 6 types of antibodies among the obtained competitive binding data. Epitope binning was performed using Octet (registered trademark) Red (manufactured by Pall ForteBio). Briefly, each of the nine antibodies was immobilized on a biosensor as a capture antibody, a target comprising a purified full-length recombinant mouse USAG-1 was added to bind the capture antibody, and then the biosensor was reacted with a test antibody to detect a binding signal. This cycle was repeated in succession using 9 test antibodies including the same antibody as used for capture. An antibody that does not compete with the capture antibody immobilized on the biosensor for the recognition site can bind to the captured USAG-1 protein, and thus the signal increases. In contrast, a competing antibody weakly binds to the captured USAG-1 protein, and thus no increase or little increase in the signal was observed. Based on the signal data obtained, the 9 antibodies were grouped based on their epitopes. Specifically, in a reaction of a test antibody with the sensor immobilizing any of the nine capture antibodies, when the reaction generated a signal equal to or weaker than a signal (indicated by a bold underline in FIG. 16) generated when the same antibody as the capture antibody was added, the test antibody was regarded as belonging to the same group as the capture antibody. As a result, E37 and E48 competed with the E12 antibody, E48, E57 and B14 competed with the E16 antibody, E12 competed with the E37 antibody, E16, E57 and B14 competed with the E48 antibody, E16, E48 and B14 competed with the E57 antibody, E16, E48 and E57 competed with the B14 antibody, and B108 competed with the B103 antibody. Based on these results, the 9 kinds of antibodies were classified into 4 groups as shown in Table 1. However, the E48 antibody was also close to group 1 because it competes with E12, though the E48 antibody was basically classified into group 2."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform epitope binning using Octet Red",
                                "group antibodies based on epitopes",
                                "classify 9 antibodies into 4 groups",
                                "analyze competition between antibodies"
                            ],
                            "num_characters": 2197,
                            "outline_medium": [
                                "perform epitope binning of 9 mouse USAG-1 neutralizing antibodies",
                                "classify 9 antibodies into 4 groups based on epitopes"
                            ],
                            "outline_short": [
                                "perform epitope binning"
                            ]
                        },
                        {
                            "title": "Example 9",
                            "paragraphs": [
                                "**Epitope Mapping**",
                                "The antibody E37 (neutralizing antibody A) of group 1 was subjected to epitope mapping. Briefly, 169 overlapping peptides of 15 amino acids were synthesized based on a human USAG-1 protein sequence (183 amino acid length) excluding a signal peptide by shifting the 15 amino acid sequence from the beginning by one amino acid to prepare a peptide library. The 169 kinds of peptides were bound onto a cellulose membrane to prepare a peptide array. The E37 antibody (0.3 g/ml) was added as a primary antibody and incubated. After washing, an HRP-conjugated anti-mouse antibody (1/25000 dilution) was added as a secondary antibody, and ECL solution was used for color development.",
                                "As a result, the E37 antibody was found to specifically bind to 6 peptides: QEWRCVNDKTRTQRI (SEQ ID NO: 32), EWRCVNDKTRTQRIQ (SEQ ID NO: 33), WRCVNDKTRTQRIQL (SEQ ID NO: 34), RCVNDKTRTQRIQLQ (SEQ ID NO: 35), CVNDKTRTQRIQLQC (SEQ ID NO: 36), and VNDKTRTQRIQLQCQ (SEQ ID No: 37). Therefore, the amino acid sequence: VNDKTRTQRI (SEQ ID NO: 31) (corresponding to positions 134 to 143 in the full-length USAG-1 amino acid sequence containing the signal peptide) was identified as an epitope.",
                                "**Example 10**",
                                "**In Vitro Test of Antibody—2**",
                                "For 8 out of the 9 antibodies grouped in Example 8, affinities (KD values) were determined by using the same Octet-based BLI method as in Example 8. Specifically, each antibody was immobilized on the biosensor, the purified recombinant mouse USAG-1 protein was added at three different concentrations (10 nM, 30 nM, 100 nM), and binding and dissociation curves were obtained. The affinities were calculated by subjecting the obtained curves to global fitting with an analysis program attached to the Octet device. Results are shown in Table 2.",
                                "**Example 11**",
                                "**In Vitro Test of Antibody—3**",
                                "The BMP and Wnt signaling inhibition neutralizing activities of the antibody B14 that was classified into group 2 in Example 8 were determined. Experiments were carried out in the same manner as in Example 2. Specifically, in the WNT reporter assay, cells into which a vector containing a luciferase gene ligated to a promoter and a vector for expressing Wnt1 (1 μg) were introduced were cultured in a medium with addition of 1 μg of the mouse USAG-1 recombinant protein and the antibody in an amount of 1.0, 3.0, 4.0, 6.0, 8.0, 10.0, 12.0, 15.0, or 30.0 μg/ml medium, and luciferase activity was measured. In the BMP ALP assay, C2C12 cells were cultured with 30 ng/ml of the mouse USAG-1 recombinant protein and 30 ng/ml, 150 ng/ml, 300 ng/ml or 1500 ng/ml of the antibody in the presence of 30 ng/ml of BMP7, and ALP activity was measured. Results are shown in FIG. 17. In the WNT reporter assay, the antibody B14 was shown to neutralize the WNT signaling inhibitory activity of USAG-1 (up to 42% neutralizing activity). In the BMP ALP assay, that antibody B14 was shown to neutralize the BMP signaling inhibitory activity of USAG-1.",
                                "Further, for obtaining the EC50 value of the antibody B14 against the inhibition of BMP and Wnt signaling by USAG-1, the concentration at the time of 50% inhibition was calculated, wherein the neutralizing activity by no addition of the antibody was defined as 0% and the maximal neutralizing activity was defined as 100%. As a result, the EC50 values were 298 ng/ml and 4.73 μg/ml against the BMP and Wnt signaling inhibition, respectively.",
                                "**Example 12**",
                                "**In Vivo Administration Test of Antibody—4 (Mouse)**",
                                "The six antibodies classified into groups 1 and 2 in Example 8 were intraperitoneally administered in a single dose to mother mice pregnant with congenital tooth agenesis model mouse due to EDA homozygous deficiency, congenital tooth agenesis model mouse due to EDA heterozygous deficiency, or wild-type mice. Results are shown in Table 3. All of the six antibodies were found to induce the formation of a supernumerary tooth and/or a fused tooth in the EDA-deficient mice, and increase the number of teeth in the EDA-deficient mice. Particularly, the antibodies of group 1 recovered missing teeth in the EDA-deficient mice. When the antibodies of group 1 were administered, the formation of a supernumerary tooth and a fused tooth was not observed in the wild-type mice. In contrast, the antibodies E57 and B14 of group 2 induced the formation of a supernumerary tooth and a fused tooth in the wild-type mice. The antibody B14 (antibody C) and the antibody E57 (antibody B) were found to increase the number of teeth in all EDA homozygous deficient mice, EDA heterozygous deficient mice and wild-type mice. Here, the term “recovery” means that a born EDA-deficient mouse has a tooth at the site (does not lose M3) where a tooth is normally lost in an EDA-deficient mouse.",
                                "**Example 13**",
                                "**In Vivo Administration Test of Antibody—5 (Dog)**",
                                "The anti-mouse USAG-1 neutralizing antibody B14 (50 μg/g body weight) was intraperitoneally administered in a single dose to congenital tooth agenesis model dogs immediately after birth. The congenital tooth agenesis model dogs were individuals developing congenital tooth agenesis of a TOYO beagle line and obtained from KITAYAMA LABES CO., LTD., Hongo Farm. The congenital tooth agenesis model dogs include individuals lacking maxillary third premolars and individuals lacking mandibular fourth premolars. Ten weeks after the administration, calcification of tooth germs was evaluated by dental X-ray radiography. As a result, recovery of missing teeth was found (FIG. 18). Results are shown in Table 4. In addition, the blood concentration of the administered antibody in each individual was measured 3 days, 1 week, 3 weeks, 5 weeks and 7 weeks after the antibody administration. As a result, though there were individual differences, the half-life was 1 week and the antibody in blood was maintained until 7 weeks after administration.",
                                "As is clear from Table 4, the congenital absent premolars were recovered by single systemic administration of the USAG-1 neutralizing antibody B14. The low recovery rate of absent mandibular premolars are probably due to different causative genes.",
                                "**Example 14**",
                                "**In Vivo Administration Test of Antibody—6 (Ferret)**",
                                "Ferrets are diphyodont like humans, and have the number of teeth according to a dental formula consisting of three incisors, one canine, three premolars and two molars, which is similar to the basic dental formula of mammals. Thirty-nine USAG-1 neutralizing antibodies (16 μg/g body weight) including the antibodies prepared in Examples 1 and 7 were intraperitoneally administered to 39 ferrets 1 and 3 weeks after birth (one ferret per each antibody). Fourteen weeks after birth, 38 ferrets survived. Four ferrets to which 4 kinds of antibodies including the antibodies of groups 1 to 4 identified in Example 8 were administered and were observed for a long period of time until 30 weeks after birth. As a result, many large-sized teeth were observed at the sites of the maxillary and mandibular anterior tooth and premolars in two or more ferrets. Furthermore, in the ferret to which the antibody B14 was administered, 14 weeks after birth, induction of the third dentition was observed at the sites of mandibular third premolars on the lingual sides (FIG. 19). In the ferret to which the antibody B103 was administered, 30 weeks after birth, one more anterior tooth appeared on the maxillary lingual (palatal) side, and induction of the third dentition was observed at the maxillary anterior tooth site (FIG. 23). The anterior tooth developed after permanent tooth development, and was similar to the preceding permanent tooth in morphology. The anterior tooth had a short dental root. Furthermore, in the ferret to which the antibody B103 was administered, 30 weeks after birth, induction of the third dentition was observed at the sites of the mandibular left and right premolars (FIG. 24).",
                                "**Example 15**",
                                "**In Vivo Administration Test of Antibody—7 (Suncus)**",
                                "Pregnant house musk shrews (suncus) were obtained, and on the 17th day of pregnancy, various USAG-1 neutralizing antibodies (16 μg/g body weight) prepared in Example 1 were intraperitoneally administered. Seven weeks after birth, evaluation was performed by μCT imaging. The house musk shrews which received the USAG-1 neutralizing antibodies did not give birth. However, in the 4 to 8 month-old parent house musk shrew which received the antibody B (E57) or the antibody C (B14), formation of a new tooth was observed around a dental root, where enamel epithelial stem cells topically induced epithelial mesenchymal transition. In the house musk shrew which received the antibody B, induction of the third dentition was observed between the mandibular first and second premolars on the buccal side (FIG. 20). Therefore, the USAG-1 neutralizing antibodies of the present invention were shown to induce the formation of the third dentition.",
                                "**Example 16**",
                                "**In Vitro Test of Antibody—4**",
                                "The BMP and Wnt signaling inhibition neutralizing activities of the antibody B48 that was classified into group 3 in Example 8 were determined. Experiments were carried out in the same manner as in Example 2. Specifically, in the WNT reporter assay, cells into which a vector containing a luciferase gene ligated to a promoter and a vector for expressing Wnt1 (1 μg) were introduced were cultured in a medium with addition of 1 μg of the mouse USAG-1 recombinant protein and the antibody in an amount of 1, 3, 6, 10 or 30 μg/ml medium, and luciferase activity was measured. In the BMP ALP assay, C2C12 cells were cultured with 30 ng/ml of the mouse USAG-1 recombinant protein and a 1-fold (30 ng/ml), 10-fold (300 ng/ml) or 100-fold (3 μg/ml) amount of the antibody in the presence of 30 ng/ml of BMP7, and ALP activity was measured. Results are shown in FIG. 25. In the WNT reporter assay, the antibody B48 was shown to neutralize the WNT signaling inhibitory activity of USAG-1 by almost 100%.",
                                "**Example 17**",
                                "In Vitro Test of Antibody—5 (Pull-Down Assay with Protein A Sepharose Using PA-Tagged USAG-1 and E1E2)",
                                "Wnt binds to Frizzled and its co-receptor, a low-density lipoprotein receptor-related protein (LRP) 5/6 receptor to transmit a signal in cells. LRP6 has four extracellular domains (E1 to E4). Among the domains, E1E2 is known to be involved in the binding of USAG-1. Specifically, USAG-1 binds to the E1E2 region of LRP6 to inhibit Wnt signaling. Thus, the 9 kinds of mouse anti-USAG-1 neutralizing antibodies (E12, E16, E37, E48, E57, B14, B48, B103, B108) grouped in Example 8 were used to determine whether the binding of USAG-1 to LRP6-E1E2 was inhibited.",
                                "Each mouse anti-USAG-1 neutralizing antibody (5 μg in 1 ml PBS) was captured on Protein A sepharose (30 μl) (room temperature, 1.5 hours). A culture supernatant (1 mL) of Expi293F cells transiently expressing a N-terminal PA-tagged mouse USAG-1 recombinant protein was added to the Protein A sepharose, and then incubated (room temperature, 2 hours). Then, a culture supernatant (1 mL) expressing LRP6-E1E2 (a region of amino acid numbers 1 to 629 of human LRP6, fused to a His tag) was added, and incubated (room temperature, 2.5 hours). Washing with a PBS buffer (1 mL) was performed 3 times to remove unbound proteins. All proteins bound to the sepharose were eluted, and bands were detected by SDS-PAGE electrophoresis and Oriole gel fluorescence staining. Results are shown in FIG. 26. In FIG. 26, the right panel shows results obtained when the same experiment was performed except that the mouse anti-USAG-1 neutralizing antibody was not captured (no mAb) as a negative control, when a complex of the mouse USAG-1 recombinant protein and LRP6-E1E2 was immunoprecipitated with a PA-tagged antibody NZ-1 (WISE+E1E2 By NZ1) as a positive control, and when the expression level of LRP6-E1E2 only was precipitated with a Ni-NTA resin capable of adsorbing the His tag (E1E2 By NiNTA).",
                                "As a result, it was found that LRP6-E1E2 did not bind to complexes of some antibodies (particularly the antibodies B48, B103, B108 of groups 3 and 4) with USAG-1 (FIG. 26). Therefore, the epitopes of these antibodies overlap or are in a region sterically close to the LRP6 binding site of USAG-1, and the antibodies bind to USAG-1 to inhibit the binding of USAG-1 to LRP6, and thereby the inhibition of Wnt signaling by USAG-1 was neutralized.",
                                "**Example 18**",
                                "**In Vivo Administration Test of Antibody—8 (Mouse)**",
                                "The three antibodies classified into groups 3 and 4 in Example 8 were intraperitoneally administered in a single dose to mother mice pregnant with congenital tooth agenesis model mouse due to EDA homozygous deficiency, congenital tooth agenesis model mouse due to EDA heterozygous deficiency, or wild-type mice (16 μg/g body weight). In born offspring mice, the presence of supernumerary teeth and fused teeth and the presence or absence of recovery of missing teeth were examined. Results are shown in Table 5. The three antibodies particularly recovered missing teeth in the EDA-deficient mice. Herein, the term “recovery” means that a born EDA-deficient mouse has a tooth at the site (does not lose M3) where a tooth is normally lost in an EDA-deficient mouse.",
                                "**Example 19**",
                                "**In Vivo Administration Test of Antibody—9 (Mouse)**",
                                "Five kinds of antibodies (E57, B14, B48, B103, B108) were intraperitoneally administered in a single dose to mother mice pregnant with congenital tooth agenesis model mouse Wnt10a homozygous deficient mice, congenital tooth agenesis model mouse Wnt10a heterozygous deficient mice, or wild-type mice (2 μg/g body weight for B103, 16 μg/g body weight for the other antibodies). In born offspring mice, the presence of supernumerary teeth and fused teeth and the presence or absence of recovery of missing teeth were examined. Results are shown in Table 6. Of the antibodies in groups 3 and 4, B48 and B103 induced the formation of supernumerary teeth and fused teeth in the homozygous deficient mice."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "epitope mapping of antibody E37",
                                "prepare peptide library",
                                "bind peptides to cellulose membrane",
                                "add E37 antibody as primary antibody",
                                "incubate and wash",
                                "add HRP-conjugated anti-mouse antibody",
                                "use ECL solution for color development",
                                "identify epitope sequence",
                                "summarize epitope mapping results",
                                "introduce Example 10",
                                "determine affinities of antibodies",
                                "use Octet-based BLI method",
                                "immobilize antibodies on biosensor",
                                "add purified recombinant mouse USAG-1 protein",
                                "obtain binding and dissociation curves",
                                "calculate affinities by global fitting",
                                "show results in Table 2",
                                "introduce Example 11",
                                "determine neutralizing activities of antibody B14",
                                "use WNT reporter assay",
                                "use BMP ALP assay",
                                "show results in FIG. 17",
                                "calculate EC50 values",
                                "introduce Example 12",
                                "administer antibodies to mice",
                                "evaluate tooth formation",
                                "show results in Table 3"
                            ],
                            "num_characters": 13960,
                            "outline_medium": [
                                "epitope mapping of antibody E37",
                                "prepare peptide library",
                                "bind peptides to cellulose membrane",
                                "add E37 antibody and incubate",
                                "wash and add secondary antibody",
                                "use ECL solution for color development",
                                "identify epitope sequence",
                                "summarize epitope mapping results",
                                "introduce Example 10",
                                "determine affinities of antibodies",
                                "immobilize antibodies on biosensor",
                                "add purified recombinant mouse USAG-1 protein",
                                "calculate affinities by global fitting"
                            ],
                            "outline_short": [
                                "epitope mapping of E37 antibody",
                                "peptide library preparation",
                                "peptide array binding assay",
                                "identify epitope sequence",
                                "determine binding specificity",
                                "summarize epitope mapping results"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce USAG-1",
                        "describe USAG-1 function",
                        "motivate tooth agenesis treatment",
                        "describe Runx2-deficient mouse model",
                        "describe USAG-1 gene-deficient mouse model",
                        "describe double-knockout mouse experiment",
                        "summarize tooth formation recovery result",
                        "motivate inhibition of USAG-1",
                        "describe crossing congenital tooth agenesis model mice with USAG-1 gene-deficient mouse",
                        "describe double-knockout mice analysis",
                        "summarize tooth formation recovery result",
                        "describe production of human USAG-1 recombinant protein",
                        "describe production of antibodies",
                        "describe antibody function",
                        "define neutralizing activity",
                        "describe BMP signaling inhibitory activity",
                        "describe Wnt signaling inhibitory activity",
                        "describe antibody or antigen-binding fragment thereof",
                        "describe sequencing and analysis of antibodies",
                        "describe variable regions and complementarity determining regions",
                        "describe specific antibodies (A-E)",
                        "provide antibodies or antigen-binding fragments thereof",
                        "define antibody A",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody A",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody A",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody A",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody A",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody A",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody A",
                        "define antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "define antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody B",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody B",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody B",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody B",
                        "define antibody C",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody C",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody C",
                        "define antibody C",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody or antigen-binding fragment",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide more preferred antibody or antigen-binding fragment",
                        "specify heavy chain variable region with substitution",
                        "specify light chain variable region with substitution",
                        "provide still more preferred antibody or antigen-binding fragment",
                        "specify heavy chain complementarity determining regions with sequence identity",
                        "specify light chain complementarity determining regions with sequence identity",
                        "provide preferred antibody or antigen-binding fragment with sequence identity",
                        "specify heavy chain variable region with sequence identity",
                        "specify light chain variable region with sequence identity",
                        "provide more preferred antibody or antigen-binding fragment with sequence identity",
                        "specify heavy chain variable region with substitution and sequence identity",
                        "specify light chain variable region with substitution and sequence identity",
                        "provide still more preferred antibody or antigen-binding fragment with sequence identity",
                        "define antibody D or mutant",
                        "specify heavy chain complementarity determining regions with sequence identity",
                        "specify light chain complementarity determining regions with sequence identity",
                        "provide preferred antibody or antigen-binding fragment with sequence identity",
                        "specify heavy chain complementarity determining regions with exact sequence",
                        "specify light chain complementarity determining regions with exact sequence",
                        "provide more preferred antibody or antigen-binding fragment with exact sequence",
                        "define antibody D",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody D",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody D",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody D",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody D",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody D",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody D",
                        "define antibody E",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody E",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide preferred antibody E",
                        "define antibody E",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide sequence identity options",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide sequence identity options",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide sequence identity options",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide sequence identity options",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "provide sequence identity options",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide sequence identity options",
                        "define \"several\"",
                        "define \"substitution\"",
                        "provide examples of conservative substitution",
                        "specify amino acid substitution options",
                        "conclude antibody E definition",
                        "define sequence identity",
                        "determine sequence identity using algorithm",
                        "describe antibody or antigen-binding fragment",
                        "provide antibody or antigen-binding fragment that binds to epitope",
                        "describe competition for binding",
                        "define competition",
                        "describe competitive binding assay",
                        "explain epitope binning",
                        "describe binding affinity",
                        "describe isolated antibody",
                        "describe polyclonal or monoclonal antibody",
                        "describe humanized or chimeric antibody",
                        "describe antigen-binding fragment",
                        "describe isolated nucleic acid",
                        "describe pharmaceutical composition",
                        "describe dental regeneration therapy",
                        "describe pharmaceutical composition formulation",
                        "describe administration route",
                        "describe dental regenerative therapy application",
                        "describe congenital tooth agenesis treatment",
                        "describe acquired tooth loss treatment",
                        "describe pharmaceutical composition administration",
                        "describe dose determination",
                        "describe neutralizing activity",
                        "describe method of regenerating a tooth",
                        "provide examples of the present invention"
                    ],
                    "num_characters": 88993,
                    "outline_medium": [
                        "introduce USAG-1 and its functions",
                        "motivate tooth agenesis treatment",
                        "describe mouse model experiments",
                        "summarize results of mouse model experiments",
                        "produce antibodies against USAG-1",
                        "describe functions of USAG-1",
                        "define neutralizing activity of antibodies",
                        "describe methods for determining neutralizing activity",
                        "analyze obtained antibodies",
                        "describe sequences of antibodies",
                        "provide antibodies and mutants as invention",
                        "define antibody A",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody A",
                        "provide more preferred antibody A",
                        "provide still more preferred antibody A",
                        "define antibody A with substitutions",
                        "define antibody B",
                        "specify heavy chain complementarity determining regions of antibody B",
                        "specify light chain complementarity determining regions of antibody B",
                        "define antibody B",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody B",
                        "provide more preferred antibody B",
                        "provide still more preferred antibody B",
                        "specify antibody B with substitutions",
                        "provide preferred antibody B with substitutions",
                        "define antibody C",
                        "specify heavy chain complementarity determining regions of antibody C",
                        "specify light chain complementarity determining regions of antibody C",
                        "define antibody C",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "specify combination of heavy and light chain variable regions",
                        "specify substitutions in heavy and light chain variable regions",
                        "specify combination of heavy and light chain complementarity determining regions",
                        "specify substitutions in heavy and light chain complementarity determining regions",
                        "specify combination of heavy and light chain variable regions with substitutions",
                        "define antibody D",
                        "specify heavy chain complementarity determining regions of antibody D",
                        "specify light chain complementarity determining regions of antibody D",
                        "define antibody D",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "specify heavy chain variable region",
                        "specify light chain variable region",
                        "provide preferred antibody D",
                        "provide more preferred antibody D",
                        "provide still more preferred antibody D",
                        "specify antibody D with substitutions",
                        "provide preferred antibody D with substitutions",
                        "define antibody E",
                        "specify heavy chain complementarity determining regions of antibody E",
                        "specify light chain complementarity determining regions of antibody E",
                        "define antibody E",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "describe heavy chain variable region",
                        "describe light chain variable region",
                        "specify sequence identity",
                        "provide preferred embodiments",
                        "describe substitution, deletion, insertion or addition",
                        "define \"several\"",
                        "explain conservative substitution",
                        "provide examples of conservative substitution",
                        "conclude antibody E or mutant thereof",
                        "define sequence identity",
                        "describe antibody or antigen-binding fragment",
                        "motivate epitope binding",
                        "describe competition for binding",
                        "explain epitope binning",
                        "describe binding affinity",
                        "describe antibody types",
                        "describe antigen-binding fragments",
                        "describe isolated nucleic acid",
                        "motivate pharmaceutical composition",
                        "describe pharmaceutical composition",
                        "describe administration routes",
                        "describe treatment of tooth agenesis"
                    ],
                    "outline_short": [
                        "motivate USAG-1 as BMP and Wnt antagonist",
                        "describe tooth agenesis model mice and recovery of tooth formation",
                        "produce and characterize anti-USAG-1 neutralizing antibodies",
                        "determine neutralizing activity of antibodies",
                        "specify antibody sequences and mutants",
                        "define antibody A",
                        "define antibody A mutant",
                        "define antibody B",
                        "define antibody B mutant",
                        "describe antibody A properties",
                        "describe antibody B properties",
                        "define antibody B",
                        "define antibody B mutant",
                        "define antibody B variant",
                        "define antibody C",
                        "define antibody C mutant",
                        "define antibody C variant",
                        "define antibody C",
                        "define antibody C mutant",
                        "define antibody D",
                        "define antibody D mutant",
                        "describe antibody C variations",
                        "describe antibody D variations",
                        "define antibody D",
                        "define antibody D mutant",
                        "define antibody E",
                        "define antibody E mutant",
                        "describe antibody D variations",
                        "describe antibody E variations",
                        "define antibody E",
                        "specify heavy chain complementarity determining regions",
                        "specify light chain complementarity determining regions",
                        "describe variable regions",
                        "provide sequence identity percentages",
                        "define conservative substitution",
                        "define antibody or antigen-binding fragment",
                        "describe epitope and binding properties",
                        "explain competition and epitope binning",
                        "detail antibody characteristics and production",
                        "outline pharmaceutical composition and administration",
                        "describe dental regeneration therapy and method"
                    ]
                },
                {
                    "title": "INDUSTRIAL APPLICABILITY",
                    "paragraphs": [
                        "The antibody or antigen-binding fragment thereof of the present disclosure can be used for the treatment of congenital tooth agenesis and acquired tooth loss. In addition, the antibody or antigen-binding fragment thereof of the present disclosure is effective for the formation of the third dentition. Thus, the antibody or antigen-binding fragment thereof of the present disclosure leads to development of a molecular-targeted drug for tooth regeneration in the pharmaceutical field and establishment of a dental regenerative therapy based on formation of the third dentition."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "application of antibody"
                    ],
                    "num_characters": 577,
                    "outline_medium": [
                        "application of antibody"
                    ],
                    "outline_short": [
                        "application of antibody"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An antibody or antigen-binding fragment thereof that specifically binds to and neutralizes USAG-1.",
        "2. The antibody or antigen fragment thereof according to claim 1, which specifically binds to USAG-1 and neutralizes BMP signaling inhibitory activity of USAG-1.",
        "3. The antibody or antigen fragment thereof according to claim 1, which specifically binds to USAG-1 and neutralizes WNT signaling inhibitory activity of USAG-1.",
        "4. The antibody or antigen-binding fragment thereof according to claim 1, which comprises:\n(a) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively;\n(b) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively;\n(c) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively;\n(d) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively; or\n(e) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively, or three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively.",
        "5. The antibody or antigen-binding fragment thereof according to claim 1, which comprises:\n(f) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4;\n(g) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14;\n(h) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24;\n(i) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41; or\n(j) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50, or a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51.",
        "6. The antibody or antigen-binding fragment thereof according to claim 1, which comprises:\n(k) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 5, SEQ ID NO: 6 and SEQ ID NO: 7 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 8, SEQ ID NO: 9 and SEQ ID NO: 10 respectively;\n(l) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 15, SEQ ID NO: 16 and SEQ ID NO: 17 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 18, SEQ ID NO: 19 and SEQ ID NO: 20 respectively;\n(m) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 25, SEQ ID NO: 26 and SEQ ID NO: 27 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 28, SEQ ID NO: 29 and SEQ ID NO: 30 respectively;\n(n) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 42, SEQ ID NO: 43 and SEQ ID NO: 44 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 45, SEQ ID NO: 46 and SEQ ID NO: 47 respectively; or\n(o) three heavy chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 52, SEQ ID NO: 53 and SEQ ID NO: 54 respectively, and three light chain complementarity determining regions that comprise amino acid sequences having at least 90% sequence identity with amino acid sequences set forth in SEQ ID NO: 55, SEQ ID NO: 56 and SEQ ID NO: 57 respectively.",
        "7. The antibody or antigen-binding fragment thereof according to claim 1, which comprises:\n(p) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 3, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 4;\n(q) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 13, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 14;\n(r) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 23, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 24;\n(s) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 40, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 41; or\n(t) a heavy chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 50, and a light chain variable region that comprises an amino acid sequence having at least 90% sequence identity with an amino acid sequence set forth in SEQ ID NO: 51.",
        "8. An antibody or antigen-binding fragment thereof that competes with the antibody or antigen-binding fragment thereof according to claim 4 for binding to USAG-1.",
        "9. The antibody or antigen-binding fragment thereof according to claim 1, wherein the antibody is a humanized antibody or a chimeric antibody.",
        "10. A pharmaceutical composition for dental regenerative therapy, which comprises the antibody or antigen-binding fragment thereof according to claim 1."
    ]
}