{
    "id": "https://semopenalex.org/work/W3016269721",
    "authors": [
        "T.L. Poulos",
        "Richard B. Silverman",
        "Huiying Li",
        "Maris A. Cinelli",
        "Georges Chreifi",
        "Cory T. Reidl"
    ],
    "title": "First Contact: 7-Phenyl-2-Aminoquinolines, Potent and Selective Neuronal Nitric Oxide Synthase Inhibitors That Target an Isoform-Specific Aspartate",
    "date": "2020-04-17",
    "abstract": "Inhibition of neuronal nitric oxide synthase (nNOS), an enzyme implicated in neurodegenerative disorders, is an attractive strategy for treating or preventing these diseases. We previously developed several classes of 2-aminoquinoline-based nNOS inhibitors, but these compounds had drawbacks including off-target promiscuity, low activity against human nNOS, and only modest selectivity for nNOS over related enzymes. In this study, we synthesized new nNOS inhibitors based on 7-phenyl-2-aminoquinoline and assayed them against rat and human nNOS, human eNOS, and murine and (in some cases) human iNOS. Compounds with a meta-relationship between the aminoquinoline and a positively charged tail moiety were potent and had up to nearly 900-fold selectivity for human nNOS over human eNOS. X-ray crystallography indicates that the amino groups of some compounds occupy a water-filled pocket surrounding an nNOS-specific aspartate residue (absent in eNOS). This interaction was confirmed by mutagenesis studies, making 7-phenyl-2-aminoquinolines the first aminoquinolines to interact with this residue.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Neurodegenerative diseases such as Alzheimer's, Huntington's, Parkinson's, and amyotrophic lateral sclerosis (ALS), are characterized by the gradual loss of neuronal integrity and are responsible for a wide range of neurological deficiencies. Neuronal damage or death associated with stroke, ischemic events, and cerebral palsy (as well as acute or chronic brain injuries) has also been linked to similarly debilitating motor, cognitive, and psychological impairments. The overproduction of the vital secondary messenger nitric oxide (NO), produced by neuronal nitric oxide synthase (nNOS) in tissues of the central (CNS) and peripheral nervous system (PNS), is directly implicated in these disorders. 1,2 Because NO plays a key role in these diseases, rational control of NO levels in neuronal tissues via nNOS-specific inhibition is therapeutically desirable.",
                "Nitric oxide synthases (NOS) are a family of homodimeric enzymes that are responsible for the biosynthesis of NO. Functional regulation of NO is differentiated by subcellular localization, tissue distribution, and regulatory gene expression of three isoforms of NOS: endothelial NOS (eNOS), inducible NOS (iNOS), and neuronal NOS (nNOS), which are responsible for regulating blood pressure and vascular tone, immune activation, and normal neuronal communication, respectively. 3 Functional NOS is a homodimer. Each NOS monomer contains a reductase domain and an oxygenase domain, separated by a flexible region where calmodulin binds when activated by calcium ions. The reductase domain contains binding sites for flavin adenine dinucleotide (FAD), flavin mononucleotide (FMN), and reduced nicotinamide adenine dinucleotide phosphate (NADPH), whereas the oxygenase domain contains binding sites for (6R)-5,6,7,8-tetrahydrobiopterin (H 4 B), the metallocofactor heme, and the substrate L-arginine. Electron flow proceeds from one monomer's reductase domain, sequentially through NADPH, FAD, and FMN, to the opposite monomer's oxygenase domain, where the electron is transferred between FMN and heme, by which L-arginine is oxidized to L-citrulline and NO. 4 Most compounds initially investigated for nNOS inhibition were designed as competitive mimics of L-arginine. These inhibitors have high basicity and polarity, a large total polar surface area (tPSA), and an overabundance of hydrogen bond donors, and as a result, suffer Encouraged by both the inhibitory constants and the agreement between X-ray crystallography and our docking results, 12 was used as a launching point for further optimization. Efforts were made to develop a set of compounds with modifications made at the 5-position of the central phenyl ring (e.g., nitrile 14 and pyridine 15) to investigate whether additional interactions could be made with the heme propionate or another active site residue.",
                "Because of 12's high n/eNOS selectivity, we hypothesized that the flexible tail amino group might be contacting (directly or otherwise) a specific aspartate residue (Asp597/Asp602 in rnNOS/hnNOS, respectively). This residue is missing in eNOS isoforms, replaced by asparagine. Consequently, contact (H-bonding or electrostatic) between an inhibitor and this residue can impart very high n/eNOS selectivity (1000-fold or more). We hypothesized that a second set of compounds could be designed to solidify any existing contacts with Asp597/ Asp602 by incorporating the tail amino group functionality into a rigid ring system, thereby reducing its overall flexibility and locking the interaction in place. As the amino group of 5 is quite flexible, both meta-/paraand ortho-/meta-constrained derivatives (isoindoline 16 and the two isomeric racemic indanylamines 17 and 18) were prepared.",
                "Additional docking studies indicated that a variety of groups might be accommodated at the 4-position of the central phenyl ring of 12, which could form van der Waals interactions with Met336/Met341 (rnNOS/hnNOS), a residue that was previously implicated in high n/eNOS selectivity for 2-aminoquinoline-based inhibitors 7 as it is absent in eNOS isoforms (replaced by a smaller valine). 12 To this end, 3,4-substituted compounds 19-37 (Figure 3), possessing a variety of steric, electronic, and H-bonding substituents at the 4-position were investigated to determine if this substitution pattern could make extra contacts with the isoform-specific residues Met336/Met341 and/or the hnNOS-specific residue His342.",
                "All synthesized compounds were assayed against rnNOS, and selected compounds were also assayed against hnNOS. Murine iNOS and human eNOS were used to determine selectivity, and selected compounds were also assayed against human iNOS."
            ],
            "subsections": []
        },
        {
            "title": "Results and Discussion",
            "paragraphs": [
                "Chemistry.",
                "To prepare compound 5, we envisioned that the quinoline-aryl bond could be constructed via Suzuki coupling. To this end, we sought to install the boron-containing moiety on the quinoline, taking advantage of a large and diverse set of available aryl halides (which are less expensive and easier to synthesize than an analogous series of boronates or boronic esters). Using versatile 7-bromoquinoline 38, 8 a 7-BPin moiety was first installed via Miyaura borylation (Scheme 1). This intermediate was not isolated but rather converted to trifluoroborate 39, which was readily purified because of its insolubility in most organic solvents.",
                "To prepare the halide precursor, commercially available 4-bromophenethylamine 40 was Boc-protected to yield 41. Many Suzuki conditions were screened for the coupling of 39 and 41, but the strong protic bases usually required for reductive elimination and activation of 39 often led to deacetylation of the quinoline and decomposition. The use of NaHCO 3 as the base 13 in a mixed aqueous solvent was more successful, and microwave irradiation of this mixture yielded phenylquinoline 42 within 25 minutes at 120 ˚C without substantial deacetylation. The intermediate protected phenylquinolines were not extensively characterized but were isolated and immediately deprotected. Deprotection was accomplished stepwise, first with K 2 CO 3 in refluxing methanol to cleave the acetyl group, followed by treatment of the free aminoquinoline with methanolic HCl to remove the Boc group and provide 5 as its water-soluble dihydrochloride salt. 6 To prepare the initial set of derivatives with different para-aminoalkyl tail portions (6-9), the halides were first prepared. Compound 41 was methylated to yield 43 (Scheme 2A). Commercially available iodobenzylamine 44 was Boc-protected to yield 45, which was also methylated to yield 46 (Scheme 2B). For the (S)-alpha-methyl-phenethylamine group of 9, the Ellman auxiliary method 14 was used (Scheme 2C). Ketone 47 was condensed with (S)tert-butylsulfinamide, and the intermediate sulfinyl imine was reduced at low temperature to afford (S,S)-48 in a good d.r. of ~7:1.",
                "Desulfinylation under acidic conditions and Boc-protection subsequently afforded derivative 49. For orthoand meta-substituted derivatives 10/11 and 12/13, respectively, the commercially available benzylamines (50, 54) and phenethylamines (51, 55) were Bocprotected to yield o-substituted (52, 53) and m-substituted (56, 57) bromides, respectively (Schemes 2D and 2E). Suzuki coupling between 39 and these halides under the conditions described above (Scheme 3) was facile and displayed a high substrate tolerance, affording protected phenylquinolines 5-65 in good yields. Generally, the only impurity isolated was a small amount (<10%) of proto-deborylated acetamidoquinoline. Deprotection of 58-66 (Scheme 3) afforded analogues 6-13.",
                "To synthesize 5-cyano derivative 14, bromobenzene 66 was prepared as previously described. Treatment of 66 with the anion derived from Boc 2 NH (Scheme 4A) yielded, surprisingly, mono-Boc protected amine 67, indicating that one Boc group was cleaved during the reaction or workup. Suzuki coupling with 39 yielded 68, which was then deprotected to provide amine 14. In contrast, heating Boc 2 NH and pyridine 69 under basic conditions (Scheme 4B) afforded the N,N-di-Boc compound (70). 15 Likewise, the major product (71) isolated upon coupling of 70 and 39 contained both Boc groups intact. During deacetylation, a longer period of heating (4.5 h) was employed to remove both the acetyl group and one Boc group, and the second Boc group was then removed with HCl to yield 15.",
                "Synthesis of isoindoline derivative 16 (Scheme 5A) commenced with commercially available 4-bromoisoindoline salt 72, which was converted to the free base and Bocprotected to yield 73. Coupling with 39 afforded 74, which then yielded 16 upon deprotection. Indanylamine derivatives 17 and 18 (Scheme 5B) were prepared from the 5and 6-bromoindanones (75 and 76), respectively. The Ellman method (as in Scheme 2C) 14 was used to install the amino group as its racemate. However, yields of sulfinamides 77 and 78 were fairly low, and large amounts of insoluble ketone condensation by-products were obtained. Nonetheless, 77 and 78 were desulfinylated and Boc-protected, and carbamates 79 and 80 were readily amenable to Suzuki coupling with 39, affording 81 and 82, which were deprotected to yield, respectively, 17 and 18.",
                "We envisioned that 4-substituted derivatives 19-24 could be accessed from commercially available benzaldehydes or toluene derivatives via conversion to the benzyl halides. To this end, fluorotoluene 83 and chlorotoluene 84 (for 19 and 20) were converted to benzyl bromides 85 and 86. A Delépine reaction, involving treatment with hexamethylenetetramine and acidic hydrolysis of the resulting hexaminium adduct, and subsequent Boc-protection of the amine yielded 87 and 88 (Scheme 6A). For the trifluoromethyl derivative en route to 21, commercially available nitrile 90 was reduced with BH 3 -DMS, 16 and the isolated amine was protected to yield 91 (Scheme 6B). 2-Ethybenzaldehyde (91, for 22) was complexed with AlCl 3 17 and brominated to yield the major regioisomer (92b) as an inseparable 3:1 mixture with 92a. Following borohydride reduction, the isomers were separated, and the major isomer (93) was chlorinated to yield 94. Delépine reaction and Boc protection provided bromobenzene derivative 95 (Scheme 6C).",
                "Methoxybenzyl alcohol 96 (for 23) was prepared as previously described (Scheme 6D) and elaborated via 97 as described above to yield 98. Finally, ethoxylated toluene 99 was brominated to yield 100 (Scheme 6E). Delépine reaction and Boc protection afforded carbamate 101.",
                "As the multiple steps of this route would make the preparation of many similar analogues time consuming, and the Boc 2 NH method of Scheme 4 was unpredictable, a slightly different strategy was used to prepare 4-ether halide derivatives 25-37 (Scheme 7). In this route, protected amine 103 was first prepared via reduction of 102, and then the ether functionality was installed by deprotonation of the phenol and treatment with alkyl or benzyl halides.",
                "By this method, the n-propyl (104), isopropyl (105), isobutyl (106), methylcyclobutyl (107), methylcyclopropyl (108), 3-fluorobenzyl (109), 4-cyanobenzyl (110), (5-methylisoxazol-3methyl (113), 4-and 5-methyl thiazoles (114/116), and oxazol-4-methyl (115) ethers were prepared. As the thiazol-5-methyl chloride and pyridylmethyl bromides are only commercially available as the HCl and HBr salts, respectively, these salts were converted to their free base immediately prior to the formation of the 2-pyridylmethyl (111), 3pyridylmethyl (112), and thiazol-5-methyl (116) ethers. All of these ether-containing halides were subjected to Suzuki coupling with 39 to yield protected phenylquinolines 117-135 in moderate to excellent yields, and stepwise deprotection as described above yielded final analogues 19-37.",
                "nNOS Inhibitory Assay and Crystallography.",
                "The hemoglobin capture assay (see Experimental Section) was used to determine the inhibition constants (K i ) of synthesized compounds 5-37. 18,19 All compounds were assayed against purified rnNOS as a prescreen, and eighteen of the most potent compounds against rnNOS were further assayed against purified human nNOS (hnNOS), murine iNOS (miNOS), and human eNOS (heNOS) to determine isoform selectivity. Table 1 summarizes the apparent K i values and isoform selectivities for 5-37. Values for compounds 1-4 are included for comparison. The rnNOS and miNOS isoforms were used to approximate n/i isoform selectivity, because they are the easiest to express and purify, and those are the species used for crystallography. Furthermore, for preclinical purposes, it is essential to prove efficacy and selectivity in lower animals prior to advancement to clinical trials. Recent advances have made it possible to obtain and crystallize both hnNOS and heNOS, which were used to support our human isoform SAR development. Because high-resolution structures of murine and human iNOS were not available until more recently, the majority of the structural discussion will focus on nNOS and eNOS; discussion of a comparison between murine and human iNOS inhibition follows that."
            ],
            "subsections": [
                {
                    "title": "Initial Inhibitory and Structural Analysis of Modified Amine Tail Analogues.",
                    "paragraphs": [
                        "The initial lead 7-phenyl-2-aminoquinoline (5) has good rat and human nNOS inhibitory activity (105 nM and 122 nM, respectively) with moderately high n/iNOS and n/eNOS selectivity of 207-fold and 191-fold, respectively. The X-ray crystal structure of 5 bound to rnNOS, hnNOS, and heNOS (Figure 4A-C) revealed the structural basis for inhibitory potency. The quinoline portion of 5 mimics arginine and forms a bifurcated hydrogen bond system with the main chain carbonyl of Trp587/Trp592 (rnNOS/hnNOS) and the side chain carboxylate of Glu592/Glu602 (rnNOS/hnNOS). This is identical to the structural details observed for other nNOS inhibitors containing a 2-aminoquinoline. 6,7,8,9 All three crystal structures clearly reveal that the central phenyl ring resides between heme propionates A and D. In the hnNOS-5 structure, the tail phenethylamine moiety makes a direct H-bond interaction with the H 4 B and propionate A, displacing the water there, while the rnNOS-5 structure only makes H-bonding contacts with the carbonyl of the H 4 B and is unable to displace the water molecule bridging propionate A and H 4 B.",
                        "In heNOS there are two molecules of 5 bound. Ligand A binds in the active site in a manner very similar to the nNOS structures, while Ligand B displaces H 4 B, with the aminoquinoline positioned in the pterin binding pocket. As a result, the tail ethylamine of 5 bound to heNOS is oriented in the opposite direction to what we observed in the nNOS structures, and instead interacts with propionate D. Ligand B is stabilized by aromatic stacking interactions with both Trp447 as well as Trp74 and Phe460 from the opposite chain at the dimer interface. Two-site binding is not unique to 5 and has been observed in several NOS-inhibitor structures. 20,21 In all four molecules of the asymmetric unit of heNOS, the aminoquinoline and phenyl rings of 5 are clearly defined. The electron density is weaker for the tail ethylamines, with slightly more density observed near propionate D, indicating a potential interaction with the heme propionate. Interestingly, the ability of 5 and other compounds to bind in both sites has little correlation with inhibitory potency, indicating that active site binding (and not H 4 B displacement) determines potency.",
                        "With the goal of improving hnNOS activity and isoform selectivity, we made efforts to optimize the conformational positioning of the tail amine of 5. To this end, homologation, chain shortening, and isomerization of lead molecule 5 resulted in compounds 6-13. Methylation of the tail nitrogen atom of 5 (compound 6) resulted in over a 2-fold loss in rnNOS activity, while shortening the ethylene linker between the central ring and the terminal nitrogen atom by one carbon (compound 7) resulted in a 2.3-fold increase in rnNOS activity. Moreover 7 showed increased hnNOS inhibitory activity, as well as improvements in both rn/miNOS and hn/heNOS selectivity ratios, relative to parent molecule 5. The X-ray crystal structures of 7 bound to rnNOS and hnNOS (Figure 5) reveal well-defined density at the aminoquinoline and central ring regions that closely overlaps with lead 5. However, the orientation of the tail aminomethyl group in both structures could not be determined because of poor density, even at a low contour levels, suggesting free rotation of the aminomethyl occurs toward either propionate A and the H 4 B site water, as modeled in Figure 5A andB, or toward propionate D and Tyr706/Tyr711 (rnNOS/hnNOS). In both nNOS structures, the position of the central phenyl ring of 7 forces heme propionate D into a downward conformation. As observed for 5 and 6, methylation of the tail nitrogen atom of 7 to yield 8 resulted in a loss of potency against both rat and human nNOS, suggesting that a primary amino group at this position is important for achieving maximal inhibitory activity against nNOS isoforms.",
                        "It appears that some parts of the phenylaminoquinoline SAR overlap with that of the previously reported phenyl ether compounds. 7 For example, phenyl ether compounds with one methylene between the amino group and the aryl ring (benzyl) are more potent and selective than those with two (phenethyl) or more methylenes, and the same trend is observed here (cf. 7 and 8 vs. 5 and 6); compound 9 (K i (rnNOS) = 140 nM) also has slightly less potency than 5. Nonetheless, other parts of the SAR are distinct from the previous aminoquinoline SARs. For instance, N-methylated compounds (6, 8) are less potent than the desmethyl analogues (5, 7), which is the reverse of what was generally observed for benzyl and phenethyl ether compounds.",
                        "The o-substituted isomers (11 and 10) possess less inhibitory potency (11, K i (rnNOS) = 935 nM; 10, K i (rnNOS) = 119 nM) than their corresponding para-substituted derivatives 5 and 7, respectively. Furthermore, 10 displays a similar loss in hnNOS potency and a sharp decrease in rn/miNOS selectivity. However, poor binding affinity to heNOS (10, K i (heNOS) = 41,900 nM) results in a gain in hnNOS selectivity over heNOS compared to 7. In contrast to o-substitution, m-substituted isomers 13 and 12 exhibited comparable potencies to 5 and 7, respectively [13, K i (rnNOS) = 107 nM; 12, K i (rnNOS) = 55 nM]. Moreover, 12 also has very good nNOS selectivity over iNOS (rn/miNOS = 440) and outstanding selectivity over eNOS (hn/heNOS = 877). The assay data for 12 suggest that placing the aminoalkyl tail portion metato the quinoline favors binding to the human nNOS isoform, which prompted examination of the crystal structures of both rnNOS-12 and hnNOS-12. As shown in Figures 6A and6B, the tail amino group in the meta-position of the benzene ring may participate in maximal binding interactions with a water-filled polar pocket composed of the carboxylate of propionate A, the side chains of Gln478/Gln483 and Arg481/Arg486, and, most notably, Asp597/Asp602 (rnNOS/hnNOS, respectively), resulting in reduced flexibility in the tail aminomethyl group.",
                        "In sharp contrast, the tail aminomethyl group in the heNOS-12 structure (Fig. 6C) shows a different orientation, making H-bonds with heme propionate A. It is important to note that there is a major difference in the active site of human eNOS, namely, Asn366 replaces Asp597/Asp602 (rnNOS/hnNOS) in the polar pocket noted for nNOS. In earlier studies we found that this Asp/Asn difference makes substantial contributions to isoform selectivity. 22 This is the likely the basis for the high selectivity observed for 12, because the aminomethyl group is oriented toward Asp597/Asp602 in the rnNOS/hnNOS structures.",
                        "We proposed that homologated analogue 13 could have improved activity because the longer chain might allow it to potentially displace one of the structural waters near the nNOSspecific Asp residue. However, the nNOS inhibitory activity of 13 is weaker, comparable to para-substituted derivative 5 (and about two-fold lower than 12), indicating that either a) this water molecule is not displaced, or b) any energy gained from water displacement does not offset entropic costs of chain elongation, internal torsion, or other negative interactions between the enzyme and inhibitor. The crystal structures of rnNOS-13 and hnNOS-13 (Figure 7) support the former hypothesis; the tail amino group does not occupy this polar pocket, but rather only displaces the water molecule bridging propionate A and the H 4 B. Consequently, the aminoethyl group can only reach the closer heme propionate A for an electrostatic interaction rather than the farther Asp597/Asp602 site (rnNOS/hnNOS).",
                        "Previously, installation of a nitrile at the 5-position of phenyl ether-linked aminoquinolines greatly improved potency, as the nitrile fit into a small, previously undiscovered auxiliary pocket, where it formed a H-bond with a deep structural water and stabilized binding; 8 likewise, 1,3,5-trisubstituted nitrile-containing aminopyridine derivatives 23 exert augmented potency and selectivity via differential interactions with the Asp site (vs. the Asn site in eNOS). For the phenylquinoline scaffold, however, the nitrile is a very deleterious modification [14, K i (rnNOS) = 10,300 nM]. Examination of the crystal structure of 12 (Figure 6A) indicates that the 5-position nitrile of the more compact and rigid phenylquinoline (compared to the more flexible phenyl ether molecule) cannot reach this auxiliary pocket. Instead, the position of the phenyl ring of 14 (just like 12) would force heme propionate D into a downward conformation; thus, the 5-position nitrile would cause serious clashes with nearby residues. This is another area where the SARs of phenyl etherlinked aminoquinolines and phenylquinolines drastically diverge.",
                        "On the basis of the 12-bound NOS crystal structures (Figure 6), pyridine 15 was expected to be a potent inhibitor. In addition to having an identical binding mode to 12, the pyridine nitrogen atom forms a hydrogen bond with heme propionate D in all three NOS structures (Figure 8). The aminomethyl group of 15 approaches Gln478 in rnNOS, and is disordered but may point to Asp602 in hnNOS, and heads to the water molecule near heme propionate A in heNOS, where a second molecule of 15 is bound in the pterin site. Nonetheless, the pyridine analogue is approximately 5-fold less potent than 12 in rnNOS, contradicting both the crystallographic observations and previous results for pyridine-containing 2aminopyridine and 2-aminoquinoline compounds. 7 The unpredicted effect may be electronic, or the pyridine may influence interactions of the aminomethyl group with nearby water molecules.",
                        "Constrained Amine Analogues 16-18.",
                        "See Supporting Information for details."
                    ],
                    "subsections": []
                },
                {
                    "title": "4-Alkoxy-3-aminomethyl Analogues 19-29.",
                    "paragraphs": [
                        "Docking studies with 12 also indicated that a variety of groups might be accommodated at position 4 of the phenyl ring (Supporting Information Figure S1). Substituents at this position could form favorable van der Waals interactions with Met336/Met341 or Leu337/ His342 (rnNOS/hnNOS), residues that have previously been implicated in high n/eNOS selectivity for 2-aminoquinoline-based inhibitors, 7 and which are replaced by Val104 and Phe105 in heNOS, respectively. 12 To this end, 19-29, which have a variety of steric, electronic, and H-bonding properties that could provide crucial SAR information, were prepared and assayed for NOS inhibitory potency. In general, small substituent modifications at the 4-position of lead 12, such as fluorine (19), chlorine (20), ethyl (22), and methoxyl (23) do not add additional good contacts in the rat nNOS active site, resulting in a loss of potency. Compound 21 is also a less potent inhibitor given that the trifluoromethyl group of 21 is likely too bulky to fit. However, changing the 4-position methoxyl group (23) to an ethoxyl group (24) restored the potency in rnNOS. The crystal structure of 24 bound to rnNOS (Figure 9A) shows strong density for the aminoquinoline and central phenyl ring as seen in parent compound 12. While the aminomethyl moiety occupies the water site between H 4 B and propionate A, the ethoxyl group is large enough to establish some contacts with Met336. It seems that as a minimum a 3-atom, nonpolar moiety at the 4-position fits better into rnNOS.",
                        "In the hnNOS-24 structure, the central phenyl ring of 24 flips 180° relative to the orientation seen in rnNOS. The aminomethyl moiety interacts with Asn574 (Figure 9B) and the ethoxyl group still can reach Met341 for contact. It might be that the polar nature of His342 pushes the ethoxyl group away and causes the central phenyl ring to flip. The binding mode of 24 in heNOS (Figure 9C) is almost identical to that observed in rnNOS (Figure 9A). The better nonbonded contacts between the ethoxyl moiety of 24 and the bulky Phe105 side chain makes the inhibitor more ordered in structure and leads to rather low n/e selectivity (164).",
                        "Discussion of the small-4-alkoxy-3-aminomethyl and 4-cycloalkoxy analogues (25-28) is in the Supporting Information.",
                        "A further improvement for rnNOS inhibition was observed by the addition of a small cycloalkyl group (28 and 29). The addition of a cyclobutyl tail moiety allows 28 to form van der Waals interactions in the Met336-Leu337-Tyr706 pocket, resulting in good potency with rnNOS (K i (rnNOS) = 49 nM). The slightly less bulky cyclopropane analogue 29 was found to have even greater rnNOS potency [K i (rnNOS) = 39 nM], making it the most potent rnNOS inhibitor in the entire series. The X-ray crystal structure of 29 bound to rnNOS (Figure 10A) reveals that the tail cyclopropane ring fits nicely into the hydrophobic pocket surrounded by Met336, Leu337, and Tyr706, with the side chain of Thus far, it appears that considerably larger alkoxyl substituents can be accommodated at the 4-position. Aryl substituents are also tolerated; for example, compound 30, with its bulky 3fluorobenzyl group at position 4, is only slightly less potent than 24, although it is considerably less potent than an aminopyridine-pyrrolidine compound (18 nM) after which it is modeled. 24 This trend is also observed with the benzonitrile ring of 31; previously, 4cyanoaryl compounds had good hnNOS activity, but lower hn/heNOS selectivity (generally ~30-fold), 9 but in this phenylquinoline scaffold, the hn/heNOS selectivity is higher with the 4-cyanoaryl group present. However, the hn/heNOS selectivity of 31 remains inferior to leads 5, 12, and 24 because of increased binding to heNOS (8300 nM). The unusual crystallographic binding behavior of 31 is discussed in the Supporting Information.",
                        "Given the lower hn/heNOS selectivity for 31, as well as the disfavored binding to the human nNOS active site, we decided to reduce the overall length of the inhibitors to better fit into the hnNOS active site, while maintaining H-bond accepting capability in the tail ring. The 2and 3-pyridinylmethyl ether groups of 32 and 33, respectively, were introduced to provide contact with either Leu337 in rnNOS or His342 in hnNOS. Relative to 12, both pyridinyl modifications provided slight improvements in rnNOS potency (32, K i = 52 nM; 33, K i = 44 nM). The crystal structure of rnNOS-32 with compound 33 overlaid (Figure 11A) shows nearly identical binding positions for the aminoquinoline and tail pyridine, with the pyridinyl nitrogen facing away from Leu337 in both cases (to allow hydrophobic interactions). The difference lies in the orientation of the central phenyl ring. As a result, the central-ring aminomethyl group of 33 displaces the H 4 B site water, whereas this moiety points away from the existing water in 32.",
                        "In the hnNOS-32 structure (Figure 11B), the overall binding remains largely the same, although the orientation of the middle phenyl ring is different in the two nNOS cases. Here, the ring does not press sufficiently against heme propionate D, and the latter is not distorted as seen in the rnNOS-32 structure. The differences might be the result of the Leu337 (rat) and His342 (human) variation, where the bulkier His342 side chain in human nNOS pushes the tail pyridine of 32 away so that the central phenyl ring does not make such close contacts with heme propionate D. Because of the 2-position of the pyridine nitrogen, a H-bond with the His342 side chain is not possible. Additionally, the position of the aminomethyl group on the phenyl ring has some uncertainty, although some weak electron density supports a likely interaction with Asn574. These deleterious interactions lead to a decreased binding affinity of 32 to hnNOS (K i = 76 nM). However, by virtue of substantially diminished binding potency towards miNOS and heNOS, the rn/miNOS and hn/heNOS selectivities of 32 remain quite high (rn/miNOS = 879, hn/heNOS = 312).",
                        "Compound 32 is unique in that previously reported aminoquinolines substituted with pyridines 3 generally had only 10-20-fold n/eNOS selectivity. However, 32 exhibits fairly good hn/heNOS selectivity (312-fold). The main difference is that in the heNOS-32 crystal structure (Figure 11C) the orientation of the central phenyl ring is perpendicular to the aminoquinoline ring rather than parallel as in hnNOS-32. As a result, the amino group of 32 in heNOS is about 2 Å farther from heme propionate D than it is in hnNOS-32. In addition, the amino group in hnNOS-32 H-bonds with Asn574. These interactions are possible reasons for the good hn/heNOS selectivity.",
                        "The 3-pyridylmethyl ether of 33 moderately increases hnNOS potency (K i = 45 nM for 33 vs. 60 nM for 12). This is not the first instance that the 3-pyridyl moiety has improved binding to hnNOS, 9,25 although it is the first example where such a compound has equal potency for both the rat and human enzymes. The hnNOS-33 X-ray structure (Figure 12B) shows good density for the aminoquinoline and central phenyl rings. The tail pyridine portion shows signs of disorder, but a potential H-bond between the pyridine and His342 is more feasible for 33 than for 32. In the rnNOS-33 structure, however, the hydrophobic portions of the pyridine about the nonpolar residues Leu337 and Met336 (Figure 12A), suggesting that the pyridine can be either a hydrophobic or a H-bonding moiety depending on the nNOS isoform it is bound to. The aminomethyl moiety of 33 still interacts with Asn574 of hnNOS (Figure 12B), while in rnNOS-33 it makes an electrostatic interaction with heme propionate A (Figure 12A). Both interactions are favorable, and the results taken together may suggest a reason for equal potency against rat and human enzymes.",
                        "In heNOS-33, the aminomethyl moiety H-bonds heme propionate A (Figure 12C), rather than pointing out toward Gln247 as in the case of 32 (Figure 11C). How could the pyridinyl nitrogen atom position make such a large difference? The pyridine ring nitrogen atom of 33 can make an extra H-bond with a water molecule next to the H 4 B, which pulls the inhibitor closer to heme propionate A and results in better interactions. This may explain the 3-fold improvement in binding affinity of 33 (7700 nM) versus 32 (23,700 nM) toward heNOS, which leads to the poorer n/eNOS selectivity observed for 33 (172-fold).",
                        "The incorporation of heterocyclic H-bond acceptors leads to favorable increases in both potency and selectivity. Utilizing heterocycles with the dual ability to form hydrophobic interactions in rnNOS while also forming H-bonding interactions with isoform-specific His342 in hnNOS may be advantageous for in vivo studies (where activity in rats is necessary). Considering the importance of the heterocycle, we also sought to exchange the bulky pyridine for smaller heterocycles (as in analogues 34-37). These compounds all demonstrated high potencies against rnNOS, with K i values all below 60 nM.",
                        "The use of isoxazole (as in 34) resulted in lost activity against hnNOS. However, 4-(methyloxy)-1,3-thiazole (35) resulted in a K i of 31 nM against hnNOS, making 35 the most potent hnNOS inhibitor in this series. Comparing the X-ray crystal structures of rnNOS-35 (Figure 13A) and hnNOS-35 (Figure 13B) reveals a common binding orientation of the aminoquinoline ring, but with differences in the central phenyl ring resulting from different interactions between the thiazole ring and the enzyme. In the rnNOS structure, the thiazole is positioned near Leu337 with its carbon atom making the closest contact. In hnNOS-35, the thiazole is near His342, with its S atom facing toward His342 and its N atom H-bonding with a water molecule. The bulkier His342 in hnNOS pushes 35 slightly farther away from the heme than its position in rnNOS. Therefore, the aminomethyl group on the central phenyl ring in hnNOS H-bonds with Asn574, whereas the same moiety points toward Gln478 in rnNOS, and the phenyl ring flips almost 180°. Unfortunately, single digit micromolar inhibitory activity of 35 against miNOS and heNOS results in low rn/mi and hn/ heNOS selectivities relative to 32.",
                        "The use of oxazole (36) results in a slight loss in hnNOS potency (K i = 63 nM). However, reduced inhibitory activity against miNOS and heNOS led to excellent selectivities (rn/ miNOS = 382, hn/heNOS = 433). Crystallographic details of 36 and 37 are discussed in the Supporting Information."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human iNOS Inhibition Study.",
                    "paragraphs": [
                        "Recently, we successfully expressed and purified human iNOS protein 21 that showed robust activity. Human iNOS (hiNOS) assay data were collected for eight compounds, including the three simple aminomethyl compounds, 7, 10, and 12, as well as a sampling of the more potent compounds from the latter series (29, 32, 36, and 37) to determine the SAR for the human system. K i values obtained from rat and human nNOS, as well as murine and human iNOS, were used to approximate the cross-species selectivity between lower (rn/mi) and higher order species (hn/hi) (vide infra). The major difference between murine and human iNOS that might affect inhibitor binding is that Asn115 in miNOS is Thr121 in hiNOS. The tail part of many inhibitors might reach the site based on observations in the available nNOS and eNOS structures. Without an iNOS-inhibitor structure, we can only speculate on potential interactions by superimposing the iNOS structures onto the known nNOS-inhibitor structures.",
                        "The general inhibition trends in Table 2 are more or less consistent (<2-fold) between murine and human iNOS, with only 7 and 33 as the principal exceptions. Compound 7 is a compact inhibitor that makes weaker contacts with the Asn115/Thr121 (miNOS/hiNOS) site. The two-fold difference in binding affinity might result from the variation in a watermediated H-bonding network or another unknown reason. Contrarily, overlaying the structure of miNOS or hiNOS on hnNOS-33 (Figure 14) reveals that the pyridine nitrogen atom of 33 is capable of making a direct H-bond with either Asn115 or Thr121. The threefold weaker binding affinity to hiNOS might indicate a weaker interaction with Thr121 in hiNOS (than with Asn115 in miNOS). In the same overlay, another variation site, Ser256/ Ala262 (miNOS/hiNOS) is more than 5.0 Å from the potential position of the aminomethyl moiety of 33, likely too far away to influence inhibitor binding.",
                        "Directed Mutagenesis Supports Water-mediated Interaction of Inhibitors with Asp597.",
                        "Previous studies indicated that Asp597 in rnNOS electrostatically stabilizes cationic inhibitors and can account for much of the e/nNOS selectivity (as this residue is Asn in heNOS). A second difference, Met336 in rnNOS (Val in heNOS), can provide better nonpolar contacts with inhibitors and impart selectivity. To test the importance of these differences further, we determined the K i values for certain compounds against various rnNOS mutants (Table 3).",
                        "All tested compounds exhibited decreased potency against the single mutant enzyme (D597N) (perhaps, as expected), but against the double mutant, all compounds had potency comparable to the single mutant (except for 12, where it was greatly reduced). Compound 36, actually displayed 5-fold increased potency against the double mutant (versus the single mutant). The rnNOS-36 structure shows that the tail end of the inhibitor contacts Met336 and Leu337. These two residues are Val104 and Phe105 in heNOS, and contacts made with the tail end of the inhibitor may involve more than the Met/Val difference. It is possible that the local environment near the Val336 and Leu337 residues in the M336V/D597N double mutant enables better contacts with the tail end of the inhibitor than the same area in the D597N single mutant does, thus improving the potency against the double mutant versus the single mutant. This trend is reflected in the behaviors of 29, 32, and 36, which all have a long tail moiety that fits in this region of the enzyme. On the other hand, more compact inhibitors might be less sensitive to the Met/Val mutation site.",
                        "We conclude by focusing on 12, since this inhibitor exhibits the best hn/heNOS selectivity (877-fold). The D597N mutant decreases potency 8-fold, which further drops to 29-fold against the M336V/D597N mutant -even though this inhibitor does not appear to make contact with the Met/Val site. It is perhaps more instructive to consider the change in ΔG bind obtained from the K i values, where ΔG bind = -RTlnK i . ΔG bind for WT hnNOS, WT heNOS, and the hnNOS D597N mutant are -9.9, -4.5, and -7.3 kcal/mol, respectively. Thus the Asp/Asn difference accounts for about half of ΔΔG bind between heNOS and hnNOS, leaving about -2.6 kcal/mol of binding affinity unexplained. This underscores the limitation of quantitatively explaining selectivity (against isoforms or mutants) by a few simple amino acid differences and a comparison of static X-ray structures. There are clear examples of differences in active site dynamics and the ability of even conserved side chains to adjust to inhibitor binding that could also contribute to selectivity (anchored plasticity) in cases like this. 26 Off-Target Profiling.",
                        "Four structurally diverse compounds from this series (12, 29, 32, and 33) were screened by the National Institute of Mental Health's Psychoactive Drug Screening Program (PDSP, Table 4). In this assay, 27 compounds were screened against a panel of 45 pharmacologically relevant CNS targets and receptors using a radioligand displacement assay. Initially, the assay used a primary high dose (10 μM) and then a secondary K i determination was performed for compounds showing >50% binding in the primary assay. We classify offtarget binding using the following rubric: concerning (K i < 100 nM, or <~2 × nNOS K i value), moderate (100-300 nM, or ~2-5 × nNOS K i value), weak (>300 nM, or > ~5 × nNOS K i value, typically ~1 μM), and insignificant (<50% at 10 μM). The off-target profiles of previous aminoquinolines "
                    ],
                    "subsections": []
                },
                {
                    "title": "Membrane Permeability and Microsome Stability.",
                    "paragraphs": [
                        "As our ultimate goal is to utilize these compounds as CNS drugs, membrane permeability for compounds 7, 12, 29, 33 and 37 was determined using the parallel artificial membrane permeability for the blood-brain barrier (PAMPA-BBB) assay. In this assay, an artificial membrane containing BBB phospholipids is used to assess permeability. A compound is predicted to have good BBB penetration and is classified as a \"CNS (+)\" molecule if its effective permeability (P e ) in this assay is larger than 4.0 × 10 -6 cm s -1 . 30,31,32,33 Additionally, the web tool SwissADME was used to make in-silico passive-BBB penetrability predictions based on their validated BOILED-Egg (Brain Or IntestinaL EstimateD permeation) predictive model. 34,35 Table 5 contains P e values of three commercial drug standards and selected nNOS inhibitors 7, 12, 29, 33 and 37. All of the selected nNOS inhibitors are predicted \"CNS (+)\" with P e values up to 15.5 × 10-6 cm/s. Compounds 33 and 37 display the lowest permeability among the selected compounds (P e = 8.09 ± 0.67 × 10 -6 cm s -1 and 7.04 ± 2.43 × 10 -6 cm s -1 , respectively), indicating that the presence of the heterocyclic tail portion may reduce the permeability of these compounds. However, while the P e values for 33 and 37 were high enough to score as \"CNS (+)\", the BOILED-Egg permeant model predicted they would not have BBB penetration because of their higher tPSA values of 87.05 Å 2 and 115.29 Å 2 , respectively, although these two compounds, along with all the tested compounds, have predicted LogD and LogP values that are favorable for BBB penetration. Cyclopropyl compound 29, which lacks 33 and 37's polar heterocycles, has a lower tPSA (74.16 Å 2 ), a two-fold higher P e , and is predicted to be BBB (+). Eliminating the substitution at the 4-position gave mixed results. Although not as high as 29, compound 7 maintained a high P e value (11.3 ± 1.64 × 10 -6 cm s -1 ) relative to 33 and 37, although compound 12 was found to have the highest P e out of all compounds assayed. Additional cellular pharmacokinetic assays are in progress.",
                        "Additionally, stability in the presence of human liver microsomes (HLM) was determined for 12 and positive control terfenadine. The results of this study (Table 6) show that 12 displays high stability relative to the positive control, as indicated by a half-life (t 1/2 ) >60 minutes. However, 12 did show a sign of degradation in buffer control samples (Supporting Information, Table S3)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "In summary, we prepared a series of novel 7-phenyl-2-aminoquinolines possessing tail amines designed to target nNOS-specific aspartate residues Asp597/Asp602 (rnNOS/ hnNOS), and thereby result in higher n/eNOS selectivity. Initially, screening compounds 5-13 revealed a preference for meta-substituted benzylamines, such as 12, which shows excellent potency and outstanding selectivity for nNOS over the other isozymes. A number of modifications to 12 were made, which included reducing or constraining amino group flexibility, substituting the 4-position of the phenyl ring, and using a 1,3,5-tri-substituted phenyl core. While the amine cannot be constrained effectively, and 1,3,5-tri-substitutions clash deleteriously with heme propionates in the enzyme, some 4-position additions enhance potency and maintain high isoform selectivity via favorable interactions with isoformspecific residues on the far end of the substrate access channel, namely, Leu337/His342 (rnNOS/hnNOS). Crystal structures indicate that these compounds act as competitive arginine mimics, where the aminoquinoline forms hydrogen bonds with the active-site glutamate residue, but also that substitutions at the 4-position can reduce phenyl ring rotation to favor interactions with the Asp (Asp597/Asp602)/H 4 B/propionate A site over the propionate D site. Mutagenesis studies confirmed the influence of the Asp site on inhibitor potency, making this class of aminoquinolines the first with the ability to target this site in nNOS, although preference for this site varies from compound to compound. Finally, with these inhibitors, the hn/heNOS selectivity derives more from a weakening of affinity to heNOS rather than an increase in affinity for hnNOS; inhibitors more complex than 12 tend to be less selective because of an increased affinity for heNOS. Apparently, more complex substituents provide additional contacts that improve binding to heNOS relative to hnNOS. On the basis of both their good potency and selectivity, clean CNS counterscreening (PDSP) profiles, and excellent permeability in our PAMPA-BBB assay, the most promising compounds, 12 and 29, are being advanced into preclinical studies."
            ],
            "subsections": []
        },
        {
            "title": "Experimental Section",
            "paragraphs": [
                "General Procedures.  36 , 43 37 , 45 38 , 52 39 , 53 40 , 56 41 , 57 8 , 66 42 , 69 43 , 70 15 , 86 44 , 89 45 , 90 40 , and 96 46 were prepared by literature procedures or are known, and their spectral or analytical data are identical to those reported."
            ],
            "subsections": [
                {
                    "title": "Anhydrous solvents (THF, CH",
                    "paragraphs": [
                        "General Procedure 1: Suzuki Coupling between 39 and Aryl Halides.",
                        "Compound 39 (1 eq.), the requisite aryl halide (1-1.2 eq.), Pd(dppf)Cl 2 (5 mol%) and NaHCO 3 (3.5-4 eq.) were combined in dimethoxyethane/H 2 O (3:1, 4 mL solvent per 0.25 mmol 39 is sufficient) in a 20 mL sealable microwave vial. The mixture was briefly sparged with argon, sealed, and heated to 120 ˚C under microwave irradiation with stirring (720 rpm) for 20-25 minutes. After cooling, the mixture was partitioned between EtOAc and H 2 O (10 mL each), the layers were separated, and the aqueous layer was extracted with EtOAc (3 × 30 mL), and the organic layer was washed with 5% aq. NaCl (2 × 50 mL) and sat. aq. NaCl (50 mL), dried over anhydrous sodium sulfate and concentrated. The crude residue was purified as listed below under subheadings for individual compounds.",
                        "General Procedure 2: Deprotection of Aminoquinolines.",
                        "The protected intermediate was immediately diluted with MeOH (9-10 mL/0.2 mmol of protected quinoline), and K 2 CO 3 (2 eq.) was added. The mixture was heated at reflux for 2-2.5 h, cooled, and concentrated, and the residue was partitioned between EtOAc (10 mL) and H 2 O/sat. aq. NaCl (1:1, 10 mL). The layers were separated, the aqueous phase was extracted with EtOAc (3 × 20 mL), and the organic layers were combined, washed with sat. aq. NaCl (20 mL), dried over anhydrous sodium sulfate and concentrated. Purification, if necessary, is described below under subheadings for individual compounds. The resulting free 2-aminoquinoline was dissolved in MeOH or ether/MeOH (10-15 mL), filtered to remove particulate matter, and treated with methanolic HCl (~3 M, ~1.5-2 mL). The mixture was stirred overnight at r.t. and workup (as described below) afforded the deprotected compounds as hydrochloride salts."
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(4-(2-Aminoethyl)phenyl)-4-methylquinolin-2-amine Dihydrochloride (5).",
                    "paragraphs": [
                        "Compounds 39 (0.050 g, 0.163 mmol) and 41 (0.050 g, 0.167 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 30% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 42 as a white solid (0.052 g, 76%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was diluted in ether/MeOH (1:1, 20 mL), heated gently to affect solution, filtered, and cooled. After treatment with methanolic HCl, 5 was obtained as a cream-colored solid (0.037 g, 86% from 42) after triturating with ether and drying in vacuo: "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(4-(Aminomethyl)phenyl)-4-methylquinolin-2-amine Dihydrochloride (7).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 45 (0.082 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 40% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 59 as a yellow solid (0.062 g, 63%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was precipitated from EtOAc (1 mL) with hexanes (9 mL), triturated with hexanes, and diluted in ether/MeOH (5:1). After treatment with methanolic HCl, 7 was obtained as a cream-colored solid (0.043 g, 84% from 59) after filtering, precipitating twice from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp >300 ˚C (darkens slowly), >360 ˚C (melts or decomposes). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(2-(Aminomethyl)phenyl)-4-methylquinolin-2-amine Dihydrochloride (10).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 52 (0.070 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 62 as pale-yellow crystals (0.098 g, 99%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was diluted in ether/MeOH (5:1). After treatment with methanolic HCl, the mixture was concentrated, and 10 was obtained as a white solid (0.070 g, 86% from 62) after precipitating twice from hot MeOH (1 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 290-291.5 ˚C. 1 "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(2-(2-Aminoethyl)phenyl)-4-methylquinolin-2-amine Dihydrochloride (11).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 53 (0.077 g, 0.257 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 63 as pale-yellow crystals (0.093 g, 90%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was sonicated with hexanes, and the solid was collected and diluted in ether/MeOH (2:1). After treatment with methanolic HCl, the mixture was concentrated, and 11 was obtained as an off-white powder (0.064 g, 83% from 63) after precipitating twice from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp >300 ˚C (darkens slowly), 323-325 ˚C (dec). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(2-Aminoethyl)phenyl)-4-methylquinolin-2-amine Dihydrochloride (12).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 56 (0.070 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 40% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 64 as a yellow foam (0.089 g, 90%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was precipitated from EtOAc (2 mL) with hexanes (20 mL), and diluted in ether/MeOH (5:1). After treatment with methanolic HCl, 12 was obtained as a cream-colored flocculent solid (0.053 g, 72% from 64) after filtering, precipitating twice from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 305.5-306.5 ˚C. "
                    ],
                    "subsections": []
                },
                {
                    "title": "3-(2-Amino-4-methylquinolin-7-yl)-5-(aminomethyl)benzonitrile Dihydrochloride (14).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 67 (0.083 g, 0.269 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 68 as a yellow foam (0.082 g, 78%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was purified by flash column chromatography, eluting with a gradient of EtOAc to 5% MeOH in EtOAc to yield a white semisolid that was diluted in ether/MeOH (10:1). After treatment with methanolic HCl, ether (5 mL) was added, and 14 was obtained as a cream-colored solid (0.069 g, 68% from 68) after filtering, precipitating from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp >320 ˚C (darkens) >360 ˚C (melts or decomposes).  Compounds 39 (0.075 g, 0.245 mmol) and 70 (0.114 g, 0.294 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 70% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 71 as a white solid (0.080 g, 65%). 1 H-NMR confirmed the presence of two Boc groups. This compound was immediately deprotected using General Procedure 2, and after 3 h, an additional equivalent of K 2 CO 3 was added to remove one of the Boc groups. The mixture was heated a total of 4.5 h, and after workup, the free aminoquinoline was precipitated from EtOAc (0.5 mL) with hexanes (5 mL), and diluted in ether/MeOH (1:1). After treatment with methanolic HCl, ether (20 mL) was added and 15 was obtained as a tan solid (0.053 g, 90% from 71) after filtering, precipitating from hot MeOH (5 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 290-292 ˚C. "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(Isoindolin-4-yl)-4-methylquinolin-2-amine Dihydrochloride (16).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 73 (0.077 g, 0.257 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 74 as a yellow gum (0.093 g, 91%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was purified by flash column chromatography, eluting with EtOAc to yield a pale yellow solid. The solid was diluted in ether/MeOH (2:1). After treatment with methanolic HCl, the mixture was concentrated, and the residue was diluted in MeOH (3 mL) and filtered through a small pad of Celite. Reconcentration afforded a residue that was then precipitated three times from hot MeOH (3 mL) with ether (10 mL) to yield 16 as a pale tan solid (0.040 g, 52% from 74) after washing with ether and drying in vacuo: mp 220-224 ˚C (softens), 233-235 ˚C (dec). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(1-Amino-2,3-dihydro-1H-inden-5-yl)-4-methylquinolin-2-amine Dihydrochloride (17).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 79 (0.076 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 81 as a yellow foam (0.091 g, 86%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was precipitated from",
                        "EtOAc (1 mL) with hexanes (20 mL), and the gel-like solid was filtered and diluted in ether/ MeOH (2:1). After treatment with methanolic HCl, ether (8 mL) was added, and 17 was obtained as a white solid (0.059 g, 78% from 81) after precipitating from hot MeOH (5 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp: >300 ˚C (darkens slowly), >340 ˚C (chars). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-Amino-2,3-dihydro-1H-inden-5-yl)-4-methylquinolin-2-amine Dihydrochloride (18).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 80 (0.076 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 2% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 82 as a yellow semisolid (0.093 g, 88%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was purified by flash column chromatography, eluting with EtOAc. Concentration afforded a residue that was diluted in MeOH. After treatment with methanolic HCl, the mixture was concentrated, azeotroped with toluene twice, and 18 was obtained as a white solid (0.064 g, 82% from 82) after precipitating twice from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 250-256 ˚C (darkens, then chars). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-fluorophenyl)-4-methylquinolin-2-amine Dihydrochloride (19).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 87 (0.099 g, 0.282 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 117 as a dark yellow foam (0.088 g, 85%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was diluted in ether/MeOH (5:1). After treatment with methanolic HCl, 19 was obtained as a cream-colored flocculent solid (0.060 g, 81% from 117) after precipitating from hot MeOH (1 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 300-302 ˚C (dec). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-chlorophenyl)-4-methylquinolin-2-amine Dihydrochloride (20).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 88 (0.105 g, 0.282 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 40% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 118 as a yellow foam (0.095 g, 88%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was diluted in ether/MeOH (5:1). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-trifluoromethylphenyl)-4-methylquinolin-2-amine Dihydrochloride (21).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 90 (0.100 g, 0.282 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 119 as a yellow solid (0.102 g, 88%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was purified by flash column chromatography, eluting with EtOAc to yield a pale yellow gum that was diluted in ether/ MeOH (10:1). After treatment with methanolic HCl, ether (5 mL) was added, and 21 was obtained as a cream-colored powder (0.054 g, 62% from 119) after precipitating from hot MeOH (2 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 327-329 ˚C. "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-ethylphenyl)-4-methylquinolin-2-amine Dihydrochloride (22).",
                    "paragraphs": [
                        "Compounds 39 (0.060 g, 0.196 mmol) and 95 (0.065 g, 0.206 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 120 as a cream-colored solid (0.074 g, 87%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was triturated with 5% EtOAc in hexanes and the solid was collected, washed with hexanes, diluted in EtOAc, filtered, and concentrated. The residue was diluted in ether/MeOH (6:1). After treatment with methanolic HCl, the mixture was concentrated, and 22 was obtained as a an off-white solid (0.035 g, 56% from 120) after precipitating three times from hot MeOH (1.5 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 307-309 ˚C. "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-methoxyphenyl)-4-methylquinolin-2-amine Dihydrochloride (23).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 98 (0.085 g, 0.269 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 40% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 121 as a yellow foam (0.077 g, 72%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was triturated with hexanes. The solid was collected and diluted in ether/MeOH (8:1). After treatment with methanolic HCl, 23 was obtained as a yellow amorphous solid (0.057 g, 88% from 121) after precipitating from hot MeOH (5 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 232-234 ˚C. "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-ethoxyphenyl)-4-methylquinolin-2-amine Dihydrochloride (24).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 101 (0.089 g, 0.269 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 40% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 122 as a cream-colored solid (0.072 g, 65%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was triturated with hexanes.  Compounds 39 (0.075 g, 0.245 mmol) and 104 (0.093 g, 0.269 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 123 as an off-white solid (0.083 g, 73%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was triturated with 5% EtOAc in hexanes (15 mL), and the obtained solid was diluted in ether/MeOH (2:1). After treatment with methanolic HCl, the mixture was concentrated, the residue was azeotroped twice with toluene, and 25 was obtained as a yellow glassy solid (0.044 g, 62% from 123) after precipitating twice from hot MeOH (2 mL) with ether (10 mL), and drying in vacuo: mp 220 ˚C (softens), 264-266 ˚C (bubbles, melts). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-isopropoxyphenyl)-4-methylquinolin-2-amine Dihydrochloride (26).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 105 (0.093 g, 0.269 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 124 as an off-white solid (0.083 g, 73%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was precipitated from EtOAc (1 mL) with hexanes (10 mL) and the obtained solid was diluted in ether/MeOH (4:1). After treatment with methanolic HCl, the mixture was concentrated and azeotroped twice with toluene, and 26 was obtained as an off-white solid (0.0097 g, 14% from 124) after precipitating twice from hot MeOH (1 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 237-239 ˚C (softens), 245-246 ˚C (melts). 1 H-NMR (500 MHz; DMSO-d 6 ): δ 13.97 (s, 1 H), 9.00 (br s, 1 H), 8.26 (br s, 4 H), 8.07 (d, J = 8.  Compounds 39 (0.050 g, 0.163 mmol) and 106 (0.058 g, 0.160 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 125 as a yellow (0.056 g, 72%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was diluted in MeOH (10 mL), filtered, and diluted with 4 mL ether. After treatment with methanolic HCl, the mixture was concentrated and azeotroped with toluene twice to yield 27 as a cream-colored solid (0.043 g, 90% from 125) after precipitating from MeOH (2 mL) with ether (15 mL), washing with ether, and drying in vacuo: mp: 283-285 ˚C (softens, bubbles), 308 ˚C (chars). "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-(cyclobutylmethoxy)phenyl)-4-methylquinolin-2-amine Dihydrochloride (28).",
                    "paragraphs": [
                        "Compounds 39 (0.082 g, 0.270 mmol) and 107 (0.110 g, 0.300 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 80% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 126 as a tan foam (0.052 g, 40%). A portion of this compound (0.04 g) was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was taken up in MeOH (1.0 mL) and treated with methanolic HCl for 18h. The mixture was concentrated to minimal solvent and triturated with ether (10 mL) 3 × to afford 28 as an off-white solid (0.031 g, 88% from 126) after filtering, washing with ether, and drying in vacuo: mp 83-84 ˚C (softens) >209.5 ˚C (darkens) >241.2 ˚C (dec) "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-(cyclopropylmethoxy)phenyl)-4-methylquinolin-2-amine Dihydrochloride (29).",
                    "paragraphs": [
                        "Compound 108 (0.078 g, 0.219 mmol), tetrahydroxydiboron (0.059 g, 0.77 mmol), KOAc (0.064 g, 0.66 mmol), XPhos-Pd-G3 (2.4 mg, 2.8 μmol), and XPhos (2.6 mg, 5.5 μmol) were added to an oven-dried glass vial equipped with a Teflon-lined cap. 47 EtOH (2.2 mL, degassed) was then added to the reaction vessel and a nitrogen stream was allowed to bubble through the solution at room temperature for 15 min with stirring. The vessel was then sealed, and the reaction mixture was heated to 80 °C for 2 h. The reaction was then allowed to cool to ambient temperatures before 3 equiv (0.364 mL, 0.66 mmol) of 1.8 M degassed aqueous K 2 CO 3 was added via syringe followed by compound 38 (0.055 g, 0.20 mmol). The reaction vial was degassed with argon, resealed with a Teflon-lined cap, and left to stir at 80 °C for an additional 15 h. The reaction mixture was cooled to room temperature and partitioned between EtOAc and H 2 O (20 mL each). The layers were separated, the aqueous layer was extracted with EtOAc (3 × 20 mL), the organic layer was washed with 5% aq. NaCl (2 × 20 mL) and sat. aq. NaCl (20 mL), dried over anhydrous sodium sulfate, and concentrated. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 90% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 127 as a colorless solid (0.073 g, 78%). A portion of this compound (0.069 g) was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was taken up in MeOH (3.0 mL) and treated with methanolic HCl for 18 h, and concentrated to dryness. The title compound (29) was obtained as a yellow-colored solid (0.029 g, 49% from 127) after reverse phase flash column chromatography, eluting through a 15.5 g C18 RediSep RF Gold cartridge column with a gradient of 100% water to 100% acetonitrile, azeotropic removal of water with toluene, and drying in vacuo: mp >193.5 ˚C (foam dec) 1 H-NMR (500 MHz, DMSO-d 6 ) δ 14.",
                        "J = 8.7 Hz, 1 H), 6.99 -6.87 (m, 1 H), 4.09 (d, J = 5.0 Hz, 2 H), 3.99 (d, J = 6.9 Hz, 2 H),",
                        "J = 4.9 Hz, 2 H); 13 "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-((3-fluorobenzyl)oxy)phenyl)-4-methylquinolin-2-amine Dihydrochloride (30).",
                    "paragraphs": [
                        "Compounds 39 (0.060 g, 0.196 mmol) and 109 (0.090 g, 0.216 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 35% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 128 as a brown foam (0.078 g, 76%). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was purified by passing through a short plug of SiO 2 , washing with EtOAc and then 10% MeOH in EtOAc. Concentration afforded a residue that was diluted in ether/MeOH (2:1). After treatment with methanolic HCl, the mixture was concentrated, and 30 was obtained as a white solid (0.057 g, 84% from 128) after precipitating twice from MeOH (2 mL) with ether (10 mL), and drying in vacuo: mp 242-243.5 ˚C. Compounds 39 (0.075 g, 0.245 mmol) and 110 (0.102 g, 0.245 mmol) were coupled using General Procedure 1. After workup, the crude residue was suspended in EtOAc/ether (1:1) and filtered through a small pad of Celite overlaid with silica. The filtrate was concentrated to yield a residue that was washed with 5% hexanes/EtOAc (30 mL) to afford 129 as a white solid (0.073 g, 56%) after washing with hexanes. This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was purified by flash column chromatography, eluting with a gradient of EtOAc to 2% MeOH in EtOAc to yield a white solid that was diluted in ether/MeOH (2:1). After treatment with methanolic HCl, the mixture was concentrated, the residue was azeotroped with toluene, and 31 was obtained as a white solid (0.054 g, 84% from 129) after precipitating twice from MeOH (3 mL) with ether (15 mL), and drying in vacuo: mp 280-282 ˚C.  Compounds 39 (0.075 g, 0.245 mmol) and 111 (0.096 g, 0.245 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 10% EtOAc in CH 2 Cl 2 to 85% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 130 as a white powder (0.091 g, 72%) after precipitating from EtOAc (1 mL) with hexanes (20 mL). This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was purified by flash column chromatography, eluting with a gradient of EtOAc to 15% MeOH in EtOAc. Concentration afforded a residue that was diluted in MeOH. After treatment with methanolic HCl, the mixture was concentrated, the residue was azeotroped three times with toluene, and 32 was obtained as a white powder (0.063 g, 74% from 130) after precipitating three times from MeOH (5 mL) with ether (10 mL), washing with ether, and drying in vacuo: mp 231-233 ˚C (dec). 1 H-NMR (500 MHz; DMSO-d 6 ): δ 14.08 (s, 1 H), 9.04 (br s, 1 H), 8. "
                    ],
                    "subsections": []
                },
                {
                    "title": "7-(3-(Aminomethyl)-4-(pyridin-3-ylmethoxy)phenyl)-4-methylquinolin-2-amine Trihydrochloride (33).",
                    "paragraphs": [
                        "Compounds 39 (0.075 g, 0.245 mmol) and 112 (0.096 g, 0.245 mmol) were coupled using General Procedure 1. As the product was poorly soluble in EtOAc, the aqueous layer was extracted with 200 mL of EtOAc during the workup. After concentration, the residue was washed with 50% hexanes/EtOAc (30 mL) to afford 131 as an off-white solid (0.100 g, 80%) after washing with hexanes. This compound was immediately deprotected using General Procedure 2. After deprotection, the free aminoquinoline was purified by flash column chromatography, eluting with a gradient of 3%  Compounds 39 (0.085 g, 0.276 mmol) and 113 (0.132 g, 0.33 mmol) were coupled using General Procedure 1. Purification by flash column chromatography, eluting with a gradient of 5% EtOAc in CH 2 Cl 2 to 70% EtOAc in CH 2 Cl 2 , afforded protected phenylquinoline 133 as a white solid (0.032 g, 22%). This compound was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was taken up in MeOH (1.0 mL) and treated with methanolic HCl (1 mL) for 18 h, resulting in the formation of a white precipitate, which was concentrated to dryness. The title compound (34) was obtained as a tan solid (0.012 g, 43% from 132) after recrystallization overnight from methanol that was slowly diffused with ether, followed by removal of mother liquor, washing with 1:20 methanol-ether, and drying in vacuo: mp >267 ˚C (browns slowly) 272-274 ˚C (melts/gels) >277 ˚C (foams and decomp.).  19%). A portion of this compound (0.024 g) was immediately deprotected using General Procedure 2. After workup, the free aminoquinoline was taken up in MeOH (1.0 mL) and treated with methanolic HCl (1.5 mL) for 18h, and concentrated to dryness. The title compound (36) was obtained as a tan solid (0.014 g, 65% from 134) in 90% purity after recrystallizing once from 1:3 methanol-ethanol followed by an additional overnight recrystallization from methanol that was slowly diffused with ether, followed by removal of mother liquor, washing with 1:20 methanol-ether, and drying in vacuo. Additional purification of the crude product was achieved after reverse phase flash column chromatography, eluting through a 15.5 g C18 RediSep RF Gold cartridge column with a gradient of 100% water to 100% acetonitrile to afford pure 36 as a cream-colored solid (0.011 g, 47% from 135) after azeotropic removal of water with toluene and drying in vacuo: mp >151 ˚C (slowly browns) 253-254 ˚C). Purified NOS Enzyme Assays.",
                        "Rat and human nNOS, rat nNOS mutants, murine macrophage iNOS, human iNOS, and human eNOS were recombinant enzymes (expressed in E. coli and purified as reported previously). 21,48,49,50 To test for NOS inhibition, the hemoglobin capture assay was used to measure nitric oxide production.  52 3.9 μM (human eNOS), 53 1.7 μM (rat nNOS D597N single mutant), 54 and 1.9 μM (rat nNOS D597N/M336V double mutant). 48 PAMPA-BBB Assay.",
                        "The PAMPA-BBB assay was performed following a protocol described previously. 21 Briefly, the assay was done in 10 mM phosphate-buffered saline (PBS) buffer (pH 7.5), and compounds were tested at a concentration of 200 μM. The donor plate was first coated with 4 μL of porcine brain lipid (20 mg/mL in dodecane), followed by addition of 250 μL of a test compound. The acceptor plate was filled with 250 μL of PBS, and the donor plate was carefully placed on top of the acceptor plate to make a \"sandwich\". The plate was incubated at 25 °C for 17 h in a saturated humidity atmosphere with orbital agitation at 100 rpm. Verapamil, chlorpromazine, and dopamine were used as a positive, intermediate, and negative control, respectively. After incubation, 150 μL of test solution was taken from each well from both sides (donor and acceptor) and transferred to the UV plate for measurement.",
                        "The effective permeability (P e ) was calculated using the following equation 55 :",
                        ", where P e is the effective permeability (cm/s), V A and V D are the volume of the acceptor and donor well (0.25 cm 3 ), respectively, C A (t) is the concentration of the acceptor well at time t, C D (0), C D (t) is the concentration of the donor well at t 0 and t, respectively, A is the filter well area (0.21 cm 2 ). t is the incubation time (s). τ ss is the time to reach a steady state (usually very short compared to the incubation time). R is the retention membrane factor and was calculated using the following equation: R = 1 - 0. P e was reported as an average of triplicate measurements with a standard deviation."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human Liver Microsome Stability Assay.",
                    "paragraphs": [
                        "A 1120 μL aliquot of potassium phosphate buffer (50 mM, pH 7.4) containing liver microsomes (0.714 mg/mL) was added to individual 2 mL tubes (final concentration 0.5 mg/ mL). Positive control (terfenadine) and 12 (1 mM DMSO stocks) were directly spiked into respective tubes to prepare a concentration of 1.428 μM (final concentration 1 μM). From the above mixture, 70 μL was added to individual wells of 96-well reaction plates and preincubated at 37 ˚C for 5 min. All reactions were initiated by adding 30 μL of 3.33 mM NADPH (1 mM final concentration). Reactions without NADPH and buffer controls (minus NADPH) at 0 min and 60 min were also incubated to rule out non-NADPH metabolism or chemical instability in the incubation buffer. All reactions were terminated using 100 μL of ice-cold acetonitrile containing internal standard (glipizide) at 0, 5, 15, 30, and 60 min. The plates were centrifuged at 4000 rpm for 15 min and 100 μL aliquots were analysis for parent compound disappearance in multiple-reaction monitoring (MRM) mode using LC-MS/MS. The percent remaining of test compounds and positive controls in each sample was determined by considering peak area ratio in the 0-minute sample as 100%. The half-life (t 1/2 in min), and the in vitro intrinsic clearance (CL' int units in mL/min/kg) were calculated according to the following equations, where k is the gradient of line determined from a plot of peak area ratio (compound peak area / internal standard peak area) against time: For liver microsomes, a scaling factor used was 45 mg microsomal protein per g liver.",
                        "Inhibitor Complex Crystal Preparation.",
                        "The sitting drop vapor diffusion method was used to grow crystals at 4 °C for the heme domains of rnNOS (8 mg/mL containing 20 mM histidine), the hnNOS K301R/R354A/ G357D mutant (10 mg/mL containing 20 mM histidine), and heNOS (6 mg/mL). The crystal growth conditions were as described previously. 8 The only exception is that the pH for the heNOS crystal growth is 7.5 rather than 6.5 as mistakenly reported there. Fresh crystals were first passed stepwise through cryoprotectant solutions. The pH of the final soaking solution for rnNOS was adjusted from 5.8 through 6.5, 7.0 (in MES) to 7.5 (in HEPES) and that for hnNOS from pH 7.2 to 7.5 (in HEPES), for heNOS the BIS-TRIS buffer at pH 7.5 was unchanged. At pH 7.5, crystals were soaked with 5-10 mM inhibitor for 2-4 h at 4 °C before being flash cooled with liquid nitrogen and stored until data collection.",
                        "X-ray Diffraction Data Collection, Data Processing, and Structural Refinement.",
                        "The cryogenic (100 K) X-ray diffraction data were collected remotely at the Stanford Synchrotron Radiation Lightsource (SSRL) or Advanced Light Source (ALS) through the data collection control software Blu-Ice 56 and a crystal-mounting robot. When a CCD detector was used, 100-125° of data were typically collected with 0.5° per frame. If a Pilatus pixel array detector was used, 140-200° of fine-sliced data were collected with 0.2° per frame. More data frames were collected for heNOS which has a low symmetry (P2 1 ). Raw CCD data frames were indexed, integrated, and scaled using iMOSFLM, 57 but the pixel array data were preferably processed with XDS 58 and scaled with Aimless. 59 The binding of inhibitors was detected by initial difference Fourier maps calculated with REFMAC. 60 The inhibitor molecules were then modeled in Coot 61 and refined using REFMAC or PHENIX. 62 The symmetry of heNOS crystals was changed from the orthorhombic P2 1 2 1 2 1 reported previously 63 to monoclinic P2 1 , with a β angle only 0.6-0.7° off compared to the original 90°. Therefore, a molecular replacement calculation with PHASER-MR 64 was needed to solve the structure. In the P2 1 space group, there are two heNOS dimers in the asymmetric unit. Disordering in portions of inhibitors bound in the NOS active sites was often observed, sometimes resulting in poor density quality. However, partial structural features were usually still visible if the contour level of the sigmaA weighted 2m|Fo| -D|Fc| map was dropped to 0.5 σ, which afforded the building of reasonable models into the disordered regions. Water molecules were added in PHENIX and visually checked by Coot. The TLS 65 protocol was implemented in the PHENIX refinements with each subunit as one TLS group. The omit Fo -Fc density maps were calculated by the Polder map facility in PHENIX for the bound inhibitors. 66 The refined structures were validated in Coot before deposition in the Protein              The structure of hnNOS-33 (yellow) with the variant residues of miNOS (Asn115 and Ser256, gray, PDB code 1NOD) and hiNOS (Thr121 and Ala262, magenta, PDB code 4NOS) overlaid  37 were assayed for in vitro inhibition against purified human iNOS (hiNOS) using known literature methods, and K i values were calculated directly from IC 50 values using the Cheng-Prusoff equation. IC 50 values are the average of at least two replicates from 6-9 data points; all experimental standard error values (for the LogIC 50 ) are less than ± 0.10. K i values for isoforms: rat nNOS (rnNOS), human nNOS (hnNOS), and murine iNOS (miNOS) were included for comparison. Selectivity values are ratios of respective K i values. a The compounds were assayed for in vitro inhibition against purified NOS isoforms: rat nNOS (rnNOS, and human eNOS (heNOS), as well as single mutant (SM) (D597N) and double mutant (DM) (M336V/D597N) of rat nNOS using known literature methods, and K i values were calculated directly from IC 50 values using the Cheng-Prusoff equation. IC 50 values are the average of at least two replicates from 6-9 data points; all experimental standard error values (for the LogIC 50 ) are less than ± 0.10. Selectivity values are ratios of respective K i values. a Off-target binding is classified into four categories: concerning (K i < 100 nM, or < ~2× nNOS K i value), moderate (100-300 nM, or ~2-5× nNOS K i value), weak (>300 nM, or > ~5× nNOS K i value, typically ~1 μM), and insignificant (<50% bound at 10 μM), for a total of 45 receptors as assayed by the PDSP's \"comprehensive screen\" (see ref 28)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "The authors thank the National Institutes of Health (R01 GM049725 and R35 GM131788 to R.B.S.; GM057353 and GM131920 to T.L.P.) for their support of this work. We thank the beamline staff at SSRL and ALS for their assistance during the remote X-ray diffraction data collections. H. L. would like to thank Carla Plaza for her efforts in protein preparations, which provided samples for both the structure determinations and the inhibitory assays. M. A. C. would like to thank Mr. Saman Shafaie and Dr. S. Habibi Goudarzi for assistance with HRMS experiments. This work made use of IMSERC at Northwestern University, which has received support from the Soft and Hybrid Nanotechnology Experimental (SHyNE) Resource (NSF NNCI-1542205), the State of Illinois, and the International Institute for Nanotechnology (IIN)."
            ],
            "subsections": []
        },
        {
            "title": "Supplementary Material",
            "paragraphs": [
                "Refer to Web version on PubMed Central for supplementary material.  b Log D (pH = 7.4) and log P values of the free-base species were predicted using ChemAxon software."
            ],
            "subsections": []
        },
        {
            "title": "Abbreviations Used.",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "NO",
                    "paragraphs": [
                        "c TPSA calculations and BBB permeation was predicted using the free web tool SwissADME.",
                        "d Effective permeability values from literature. 32",
                        "e Effective permeability values obtained in-house.",
                        "f Experimental P e values reported previously by Do et al. 68 Author Manuscript  J Med Chem. Author manuscript; available in PMC 2021 May 14. "
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}