{
    "id": "https://semopenalex.org/work/W2527188593",
    "authors": [
        "Sina Bavari",
        "Stanley N. Cohen",
        "Veronica Soloveva",
        "Luisa W. Cheng",
        "Michael C. Bassik",
        "Amy Li",
        "Mikhail Martchenko",
        "Xiangyang Chi",
        "Robert Manasherob",
        "Andrew D. Haddow",
        "Farooq Nasar",
        "Tara Kenny",
        "Sharon Tran",
        "Dima N. Gharaibeh",
        "Rouzbeh Zamani",
        "Kseniya Polukhina",
        "J. Zozaya",
        "Jeffrey H. Elliott",
        "William Leonardi",
        "Anastasia Levitin",
        "Leeor Zilbermintz"
    ],
    "title": "Bithionol blocks pathogenicity of bacterial toxins, ricin and Zika virus",
    "date": "2016-09-30",
    "abstract": "Diverse pathogenic agents often utilize overlapping host networks, and hub proteins within these networks represent attractive targets for broad-spectrum drugs. Using bacterial toxins, we describe a new approach for discovering broad-spectrum therapies capable of inhibiting host proteins that mediate multiple pathogenic pathways. This approach can be widely used, as it combines genetic-based target identification with cell survival-based and protein function-based multiplex drug screens, and concurrently discovers therapeutic compounds and their protein targets. Using B-lymphoblastoid cells derived from the HapMap Project cohort of persons of African, European, and Asian ancestry we identified host caspases as hub proteins that mediate the lethality of multiple pathogenic agents. We discovered that an approved drug, Bithionol, inhibits host caspases and also reduces the detrimental effects of anthrax lethal toxin, diphtheria toxin, cholera toxin, Pseudomonas aeruginosa exotoxin A, Botulinum neurotoxin, ricin, and Zika virus. Our study reveals the practicality of identifying host proteins that mediate multiple disease pathways and discovering broad-spectrum therapies that target these hub proteins.",
    "sections": [
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Identification Of Host Hub Proteins Exploited By Multiple Pathogenic Toxins",
                    "paragraphs": [
                        "Cytotoxic bacterial and plant toxins have evolved to exploit host proteins and cellular pathways that mediate the entry of those toxins into host cells and to induce cell-death. Although toxins exploit unique host pathways, these pathways are interconnected. While anthrax, diphtheria, and Botulinum toxins reach the cytoplasm from acidified endosomes, cholera, Pseudomonas aeruginosa and ricin toxins are transported into the cytoplasm through the host ER-associated degradation pathway4. These pathways interconnect at host “hub” proteins. Using one of those toxins, Pseudomonas aeruginosa exotoxin A (PE), we set out to identify such hub proteins by i) determining whether known genetic mutations in host proteins exploited by PE affect the sensitivity of host cells to this toxin, and ii) investigating whether these host proteins are also exploited by additional pathogenic agents. The protein hubs will be used as targets in drug screens in order to discover broad-spectrum, host-oriented, anti-pathogenic agent drugs (Fig. 1b)."
                    ],
                    "subsections": []
                },
                {
                    "title": "The Effect Of Caspase Mutations On The Sensitivity Of Human B-Cells To P. Aeruginosa Exotoxin A",
                    "paragraphs": [
                        "It has previously been shown that PE exploits several host proteins for its binding to and entry into host cells5 and initiates programmed cell death by inducing activities of host caspase-3, -6, and -76. We investigated whether known mutations in host proteins exploited by PE associate with altered cytotoxicity of the toxin in cells from tissues that are naturally attacked by this toxin. The availability of human B-cells, which are physiological targets of PE7 through the HapMap Project8 has provided us with an opportunity to test whether mutations in host proteins that constitute the PE pathogenicity pathway affect the cellular sensitivity to this toxin. Our initial tests with cells from a few individuals revealed that their sensitivity to PE varies greatly. Remarkably, our further investigation of PE sensitivity of B-lymphoblastoid cells derived from 234 individuals in geographically and ethnically diverse human populations [87 Yoruba in Ibadan, Nigeria (YRI), 60 Utah residents with ancestry from northern and western Europe (CEU), 43 Japanese in Tokyo, Japan (JPT), and 44 Han Chinese in Beijing, China (CHB)] showed a prominent 200-fold difference in lethality to the toxin (Fig. 2a,b). The range in PE sensitivity, as measured by the dose required to kill 20% of the cells [log(1/LD20)], was similar in all four human cell populations (Fig. 2c). Analysis of toxin sensitivity in parent/children trios indicated that relative sensitivity to PE is a heritable trait (P-value <0.0001) (Fig. 2d).",
                        "The widespread and unimodal distribution observed for log(1/LD20) (Fig. 2b) is likely a result of a polygenic inheritance model, consistent with evidence that multiple host proteins mediate PE lethality56. To learn whether genetic variations in the genes encoding for these proteins account for any of the variation in sensitivity of B-cells to PE seen in Fig. 2a, we tested the association of numerous previously reported mutations with PE sensitivity. Caspase-7 and -3 mutations that were previously reported to associate with cancer and rheumatoid arthritis910111213 demonstrated a significant association with PE sensitivity in the individual HapMap populations (CASP7, rs3814231, CEU, P = 0.01; CASP7, rs2227309, CEU, P = 0.02; CASP3, rs4647601, rs4647693, and rs1049216, East Asian populations CHB and JPT combined, P = 0.04 for each SNP) (Figs 2e and S1). These results show that the activity of caspases affects host cell sensitivity to toxins, and that these proteins are potential therapeutic intervention points and targets for the following drug screens. In addition to PE, ricin and toxins of anthrax, diphtheria, Botulinum, and cholera induce programmed cellular death by activating host caspases614151617181920 (Fig. 3a). Therefore, a drug screen against hub caspases is of great interest, as these proteins are exploited by multiple pathogenic pathways, and caspase inhibitors can act as broad-spectrum drugs."
                    ],
                    "subsections": []
                },
                {
                    "title": "A Multiplexed Cellular Screen For Ccl Drugs That Inhibit Cytotoxic Activities Of Bacterial Toxins Exploiting Unique But Interconnected Host Pathways",
                    "paragraphs": [
                        "In an effort to identify existing drugs that might be repurposed as novel, host-oriented, broad-spectrum therapies, we screened a Clinical Compound Library (CCL)21 through multiplex-based drug screening (Fig. 3b). We searched for compounds capable of both (i) reducing cytotoxicities of diphtheria toxin, cholera toxin, and PE, and (ii) inhibiting proteolytic activities of host caspases-3, -6, and -7 exploited by these toxins in biochemical assays (Fig. 3b–d). In principle, a combination of biochemical and cellular drug screens could provide drug hits that reduce toxins’ cytotoxicities by inhibiting host caspases, and thus, this approach could simultaneously provide drug candidates and their protein targets.",
                        "We screened members of the CCL for the ability to reduce cell death of host RAW264.7 and C32 cells treated with PE, cholera toxin, or diphtheria toxin (Fig. 3c). At the indicated doses, between 30 and 50 percent of RAW264.7 cells undergo cell death within 12 hours for Pseudomonas and cholera toxins. For C32 cells, similar cell death was observed at 24 hours of exposure to diphtheria toxin under the experimental conditions employed. A “hit” in our screen was defined as an event where cells exposed to a drug increased cell survival by at least 20 standard deviations (~1% hit rate) above the survival of control cells treated with either toxin, and is not cytotoxic to cells in the absence of toxins. Events defined as “multiplex hits” interfered with cell killing by at least two toxins. The two multiplex hits that were identified as capable of reducing the cytotoxicities of all three toxins were Bithionol and Pyrogallol (Fig. 3b)."
                    ],
                    "subsections": []
                },
                {
                    "title": "A Multiplex Protein Function-Based Screen For Ccl Drugs That Inhibit Proteolytic Activities Of Host Caspase-3, -6, And -7",
                    "paragraphs": [
                        "In parallel experiments, we screened the CCL for drugs that could inhibit the function of hub caspases-3, -6, and -7 (Fig. 3d) that mediate cytotoxicity caused by bacterial toxins used in our multiplex cellular drug screens (Fig. 3b). Caspase activities were induced in RAW264.7 cells by PE treatment. To screen and identify drugs that inhibit proteolytic activities of caspases we utilized a fluorescence-based FRET assay. Optimized substrate peptides for caspase-3, -6, and -3/7 proteolytic activities were used with a fluorogenic 7-amino-4-methylcoumarin group at the N-terminus and acetyl quenching group at the C-terminus. As a FRET substrate that is uniquely cleaved by caspase-7 hasn’t been identified, and since caspases-3 and -7 are close orthologues, we searched for caspase-7 inhibitors that could block proteolysis of a caspase-3/7 – specific substrate and not caspase-3 – specific substrate. After cleavage by caspase the fluorescence of AMC at 460 nm increases, while inhibitors of caspases prevent it. Compounds that showed greater than 80% (~1% hit rate) inhibition were defined as hits and selected for re-validation and further studies. Events defined as “multiplex hits” interfered with proteolytic activities of at least two caspases. Bithionol was one of the three multiplex hits identified as capable of prominently reducing the proteolysis of all three caspase substrates (Figs 3b and 4a–c). Since Bithionol was identified by both cellular and biochemical multiplex screens (Fig. 3b), we further investigated the efficacy of Bithionol and the breadth of its potential as a host-oriented, anti-pathogenic agent."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bithionol Reduces The Pathogenicity Of A Range Of Toxins By Inhibiting Host Caspases",
                    "paragraphs": [
                        "To investigate the potency of Bithionol, we first performed drug titration curves in host RAW264.7 and C32 cells. We demonstrated that Bithionol was able to reduce diphtheria, cholera, and Pseudomonas toxins-mediated cytotoxicities with an EC50 of 10 μM (Fig. 4d–f). We tested the effect of different concentrations of Bithionol for the ability to inhibit the proteolytic cleavage of substrates specific for cellular caspases-3, 6, and 3/7. We observed a linear dose-dependent caspase-inhibitory efficacy of Bithionol, with an IC50 of 21, 13, and 11 μM for caspases-3, -6, and -3/7, respectively (Fig. 4g). These results are consistent with anti-toxins EC50’s of Bithionol in cellular tests (Fig. 4d–f).",
                        "We also tested whether Bithionol reduces cellular sensitivity to PE in randomly selected PE-sensitive HapMap cells. We observed that the drug protected three cell lines treated with amounts of PE that are sufficient to kill 80% of cells (Fig. 4h). These results confirm the anti-toxin potential of Bithionol in host cells.",
                        "Humans have 10 well-characterized caspases that collectively form a pathway, often referred to as “the caspase cascade”, where caspases-3, -6, and -7 are the executioners of cell death and are activated by other caspases22. We tested the ability of Bithionol to inhibit activities of ten purified recombinant human caspase proteins, and we demonstrated that in addition to caspases-3, -6, and -7, Bithionol inhibited activities of caspases-1 and -9, while having no inhibitory effects on other caspases (Fig. 4i). Together, these results demonstrate that Bithionol is a direct inhibitor of a select subset of caspases, and that it reduces cellular sensitivity to toxins by targeting at least five host caspases."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bithionol Inhibits Cytotoxic Activity Of Anthrax Toxins",
                    "paragraphs": [
                        "Anthrax toxins, the major virulence factors of the Bacillus anthracis bacterium, include an exotoxin protein complex consisting of a protective antigen (PA) and lethal factor (LF) that act collectively to damage host cells. PA binds to cellular receptors, while LF acts as a protease cleaving cytoplasmic MAPKKs23. Three additional host proteases mediate entry and lethality of anthrax toxin: furin, cathepsin-B, and caspase-1142324.",
                        "To test the ability of Bithionol to neutralize cytotoxic activity of anthrax toxin, we examined its effect on cell viability in LF-PA – treated RAW264.7 cells. While 80% of cells used for these assays normally undergo cell death within 6 hours of exposure to anthrax toxin, Bithionol provided substantial protection against LF-PA – mediated cell killing at 33 μM (Fig. 5a).",
                        "Caspase-1 activation, which occurs in LF-PA intoxication, was monitored using a FRET assay. While we observed an induction of caspase-1 activity upon LF-PA treatment in the absence of Bithionol, caspase-1 induction was not detected in Bithionol-treated cells challenged with anthrax toxin (Fig. 5b). This result confirms that Bithionol inhibits anthrax toxin cytotoxicity by at least inhibiting caspase-1 activity.",
                        "We investigated whether additional anthrax toxin pathway proteases are inhibited by Bithionol in live cells. By utilizing MAPKK immunobloting (Fig. 5c), a hybrid toxin FP5925 that enters host cells by utilizing PA, but kills cells by LF-independent mechanism (Fig. 5d,e), and cathepsin-B FRET assay (Fig. 5f), we demonstrated that Bithionol does not inhibit proteolytic activities of cellular LF, furin, and cathepsin-B."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bithionol Inhibits Ricin And Botulinum Neurotoxin A - Induced Death In Vitro And In Vivo",
                    "paragraphs": [
                        "Ricin is another toxin known to induce host caspases-3, -6, and -71520. It reaches the mammalian cytoplasm through the retrograde transport route from the plasma membrane to ER via endosomes and the Golgi apparatus (Fig. 3a). Once in the cytoplasm, ricin inhibits cellular protein synthesis by cleaving a glycosidic bond within the large rRNA of the 60S subunit of eukaryotic ribosomes4. We tested the ability of Bithionol to reduce ricin - mediated cellular killing and observed that the drug was able to reduce toxin-mediated cytotoxicity with an EC50 of 10 μM (Fig. 6a).",
                        "Botulinum neurotoxin serotype A (BoNT/A) is a protease that translocates into the host cytoplasm from acidic endosomes, where it cleaves the synaptosome-associated protein, SNAP-25, and inhibits neurotransmitter release among neurons, leading to muscular paralysis26. BoNT/A has been reported to cause cellular caspases-3 and -7 - dependent apoptosis16.",
                        "After oral administration, Bithionol crosses the intestinal epithelium and is absorbed into the bloodstream in humans and many animals27. We evaluated the efficacy of Bithionol as a therapeutic agent during BoNT/A intoxication in Swiss Webster mice. Animals were given a lethal oral dose of BoNT/A complex in the presence and absence of Bithionol. Ninety percent of animals that received a lethal dose of BoNT/A without Bithionol died within 3 days of intoxication (Fig. 6b). All mice that were challenged with BoNT/A and treated with Bithionol at 6.0 mg/kg, survived without displaying toxin-associated symptoms, such as wasp waist and paralysis (Fig. 6b).",
                        "Since BoNT/A acts as a protease, we investigated whether Bithionol directly inhibits the proteolytic activity of BoNT/A by utilizing a FRET assay. An optimized SNAP-25 peptide with a fluorogenic FITC group at the N-terminus and DABCYL quenching group at the C-terminus was used as the substrate28. After cleavage by BoNT/A the fluorescence of FITC at 523 nm increases. We determined that Bithionol did not affect the proteolysis rate of the fluorescent substrate (Fig. 6c). This result shows that Bithionol protects mice by inhibiting host targets, rather than by inhibiting the toxin itself."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bithionol Acts As A Zika Virus Inhibitor",
                    "paragraphs": [
                        "In addition to pathogenic toxins, viruses are also known to propagate by activating host caspases and inducing programmed cell death29. Similarly to toxins, Zika virus (ZIKV) has been reported to lead to cell-death by inducing host caspase-3 and neuronal apoptosis during its propagation3031. Moreover, caspases have previously been reported to cleave various viral proteins, affect viral protein localization, promote viral genome replication and viral assembly, and have been reported to be necessary for viral replication and propagation3233.",
                        "Upon observing that Bithionol protects cells from caspase-inducing toxins, we hypothesized that Bithionol might also be able to inhibit the pathogenicity of the Zika virus. The strains utilized in this study were chosen to gauge the ability of Bithionol to inhibit Zika virus strains found within both ZIKV lineages. Both strains utilized in this study had low passage histories and had intact glycosylation sites. Furthermore, both strains were geographically and genetically divergent. Puerto Rico Zika strain, PRVABC59, is closely related to virus strains circulating in the New World including those strains isolated in Brazil and Guatemala. The African ZIKV lineage is ancestral to the Asian lineage; as such Senegal strain, DAK AR D 41525, was selected as it is a low passage strain that is mycoplasma free. We tested Bithionol’s ability to inhibit Senegal and Puerto Rico isolates of ZIKV in infected Vero E6 cells and human astrocytes. To detect infected cells, immuno-staining was performed using anti-Flavi-virus envelope protein antibodies. Bithionol inhibited the abundance of Puerto Rico ZIKV in Vero E6 cells with an EC50 of 6.7 μM as well as Senegal ZIKV in Vero E6 and human astrocytes with EC50’s of 5.5 and 6.3 μM respectively (Fig. 6d and Table S1). These data indicate that Bithionol is effective in inhibiting ZIKV in host cells."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "In order to discover the inhibitors of pathway hubs that mediate the lethality of multiple bacterial toxins, we identified host caspases as hubs and focused the discovery process on therapies that are able to inhibit caspases and reduce toxins’ cytotoxicities. Collectively, utilization of both cellular- and biochemical-based multiplex drug screens provided us with i) a drug hit (Bithionol), ii) a drug-target (caspases), and iii) an assessment of breadth of spectra of the drug. This disease-network-based approach utilizing two diverse multiplex drug screenings, which we term “Disparate Dual Multiplexing”, could significantly shorten the time needed for drug-discovery followed by target-identification steps in a historically lengthy process. In the future, additional types of drug screens could be included in disparate multiplex-based drug screens, such as genetic-based, and immunology-based screens, thus expanding our approach to Disparate Triple, Disparate Quadruple (etc.) Multiplex drug screening.",
                "Bithionol was previously approved to treat helminthes, and although the exact target within these species is not known, it is believed that the drug inhibits oxidative phosphorylation of parasites34. Our study has uncovered five additional Bithionol targets: caspases-1, -3, -6, -7, and -9, which by definition makes Bithionol a polypharmacological drug. Polypharmacological phenomena include a single drug acting on multiple targets of either a unique or multiple disease pathways. Just like in the current study, many of the polypharmacological approaches aim to discover the unknown off targets for existing drugs, and this approach is called “drug repurposing”335. Therefore, this raises the possibility that Bithionol targets additional non-caspase host proteins exploited by toxins. To our knowledge, no other drugs used in humans have been reported to inhibit caspases. In the future, Bithionol can be investigated for its efficacy to treat other non-infectious human diseases caused by detrimental activities of caspases, such as neurodegenerative diseases and inflammatory bowel disease.",
                "Bithionol was replaced by the more effective anti-helminthic, Praziquantel34. Moreover, Bithionol was used as a bacteriostatic additive in cosmetic products, but was discontinued in 1967 due to photosensitizing effects27. Presently, Bithionol is still used to treat helminthic cases in some Asian and European countries and is included as an active ingredient in Fonergine®, used to treat mouth and throat disorders in Argentina36. The current drug discovery and development process can take many years for the successful introduction of a new drug into the market. Thus, the current de novo drug discovery and development paradigm is ineffective for dealing with rapidly emerging biological threat agents. Under such circumstances, drug repurposing may offer numerous advantages. Since Bithionol already has a well-established safety and pharmacokinetic profiles in patients and animals, as well as bulk manufacturing methods27, the drug could rapidly be made available for a new indication if a biological emergency was to occur. Most notably, it has been shown that after oral administration of 50 mg/kg of Bithionol in humans, the drug reaches serum concentrations that range from 225 to 480 μM27, which is on average 30 times higher than the EC50 achieved by our cellular tests (Figs 4, 5, and 6). This suggests that it is possible to achieve effective anti-toxin and anti-Zika Bithionol doses in blood by oral administration. In addition, Bithionol was i) used to treat cerebral paragonimiasis37 and is known to cross the brain-blood barrier38; ii) reported to cross the placental barrier39; and iii) was used to treat paragonimiasis in a population that included children and pregnant women40. All of these observations suggest that Bithionol is likely to achieve anti-Zika efficacy in humans."
            ],
            "subsections": []
        },
        {
            "title": "Experimental Procedures",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Chemicals And Reagents",
                    "paragraphs": [
                        "All bacterial toxins were purchased from List Biological Laboratories (Campbell, CA). FP59 was a gift from Stephen Leppla (NIAID). Ricin was purchased from Vector Laboratories. Clinical Compound Library (CCL) drug library was purchased from Johns Hopkins University Bloomberg School of Public Health. Bithionol was repurchased from Sigma-Aldrich."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell Culture And Cell Lines",
                    "paragraphs": [
                        "RAW264.7 mouse macrophage and human C32 melanoma cells (ATCC CRL-1585) were maintained in DMEM (Sigma-Aldrich). Human B-lymphocytes were grown in IMDM (Invitrogen). Human K562 chronic myelogenous leukemia cells (ATCC CCL-243) were grown in RPMI 1640 Medium (Invitrogen). Vero E6 (ATCC CRL-1586) were maintained in MEM (Corning). Primary human Astrocytes (NHA-Astrocytes-AGM, Lonza, #CC-2565) were cultured in Astrocyte Basal Medium (Clonetics ABM, Lonza) supplemented with AGM SingleQuot Kit Supplement and Growth factors (CC-4123). All media were supplemented with FBS, penicillin, and streptomycin."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human B-Lymphocytes Sensitivity To Pseudomonas Toxin-Mediated Lethality",
                    "paragraphs": [
                        "Human B lymphocytes were treated with serial dilutions of P. aeruginosa exotoxin A for 48 hours. The viability of B cells was determined by Alamar Blue (AbD Serotec, BioRad) fluorescence, as described by the manufacturer. Each data point shown in Fig. 2a represents the average and SD of results from three wells. Cell viability is shown as the percentage of survivors obtained relative to cells in the absence of the toxin (100% survival). LD20 was calculated for each cell line. Statistical analysis and graphical presentation were performed using GraphPad Prism software. A P value <0.05 was considered statistically significant. Homozygous medians were compared by an unpaired t test. CHB and JPT, two East Asian populations, were pooled in order to obtain a more accurate estimate of effect size in the larger combined population. Because linear regression is sensitive to outliers, we removed one outlier in CHB, as the log sensitivity of this cell line couldn’t be determined within the toxin range tested."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cellular Drug Screens",
                    "paragraphs": [
                        "RAW264.7 cells (10,000 per well) were seeded in 96-well plates 24 hours before the assay. Cells were treated with compounds for 1 hour, and then challenged with either 2 μg/ml PE or 4 μg/ml cholera toxin for 12 hours. As rodent cells are insensitive to diphtheria toxin, C32 cells were treated with 2 μg/ml of diphtheria toxins for 24 hours. Determination of RAW264.7 and C32 viability was performed by MTT assay. Cell viability is defined as the percentage of surviving cells obtained relative to cells treated with DMSO (100% survival)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Caspases Fret Drug Tests",
                    "paragraphs": [
                        "Caspases were induced in RAW264.7 by treating cells with 2 μg/ml of PE for 4 hours. Caspases were extracted and their activity was measured using Caspase Assay Kit (Sigma-Aldrich) with or without drugs.",
                        "The FRET reaction was performed in 96 well plates, and each reaction contained 16 μM substrate peptides (Peptides International) conjugated with a 7-amino-4-methylcoumarin group at the N-terminus and acetyl group at the C-terminus. The amino acid sequences of substrates were: DNLD for caspase-3, DQTD for caspases-3 and -7, and VEID for caspase-6. CCL compounds were tested at the final concentration of 33 μM, as pilot testing indicated that CCL screen at 16 μM would not yield a sufficient number of multiplex hits. Reactions were initiated by adding caspase – containing lysate to a final concentration of 6 μg/ml. Kinetic measurements were obtained at 37 °C every 5 minutes for 2 hours using a fluorescent plate reader. Excitation and emission wavelengths were 360 nm and 460 nm, respectively, with a cutoff wavelength of 365 nm. Rates of reactions were quantified by the Microsoft Excel LINEST function. A BioVision kit was used to test Bithionol’s ability to inhibit FRET reactions of purified recombinant human caspases-1 through 10. One unit of caspase was used in a single FRET reaction."
                    ],
                    "subsections": []
                },
                {
                    "title": "Toxins Treatments And Cell Viability Assays",
                    "paragraphs": [
                        "Cells (10,000 per well) were seeded in 96-well plates 24 hours before the assay. Cells were treated with Bithionol for 1 hour. RAW264.7 cells were challenged with anthrax toxins that include LF or FP59 and PA83 or PA63 (for 6 hours), PE (for 12 hours), or cholera toxin (for 12 hours) at 0.5, 2, and 4 μg/ml respectively. C32 cells were treated with 2 μg/ml of diphtheria toxin for 24 hours. Determination of cells viability was performed by MTT assay. B-lymphocytes cells were seeded in a 96-well plates at 10,000 cells/well 1 hour before toxin treatment, treated with Bithionol for 1 hour, and then challenged with 8 μg/ml PE for 6 hours. Determination of lymphocyte viability was determined by Alamar Blue (AbD Serotec, BioRad) fluorescence, as described by the manufacturer. Each data point shown for MTT and Alamar Blue assays indicates the mean ± SD value obtained in triplicate assays done in a representative experiment. At least three such experiments were carried out."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mapkk2 Cleavage Assay",
                    "paragraphs": [
                        "N-terminal MAPKK2, anti-tubulin, and anti-PA antibodies were purchased from Santa Cruz Biotechnology. RAW264.7 cells were pre-treated with 33 μM of Bithionol for 1 hour. Following pre-treatment, the cells were exposed to 0.5 μg/ml of PA and LF at 37 °C for up to three hours in the presence of 33 μM of Bithionol. The cells were then washed with cold PBS five times and lysed with RIPA buffer containing a protease inhibitor mixture (Santa Cruz Biotechnology, Inc.). Cell lysates were quantified using the BCA protein quantification kit (Pierce) and loaded onto 4–12% denaturing gels (Criterion XT Precast Gel, Bio-Rad). After electrophoresis for several hours, the gel was transferred overnight to nitrocellulose membranes; membranes were probed with anti-MAPKK2 or anti tubulin antibodies. Quantitative Western blot analyses of the bands were accomplished using the Odyssey infrared imaging system (LI-COR Biosciences)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cellular Cathepsin B And Caspase-1 Activity Assays",
                    "paragraphs": [
                        "Cathepsin B and caspase-1 activities in total cell lysates were determined using an InnoZyme cathepsin B activity assay kit (EMD Millipore) and caspase activity assay kit (BioVision), performed according to the manufacturers’ instructions. Cellular cathepsin B or caspase-1 activities with and without Bithionol were tested by pre-treating cells with 33 μM of Bithionol for 1 hour, followed by lysing cells and testing protease activities with fluorescently labeled specific substrates. Caspase-1 activities were induced by 1 hour pretreatment of cells with 0.5 μg/ml of LF + PA, and was compared to cells un-induced by the toxin. Fluorescence intensities indicating cathepsin B or caspase-1 activities were measured (Molecular Devices, Spectra Max 384 PLUS)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Ricin Treatment And Cell Viability Assay",
                    "paragraphs": [
                        "K562 cells were seeded at a density of 2 × 105 cells/well in 24-well plates. Cells were pre-treated with Bithionol for 2 hours and 0.4 ng/ml ricin was added to the treated wells. Following the 24-hour ricin treatment, the percent of viable cells (within the live gate by FSC/SSC) was measured by flow cytometry using a BD Accuri C6 Flow Cytometer. Experiment was performed in duplicate for each condition."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mice Intoxication Studies",
                    "paragraphs": [
                        "10 Swiss Webster (CFW) mice (6 weeks old) were treated with 0.125 mg/mouse Bithionol in the presence or absence of BoNT/A complex (3 μg/mouse, Metabiologics, Madison WI) in phosphate gelatin buffer (0.028 M sodium phosphate pH 7.0, 0.2% gelatin) by oral gavage. Animals were observed over a period of 7 days. Methods were carried out in accordance with approved guidelines. All experiments were performed in accordance with relevant guidelines and regulations. All animal experiments have been approved by the Western Regional Research Center IACUC. Euthanasia protocols follow recommendations established by the American Medical Veterinary Association Guideline for Euthanasia to minimize animal pain and suffering."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bont/A Light Chain Fret Assay",
                    "paragraphs": [
                        "The reaction volume was 250 μl per well in 96 wells plate, containing 50 mM HEPES pH 7.4 containing 0.05% TWEEN 20, 5 μM SNAPtide (BoNT/A substrate peptide) conjugated with DABCYL and FITC (List Biological Laboratories, Inc), and 33 μM of Bithionol. Reactions were initiated by adding BoNT/A light chain to a final concentration of 5 nM. Kinetic measurements were obtained at 37 °C every 1 min for 50 min using a fluorescent plate reader. Excitation and emission wavelengths were 490 nm and 523 nm, respectively, with a cutoff wavelength of 495 nm. At least three such FRET experiments were carried out."
                    ],
                    "subsections": []
                },
                {
                    "title": "Zika Virus High Content Imaging Infections Assay",
                    "paragraphs": [
                        "We utilized strains from both ZIKV lineages (African and Asian) to assess the potential for Bithionol to inhibit viral abundance. ZIKV strain DAK AR D 41525 was originally isolated from a pool of Aedes africanus mosquitoes in Senegal in 1984 (passage history: AP61#1, C6/36#1, Vero 3) and strain PRVABC59 was originally isolated from human sera in Puerto Rico in 2015 (passage history: Vero 6). Cells were pre-treated with Bithionol for 2 hours prior to infection. Vero E6 cells were exposed to ZIKV at an MOI of 0.5; astrocytes were infected with ZIKV at an MOI of 15. Infection was terminated after 48 hours by fixing samples in formalin solution. For visualization of Zika infection cells were treated for 1 hour with anti-Flavi-virus envelop protein monoclonal antibody 4G2, followed by anti-mouse IgG conjugated with Dylight488 (Thermo). Cells were stained with Hoechst (Life Technologies) for nuclei staining and with Cell Mask Red (Life technologies) for cytoplasm staining. Nuclei were stained with Draq5 (Biostatus) diluted in PBS buffer. Images were acquired on the Opera imaging plate reader (Perkin Elmer) and analyzed using Harmony and Acapella PE software. A detailed protocol is described in the supplemental file."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Additional Information",
            "paragraphs": [
                "How to cite this article: Leonardi, W. et al. Bithionol blocks pathogenicity of bacterial toxins, ricin, and Zika virus. Sci. Rep. 6, 34475; doi: 10.1038/srep34475 (2016)."
            ],
            "subsections": []
        }
    ]
}