{
    "id": "US20230386602",
    "authors": [
        "Shuang Zhao",
        "Hamza Bakhtiar"
    ],
    "title": "METHODS OF GENERATING PHENOCOPY SIGNATURES AND USES THEREOF",
    "date": "2023-05-31 00:00:00",
    "abstract": "Methods of generating phenocopy signatures and uses thereof. The methods of generating phenocopy signatures can include determining gene expression signatures that predict the presence of mutations in training cells. Uses of the phenocopy signatures include identifying cells exhibiting the phenocopy signatures, identifying subjects comprising cells that exhibit the phenocopy signatures, methods of using the phenocopy signatures to predict cells sensitive to treatment with drugs, methods of treating cells with phenocopy signatures predicted to be sensitive to treatment with drugs, methods of using phenocopy signatures to predict subjects sensitive to treatment with drugs, and methods of treating subjects with phenocopy signatures predicted to be sensitive to treatment with drugs.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The invention is directed to methods of generating phenocopy signatures and uses thereof, including identifying cells exhibiting phenocopy signatures, identifying subjects comprising cells that exhibit phenocopy signatures, methods of using phenocopy signatures to predict cells sensitive to treatment with drugs, methods of treating cells with phenocopy signatures predicted to be sensitive to treatment with drugs, methods of using phenocopy signatures to predict subjects sensitive to treatment with drugs, and methods of treating subjects with phenocopy signatures predicted to be sensitive to treatment with drugs."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define invention scope"
                    ],
                    "num_characters": 619,
                    "outline_medium": [
                        "define invention scope"
                    ],
                    "outline_short": [
                        "define invention scope"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "DNA mutations in specific genes can confer preferential benefit from drugs targeting those genes. However, other molecular perturbations can “phenocopy” pathogenic mutations, but would not be identified using standard clinical sequencing, leading to missed opportunities for other patients to benefit from targeted treatments.",
                        "Methods for determining phenocopy signatures of mutations in genes that are useful for predicting efficacy of targeted drugs regardless of mutation status are needed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate phenocopy signatures"
                    ],
                    "num_characters": 494,
                    "outline_medium": [
                        "motivate phenocopy signatures"
                    ],
                    "outline_short": [
                        "motivate phenocopy signatures"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "One aspect of the invention is directed to methods of generating phenocopy signatures. The methods can comprise identifying a gene set comprising one or more genes within a biological pathway, identifying a set of training cells, wherein each training cell comprises each of the one or more genes in the gene set, obtaining a nucleic acid sequence for each of the one or more genes in each training cell, identifying a mutation set comprising one or more mutations within the nucleic acid sequences, obtaining a gene expression profile for each training cell, and determining from the mutation set and the gene expression profiles a set of gene expression signatures that predict presence of the one or more mutations within the training cells. The phenocopy signature thereby comprises the set of gene expression signatures.",
                        "Another aspect of the invention is directed to methods of identifying cells exhibiting a phenocopy signature. The methods can comprise obtaining a gene expression profile for a test cell and determining whether the gene expression profile for the test cell matches the phenocopy signature. The test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature.",
                        "Another aspect of the invention is directed to methods of predicting cells sensitive to treatment with drugs that target a biological pathway and, optionally, treating the cell. The methods can comprise obtaining a gene expression profile for a test cell, and determining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets. The cell is predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature. The methods can further comprise administering the drug to the cell if the cell is predicted to be sensitive to treatment with the drug.",
                        "Another aspect of the invention is directed to methods of identifying a subject comprising cells that exhibit the phenocopy signature. The methods can comprise isolating a test cell from the subject, obtaining a gene expression profile for the test cell, and determining whether the gene expression profile for the test cell matches the phenocopy signature, wherein the test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature.",
                        "Another aspect of the invention is directed to methods of predicting subjects sensitive to treatment with drugs that target a biological pathway and, optionally, treating the subject with the drug. The methods can comprise obtaining a gene expression profile for a test cell isolated from the subject and determining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets. The subject is predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature. The subject can then be administered the drug to the subject if the subject is predicted to be sensitive to treatment with the drug.",
                        "The objects and advantages of the invention will appear more fully from the following detailed description of the preferred embodiment of the invention made in conjunction with the accompanying drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "generate phenocopy signatures",
                        "identify cells with phenocopy signatures",
                        "predict cells sensitive to treatment",
                        "treat cells with phenocopy signatures",
                        "identify subjects with phenocopy signatures",
                        "predict subjects sensitive to treatment"
                    ],
                    "num_characters": 3426,
                    "outline_medium": [
                        "generate phenocopy signatures",
                        "identify cells with phenocopy signatures",
                        "predict and treat cells and subjects"
                    ],
                    "outline_short": [
                        "outline methods of generating phenocopy signatures"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "One aspect of the invention is directed to methods of generating a phenocopy signature.",
                        "The methods of generating a phenocopy signature can comprise identifying a gene set comprising one or more genes within a biological pathway.",
                        "As used herein, “biological pathway” refers to any network of interactions and reactions among molecules in a cell that leads to a certain product or a change in a cell, tissue, or organism. Biological pathways can result in the assembly of molecules, such as lipids or proteins, cause changes in tissues, turn genes on or off, transmit a signal, or induce any other change in a cell, tissue, or organism. The molecules participating in a biological pathway are sometimes referred to in the art as “entities.” The molecules (or entities) can include nucleic acids (e.g., DNA, including subparts thereof such as genes or other genetic elements; RNA, including RNA genes, mRNA, microRNA etc.), proteins (e.g., signaling proteins, enzymes, structural proteins, etc.), small molecules, carbohydrates (e.g., monosaccharides, oligosaccharides, polysaccharides, lipids (e.g., cholesterol, fatty acids, fatty acid esters, etc.), and polymers (e.g., collagen, etc.), or any other molecule participating in a biological reaction. Exemplary types of pathways include cell cycle pathways, DNA repair pathways, metabolism pathways, signaling pathways (e.g., signal transduction by a receptor (e.g., a growth factor receptor) and second messengers), transcriptional regulation pathways, transport pathways (e.g., of transmembrane transporters), cell motility pathways, immune function pathways, cell death pathways, host-virus interaction pathways, cellular stress-response pathways, developmental pathways, senescence pathways, angiogenesis pathways, epithelial-to-mesenchymal transition pathways, and neural pathways, among others.",
                        "Methods for identifying specific pathways and their constituent molecules (including genes), interactions, and reactions are well known in the art. A large number of types of biological pathways and particular biological pathways, including their constituent molecules (including genes), interactions, and reactions, are annotated in public databases. A database employed in following examples is the Reactome database. See reactome.org and Fabregat et al. 2018 (Fabregat A, Jupe S, Matthews L, Sidiropoulos K, Gillespie M, Garapati P, Haw R, Jassal B, Korninger F, May B, Milacic M, Roca C D, Rothfels K, Sevilla C, Shamovsky V, Shorser S, Varusai T, Viteri G, Weiser J, Wu G, Stein L, Hermjakob H, D'Eustachio P. The Reactome Pathway Knowledgebase. Nucleic Acids Res. 2018 Jan. 4; 46(D1):D649-D655). Reactome is an open-source, open access, manually curated and peer-reviewed biological pathway database. It provides tools for the visualization, interpretation, and analysis of biological pathways. All data and software in the database are freely available for download. Interaction, reaction, and pathway data are provided as downloadable flat, Neo4j GraphDB, MySQL, BioPAX, SBML and PSI-MITAB files and are also accessible through Reactome's web services application programming interfaces. Software and instructions for local installation of the Reactome database, website, and data entry tools are also available to support independent pathway curation. Other databases include KEGG (www.kegg.jp) (Kanehisa M, Goto S. KEGG: kyoto encyclopedia of genes and genomes. Nucleic Acids Res. 2000 Jan. 1; 28(1):27-30), WikiPathways (www.wikipathways.org) (Pico A R, Kelder T, van Iersel M P, Hanspers K, Conklin B R, Evelo C. WikiPathways: pathway editing for the people. PLoS Biol. 2008 Jul. 22; 6(7):e184), NCI-Nature Pathway Interaction Database (www.ndexbio.org) (Schaefer C F, Anthony K, Krupa S, Buchoff J, Day M, Hannay T, Buetow K H. PID: the Pathway Interaction Database. Nucleic Acids Res. 2009 Jan;37(Database issue):D674-9), PhosphoSitePlus (www.phosphosite.org) (Hornbeck P V, Zhang B, Murray B, Kornhauser J M, Latham V, Skrzypek E. PhosphoSitePlus, 2014: mutations, PTMs and recalibrations. Nucleic Acids Res. 2015 Jan;43(Database issue):D512-20), BioCyc (biocyc.org) (Caspi R, Altman T, Dreher K, Fulcher C A, Subhraveti P, Keseler I M, Kothari A, Krummenacker M, Latendresse M, Mueller L A, Ong Q, Paley S, Pujar A, Shearer A G, Travers M, Weerasinghe D, Zhang P, Karp P D. The MetaCyc database of metabolic pathways and enzymes and the BioCyc collection of pathway/genome databases. Nucleic Acids Res. 2012 Jan;40(Database issue):D742-53), PANTHER (Protein ANalysis THrough Evolutionary Relationships) (pantherdb.org) (Thomas P D, Kejariwal A, Campbell M J, Mi H, Diemer K, Guo N, Ladunga I, Ulitsky-Lazareva B, Muruganujan A, Rabkin S, Vandergriff J A, Doremieux O. PANTHER: a browsable database of gene products organized by biological function, using curated protein family and subfamily classification. Nucleic Acids Res. 2003 Jan. 1; 31(1):334-41), TRANSFAC (TRANScription FACtor database) (gene-regulation.com) (Wingender E. The TRANSFAC project as an example of framework technology that supports the analysis of genomic regulation. Brief Bioinform. 2008 Jul;9(4):326-32), DrugBank (www.drugbank.com) (Wishart D S, Knox C, Guo A C, et al. DrugBank: a comprehensive resource for in silico drug discovery and exploration. Nucleic Acids Res. 2006;34(Database issue):D668-D672), esyN (www.esyn.org/) (Bean D M, Heimbach J, Ficorella L, Micklem G, Oliver S G, Favrin G. esyN: network building, sharing and publishing. PLoS One. 2014 Sep. 2; 9(9):e106035), Comparative Toxicogenomics Database (CTD) (ctdbase.org) (Mattingly C J, Rosenstein M C, Colby G T, Forrest J N Jr, Boyer J L. The Comparative Toxicogenomics Database (CTD): a resource for comparative toxicological studies. J Exp Zool A Comp Exp Biol. 2006 Sep. 1; 305(9):689-92), and Pathway Commons (www.pathwaycommons.org/) (Cerami E G, Gross B E, Demir E, Rodchenkov I, Babur O, Anwar N, Schultz N, Bader G D, Sander C. Pathway Commons, a web resource for biological pathway data. Nucleic Acids Res. 2011 Jan;39(Database issue):D685-90), among others.",
                        "In some versions, the biological pathway is a disease pathway. A disease pathway is a biological pathway whose activity produces, causes, or contributes to a disease or any symptom thereof. Exemplary disease pathways include signal transduction pathways by growth factor receptors and second messengers, mitotic cell cycle pathways, cellular stress-response pathways, programmed cell death pathways, DNA repair pathways, transmembrane transporter pathways, metabolism pathways, infectious disease pathways, immune system pathways, neuronal system pathways, developmental biology pathways, and hemostasis pathways, among others. Exemplary diseases resulting from disease pathways include cancer, such as colorectal cancer, pancreatic cancer, hepatocellular carcinoma, gastric cancer, glioma, thyroid cancer, acute myeloid leukemia, chronic myeloid leukemia, basal cell carcinoma, melanoma, renal cell carcinoma, bladder cancer, prostate cancer, endometrial cancer, breast cancer, small cell lung cancer, and non-small cell lung cancer, among others. Exemplary diseases resulting from disease pathways include immune disease, such as asthma, systemic lupus erythematosus, rheumatoid arthritis, autoimmune thyroid disease, inflammatory bowel disease, allograft rejection, graft-versus-host disease, and primary immunodeficiency. Exemplary diseases resulting from disease pathways include neurodegenerative disease, such as Alzheimer's disease, Parkinson's disease, amyotrophic lateral sclerosis, Huntington's disease, spinocerebellar ataxia, prion disease, and neurodegeneration diseases, among others. Exemplary diseases resulting from disease pathways include substance dependence, such as cocaine addiction, amphetamine addiction, morphine addiction, nicotine addiction, and alcoholism, among others. Exemplary diseases resulting from disease pathways include cardiovascular disease, such as hyperlipidemia, atherosclerosis, hypertrophic cardiomyopathy, arrhythmogenic right ventricular cardiomyopathy, dilated cardiomyopathy, diabetic cardiomyopathy, and viral myocarditis, among others. Exemplary diseases resulting from disease pathways include endocrine and metabolic diseases, such as type II diabetes mellitus, type I diabetes mellitus, maturity onset diabetes of the young, alcoholic liver disease, non-alcoholic fatty liver disease, insulin resistance, and Cushing syndrome, among others. Exemplary diseases resulting from disease pathways include antimicrobial drug resistance, including beta-lactam resistance, vancomycin resistance, and cationic antimicrobial peptide (CAMP) resistance, among others. Exemplary diseases resulting from disease pathways include antineoplastic drug resistance, including EGFR tyrosine kinase inhibitor resistance, platinum drug resistance, antifolate resistance, and endocrine resistance, among others. In some versions, the disease pathway is a cancer pathway. A cancer pathway is a disease pathway whose atypical activity produces cancer. Various disease pathways, including cancer pathways, are described in the biological pathway databases described herein. Constituent genes (and corresponding proteins and other molecules in the pathway), interactions, and reactions in disease pathways can be determined using methods known in the art and/or the biological pathway databases described herein.",
                        "The one or more genes within the identified gene set can include any number of genes. In various versions of the invention, the one or more genes can be fewer than 50, fewer than 40, fewer than 30, fewer than 20, fewer than 15, fewer than 10, fewer than 9, fewer than 8, fewer than 7, fewer than 6, fewer than 5 fewer than 4, fewer than 3, fewer than 2, or exactly 1.",
                        "In preferred versions of the invention, the one or more genes within the identified gene set comprises at least one key driver gene of a disease. “Key driver gene” is used in this context to refer to a gene whose normal or abnormal functions produce, cause, or contribute to a disease or any symptom thereof. In some versions, a key driver gene is a gene that, when mutated, produces, causes, or contributes to a disease or any symptom thereof.",
                        "In some versions of the invention, the one or more genes within the identified gene set comprises at least one gene for which there is at least one allele within the population comprising a mutation that is a disease biomarker. In some versions, the disease biomarker is a US Food and Drug Administration (FDA)-qualified disease biomarker. “Disease biomarker” used with reference to a mutation refers to a mutation that indicates a given disease or an increased likelihood of developing the given disease.",
                        "In some versions of the invention, the one or more genes within the identified gene set comprises at least one gene for which there is at least one allele within the population comprising a mutation that is a disease treatment biomarker. In some versions, the disease treatment biomarker is a US Food and Drug Administration (FDA)-qualified disease treatment biomarker. “Disease treatment biomarker” used with reference to a mutation refers to a mutation that indicates treatability of a particular disease with a particular drug.",
                        "In some versions of the invention, the one or more genes within the identified gene set are comprised by a disease pathway of a disease that is treatable with a drug. “Treatable with a drug” as used herein refers to the ability of the drug to provide any degree of amelioration of the disease or symptom of the disease in at least a subset of individuals who have the disease. “Disease of a disease pathway,” refers herein to a disease associated with, affected by, resulting from, caused by, or enhanced by a particular disease pathway. “Drug” as used herein refers to any active agent that can induce a physiological change in a cell, tissue, or organism.",
                        "The methods of generating a phenocopy signature can comprise identifying a set of training cells. Each training cell preferably comprises the biological pathway(s) in which the one or more genes in the gene set is or are comprised. Each training cell preferably comprises each of the one or more genes in the gene set. The number of training cells in the gene set can include any number of individual cells, types of cells, or samples of cells.",
                        "The training cells in the set can comprise pathological cells, healthy cells, or a combination thereof. In some versions, at least one or more of the training cells comprises a pathological cell. In some versions, each of the training cells is a pathological cell. “Pathological cell” refers to a cell that has at least one structural or functional abnormality with regard to a healthy cell. Distinctions between pathological cells and healthy cells are well-known in the art of pathology. Any pathological cell can be a “physiological pathological cell,” which is a pathological cell obtained or derived from an organism, or a “model pathological cell”, which is a model cell that models a pathological cell obtained or derived from an organism. One or more of the pathological cells comprised by the training cells can be a pathological cell of a particular disease. “Pathological cell of a disease,” and variants thereof, refers herein to a cell associated with, resulting from, causing, or contributing to a particular disease. Exemplary training cells provided herein include cancer cells. However, pathological cells from any other type of disease can be employed.",
                        "The methods of generating a phenocopy signature can comprise obtaining a nucleic acid sequence for at least one, some, or each of the one or more genes in each training cell. The nucleic acid sequence can include the entire gene sequence or any one or more sub-portions thereof, such as exons, introns, and/or mutational “hotspots,” etc. Obtaining the nucleic acid sequence can comprise sequencing at least a portion of one or more the genes, downloading such sequences from a database, or other methods. Sequencing the genes can comprise sequencing the gene (or sub-portion thereof), sequencing mRNA from the gene (or sub-portion thereof) and deducing the gene sequence from the mRNA sequence, or other methods.",
                        "The methods of generating a phenocopy signature can comprise identifying a mutation set comprising one or more mutations within the nucleic acid sequences. In some versions, the mutations can be determined with respect to a germline sequences of an individual subject. The individual subject can be a subject from which one or more training cells are obtained or derived. In some versions, particularly when germline sequences of an individual subject are not available, the mutations can be determined with respect to a reference genome. The mutations can include any perturbation in the genome, including copy number variants, structural variants, gene fusions, point mutations, insertions, deletions, substitutions, or any other difference between a given nucleic acid sequence and a reference sequence. The mutations can comprise non-coding mutations, coding mutations, or a combination thereof. In exemplary versions of the invention, the mutations in the mutation set consist of coding mutations. The mutations can comprise pathogenic mutations, non-pathogenic mutations, or a combination thereof. “Pathogenic mutations” are mutations that are known or predicted to be pathogenic, i.e., increase an individual's susceptibility or predisposition to a certain disease or disorder. Pathogenic mutations can be predicted with a number of computational tools and methods, such as ClinVar (www.ncbi.nlm.nih.gov/clinvar/) (Sethi A, Tully R, Villamarin-Salomon R, Rubinstein W, Maglott D R. ClinVar: public archive of interpretations of clinically relevant variants. Nucleic Acids Res. 2016 Jan. 4; 44(D1):D862-8), SIFT (sift.bii.a-star.edu.sg) (Vaser R, Adusumalli S, Leng S N, Sikic M, Ng P C. SIFT missense predictions for genomes. Nat Protoc. 2016 Jan;11(1):1-9), Polyphen-2 HVAR (genetics.bwh.harvard.edu/pph2) (Adzhubei I, Jordan D M, Sunyaev S R. Predicting functional effect of human missense mutations using PolyPhen-2. Curr Protoc Hum Genet. 2013 Jan;Chapter 7:Unit7.20), Polyphen-2 HDIV (genetics.bwh.harvard.edu/pph2) (Adzhubei I, Jordan D M, Sunyaev S R. Predicting functional effect of human missense mutations using PolyPhen-2. Curr Protoc Hum Genet. 2013 Jan;Chapter 7:Unit7.20), and FATHMM (fathmm.biocompute.org.uk) (Rogers M F, Shihab H A, Mort M, Cooper D N, Gaunt T R, Campbell C. FATHMM-XF: accurate prediction of pathogenic point mutations via extended features. Bioinformatics. 2018 Feb. 1; 34(3):511-513). In exemplary versions of the invention, the mutations in the mutation set consist of pathogenic mutations. In some versions of the invention, the mutations in the mutation set are all the pathogenic coding mutations within the nucleic acid sequences. In some versions of the invention, at least one of the one or more mutations in the mutation set is a pathogenic mutation not known to be pathogenic, i.e., it is merely predicted to be pathogenic. In some versions of the invention, at least one of the one or more mutations in the mutation set is not a known disease biomarker or a known disease treatment biomarker.",
                        "The methods of generating a phenocopy signature can comprise obtaining a gene expression profile for at least one, some, or each training cell. As used herein, “gene expression profile” refers to a quantitation of the mRNA levels of different mRNA species present in a cell. “mRNA species” refers to a type of mRNA in a population of mRNA having at least one difference with respect to at least one other type of mRNA in the population of mRNA. In some versions, the mRNA species are defined by having different sequences with respect to each other. In some versions, the mRNA species are defined by virtue of corresponding to (e.g., being expressed from) different genes, which can be determined, for example, by the mRNA comprising a sequence that corresponds to a particular gene sequence. In preferred versions, the gene expression profile for any cell described herein comprises a quantitation of the mRNA levels of each mRNA species present in the cell. Obtaining the gene expression profiles can comprise measuring the mRNA levels (e.g., measuring the number of mRNA copies) of different mRNA species present in the cells and/or, depending on the availability of data for a particular training cell, downloading the gene expression profiles from a database, among other methods. The mRNA levels can include raw numbers of measured mRNA copies or can include normalized and/or analytically processed values. Methods for measuring the mRNA levels of different mRNA species present in cells are well known in the art, and include RNA-seq, among other methods. See Stark et al. 2019 (Stark R, Grzelak M, Hadfield J. RNA sequencing: the teenage years. Nat Rev Genet. 2019 Nov; 20(11):631-656).",
                        "The methods of generating a phenocopy signature can comprise determining from the mutation set and the gene expression profiles a set of gene expression signatures that predict the presence of at least a subset of the one or more mutations within the training cells. “Gene expression signature” as used herein refers to a particular combination of mRNA levels or ranges of mRNA levels for at least a subset of the mRNA species quantitated in the gene expression profiles. The set of such gene expression signatures can include any number of individual gene expression signatures. The subset of the one or more mutations within the training cells predicted by the set of gene expression signatures can be any proportion of the one or mutations in the set. In various versions, the subset of the one or more mutations within the training cells predicted by the set of gene expression signatures comprises at least 5%, at least at least 10%, at least 15%, at least 20%, at least 25%, at least 30%, at least 35%, at least 40%, at least 45%, at least 50%, at least 55%, at least 60%, at least 65%, at least 70%, at least 75%, at least 80%, at least 85%, at least 90%, at least 95%, at least 99%, or 100% (by number) of the one or mutations in the set. (“Subset” in this context can encompass the entire set or any proportion thereof.) In various versions, the subset of the one or more mutations within the training cells predicted by the set of gene expression signatures comprises fewer than 50%, fewer than 55%, fewer than 60%, fewer than 65%, fewer than 70%, fewer than 75%, fewer than 80%, fewer than 85%, fewer than 90%, fewer than 95%, fewer than 100% (by number) of the one or more mutations in the set. Each mRNA level in the gene expression signatures can independently be a discrete value or a range of values. In some versions, each mRNA level in the gene expression signatures is a discrete value. The gene expression signatures that predict the presence of the one or more mutations can be determined using any of a variety of approaches. In exemplary versions of the invention, a gradient tree boosting approach is used to train phenocopy signatures that predict mutation status based on the RNA expression in the gene expression profiles. Any other machine learning technique used in regression and/or classification tasks can alternatively be used. Examples include support vector machine, random forest, elastic net regression (elastic net regularization), linear regression, k-nearest neighbor, ridge regression, lasso regression, neural networks, and Bayesian networks, among others.",
                        "In some versions of the invention, determining the phenocopy signature does not comprise incorporating empirical drug-response data for at least one of the training cells. In some versions of the invention, determining the phenocopy signature does not comprise incorporating empirical drug-response data for some of the training cells. In some versions of the invention, determining the phenocopy signature does not comprise incorporating empirical drug-response data for any of the training cells. In other words, the phenocopy signature is determined independently of any drug-response data for the training cells.",
                        "Another aspect of the invention is directed to methods of identifying cells exhibiting a phenocopy signature.",
                        "The methods of identifying cells exhibiting a phenocopy signature can comprise obtaining a gene expression profile for the test cell. Obtaining the gene expression profiles can comprise measuring mRNA levels of different mRNA species present in the test cell and/or, depending on the availability of data for a particular test cell, downloading the gene expression profiles from a database, among other methods. The test cell can be derived from any source, as described elsewhere herein.",
                        "The methods of identifying cells exhibiting a phenocopy signature can comprise determining whether the gene expression profile for the test cell matches the phenocopy signature. The test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature. “Matching,” as used herein with respect to a gene expression profile matching a phenocopy signature, refers to the gene expression profile having a combination of mRNA levels that reside within defined ranges encompassing a particular combination of mRNA levels in at least one gene expression signature of the phenocopy signature. The defined ranges can be determined in any manner suitable for a particular purpose and can be informed by statistical or algorithmic analysis and confidence thresholds for that purpose. Defined ranges in the following examples are determined by a XGBoost model. Any other type of machine learning algorithm can be used to determine suitable ranges.",
                        "The methods of the invention are capable of identifying test cells exhibiting a phenocopy signature, even if the test cells themselves do not comprise any of the mutations used to generate the phenocopy signature, or any other known mutations. Accordingly, in some versions, the test cell comprises each of the one or more genes in the gene set and none of the one or more genes in the gene set of the test cell comprises any of the one or more mutations in the mutation set used to generate the phenocopy signature. In some versions, the test cell comprises each of the one or more genes in the gene set and none of the one or more genes in the gene set of the test cell comprises any mutation that is pathogenic or predicted to be pathogenic. In some versions, the test cell comprises each of the one or more genes in the gene set and none of the one or more genes in the gene set of the test cell comprises any coding mutation. In some versions, the test cell comprises each of the one or more genes in the gene set and none of the one or more genes in the gene set of the test cell comprises any mutation.",
                        "Another aspect of the invention is directed to methods of identifying a subject comprising cells that exhibit the phenocopy signature. The methods can comprise isolating a test cell from the subject, obtaining a gene expression profile for the test cell, and determining whether the gene expression profile for the test cell matches the phenocopy signature. The test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature. The subject can be any organism, such as plants, animals, microbial colonies, etc. As used herein, “organism” encompasses any collection of interacting cells, including microbial colonies, microbiomes, etc. Exemplary animals include mammals, such as humans. The test cell can include any type of cell isolated from a subject. The test cell can be taken from any part of the subject's body or any tissue from the subject's body. Exemplary tissues include connective tissue, epithelial tissue, muscle tissue, and nervous tissue. Exemplary connective tissues include fat tissue. Exemplary epithelial tissues include the lining of the gastrointestinal tract and other hollow organs and skin. Exemplary muscle tissues include cardiac muscle tissue, smooth muscle tissue, and skeletal muscle tissue. Exemplary nervous tissues include brain tissue, spinal cord tissue, and nerve tissue. Exemplary test cells include stem cells, bone cells (e.g., osteoclasts, osteoblasts, osteocytes), blood cells (e.g., red blood cells, white blood cells, platelets), muscle cells (e.g., skeletal muscle cells, cardiac muscle cells, smooth muscle cells), fat cells, skin cells, nerve cells, endothelial cells, sex cells (e.g., sperm, ova), pancreatic cells (e.g., beta cells, alpha cells), and cancer cells, among others. In some versions, the test cell comprises a healthy cell. In some versions, the test cell comprises a pathological cell.",
                        "As above, in some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any of the one or more mutations in the mutation set used to generate the phenocopy signature. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any mutation that is pathogenic or predicted to be pathogenic. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any coding mutation. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any mutation.",
                        "Another aspect of the invention is directed to methods of predicting a subject sensitive to treatment with a drug that targets a biological pathway. In some versions, the methods comprise obtaining a gene expression profile for a test cell isolated from the subject and determining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from a biological pathway that the drug targets. The subject can be predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature. The biological pathway can comprise any biological pathway, including any biological pathway described herein.",
                        "A drug is considered herein to target a particular biological pathway if treatment of a cell (which comprises treating a tissue, organ, or organism comprising the cell) with the drug affects (e.g., inhibits, enhances, etc.) the operation of the biological pathway. A drug targeting a particular biological pathway can do so directly or indirectly. Drugs that target the particular biological pathway directly interact (e.g., bind) at least one entity in the biological pathway. Drugs that target a particular biological pathway indirectly do not directly interact (e.g., bind) any entities in the biological pathway, and instead produces an effect in the cell that affects the biological pathway, in some cases nonspecifically (e.g, chemotherapy). Accordingly, in some versions, a drug targeting a particular biological pathway binds to at least one entity in the biological pathway. In some versions, a drug targeting a particular biological pathway binds to a gene or protein in the biological pathway. In some versions, a drug targeting a particular biological pathway does not bind to any entities in the biological pathway. Methods for identifying drugs that target particular biological pathways are known in the art. See, e.g., Füzi et al. 2021 (Füzi B, Gurinova J, Hermjakob H, Ecker G F, Sheriff R. Path4Drug: Data Science Workflow for Identification of Tissue-Specific Biological Pathways Modulated by Toxic Drugs. Front Pharmacol. 2021 Oct. 14; 12:708296) and Pham et al. 2020 (Pham M, Wilson S, Govindarajan H, Lin C H, Lichtarge O. Discovery of disease- and drug-specific pathways through community structures of a literature network. Bioinformatics. 2020 Mar. 1; 36(6):1881-1888).",
                        "In some versions of the invention, the employed phenocopy signature is not determined by incorporating empirical data for the response of any training cells to the drug. As outlined in the following examples, the invention is capable of predicting response to drugs that target the biological pathway used to generate the phenocopy signature even if the phenocopy signature is generated without response data for drugs targeting the pathway.",
                        "As in the embodiments outlined, above, in some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any of the one or more mutations in the mutation set. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any mutation that is pathogenic or predicted to be pathogenic. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any coding mutation. In some versions, the test cell comprises each of the one or more genes in the gene set, and none of the one or more genes in the gene set of the test cell comprises any mutation.",
                        "As in the embodiments outlined above, obtaining the gene expression profiles can comprise measuring the mRNA levels of different mRNA species present in the test cell and/or, depending on the availability of data for a particular test cell, downloading the gene expression profiles from a database, among other methods.",
                        "The test cell can be obtained from any body part, fluid, tissue, or organ of the subject comprising cells. The test cell preferably comprises the gene set used to generate the phenocopy signature. The test cell preferably comprises the biological pathway used to generate the phenocopy signature. In some versions, the methods comprise isolating the test cell from the subject.",
                        "In some versions, the biological pathway is a disease pathway, and the subject has a disease of the disease pathway. In some versions, the subject has a disease, and the test cell is pathological cell of the disease. In some versions, the biological pathway is a disease pathway, the subject has a disease of the disease pathway, and the test cell is pathological cell of the disease.",
                        "Some versions of the invention further comprising administering the drug to the subject if the subject is predicted to be sensitive to treatment with the drug. If the subject has a disease, such as a disease of the disease pathway, the drug is preferably administered in an amount effective to treat the disease. “Treat” and “treating” as used herein refers to any degree of amelioration of a disease or symptom thereof, including partial or complete remission.",
                        "The methods of the invention are capable of predicting subjects sensitive to treatment with a drug that targets a biological pathway by determining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets, without testing for mutations in the gene set or any other gene in the biological pathway. However, in some versions, predicting subjects sensitive to treatment with the drug can optionally further comprise obtaining a nucleic acid sequence of one or more genes in the biological pathway in the test cell and determining if the one or more genes comprises a mutation. The one or more genes in the test cell can be one or more of the genes in the gene set used to generate the phenocopy signature, or any other gene in the biological pathway.",
                        "Another aspect of the invention is directed to methods of predicting cells sensitive to treatment with drugs that target a biological pathway and, optionally, treating the cell. The methods can comprise obtaining a gene expression profile for a test cell, and determining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets. The cell is predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature. The methods can further comprise administering the drug to the cell if the subject is predicted to be sensitive to treatment with the drug. Aspects outlined above regarding any elements or steps included in the present embodiment can be incorporated in the present embodiment.",
                        "The elements and method steps described herein can be used in any combination whether explicitly described or not.",
                        "All combinations of method steps as used herein can be performed in any order, unless otherwise specified or clearly implied to the contrary by the context in which the referenced combination is made.",
                        "As used herein, the singular forms “a,” “an,” and “the” include plural referents unless the content clearly dictates otherwise.",
                        "Numerical ranges as used herein are intended to include every number and subset of numbers contained within that range, whether specifically disclosed or not. Further, these numerical ranges should be construed as providing support for a claim directed to any number or subset of numbers in that range. For example, a disclosure of from 1 to 10 should be construed as supporting a range of from 2 to 8, from 3 to 7, from 5 to 6, from 1 to 9, from 3.6 to 4.6, from 3.5 to 9.9, and so forth.",
                        "All patents, patent publications, and peer-reviewed publications (i.e., “references”) cited herein are expressly incorporated by reference to the same extent as if each individual reference were specifically and individually indicated as being incorporated by reference. In case of conflict between the present disclosure and the incorporated references, the present disclosure controls.",
                        "It is understood that the invention is not confined to the particular construction and arrangement of parts herein illustrated and described, but embraces such modified forms thereof as come within the scope of the claims."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Summary**",
                                "DNA mutations in specific genes can confer preferential benefit from drugs targeting those genes. However, other molecular perturbations can “phenocopy” pathogenic mutations, but would not be identified using standard clinical sequencing, leading to missed opportunities for other patients to benefit from targeted treatments. We hypothesized that RNA phenocopy signatures of key cancer driver gene mutations could improve the ability to predict response to targeted therapies, despite not being directly trained on drug response. To test this, we built gene expression signatures in tissue samples for specific mutations and found that phenocopy signatures broadly increased accuracy of drug response predictions in-vitro compared to DNA mutation alone, and identified additional cancer cell lines that respond well with a positive/negative predictive value on par or better than DNA mutations. We further validated our results across four clinical cohorts. Our results show that routine RNA sequencing of tumors to identify phenocopies in addition to standard targeted DNA sequencing would improve the ability to accurately select patients for targeted therapies in the clinic.",
                                "**INTRODUCTION**",
                                "Over the last decade, targeted therapies against a large range of oncogenic pathways have emerged as valuable additions to our anti-cancer armamentarium. These drugs tend to have a more favorable toxicity profile compared to cytotoxic chemotherapies1,2 and dozens of new therapies enter the market every year. Targeted therapies have demonstrated particular success in patients harboring specific driver mutations, usually in their respective targets3,4. The FDA has approved EGFR inhibitors in EGFR-mutant NSCLC5-7, BRAF inhibitors in both BRAF-mutant melanoma8,9 and NSCLC10, PI3K inhibitors in PIK3CA-mutant breast cancer11, and PARP inhibitors in Homologous Recombination Deficient (HRD) ovarian12 and prostate13 cancer.",
                                "For many of the genes with FDA approved biomarker indications, there are frequently known hotspot mutations, such as the V600 mutations in BRAF14. While the presence of these driver mutations tend to be informative for identifying patients for targeted therapies, there are often mutations of unknown significance which fall elsewhere in the gene that may or may not convey sensitivity15. Thus, the response in patients who harbor these mutations is not uniform, and many patients fail to respond even though they carry the driver mutation of interest16-20. Additionally, others lacking a mutation may still show benefit from treatment. The reasons for the variability in response are multi-factorial. First, not all mutations alter the function of the protein and different mutations can have wildly different phenotypic impacts depending on the location and amino acid change. Second, regulation via epigenetic, post-transcriptional, and post-translational changes can modulate the impact of mutations and lead to incomplete penetrance of the expected phenotype. Finally, there may be other modes of activation for a particular oncogenic pathway upstream, downstream, or even in a different pathway independent of mutations in the target itself.",
                                "The activation of many oncogenic pathways leads to distinct transcriptomic changes. However, to date, work assessing gene expression patterns mimicking DNA alterations has been limited in scope to specific targets or cancer types. We hypothesized that gene expression signatures that identify phenocopies of alterations in key DNA alterations would improve predictions of response and resistance to targeted therapies. For example, these signatures could identify additional tumors which are a phenocopy of an EGFR-mutant tumor that would respond to anti-EGFR therapy, without necessarily carrying an EGFR mutation. Likewise, these phenocopy signatures could also identify tumors with an EGFR mutation of unknown significance that do not display the EGFR-mutant phenocopy, and do not respond to anti-EGFR therapy.",
                                "Herein, we develop phenocopy signatures of mutations in key cancer genes on 9248 patient samples across cancer types and validate in 1982 cell line experiments across three datasets that these signatures improve our ability to predict response to targeted therapies compared to DNA mutations alone. We also demonstrate that these phenocopy signatures predict response in clinical cohorts, and shift under the selective pressure of treatment. Unlike the previous literature in this area21-33, we do not directly train models to predict drug response. Instead, the association of drug response to our phenocopy signatures arise as an indirect but intended side effect.",
                                "**Methods**",
                                "We trained our phenocopy signatures on DNA alterations in the clinical TCGA dataset, which has minimal treatment response information. This is possible because we are not directly training on drug response, and our indirect approach has an added benefit in allowing us to save all cell line and clinical datasets with drug response for validation without having to worry about information leakage. Previous approaches directly training on cell line drug response face challenges in identifying suitable validation cohorts, as many of the cell lines overlap between different cell line datasets and clinical validation cohorts are rare.",
                                "**DNA Mutation Annotation**",
                                "DNA mutations were annotated with Annovar49. Only protein sequence-altering mutations were included. Silent, splicing, intronic, upstream, and downstream mutations were excluded from our analysis. To identify mutations with stronger evidence for being pathogenic, ClinVar and various computational tools (SIFT, Polyphen-2 HVAR, Polyphen-2 HDIV, and FATHMM) were used. A sample was considered to have a pathogenic mutation if predicted by any of the computational tools or marked as pathogenic or likely pathogenic by ClinVar. A total of eight oncogenic signaling pathways with targeted drugs and mutations in the key driver genes were assessed (EGFR, BRAF, PI3K-AKT, PARP/HRD, ERBB2, mTOR, JAK, and MAPK). EGFR mutations were assessed for the EGFR pathway. BRAF mutations were assessed for the BRAF pathway. PIK3CA, AKT1, and AKT2 mutations were assessed for the PIK3-AKT pathway. BRCA1/2 and PARP1/2 mutations were assessed for the PARP/HRD pathway. ERBB2 mutations were assessed for the ERBB2 pathway. MTOR mutations were assessed for the MTOR pathway. JAK1/2/3 mutations were assessed for the JAK pathway. MAPK11, MAPK12, MAPK13, MAPK14, MAPK3, MAPK1, MKNK1, MKNK2, MAP2K1, MAP2K2, MAPK8, MAPK9, and MAPK10 were assessed for the MAPK pathway. While amplifications and deletions are also important, we chose not to include these for training due to the lack of consistent thresholds for determining when a copy number change influences function, as well as the significant effects of tumor purity on copy number in the clinical samples.",
                                "**Phenocopy Signature Training**",
                                "Prior to training the phenocopy signature, we filtered each dataset to only include genes within the pathway of interest as determined by the Reactome 5° database of gene pathways (Table 1). For each gene pathway, we removed cancer types with an alteration rate below 5% from our TCGA training dataset. We then used a gradient tree boosting approach to train phenocopy signatures which predicted mutation status (true or false) based on RNA expression. Gradient tree boosting is an ensemble learning method where decision trees are constructed to minimize a differentiable loss function. This is done through a gradient descent algorithm where trees are iteratively fit to the direction of steepest descent of the loss function. We trained our signature on the TCGA dataset using the R XGboost package (version 1.4.0.1). XGboost offers a GPU-based implementation of gradient tree boosting that leverages a histogram algorithm to find candidate splits. We applied this approach with a hinge loss function and used 10-fold cross validation to tune the depth and number of trees, with model accuracy assessed using Receiver Operator Curve (ROC) Area Under the Curve (AUC). A total of eight phenocopy signatures were trained, one for each oncogenic signaling pathway, and were locked prior to independent validation.",
                                "**Independent Validation of the Phenocopy Signatures in GDSC, CCLE, and DepMap**",
                                "Each of the eight oncogenic pathways were tested in the GDSC, CCLE, and DepMap cohorts. Response for drugs specifically targeting each pathway was assessed per pathway as above. Mutations were assessed as above. The phenocopy signatures were applied without modification to the GDSC/CCLE/DepMap datasets and resulted in predicted mutation status to identify phenocopies. GDSC, CCLE, and DepMap sets were validated independently. As all three study cancer cell lines and anti-cancer drugs, there is overlap. However, as the experiments were done at different times with different techniques, we chose to investigate them as independent datasets.",
                                "**Statistical Approach**",
                                "To compare whether the phenocopy signatures improved the ability to predict response to targeted therapies, we created linear models with the actual drug response (Z-score for the IC-50 for GDSC, the ActArea for CCLE, AUC for DepMap) as the dependent variable, and the actual and predicted mutation status as the independent variables. For the CCLE, IC-50 was not utilized due to 55% of all IC-50 values being the maximum tested concentration of 8 μM, therefore activity area (ActArea) was used, where a higher ActArea corresponds to increased sensitivity23. For DepMap, 69% of IC-50 values were reported as NA, thus AUC was used as a measure of drug response. While using the same drug response metrics across datasets would have been ideal, diverse measures can provide complementary information even with the same cell lines/drugs and ensure our results are independent of the dataset. Model fit was determined using the ordinary least squares approach. Coefficients from the model indicate how strongly the actual and predicted alteration statuses contribute to drug response. We also performed a likelihood-ratio test using the chi-square statistic (χ2) to compare a single parameter model (mutation status alone) and a two parameter (mutation status and the phenocopy signature) model in order to assess if the phenocopy signature was significantly adding to DNA mutations alone in predicting drug response. Because the models are nested, the degrees of freedom equal the difference in the number of free parameters in the two models. Thus, the two parameter model is a significant improvement over the single parameter model if the observed χ2 statistic >4.5 corresponding to a Benjamini-Hochberg FDR multiple testing corrected p-value cutoff of 0.05.",
                                "**Sensitivity and Specificity of the Phenocopy Signature in Predicting Drug Response**",
                                "We next assessed the sensitivity and specificity of the phenocopy signatures. Because drug response was a continuous variable in our cell line datasets, we stratified “responders” and “non-responders” based on the top quartile vs. the bottom three quartiles51. To better understand the performance in the context of DNA mutations, we considered three subgroups: 1) cell lines without mutations, 2) cell lines with mutations that were not predicted to be pathogenic (e.g. unknown clinical significance) and 3) cell lines with mutations predicted to be pathogenic. We then compared this to the sensitivity and specificity of mutations alone, or pathogenic mutations alone.",
                                "**Data Availability**",
                                "Processed DNA and RNA sequencing data from the Cancer Genome Atlas (TCGA) were downloaded using the UCSC Xena browser (xena.ucsc.edu). Processed DNA and RNA sequencing data and drug response data for the Genomic of Drug Sensitivity in Cancer (GDSC)46 were downloaded from the GDSC website (www.cancerrxgene.org). Processed DNA and RNA sequencing data and drug response data for the Cancer Cell Line Encyclopedia (CCLE)23 were downloaded from the CCLE website (portals.broadinstitute.org/ccle). The Cancer Dependency Map (DepMap)2 shares the same cell lines and therefore DNA and RNA sequencing data as the CCLE, but independently tests treatment response, and these were obtained from the DepMap website (depmap.org). As recommended by DepMap, the MTS010 dataset was used for drug response data. Datasets were then filtered to only include the genes present in all three datasets. To allow comparability between groups, gene expression was normalized as previously described52. Gene expression was treated as a continuous variable throughout the examples. DNA mutation calls for TCGA, CCLE (including DepMap), and GDSC, were used as described in each dataset. Clinical datasets42-45 were downloaded from the Gene Expression Omnibus (www.ncbi.nlm.nih.gov/geo) with the following accession numbers: GSE50509, GSE65185, GSE99898, and GSE99898.",
                                "**Results**",
                                "**Model Design**",
                                "We first sought to define expression-based “phenocopy” signatures for various DNA mutations in therapeutically actionable pathways in cancer (FIG. 1). We designed the phenocopy signatures to identify RNA expression patterns from the “average” mutated tumor. To build these phenocopy signatures, we utilized publicly available data from the TCGA, which contains mutation status and RNA expression data for over 11000 tumor samples across 33 different tumor types. For each actionable gene, an XGBoost model was trained using gene expression profiles of pan-cancer tumor samples paired with the known DNA alteration status. Each model was then trained to define a gene expression signature for eight different targetable pathways (EGFR, BRAF, PI3K-AKT, PARP/HRD, ERBB2, mTOR, JAK, and MAPK). To assess if the phenocopy signatures could predict drug response, independent data from the GDSC, CCLE and DepMap datasets were used which contain gene expression, DNA mutations, and drug responses across 969, 917, and 578 cancer cell lines, respectively. Additionally, we analyzed four clinical studies which have gene expression and treatment data for patients treated with a drug targeting one of the pathways listed above.",
                                "**Phenocopy Signature Predictions.**",
                                "After assigning a predicted alteration status to each cell line in the testing set with the XGBoost-driven model as described above, we investigated how many cell lines in our validation cohorts were marked as altered by the phenocopy signature alone, the DNA mutation status alone, or by both. DNA alterations were additionally split into mutations which have a known or predicted deleterious or pathogenic effect and those with unknown significance (FIG. 2). Our goal was not to create signatures that would perfectly predict cell lines' alteration status, as this would not offer additional insights. Instead, we created our phenocopy signatures so they would identify cell lines that phenotypically mimicked gene expression patterns of altered cell lines, whether or not they carried a canonical driver mutation. For all the pathways, we found discordance between actual DNA mutation status and phenocopy predictions, which suggests that there is additional information from the phenocopy signatures that may help inform drug response predictions.",
                                "**Phenocopy Signatures Improve Pan-Cancer Drug Response Predictions Across Multiple Pathways**",
                                "Next, we assessed how the gene-expression based phenocopy signatures performed in adding predictive information on targeted therapy drug response compared to DNA alterations alone. To assess if the discordance between actual DNA mutation status and the phenocopy signature predictions improves predictions of drug response, we chose to assess eight different pathways: four of which have clinically actionable mutations in various cancer types (BRAF8-10, BRCA13,34,35, EGFR5-7, and PIK3CA11) and four of which are targets of ongoing research, but do not yet have FDA-approved indications (MAPK36,37, ERBB238,39, mTOR40, and JAK41). We next tested if the phenocopy signatures improved the ability to predict drug response for drugs targeting these pathways. To accomplish this, we examined linear models of drug response to treatment targeting each pathway in the independent GDSC, CCLE, and DepMap cohorts, with both the true DNA alteration status and the phenocopy signatures as independent variables. To assess significance, a multiple-testing FDR-corrected chi-squared statistic was calculated for each drug/gene combination to determine if the addition of the phenocopy signature to DNA alterations alone improved the ability to predict drug response. Overall, model performance was significantly improved in 68% of cases across 165 different therapies targeting these eight pathways (FIG. 3). For 61% of drugs targeting EGFR, 75% of drugs targeting BRAF, 80% of drugs targeting PI3K-AKT, 50% of drugs targeting PARP/HRD, 64% of drugs targeting MAPK, 90% of drugs targeting ERBB2, 53% of drugs targeting mTOR, and 50% of drugs targeting JAK, the phenocopy signatures significantly added to DNA mutations alone.",
                                "We next sought to further examine the individual pathways and drugs in more detail. Volcano plots of the contributions of the phenocopy signatures, DNA mutations, and pathogenic mutations in the linear models redemonstrated how the phenocopy signatures added to DNA mutations for drugs targeting pathways with and without mutations as FDA indications (FIGS. 4A-4H). Of note, negative coefficients represent expected estimates, where the actual mutation status or predicted mutation status from the phenocopy signature is associated with increased sensitivity to the drug. BRAF pathogenic mutations in particular successfully predicted response to BRAF inhibitors even after taking into account the phenocopy signatures, though the phenocopy signatures still demonstrated independent predictive signal. However, for the other pathways, phenocopy signatures generally out-performed DNA mutations (pathogenic or otherwise) in predicting response to targeted drugs across multiple agents and gene targets. These results are particularly impressive given that the phenocopy signatures were not directly trained to predict drug response, and instead appear to do so simply by virtue of their biological imperative, which is to identify phenocopies of DNA alterations.",
                                "**Sensitivity, Specificity, PPV, and NPV of Phenocopy Signatures**",
                                "Sensitivity, specificity, positive predictive value (PPV), and negative predictive value (NPV) are commonly used to evaluate clinical biomarkers. In our cell line models, we defined responders as the top quartile. Across all the drugs and pathways tested, 28% of cell lines with a mutation were classified as responders. When limited to pathogenic mutations, this percentage was similar at 26%. In cell lines without a mutation but were predicted to be a phenocopy, a slightly higher 31% were classified as responders, though the sensitivity in individual pathways was frequently higher. The sensitivity of the phenocopy signatures in mutation-negative cancer cell lines was on par with DNA alterations for EGFR, BRAF, and MAPK, and better than DNA alterations for PI3K-AKT, PARP/HRD, ERBB2, MTOR, and JAK. Oncogenic activation of ERBB2 (encoding HER2) in particular is thought to be heavily influenced by amplification, and our results suggest that a mutational phenocopy signature may provide complementary information. The specificity of the phenocopy signatures was high across pathways in identifying responders in cell lines without DNA mutations (FIGS. 5A-5H). The PPVs in cell lines without mutations are almost all improved compared to the results observed with DNA mutations, with the exception of BRAF in which the DNA mutations perform particularly well (FIGS. 6A-6H). As with specificity, the NPVs are high for the phenocopy signatures across groups. These results confirm that the phenocopy signatures are successfully finding additional responders without DNA mutations with high specificity. While the sensitivity is not as high as the specificity, it is still comparable or better than DNA mutations alone.",
                                "**Clinical Validation**",
                                "In addition to assessing our model in cell line datasets, we next sought to assess the efficacy of predicting drug response from a phenocopy signature in clinical data. We were able to identify several publicly available clinical cohorts that had treatment response and/or pre/post treatment resistance information for treatments specifically targeting the pathways of our phenocopy signatures. We first examined the BRAF pathway and identified three BRAF-mutant melanoma cohorts with gene expression data (GEO IDs: GSE50509, GSE65185, GSE99898) that were all treated with anti-BRAF therapies (dabrafenib, vemurafenib, trametinib)42-44. In all three cohorts, pre-treatment (sensitive) and post-treatment (resistant) samples were obtained from the same patients. Because the three cohorts were quite small, and similar in nature, we combined the results of all three. Our normalization approach and phenocopy signatures were applied without modification to each of the three cohorts. Overall, the majority (77.8%) of the pre-treatment (treatment-sensitive) samples were predicted to be BRAF mutation phenocopies, consistent with the fact that all the tumors were known to have BRAF mutations. However, this rate decreased to 64.3% in the post-treatment (treatment-resistant), with a borderline p-value of 0.0806 (FIG. 7, (A)). This is consistent with our in-vitro data that the BRAF phenocopy signature predicts response to BRAF inhibitors, as the resistant tumors had a lower rate of phenocopies.",
                                "We next identified a cohort of breast cancer patients (GSE119262) that were treated with neoadjuvant everolimus (which targets the mTOR pathway) followed by surgery45. In this cohort, both treatment response information and pre-treatment (sensitive) vs. post-treatment (resistant) samples were available. We first examined just the pre-treatment samples. While only a small number were predicted as mTOR mutation phenocopies, 100% of these responded to anti-mTOR therapy compared to 75.8% of the non-mTOR phenocopy tumors (FIG. 7, (B)). When we further examined our phenocopy signature in pre-treatment and post-treatment samples, again none of the non-responder tumors (pre- or post-treatment) were predicted as phenocopies. In the responder tumors, there was a decrease in the rate of phenocopy tumors from 14.3% pre-treatment (sensitive) to 4.17% post-treatment (resistant; FIG. 7, (C)). This is consistent with our in-vitro data which demonstrates that a phenocopy signature predicts response to mTOR inhibitors, as the post-treatment resistant tumors had a lower rate of phenocopies.",
                                "**Phenocopy Signatures in the TP53 Pathway**",
                                "TP53 is the “guardian of the genome”, and one of the most commonly altered gene in cancer. Missense mutations tend to be the predominate type of alteration. We have been developing phenocopy signatures for DNA alterations in the TP53 pathway. Our preliminary data suggest that the phenocopy signature is associated with sensitivity/resistance to cytotoxic chemotherapies across a wide range of cancer types."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "hypothesize RNA phenocopy signatures of key cancer driver gene mutations",
                                "introduce concept of phenocopy signatures",
                                "motivate need for phenocopy signatures",
                                "introduce targeted therapies",
                                "describe success of targeted therapies",
                                "describe limitations of DNA mutations in predicting response",
                                "introduce concept of RNA phenocopy signatures",
                                "describe goal of RNA phenocopy signatures",
                                "introduce methods",
                                "describe DNA mutation annotation",
                                "describe filtering of datasets",
                                "describe training of phenocopy signatures",
                                "describe gradient tree boosting approach",
                                "describe XGboost package",
                                "describe model accuracy assessment",
                                "describe independent validation of phenocopy signatures",
                                "describe statistical approach",
                                "describe linear models",
                                "describe model fit determination",
                                "describe likelihood-ratio test",
                                "describe sensitivity and specificity assessment",
                                "describe stratification of responders and non-responders",
                                "describe data availability",
                                "describe data sources",
                                "describe data filtering",
                                "describe gene expression normalization",
                                "introduce results",
                                "describe model design",
                                "describe phenocopy signature predictions",
                                "describe discordance between DNA mutation status and phenocopy predictions",
                                "describe improvement of drug response predictions",
                                "describe linear models of drug response",
                                "describe significance assessment",
                                "describe volcano plots",
                                "describe contributions of phenocopy signatures and DNA mutations",
                                "describe sensitivity, specificity, PPV, and NPV of phenocopy signatures",
                                "describe responder classification",
                                "describe sensitivity and specificity of phenocopy signatures",
                                "describe PPV and NPV of phenocopy signatures",
                                "introduce clinical validation",
                                "describe BRAF pathway clinical validation",
                                "describe mTOR pathway clinical validation",
                                "describe application of phenocopy signatures to clinical cohorts",
                                "describe results of clinical validation",
                                "describe TP53 pathway phenocopy signatures",
                                "describe preliminary results of TP53 pathway phenocopy signatures"
                            ],
                            "num_characters": 23151,
                            "outline_medium": [
                                "hypothesize RNA phenocopy signatures of key cancer driver gene mutations",
                                "introduce targeted therapies against oncogenic pathways",
                                "motivate limitations of DNA mutations in predicting response to targeted therapies",
                                "describe transcriptomic changes associated with oncogenic pathway activation",
                                "introduce phenocopy signatures as a solution to improve predictions of response to targeted therapies",
                                "describe the training of phenocopy signatures on DNA alterations in the TCGA dataset",
                                "filter genes within the pathway of interest using the Reactome database",
                                "apply gradient tree boosting approach to train phenocopy signatures",
                                "describe the independent validation of phenocopy signatures in GDSC, CCLE, and DepMap",
                                "assess response for drugs specifically targeting each pathway",
                                "create linear models to compare phenocopy signatures and DNA mutations in predicting drug response",
                                "perform likelihood-ratio test to assess significance of phenocopy signatures",
                                "assess sensitivity and specificity of phenocopy signatures in predicting drug response",
                                "stratify responders and non-responders based on top quartile vs. bottom three quartiles",
                                "consider three subgroups: cell lines without mutations, with unknown significance mutations, and with pathogenic mutations",
                                "describe data availability and processing",
                                "introduce model design and phenocopy signature predictions",
                                "investigate discordance between actual DNA mutation status and phenocopy predictions",
                                "assess if phenocopy signatures improve pan-cancer drug response predictions across multiple pathways",
                                "examine linear models of drug response to treatment targeting each pathway",
                                "calculate multiple-testing FDR-corrected chi-squared statistic for each drug/gene combination",
                                "evaluate sensitivity, specificity, PPV, and NPV of phenocopy signatures",
                                "clinically validate phenocopy signatures in BRAF and mTOR pathways"
                            ],
                            "outline_short": [
                                "motivate RNA phenocopy signatures",
                                "introduce targeted therapies",
                                "describe limitations of DNA mutations",
                                "hypothesize RNA phenocopy signatures",
                                "describe methods for training phenocopy signatures",
                                "annotate DNA mutations",
                                "train phenocopy signatures",
                                "validate phenocopy signatures in GDSC, CCLE, and DepMap",
                                "describe statistical approach",
                                "assess sensitivity and specificity of phenocopy signatures",
                                "describe results and clinical validation"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce phenocopy signature generation methods",
                        "define biological pathway",
                        "describe biological pathway databases",
                        "introduce disease pathways",
                        "exemplify disease pathways",
                        "define key driver gene",
                        "introduce gene set identification",
                        "describe gene set composition",
                        "introduce training cells",
                        "describe training cell composition",
                        "introduce pathological cells",
                        "describe nucleic acid sequence obtaining",
                        "introduce mutation set identification",
                        "describe mutation set composition",
                        "introduce pathogenic mutations",
                        "describe mutation determination methods",
                        "introduce gene expression profiles",
                        "describe gene expression profile composition",
                        "introduce mRNA species",
                        "describe mRNA level measurement methods",
                        "introduce phenocopy signature determination",
                        "describe phenocopy signature composition",
                        "introduce gradient tree boosting approach",
                        "describe alternative machine learning techniques",
                        "introduce phenocopy signature independence from drug-response data",
                        "describe test cell gene expression profile obtaining",
                        "introduce test cell sources",
                        "describe phenocopy signature application",
                        "introduce disease diagnosis",
                        "describe disease treatment",
                        "introduce drug response prediction",
                        "describe personalized medicine",
                        "introduce cancer diagnosis",
                        "describe cancer treatment",
                        "introduce cancer drug response prediction",
                        "describe cancer personalized medicine",
                        "introduce other disease diagnosis",
                        "describe other disease treatment",
                        "introduce other disease drug response prediction",
                        "describe other disease personalized medicine",
                        "introduce phenocopy signature advantages",
                        "describe phenocopy signature limitations",
                        "introduce future directions",
                        "describe potential applications",
                        "conclude phenocopy signature generation methods",
                        "define phenocopy signature",
                        "describe gene expression profile matching",
                        "outline methods for identifying test cells",
                        "specify test cell characteristics",
                        "describe methods for identifying subjects",
                        "outline subject characteristics",
                        "specify test cell isolation methods",
                        "describe methods for predicting subject sensitivity",
                        "outline drug targeting biological pathways",
                        "describe methods for identifying drugs",
                        "specify phenocopy signature generation",
                        "outline test cell characteristics",
                        "describe methods for predicting response to drugs",
                        "specify biological pathway characteristics",
                        "describe methods for obtaining gene expression profiles",
                        "outline test cell sources",
                        "specify disease pathway characteristics",
                        "describe methods for administering drugs",
                        "outline treatment options",
                        "describe methods for predicting cell sensitivity",
                        "specify cell treatment options",
                        "outline method step combinations",
                        "describe numerical range interpretations",
                        "specify reference incorporation",
                        "outline invention scope",
                        "describe invention modifications"
                    ],
                    "num_characters": 36224,
                    "outline_medium": [
                        "introduce phenocopy signature generation methods",
                        "define biological pathway",
                        "describe biological pathway databases",
                        "introduce disease pathways",
                        "exemplify diseases resulting from disease pathways",
                        "define key driver gene",
                        "introduce gene set identification",
                        "describe gene set composition",
                        "introduce training cell identification",
                        "describe training cell composition",
                        "obtain nucleic acid sequences for genes",
                        "identify mutation set",
                        "describe mutation types",
                        "obtain gene expression profiles",
                        "describe gene expression profile composition",
                        "determine gene expression signatures",
                        "describe gene expression signature composition",
                        "predict mutation presence using gene expression signatures",
                        "describe prediction accuracy",
                        "introduce phenocopy signature determination",
                        "describe phenocopy signature independence from drug-response data",
                        "introduce methods of identifying cells exhibiting a phenocopy signature",
                        "define phenocopy signature",
                        "describe gene expression profile matching",
                        "outline methods for identifying test cells",
                        "specify test cell characteristics",
                        "describe methods for identifying subjects with phenocopy signature",
                        "outline methods for predicting subject sensitivity to drug treatment",
                        "describe biological pathway targeting by drugs",
                        "specify drug targeting mechanisms",
                        "outline methods for identifying drugs targeting biological pathways",
                        "describe phenocopy signature generation without empirical data",
                        "outline methods for predicting cell sensitivity to drug treatment",
                        "describe optional treatment steps",
                        "provide general patent application information"
                    ],
                    "outline_short": [
                        "define biological pathway",
                        "describe databases for biological pathways",
                        "introduce disease pathways and key driver genes",
                        "identify gene set within biological pathway",
                        "describe training cells and their characteristics",
                        "obtain nucleic acid sequence for genes in training cells",
                        "identify mutation set within nucleic acid sequences",
                        "obtain gene expression profile for training cells",
                        "determine gene expression signatures predicting mutations",
                        "describe methods for identifying cells exhibiting phenocopy signature",
                        "obtain gene expression profile for test cell",
                        "define phenocopy signature",
                        "describe method of identifying cells exhibiting phenocopy signature",
                        "describe method of identifying subject comprising cells that exhibit phenocopy signature",
                        "describe method of predicting subject sensitive to treatment with drug",
                        "describe method of predicting cells sensitive to treatment with drugs",
                        "provide general information and definitions"
                    ]
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "Targeted therapies have shown great promise in treating a variety of cancer types, but to date only benefit a minority of cancer patients. A major reason is that targeted therapies perform optimally in patients whose specific tumors are uniquely dependent on the targeted pathway, which is currently assessed by identifying key driver mutations. The majority of patients lack a DNA alteration, and we do not currently have other biomarkers to identify additional patients who could benefit from these targeted treatments. With the creation of large pharmacogenomic databases2,23,46, most published efforts have been focused on specifically training molecular signatures to predict drug response21-32. Our phenocopy approach differs from this direct approach. Instead, we trained phenocopy signatures to identify the gene expression patterns that accompany common driver gene alterations in cancer. We then demonstrate that this indirect approach improves the ability to predict pan-cancer treatment response across eight oncogenic pathways compared to DNA mutation status alone. To our knowledge, this is the first report of the successful global application of a phenocopy strategy in predicting drug response in vitro and in clinical cohorts.",
                        "We show that in mutation-negative tumors, the phenocopy signatures can identify a subset that respond to targeted therapies with high specificity. These results suggest that phenocopy signatures add to clinically actionable mutations in predicting therapy response and could be used in clinical settings to identify mutation-negative patients who may benefit from targeted therapy with high specificity. While the sensitivity is not as high, it is comparable to DNA mutations alone and doubling the number of patients eligible for targeted therapies would represent an enormous clinical advancement. Additionally, phenocopy signatures could also be used to help guide treatment decisions for patients with variants of unknown significance. Finally, most drug-biomarker indications are currently limited to specific cancer sites. Our training and validation cohorts are pan-cancer datasets, potentially allowing for a tremendous expansion of current targeted therapy indications across multiple cancer types.",
                        "Clinical trials or cohorts of targeted therapies with transcriptome-wide RNA profiling are rare. This is partly because most commercial DNA sequencing panels do not include whole-transcriptome RNA-seq. These examples provide a rationale for expanding clinical Next-Gen Sequencing to include RNA-seq, and provide a pan-cancer, platform-independent, phenocopy biomarker with which to select patients for inclusion in a next-generation clinical trial of targeted therapies in patients without driver DNA mutations."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate targeted therapies",
                        "limitations of current biomarkers",
                        "introduce phenocopy approach",
                        "demonstrate improved prediction of treatment response",
                        "discuss potential clinical applications"
                    ],
                    "num_characters": 2766,
                    "outline_medium": [
                        "motivate phenocopy approach",
                        "describe advantages over DNA mutation status alone"
                    ],
                    "outline_short": [
                        "motivate phenocopy approach"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of generating a phenocopy signature, the method comprising:\nidentifying a gene set comprising one or more genes within a biological pathway;\nidentifying a set of training cells, wherein each training cell comprises each of the one or more genes in the gene set;\nobtaining a nucleic acid sequence for each of the one or more genes in each training cell;\nidentifying a mutation set comprising one or more mutations within the nucleic acid sequences;\nobtaining a gene expression profile for each training cell; and\ndetermining from the mutation set and the gene expression profiles a set of gene expression signatures that predict presence of at least a subset of the one or more mutations within the training cells, wherein the phenocopy signature comprises the set of gene expression signatures.",
        "2. The method of claim 1, wherein the biological pathway is selected from the group consisting of a cell cycle pathway, a DNA repair pathway, a metabolism pathway, a signaling pathway (e.g., signal transduction by a receptor (e.g., a growth factor receptor) and second messengers), a transcriptional regulation pathway, a transport pathway (e.g., of transmembrane transporters), a cell motility pathway, an immune function pathway, a cell death pathway, a host-virus interaction pathway, a cellular stress-response pathway, a developmental pathway, a senescence pathway, an angiogenesis pathway, an epithelial-to-mesenchymal transition pathway, and a neural pathway.",
        "3. The method of claim 1, wherein the biological pathway is a disease pathway.",
        "4. The method of claim 1, wherein the biological pathway is a cancer pathway.",
        "5. The method of claim 1, wherein at least one of the one or more mutations in the mutation set is a pathogenic mutation.",
        "6. The method of claim 1, wherein each of the one or more mutations in the mutation set is a pathogenic mutation.",
        "7. The method of claim 1, wherein at least one of the one or more mutations in the mutation set is not known to be pathogenic.",
        "8. The method of claim 1, wherein at least one of the one or more mutations in the mutation set is a coding mutation.",
        "9. The method of claim 1, wherein each of the one or more mutations in the mutation set is a coding mutation.",
        "10. The method of claim 1, wherein at least one or more of the training cells comprises a pathological cell.",
        "11. The method of claim 1, wherein each of the training cells is a pathological cell.",
        "12. The method of claim 1, wherein the determining the phenocopy signature does not comprise incorporating empirical drug-response data for at least one of the training cells.",
        "13. The method of claim 1, wherein the determining the phenocopy signature does not comprise incorporating empirical drug-response data for any of the training cells.",
        "14. The method of claim 1, wherein the obtaining the nucleic acid sequence for each of the one or more genes in each training cell comprises sequencing at least a portion of at least one of the one or more genes in at least one training cell.",
        "15. (canceled)",
        "16. The method of claim 1, wherein the obtaining the gene expression profile for each training cell comprises measuring the mRNA levels of different mRNA species present in at least one training cell.",
        "17. The method of claim 1, wherein the obtaining the gene expression profile for each training cell comprises sequencing at least a portion of each of the one or more genes in each training cell or measuring the mRNA levels of different mRNA species present in each training cell.",
        "18. A method of identifying a cell exhibiting the phenocopy signature of claim 1, the method comprising:\nobtaining a gene expression profile for a test cell; and\ndetermining whether the gene expression profile for the test cell matches the phenocopy signature, wherein the test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature.",
        "19-20. (canceled)",
        "21. A method of identifying a subject comprising cells that exhibit the phenocopy signature of claim 1, the method comprising:\nisolating a test cell from the subject;\nobtaining a gene expression profile for the test cell; and\ndetermining whether the gene expression profile for the test cell matches the phenocopy signature, wherein the test cell exhibits the phenocopy signature if the gene expression profile for the test cell matches the phenocopy signature.",
        "22-23. (canceled)",
        "24. A method of predicting a subject sensitive to treatment with a drug that targets a biological pathway and, optionally, treating the subject, the method comprising:\nobtaining a gene expression profile for a test cell isolated from the subject; and\ndetermining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets, wherein the subject is predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature,\nwherein the phenocopy signature and the biological pathway are the phenocopy signature and the biological pathway, respectively, of claim 1.",
        "25-34. (canceled)",
        "35. A method of predicting a cell sensitive to treatment with a drug that targets a biological pathway and, optionally, treating the cell, the method comprising:\nobtaining a gene expression profile for a test cell; and\ndetermining whether the gene expression profile for the test cell matches a phenocopy signature generated with a gene set from the biological pathway that the drug targets, wherein the cell is predicted to be sensitive to treatment with the drug if the gene expression profile for the test cell matches the phenocopy signature,\nwherein the phenocopy signature and the biological pathway are the phenocopy signature and the biological pathway, respectively, of claim 1.",
        "36-42. (canceled)"
    ]
}