{
    "id": "US20230089221",
    "authors": [
        "Stanley B. Prusiner",
        "Jacob I. Ayers",
        "Nick A. Paras"
    ],
    "title": "ASSAYS FOR CLASSIFYING ALPHA-SYNUCLEIN PRION DISEASES",
    "date": "2022-09-13 00:00:00",
    "abstract": "An assay is disclosed based on the successful transmission of DLB, and to a much lesser extent PD, to cultured HEK cells expressing the A53T and E46K point mutation. DLB prion activity was achieved by treatment of brain homogenates with detergent extraction and limited proteolysis followed by polyoxometalate precipitation of the prions. The results show the MSA strain of α-synuclein prions differs from those causing PD and DLB. Manipulating dominant negative inhibition of α-synuclein prions has created a new approach to identifying novel prions and deciphering the features of their multiplication.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The invention relates generally to the field of biological assays and more particularly to an assay that differentiates conformations or strains of α-synuclein proteins, i.e., prions, that cause a class of neurological diseases and method of using the result to improve treatments of patients by better identifying their diseases."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 330,
                    "outline_medium": [
                        "define field of invention"
                    ],
                    "outline_short": [
                        "define field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "More than 200 y ago, James Parkinson described the disease that bears his name (1). Little progress was made in deciphering the cause of Parkinson's disease (PD) for nearly a century before Fritz Lewy discovered inclusions in the brains of PD patients (2). In his initial manuscript, he described these inclusions as eosinophilic and insoluble in alcohol, chloroform, and benzene, consistent with the presence of a major protein component. Konstantin Tretiakoff described the abundance of these inclusions in the substantia nigra in PD 2 y later and named them Lewy bodies (3).",
                        "The putative proteins of Lewy bodies remained undefined for almost a century until genetic linkage studies elucidated the relationship between types of familial PD and mutations in the gene encoding the α-synuclein protein, SNCA (4). Soon thereafter in 1997, α-synuclein antibodies were found to bind Lewy bodies, the pathological hallmark of PD and dementia with Lewy bodies (DLB) (5). The following year, multiple groups reported α-synuclein immunostaining of glial cytoplasmic inclusions (GCIs) found in the brains of deceased patients with multiple system atrophy (MSA) (6-8).",
                        "Since the identification of mutant α-synuclein as the cause of familial PD (fPD), surprisingly little progress has been made in developing effective treatments for PD. Three decades earlier, Hornykiewicz and colleagues reported that people who died of PD had low levels of dopamine in the nigrostriatal pathway (9). The same year Cotzias and coworkers described their success in treating PD patients using oral levodopa (L-Dopa) replacement therapy (10). Unfortunately, many PD patients eventually become refractory to L-Dopa therapy necessitating additional interventions: deep brain stimulation (DBS) has been found to assume an increasingly important role in the symptomatic relief of PD. Unfortunately, there remains no therapy that slows the progression of any of the synucleinopathies.",
                        "The increasing phenotypic similarities among PD, DLB, MSA, and some other transmissible neurodegenerative diseases (NDs) have led many investigators to classify the synucleinopathies as prion diseases, despite some skeptics. Arguing against the possibility that PD might be a prion disorder was an early study reporting the absence of disease transmission following intracerebral inoculation of PD brain extracts to apes and monkeys (11). However, similar to other studies of prion proteins such as PrP, amyloid-β, and tau, studies investigating α-synuclein have focused on the possibility that as the structure of α-synuclein misfolds and adopts a β-sheet-rich structure, it acquires toxic properties that lead to the synucleinopathies. A few studies have investigated the mechanism by which α-synuclein acquires a β-sheet-rich structure characteristic of prions (12-16).",
                        "A decisive step toward elucidating the cause of the synucleinopathies occurred when brain homogenates from deceased MSA patients were found to transmit disease to transgenic (Tg) (SNCA*A53T) M83+/− mice, hereafter referred to as TgM83+/− mice (17, 18). All the TgM83+/− mice inoculated with human MSA brain homogenates developed a progressive neurological disorder manifested as diminished motor movements followed by paralysis. On postmortem examination, the brains of these inoculated TgM83+/− mice were found to contain α-synuclein*A53T aggregates within the CNS. The median incubation period for the MSA-inoculated TgM83+/− mice was ˜120 d postinoculation. Remarkably, brain samples from deceased MSA patients that had been stored in formalin for as long as 20 y were still found to be infectious when passaged in this Tg mouse line (19).",
                        "Complementary to the TgM83+/− mouse model, a cultured HEK293T cell line was developed that overexpresses a yellow fluorescent protein (YFP)-tagged human α-synuclein protein containing the A53T mutation (α-syn140*A53T-YFP) (18). With this model, it became possible to measure the activity of α-synuclein prions in samples from MSA brains after only 3 d of incubation by quantifying the formation of fluorescent α-synuclein aggregates that manifested as intracellular puncta (18, 20, 21). In a subsequent study, it was discovered that HEK cells expressing the α-synuclein E46K mutation prevented replication of MSA prions, while cells expressing either the wild-type (WT) protein or the A30P mutation were capable of supporting MSA prion formation (20). The transmission of brain homogenates from PD cases was also examined but found to neither transmit disease to TgM83+/− mice nor infect the α-syn140*A53T-YFP cell line (18).",
                        "Although several laboratories have reported successful transmission of PD prions using cultured HEK cells expressing α-syn140*A53T, we have been unable to confirm these findings (22, 23). Protein misfolding cyclic amplification (PMCA) and other in vitro approaches have been used to differentiate MSA α-synuclein prions from those causing PD and DLB (13, 14, 24, 25). Together, these findings have led us, and other investigators, to hypothesize that alternative conformations of α-synuclein prions cause PD, DLB, and MSA (13, 17, 18, 23, 24, 26-28).",
                        "To investigate the potential strain specific differences among MSA, DLB, and PD α-synuclein prions, we tested their ability to replicate in our previously described cultured cell models (20). By utilizing a modified protocol to purify α-synuclein prions from patient brain samples, we detected DLB α-synuclein prion activity. The low α-synuclein prion levels in PD samples prevented reliable characterization. Using α-synuclein HEK cell lines, we then asked whether PD or DLB prion formation was similar to that found in MSA. Contrary to the finding that MSA was unable to infect the α-syn140*E46K cell line, DLB α-synuclein prions were capable of replicating in all four of the α-synuclein cell models tested. While the infectivity from most of the DLB samples was sufficient to perform studies using our α-synuclein-YFP-overexpressing HEK cells, the levels of PD prions remained insufficient for most studies. Our data argue that α-synuclein prions that accumulate and lead to MSA are conformationally distinct than those causing DLB. Deciphering the molecular mechanism in which single-amino-acid substitutions exquisitely control α-synuclein prion strain replication will likely be pivotal in reliably establishing the epidemiology of different synucleinopathies. This mechanism would also advance the discovery of drugs that effectively slow neurodegeneration caused by MSA, DLB, and possibly PD prions."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Parkinson's disease",
                        "describe Lewy bodies",
                        "discuss genetic linkage studies",
                        "identify α-synuclein protein",
                        "describe α-synuclein immunostaining",
                        "discuss multiple system atrophy",
                        "describe dopamine levels in PD",
                        "discuss L-Dopa therapy",
                        "introduce deep brain stimulation",
                        "discuss synucleinopathies as prion diseases",
                        "describe α-synuclein misfolding",
                        "discuss transmission of MSA prions",
                        "hypothesize alternative conformations of α-synuclein prions"
                    ],
                    "num_characters": 6559,
                    "outline_medium": [
                        "introduce Parkinson's disease",
                        "describe Lewy bodies",
                        "discuss genetic linkage studies",
                        "summarize α-synuclein immunostaining",
                        "describe limitations of current treatments",
                        "hypothesize α-synuclein prions cause synucleinopathies"
                    ],
                    "outline_short": [
                        "introduce Parkinson's disease",
                        "discuss history of α-synuclein research",
                        "summarize current understanding of synucleinopathies"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The invention provides an assay which differentiates conformations or strains of α-synuclein protein which are associated with a particular neurological disease. The α-synuclein protein can change its shape and become a prion. Multiple system atrophy (MSA) is caused by a particular conformation of an α-synuclein prion. A neurodegenerative disease (ND) called dementia with Lewy bodies (DLB) is also caused by synuclein prions. DLB prions differ in their shape, or more precisely conformation, from those causing MSA. Variations in the conformation of a particular prion such as α-synuclein, are labeled as different strains; thus, a third strain of α-synuclein prions causes Parkinson's disease (PD).",
                        "Parkinson's disease (PD), dementia with Lewy bodies (DLB) and multiple system atrophy (MSA) are a trio of progressive neurodegenerative diseases (NDs). These three late onset NDs are defined pathologically by the accumulation of α-synuclein that forms fibrillar aggregates. Brain extracts prepared from deceased MSA patients transmit α-synuclein prions to transgenic (Tg) mice and cultured cells, both of which express the A53T point mutation known to cause inherited PD. In contrast to the A53T mutation that facilitated MSA α-synuclein prion replication in cultured cells, the E46K point mutation inhibited MSA prion replication (20). It is difficult to transmit either putative PD or DLB α-synuclein prions from human brain extracts to either TgM83 mice or HEK cells expressing the A53T α-synuclein mutation. The invention is an assay based on the successful transmission of DLB, and to a much lesser extent PD, to cultured HEK cells expressing the E46K point mutation. DLB prion activity was achieved by treatment of brain homogenates with detergent extraction and limited proteolysis followed by polyoxometalate precipitation of the prions. While α-synuclein*E46K supported DLB prion replication in cultured HEK cells, the foregoing purification protocol developed for DLB prions proved ineffective for MSA α-synuclein prions. The results show the MSA strain of α-synuclein prions differs from those causing PD and DLB. Manipulating dominant negative inhibition of α-synuclein prions has created a new approach to identifying novel prions and deciphering the features of their multiplication",
                        "The assay of the invention has numerous applications, particularly within the pharmaceutical industry. The synucleinopathies, comprised of PD, MSA, and DLB, have significantly similar symptoms and are often misdiagnosed. This overlapping symptomology can lead to recruitment of the wrong patient population for clinical studies aiming to treat only one of the three synucleinopathies. For example, a clinical study testing the effects of a promising PD therapy might fail to show efficacy because instead of enrolling patients with PD, the participants are actually afflicted with DLB. Therefore, the misdiagnosis of synucleinopathies can lead to false negatives in clinical trials.",
                        "One way to better understand the findings of these clinical trials is to retrospectively analyze the participants' brains once they die. Historically, neuropathology can be used to confirm a diagnosis; however, much like the clinical symptoms, there is considerable overlap in the pathology of PD, MSA, and DLB cases as well. Using the assay described here, companies will be able to take a brain sample from a deceased clinical trial patient, isolate the α-synuclein prions within that sample, and apply them to the E46K and A53T bioassays to confirm or refute the diagnosis of that participant. This will provide the company with the exact etiology of that participant's symptoms and allow them to retrospectively analyze the efficacy of their therapy. Overall, this assay will provide reliable assessments of a patient's synucleinopathy diagnosis.",
                        "These and other aspects of various embodiments of the invention will become apparent to those persons skilled in the art upon reading the details of the steps and methods as more fully described below."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce α-synuclein prions",
                        "describe MSA prions",
                        "describe DLB prions",
                        "describe PD prions",
                        "discuss conformational differences",
                        "describe assay for differentiating prions",
                        "discuss applications in pharmaceutical industry",
                        "discuss retrospective analysis of clinical trials"
                    ],
                    "num_characters": 4039,
                    "outline_medium": [
                        "introduce α-synuclein prions",
                        "describe differences in prion strains",
                        "summarize assay for differentiating prion strains",
                        "discuss applications of the assay"
                    ],
                    "outline_short": [
                        "introduce α-synuclein prions and strains",
                        "describe assay for differentiating α-synuclein strains"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "Before the present steps, components and methods are described, it is to be understood that this invention is not limited to particular embodiments described, as such may, of course, vary. It is also to be understood that the terminology used herein is for the purpose of describing particular embodiments only, and is not intended to be limiting, since the scope of the present invention will be limited only by the appended claims.",
                        "Where a range of values is provided, it is understood that each intervening value, to the tenth of the unit of the lower limit unless the context clearly dictates otherwise, between the upper and lower limits of that range is also specifically disclosed. Each smaller range between any stated value or intervening value in a stated range and any other stated or intervening value in that stated range is encompassed within the invention. The upper and lower limits of these smaller ranges may independently be included or excluded in the range, and each range where either, neither or both limits are included in the smaller ranges is also encompassed within the invention, subject to any specifically excluded limit in the stated range. Where the stated range includes one or both of the limits, ranges excluding either or both of those included limits are also included in the invention.",
                        "Unless defined otherwise, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this invention belongs. Although any methods and materials similar or equivalent to those described herein can be used in the practice or testing of the present invention, the preferred methods and materials are now described. All publications mentioned herein are incorporated herein by reference to disclose and describe the methods and/or materials in connection with which the publications are cited.",
                        "It must be noted that as used herein and in the appended claims, the singular forms “a”, “an”, and “the” include plural referents unless the context clearly dictates otherwise. Thus, for example, reference to “a cell” includes a plurality of such cells and reference to “the detergent” includes reference to one or more detergents and equivalents thereof known to those skilled in the art, and so forth.",
                        "The publications discussed herein are provided solely for their disclosure prior to the filing date of the present application. Nothing herein is to be construed as an admission that the present invention is not entitled to antedate such publication by virtue of prior invention. Further, the dates of publication provided may be different from the actual publication dates which may need to be independently confirmed.",
                        "The invention includes a method of determining strain of a prion such as a α-synuclein prion and includes contacting a sample (which may be brain homogenate treated with detergent) with cultured HEK cells expressing an A53T or E46K point mutation. The cells are cultured in the presence of the sample and examined to determining infectivity of the cells and relating the level of infectivity observed to a particular α-synuclein strain. The brain homogenate can be treated with detergent to allow limited proteolysis followed by polyoxometalate precipitation of the prions, thereby enhancing the sensitivity of the method. The α-synuclein strain to is matched to a progressive neurodegenerative disease (ND), and as such the method of the invention makes it possible to determine the neurodegenerative disease suffered by the patient the brain sample was taken from to make the brain homogenate. The ND may be selected from the group consisting of Parkinson's disease (PD), dementia with Lewy bodies (DLB), and multiple system atrophy (MSA). By determining the ND it is possible to determine if a patient being treated such as a patient in a drug treatment trial actually had a neurological disease that the patient was believed to have and for which the drug was intended to treat.",
                        "The brain sample can be treated in different ways such as by homogenizing the brain tissue sample in saline buffer to obtain 10% (w/v) homogenized brain tissue;",
                        "treating the homogenized brain tissue with sarkosyl detergent to a final concentration of 2% to obtain a treated sample;",
                        "treating the sample with benzonase to a final concentration of 150 Units/mL and then incubating the sample at 37° C. with shaking for 2 hours;",
                        "digest the proteins in the sample by treating it with proteinase K (PK) to a final concentration of 20 μg/mL and then incubating for 1 hour at 37° C.;",
                        "halting digestion with the addition of PMSF to a final concentration of 1 mM;",
                        "precipitating α-synuclein prions from the treated sample by adding phosphotungstic acid (PTA) to a concentration of 2% followed by incubating them at 37° C. overnight (14-18 hours),",
                        "concentrating the prions by centrifugation at 16,100×g for 1 hour and 15 minutes, removing the supernatant, and then resuspending the pellet by adding in 10% of the initial starting volume with DPBS and pipetting.",
                        "Thereafter the method can include contacting the precipitated prions with cultured HEK cells expressing an A53T or E46K point mutation, continuing to culture the cells in the presence of the precipitated prions,",
                        "determining infectivity of the cells with precipitated prions; and",
                        "relating infectivity level to α-synuclein strain.",
                        "The invention includes a method of determining strain of a α-synuclein prion, comprising:",
                        "obtaining a sample of brain tissue;",
                        "homogenizing the brain tissue sample in saline buffer to obtain 10% (w/v) plus or minus 2% homogenized brain tissue;",
                        "treating the homogenized brain tissue with sarkosyl detergent to a final concentration in a range of 1% to 3% to obtain a treated sample;",
                        "treating the sample with benzonase to a final concentration of 150 Units/mL and then incubating the sample at 37° C. with shaking for 1 to 3 hours;",
                        "digest the proteins in the sample by treating it with proteinase K (PK) to a final concentration of 20 μg/mL plus or minus 2 μg/mL and then incubating for 0.5 to 2 hour at 37° C. plus or minus 3° C.;",
                        "halting digestion with the addition of PMSF to a final concentration of 1 mM plus or minus 0.2 mM;",
                        "precipitating α-synuclein prions from the treated sample by adding phosphotungstic acid (PTA) to a concentration of 2% followed by incubating them at 37° C. 12-20 hours),",
                        "concentrating the prions by centrifugation at 16,100×g for 1 hour and 15 minutes, plus or minus 15 minutes, removing the supernatant, and then resuspending the pellet by adding in 10% of the initial starting volume with DPBS and pipetting.",
                        "contacting the precipitated prions with cultured HEK cells expressing an A53T or E46K point mutation;",
                        "continuing to culture the cells in the presence of the precipitated prions;",
                        "determining infectivity of the cells with precipitated prions; and",
                        "relating infectivity level to α-synuclein strain."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "The following examples are put forth to provide those of ordinary skill in the art with a complete disclosure and description of how to make and use the present invention and are not intended to limit the scope of what the inventors regard as their invention nor are they intended to represent that the experiments below are all or the only experiments performed. Efforts have been made to ensure accuracy with respect to numbers used (e.g., amounts, temperature, etc.) but some experimental errors and deviations should be accounted for. Unless indicated otherwise, parts are parts by weight, molecular weight is weight average molecular weight, temperature is in degrees Centigrade, and pressure is at or near atmospheric.",
                                "**Enhanced Precipitation of MSA Prions**",
                                "In earlier studies, we reported that α-synuclein prions isolated from the brains of deceased MSA patients could infect HEK293T cells expressing α-syn140*A53T-YFP, resulting in the formation of bright fluorescent intracellular puncta (18, 21). Though crude MSA brain homogenates could induce a modest level of prion infectivity in cultured HEK cells, phosphotungstic acid (PTA) precipitation significantly enhanced synuclein prion infectivity (18, 21). When brain homogenates from PD patients were tested, neither crude brain homogenates nor PTA-precipitated fractions were found to be infectious (18, 21). In an attempt to liberate α-synuclein prions from Lewy bodies, which are compact and densely packed intracellular structures, we partially purified prions from PD brain homogenates with 2% sarkosyl followed by limited proteolysis with proteinase K (PK) prior to PTA precipitation (PK/PTA).",
                                "To reliably measure α-synuclein prion infectivity from the brains of deceased patients with MSA, PD, or DLB, we performed a half-log dilution series of clarified brain homogenates (CBH) and of samples that had been PK/PTA precipitated. The CBH from MSA cases revealed a low level of infectivity at the highest concentrations of the sample (FIG. 1A). When homogenates from these same MSA samples were subjected to PK/PTA precipitation, 35% of the α-syn140*A53T-YFP cells formed puncta in the lowest dilutions. This contrasts with only 2.5% of cells treated with PK/PTA precipitated samples from brain homogenates of cognitively normal human patients (referred to as negative controls) that developed puncta (FIG. 1B). Upon dilution, the PK/PTA-treated MSA samples displayed a robust dose-response relationship within this cell line. In addition to an increase in infectivity, the treatment also led to visibly larger puncta in the cells when compared to the inclusions induced by CBH (FIG. 1C).",
                                "**α-Synuclein Prion Infectivity in PD and DLB Brain Specimens**",
                                "Previously, PTA precipitation of PD samples was unsuccessful at uncovering prion activity when tested in α-syn140*A53T-YFP cells (18). We next decided to examine whether the PK/PTA precipitation, which greatly increased infectivity for MSA samples, would enable the measurement of prions derived from PD and DLB postmortem brains. We first tested these samples in α-syn140*A53T-YFP cells. With CBH from the amygdalae of five PD and six DLB patients, only ˜5% of cells developed puncta, and the measured response was unaffected by increasing dilutions (FIG. 1A). The low levels of α-synuclein prion activity in CBH from PD and DLB cases were consistent with our previously reported findings (18). The ability of these samples to induce formation of α-synuclein aggregates was markedly enhanced following PK/PTA precipitation (FIG. 1B). Although the increases in infectivity were modest when compared to MSA specimens, the DLB samples contained measurable levels of α-synuclein prions that were attenuated by dilution. When examined, the puncta in both the PD- and DLB-treated cells appeared as small punctate inclusions, though there were considerably fewer aggregates induced with PD (FIG. 1C). From these studies, we concluded that sarkosyl extraction followed by limited proteolysis and PTA precipitation substantially increased the α-synuclein prion infectivity from brain homogenates prepared from people who had died of α-synucleinopathies. Additionally, we found that partially purified α-synuclein prions from DLB propagate in HEK cells.",
                                "**α-Synuclein (E46K) Distinguishes Prion Strains**",
                                "To characterize α-synuclein prion activity from MSA brain samples, we infected several HEK cell lines overexpressing α-synuclein fused to YFP (20). While one cell line expressed WT α-synuclein, three others expressed human α-synuclein containing point mutations causing fPD. These three mutations are A30P, E46K, and A53T (20). As discussed in the Introduction, cells expressing E46K α-synuclein protein abolished formation of nascent MSA α-synuclein prions, while cells expressing WT, A30P, or A53T α-synuclein protein displayed a robust induction of fluorescent puncta upon infection with the same MSA samples (20). In contrast, recombinant α-synuclein fibrils were capable of infecting all cell lines tested. Based upon these results, we concluded that MSA α-synuclein prions are likely to be conformationally distinct from PD prions (20). However, due to the inability of homogenates from PD patients to infect these cell lines, we were unable to more conclusively test this hypothesis.",
                                "Next, to ensure that PK/PTA precipitation did not alter the selectivity of MSA α-synuclein prions to these different HEK cell models and to characterize the putative activity of PD and DLB α-synuclein prions, we tested these samples in WT, A30P, and E46K cell lines. MSA PK/PTA samples (n=5) retained their ability to infect HEK cells expressing α-syn140*WT-YFP, α-syn140*A30P-YFP, and α-syn140*A53T-YFP and displayed high levels of infectivity (FIG. 2; Table 1). In comparison, infection of the same cell lines using PK/PTA samples from PD (n=5) and DLB homogenates (n=6) resulted in significant levels of infectivity from only one of the five PD samples (PD16), and in three of the six DLB samples (FIG. 2 and Table 1). Treatment with the PD/DLB samples resulted in lower levels of infectivity than treatment with MSA samples in all three cell lines. In addition, we also observed differences in the size of the aggregates induced in the three α-synuclein-expressing cell lines. The MSA samples were capable of inducing large punctate aggregates, whereas those induced by both the PD and DLB cases were noticeably smaller (FIGS. 2B, D, and F).",
                                "Although we previously utilized cells expressing α-synuclein fused to YFP to measure α-synuclein prion levels (20), we remained concerned that the large YFP fluorophore might modify α-synuclein prion formation. The YFP fluorophore is comprised of 235 amino acids and is fused to α-synuclein through an 18-amino-acid linker. Together, YFP and the linker are almost twice the size of α-synuclein. To address any potential artifact due to YFP and/or the linker, we generated an HEK293T stable cell line expressing the α-synuclein (A53T) protein lacking a fused YFP tag denoted α-syn140*A53T. To measure the induction of α-synuclein aggregation in this cell line, we used a homogenous time-resolved fluorescence (HTRF) assay that immunolabels α-synuclein prion aggregates. Upon infecting α-syn140*A53T cells with PK/PTA preps from control, MSA, PD, or DLB human brain samples, we measured α-synuclein prion aggregates using HTRF after 4 d of incubation (FIG. 3). Overall, the comparative levels of aggregation between samples were strikingly similar to those measured by YFP fluorescence in the α-syn140*A53T-YFP cells (FIG. 2E versus FIG. 3). This comparison demonstrates that the large YFP tag had little, if any, effect on the accumulation and detection of α-synuclein prions following HEK cell infections.",
                                "As noted in the Introduction, we were previously unable to detect MSA prion infectivity in α-syn140*E46K-YFP cells (20). To test whether the PK/PTA procedure impacted this selectivity, we infected α-syn140*E46K-YFP cells with PK/PTA-treated MSA samples. Despite the robust increase in infectivity observed using other cell lines following PK/PTA precipitation, MSA α-synuclein prions were unable to infect cells expressing the E46K-mutated α-synuclein substrate (FIG. 4 and Table 1). However, when PK/PTA-precipitated α-synuclein prions from the PD and DLB samples were assessed in the α-syn140*E46K-YFP cells, we found that one of the five PD samples and four of the six DLB samples were capable of inducing significant aggregation when compared to controls. Furthermore, treatment with several of the DLB samples resulted in greater than 10% of the cells accumulating aggregates (Table 1).",
                                "To further characterize the infectivity of PD/DLB prions in α-syn140*E46K-YFP cells, we examined an expanded set of PD and DLB patient samples. A total of 30 individual PD samples and 31 individual DLB samples from the temporal cortex were subjected to PK/PTA precipitation followed by infection of both the A53T- and E46K-expressing cell lines. There was a significant decrease in the ability of MSA samples to infect cells expressing E46K compared to cells expressing A53T (P=0.0001) (FIG. 5). In comparison, the increased set of DLB samples revealed no statistically significant difference in their ability to infect the two cell lines (P=0.14) (FIG. 5). Although the low level of infectivity observed among our expanded set of PD samples prevented conclusive results, there was also no statistical difference in the infectivity observed in A53T-versus E46K-expressing cells (P=0.68) (FIG. 5).",
                                "To evaluate the α-synuclein prion infectivity in these two cell lines for a given sample, we also plotted the data from FIG. 5 in a scatter plot (FIG. 6 and SI Appendix, Fig. S1). By visualizing the data in this manner, it is obvious that most of the DLB and PD samples that resulted in infectivity in one cell line were also capable of infecting the other (FIG. 6 and SI Appendix, Fig. S1). MSA, however, is segregated from the DLB and PD samples as it is only able to infect the A53T-expressing cell line.",
                                "Based on earlier studies and the reported areas of high neuropathological α-synuclein burden in MSA, PD, and DLB cases (29), we created homogenates of amygdalae and temporal cortices from PD and DLB cases and basal ganglia from MSA cases for our experiments. To ensure that the inability of our MSA samples to infect α-syn140*E46K-YFP cells was not due to the tissue type used, we also tested homogenates of amygdalae from four of the five MSA postmortem patient brains. Although the amygdala is largely spared from pathological inclusions in MSA (29), we detected a robust induction of puncta (greater than 40% of cells) in α-syn140*A53T-YFP cells for two of the four samples (SI Appendix, Fig. S2). While infection in the WT and A30P α-synuclein expressing cells resulted in a decreased level of infectivity when compared to the A53T cells, these samples were unable to induce inclusions in the E46K α-synuclein-expressing cells (SI Appendix, Fig. S2). Our data indicate that the inhibitory effect of the E46K mutation on MSA infection is not dependent on the tissue type.",
                                "**Discussion**",
                                "Transmission of α-synuclein prions from human brains to experimental hosts ranging from cultured cells to nonhuman primates was unsuccessful for decades (11). The first indication of transmissibility was a report that Lewy body pathology had been transmitted from the putamen of PD patients to fetal striatal tissue transplanted in the striatum (30-32). Since these fetal transplants proved ineffective as a treatment for advanced PD, few similar procedures have been subsequently performed. Notably, many experimental studies demonstrating α-synuclein prion infectivity have consisted of injecting recombinant α-synuclein fibrils, sometimes called preformed fibrils, into the brains of TgM83+/− mice (33-35).",
                                "An important advance in elucidating the etiology of the synucleinopathies was the transmission of α-synuclein prions from the brains of deceased MSA patients to TgM83+/− mice (17, 18). TgM83+/− mice hemizygous for the human mutant α-synuclein transgene proved to be a superb host for α-synuclein transmission (36). While the expression level of mutant α-synuclein (A53T) was low enough not to allow for spontaneous prion formation, it was sufficient to produce disease upon inoculation of human MSA brain homogenates (17, 18).",
                                "During our initial study of α-synuclein mutations, we found that MSA brain homogenates were infectious in both TgM83+/− mice and HEK cells overexpressing α-synuclein containing the A53T mutation (17, 18, 21, 33). In parallel studies of homogenates from PD brains, we found little evidence for α-synuclein prion infectivity (18). Although PTA precipitation alone was sufficient for measuring MSA prion activity, it was unable to facilitate α-synuclein prion infectivity from PD brain homogenates (17, 18, 21). In other studies, detergent-insoluble fractions prepared from MSA and PD homogenates were added to HEK cells overexpressing α-syn*A53T fused to YFP; three of the five PD extracts and four of the five MSA extracts showed evidence for α-synuclein prion replication (23). Notably, the detergent-soluble fractions from MSA but not PD retained significant prion activity. Additionally, Recasens and colleagues isolated aggregates of α-synuclein from human PD brains using sucrose gradients, and upon intracerebral inoculation of these extracts into WT mice and macaque monkeys, a modest level of degeneration of nigrostriatal neurons was detected (37). Taken together, these studies raise the possibility that special conditions are needed to liberate PD α-synuclein prions sequestered inside Lewy bodies. Consistent with this hypothesis, ultrastructural characterization of Lewy bodies show a crowded environment consisting of not only α-synuclein, but also of membranes and organelles all densely packed into inclusions (38).",
                                "Enhancing α-Synuclein Prion Infectivity. We attempted to increase the α-synuclein prion infectivity in our samples by subjecting the brain homogenates to limited PK digestion followed by PTA precipitation. This protocol was initially developed to degrade proteins in brain homogenates and assist in the purification of PrP prions (39, 40). We hypothesized that this added step might enzymatically disrupt Lewy bodies and liberate α-synuclein prions, resulting in enhanced prion transmissibility. Surprisingly, digesting both MSA and DLB homogenates with PK followed by PTA precipitation resulted in increased infectivity in all MSA cases and a majority of the DLB cases.",
                                "Like the A53T point mutation in α-synuclein, the E46K mutation is also observed in fPD cases. When attempting to infect HEK cells expressing either of these mutations, we were surprised to find that unlike the A53T mutation, the E46K substitution inhibited de novo replication of MSA prions (20). To explore this unanticipated result, we asked whether the E46K point mutation, which prevented MSA prion propagation, might also inhibit DLB and/or PD prion replication. We were surprised when these studies showed that the E46K mutation did not inhibit either DLB or PD prion formation. While the low level of PD prion propagation in many samples made the results difficult to interpret, the much more robust replication of DLB prions is encouraging for future studies (FIG. 5).",
                                "Structures of α-Synuclein Prions. The recent cryogenic electron microscopy (cryo-EM) structures of MSA α-synuclein filaments solved by Schweighauser and colleagues (41) provide insight into the molecular pathogenesis findings we report here. Two structurally different α-synuclein protofilaments were isolated from the brains of MSA patients. In both filaments, glutamic acid 46 is situated adjacent to the lysine at position 80 (FIG. 7). The close proximity of these two charged amino acid residues stabilizes the conformation of α-synuclein in MSA fibrils through a network of electrostatic and hydrogen-bonding interactions, both within a single protofilament and between protofilament layers. A mutation of the glutamic acid (E) residue at position 46 to a lysine (K) results in a loss of those favorable interactions, replacing them with an increase in localized positive charge that disfavors conformationally induced proximity between residue 46 and the lysine at position 80. This single residue appears sufficient to prevent the α-synuclein*E46K substrate from adopting any of the MSA protofibril conformations. Conversely, the ability of PD/DLB α-synuclein prions to induce aggregation in the α-syn140*E46K-YFP cells indicates that the glutamic acid at position 46 and the lysine at position 80 are not required to be in close proximity as new substrate is recruited into the infectious prion conformation.",
                                "PMCA and real-time quaking-induced conversion (RT-QuIC) utilize sonication, shaking, and recombinant protein in a cell-free assay to study and measure α-synuclein aggregation from biological fluids and tissues (24, 25, 42, 43). Using these assays, distinct signatures of α-synuclein amyloid accumulation were observed using cerebrospinal fluid (CSF) from MSA and PD patients, leading the authors to conclude that these diseases are caused by distinct α-synuclein conformations (24). In contrast to our studies which showed that α-synuclein prion activity of MSA was much greater than PD, PMCA of CSF from PD patients resulted in higher levels of aggregation when compared to MSA (24). The HEK cell assays used in studies by us and others, such as Marc Diamond's laboratory, utilize physiological conditions (18, 20, 23). Furthermore, recent cryo-EM studies have revealed that fibrils composed of recombinant α-synuclein, tau, and amyloid-β are quite different than those solved from fibrils purified from primary patient samples (25, 44, 45). Though these two assays show tremendous value in studying synucleinopathies, the difference in their physiological relevance may produce disparate results.",
                                "Our studies and those of other investigators argue that PD/DLB prions are conformationally distinct from MSA prions. We measured a significant difference in the infectivity of PD and DLB samples in cells expressing A53T and E46K α-synuclein, with DLB samples appearing much more transmissible than those from PD. Though this could be attributed to a difference in the levels of α-synuclein prions that accumulate in these two diseases or the brain areas assayed, the possibility that PD and DLB patients accumulate distinct α-synuclein prion strains should be further explored. To address this, alternative assays using different α-synuclein mutants that support PD replication are required.",
                                "Molecular Basis of PD, DLB, and MSA. Distinguishing PD, DLB, and MSA has relied historically on clinical presentations and neuropathologic hallmarks, but that began to change with the discovery of point mutations in α-synuclein found to cause fPD (4). Another landmark advance occurred with the transmission of MSA α-synuclein prions to Tg(SNCA*A53T) mice (17). In contrast, neither prions from PD nor DLB brain homogenates could be transmitted to Tg mice or cultured cells expressing α-syn*A53T. Our discovery described here that the E46K α-synuclein point mutation is specifically permissive for DLB α-synuclein prion replication coupled with our earlier finding that E46K prevented MSA α-synuclein prion propagation (18, 20) offers diagnostic and possibly therapeutic opportunities.",
                                "Like Alzheimer's disease, prevalence of the trio of α-synucleinopathies increases with age. At present, the α-synucleinopathies are thought to afflict more than 10 million people worldwide. Translating the foregoing advances into effective therapeutics remains an urgent goal."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce examples",
                                "describe enhanced precipitation of MSA prions",
                                "report infectivity of MSA prions in HEK293T cells",
                                "describe limitations of crude brain homogenates",
                                "introduce PK/PTA precipitation method",
                                "report infectivity of PK/PTA-precipitated MSA prions",
                                "compare infectivity of MSA and control samples",
                                "describe α-synuclein prion infectivity in PD and DLB brain specimens",
                                "report infectivity of PK/PTA-precipitated PD and DLB prions",
                                "compare infectivity of PD, DLB, and MSA samples",
                                "describe differences in puncta size induced by PD, DLB, and MSA samples",
                                "introduce α-synuclein (E46K) as a distinguishing feature of prion strains",
                                "report infectivity of MSA prions in HEK cells expressing WT, A30P, and A53T α-synuclein",
                                "report infectivity of PD and DLB prions in HEK cells expressing WT, A30P, and A53T α-synuclein",
                                "compare infectivity of PD, DLB, and MSA samples in different cell lines",
                                "describe differences in aggregate size induced by PD, DLB, and MSA samples",
                                "introduce HTRF assay to measure α-synuclein prion aggregates",
                                "report infectivity of PK/PTA-precipitated samples in α-syn140*A53T cells using HTRF",
                                "compare HTRF and YFP fluorescence results",
                                "report inability of MSA prions to infect α-syn140*E46K-YFP cells",
                                "report infectivity of PD and DLB prions in α-syn140*E46K-YFP cells",
                                "describe expanded set of PD and DLB patient samples",
                                "report infectivity of PD and DLB prions in A53T- and E46K-expressing cells",
                                "compare infectivity of PD, DLB, and MSA samples in A53T- and E46K-expressing cells",
                                "plot data to evaluate α-synuclein prion infectivity",
                                "describe segregation of MSA samples from DLB and PD samples",
                                "test homogenates of amygdalae from MSA cases",
                                "report inability of MSA samples to infect α-syn140*E46K-YFP cells",
                                "describe tissue type independence of E46K mutation effect",
                                "introduce discussion section",
                                "discuss transmission of α-synuclein prions from human brains",
                                "discuss α-synuclein prion infectivity in TgM83+/− mice",
                                "discuss detergent-insoluble fractions and α-synuclein prion replication",
                                "discuss ultrastructural characterization of Lewy bodies",
                                "discuss enhancing α-synuclein prion infectivity",
                                "discuss structures of α-synuclein prions",
                                "discuss PMCA and RT-QuIC assays",
                                "discuss molecular basis of PD, DLB, and MSA",
                                "discuss therapeutic opportunities"
                            ],
                            "num_characters": 19757,
                            "outline_medium": [
                                "introduce examples",
                                "enhance precipitation of MSA prions",
                                "describe infectivity of MSA prions",
                                "describe infectivity of PD and DLB prions",
                                "compare infectivity of MSA, PD, and DLB prions",
                                "describe α-synuclein prion infectivity in PD and DLB brain specimens",
                                "distinguish prion strains using α-synuclein (E46K)",
                                "describe infectivity of MSA prions in different cell lines",
                                "compare infectivity of MSA prions in different cell lines",
                                "describe infectivity of PD and DLB prions in different cell lines",
                                "compare infectivity of PD and DLB prions in different cell lines",
                                "evaluate α-synuclein prion infectivity in two cell lines",
                                "plot data to visualize infectivity",
                                "discuss inability of MSA samples to infect E46K-expressing cells",
                                "discuss transmission of α-synuclein prions from human brains",
                                "discuss α-synuclein prion infectivity in TgM83+/− mice",
                                "discuss detergent-insoluble fractions from MSA and PD homogenates",
                                "discuss structures of α-synuclein prions",
                                "discuss molecular basis of PD, DLB, and MSA"
                            ],
                            "outline_short": [
                                "introduce enhanced precipitation of MSA prions",
                                "describe infectivity of MSA prions in HEK cells",
                                "describe infectivity of PD and DLB prions in HEK cells",
                                "distinguish prion strains using E46K mutation",
                                "validate YFP tag in measuring prion infectivity",
                                "test PK/PTA precipitation on PD and DLB samples",
                                "analyze infectivity of PD and DLB samples in E46K cells",
                                "discuss implications of results on α-synuclein prion transmission",
                                "summarize molecular basis of PD, DLB, and MSA"
                            ]
                        }
                    ],
                    "outline_long": [
                        "disclaim limitations of embodiments",
                        "define terminology",
                        "describe range of values",
                        "summarize technical terms",
                        "cite publications",
                        "clarify singular and plural forms",
                        "discuss prior art",
                        "introduce method of determining prion strain",
                        "describe sample preparation",
                        "outline prion precipitation and concentration",
                        "detail cell culture and infectivity determination",
                        "relate infectivity to prion strain",
                        "summarize method of determining prion strain"
                    ],
                    "num_characters": 6939,
                    "outline_medium": [
                        "clarify scope of invention",
                        "define terms and ranges",
                        "describe prior art and references",
                        "introduce method of determining prion strain",
                        "detail steps of method",
                        "summarize method of determining prion strain"
                    ],
                    "outline_short": [
                        "define scope of invention",
                        "describe method of determining α-synuclein prion strain",
                        "provide specific embodiment of method"
                    ]
                },
                {
                    "title": "Materials and Methods",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Human Tissue Samples",
                            "paragraphs": [
                                "Frozen tissue samples were obtained from the Parkinson's UK Brain Bank at Imperial College London, the neuropathology core of the Massachusetts Alzheimer's Disease Research Center (ADRC), and the Banner Sun Health Research Institute's Brain and Body Donation Program. Clinical reports were provided for most samples and summarized in Table 2 of FIG. 9."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "obtain and process human tissue samples"
                            ],
                            "num_characters": 352,
                            "outline_medium": [
                                "obtain and process human tissue samples"
                            ],
                            "outline_short": [
                                "obtain and process human tissue samples"
                            ]
                        },
                        {
                            "title": "Patient Neuropathology",
                            "paragraphs": [
                                "MSA and PD patient samples obtained from the Parkinson's UK Brain Bank were bisected, with one hemisphere fixed in 10% (vol/vol) buffered formalin for diagnostic workup and the other coronally sliced, photographed on a grid, and then rapidly frozen. Blocks of tissue from 20 key anatomical areas were sampled from the fixed hemisphere. Sections from each area were stained with hematoxylin & eosin (H&E) and Luxol fast blue (LFB). For assessment and staging of neurodegenerative pathology, appropriate sections were stained with antibodies against α-synuclein, amyloid-β, tau, and p62. MSA was diagnosed based on the presence of oligodendroglial α-synuclein inclusions. PD cases were staged according to Braak criteria (46).",
                                "MSA patient samples obtained from the Massachusetts ADRC were bisected longitudinally. One-half was coronally sectioned and rapidly frozen, and the other one-half was fixed in 10% (vol/vol) neutral buffered formalin and then sectioned. Histological evaluation was performed on a set of blocked regions representative for a variety of neurodegenerative diseases. All blocks were stained with LFB and H&E. On selected blocks, immunohistochemical analysis, including α-synuclein (mouse monoclonal antibody LB509; Life Technologies 18-0215), amyloid-β, and phosphorylated tau, was performed. The neuropathological diagnosis of MSA required the presence of GCIs (47).",
                                "Negative control, PD, and DLB tissues from the Banner Sun Health Research Institute were analyzed by complete gross and microscopic pathological examination using standard Arizona Study of Aging and Neurodegenerative Disorders methods and included pathologist assessment of both brain and peripheral organs (48)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "diagnose MSA and PD patient samples",
                                "perform histological evaluation",
                                "analyze neuropathological diagnosis"
                            ],
                            "num_characters": 1702,
                            "outline_medium": [
                                "diagnose and stage neurodegenerative diseases"
                            ],
                            "outline_short": [
                                "diagnose and stage neurodegenerative diseases"
                            ]
                        },
                        {
                            "title": "Tissue Homogenization and Preparation",
                            "paragraphs": [
                                "Brains were homogenized in calcium- and magnesium-free phosphate buffered saline (PBS) and then diluted to 10% (wt/vol). For CBH, samples were centrifuged at low speed (1,000×g) to pellet cellular debris and the supernatant was collected; these samples were designated CBH. For PK/PTA preps, crude brain homogenates were combined with sarkosyl to a final concentration of 2% (vol/vol) and benzonase to a final concentration of 150 U/mL and incubated at 37° C. for 2 h on a shaking incubator. PK was then added to the homogenates to 20 μg/mL and incubated for 1 h at 37° C. with agitation. To stop the PK reaction, phenylmethylsulfonyl fluoride was added to a final concentration of 1 mM. A 10% (wt/vol) solution of PTA at pH 7.0 was then added to a final concentration of 2% (vol/vol) to the sample and incubated overnight with shaking at 37° C. Samples were then centrifuged for 30 min at 16,000×g, and the pellet was resuspended in PBS."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare brain homogenates and PK/PTA preps"
                            ],
                            "num_characters": 938,
                            "outline_medium": [
                                "prepare brain homogenates for aggregation assays"
                            ],
                            "outline_short": [
                                "prepare brain homogenates for aggregation assays"
                            ]
                        },
                        {
                            "title": "Cell Lines and Aggregation Assays",
                            "paragraphs": [
                                "Generation of HEK293T cell lines stably expressing α-syn140*WT-YFP, α-syn140*A53T-YFP, α-syn140*A30P-YFP, and α-syn140*E46K-YFP was performed as previously described (20). For generation of the untagged α-syn140*A53T-expressing HEK293T cell line used for HTRF, the same methods were used as described previously for generation of the other α-synuclein expressing cell lines (20). All α-synuclein expressing HEK293T cells were cultured and plated in 1× Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% (vol/vol) fetal bovine serum (FBS), 50 units/mL penicillin, and 50 μg/mL streptomycin (Thermo Fisher Scientific). Cells were maintained in a humidified atmosphere of 5% CO2 at 37° C. Infectivity assays were performed by plating cell lines at cell densities of between 3,500 and 4,500 cells per well in a 384-well plate with black polystyrene walls (Greiner) with 0.012 μg per well of Hoechst 33342. Plates were returned to the incubator for 2 to 4 h. Samples were diluted in Dulbecco's PBS (DPBS), mixed with an equal volume of Lipofectamine 2000 (Thermo Fisher Scientific) diluted in DPBS (3% vol/vol), and incubated for 1.5 h at room temperature. These samples were then added to the cells in six replicate wells (0.25% vol/vol final concentration of CBH and PK/PTA samples and 0.2% vol/vol final concentration of Lipofectamine 2000) and incubated for 3 d at 37° C. in a humidified atmosphere of 5% CO2. Individual plates were imaged using the IN Cell Analyzer 6000 cell-imaging system (GE Healthcare). DAPI and fluorescein isothiocyanate (FITC) channels were used to collect two images from five different regions in each well. Raw images were analyzed with the IN Cell Developer software (GE Healthcare), using an algorithm designed to detect intracellular aggregates using pixel intensity and size thresholds in living cells, and quantified as % of cells with aggregates. To assess α-synuclein aggregation in the α-syn140*A53T-untagged cell line, the Alpha Synuclein Aggregation Kit was used as suggested by the manufacturer (Perkin-Elmer) and read on a PHERAstar FSX multimode plate reader (BMG LABTECH). The HTRF ratio was calculated by dividing the 665-nm signal by the 620-nm signal and multiplying by 10,000."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "generate HEK293T cell lines",
                                "perform aggregation assays",
                                "analyze α-synuclein aggregation",
                                "quantify % cells with aggregates"
                            ],
                            "num_characters": 2232,
                            "outline_medium": [
                                "generate and maintain cell lines expressing α-synuclein",
                                "perform aggregation assays using cell lines and brain homogenates"
                            ],
                            "outline_short": [
                                "generate and use cell lines for aggregation assays"
                            ]
                        },
                        {
                            "title": "Statistical Analysis",
                            "paragraphs": [
                                "Cell infection data are presented as mean±SEM. Values represent averages of five images collected from each well of a 384-well plate. Technical replicates for each patient sample were averaged across six wells. Independent two-sample Student's t tests were used to compare between groups (negative control, MSA, PD, and DLB) (FIGS. 2-4). For data in FIG. 5, a linear mixed model of the outcome, % cells with aggregates, was used, utilizing a group by cell line interaction for the fixed effects via a cell-means model and random subject effect to account for up to six replicates per human patient sample. Kenward Rogers denominator degrees of freedom were used. Using estimate statements in SAS version 9.4, we compared within groups (negative control, MSA, PD, and DLB) across cell lines and compared each disease group to the negative controls for the E46K cell line. We assessed the plot of the residuals versus predicted and determined that transformation did not appear to improve model fit. Two-sided p-values <0.05 were considered statistically significant.",
                                "The preceding merely illustrates the principles of the invention. It will be appreciated that those skilled in the art will be able to devise various arrangements and steps which, although not explicitly described or shown herein, embody the principles of the invention and are included within its spirit and scope. Furthermore, all examples and conditional language recited herein are principally intended to aid the reader in understanding the principles of the invention and the concepts contributed by the inventors to furthering the art and are to be construed as being without limitation to such specifically recited examples and conditions. Moreover, all statements herein reciting principles, aspects, and embodiments of the invention as well as specific examples thereof, are intended to encompass both structural and functional equivalents thereof. Additionally, it is intended that such equivalents include both currently known equivalents and equivalents developed in the future, i.e., any elements developed that perform the same function, regardless of structure. The scope of the present invention, therefore, is not intended to be limited to the exemplary embodiments shown and described herein. Rather, the scope and spirit of present invention is embodied by the appended claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "present cell infection data",
                                "perform two-sample Student's t tests",
                                "use linear mixed model for data analysis",
                                "compare within groups and to negative controls"
                            ],
                            "num_characters": 2364,
                            "outline_medium": [
                                "analyze cell infection data using t-tests and linear mixed models",
                                "compare disease groups and controls using statistical models"
                            ],
                            "outline_short": [
                                "analyze cell infection data and compare between groups"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of determining strain of a α-synuclein prion, comprising:\ncontacting a sample with cultured HEK cells expressing an A53T or E46K point mutation;\ncontinuing to culture the cells in the presence of the sample;\ndetermining infectivity of the cells; and\nrelating infectivity level to α-synuclein strain.",
        "2. The method of claim 1, wherein the sample is brain homogenate.",
        "3. The method of claim 1, wherein the brain homogenate is treated with detergent.",
        "4. The method of claim 1, wherein the brain homogenate is treated with detergent to allow limited proteolysis followed by polyoxometalate precipitation of the prions.",
        "5. A method of determining strain of a α-synuclein prion, comprising:\nobtaining a sample of brain tissue\nhomogenizing the brain tissue sample to obtain homogenized brain tissue;\ntreating the homogenized brain tissue with detergent to obtain limited proteolysis and obtain a treated sample;\nprecipitating prions from the treated sample,\ncontacting the precipitated prions with cultured HEK cells expressing an E46K point mutation,\ncontinuing to culture the cells in the presence of the precipitated prions;\ndetermining infectivity of the cells with precipitated prions; and\nrelating infectivity level to α-synuclein strain.",
        "6. The method of claim 5, further, comprising:\nrelating the α-synuclein strain to a progressive neurodegenerative disease (ND).",
        "7. The method of claim 6, wherein the ND is selected from the group consisting of Parkinson's disease (PD), dementia with Lewy bodies (DLB), and multiple system atrophy (MSA).",
        "8. A method of verifying the veracity of data collected in a clinical trial, comprising:\ncarrying out a clinical trial on patients suspected of having a particular neurological disease wherein the patients are administered a drug;\nobtaining brain samples from patients in the trial after the patients are deceased;\npreforming the method of claim 1 on the brain samples obtained;\ndetermining if a patient in the trial actually had a neurological disease that the patient was believed to have and for which the drug was intended to treat.",
        "9. The method of claim 8, further comprising:\nrecalculating clinical trial data by deleting data relating to patients found not to have a neurological disease that the patient was believed to have and for which the drug was intended to treat.",
        "10. A method of determining strain of a α-synuclein prion, comprising:\nobtaining a sample of brain tissue;\nhomogenizing the brain tissue sample in saline buffer to obtain 10% (w/v) homogenized brain tissue;\ntreating the homogenized brain tissue with sarkosyl detergent to a final concentration of 2% to obtain a treated sample;\ntreating the sample with benzonase to a final concentration of 150 Units/mL and then incubating the sample at 37° C. with shaking for 2 hours;\ndigest the proteins in the sample by treating it with proteinase K (PK) to a final concentration of 20 μg/mL and then incubating for 1 hour at 37° C.;\nhalting digestion with the addition of PMSF to a final concentration of 1 mM;\nprecipitating α-synuclein prions from the treated sample by adding phosphotungstic acid (PTA) to a concentration of 2% followed by incubating them at 37° C. overnight (14-18 hours),\nconcentrating the prions by centrifugation at 16,100×g for 1 hour and 15 minutes, removing the supernatant, and then resuspending the pellet by adding in 10% of the initial starting volume with DPBS and pipetting;\ncontacting the precipitated prions with cultured HEK cells expressing an A53T or E46K point mutation;\ncontinuing to culture the cells in the presence of the precipitated prions;\ndetermining infectivity of the cells with precipitated prions; and\nrelating infectivity level to α-synuclein strain.",
        "11. A method of determining strain of a α-synuclein prion, comprising:\nobtaining a sample of brain tissue;\nhomogenizing the brain tissue sample in saline buffer to obtain 10% (w/v) plus or minus 2% homogenized brain tissue;\ntreating the homogenized brain tissue with sarkosyl detergent to a final concentration in a range of 1% to 3% to obtain a treated sample;\ntreating the sample with benzonase to a final concentration of 150 Units/mL and then incubating the sample at 37° C. with shaking for 1 to 3 hours;\ndigest the proteins in the sample by treating it with proteinase K (PK) to a final concentration of 20 μg/mL plus or minus 2 μg/mL and then incubating for 0.5 to 2 hour at 37° C. plus or minus 3° C.;\nhalting digestion with the addition of PMSF to a final concentration of 1 mM plus or minus 0.2 mM;\nprecipitating α-synuclein prions from the treated sample by adding phosphotungstic acid (PTA) to a concentration of 2% followed by incubating them at 37° C. 12-20 hours),\nconcentrating the prions by centrifugation at 16,100×g for 1 hour and 15 minutes, plus or minus 15 minutes, removing the supernatant, and then resuspending the pellet by adding in 10% of the initial starting volume with DPBS and pipetting.\ncontacting the precipitated prions with cultured HEK cells expressing an A53T or E46K point mutation;\ncontinuing to culture the cells in the presence of the precipitated prions;\ndetermining infectivity of the cells with precipitated prions; and\nrelating infectivity level to α-synuclein strain."
    ]
}