{
    "id": "US20220243175",
    "authors": [
        "Kyeung Min Joo",
        "Hyun Nam"
    ],
    "title": "METHOD FOR ISOLATING AND CULTURING NEURAL STEM CELLS WITH HIGH EFFICIENCY",
    "date": "2019-01-30 00:00:00",
    "abstract": "The present invention relates to a method for isolating and culturing neural stem cells with high efficiency, which may shorten the time for isolation and culture by simplifying a method for isolating and culturing neural stem cells and may increase the acquisition yield of neural stem cells. The present invention provides a method for isolating and culturing neural stem cells with high efficiency, comprising the steps of adding brain tissue into an enzyme solution so as to subject the brain tissue to enzyme treatment; physically isolating cell clumps from the enzyme treated brain tissue by dividing the cell clumps according to size and removing impurities; and inoculating the cell clumps on a culture dish so as to subculture.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a method for isolating and culturing neural stem cells with high efficiency, which is able to shorten an isolation and culture time by simplifying a method of isolating and culturing neural stem cells, and increase the acquisition yield of neural stem cells."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce neural stem cell research"
                    ],
                    "num_characters": 291,
                    "outline_medium": [
                        "introduce neural stem cell research"
                    ],
                    "outline_short": [
                        "introduce neural stem cell research"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "Biotechnology for the 21st century has suggested the possibility of new solutions to food, environmental and health problems with human welfare as the final goal, and recently, technology using stem cells is emerging as a new chapter in treatment of incurable diseases. Previously, organ transplantation or gene therapy was suggested to treat human incurable diseases, but was not effectively put to practical use because of rejection, shortages in supply of organs, poor delivery of vector or lack of adequate therapeutic genes.",
                        "Accordingly, with the growing interest in stem cell research, it was recognized that pluripotent stem cells capable of forming all organs through proliferation and differentiation can fundamentally solve organ damage as well as treat many incurable diseases. Stem cells refer to cells that can differentiate into two or more types of cells with self-renewability, and classified into totipotent stem cells, pluripotent stem cells and multipotent stem cells. Many scientists have suggested the applicability of stem cells in various ways including the treatment of incurable diseases such as Parkinson's disease, various types of cancer, diabetes and spinal cord injury, as well as regeneration of almost all human organs.",
                        "Neural stem cells, that is stem cells that can differentiate into neurons, astrocytes and oligodendrocytes, were first found in the rodent, mice. Afterward, it was known that neural stem cells are present in the human brain, and involved in brain regeneration throughout one's life. Therefore, for treatment of degenerative neurological diseases, recently, the development of a therapeutic agent using neural stem cells is attracting attention.",
                        "In the beginning of human neural stem cell research, neural stem cells were isolated from a fetal brain and cultured. Based on those researches, recently, clinical trials for treating stroke or spinal cord injury have been conducted. In addition, research on isolating and culturing neural stem cells from embryonic stem cells has been undertaken. Recently, a method for differentiation into neural stem cells from induced pluripotent stem (iPS) cells has been studied, and there is an increasing expectation of culture of neural stem cells that enable autologous transplantation.",
                        "However, neural stem cells derived from a fetus or embryonic stem cells have ethical problems and concerns about tumorigenic safety. In addition, since iPS cell-derived neural stem cells also have problems with tumorigenic safety, for clinical application of these stem cells, there was a need for verification of biological safety. In previous research, for isolation and culture of neural stem cells, a method for isolating and culturing single cells from brain tissue has been widely used.",
                        "However, a method of isolating and culturing neural stem cells, which includes single cell isolation using Percoll, took a long time, and has a problem with the acquisition yield of neural stem cells."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate stem cell research",
                        "describe limitations of organ transplantation",
                        "describe limitations of gene therapy",
                        "introduce pluripotent stem cells",
                        "introduce neural stem cells"
                    ],
                    "num_characters": 2976,
                    "outline_medium": [
                        "motivate stem cell research",
                        "limitations of previous neural stem cell isolation methods"
                    ],
                    "outline_short": [
                        "motivate stem cell research"
                    ]
                },
                {
                    "title": "DISCLOSURE",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Technical Problem",
                            "paragraphs": [
                                "The present invention provides a method for isolating and culturing neural stem cells with high efficiency, which is able to shorten an isolation and culture time by simplifying a method of isolating and culturing neural stem cells, and increase the acquisition yield of neural stem cells.",
                                "However, technical problems to be solved in the present invention are not limited to the above-described problems, and other problems which are not described herein will be fully understood by those of ordinary skill in the art from the following descriptions."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe limitations of current neural stem cell isolation methods"
                            ],
                            "num_characters": 551,
                            "outline_medium": [
                                "limitations of previous neural stem cell isolation methods"
                            ],
                            "outline_short": [
                                "limitations of current neural stem cell isolation methods"
                            ]
                        },
                        {
                            "title": "Technical Solution",
                            "paragraphs": [
                                "In one aspect, the present invention provides a method for isolating and culturing neural stem cells with high efficiency, which includes: placing brain tissue in an enzyme solution for enzyme treatment; physically dissociating cell clumps from enzyme-treated brain tissue; separating the cell clumps by size and removing impurities; and performing subculture by seeding the cell clumps in a culture dish.",
                                "In addition, the enzyme solution may include papain; DNase I; and D, L-cysteine.",
                                "In addition, the cell clumps may have a size of 40 to 70 μm, or 70 to 100 μm. In addition, the brain tissue may be adult brain tissue, and the method for isolating and culturing neural stem cells may not include single cell isolation using Percoll."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce clump culture method"
                            ],
                            "num_characters": 737,
                            "outline_medium": [
                                "describe clump culture method"
                            ],
                            "outline_short": [
                                "describe clump culture method"
                            ]
                        },
                        {
                            "title": "Advantageous Effects",
                            "paragraphs": [
                                "A method for isolating and culturing neural stem cells with high efficiency according to the present invention can shorten an isolation and culture time by simplifying a method of isolating and culturing neural stem cells, and increase the acquisition yield of neural stem cells. In addition, cell viability can be increased by shortening of an isolation and culture time, and a large number of cells can be acquired in a short time, thereby having an advantage of increasing the success rate of culturing neural stem cells."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe advantages of clump culture method"
                            ],
                            "num_characters": 524,
                            "outline_medium": [
                                "summarize benefits of clump culture method"
                            ],
                            "outline_short": [
                                "summarize benefits of clump culture method"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "MODES OF THE INVENTION",
                    "paragraphs": [
                        "The present invention is directed to providing a method for isolating and culturing neural stem cells with high efficiency, which is able to shorten an isolation and culture time by simplifying a method of isolating and culturing neural stem cells, and increase the acquisition yield of neural stem cells.",
                        "In one embodiment of the present invention, as a result of culturing neural stem cells according to the method of the present invention (clump culture), compared with using conventional Percoll method, it is confirmed that more neural stem cells per the same brain tissue weight may be obtained (see Example 1).",
                        "In another embodiment of the present invention, it is confirmed that the neural stem cells according to the method of the present invention (clump culture) maintain neural differentiation ability (see Example 3).",
                        "In still another embodiment of the present invention, as a result of separating and culturing clumps by size, it is confirmed that Clump type II (70 to 100 μm) exhibits the best result of the acquisition efficiency of neural stem cells (see Examples 4 and 5).",
                        "In yet another embodiment of the present invention, when Clump type II is cultured according to the method of the present invention (clump culture), it is confirmed that the time for first subculture is shortened, a cell morphology is normal, neural differentiation ability is also normal, and thus stem cell properties are well maintained (see Example 6).",
                        "In yet another embodiment of the present invention, it is confirmed that neural stem cells derived from Clump type II have angiogenic ability (see Example 7).",
                        "Hereinafter, the present invention will be described in detail.",
                        "The present invention provides a method for isolating and culturing neural stem cells with high efficiency, which includes: placing brain tissue in an enzyme solution for enzyme treatment; physically dissociating cell clumps from enzyme-treated brain tissue; separating the cell clumps by size and removing impurities; and performing subculture by seeding the cell clumps in a culture dish.",
                        "The method of isolating and culturing neural stem cells, including isolating single cells using Percoll takes a long time, and has a problem in the acquisition yield of neural stem cells. Therefore, the inventors confirmed through an experiment, in the case of introducing a process of separating the cells by clumps and not including a process of isolating single cells using Percoll, an isolation and culture time was shortened, and the acquisition yield of neural stem cells was able to increase, and thus the present invention was completed.",
                        "According to one aspect of the present invention, a method for isolating and culturing neural stem cells with high efficiency, which includes: placing brain tissue in an enzyme solution for enzyme treatment; physically dissociating cell clumps from enzyme-treated brain tissue; separating the cell clumps by size and removing impurities; and performing subculture by seeding the cell clumps in a culture dish, is provided.",
                        "The enzyme solution is not particularly limited, and may include papain; DNase I; and D, L-cysteine.",
                        "In addition, after dissociation from brain tissue, the cell clumps may be further separated by size using a mesh. The cell clumps may have a size of 40 to 70 μm, or 70 to 100 μm.",
                        "Moreover, the brain tissue is preferably adult brain tissue.",
                        "Meanwhile, as described above, the method for isolating and culturing neural stem cells with high efficiency according to the present invention does not include isolating single cells using Percoll. The method for isolating and culturing neural stem cells according to the present invention has advantages of shortening an isolation and culture time by simplifying a method for isolating and culturing neural stem cells by excluding single cell isolation using Percoll, increasing the acquisition yield of neural stem cells, increasing cell viability due to the shortening of an isolation and culture time, and acquiring a large number of cells in a short time, thereby increasing the success rate of culturing neural stem cells.",
                        "Hereinafter, to help understanding the present invention, exemplary examples will be suggested. However, the following examples are merely provided to more easily understand the present invention, and not to limit the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe clump culture method",
                        "compare clump culture method with Percoll method",
                        "describe neural differentiation ability of clump culture method",
                        "describe size-dependent separation of clumps",
                        "compare efficiency of clump types I to IV",
                        "describe culture time and neural differentiation ability of Clump type II",
                        "describe angiogenic effects of neural stem cells derived from Clump type II",
                        "summarize advantages of clump culture method"
                    ],
                    "num_characters": 4352,
                    "outline_medium": [
                        "describe clump culture method",
                        "summarize results of clump culture method",
                        "describe separation of clumps by size",
                        "summarize results of separating clumps by size"
                    ],
                    "outline_short": [
                        "describe clump culture method",
                        "summarize advantages of clump culture method"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1. Primary Culture of Neural Stem Cells",
                            "paragraphs": [
                                "After measuring the weight of human brain tissue, washing was performed two to three times using phosphate-buffered saline (PBS). Following homogenization of the tissue to an appropriate size, the tissue was added to an enzyme solution (10 units/ml of papain, 0.1 mg/ml of DNase I and 4 mg/ml of D, L-cysteine), and then physically cut into smaller fragments using a blade and surgical scissors. After thirty minutes of treatment at 37° C., the resulting fragments were disrupted using a disposable pipette, filtered using a 70 μm mesh, and washing was then performed using PBS.",
                                "When Percoll was used, a Percoll solution was prepared by mixing 10-fold concentrated PBS and Percoll in a ratio of 1:9, 20 mL of a cell suspension and 10 mL of Percoll solution were mixed and centrifuged at 20,000 rpm and 18° C. to isolate cells from a cell layer, and the cells were then washed twice with PBS again, and cultured in a poly-L-omithine (PLO)-coated dish.",
                                "When reaching a confluency of 70 to 80%, the cells were detached using Accutase, and then subcultured. The number of cells and viability were calculated using a Tryphan Blue solution and a population doubling length (PDL) was measured, thereby plotting a cell growth curve, and morphologies of the isolated and cultured neural stem cells were observed under a microscope.",
                                "As a result, as shown in FIG. 2A, according to the isolation and culture method (clump culture), it was confirmed that a larger amount of neural stem cells per the same weight of brain tissue, compared with a method using Percoll, may be acquired, and as shown in FIG. 2B, according to the isolation and culture method (clump culture), it was confirmed that a cell growth is overall superior to that according to the conventional method using Percoll.",
                                "In addition, as shown in FIG. 3A, as a result of observing the cultured cells, it was also confirmed that cell morphologies of the isolation and culture method according to the present invention (clump culture), are similar to those of the conventional method using Percoll."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe primary culture of neural stem cells",
                                "compare clump culture method with Percoll method",
                                "describe cell growth curve",
                                "describe cell morphology"
                            ],
                            "num_characters": 2053,
                            "outline_medium": [
                                "describe primary culture method",
                                "summarize results of primary culture method"
                            ],
                            "outline_short": [
                                "describe primary culture of neural stem cells"
                            ]
                        },
                        {
                            "title": "Example 2. Induction of Differentiation Under Neural Differentiation Condition",
                            "paragraphs": [
                                "Neural stem cells were cultured to be a confluency of approximately 70 to 80%, and washed twice with PBS. Forty-eight hours after incubation under neural differentiation conditions such as DMEM/F12, 0.5% FBS, B27, 0.5 mM IBMX and P/S, the cells were fixed, followed by immunofluorescence staining."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe neural differentiation conditions"
                            ],
                            "num_characters": 297,
                            "outline_medium": [
                                "describe neural differentiation method"
                            ],
                            "outline_short": [
                                "describe neural differentiation conditions"
                            ]
                        },
                        {
                            "title": "Example 3. Immunostaining",
                            "paragraphs": [
                                "Neural stem cells were cultured on a PLO-coated 8-well slide chamber (Thermo) and fixed in 4% paraformaldehyde for 5 minutes. The cells were rinsed with 0.1% Triton-X 100-diluted PBS (0.1% PBST), treated with a blocking solution (5% normal goat serum and 5% normal donkey serum) for approximately 1 hour, and reacted overnight with a primary antibody. At next day, cells were washed twice with PBS, and treated with an Alexa488 or Alexa594-conjugated secondary antibody for 1 hour. After counter staining with DAPI and mounting, the cells were observed under a fluorescence microscope.",
                                "As a result, as shown in FIG. 3B, after differentiation of neural stem cells, it was confirmed that the expression of Nestin decreased and the expression of neuronal cells (Tuj1, MAP2) and astrocytes (GFAP) increased."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe immunostaining results"
                            ],
                            "num_characters": 804,
                            "outline_medium": [
                                "describe immunostaining method"
                            ],
                            "outline_short": [
                                "describe immunostaining results"
                            ]
                        },
                        {
                            "title": "Example 4. Size-Dependent Separation of Clumps and their Morphologies",
                            "paragraphs": [
                                "To find the optimal condition for a clump culture method, human brain tissue was treated with an enzyme solution, physically dissociated, and then filtered through various sizes of meshes, thereby separated clumps with specific rages of size (see FIG. 4A). The clumps were classified as type 1 to IV by size as shown below, and then observed under a microscope.\n\n\n- - Clump type I\\>100 μm\n  - 70 μm\\<Clump type II\\<100 μm\n  - 40 μm\\<Clump type III\\<70 μm\n  - Clump type IV\\<40 μm",
                                "As a result, as shown in FIG. 4B, separation into each type of clumps with uniform size was confirmed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe size-dependent separation of clumps"
                            ],
                            "num_characters": 583,
                            "outline_medium": [
                                "describe size-dependent separation method"
                            ],
                            "outline_short": [
                                "describe clump separation and morphology"
                            ]
                        },
                        {
                            "title": "Example 5. Comparison of Efficiency in Separation and Culture of Clump Types I to IV",
                            "paragraphs": [
                                "To compare isolation and culture efficiencies among Clump types I to IV, each type of clumps derived from two patients according to the method of Example 1 were cultured to confirm the number of colonies and observe colony morphology using a microscope.",
                                "As a result, as shown in FIGS. 5A and 5B, on both day 3 and day 6 of isolation and culture, the largest number of colonies were observed in Clump type II, confirming that the Clump type II has the best culture efficiency."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "compare efficiency of clump types I to IV"
                            ],
                            "num_characters": 476,
                            "outline_medium": [
                                "summarize results of comparing clump types"
                            ],
                            "outline_short": [
                                "compare clump culture efficiencies"
                            ]
                        },
                        {
                            "title": "Example 6. Confirmation of Culture Time for Subculture and Neural Differentiation Ability of Clump Type II",
                            "paragraphs": [
                                "To compare efficiencies between the case of culturing Clump type II by the method according to the present invention and the case of culturing single cells using Percoll, cells were cultured according to the method of Example 1 and then a growth curve was plotted, followed by observation of the morphologies of cells derived from Clump type II using a microscope.",
                                "In addition, to confirm whether neural stem cells derived from the Clump type II method maintain neural differentiation ability, after neural differentiation, immunofluorescence staining was used according to the method of Example 3.",
                                "As a result, as shown in FIG. 6A, it was confirmed that, in the case of Clump type II, the time for first subculture was shortened, the time to reach 109 cells was also shortened, and as shown in FIG. 6B, cell morphology was well maintained in subculture of Clump type II.",
                                "In addition, as a result of immunofluorescence staining, as shown in FIG. 6C, a undifferentiation marker, Nestin was strongly expressed before differentiation, but was scarcely observed after differentiation, and the expression of neuron markers, Tuj 1 and Map2, was not observed before differentiation, but observed after differentiation. An astrocyte marker, GFAP, was hardly observed before differentiation, but observed after differentiation.",
                                "This result means that the neural stem cells derived from Clump type II maintain neural stem cell characteristics."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe culture time and neural differentiation ability of Clump type II",
                                "describe immunofluorescence staining results"
                            ],
                            "num_characters": 1437,
                            "outline_medium": [
                                "summarize results of subculture and neural differentiation"
                            ],
                            "outline_short": [
                                "describe culture time and neural differentiation ability"
                            ]
                        },
                        {
                            "title": "Example 7. Confirmation of Angiogenic Effects of Neural Stem Cells Derived from Clump Type II",
                            "paragraphs": [
                                "Umbilical vein endothelial cells (HUVECs) were purchased from Promocell, and cultured using the manufacturer's exclusive medium. 1×106 of HUVECs and 1×106 of neural stem cells were mixed in 200 μL of phenol red-free Matrigel (BD), and subcutaneously transplanted into 4 to 6-week old Balbc-nu mice. After 3 to 4 days, Matrigel was removed, and then fixed with 4% PFA for 24 hours, followed by making a block. For histological analysis, hematoxylin & eosin (H&E) staining was performed. To stain new blood vessels generated in Matrigel, HUVECs and neural stem cells were subjected to immunofluorescence staining for CD31 and alpha-smooth muscle actin (a-SMA).",
                                "As a result, as shown in FIG. 7A, blood vessels were hardly formed by neural stem cells, but blood vessel formation was able to be confirmed when HUVECs and neural stem cells were mixed and transplanted. In addition, as shown in FIG. 7B, it was confirmed that the neural stem cells were located around a blood vessel, contributing to blood vessel formation.",
                                "It should be understood by those of ordinary skill in the art that the above description of the present invention is exemplary, and the exemplary embodiments disclosed herein can be easily modified into other specific forms without departing from the technical spirit or essential features of the present invention. Therefore, the exemplary embodiments described above should be interpreted as illustrative and not limited in any aspect."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe angiogenic effects of neural stem cells",
                                "describe histological analysis results"
                            ],
                            "num_characters": 1456,
                            "outline_medium": [
                                "summarize results of angiogenic effects"
                            ],
                            "outline_short": [
                                "describe angiogenic effects of neural stem cells"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "INDUSTRIAL APPLICABILITY",
                    "paragraphs": [
                        "A method for isolating and culturing neural stem cells with high efficiency according to the present invention may shorten an isolation and culture time by simplifying a method of isolating and culturing neural stem cells, and increase the yield of neural stem cells. In addition, the present invention has advantages of increasing cell viability due to the shortening of an isolation and culture time, and increasing the success rate of culture of neural stem cells by obtaining a large number of cells in a short time, and thus is expected to contribute to treatment of a central nervous system disease to achieve direct or indirect neural regeneration effects using neural stem cells. In addition, the present invention is expected to be also used in the fields related to direct or indirect neural regeneration by a protein or enzyme released from neural stem cells (purification of a conditioned medium, development of an exosome, etc.)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe industrial applicability of clump culture method"
                    ],
                    "num_characters": 942,
                    "outline_medium": [
                        "summarize industrial applicability of clump culture method"
                    ],
                    "outline_short": [
                        "describe industrial applicability of clump culture method"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for isolating and culturing neural stem cells with high efficiency, comprising:\nplacing brain tissue in an enzyme solution for enzyme treatment;\nphysically dissociating cell clumps from the enzyme-treated brain tissue;\nseparating the cell clumps by size and removing impurities; and\nperforming subculture by seeding the cell clumps in a culture dish.",
        "2. The method of claim 1, wherein the enzyme solution contains papain; DNase I; and D, L-cysteine.",
        "3. The method of claim 1, wherein the cell clump has a size of 70 to 100 μm.",
        "4. The method of claim 1, wherein the brain tissue is adult brain tissue.",
        "5. The method of claim 1, wherein the method of isolating and culturing neural stem cells does not comprise isolating single cells using Percoll."
    ]
}