{
    "id": "https://semopenalex.org/work/W2248517804",
    "authors": [
        "Alexander L. Gaeta",
        "Michal Lipson",
        "Yoshitomo Okawachi",
        "Mengjie Yu",
        "Aseema Mohanty",
        "Christopher T. Phare",
        "Jaime Cárdenas",
        "Austin G. Griffith",
        "Carl B. Poitras",
        "Ryan K. W. Lau",
        "Romy Fain",
        "Yoon Ho Daniel Lee"
    ],
    "title": "Silicon-chip mid-infrared frequency comb generation",
    "date": "2015-02-24",
    "abstract": "Optical frequency combs are a revolutionary light source for high-precision spectroscopy because of their narrow linewidths and precise frequency spacing. Generation of such combs in the mid-infrared spectral region (2–20 μm) is important for molecular gas detection owing to the presence of a large number of absorption lines in this wavelength regime. Microresonator-based frequency comb sources can provide a compact and robust platform for comb generation that can operate with relatively low optical powers. However, material and dispersion engineering limitations have prevented the realization of an on-chip integrated mid-infrared microresonator comb source. Here we demonstrate a complementary metal–oxide–semiconductor compatible platform for on-chip comb generation using silicon microresonators, and realize a broadband frequency comb spanning from 2.1 to 3.5 μm. This platform is compact and robust and offers the potential to be versatile for use outside the laboratory environment for applications such as real-time monitoring of atmospheric gas conditions. Optical frequency combs in the mid-infrared are required for molecular gas detection applications but their realization in compact microresonator-based platforms is challenging. Here, Griffith et al. demonstrate on-chip broadband comb generation on a silicon microresonator spanning from 2.1 to 3.5 μm.",
    "sections": [
        {
            "title": "Results",
            "paragraphs": [
                "Design and fabrication of silicon resonators. We overcome silicon's linear losses using a novel etchless fabrication process based on thermal oxidation to achieve a high-quality factor of 590,000 in a silicon microresonator at a wavelength of 2.6 mm. The silicon waveguide is defined in an etchless manner using thermal oxidation, instead of dry etching, to form the waveguide core 20,21 . We deposit low-pressure chemical vapour deposition silicon nitride on top of a 500-nm silicon-on-insulator wafer. The silicon nitride serves as an oxidation mask. We then pattern and etch only the silicon nitride, and then thermally oxidize the wafer. The silicon underneath the nitride mask does not oxidize, leaving the silicon waveguide core intact. This method avoids the roughness and absorption sites that can be introduced by reactive ion etching 22 . This method is particularly useful here, due to the need for a silicon slab for electrical integration. As the slab surface is never etched, we avoid the high losses typically associated with active silicon resonators. We characterize the resonator quality factor by sweeping a narrow linewidth source across the resonance, and measuring the transmission spectrum using a 10-MHz photodiode. The transmission spectrum is shown in Fig. 1b. The loaded quality factor is 220,000 and the intrinsic one is 590,000, which corresponds to a propagation loss of 0.7 dB cm À 1 . See Methods for full fabrication process.",
                "To enable broadband comb generation, we engineer the etchless waveguide geometry to have anomalous group velocity dispersion from 2.2 to 3 mm. The geometry of the silicon waveguide governs the bandwidth of the frequency comb as the waveguide cross-section determines its dispersion profile 9,23 . The simulated group velocity dispersion is shown in Fig. 2a. We use the commercial software Silvaco Athena to simulate the oxidation process, to obtain the waveguide profile. From repeated tests, we have found good agreement between the simulated waveguide profile and the actual etchless waveguide formed. The simulated bandwidth for a frequency comb generated in this geometry is shown in Fig. 2b, for 150 mW of optical power in the bus waveguide and an assumed 10 ps free-carrier lifetime. To simulate the spectral-temporal dynamics of the microresonator combs, we use a recently developed numerical approach 23,24 based on the Lugiato-Lefever equation 25,26 . Here we modify the method to take into account multi-photon absorption and the free-carrier dynamics on the generated optical spectra. This adds additional loss terms (free-carrier and 3PA) to the Lugiato-Lefever equation, as well as a term for the dispersive effects of the free-carriers. With the free-carrier population kept at low levels (10 ps lifetime),  Power (dBm)",
                "Figure 3 | Mid-infrared optical frequency comb generation from an etchless silicon microresonator. Broadband frequency comb generation from 2.1 to 3.5 mm in the etchless silicon micro-resonator. This frequency comb is generated with 150 mW of optical power in the bus waveguide, and with a 10-V reverse bias applied on the PIN junction. The frequency spacing of the comb is 127 GHz. Owing to the limited dynamic range of the optical spectrum analyser, the frequency comb was measured using a series of optical filters. simulations predict that generation of a coherent frequency comb in this geometry is possible (see Supplementary Note 1).",
                "To mitigate silicon's nonlinear loss, we embed the silicon microresonator in a reverse biased positive-intrinsic-negative (PIN) doped junction to sweep out carriers generated from threephoton absorption. Significant free-carriers accumulate when pumping a passive silicon waveguide with a CW laser, limited only by the natural free-carrier lifetime of the structure. Here, we counteract the carrier generation while using a CW pump by extracting the generated carriers using a PIN junction operated in reverse bias 27 . The PIN junction prevents the electrical injection of carriers into the waveguide while allowing generated free carriers to be swept out-with effective free-carrier lifetimes demonstrated as short as 12 ps (ref. 28).",
                "Generation of silicon mid-infrared frequency comb. We demonstrate the generation of an optical frequency comb between 2.1 and 3.5 mm under reverse bias conditions. We use as our source an Argos Model 2400 CW optical parametric oscillator, which is tunable from 2,500 to 3,200 nm with a 100-kHz linewidth. We couple 1.2 W of optical power at 2.59 mm into a lens, which focuses the light into a silicon nanotaper on the chip. The input coupling loss is roughly 9 dB, leading to 150 mW of optical power coupled into the bus waveguide on the chip. By tuning into resonance from the short wavelength side, we achieve a soft thermal lock 29 , where cavity heating is compensated by diffusive cooling to maintain constant power in the resonator. Once on resonance, we extract 2.7 mA of current, using 10 V of reverse bias applied to the PIN junction. This relatively high current is an indication that three-photon absorption is significant at these power levels. We collect the output light from the nanotaper using another lens, and couple this light to a Fourier transform infrared spectrometer (FTIR). We use a Thorlabs OSA205 FTIR for our measurements. The generated frequency comb has a uniform line spacing of 127 ± 2 GHz, well below the 7.5-GHz resolution limit of the FTIR. This corresponds well with the expected free spectral range of the resonator. We measure an oscillation threshold with a low power of 3.1±0.6 mW in the bus waveguide, consistent with a simulation predicted threshold on the order of 10 mW. To resolve the full extent of the frequency comb and overcome the limited dynamic range for the FTIR, we filter the output lines using a series of optical bandpass filters. These filters attenuate the pump and the central part of the comb, allowing us to reach the noise floor of the FTIR. The comb spectrum as shown in Fig. 3 is then corrected for the spectral profile of the filters."
            ],
            "subsections": [
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "We observe a strong influence on the comb spectral shape from the voltage applied to the diode, indicating that control of the carrier population through the PIN diode is critical for broadband comb generation. Without carrier extraction, frequency comb generation is limited by the natural free-carrier lifetime of the waveguide-which we measured to be 5.23±0.83 ns. See Methods for details. To test the effect of carrier extraction, we tune into resonance and fix the wavelength of our pump. At this detuning with the PIN completely off, only a few comb lines are generated above the experimental noise floor, as shown in Fig. 4a. The broad peaks at 2,510 and 2,685 nm are artefacts of the FTIR. By increasing the voltage, we find that we can dramatically increase the number of comb lines being generated: the number of comb lines above the noise floor increases from a few to hundreds, as seen in Fig. 4b. Here we can see that the initial comb lines have cascaded, showing the formation of minicombs every 50 nm. At higher voltages, these will fill in completely (see Fig. 3).",
                        "In summary, we have demonstrated an on-chip integrated mid-infrared frequency comb source using an etchless silicon microresonator and demonstrated parametric oscillation in a silicon platform. We have shown electrical control of the frequency comb profile by varying the carrier extraction voltage. The etchless silicon microresonator comb source operates with low pump power well within the typical output of semiconductor laser diodes making it compatible with on-chip integration of the pump laser. An important next step is to experimentally investigate the noise and coherence properties of the generated spectra 30,31 , as well as the effect of free-carrier population on those properties. This platform enables a versatile and straightforward source for mid-infrared gas spectroscopy and opens the door for compact and robust mid-infrared gas sensors. The ability to achieve comb generation in an integrated platform will enable practical realization of completely integrated mid-infrared comb-based spectrometers usable in a myriad of environments."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Methods",
            "paragraphs": [
                "Device fabrication. A thermal oxidation-based 'etchless' fabrication process was used to fabricate the devices. Using a commercial silicon-on-insulator wafer with a 500-nm silicon layer and a 3-mm buried oxide, 200 nm of silicon nitride was deposited using low-pressure chemical vapour deposition. Electron beam lithography was used to pattern the nitride layer, using ma-N-2405 electron-beam resist. The silicon nitride mask was patterned 1.4 mm for the waveguide layer. The ring resonator is 100 mm bending radius, with a 1.2-mm-long straight section at the coupling region. The gap between the waveguide and ring is 500 nm. After exposure and development, the silicon nitride was etched in fluorine chemistry. The wafer was then thermally oxidized at 1,200 °C to form the etchless waveguide structure. The wafer was oxidized for 20, 50 and 60 min of dry, wet and dry oxidation, respectively. The slab in the taper region was then etched away. The taper was patterned to be 350 nm wide. The wafer was then clad with 2 mm of plasma-enhanced chemical vapour deposition silicon dioxide. The oxide was then etched away next to the waveguides, and then the slab was doped with boron and phosphorous on either side to form a PIN diode. Finally, the wafer was metalized, and wires were patterned and etched.",
                "Free-carrier lifetime measurement. For carrier lifetime measurements, we perform pump-probe experiments with a counter-propagating pulsed pump and CW probe. An Erbium-doped fibre laser (1,550 nm, 500 fs full-width half-maximum) is amplified to a peak power of B200 W in an erbium-doped fibre amplifier, then coupled via a circulator into one facet of the chip. A CW probe (1,575 nm) is coupled into the opposite facet and appears on the third port of the circulator, isolated from the pump. Neither laser overlaps with a ring resonance; we measure only the bus waveguide. We further improve probe isolation by wavelength filtering the third port output with a grating filter, then route this fibre to an optical sampling oscilloscope. The oscilloscope is triggered off the pump laser's fast sampling photodiode, giving us a time-domain measurement of the transmission of the waveguide after strong pump excitation. Absorption increases sharply when the pump-generated free-carriers flood the waveguide, then exponentially decreases as they recombine. We take the time constant of this exponential to be the free-carrier lifetime."
            ],
            "subsections": [
                {
                    "title": "Acknowledgements",
                    "paragraphs": [
                        "The devices were fabricated at the Cornell NanoScale Science and Technology Facility. We gratefully acknowledge support from DARPA for award # W31P4Q-13-1-0016. We also gratefully acknowledge support from AFOSR for award # FA9550-12-1-0377 supervised by Dr. Enrique Parra. This work made use of the Cornell Center for Materials Research Shared Facilities, which are supported through the NSF MRSEC program (DMR-1120296). A.G.G. acknowledges the National Defense Science and Engineering Graduate Fellowship (NDSEG) for funding."
                    ],
                    "subsections": []
                },
                {
                    "title": "Additional information",
                    "paragraphs": [
                        "Supplementary Information accompanies this paper at http://www.nature.com/ naturecommunications Competing financial interests: The authors declare no competing financial interest. "
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}