{
    "id": "https://semopenalex.org/work/W2063060874",
    "authors": [
        "Mark G. Raizen",
        "Bruce G. Klappauf"
    ],
    "title": "Magnetically activated and guided isotope separation",
    "date": "2012-02-28",
    "abstract": "We propose a general method for efficient isotope separation. The principle of operation is based on an irreversible change of the mass-to-magnetic moment ratio of a particular isotope in an effusive atomic beam, followed by magnetic guiding. We show that scalability is feasible with this method. The application of this method towards production of highly enriched Li-7 for the nuclear industry is analyzed in detail, and extension to other elements is discussed.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "The world relies today on enriched isotopes for medicine, basic science and energy, and the need will only grow in the future. The inherent challenge of isotope separation is that the chemical and physical properties of the different isotopes of a particular atom are almost identical. Two 1 Author to whom any correspondence should be addressed.",
                "New Journal of Physics 14 (2012) 023059 2 established methods of isotope separation are gaseous diffusion and the ultra-centrifuge [1][2][3]. These methods require many stages of enrichment, and are only suitable for a few elements that are in gas phase near room temperature, or have stable molecular compounds with that property. Isotope separation is also accomplished with the Calutron, invented by Ernest Lawrence in the 1930s [4]. This method is general and has high isotopic selectivity, but is very inefficient due to the low probability of electron-bombardment ionization. Later, laser isotope separation (LIS) was proposed [5]. In recent years isotope separation by laser ionization (AVLIS) has been developed [6,7]. This approach is highly selective but requires multiple (typically three) high-power pulsed lasers for efficient ionization. Another laser-based method, SILEX [8], relies on molecular excitation, and similarly requires high-power lasers. A lower power laser isotope enrichment (LIE) method was also proposed, but was not demonstrated to produce sufficient quantities or levels of enrichment [9,10].",
                "In an earlier paper [11], we proposed an improved approach for isotope separation based on scattering of one or a few photons per atom, followed by a more effective magnetic separation. This method, single-photon atomic sorting, can be viewed as a variation of Maxwell's demon. In this case, the demon acts like the historic pointsman who was responsible for diverting the tracks for each passing train. The atomic pointsman can similarly divert atoms of a desired isotope to a different direction than the rest. In our earlier proposal, the starting point was a supersonic beam, providing a well-collimated source. The limiting factor for scaling up the flux to industrial quantities is the requirement to pump away the inert carrier gas.",
                "In this paper, we propose a significant variation of the earlier work, eliminating the need for a supersonic beam and providing a realistic approach to scalable and efficient isotope separation. We call this method magnetically activated and guided isotope separation (MAGIS). We illustrate this approach with simulations for the case of highly enriched Li-7, which is currently used in nuclear reactor cooling water. The removal of Li-6 is essential due to its decay to tritium following neutron capture and the formation of tritiated water, a serious environmental hazard. The current method for Li-7 separation is the column exchange method (COLEX) which uses very large quantities of mercury, a highly-toxic heavy metal. An efficient and 'green' method for 7 Li separation that can reach the desired level of enrichment is therefore important [12]. We conclude the paper with a discussion of the applicability of this method to isotopes of other elements."
            ],
            "subsections": []
        },
        {
            "title": "General description of method",
            "paragraphs": [
                "The method has three main steps: (i) the source, which generates the stream of atoms; (ii) the state preparation, which prepares the stream of atoms into isotopically selected states that allows magnetic separation; and (iii) the guiding, which separates the prepared atoms into trajectories that have modified isotopic abundances. All of this will take place in a large highvacuum chamber maintained at a background pressure low enough to ensure that collisions with background gas will not deflect the target atoms from their desired trajectories through the apparatus. This pressure should be below 10 -4 Pa, which can be easily achieved by state of the art vacuum pumps. This method can be scaled up in parallel with multiple chambers. Atoms that do not enter the guides can be collected on a surface for reuse, or reflowed back to the source depending on the element. "
            ],
            "subsections": [
                {
                    "title": "The source",
                    "paragraphs": [
                        "The starting point is to create a flowing stream of neutral atoms of a particular element. An open crucible will be refilled with the pure element (the feedstock) without having to open the vacuum chamber. The crucible should be made from a material that can be heated to a high temperature and does not react chemically with the atoms. Examples include tungsten, tantalum, graphite and possibly even stainless steel. For very high temperature elements the crucible can be heated by a non-contact method like RF induction heating, or an electron beam. These methods can reach the required temperatures, typically in the range of 1000-3000 K. In the simplest configuration, the atomic-phase vapor emitted by the heated crucible will emanate in all directions, limited to the half-plane above the crucible (more complicated crucible forms may narrow the angular distribution). A hemispherical chamber will divide the flux into many outgoing guides, so as to maximize the useful flux from a single oven (figure 1).",
                        "The temperature will be adjusted so that the vapor pressure is at least 1 Pa, corresponding to an atom density of around 8 × 10 13 cm -3 . The total number of atoms/second using a simple open oven can be approximated by Ṅ = n v A/4, where v is the average velocity and A is the area of the source [13]. At a pressure of 1 Pa and a surface area of 1 cm 2 this is approximately 4 × 10 18 atoms/second for lithium, or about 1 kg year -1 . In comparison to highly collimated beams this can produce millions of times more flux (note the 1 mrad collimation in reference [10] gave them 10 9 atoms/second), which more than makes up for any lost efficiency in the guiding. Effectively, we are using each guide entrance to collimate the part of the beam Optical pumping of an angular spread of hot atoms from the effusive source (thin horizontal arrows). The atoms on the left are in a random mix of magnetic moment ground states (g). A spread of resonant lasers (wide shaded arrows), polarized σ + , then excite atoms to an excited state with a more positive magnetic moment. This decays back to the ground state while, on average, maintaining the higher magnetic moment. In the case shown here, the most positive moment ground state has no excited state to go so the atoms all end up in this state as they head toward the separation magnets. This example is for pumping to a low-field-seeking state (+), but the opposite is also possible. that reaches that guide and we have eliminated the need to collimate in the direction parallel to the guide walls.",
                        "The limitations imposed by the source itself will just be the maximum pressure one can achieve without cluster formation, and any temperature-related constraints. Thus, by increasing the pressure and area this can reach hundreds of kilograms per year per chamber. While there is the possibility of collisions of the atoms with each other, the rate does not become significant until even higher densities, and only a fraction of these collisions will be detrimental. The final efficiency will depend on the optical pumping efficiency (discussed in section 2.2), and the fraction that will enter the guides with the appropriate velocity and incident angle to be guided. In principle, the ultimate enrichment achievable depends only on the ability to selectively and efficiently optically pump the appropriate isotopes."
                    ],
                    "subsections": []
                },
                {
                    "title": "Optical pumping",
                    "paragraphs": [
                        "Before entering the guiding region the atoms will first be optically pumped with lasers tuned to an atomic resonance (figure 2). Optical pumping is the process by which light acts on an atom to change it's magnetic state, usually designated by the magnetic quantum number m j , which determines how it will be affected by magnetic fields. The desired isotope will, for example, be optically pumped into a 'low-field-seeking state' (m j > 0), while the other isotopes may, for optimum effect, be optically pumped into a 'high-field-seeking state' (m j < 0). Atoms exiting the source will have a mixture of all its possible states, both negative and positive (except for the special case where zero is the only allowed state).",
                        "The efficiency of MAGIS lies largely in its efficient use of photons since this optical pumping can be done using on the order of 10 photons/atom, and in some cases closer to one photon/atom. A 1 W laser in the visible range of the spectrum can thus separate on the order of 10 18 atoms/second, or 50 moles per year. Additionally, a scheme can usually be found where we address a single minority isotope, further minimizing the laser power needed. That said, it is the optical pumping step that primarily limits both the rate of production and the degree of enrichment. In addition to stray magnetic fields and imperfect polarization of the laser, reabsorption of the scattered photons by other atoms in the beam will reduce the efficiency of optical pumping and must be countered by limiting the atom flux [14]. These issues can thus limit both enrichment and overall production with some level of trade-off between the two.",
                        "The angular divergence of a single stream intersected by each guide will be small enough that Doppler shifts will be smaller compared with isotopic shifts.The divergence angle can be on the order of ±1 degree, where typical transverse Doppler shifts will be 17-100 MHz per degree off perpendicular for atoms of velocity 1000 m s -1 and transitions in the UV to near-IR range. As these are still large relative to most relevant atomic transition linewidths, it will be necessary to broaden either the frequency range or angular coverage of the lasers. The most effective method compatible with multiple guides shown in figure 1 would likely be to broaden the laser bandwidth with an electro-optic modulator [15,16]. Then the multiple guides can be addressed simply by placing an anti-reflection coated wedge between each of the guides to deflect the beam to subsequent guide axes.",
                        "While the concept of dividing the isotopes into different magnetic moment states is common to all elements, the exact scheme for doing this will be unique to each element. The frequencies used, the number of isotopes that will be pumped, the use of meta-stable excited states or ground states, the polarizations used, and even the power levels needed will all be element-dependent. One of the keys to making this system scalable to large volumes is the recognition that recent improvement in laser power available in efficient, relatively low-cost semiconductor lasers means that simply creating more and more systems to match the required output is much less prohibitive now."
                    ],
                    "subsections": []
                },
                {
                    "title": "Guiding",
                    "paragraphs": [
                        "After optical pumping, the atoms enter a magnetic separation region. While magnetic guides for atoms are often used in research where small atom numbers are involved [17,18], and even for isotope separation [9], we are not aware of anyone trying this for macroscopic quantities. Since the essence of our magnetic separation scheme can be drawn in two-dimensional (2D) as in figure 1, it means we are in fact not restricted to the 3D cylindrical multipole guides already analyzed [11]. We may therefore consider a whole set of magnet geometries that are made of planar arrays that only act in the plane of the page but leave the atoms to travel ballistically into and out of the page. Such magnetic deflection and reflection geometries can in many cases make the apparatus simpler and more efficient. One example of such magnetic geometries would use planar Halbach arrays [19] rather than cylindrical multipole arrays. Halbach arrays maximize the field on one side of the array and minimize it on the other, with the range of the field being on the order of the size of the magnets. As mentioned in section 2.2, the force F applied to the atoms by the magnets depends on the value the atoms magnetic quantum number and the gradient of the magnetic field magnitude ∇ B (primarily toward the magnet surface) by F = -µ B g J m j ∇ B, where µ B is the Bohr magneton, and g J is the Landé g-factor. This typically leads to accelerations around 10-100 km s -2 for gradients of 1 T cm -1 achievable with available rare-earth permanent magnets. Here we will consider three such planar guide configurations depicted in figure 3.",
                        "The first configuration (C1) consists of two Halbach arrays facing each other, forming a trough with magnetic barriers at each wall. This forms a guide whose cross section in the plane of the paper would look similar to the cylindrical guide cross section (though with some field modulation in the direction of the beam). This is useful in the case of multi-stage guiding since the atoms would exit the first guide with well defined positions and trajectories in the guiding plane.",
                        "The second configuration (C2) would be that shown in figure 1. The arrays create a series of simple curved barriers always in the direction of the curve. Since line-of-sight is blocked, and there is very little field on the back side of the arrays, only low-field-seeking atoms can be deflected away from the magnets and through the guide.",
                        "The third configurations (C3) would be similar to C1, in that two arrays would face each other, but the planes would not be curved. Instead, there would be a thin wall at the field minimum in the center and at the maximum by the magnets, and there is no line-of-sight to the walls from the source. Therefore any non-magnetic atoms (or atoms going too fast) would fly straight through. Atoms with a negative m j would collect on the magnet walls and those with a positive m j would collect on the center wall.",
                        "Though all of these configurations are possible with conventional magnets, the recent developments in superconducting materials promise to greatly enhance the efficiency, scalability and commercial feasibility of this process."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Application to lithium",
            "paragraphs": [
                "As an example we simulate the purification of lithium-7. As discussed above, there is great interest in purifying lithium-7, however large volumes of material would need to be processed.",
                "Lithium is particularly suited to this in at least two ways. First, the melting temperature (180 • C) is well below the predicted working temperature of around 1000 • C, thereby making the continuous recycling of material a real possibility. Second, lithium is an unusual case with respect to optical pumping. Lithium crosses into the Paschen-Back regime, a range of external magnetic field values where the hyperfine states are no longer good quantum states and the ground states are split into two fine structure manifolds, at very low magnetic fields (>30 Gauss). Therefore we are able to optically pump Li-6 to the high-field-seeking state with available semiconductor lasers, without concern about the polarization, small stray magnetic fields or, to a large extent, multiple scattering. The optical pumping scheme one can use has been detailed by Xiwen [9]. Because the isotope shift in lithium is so large (∼10 GHz), we can excite Li-6 atoms to the D1 line (2 2 S 1/2 (F = 3/2) -2 2 P 1/2 (F = 3/2)) with little chance of scattered light being Doppler shifted to the Li-7 transition at thermal velocities. Therefore the optical pumping, and hence the enrichment level, is only limited by the density of the Li-6 fraction.",
                "Here we have simulated trajectories for lithium, at several different velocities, as they enter a one-sided guide consisting of a 1 m-long Halbach array made up of 1 cm × 1 cm square magnets in the plane of the trajectory. We assume an infinite length into the page for the field calculation. The results are shown in figures 4(a) and 4(b) for two cases: that of m j = -1/2 and m j = +1/2, respectively. We also show the case for m j = 0, although this case does not exist for lithium. This latter case would also represent the limit of infinite velocity and serves to illustrate the principle that all non-low-field seekers will be stopped by the guide. This clearly shows the effect of pumping to the m j = -1/2 state. The pumped Li-6 would follow the trajectories in figure 4(a), while the Li-7 would be split between the 'a' and 'b' trajectories, allowing about half of it to be collected on the right edge of the page. In this configuration the magnets can easily be covered by removable sheets.",
                "We estimate the production rate by running 1235 trajectories spanning the thermal velocity distribution at 800 K, spanning a 5 mm source width, and spanning all angles that can reach the guide entrance. We assume perfect optical pumping, and calculate the fraction of these trajectories (weighted by the thermal distribution) that make it through the guide. We find 0.7% of the Li-6 survives and about 27% of the low-field-seeking Li-7 trajectories succeed. Then, based on a hypothetical collection of identical guides as described earlier, the geometry gives us the fraction of stock Li we can enrich. Each magnet and guide-entrance pair extends across 50 mrad of arc, allowing 40 of these to fit into a ±1 radian spread from the source. The guide entrance in this example covers 55% of the area, with the Li-7 abundance of 92.5%, half of these in the low-field-seeking state, and 70% of the source output calculated to be in 1 steradian. These factors give a total of around 3.5% of the source atoms being enriched.",
                "As an example of a worst-case effect of atomic collisions on optical pumping at 0.5 m from the source, we consider the Li on Li-6 collisional cross section of σ = 10 13 cm 2 [20]. We estimate at 0.5 m from an 800 K source of Li, the atomic density will be about 10 10 cm -3 , giving a mean free path of ∼10 m, which is much longer than the guide. Considering that the density will reduced by another factor of 16 by the end of the guide and that only a fraction of the collisions will cause state changes, we are not concerned with collisional effects in this case.",
                "The enrichment (we quantify this by per cent purity) in this example is estimated to be 99.996% with perfect optical pumping. As a comparison, if 5% of the Li-6 atoms remain in the m j = 1/2 state then this drops to 99.25% where the Li-6 contamination is primarily determined by the fraction unpumped times the isotopic fraction. We describe a new configuration in section 4 which could reduce the effect of poor optical pumping on enrichment, but would have the disadvantage of having to pump the more abundant Li-7. This is discussed in the next section with case 3."
            ],
            "subsections": []
        },
        {
            "title": "Other isotopes",
            "paragraphs": [
                "In order to apply MAGIS to a particular element, there are several necessary requirements that must be fulfilled. First, it must be possible to make a high-flux atomic beam, while maintaining high vacuum conditions in the chamber. This restricts us to elements with a relatively low In all cases we act on the minority isotope (circles) to activate it (filled) or deactivate (not filled) it as needed with respect to the magnetic guide. Case 1: We activate circles to guide only that for collection. Case 2: We deactivate circles to deplete or purify the desired isotope (triangles).",
                "vapor pressure at the chamber temperature. The next requirement is that an atom must have an electronic magnetic moment in a ground state that can be optically pumped, or that it can be excited to a meta-stable state that has a magnetic moment. This requirement excludes the noble gas atoms, which can only be excited to a meta-stable state in a discharge. We now discuss three different classes of atom that satisfy the above criteria, and the applicability of MAGIS to each case is shown in figures 5 and 6.",
                "In the first case, shown in figure 5 separation with a high degree of enrichment (greater than 99%) is required, and the atom has no magnetic moment in the ground state. In this case, only the desired isotope needs to be optically pumped into a metastable electronic state, as the other isotopes will not be magnetically guided, and can be separated in a curved waveguide. Poor optical pumping will reduce the efficiency but will only affect the enrichment if scattered photons excite other isotopes via the relative Doppler shift. An example of such an isotope is calcium, which has a transition near 272 nm to a metastable state. Calcium isotopes are primarily needed for medical diagnostics.",
                "The second case shown in figure 5 is when an atom has a magnetic moment in the ground state and an impurity which can be removed by optical pumping to an unguided state. If a laser is only used for depletion by optical pumping to an unguided state, then the efficiency is similar to case 1 above. The prototype for this scenario is Li-7, discussed in section 3. Another interesting case is zirconium, which when depleted of Zr-91 is useful for nuclear fuel rod cladding. This case may require multiple lasers however due to the multiple occupied low lying states. In all cases we act on the minority isotope (circles) to activate or deactivate it as needed with respect to the magnetic guide. For this case with many isotopes or ground states we magnetically filter out all unguided states (activating circles for improved efficiency), then deactivate the circles to separate them from the rest for collection.",
                "Finally, there is the third case, shown in figure 6, where a high degree of enrichment is desired but the natural abundance is low, or there are too many states that would need to be optically pumped for there to be efficient separation by means of case 1 or 2. For example, to enrich Li-6, one could try to apply the same method used for Li-7; however, this is not an effective approach. The first issue is that the laser power required is a factor of 14× higher than for depleted Li-6 since photons are needed to optically pump every Li-7 atom in the stream. In addition, the flux must be kept a factor of 14× lower in order to avoid radiation trapping. Finally, the maximum enrichment would still be limited by incomplete optical pumping.",
                "To overcome these limitations, we propose the alternative approach of case 3. In the case of Li, the first step is to let the stream of atoms enter a magnetic guide with or without optical pumping. This will filter out atoms that cannot be guided due to their high transverse velocity or negative magnetic state. After a curved section of guiding, the Li-6 atoms are optically pumped to a high-field-seeking state that cannot be guided. These atoms are then deposited on the walls (with a liner that can be removed) and collected. The atoms that are magnetically guided then consist mostly of Li-7. This approach has several important features: photons are only needed to optically pump the desired isotope, so the power requirements are as in the previous case; radiation trapping is greatly reduced; the degree of enrichment is decoupled from the optical pumping efficiency. In general, it is worthwhile to add an optical pumping state at the start of the waveguide in order to prepare the desired isotope in an optimally guided state. This only increases the required laser power by a factor of two and would use the same frequency. This new approach can be applied to a wide range of important isotopes where there are many undesired isotopes that would otherwise have to be individually optically pumped. For example, Mo-100, needed for production of Tc-99m for medical imaging, Gd-157 or Gd-155 for nuclear fuel efficiency, and Ni-64, which is a precursor to radioisotope Cu-64, desired for positron emission tomography scans. The size and design of the guides in this case is not trivial and may require a significant investment in magnets, and optical pumping between the two sections is likely to be very inefficient due to residual fields. We hope to include superconducting magnets in the design in the near future, which could mitigate the concerns over the quantity of rare earth magnets needed for this design."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "Overall, MAGIS is a very general, robust and simple method, often requiring a single-color low-power laser. Recent advances in tunable solid state lasers now make it practical to reach most wavelengths in the visible and UV regions of the spectrum, and with scalable multi-Watt power. The optical efficiency, due to the ability to control the magnetic state of an atom with only a few photons, makes it feasible to prepare useful quantities of material. The next step will be a first experimental demonstration of MAGIS."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgment",
            "paragraphs": [
                "M G R acknowledges support from the Sid W Richardson Foundation."
            ],
            "subsections": []
        }
    ]
}