{
    "id": "https://semopenalex.org/work/W2136232291",
    "authors": [
        "Young Woo Choi",
        "Su Jin Kim",
        "Sang Hoon Park",
        "Seong Muk Kim",
        "Sin‐Soo Jeun",
        "Young Chul Sung",
        "Sae Won Kim",
        "Moon Cheol Kang",
        "Hyun Gul Yang"
    ],
    "title": "Complete Regression of Metastatic Renal Cell Carcinoma by Multiple Injections of Engineered Mesenchymal Stem Cells Expressing Dodecameric TRAIL and HSV-TK",
    "date": "2013-01-15",
    "abstract": "Durable complete remission of metastatic renal cell carcinoma (RCC) has rarely been achieved with current treatment modalities. To solve this problem, alternative therapeutic options with high efficacy and minimal side effects are strongly needed.Mesenchymal stem cells (MSC) were engineered to coexpress dodecameric TRAIL and herpes simplex virus thymidine kinase (MSC/dTRAIL-TK). The antitumor effects of MSCs expressing dTRAIL (MSC/dTRAIL) or HSV-TK alone (MSC/TK) and MSC/dTRAIL-TK were compared with murine RCC cells using in vitro coculture system and in vivo experimental lung metastasis model. The effects of different doses and schedules of engineered MSCs on mice survival were also evaluated.MSC/dTRAIL-TK exerted stronger apoptotic response in Renca cells than did MSC/TK or MSC/dTRAIL after ganciclovir (GCV) treatment. In vivo imaging results suggest that MSCs reside longer in the lungs of metastatic tumor-bearing mice, compared with that of control mice, regardless of genetic engineering. In addition, MSC/dTRAIL-TK treatment followed by ganciclovir administrations significantly decreased the number of tumor nodules in the lung, to a greater degree than MSC/dTRAIL or MSC/TK, and led to a prolonged survival. More importantly, the antimetastatic effect of MSC/dTRAIL-TK was markedly enhanced by repeated injections but not by increased dose, and resulted in 100% survival of tumor-bearing mice after three injections.Sequential combination gene therapy using MSC/dTRAIL-TK achieved long-term remission of metastatic RCC without noticeable toxicity. Our findings provide an innovative therapeutic approach to completely eradicate metastatic tumors by simple, repeated administrations of MSC/dTRAIL-TK.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Renal cell carcinoma (RCC) is the eighth most common type of cancer and the sixth leading cause of cancer-related death (1,2). Approximately 30% of patients with RCC present with metastatic disease and the 5-year survival rate of these patients is less than 10% (3,4). Despite the recent advances in understanding genetic and epigenetic events involved in the metastasis of RCC, current therapies have shown limited success in improving the overall survival of patients with metastatic RCC. As RCC generally possesses inherent resistance to chemotherapy and radiotherapy (5), other treatment modalities, such as cytokine-based immunotherapy or targeted therapy using multikinase inhibitors, have been actively investigated in the clinic. Immunotherapies using interleukin-2 (IL-2) or IFN-a have shown beneficial effects in some clinical settings, and even complete remissions in small cohort of patients using high-dose IL-2, but low response rates and systemic toxicities have limited their clinical use (6). Tyrosine kinase inhibitors, including sunitinib and sorafenib, have substantially improved the overall survival of patients with RCC, but complete remission has rarely been achieved (7). Therefore, there remains a need to develop potent therapeutic agents for metastatic RCC that can induce high response rates with minimal side effects, and most importantly, durable complete responses.",
                "Mesenchymal stem cells (MSC) have recently emerged as potential therapeutic agents and cellular vehicles for gene/ drug delivery, and their therapeutic efficacy is currently being assessed in various disease models including inflammatory and autoimmune diseases and cancer. Two unique properties of MSCs provide them advantages over other cellular delivery vehicles, especially in the metastatic setting: (i) tumor tropic capabilities of MSCs enable target-specific delivery of therapeutic agents (8), which can be especially beneficial when surgical resection is not indicated because of the metastatic dissemination of cancer cells to other organs, and (ii) hypoimmunogenic properties of MSCs allow sustained release of therapeutic molecules without eliciting unwanted immune response, even in the allogeneic or xenogeneic settings (9). The efficacy and safety of MSCs as delivery vehicles were shown in preclinical models of RCC, in which human bone marrow-derived MSCs transduced with adenovirus encoding IL-12 (10) or those loaded with conditionally replicative oncolytic adenovirus (11) were used to generate tumor site-specific antitumor effects in subcutaneous and orthotopic xenograft models, respectively.",
                "Herpes simplex virus thymidine kinase (HSV-TK)-mediated suicide gene therapy has been widely accepted strategy for cancer. HSV-TK converts the nontoxic nucleoside analog ganciclovir (GCV) into a toxic triphosphorylated form, which can subsequently induce the apoptosis of HSV-TK-transduced cells as well as that of rapidly dividing bystander cells (12). One potential drawback of this strategy is that it fails to destroy slow-proliferating or quiescent tumor cell population, which may cause tumor recurrence. To achieve complete eradication of malignant tumor and prevent tumor relapse, HSV-TK/GCV therapy must be used in combination with other therapeutic agents that can eliminate residual tumor cells while enhancing the efficacy of suicide gene therapy.",
                "TRAIL is a homotrimeric, type II transmembrane protein that induces apoptosis through both intrinsic and extrinsic death pathways (13). Because TRAIL is known to induce selective apoptosis on transformed cells without affecting normal cells, it has been regarded as a promising candidate for the treatment of cancer. Clinical applications of recombinant TRAIL, however, have been hampered by its short in vivo half-life and intrinsic instability (14). To overcome its limited efficacy, viral vectors or MSCs were engineered to express TRAIL (15,16), or agonist monoclonal antibodies targeting TRAIL receptors (17) were developed. One of the potential disadvantages of agonistic antibodies, proposed by a recent study, is that their bivalent feature may reduce therapeutic efficacy and mimicking trimeric structure of native TRAIL is crucial for eliciting full biologic activity of agents (18). Another strategy to enhance therapeutic effects of TRAIL is the addition of other treatment modalities for combination therapy. A previous study showed that the combination of agonistic anti-TRAIL receptor antibody with adenovirus-mediated cytosine deaminase/5-fluorocytosine suicide gene therapy produces additive antitumor effects in vivo using human glioma and pancreatic carcinoma xenograft model (19). It was also found that TRAIL can enhance the efficacy of HSV-TK/GCV therapy by augmenting both target and bystander killing effect (20), further supporting the potential clinical use of combined treatment with HSV-TK/GCV gene therapy and TRAIL-based therapy.",
                "In the present study, we analyzed the therapeutic effects of MSC-mediated combination gene therapy of TRAIL and HSV-TK in murine Renca RCC experimental lung metastasis model. This model was designed to recapitulate postoperative condition in human patients who have not yet developed macroscopically detectable metastatic tumors in the lung-the most common site for RCC metastasis (21). The use of MSCs is especially advantageous in such settings, as tumor tropic capacity of MSCs allows them to search and destroy undetectable tumor cells. Furthermore, the use of syngeneic transplantable model enabled proper tumorhost interaction to take place. As RCC (also Renca) is regarded as an immunogenic tumor, the induction of tumor-specific immune responses by MSC therapy was another important parameter for evaluation of therapeutic efficacy. After establishing in vivo model system, we assessed antitumor effects of engineered MSCs coexpressing dodecameric TRAIL and HSV-TK (MSC/dTRAIL-TK). dTRAIL was used in place of conventional trimeric TRAIL (tTRAIL) based on its superior apoptosis-inducing ability. Engineered MSCs were found to be specifically localized in the lung upon in vivo administration, in which secreted TRAIL and HSV-TK in conjunction with ganciclovir acts to exert enhanced killing activity against target tumor cells. More importantly, multiple injections of MSC/dTRAIL-TK at a low dose exhibited stronger antimetastatic effects than single injection at a high dose, resulting in 100% survival of tumor-bearing mice after triple injections. Although clinical application of optimistic results from animal"
            ],
            "subsections": [
                {
                    "title": "Translational Relevance",
                    "paragraphs": [
                        "A major hurdle in the treatment of metastatic renal cell carcinoma (RCC) is the lack of therapeutic agents that can induce durable complete remission without causing systemic toxicities. In this study, we achieved complete elimination of established metastatic RCC in 100% of mice by multiple injections of xenogeneic mesenchymal stem cells (MSC) coexpressing dodecameric TRAIL (dTRAIL) and herpes simplex virus thymidine kinase (HSV-TK) followed by ganciclovir (GCV) administrations. The use of MSCs as a delivery vehicle allowed sitespecific secretion of therapeutic molecules into tumor sites, thereby minimizing any side effects. Moreover, the combination of dTRAIL and HSV-TK/GCV caused increased apoptosis of tumor cells as well as MSCs, resolving safety concerns about malignant transformation of therapeutic stem cells. Our findings propose a safe and effective strategy to achieve long-term remissions of metastatic RCC by simple, repeated injections of MSCs coexpressing dTRAIL and HSV-TK. models should be taken cautiously, this study shows that multiple injections of MSC/dTRAIL-TK could be an attractive therapeutic approach for completely curing RCC patients with distant metastasis."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Cells",
            "paragraphs": [
                "Rat bone marrow-derived MSCs were prepared as previously described (9). MSCs were cultured in low glucose Dulbecco's modified Eagle's medium (Welgene) supplemented with 10% FBS and 1Â antibiotic-antimycotic (Invitrogen). MSCs, in passages 5 through 6, were used for all experiments. RENCA murine renal carcinoma cell line and 4T1 murine breast carcinoma cell line were purchased from American Type Culture Collection and maintained in RPMI-1640 (Welgene) with 10% FBS and antibiotic-antimycotic (Invitrogen)."
            ],
            "subsections": [
                {
                    "title": "Adenoviruses and transduction",
                    "paragraphs": [
                        "The DNA sequences encoding dTRAIL, tissue plasminogen activator (tPA) secretion signal sequence, surfactant protein D (SPD) dodecamerization domain, and extracellular domain of human TRAIL were linked into a DNA cassette, as shown in Fig. 1A. As a control, the isoleucine zipper (ILZ) trimerization domain was used to construct tTRAIL (22). To construct a DNA cassette encoding both dTRAIL and HSV-TK, an internal ribosome entry site was inserted between dTRAIL and HSV-TK. All codons of transgenes were optimized to increase expression levels. Recombinant replication-deficient adenoviruses without transgene (rAd/Mock) or encoding enhanced GFP (rAd/ EGFP), tTRAIL (rAd/tTRAIL), dTRAIL (rAd/dTRAIL), HSV-TK (rAd/TK), or both dTRAIL and HSV-TK (rAd/dTRAIL-TK), were produced using the AdEasyTM Vector System (QBioGene) as previously described (23) and titrated using the Adeno-X Rapid Titer Kit (Clontech). All rAd concentrations used for the transduction of cells are provided as the multiplicity of infection (MOI) in plaque-forming unit per cells (PFU/cell). For MSC transduction, a mixture of 50 MOI of rAd and 50 mmol/L of Fe 3þ was preincubated in serum-free medium at room temperature for 30 minutes, and then infected into MSCs for 30 minutes. Transduction efficiency of adenovirus in MSCs was about 80%."
                    ],
                    "subsections": [
                        {
                            "title": "Apoptotic protein expression and apoptosis signaling assay",
                            "paragraphs": [
                                "To quantify the level of secreted TRAIL from MSC/dTRAIL or MSC/tTRAIL, culture supernatants were analyzed by ELISA using purified anti-human TRAIL antibody (Peprotech) and biotinylated anti-human TRAIL antibody (Peprotech), according to the manufacturer's instructions. To measure the concentration of TRAIL secreted from MSC/ dTRAIL-TK or MSC/dTRAIL upon ganciclovir treatment, culture supernatants were harvested every day and changed with addition of fresh ganciclovir. Collected supernatant were subjected to ELISA as described earlier.",
                                "To analyze the gene expression of HSV-TK, reverse transcription PCR assay was conducted using primers for codonoptimized HSV-TK cDNA, (forward, 5 0 -GCCTTCGAC-CAGGCCGCTAG-3 0 and reverse, 5 0 -CCATGCCGTGGGG-TCCATCG-3 0 ).",
                                "To analyze expression of apoptotic signaling molecules, tumor cells transduced with rAd/mock, rAd/dTRAIL, rAd/TK, or rAd/dTRAIL-TK were lysed in radioimmunoprecipitation assay (RIPA) buffer [25 mmol/L Tris-HCl pH 7.6, 150 mmol/L NaCl, 1 mmol/L EDTA, 1% NP-40, 1% sodium deoxycholate, 0.1% SDS, 1 mmol/L dithiothreitol, 1 mmol/L phenylmethylsulfonylfluoride (PMSF), and 1 mmol/L Na 3 VO 4 ] supplemented with Complete Protease Inhibitor Cocktail Tablets (Roche). After titration, protein expression was analyzed by conventional Western blot analysis using mouse anti-human TRAIL antibody (Peprotech), caspase-3, caspase-8, PARP, cytochrome c (Cell Signaling Technology), or b-actin antibody (Santa Cruz Biotechnology)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "In vitro viability assay",
                            "paragraphs": [
                                "To measure the effects of dTRAIL or tTRAIL on MSC viability, MSC were transduced with different doses (0, 10, 50, and 100 MOI) of rAd/mock, rAd/tTRAIL, or rAd/ dTRAIL and allowed to grow for 3 days. Cell viability was measured by a CellTiter 96 AQueous One Solution Cell Proliferation assay (Promega). Percentage survival was calculated as [the absorbance at 490 nm (A 490 nm ) of MSC/ dTRAIL or MSC/tTRAIL À A 490 nm of blank wells]/(A 490 nm of MSC/mock À A 490 nm of blank wells) Â 100.",
                                "To evaluate ganciclovir cytotoxicity on engineered MSCs, various concentrations of ganciclovir (0, 10, 30, and 100 mmol/L) were used to treat MSC/dTRAIL-TK, MSC/dTRAIL, MSC/TK, and MSC/mock. Cell viability was measured at day 0, 1, 3, 5, and 7 and percentage survival was calculated as described earlier.",
                                "In vitro coculture assay MSC/tTRAIL, MSC/dTRAIL, and MSC/Mock were labeled with 20-mmol/L carboxyfluorescein succinimidyl ester (CFSE, Invitrogen), and then directly cocultured with RENCA or 4T1 tumor cells at a ratio of 1:1 for 48 hours. All floating and adherent cells were harvested, stained with 5 mL of allophycocyanin-conjugated Annexin V (eBioscience) in 100 mL binding buffer, and then analyzed by Gallios flow cytometer (Beckman Coulter) to determine the proportion of apoptotic tumor cells. In a separate experiment, CFSE-labeled MSC/dTRAIL-TK, MSC/dTRAIL, MSC/TK, and MSC/Mock were cocultured with RENCA cells at a ratio of 1:1 for 48 hours. After further incubation with 100 mmol/L of ganciclovir for 48 hours or 72 hours, the proportion of apoptotic cells was analyzed as described earlier."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Animal model and in vivo MSC migration assay",
                            "paragraphs": [
                                "Female BALB/C (5-7-week old) mice were purchased from Jackson Laboratory. To establish experimental lung metastases, 5 Â 10 5 RENCA cells were intravenously injected into the lateral tail vein. To examine the in vivo distribution of intravenously injected MSCs, 5 Â 10 5 CFSElabeled MSCs were injected into the tail vein of na€ ve control or metastatic tumor-bearing mice. Mice were sacrificed at 24 hours after MSC injection, and then various organs (lung, liver, spleen, heart, kidney, and brain) were isolated. Each organ was minced, treated with collagenase, and prepared for flow-cytometric analysis. CFSE-positive cells in each organ were analyzed using a Gallios flow cytometer (Beckman Coulter). To analyze the localization of MSCs in the lung, MSCs were labeled with 5 mmol/L CM-DiI (Molecular Probes) and 5 Â 10 5 cells were intravenously injected into na€ ve control mice or tumor-bearing mice on day 7 after tumor injection. Mice were sacrificed on day 14 and lung tissues were embedded in paraffin blocks for histologic analysis. The labeled MSCs were visualized using a Zeiss Axiovert1135 microscope and AxioVision3 software. For in vivo imaging, MSCs were labeled with NEO-LIVE Magnoxide 675 (BITERIALS) and intravenously injected into na€ ve or metastatic tumor-bearing mice on day 7 after tumor injection. Because ventral images can produce abdominal autofluorescence (24), dorsal images of mice were obtained using Maestro (CRi) after being anesthetized. All MSC migration-related assays described earlier were conducted in the absence of ganciclovir administration."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "In vivo antitumor assays",
                            "paragraphs": [
                                "To investigate antitumor effects of engineered MSCs in metastatic renal cell carcinoma model, mice were intravenously injected with MSC/Mock, MSC/TK, MSC/dTRAIL, or MSC/dTRAIL-TK (5 Â 10 5 cells) on day 1 or 7 after RENCA cell injection. Then, 50 mg/kg of ganciclovir was intraperitoneally injected for 7 consecutive days starting on day 0, 1, 2, or 3 after MSC treatment. On day 14 after tumor injection, lungs of tumor-bearing mice were isolated, stained with picric acid, fixed in acetic acid solution, and the number of metastatic tumor nodules on the lung surface was counted. Survival of tumor-bearing mice was monitored up to 100 days posttumor injection.",
                                "To investigate the effects of different doses of MSC/ dTRAIL-TK on the survival of metastatic tumor-bearing mice, MSC/dTRAIL-TK (5 Â 10 5 cells, 1 Â 10 6 cells, or 1.5 Â 10 6 cells) or MSC/EGFP (5 Â 10 5 cells) were intravenously injected into tumor-bearing mice on day 7 after tumor injection. Antitumor effects of sequential therapy were evaluated by repeating second and third injections of 5 Â 10 5 cells MSC/dTRAIL-TK at 2-week interval. Ganciclovir was administered for 7 consecutive days starting on day 2 after each MSC/dTRAIL-TK administrations. Survival of tumor-bearing mice was monitored up to 125 days posttumor cell injection."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Statistics",
                            "paragraphs": [
                                "All data were expressed as average AE SEM. To measure the statistical differences between groups, a 2-tailed Student t test was used. For all statistical tests, a P value of less than 0.05 was considered to be statistically significant."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Results",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Dodecameric form of TRAIL induces higher levels of tumor cell apoptosis than the trimeric form of TRAIL",
                            "paragraphs": [
                                "To investigate the effects of the dodecamerization of TRAIL on its apoptosis-inducing activity, we generated rAd expressing either dTRAIL or tTRAIL, as described in Materials and Methods (Fig. 1A). The expressions of dTRAIL and tTRAIL protein from transduced MSCs were confirmed by Western blot analysis (Fig. 1B). When MSCs were transduced with rAd/dTRAIL or rAd/tTRAIL, the inclusion of ferric ion (Fe 3þ ) significantly enhanced the expression of both dTRAIL and tTRAIL by 10-to 100-fold. The amount of secreted TRAIL from MSC/dTRAIL in culture supernatant was about 3-fold higher than that from MSC/tTRAIL (Fig. 1C). As the titer of rAd increased, the expression levels of TRAIL also increased, but the viability of MSCs was negatively affected by the viral doses of greater than 100 MOI (Fig. 1D). Decreased MSC viability was unlikely to be caused by high levels of secreted TRAIL, as the extent of decrease in cell survival was comparable between MSC/ tTRAIL and MSC/dTRAIL despite the difference in their TRAIL induction. This result is supported by a previous observation that MSCs are resistant to TRAIL-mediated apoptosis (25). On the basis of these results, 50 MOI of rAd in the presence of Fe 3þ was determined to be the optimal condition for MSC transduction, which did not affect the phenotype of MSCs (Supplementary Fig. S1).",
                                "To examine the cytotoxic effects of TRAIL-expressing MSCs on tumor cells, CFSE-labeled MSC/dTRAIL, MSC/ tTRAIL, and MSC/mock (control) were cocultured with RENCA mouse renal cell carcinoma or 4T1 mouse breast cancer cell lines and the proportion of apoptotic cells was determined. MSC/dTRAIL induced stronger apoptotic responses in RENCA and 4T1 cells, which were known to be sensitive to TRAIL-mediated apoptosis (Fig. 1E andF). MSC/dTRAIL treatment resulted in higher level of apoptosis in RENCA and 4T1 cells than MSC/tTRAIL treatment. It is worth noting that a half dose of MSC/dTRAIL exerted stronger killing activity against Renca cells than MSC/ tTRAIL (Supplementary Fig. S2)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "dTRAIL and HSV-TK exert combinatory effects in apoptosis induction of both transduced MSCs and target tumor cells",
                            "paragraphs": [
                                "To evaluate the combinatorial effects of dTRAIL and HSV-TK in killing of transduced MSCs as well as bystander tumor cells, we first generated MSCs coexpressing dTRAIL and HSV-TK (MSC/dTRAIL-TK) or HSV-TK alone (MSC/TK). The expression of HSV-TK was confirmed by reverse transcription PCR (Fig. 2A). The cytotoxic effects of ganciclovir on engineered MSCs were analyzed by measuring the viability and TRAIL secretion from transduced cells. As shown in Fig. 2B, ganciclovir treatment induced the cell death of thymidine kinase-expressing MSCs (MSC/ dTRAIL-TK and MSC/TK) in a dose-dependent manner but not in dTRAIL-expressing MSCs. Furthermore, MSC/ dTRAIL-TK were found to be more susceptible to ganciclovir-induced apoptosis than MSC/TK. As 100-mmol/ L ganciclovir could achieve nearly complete destruction of MSC/dTRAIL-TK after 7 days of treatment (percentage of remaining MSCs ¼ 1.02% AE 0.58% for MSC/dTRAIL-TK and 6.94% AE 1.74% for MSC/TK), this dosage was selected for the following in vitro coculture experiment. Consistently, TRAIL secretion from MSC/dTRAIL-TK was significantly reduced by ganciclovir treatment but not from MSC/ dTRAIL (Fig. 2C).",
                                "To investigate whether the combination of dTRAIL and HSV-TK could exhibit enhanced apoptogenic effects on bystander tumor cells, CFSE-labeled engineered MSCs were cocultured with RENCA cells for 48 hours and treated with 100 mmol/L of ganciclovir for additional 48 or 72 hours. At both time-points, MSC/dTRAIL-TK exhibited stronger apoptotic effects than the sum of effects from MSC/TK and MSC/dTRAIL in RENCA cells (Fig. 3A). It is also worth noting that decreasing the number of MSC/dTRAIL-TK by 75% in coculture still induced similar level of tumor cell apoptosis to that of MSC/TK (data not shown). A prior study also showed that TK-expressing MSCs could induce cell death of 10 times more tumor cells completely via bystander effect in coculture assay (26). Fluorescence microscopy also indicated that the highest level of RENCA cell death was observed in coculture with MSC/dTRAIL-TK (Fig. 3B). To investigate the molecular mechanisms involved in the combinatory action of dTRAIL and HSV-TK, we analyzed the expression levels of apoptosis-related signaling molecules, including caspase-3, caspase-8, cytochrome c, and PARP. Expression levels of all the molecules tested were significantly increased by coexpression of dTRAIL and HSV-TK (Fig. 3C), which is consistent with the previous report that concerted activation of caspases is responsible for the cooperative antitumor effects between HSV-TK/GCV and TRAIL (20)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "MSC/dTRAIL-TK significantly regresses metastatic tumors and prolongs mice survival, to a greater extent than MSC/dTRAIL or MSC/TK",
                            "paragraphs": [
                                "To evaluate tumor site-specific localization of MSCs and their duration of residence in vivo, several experimental approaches were used. First, CFSE-labeled engineered MSCs (E-MSC that represents MSC/dTRAIL-TK) were intravenously injected into na€ ve or tumor-bearing mice at day 1 or 7 after RENCA cell administration. Twenty-four hours after MSC injection, a greater number of engineered MSCs were detected in the lungs of tumor-bearing mice than those of na€ ve mice (Fig. 4A). In addition, a higher frequency of na€ ve or engineered MSCs was detected in the lungs of mice bearing 7-day-old tumors than those with 1-day-old tumors. These results suggest that higher levels of tumor-derived chemokines in the lung may cause more MSCs to be attracted to the tumor sites. Second, in vivo imaging analysis was conducted to assess the duration of MSC residence in the lung. As shown in Fig. 4B, much stronger fluorescent signals emitted by labeled MSCs were detected in the lungs of tumor-bearing mice than in those of na€ ve mice throughout the entire observation period. Finally, to determine whether MSCs could migrate preferentially toward tumor nodules within the lung tissue, the localization of labeled MSCs was investigated by histologic analysis on day 7 after MSC injection. Interestingly, a greater number of DiI-labeled MSCs was found in the vicinity of tumor nodule sites compared with nonnodule sites in the lungs of tumor-bearing mice (Fig. 4C). Similar results were reported by a previous report that examined the homing of syngeneic MSCs in mice bearing Renca pulmonary metastasis. In this study, histologic analysis of lungs showed that MSCs tended to surround tumor nodules when their diameter is large and infiltrate nodules when their diameter is small (27). Although xenogeneic MSCs were used in our experimental system, cells that reached the tumor nodules seemed to survive longer than those did not, as suggested by the report mentioned earlier.",
                                "Next, we aimed to optimize the time-points for ganciclovir and engineered MSC treatment to maximize the therapeutic efficacy. First, we treated mice with ganciclovir on day 0, 1, 2, or 3 after MSC/dTRAIL-TK injection and analyzed the number of metastatic tumor nodules at 14 days after tumor injection. Ganciclovir treatment that was initiated on the same day with MSC/dTRAIL-TK administration induced moderate antitumor effects, presumably due to rapid MSC killing (Fig. 5A). On the other hand, ganciclovir treatment initiated on day 2 maximized the combinatory effects of dTRAIL and HSV-TK, as presented by the fewest number of metastatic nodules, indicating the dependence of efficacy upon time-point of ganciclovir injection. Thereafter, ganciclovir treatment was initiated on day 2 after MSC/dTRAIL-TK therapy for the following in vivo experiments. Second, we compared the antimetastatic effects of engineered MSCs (MSC/TK, MSC/dTRAIL, MSC/dTRAIL-TK, or MSC/EGFP) administered on day 1 or 7 after RENCA cell injection. Treatment of MSC/TK and MSC/ dTRAIL, either on day 1 or 7, elicited similar antitumor activities as shown by about a 50% decrease in the nodule number in comparison with MSC/EGFP-treated mice (Fig. 5B). However, although statistically insignificant, MSC/ dTRAIL-TK therapy on day 7 achieved more than 90% regression, showing superior antimetastatic effects  with the reduction of metastatic tumor nodules, mice treated with MSC/dTRAIL-TK survived for the longest period of time (maximum survival of mice ¼ 38 days for MSC/EGFP, 52 days for MSC/dTRAIL, 58 days for MSC/TK, and 85 days for MSC/dTRAIL-TK). In the end, however, all mice eventually succumbed to their disease (Fig. 5C)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Multiple injections of MSC/dTRAIL-TK lead to 100% survival of tumor-bearing mice",
                            "paragraphs": [
                                "Although the treatment of MSC/dTRAIL-TK significantly reduced the number of metastatic tumor nodules and prolonged mouse survival, complete remission of metastatic RCC could not be achieved with a single injection of 5 Â 10 6 cells. Because the alteration of dose schedule or dose intensity often affects treatment outcome, we evaluated the effects of increasing the dose or frequency of injections on mice survival. Administrations of 2-or 3-fold higher doses of MSC/dTRAIL-TK (1 Â 10 6 and 1.5 Â 10 6 cells) induced marginal effects on survival. However, sequential administrations of MSC/dTRAIL-TK (5 Â 10 5 cells) in 2-week intervals (with double and triple injections) remarkably prolonged the survival. Surprisingly, 50% of tumor-bearing mice treated with 2 injections of MSC/dTRAIL-TK survived until the end of the study. More importantly, triple injections of MSC/dTRAIL-TK induced a complete cure of metastatic tumor-bearing mice, resulting in 100% survival (Fig. 6A). When the number of metastatic tumor nodules was counted on day 60 after tumor injection, we found that double injections of MSC/dTRAIL-TK significantly elimi-nated tumors in the lungs, compared with a single injection, but some tumor nodules still remained in a number of mice (Fig. 6B). On the other hand, triple injections of MSC/ dTRAIL-TK completely cleared metastatic tumor nodules in the lungs, which is consistent with the 100% survival rates in the mice that we documented."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "A major unmet clinical need in the treatment of metastatic RCC is the absence of therapeutic agent that provides durable complete remissions with minimal toxicity. Recent studies have proposed several strategies to achieve complete remission: (i) the selection of therapeutic agents with selective toxicity toward tumor cells, (ii) the identification of the methods of delivering the agents, either in combination or as sequential single agents, and (iii) the optimization of the most effective sequence or combination treatment regimen (28). In this study, we aimed to completely eliminate established tumors in the lung, which is the most common site of metastasis for RCC, by injecting MSCs transduced with a bicistronic adenoviral vector coexpressing dTRAIL and HSV-TK. Our treatment strategy not only allows tumor site-specific delivery of therapeutic molecules, but also enables the implementation of \"sequential combination gene therapy\" by repeatedly challenging MSCs expressing 2 different therapeutic genes. As expected, MSC/dTRAIL-TK exerted more potent antitumor effects than MSC/dTRAIL and MSC/TK upon ganciclovir treatment, both in vitro and in vivo. But surprisingly, complete regression of metastatic RCC was only observed when MSC/dTRAIL-TK was injected repeatedly at a low dose, but not with a single injection at a high dose. To the best of our knowledge, this is the first report to present 100% survival of metastatic tumor-bearing mice by using MSC-based gene therapy alone. Because the majority of metastatic tumors including RCC are resistant to chemo-or radiotherapy, our strategies solely using MSC/  dTRAIL-TK, without any combinatory treatment with other agents, can provide a new milestone in the treatment of hard-to-cure metastatic cancer.",
                        "Possible explanations for the achievement of complete remission by repeated administrations of MSC/dTRAIL-TK may be summarized as follows: First, the augmentation of TRAIL-mediated antitumor effects by constructing a dodecameric form, or a 4-trimer form, of conventional soluble TRAIL, partly contributed to long-term remissions. It has been reported that increasing the valency of TRAIL mimics can enhance their binding affinity to TRAIL receptors and apoptogenic potential (29). Our result also agrees with previous work showing that artificial dodecamerization of CD154 (CD40L) using SPD induces superior B-cell activation than trimeric CD40L (30). Second, the enhanced apoptotic effects by the combination of dTRAIL and HSV-TK/GCV may play an important role in complete eradication of metastatic tumor cells. A prior study proposed that combinatorial action of TRAIL and TK/GCV involves mutual activation of caspases and TK/GCV-mediated mitochondrial amplification of caspase activity. Because toxic ganciclovir triphosphate can be transferred from TK-expressing cells to nonexpressing bystander cells via gap junctions, TRAIL improved the killing of bystander cells as well (20). In our in vitro study, the proportion of apoptotic Renca cells induced by MSC/dTRAIL-TK was greater than the sum of those induced by MSC/dTRAIL and MSC/TK, separately. Interestingly, similar results were also found in TRAIL-resistant and taxol-resistant human ovarian cancer cell line A2780-Tax (Annexin Vþ population at 24 hours post-ganciclovir treatment ¼ 7.66% AE 0.55% for MSC/mock, 12.81% AE 3.07% for MSC/dTRAIL, 41.68% AE 1.89% for MSC/TK, and 98.00% AE 0.11% for MSC/dTRAIL-TK, unpublished data), suggesting that TRAIL resistance could be overcome by combination therapy of TRAIL and HSV-TK/GCV in selected cancer cell lines. Third, the capability of dTRAIL and HSV-TK/ GCV to target different populations of heterogeneous RCC cells may also aid in accomplishing durable complete remission. It is well established that tumors consisting of heterogeneous population of cells having diverse molecular profiles, proliferative and metastatic potential, differentiation capacity, and susceptibility to chemo-and radiotherapy (31). Among these cells, the capability to initiate tumor formation and sustain tumor growth resides in a small subset of quiescent, slow-growing populations known as cancer stem cells (CSC; ref. 32). A recent study has shown the existence of CSCs in Renca cells by isolating side population cells (33). Because HSV-TK/GCV therapy only eliminates rapidly proliferating tumor cells, residual slow-proliferating cells may repopulate to form recurrent tumor. Indeed, side population cells were found to be more resistant to HSV-TK/GCV treatment than nonside population cells in human glioblastoma (34). On the other hand, side population cells were more sensitive to TRAIL than nonside population cells in human colon cancer, due to the increased expression of c-Myc and consequent upregulation of TRAIL receptor DR4 (35,36). Similarly, radioresistant CSC-like esophageal cells exhibited a higher susceptibility to TRAIL therapy than parental cells (36). These results suggest that the combination therapy of TRAIL and HSV-TK/GCV is an optimal strategy to simultaneously target side population and nonside population cells. Fourth, the induction of stronger tumor-specific T-cell responses by the combination of dTRAIL and HSV-TK/GCV might have contributed to the long-term remission (IFN-g spots/10 6 splenocytes ¼ 81 AE 15 for MSC/EGFP, 124 AE 7 for MSC/dTRAIL, 173 AE 17 for MSC/ TK, and 222 AE 20 for MSC/dTRAIL-TK). The previous evidence suggests that TRAIL-mediated tumor destruction increases the amount of antigens that could be delivered into the cross-presentation pathway, ultimately leading to enhanced antitumor immunity (4). HSV-TK/GCV therapy is also capable of inducing potent T cell and natural killer cell responses (37). As immunogenic properties of RCC render tumor cells relatively sensitive to immunologic attack, the development of strong immune responses may play a role in complete regression. Finally, but most importantly, the optimization of biologic dose and schedule for MSC/dTRAIL-TK treatment contributed a great deal to the accomplishment of durable complete remission. The optimal time-points for in vivo application of ganciclovir and MSCs were empirically determined to provide the maximum therapeutic efficacy. We then evaluated the effects of biologic doses and frequency of administration on tumor regression. No significant increase in survival was observed after a single injection of MSC/TRAIL-TK at 2 or 3 times higher doses. Repeated administration of small-divided doses of MSC/TRAIL-TK, however, markedly improved mice survival, resulting in 50% survival after 2 injections and 100% survival after 3 injections. Multiple injections of small-divided doses of agents were as effective as or even more advantageous than single injection in some occasions. For example, frequent smaller doses of bevacizumab exerted similar modulatory effects with a single large injection on VEGFinduced vascular changes in retinal neovascular model (38). It was also reported that low-dose repeated injections of adriamycin was more effective than a high-dose single injection in terms of improving the survival of tumor-bearing mice while lowering the drug toxicity (39). Sustained release of therapeutic molecules in the tumor microenvironment and more frequent exposure to ganciclovir seemed to be crucial for the achievement of complete remission in our experimental system. The potency of sequential suicide gene therapy was also assessed in a recent study, in which repeated injections of human adipose-derived MSCs expressing cytosine deaminase::uracil phosphoribosyltransferase (with intracerebroventricular 5-fluorocytosine administration) achieved 88% survival of rats bearing intracerebral glioblastoma (40).",
                        "In conclusion, sequential administration of MSCs coexpressing dTRAIL and thymidine kinase is a safe and potent strategy for accomplishing long-term remissions of metastatic RCC. The application of syngeneic or allogeneic MSCs, which are more often used in clinic, may further potentiate the therapeutic efficacy of MSC/dTRAIL-TK as more MSCs would survive at the tumor site to increase the availability of therapy. Moreover, the incorporation of HSV-TK/GCV system enables efficient elimination of MSCs, lowering the risk of malignant transformation of infused MSCs. Overall, our findings propose a novel therapeutic approach to achieve durable complete remission in metastatic RCC."
                    ],
                    "subsections": [
                        {
                            "title": "Acknowledgments",
                            "paragraphs": [
                                "The authors thank Kwan Seok Lee at POSTECH for their devoted animal care, Dong-Young Kim at Genexine Co. for providing recombinant adenovirus, as well as Sang Hwan Seo and Bo Yeong Song at POSTECH for providing technical assistance."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Grant Support",
                            "paragraphs": [
                                "This work was supported by grants from the Korea Science and Engineering Foundation (KOSEF) funded by the Korea government (2010K001287), the National R&D Program for Cancer Control, Ministry of Health & Welfare, Republic of Korea (0820040), and the World Class University (WCU) program through the National Research Foundation of Korea funded by the Ministry of Education, Science and Technology (R31-2008-000-10105-0 or R31-10105).",
                                "The costs of publication of this article were defrayed in part by the payment of page charges. This article must therefore be hereby marked advertisement in accordance with 18 U.S.C. Section 1734 solely to indicate this fact. Received June 6, 2012; revised October 23, 2012; accepted October 25, 2012; published OnlineFirst November 30, 2012."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Disclosure of Potential Conflicts of Interest",
                            "paragraphs": [
                                "No potential conflicts of interest were disclosed."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        }
    ]
}