{
    "id": "US20220238537",
    "authors": [
        "Peter A. Dowben",
        "Ruihua Cheng",
        "Xiaoshan Xu",
        "Alpha T. N'Diaye",
        "Aaron Mosey",
        "Guanhua Hao",
        "Thilini K. Ekanayaka",
        "Xuanyuan Jiang",
        "Andrew J. Yost",
        "Andrew Marshall",
        "Azad J. Naeemi"
    ],
    "title": "THIN FILM MOLECULAR MEMORY",
    "date": "2022-01-25 00:00:00",
    "abstract": "A thin film molecular memory is provided that satisfies criteria needed to make a molecular spintronic device, based on spin crossover complexes, competitive with silicon technology. These criteria include, device implementation, a low coercive voltage (less than 1V) and low write peak currents (on the order of 104 A/cm2), a device on/off ratio >10, thin film quality, the ability to “lock” the spin state (providing nonvolatility), the ability to isothermally “unlock” and switch the spin state with voltage, conductance change with spin state, room temperature and above room temperature operation, an on-state device resistivity less than 1 Ω·cm, a device fast switching speed (less than 100 ps), device endurance (on the order of 1016 switches without degradation), and the ability of having a device with a transistor channel width of 10 nm or below.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The design of flexible and high-density nonvolatile memory devices remains an area of interest for obtaining high-speed computer memory. Organic electronics is one area of research. Organic electronics involve polymers, small molecules, and other forms of organic materials that are used for optoelectronic and electronic functionalities. By leveraging the intrinsic spin of electrons and associated magnetic moments of these organic materials, it is possible to create spintronic/magnetoelectronic devices. The voltage control of the magnetic states of these organic materials enables nonvolatile device elements whose state may be switched without large current densities and power consumption.",
                        "Accordingly, there is need in the art for molecular systems to deliver low-power nonvolatile magnetoelectric memory operations."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate nonvolatile memory devices"
                    ],
                    "num_characters": 825,
                    "outline_medium": [
                        "motivate nonvolatile memory devices"
                    ],
                    "outline_short": [
                        "motivate nonvolatile memory devices"
                    ]
                },
                {
                    "title": "BRIEF SUMMARY",
                    "paragraphs": [
                        "Thin film molecular memory is described. The thin film molecular memory is a nonvolatile memory compatible with back end of line (BEOL) silicon processing and can be used as cache memory as well as a replacement for flash memory and transistors in flexible displays. The thin film molecular memory uses voltage controlled molecular spin state switching.",
                        "A thin film molecular memory is provided that satisfies criteria needed to make a molecular spintronic device, based on spin crossover complexes, competitive with silicon technology. These criteria include, device implementation, a low coercive voltage (less than 1V) and low write peak currents (on the order of 105 A/cm2), a device on/off ratio >10, thin film quality, the ability to “lock” the spin state (providing nonvolatility), the ability to isothermally “unlock” and switch the spin state with voltage, conductance change with spin state, room temperature and above room temperature operation, an on-state device resistivity less than 1 Ω·cm, a device fast switching speed (less than 100 ps), device endurance (on the order of more than 1011 switches without degradation), and the ability of having a device with a transistor channel width of 10 nm or below.",
                        "Advantageously, as described herein, it is possible to produce a nonvolatile memory compatible with BEOL silicon processing that is scalable and faster, cheaper, and less energy expensive (<1 fJ/device) than spin-transfer torque (SST) RAM. The described thin film molecular memory can replace spin orbit torque (SOT) RAM. The BEOL processing advantage means that nonvolatile cache memory can be placed in intimate contact with logic.",
                        "Accordingly, a system can be fabricated that includes a circuit substrate; and a thin film molecular memory deposited on the circuit substrate in a back end of line process. The thin film molecular memory is formed of a ferroelectric layer adjacent to a spin crossover molecular layer having a channel thickness of at least 10 nm (and can even be 50 nm thick). The circuit substrate can include transistor devices. In some cases, the memory devices of the thin film molecular memory are electrically connected to the transistor devices of the circuit substrate.",
                        "This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce thin film molecular memory",
                        "describe device criteria",
                        "highlight advantages over SST RAM",
                        "describe system fabrication",
                        "clarify summary purpose"
                    ],
                    "num_characters": 2553,
                    "outline_medium": [
                        "introduce thin film molecular memory",
                        "summarize advantages"
                    ],
                    "outline_short": [
                        "introduce thin film molecular memory"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Thin film molecular memory is described. The thin film molecular memory is a nonvolatile memory compatible with back end of line (BEOL) silicon processing and can be used as cache memory as well as a replacement for flash memory and transistors in flexible displays. The thin film molecular memory uses voltage controlled molecular spin state switching.",
                        "A system can be fabricated that includes a circuit substrate and a thin film molecular memory deposited on the circuit substrate in a back end of line process. The thin film molecular memory is formed of a ferroelectric layer adjacent to a spin crossover molecular layer having a channel thickness of at least 10 nm (and can even be 50 nm thick). The circuit substrate can include transistor devices. The transistor devices can be complementary metal oxide semiconductor (CMOS) transistors. In some cases, the memory devices of the thin film molecular memory are electrically connected to the transistor devices of the circuit substrate. In some implementations, the thin film molecular memory comprises a two-terminal diode memory device. In some implementations, the thin film molecular memory comprises a four-terminal transistor memory device.",
                        "Molecular systems have the very real possibility of providing a room temperature device on a length scale less than 10 nm while delivering low power nonvolatile local magnetoelectric memory operations. It has been suggested that the spin crossover (SCO) phenomenon, which relates to the transition between a low spin (LS) diamagnetic state of the metal ion to a high-spin (HS) paramagnetic state in 3d transition metal compounds, has potential applicability in molecular spintronic devices. There is now clear evidence that a molecular multiferroic device is possible. Voltage-controlled isothermal changes in the electronic structure of the spin crossover molecular system have now been achieved for the Fe(II) spin crossover complexes such as [Fe{H2B(pz)2}2(bipy)], where pz=tris(pyrazol-1-yl)-borohydride and bipy=2,2′-bipyridine. This isothermal voltage-controlled switching is evident in an applied electric field. The higher conductance occurs at high spin state while lower conductance for low spin state. Because these molecular thin films are easily fabricated, and compatible with flexible substrates, it is possible to fabricate low-cost molecular solid-state memory with large ON/OFF ratio from the next generation of molecular spintronic devices.",
                        "A thin film molecular memory is provided that satisfies criteria needed to make a molecular spintronic device, based on spin crossover complexes, competitive with silicon technology. These criteria include, device implementation, a low coercive voltage (less than 1 V) and low write peak currents (on the order of 105 A/cm2), a device on/off ratio >10, thin film quality, the ability to “lock” the spin state (providing nonvolatility), the ability to isothermally “unlock” and switch the spin state with voltage, conductance change with spin state, room temperature and above room temperature operation, an on-state device resistivity less than 1 Ω·cm, a device fast switching speed (less than 100 ps), device endurance (on the order of 1016 switches without degradation), and the ability of having a device with a transistor channel width of 10 nm or below.",
                        "Regarding device implementation, FIG. 1A shows a schematic of an example nonvolatile memory element cell. FIG. 1B shows a simplified schematic cross-section of the nonvolatile memory element of FIG. 1A. This memory cell is based on the design of a field effect voltage-controlled spin state molecular transistor and can exploit the differential between the low-resistance and high resistance states of a voltage-controlled spin state molecular memory device fabricated from spin crossover complexes. However, unlike DRAM (dynamic random-access memory), where charge storage on the cell must be refreshed periodically, molecular spin state memory is nonvolatile and the output is resistive. This is particularly useful when low-power memory is needed.",
                        "It should be understood that this nonvolatile memory element is not the only implementation scheme for nonvolatile spin crossover molecular devices.",
                        "Regarding the criteria of a low coercive voltage (less than 1V) and low write peak currents (on the order of 105 A/cm2), it is possible to achieve these properties through use of a thin ferroelectric layer adjacent to the spin crossover molecular layer. Indeed, molecular ferroelectric gate dielectrics can be made as thin as 1 nm and still be reliable, and the coercive voltage would be <0.5 V. A gate dielectric 2 nm thick would be “worry free” with a coercive voltage of about 0.8 V or less. Accordingly, a thin film molecular memory can be formed of a ferroelectric layer less than 5 nm thick adjacent to a spin crossover molecular layer, as illustrated in FIG. 1B (not to scale). The desire for faster write speeds, means that the peak current densities needed to provide the correct ferroelectric polarization at the gate will also scale up. There is a trade-off between faster write speeds and lower peak current densities for a ‘write’ operation.",
                        "In detail, working nonvolatile molecular spin crossover devices make use of a ferroelectric layer adjacent to the spin crossover molecular layer. Thus, the coercive voltage of the device tends to be dominated by the coercive voltage of ferroelectric layer. The choice of molecular ferroelectric also plays a role.",
                        "In some cases, the ferroelectric layer is formed of dipolar molecular additives. In some cases, the ferroelectric layer is formed of organic ferroelectric material. In some cases, the ferroelectric layer comprises benzimidazole, 2-methylbenzimidazole, 5,6-dichloro-2-methylbenzimidazole, bridged bis(benzimidazole), croconic acid, or a copolymer of polyvinylidene fluoride.",
                        "As shown in FIG. 2, coercive voltages of 1.5 V have been obtained for a 5-layer poly(vinylidene fluoride with trifluoroethylene) film and a roughly 5 V has been obtained for both 35 nm and 185 nm thick croconic acid thin films, respectively. The good news here is that the coercive voltage for the ferroelectric layer tends to scale with the ferroelectric layer film thickness, but sadly this scaling with film thickness appears to be far from perfect in the thin film limit. Yet for a critical electric field Ecr of roughly 50 MVm−1 and 0.2-0.4 GVm−1 have been estimated for poly(vinylidene fluoride with trifluoroethylene) films meaning that coercive voltages of 50 mV to 0.2 V are possible for bilayer thick molecular films of about 1 nm thickness. Even with failures of scaling in the thin film limit, coercive voltages of less than 0.5 V should be possible for bilayer thick molecular films. The critical electric field Ecr of less than 2 MVm−1 for croconic acid, means that coercive voltages less than 3 mV might be possible, which in fact would be too small to be practical, so thicker and thus more reliable ferroelectric thin films would be required.",
                        "While there have been some successes with inorganic ferroelectric layers influencing the spin state of an adjacent molecular spin crossover complex thin film, in general the problems with the inorganic ferroelectric layers are that, apart from PbZr0.2Ti0.8O3 (PZT), the coercive voltages tend to be somewhat higher, outside of the tunnel junction geometry where the coercive voltages also are in the range of 1 V. In the very thinnest of oxide ferroelectric films, ferroelectric polarization retention tends to be lower. Indeed, our experience is that in the very thin oxide ferroelectric films, one ferroelectric polarization is favored so the retention of one ferroelectric polarization is favored over another. Thin film oxide ferroelectrics, even when grown on oxide surfaces, tend to exhibit preferential upward polarization (C+). This is not desirable in a nonvolatile device destined for memory applications. For the oxides, surface defects abound. How a spin crossover complex will bond at such defects sites is not yet clear, so concerns remain that spin state switching will be suppressed for spin crossover complexes residing at such oxide surface imperfections.",
                        "Organic ferroelectric thin films are also far from perfect in their behavior. First there is the problem that the faster the switching speed, the higher the coercive voltage needed. Second, the coercive voltages for each ferroelectric polarization direction may differ as the film thickness decreases. The loss of symmetry in the coercive voltage can be the result of the interface with a conducting contact. Finally, there is the problem that the polarization hysteresis is not “square”, meaning that the application of higher voltage, the coercive voltage, may be necessary to achieve full polarization.",
                        "If the current density is 1 electron per molecule in 1 ns, this translates into an overall minimum current density of 3.6×105 A/cm2. This approaches the industry goal of a current density of 104 A/cm2. This is because the gate supply needs to be able to do two things: (1) be able to make the device switch the ferroelectric polarization of what is the gate dielectric, and hence the spin state in the spin crossover molecular layer (where the latter plays the role of the semiconductor channel in the transistor geometry) at a reasonable supply voltage. In other words, the gate supply voltage should not be too high and not too low. If the gate supply voltage required is too high, then the implementation of room temperature nonvolatile spin crossover transistor molecular devices would require high voltage supplies or charge pumps on chip in order to program a memory device. This is why EEPROM is not a very popular non-volatile memory device—it simply requires too much supply voltage to make it a very usable memory. If the gate supply voltages are too significant, this would limit the application of nonvolatile spin crossover transistor molecular devices to one-time-programmable memory only. If, on the other hand, the programming voltage could be brought down to a very low value, it has the advantage of making the memory chip easy to program, but circuitry then has to be carefully designed to ensure that accidental programming does not occur especially during the read operations. (2) The second factor to be considered is speed of write. While less important than ability to write a memory cell, speed is none-the-less important, and becomes more important in memory applications requiring a fast write time. Unfortunately, the writing or programing voltage and the write speed requirements can act against each other in operational memory, since the lower programming or write voltage, the better it is for write time, but reducing programming voltage too much increases the chances of a write “disturb” event.",
                        "Regarding a device on/off ratio of greater than 10, the initial working nonvolatile molecular devices, based on the spin crossover complex [Fe{H2B(pz)2}2(bipy)], had an on/off ratio of about 6, for the device in the transistor geometry. This has now been improved to an on/off ratio greater than 100, even the spin state switching is seen to be incomplete. With more complete spin state switching, the on/off ratio will improve. One indication of the possible molecular spintronic device on/off ratio comes from the 2-terminal diode like device, such as shown in FIG. 3A, as opposed to the top and bottom gated transistor device. Here current ON/OFF ratio of 104 has been obtained, with 103 near threshold voltage. This high ON/OFF ratio, as seen in FIG. 3B, suggests that the changes in conductance, associated with a spin state change, can be engineered to be very significant. Thus, such devices, based on a change of molecular spin state, should exhibit a high level of fidelity in possible molecular electronics applications. This is obviously a volatile conductance switching that arises in a two terminal device when the ferroelectric layer is more homogeneous, as indicated in FIG. 4. While a homogeneous ferroelectric layer is very desirable for nonvolatile molecular multiferroics devices in the transistor geometry because the ferroelectric is a gate dielectric layer for one of the gates (either top or bottom). In the diode geometry a uniform ferroelectric layer is less effective, suggesting that the voltage control of spin state switching arises not from the electric field, but from interface effects, as suggested elsewhere. Yet nonvolatility is possible in the longitudinal conductance for a two terminal diode device.",
                        "Indeed, the nonvolatile conductance change now exceeds 10 in the most recent working nonvolatile multiferroic devices fabricated from spin crossover molecular complexes. The on to off ratio is greater than 10 and frequently greater than 100 in many of the 2 terminal volatile devices. These higher (>10) on/off ratios are good for a memory cell and eases the pathway to implementation. This is because, in practice, memory cells are not typically uniform. There is a statistical range of cell resistances and device to device on/off ratios. As the on-off ratio decreases, there is a point where on-off ratio is sufficient so there is an overlap between the “high” state and the “low” state. When this occurs, there is the potential for error, which in some cases can be corrected, but at the expense of error correction circuitry.",
                        "FIG. 5 illustrates the on/off ratio requirements for memory cells. Here, the issue of state overlap if on/off ratio is reduced too much can be seen. There is a statistical variation in the conductance in both the on and the off states, between memory cells in a memory array, and this results in a range of “Low” and “High” conductance states associated with the low and high spin states. If the on/off ratio is reduced too much, an indeterminate state can occur, where it is not clear which state the memory cell is in. As the on/off ratio reduces, it takes longer to isolate the correct state when doing a read function. Read time is typically more important than write time, since typically there are more read than write cycles, especially in non-volatile memory configurations. A moderately high ratio of more than 103 allows for faster sense amplifiers and a variety of memory configurations. This suggests that there is promise for these types of devices and the existing devices are more than adequate for memory applications from the perspective of the on/off ratio.",
                        "Regarding the criteria of thin film quality, a competitive device requires scalability. This is to say that there has to be a route to large scale manufacturability. There are basically three approaches. These are to build a spin crossover thin film architectures chemically, as has been done as in the case of [Fe-(pz){Pd(CN4)}], evaporate a thin film, or spin coat a thin film from solution.",
                        "The more widely used approach to film fabrication is to evaporate a thin film of spin crossover molecules. This will not work with all spin crossover molecular systems, because the sublimation process must leave the molecules “intact” and the condensation process must result in a suitable molecular packing on the local scale (at least), so that the properties that change across the spin transition can be exploited reproducibly. The requirements tend to exclude molecular salts and polymers as neither can be evaporated readily. Yet the approach has been successfully applied to [Fe(1,10-phenanthroline)2(NCS)2] (frequently known as Fe(phen)2(NCS)2), as illustrated in FIG. 6A, [Fe(H2B(pz)2)2phen] where H2B(pz)2=dihydrobis(1H-pyrazol-1-yl)borate, as illustrated in FIG. 6C, [Fe(HB(tz)3)2] (tz=1,2,4-triazol-1-yl), as illustrated in FIG. 6D, [Fe(HB(3,5-(CH3)2(pz)3)2], where pz=pyrazolyl, as illustrated in FIG. 6E, [Fe(qnal)2] where qnal=quinoline-naphthaldehyde, as illustrated in FIG. 6F, [Fe(HB(pz)3)2] where pz=pyrazolyl and the molecule that is the focus of this review: [Fe{H2B(pz)2}2(bipy)] where (H2B(pz)2=bis(hydrido)bis(1H-pyrazol-1-yl)borate, bipy=2,2′-bipyridine), as illustrated in FIG. 6B. For the purposes of these devices, any spin crossover complex that can be evaporated intact, retains intermolecular interactions (i.e., cooperative effects), couples to the molecular substrate, has a large resistance change associated with the change in spin state, and has a low on state resistance could be suitable for such a device as described here. Accordingly, there are variety of Fe2+ and Co2+/3+ spin crossover complexes that can be considered.",
                        "Another approach would be to spin coat the molecular layers from solution, as in the case of Fe(hptrz)3](OTs)2 (hptrz=4-heptyl-1,2,4-triazole, OTs=tosylate). [Fe(Htrz)2(trz)](BF4) plus polyaniline composites shows considerable promise because the onstate resistance is well below 1 Ω·cm. The problem here is that solvent effects are known to alter the characteristics of the spin state transition for some spin crossover complexes. This is not likely to be an insurmountable problem, but realistically, the molecular solubility and solvent effects are issues that would have to be addressed if this were chosen as the route to large scale device fabrication. Presently, efforts to explore solubility and solvent effects are only in their infancy.",
                        "Accordingly, in some implementations, the ferroelectric layer of the described memory devices is fabricated by evaporation. In some implementations, the ferroelectric layer is fabricated by Langmuir-Blodgett thin film growth.",
                        "Regarding the ability to “lock” the spin state, a competitive nonvolatile device requires locking of the spin state in the region of room temperature, as has been achieved with the inclusion of both dipolar molecular additives, as well as from the influence of the substrate. Key here is that the polarization of a ferroelectric interface can preferentially favor the adoption of the high or low spin state of an adjacent spin cross molecular thin film. It is important to note that this influence of the ferroelectric substrate domain polarization extends away from the interface with ferroelectric and well into the adjacent spin cross molecular thin film. The exact mechanisms for this influence of the substrate on the spin state of the molecular spin crossover complex thin film have not been precisely identified but intermolecular cooperative effects are implicated in the influence of the substrate on the adjacent spin cross molecular thin film. The fact that the interface polarization influences the spin state occupancy significantly for molecular spin crossover complex thin films up to 20 molecular layers, and for even greater film thicknesses in a somewhat diminished manner means that device fabrication does not require precise and stringent film thickness choices, easing the constraints.",
                        "It is noted that the surface of the molecular spin crossover complex thin film may have a different spin state occupancy than the rest of the film. Furthermore, when the device is both top and bottom gated, the molecular spin crossover complex thin film will be influenced by two different interfaces.",
                        "Regarding the ability to isothermally “unlock” and switch the spin state with voltage, a competitive nonvolatile molecular spin crossover device requires change of the spin state, ideally with voltage, from one nonvolatile state to another. This is the device “write” operation. Recent work suggests that an applied magnetic field could reduce the activation barrier to a change in spin state, but as with light activation of a spin state change, this does not seem to lend itself towards a readily applicable memory application. Just the same, isothermal spin state and conductance switching has been demonstrated. It is this achievement of nonvolatile voltage control of the molecular spin state that opens to door to potential practical applications.",
                        "Along with the device write operation, a nonvolatile molecular device requires a read operation. So far, the read operation has been successfully exploiting the conductance change that accompanies the change in molecular spin state, as seen in FIG. 7. It is known that the difference between the highest occupied molecular orbital to lowest unoccupied molecular orbital is much larger (by about 2 eV) compared to the gap between low spin state and high spin state of [Fe{H2B(pz)2}2(bipy)]. A smaller band gap for the high spin state of [Fe{H2B(pz)2}2(bipy)] is consistent with a higher conductance, and this higher conductance is seen in working room temperature devices. This type of conductance change has been observed with other spin crossover complexes, like [Fe(bpz)2phen], Fe(trans-bis(3-(2-pyridyl)(1,2,3)triazolo(1-5)pyridine)bis(isothiocyanato)], Rb0.8Mn[Fe(CN)6]0.93.1.62H2O, [Fe(trz)3](BF4)2 (trz=triazole), [Fe(phen)2(NCS)2], and [FeIII(qsal)2][Ni(dmit)2]3.CH3CN.H2O, although in these latter examples the conductance change was volatile. Accordingly, isothermal switching of conductance in a nonvolatile spin crossover molecular device is possible.",
                        "Regarding room temperature operation of a nonvolatile spin crossover molecular device, there are now working nonvolatile molecular devices fabricated from spin crossover complexes that work not only at room temperature, but to temperatures well above room temperature. So far, working nonvolatile molecular device operation has been demonstrated to temperatures as high as 350 K. The molecules that can be evaporated as thin films typically sublime between 433 K and 510 K, suggesting molecular stability to at least this region of temperature. While these higher temperatures have not yet tested in the working device, it does suggest that operational temperatures may be possible. But too high a temperature may lead to material loss even if it does not lead to molecular degradation. Overall, given the current status, it does seem that nonvolatile molecular devices fabricated from spin crossover complexes are operational over a wide enough temperature range to both practical and competitive.",
                        "Regarding on-state resistivity, from the nonvolatile multiferroic molecular devices two terminal diode-like devices, it can be estimated that the resistance in the on state is about 103 Ω·cm and 106 Ω·cm in the off state for a spin crossover device based on [Fe{H2B(pz)2}2(bipy)]. For a nanoscale device, this presents a serious problem because if the resistance scales with size, the nanoscale device will have a total resistance that diminishes utility.",
                        "Here a resistance of 103 Ω·cm translates to a device resistance of 5 GΩ when the dimensions of the device are reduced to a 10 nm width, a source to drain distance of 10 nm and a film thickness of 2 nm according to:",
                        "\\(R = {{\\rho\\frac{L}{WT}} = {10^{3} \\times 10^{- 2}\\left( {\\Omega \\cdot m} \\right)\\frac{10 \\times 10^{- 9}m}{\\left( {10 \\times 10^{- 9}m} \\right)\\left( {2 \\times 10^{- 9}} \\right)}5G{\\Omega.}}}\\)",
                        "This 5 GΩ resistance is simply too high a resistance to be valuable from an applications point of view, especially as this may not correctly include resistance at the molecules to metal contact interface. The large impedance will lead to delay times that are simply too long to be competitive. It can be realized that [Fe{H2B(pz)2}2(bipy)] is probably not the most desirable spin crossover complex for competitive nonvolatile molecular devices for memory applications. Other spin crossover molecular complexes are reported with lower on-state resistance of 5 Ω·cm for the spin crossover molecules [Fe(tpma)(xbim)](X)(TCNQ)1.5.DMF (X═ClO4) and [FeIII(sal2-trien)][Ni(dmit)2]. An even lower on-state resistance of 0.5 Ω·cm has been reported for the spin crossover molecule [FeIII(qsal)2][Ni(dmit)2]3.CH3CN.H2O. Even lower resistance has been reported for [Fe(Htrz)2(trz)](BF4) plus polyaniline composites. This strongly suggests that the reduction of the intrinsic resistance of a spin crossover molecular system is a problem that can be addressed by some adroit synthetic chemistry. For the purposes of these devices, any spin crossover complex that can be evaporated intact, or is soluble in a solvent from which a molecular thin film can be drop cast may be suitable so long as the resulting spin crossover thin film retains intermolecular interactions (i.e., cooperative effects), couples to the molecular substrate, has a large resistance change associated with the change in spin state, and has a low on state resistance could be suitable for such a device as described here. Accordingly, there are variety of Fe2+, Co2+/3+ and Mn3+ spin crossover complexes that can be considered.",
                        "FIG. 8 shows a schematic of critical dimensions of a nonvolatile molecular transistor device fabricated from spin crossover complexes. The ferroelectric layer may be a molecular ferroelectric that also serves as one of the gate dielectric layers. Although not shown in FIG. 8, the transistor device may be both top and bottom gated, so as to provide uniform electric field across the ferroelectric, which can provide uniform ferroelectric polarization in the ferroelectric dielectric layer.",
                        "While the devices made so far have source to drain on-state resistances of 103 Ω·cm, there are known options, from ongoing chemistry, where the on-state resistance could be as low as 0.5 Ω·cm. These other spin crossover molecules have not been yet fabricated into a working nonvolatile molecular transistor, but if applicable from fabrication point of view, for a transistor at the 10 nm node with the channel at 0.5 Ω·cm resistance, this would lead to a source to drain resistance of 2.5 MΩ in a spin crossover transistor device 10 nm wide and 2 nm thick.",
                        "Regarding device switching speed, there are spin crossover complexes that may have spin state switching speeds adequate for a competitive device. A number of measurements suggest sub-picosecond switching speeds. This means that the switching speed is limited by the switching speed of the ferroelectric. For copolymers of polyvinylidene fluoride (PVDF), this means that reversal of a ferroelectric domain will take far longer than a nanosecond, because of the need to rotate the —CH2CF2— chemical formulae units. Benzimidazole, 2-methylbenzimidazole, 5,6-dichloro-2-methylbenzimidazole, bridged bis(benzimidazole) and croconic acid are molecular ferroelectrics that require far less dramatic atomic repositioning and thus potentially should have faster ferroelectric polarization switching speeds.",
                        "Device switching speed is not simply determined by the switching speed of the molecular state and configuration. Resistance can play a big role in determining the overall operational speed of the device. This latter point is complicated not just by the resistance of the spin crossover molecular layer, which acts to reduce the operation speed of the device, but a variety of parasitic capacitances. The demonstration that magnetic field reduces the activation barrier separating the high and low spin states does suggest that faster switching speed may be possible with the application of a magnetic field, but this may be an unwanted complication in the implementation of nonvolatile multiferroic molecular devices, fabricated from spin crossover molecular complexes for memory. In addition, contact potential can have an impact on device speed.",
                        "Regarding device endurance, molecular devices are generally considered very fragile compared to inorganic devices. However, there have been molecular spin crossover devices fabricated that have been shown to undergo 10 million switches without degradation. These demonstration spin crossover molecular devices were not designed for nonvolatile voltage-controlled memory applications, but provide evidence in favor of spin crossover molecular device endurance.",
                        "Regarding the ability of having a device with a transistor channel width of 10 nm or below, it has been found that devices at the 10 nm scale are possible. With almost all devices dependent on magnetoelectric coupling, there is the concern that there is a limit to the device size. In other words, there is concern that the magnetoelectric coupling either suffers from some sort of finite scaling or that there is a critical volume where magnetoelectric coupling simply fails. In the case of spin crossover systems, spin state switching at room temperature has been demonstrated to the 3.6±0.8 nm scale. This demonstration provides considerable evidence that devices at the 10 nm scale are possible, and this would be competitive with silicon (e.g., CMOS) technologies. Yet the on-state resistance, however, is high, as discussed above. Even a decrease of the on-state resistance to about 0.5 Ω·cm, through a better choice of spin crossover complex, would still mean a substantial device resistance on the nanometer scale. While the materials properties indicate that spin state switching is possible below 10 nm, the exigencies of device implementation may preclude this implementation of nonvolatile voltage-controlled spin crossover molecular devices at dimensions below 10 nm, as a result of the high on-state resistance as discussed above. Yet, depending on the lithography resolution, the source drain distance could be decreased to lower the device resistance.",
                        "If the spin crossover molecular film thickness, acting as the semiconductor channel, is increased to 15 nm, this drops the device source to drain resistance to 667 MΩ. If a spin crossover complex with an on-state resistance of 0.5 Ω·cm is utilized, then the resistance drops further to 333 KΩ. For a transistor at the 20 nm node, this decreases the device source to drain resistance further to 167 KΩ. At the 30 nm node, device source to drain resistance drops even further to 111 KΩ, and at a channel width to 50 nm node, the resistance would about 67KΩ. Accordingly, a thin film molecular memory can include a spin crossover molecular layer having a channel thickness of at least 10 nm.",
                        "The following table shows spin crossover molecular multiferroic field effect transistor characteristics as demonstrated in a nonvolatile voltage-controlled device (experiment) and what might be possible from other experiments on spin crossover complexes.",
                        "The speed of the memory read is the major factor of concern when considering device resistance. There is no hard limit to resistance maximum, but for every doubling of memory resistance, to a first order approximation, the read time doubles. For some types of memory, for example NAND flash, a very slow read time is acceptable, but this is in order to achieve a very compact memory cell. In the case of magnetoelectric memory cells, the base cell size is bigger than the flash cell, and so this arena of very compact memory is not an area where nonvolatile multiferroic molecular devices, fabricated from spin crossover molecular complexes, is likely to be competitive. Instead, the target for nonvolatile multiferroic molecular devices, fabricated from spin crossover molecular complexes, is faster cache memories. With these possible implementations, it is acceptable to increase the width of the memory cell, within limits, and a cell width up to about 80 nm (with gate length of 12 nm) may be acceptable. A major advantage of the nonvolatile multiferroic devices, fabricated from spin crossover molecular complexes is that there is the possibility of 3D integration of this technology, which can drastically increase the memory capacity. The fact that the multiferroic molecular device fabrication temperatures are low allows many layers of such devices to be fabricated on a silicon chip without damaging the underlying Si transistor devices. This becomes particularly interesting in the case of crossbar arrays of nonvolatile multiferroic molecular devices, as in that implementation, one does not need one Si transistor per each cell.",
                        "The nonvolatile multiferroic devices fabricated from spin crossover molecular complexes also appear to be competitive with zinc-tin oxide thin-film transistors and other amorphous oxide semiconductor transistor schemes that might be used in flexible electronics like displays. The nonvolatile multiferroic devices fabricated from spin crossover molecular complexes are molecular thin film devices and, thus, flexible.",
                        "Recitation of ranges of values herein are merely intended to serve as a shorthand method of referring individually to each separate value falling within the range, unless otherwise indicated herein, and each separate value is incorporated into the specification as if it were individually recited herein. For example, if a thickness range is stated as 1 to 50, it is intended that values such as 2 to 40, 10 to 30, or 1 to 3, etc., are expressly enumerated in this specification. These are only examples of what is specifically intended, and all possible combinations of numerical values between and including the lowest value and the highest value enumerated are to be considered to be expressly stated in this disclosure. In addition, a value of a structural parameter is intended to include process tolerances (e.g., where a value such as 1 nm should be understood to cover that value +/−a tolerance value) due to fabrication tolerances and depends on technology node.",
                        "Although the subject matter has been described in language specific to structural features and/or acts, it is to be understood that the subject matter defined in the appended claims is not necessarily limited to the specific features or acts described above. Rather, the specific features and acts described above are disclosed as examples of implementing the claims and other equivalent features and acts are intended to be within the scope of the claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe thin film molecular memory",
                        "introduce system fabrication",
                        "describe circuit substrate and thin film molecular memory",
                        "detail transistor devices",
                        "motivate molecular systems",
                        "introduce spin crossover phenomenon",
                        "describe voltage-controlled isothermal changes",
                        "detail molecular multiferroic device",
                        "provide criteria for competitive molecular spintronic device",
                        "introduce nonvolatile memory element cell",
                        "describe field effect voltage-controlled spin state molecular transistor",
                        "detail nonvolatile spin crossover molecular devices",
                        "introduce low coercive voltage and low write peak currents",
                        "describe thin ferroelectric layer adjacent to spin crossover molecular layer",
                        "detail molecular ferroelectric gate dielectrics",
                        "introduce ferroelectric layer formation",
                        "describe dipolar molecular additives",
                        "describe organic ferroelectric material",
                        "detail coercive voltages for ferroelectric layers",
                        "introduce critical electric field Ecr",
                        "describe inorganic ferroelectric layers",
                        "detail problems with inorganic ferroelectric layers",
                        "introduce organic ferroelectric thin films",
                        "describe problems with organic ferroelectric thin films",
                        "introduce current density requirements",
                        "describe gate supply voltage requirements",
                        "introduce device on/off ratio",
                        "detail on/off ratio improvements",
                        "describe two-terminal diode like device",
                        "introduce nonvolatile conductance change",
                        "describe on/off ratio requirements for memory cells",
                        "introduce thin film quality requirements",
                        "describe approaches to film fabrication",
                        "detail evaporated thin film architectures",
                        "introduce spin crossover molecular devices",
                        "discuss ability to lock spin state",
                        "explain influence of ferroelectric substrate",
                        "describe isothermal spin state switching",
                        "discuss read operation",
                        "explain conductance change",
                        "discuss room temperature operation",
                        "explain on-state resistivity",
                        "discuss limitations of on-state resistivity",
                        "describe alternative spin crossover complexes",
                        "discuss device schematic",
                        "explain device switching speed",
                        "discuss limitations of switching speed",
                        "describe device endurance",
                        "discuss ability to scale devices",
                        "explain limitations of scaling",
                        "discuss device implementation",
                        "explain impact of film thickness",
                        "discuss device characteristics",
                        "explain memory read speed",
                        "discuss limitations of memory read speed",
                        "describe target applications",
                        "explain advantages of 3D integration",
                        "discuss compatibility with silicon devices",
                        "describe crossbar arrays",
                        "explain flexibility of devices",
                        "discuss competitive devices",
                        "explain recitation of ranges",
                        "discuss process tolerances",
                        "explain scope of claims",
                        "discuss equivalent features and acts",
                        "conclude claims"
                    ],
                    "num_characters": 33683,
                    "outline_medium": [
                        "describe thin film molecular memory",
                        "introduce system fabrication",
                        "motivate molecular systems",
                        "describe spin crossover phenomenon",
                        "summarize voltage-controlled isothermal changes",
                        "provide criteria for competitive molecular spintronic devices",
                        "describe nonvolatile memory element cell",
                        "illustrate nonvolatile memory element",
                        "discuss low coercive voltage and low write peak currents",
                        "describe ferroelectric layer formation",
                        "discuss coercive voltage scaling",
                        "describe organic ferroelectric thin films",
                        "discuss current density requirements",
                        "describe device on/off ratio",
                        "illustrate on/off ratio requirements",
                        "discuss thin film quality and scalability",
                        "describe approaches to film fabrication",
                        "introduce spin crossover molecular devices",
                        "motivate nonvolatile molecular spin crossover devices",
                        "limitations of prior art devices",
                        "application of ferroelectric substrate",
                        "influence of substrate on spin state",
                        "device fabrication and film thickness",
                        "isothermal spin state switching",
                        "read operation and conductance change",
                        "room temperature operation",
                        "on-state resistivity and scaling issues",
                        "alternative spin crossover complexes",
                        "device switching speed and ferroelectric polarization",
                        "device endurance and switching cycles",
                        "scalability to 10 nm or below",
                        "device implementation and resistance considerations",
                        "comparison to other memory technologies"
                    ],
                    "outline_short": [
                        "describe thin film molecular memory",
                        "motivate molecular systems for memory devices",
                        "introduce spin crossover complexes for molecular spintronic devices",
                        "describe nonvolatile memory element cell",
                        "discuss low coercive voltage and low write peak currents",
                        "describe ferroelectric layer and its properties",
                        "discuss device on/off ratio and its importance",
                        "discuss thin film quality and scalability",
                        "describe spin crossover complex thin film properties",
                        "motivate nonvolatile molecular spin crossover device",
                        "summarize device write operation",
                        "describe device read operation",
                        "discuss room temperature operation",
                        "analyze on-state resistivity",
                        "discuss device switching speed and endurance",
                        "describe device scalability and potential applications"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A system, comprising:\na circuit substrate; and\na thin film molecular memory deposited on the circuit substrate in a back end of line process, wherein the thin film molecular memory comprises a memory device formed of a ferroelectric layer adjacent to a spin crossover molecular layer having a channel thickness of 10 nm to 50 nm.",
        "2. The system of claim 1, wherein the memory device is a two-terminal diode memory device.",
        "3. The system of claim 1, wherein the memory device is a four-terminal transistor memory device.",
        "4. The system of claim 1, wherein the ferroelectric layer is fabricated by evaporation.",
        "5. The system of claim 1, wherein the ferroelectric layer is fabricated by Langmuir-Blodgett thin film growth.",
        "6. The system of claim 1, wherein the ferroelectric layer comprises dipolar molecular additives.",
        "7. The system of claim 1, wherein the ferroelectric layer comprises an organic ferroelectric material.",
        "8. The system of claim 1, wherein the ferroelectric layer comprises benzimidazole, 2-methylbenzimidazole, 5,6-dichloro-2-methylbenzimidazole, bridged bis(benzimidazole), croconic acid, or a copolymer of polyvinylidene fluoride.",
        "9. The system of claim 1, wherein the circuit substrate comprises transistor devices.",
        "10. The system of claim 9, wherein the memory device of the thin film molecular memory is provided in plurality, wherein the plurality of memory devices is electrically connected to the transistor devices of the circuit substrate.",
        "11. The system of claim 10, wherein the plurality of memory devices is electrically connected to the transistor devices of the circuit substrate through vias and metal lines in the circuit substrate.",
        "12. The system of claim 9, wherein the transistor devices comprise complementary metal oxide semiconductor (CMOS) transistors.",
        "13. A memory device comprising:\na ferroelectric layer less than 5 nm thick adjacent to a spin crossover molecular layer having a channel thickness of at least 10 nm.",
        "14. The memory device of claim 13, wherein the memory device is a two-terminal diode memory device.",
        "15. The memory device of claim 13, wherein the memory device is a four-terminal transistor memory device.",
        "16. The memory device of claim 13, wherein the ferroelectric layer is fabricated by evaporation.",
        "17. The memory device of claim 13, wherein the ferroelectric layer is fabricated by Langmuir-Blodgett thin film growth.",
        "18. The memory device of claim 13, wherein the ferroelectric layer comprises dipolar molecular additives.",
        "19. The memory device of claim 13, wherein the ferroelectric layer comprises an organic ferroelectric material.",
        "20. The memory device of claim 13, wherein the ferroelectric layer comprises benzimidazole, 2-methylbenzimidazole, 5,6-dichloro-2-methylbenzimidazole, bridged bis(benzimidazole), croconic acid, or a copolymer of polyvinylidene fluoride."
    ]
}