{
    "id": "https://semopenalex.org/work/W3017644161",
    "authors": [
        "Rienk Offringa",
        "Edward W. Green",
        "Richard P. Harbottle",
        "Martin R. Sprick",
        "Corinna Klein",
        "Elisa Espinet",
        "Vanessa Vogel",
        "James A. Williams",
        "Matthias Bozza",
        "Alice De Roia"
    ],
    "title": "Novel Non-integrating DNA Nano-S/MAR Vectors Restore Gene Function in Isogenic Patient-Derived Pancreatic Tumor Models",
    "date": "2020-06-01",
    "abstract": "We describe herein non-integrating minimally sized nano-S/MAR DNA vectors, which can be used to genetically modify dividing cells in place of integrating vectors. They represent a unique genetic tool, which avoids vector-mediated damage. Previous work has shown that DNA vectors comprising a mammalian S/MAR element can provide persistent mitotic stability over hundreds of cell divisions, resisting epigenetic silencing and thereby allowing sustained transgene expression. The composition of the original S/MAR vectors does present some inherent limitations that can provoke cellular toxicity. Herein, we present a new system, the nano-S/MAR, which drives higher transgene expression and has improved efficiency of establishment, due to the minimal impact on cellular processes and perturbation of the endogenous transcriptome. We show that these features enable the hitherto challenging genetic modification of patient-derived cells to stably restore the tumor suppressor gene SMAD4 to a patient-derived SMAD4 knockout pancreatic cancer line. Nano-S/MAR modification does not alter the molecular or phenotypic integrity of the patient-derived cells in cell culture and xenograft mouse models. In conclusion, we show that these DNA vectors can be used to persistently modify a range of cells, providing sustained transgene expression while avoiding the risks of insertional mutagenesis and other vector-mediated toxicity.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Rescuing the function of mutated genes in tumor cells can help to define their molecular role and provide an insight into their interactions and the processes that drive the transformation of a normal cell toward cancer without disturbing other cellular processes. A variety of different methods have been developed to generate genetically modified tumor cells, and the most effective system for delivering genes to cells is based on the use of vectors derived from modified viruses.1 However, despite the advantages of these vectors, they also have significant limitations mainly related to their random integration into the cellular genome, the potential immunogenicity of virally encoded genes, as well as the silencing of the transgenic material over time. Each unintended consequence of genetic engineering is likely to mask or interfere with the molecular analysis of the genetic restoration. It is therefore imperative that the genetic modification has only a minimal vector-mediated impact on the molecular behavior of a cell, particularly when working with primary or patient-derived cells that are more likely to react against foreign genetic material. Previous work has established that DNA vectors comprising a nuclear scaffold/matrix attachment region (S/MAR) element and mammalian promoters allow long-term transgene expression in cancer cell lines, both in vitro and in vivo.2, 3, 4 S/MARs mediate the binding of episomal vectors to the chromosomal scaffold during mitosis, providing sustained expression and mitotic stability over hundreds of cell divisions.5,6 In the context of minicircle vectors, these motifs lead to a higher and more sustained transgene expression when compared to conventional plasmids, presumably due to the lack of bacterial sequences often characterized by the presence of CpG dinucleotides, responsible for the initiation of the vector silencing.7 Nevertheless, the production of minicircles is a laborious process that implies intramolecular recombination8 followed by purification steps designated to separate the producer vector from the minicircle. To overcome these problems, an alternative antibiotic-free selection system was established by Luke et al.9 for the production of minimally sized plasmids. As minicircles, these antibiotic-free (AF) selectable vectors combine a highly productive fermentation (>1 g/L plasmid DNA yield) and enhanced transgene expression when compared to respective plasmids with antibiotic selection.10, 11, 12 Herein, we describe the incorporation of the S/MAR sequence previously described by Piechaczek et al.13 into plasmids containing an optimized bacterial backbone (pS/MAR) and minimalistic AF vectors (nS/MAR). In this study, we directly compare plasmid vectors to nanovectors and show that nS/SMAR DNA vectors produce more robust transgene expression and have a higher efficacy in the episomal establishment of dividing cells, and we report on their application for the genetic modification of primary pancreatic cancer (PC) cells with a particular focus on vector-mediated toxicity and an analysis of the molecular integrity of the engineered cells. Herein, we report that this new class of DNA vectors has a minimal impact on the target cell genome and that they are capable of providing sustained genetic supplementation of the tumor suppressor SMAD4 in primary pancreatic cancer models in vitro and in vivo. We conclude that this system can be considered a potent tool for the generation of reliable cancer models."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Generation Of Capan-1 Isogenic Cells And Rescue Of The Tumor Suppressor Gene Smad4 With Non-Integrating Ps/Mar Vectors",
                    "paragraphs": [
                        "Pancreatic adenocarcinoma is one of the most lethal types of cancer,14 with a mortality rate second only to lung cancer.15,16 A simple and effective method to generate reliable tumor models is therefore necessary to further understand this disease. For our initial study, we used the pS/MAR DNA vector system to modify the pancreatic cancer cell line Capan-1 stably in vitro. We generated the pS/MAR-luciferase (pS/MAR-Luc) and the pS/MAR-SMAD4-luciferase (pS/MAR-SMAD4-Luc) vectors that were used to produce the stable cell lines Capan-1 luciferase and Capan-1 SMAD4-Luc. The tumor suppressor SMAD4 (DPC4 [deleted in pancreatic cancer 4]) was chosen as a model, as its loss is one of the best characterized events in pancreatic cancer development.17 In the modified cell populations, the expression of SMAD4 was evaluated by quantitative real-time PCR and western blot (Figure 1A), and its functional rescue was demonstrated through the activation of the SMAD4-dependent genes SnaiL18 and p2119,20 (Figure S1). Next, we analyzed the impact of SMAD4 restoration in in vivo tumor growth by injecting CAPAN-1 luciferase or CAPAN-1 SMAD4-Luc cells orthotopically into the pancreas of NSG mice. SMAD4 expression was robustly maintained (Figure 1D), and, as previously described,21 its functional rescue leads to a reduction in tumor growth (Figure 1B). All mice injected with parental or luciferase control cells developed invasive primary tumors, while those injected with SMAD4-restored tumor cells showed small and non-invasive accumulations of transplanted cells (Figure 1C). Both DNA vectors used for the modification of these cells expressed the reporter gene luciferase, which allowed the interrogation of the presence of disseminated cells in the injected mice. Whereas control Capan-1 luciferase formed metastasis in the liver and the lungs, no metastatic events were observed in mice injected with SMAD4-restored cells (Figure S2A). Histopathological analysis revealed that Capan-1 luciferase cells developed tumors (Figure 1C) phenotypically similar to those formed from the unmodified parental tumor cell line, characterized by a differentiated ductal structure. In contrast, cells expressing SMAD4 formed primary tumors that appeared less differentiated with higher recruitment of stromal cells as previously reported.22 As the Capan-1 luciferase and parental cells generated identical primary tumors and retained a similar metastatic potential (Figure S2B), the differences observed in the tumor masses generated by Capan-1 SMAD4-Luc cells together with the restriction of their metastatic potential appear to be entirely dependent on the restoration of the tumor suppressor gene. Primary tumors from Capan-1 luciferase and Capan-1 SMAD4-Luc cell lines were compared for the phenotype (Figure 1A), proliferation with the staining of Ki67 (Figure 1B), and expression of SMAD4 (Figures 1C and 1D). Capan-1 SMAD4-Luc tumors showed a lower proliferative rate, as estimated by Ki67 expression, explaining the smaller tumor size achieved. Positive staining for SMAD4 confirmed the DNA vector activity and capability of providing sustained transgene expression following orthotropic injection and tumor development.Figure 1Delivery of pS/MAR-SMAD4 DNA Vectors Rescues the Tumorigenic Phenotype of SMAD4 Mutant Pancreatic Cancer Cell LinespS/MAR-luciferase (pS/MAR Luc) and pS/MAR-SMAD4-luciferase (pS/MAR SMAD4-Luc) DNA vectors were generated by introducing the transgene expression cassettes under the control of the ubiquitin C promoter (UbiC). (A) The expression of SMAD4 in modified Capan-1 was evaluated by real-time quantitative PCR (qPCR) and western blot in comparison to HEK293T cells, which constitutively express SMAD4. The impact of SMAD4 in the tumor growth was evaluated in vivo by injecting 5 × 105 Capan-1 cells expressing either the reporter gene luciferase or a combination of SMAD4 and luciferase orthotopically into the pancreas of NSG mice. (B) Capan-1 SMAD4-Luc cells generated significantly smaller tumors than did Capan-1 luciferase (n = 4 per group analyzed with one-way ANOVA followed by Tukey’s post hoc test for multiple comparisons, ∗p = 0.0141). (C) Histopathological analysis reveals that the luciferase-modified cells developed a tumor with identical morphology as those formed from the parental cell line, while the rescue of SMAD4 induces profound changes. (D) Capan-1 luciferase and Capan-1 SMAD4-Luc-derived tumors were assessed for histology by hematoxylin and eosin (H&E), proliferation (Ki67), and SMAD4 expression."
                    ],
                    "subsections": []
                },
                {
                    "title": "Genome-Wide Rna Analysis Of Capan-1 Isogenic Cells",
                    "paragraphs": [
                        "Next, we investigated the molecular changes occurring in the cells provoked by the vector and by the reintroduction of SMAD4. To this end, we performed genome-wide RNA profile analysis of the primary tumors formed by parental, control-luciferase, or SMAD4-Luc Capan-1 cells. The expression profiles of 351 genes were perturbed in Capan-1 luciferase cells when compared to the parental control cell (±2-fold, p < 0.05; Table S1; Figure 2A). Gene set enrichment analysis (GSEA) was performed to understand better the interaction between the vector and the cellular genome, which revealed enrichment for the hallmarks associated with several inflammatory responses such as a signature response to interferon-α (Figure 2C). The interferon-α pathway is associated with the cellular immune response to viral infection. It is part of the innate immunity, and it is triggered by cytoplasmic proteins that recognize an infectious agent’s genome during its translocation into the nucleus. The fact that these signatures appeared enriched in the analysis suggested that pS/MAR was also recognized as a foreign entity and its presence induced an inflammatory state. The reintroduction of functional SMAD4 was accompanied by the dysregulation of 825 genes (±2-fold, p < 0.05) when compared to Capan-1 parental cells. Of those, only 189 genes (Figure 2B) were specific for Capan-1 SMAD4-Luc cells when compared to Capan-1 luciferase control cells. GSEA analysis revealed strong enrichment in epithelial-to-mesenchymal transition (EMT) genes and the apoptotic hallmark signatures (Figure 2D), in line with previous reports where ex vivo rescue of SMAD4 in mouse or human pancreatic cancer cells functionally induced the EMT transition that leads the apoptosis and cell death.22 In accordance with Liu et al.23 and Câmara et al.,24 also in Capan-1 SMAD4-Luc cells EMT markers such as vimentin and fibronectin were shown to be upregulated in comparison to Capan-1 luciferase and parental cells (Figure S3). Although a significant number of genes were found to be perturbed in Capan-1 luciferase cells, they had limited influence on the cells’ behavior during tumor development and/or the metastatic process in the experimental setting. In contrast, the interruption of cancer development, as well as the phenotypic changes observed in the Capan-1 SMAD4-Luc cells, can be attributed to the rescue of SMAD4.Figure 2Genome-wide Transcriptome Analysis of modified Capan-1 cells(A and B) Volcano plots showing the gene expression changes of Capan-1 luciferase versus Capan-1 parental (A) and Capan-1 SMAD4-luciferase versus Capan-1 luciferase (B). Highlighted in red are genes with a fold change of 2 and p < 0.05. (C) Gene set enrichment analyses (GSEA) of interferon-α and inflammatory response in Capan-1 luciferase versus parental cells. (D) GSEA of epithelial-to-mesenchymal transition and apoptosis signature in Capan-1 SMAD4 versus Capan-1 luciferase cells. ES, enrichment score; NES, normalized enrichment score; FDR, false discovery rate."
                    ],
                    "subsections": []
                },
                {
                    "title": "Nano-S/Mar Is Maintained Episomally And Has An Improved Establishment Efficacy Compared To The Ps/Mar Vectors",
                    "paragraphs": [
                        "We previously showed the successful restoration of the tumor suppressor gene SMAD4 into Capan-1 cells using the non-integrative pS/MAR DNA vector system. Although macroscopically the model reflected the results described in the literature,25 microarray analysis showed that the plasmid vector itself had a strong impact on the transcriptome of the cells. We reasoned that these effects are a consequence of the presence of bacterial sequences in the vector, such as the origin of replication and the selection marker. These may lead to the inflammatory responses observed. To overcome this problem, we decided to introduce the S/MAR sequence derived from the human β-interferon gene cluster26 into an optimized minimally sized antibiotic-free (AF) plasmid9—the nano-S/MAR vector (nS/MAR). Figure 3A represents a schematic depiction of the plasmid. The S/MAR sequence was placed after an expression cassette in which the cytomegalovirus (CMV) promoter drives the expression of the reporter gene GFP and the antibiotic selection puromycin (Puro) divided by the P2A linker sequence. The position of the S/MAR within the vector was determined by the work of Stehle et al.,27 where they demonstrated that an active transcription upstream of the S/MAR running into this sequence was required for episomal replication and long-term vector maintenance.28 A control vector named pS/MAR was also generated. This plasmid contained an identical expression cassette and S/MAR composition along with a bacterial backbone comprising the pUC origin of replication and a kanamycin antibiotic resistance gene. HEK293T cells were transfected with nS/MAR and pS/MAR vectors, and their capacity to establish stable cells was evaluated in a colony-forming assay as previously described29 (Figure 3B). The nS/MAR vector generated a significantly higher (p = 0.0003) number of established cells that were also characterized by a significantly higher level (p < 0.0001) of transgene expression (Figure 3C). The molecular integrity and episomal maintenance of both nS/MAR and pS/MAR vectors in the established cell populations were determined 35 days after DNA delivery by Southern blot (Figure 3D) where DNA isolated from the modified cells was compared to linearized control vectors. The absence of smears or alternative bands to those that matched the size of the control vectors confirms the stable maintenance of the plasmids as well as their extrachromosomal replication and transmission during cell division.Figure 3Nano-S/MAR Has Improved Establishment Efficiency, Sustains Higher Transgene Expression, and Is Maintained Episomally in the Nuclei of Target Cells(A) Schematic depiction of pS/MAR and nS/MAR DNA vectors. In nS/MAR vectors, the RNA-OUT R6K Ori system replaces the bacterial backbone comprising the bacterial origin of replication and the selection marker. (B) Number of colonies 35 days after GFP+ selection. In the plots the line represents the median of four independent replicates per group analyzed with the t test for significance (p = 0.0003). (C) nS/MAR vectors were shown to provide a more robust transgene expression in established cells when compared to the respective plasmid with the bacterial backbone (analyzed by t test p < 0.0001). (D) Southern blot showing the molecular integrity and the episomal maintenance of the vectors."
                    ],
                    "subsections": []
                },
                {
                    "title": "Genetic Modification Of Primary Pancreatic Cancer Cells With Nano-S/Mar Vectors And Rescue Of Smad4 Functionality",
                    "paragraphs": [
                        "To evaluate the efficacy of the new nS/MAR vectors, we utilized a well-described and representative patient-derived xenografted (PDX) pancreatic cancer cell line.30 These cells, named PACO2, were derived from an aggressive pancreatic ductal adenocarcinoma by the orthotopic expansion of a patient’s tumor biopsy in NSG mice and further isolation and culture of the epithelial tumor cells. The cells have been maintained at low passage in carefully controlled media and have been characterized to closely represent the primary tumor cells from which they are derived.30 These cells provide an ideal platform to test the nS/MAR system because of their chronic, high levels of anti-pathogenic cytokines such as interferon that make them a challenge to transfect with typical plasmids, which carry a traditional bacterial backbone. PACO2 cells carry a mutation in their SMAD4 locus, which allowed us to test the rescue of this tumor suppressor gene in these PDX cells.",
                        "First, both pS/MAR-GFP and nS/MAR-GFP DNA vectors were transfected into PACO2 cells. The transfection efficiency and the viability of the cells were then assessed by fluorescence-activated cell sorting (FACS) (Figure 4A). Strikingly, the nS/MAR-GFP vector performed significantly better than the pS/MAR-GFP plasmids, demonstrating that these vectors can be efficiently delivered to primary human cells, which are typically refractory to transfection. The cells also retained high viability compared to cells transfected with the pS/MAR DNA vector throughout this procedure. Using the nS/MAR technology, we then generated two different engineered PACO2 cell lines: PACO2 nS/MAR-GFP (PACO-2 GFP) cells, which express the reporter gene, and PACO2 nS/MAR-SMAD4-GFP (PACO-2 SMAD4-GFP) cells, in which the expression of SMAD4 is coupled via a P2A sequence to the GFP. After 30 days the modified cells were analyzed by flow cytometry for the expression of the reporter gene GFP (Figure 4B), which showed that the PACO2 GFP cells produced high levels of transgene expression (Figure 4C). The reintroduction of SMAD4 was confirmed by western blot (Figure 4C) using Panc-1, a pancreatic cancer cell line with no mutation or loss of the SMAD4 genetic locus, as a control reference. The molecular integrity and episomal stability of the nanovectors in modified primary cells were determined via Southern blot (Figure S4) where the presence of single sharp bands of the expected size confirmed the extrachromosomal maintenance and episomal segregation of these plasmids in dividing cells.Figure 4Genetic Modification of Primary Pancreatic Tumor Cells (PACO2) Using nS/MAR DNA Vector TechnologypS/MAR and nS/MAR vectors expressing the reporter gene GFP were transferred into PACO2 cells through electroporation. (A) The viability and the efficiency (number of viable GFP+ cells) of transfection were evaluated by flow cytometry and are represented as boxplots, where the line represents the median (n = 3, analyzed by t test; viability, p = 0.0012; transfection efficiency, p < 0.0001). (B) PACO2 primary pancreatic cancer cells were established with nS/MAR-GFP and n/MAR-SMAD4-GFP (nS/MAR-SMAD4). (C) The expression of the reporter gene GFP was evaluated in flow cytometry in comparison to parental unmodified PACO2 cells. Western blot analysis shows successful re-introduction of SMAD4 in nS/MAR-SMAD4 PACO2 cells. SMAD4 wild-type (WT) Panc-1 cells are shown as a control. (D) Volcano plot showing the gene expression changes of PACO2 GFP versus parental cells. Highlighted in red are genes with a fold change of 2 and p < 0.05."
                    ],
                    "subsections": []
                },
                {
                    "title": "Impact Of Ns/Mar Vector In The Transcriptome Of Modified Cells",
                    "paragraphs": [
                        "We then investigated the impact of the nanovectors on the PDX cells and the molecular and cellular consequences caused by the restoration of SMAD4. For this, genome-wide RNA profile analysis of the established GFP and SMAD4-GFP PACO2 cells, as well as the parental lines, were performed. Four biological replicates were prepared for each cell line 1 month after DNA delivery, and the differences in the relative gene expression profiles of each were evaluated. Strikingly, the nS/MAR-GFP vector had a minimal impact on the cells (Figure 4D) with only two genes having appeared significantly perturbed ±2-fold (p < 0.05; Table S3). In contrast, the re-introduction of functional SMAD4 generated a more prominent effect on the cellular transcriptome, with 169 genes that appeared perturbed when the same analysis was performed (Figure 5A; Table S4).Figure 5In Vitro Restoration of SMAD4 Functionality in Primary Models(A and B) Differentially expressed genes were analyzed with a >2-fold and less than −2-fold log fold change (FC) (p < 0.05) (A) and further validated in gene set enrichment analysis (GSEA) (B), where PACO2 SMAD4 cells showed strong enrichment for the hallmarks underlying the epithelial-to-mesenchymal transition and the activation of the TGF-β pathways when compared to the PACO2 GFP control line. (C) The impact of SMAD4 on tumor growth was evaluated in vivo by injecting 5 × 105 PACO2 parental, PACO2 GPF, and PACO2 SMAD4 cells orthotopically into the pancreas of NSG mice. The weight of the pancreas was used as a measure of tumor growth, and we showed that mice injected with PACO2 cells had significantly lighter organs than did animals injected with the control cell lines (n = 10 for PACO2 parental, n = 12 for PACO2 GFP and SMAD4 analyzed by one-way ANOVA followed by the Tukey’s post hoc test for multiple comparisons). (D) Primary tumors obtained from the orthotopic injection of not modified and PACO2 GFP cells were assessed for morphology with H&E staining, proliferation via staining with the proliferative marker Ki67, and for the expression of SMAD4. The tumors formed from PACO2 modified with the reporter gene GFP showed a defined ductal differentiation typical of pancreatic cancers with a high proliferate rate and negative expression for SMAD4 identical to unmodified parental PACO2 cells. (E) Cells where SMAD4 functionality was restored did not form tumors when engrafted into mice. The outgrowing masses originated from human cells (CK19 positive), were actively proliferating (Ki67 positive), and did not stain positive for SMAD4 expression.",
                        "GSEA was then performed to prove that the vectors can provide the sustained expression of functional SMAD4 in vitro. The EMT and the transforming growth factor β (TGF-β) pathways (Figure 5B) were enriched, demonstrating the capability of the nS/MAR vector technology to provide genetic rescue and the sustained and restored functionality of the tumor suppressor gene SMAD4."
                    ],
                    "subsections": []
                },
                {
                    "title": "Modified Primary Pancreatic Cancer Cell Xenograft Models And Smad4 Rescue",
                    "paragraphs": [
                        "Finally, to evaluate the in vivo impact of the nanovectors on the behavior of PACO2 cells, 0.5 × 105 cells were injected orthotopically into NSG mice. PACO2-GFP, PACO2 SMAD4-GFP, and the PACO2 parental cells were used for the study, and the xenografted tumors in the pancreas were evaluated for morphology, proliferation, and SMAD4 expression.",
                        "All (12/12) mice injected with PACO2 GFP developed primary tumors in their pancreases, and in 11/12 cases the tumor also grew out into the abdominal cavity. Additionally, every (10/10) mouse treated with PACO2 parental cells formed tumors in their pancreas, and 4/10 also developed masses in the abdominal cavity. This markedly contrasts with only 2/12 mice injected with PACO2 SMAD4-GFP developing primary tumors in their pancreas, and none showing cells outgrowing into their abdominal cavity (Figure S5). The total weight of the pancreases was used as a measure of tumor growth, and mice injected with the SMAD4-restored cells had significantly smaller tumors than did mice injected with the unmodified parental line and GFP cell line (Figure 5C). Tumors formed by PACO2 GFP cells presented similar morphology to those created with the unmodified parental PACO2 cells (Figure 5D) with tumorous ductal glands and extensive fibrosis. They showed active proliferation and were characterized by the absence of SMAD4 expression. Histological analysis of the few tumors that grew in the pancreas of mice injected with PACO2 SMAD4-GFP cells revealed that these tumors were derived from most likely cells that do not express SMAD4 and they were actively proliferating (Ki67 positive) (Figure 5E). Moreover, their morphology matched those of PACO2 GFP and PACO2 parental cells. PACO2 cells modified with the reporter gene maintained their original behavior, demonstrating that the episomal nS/MAR vector had no effect on the behavior of the cells or their molecular integrity. Therefore, the observed impact on the SMAD4 rescued cells can be fully attributed to the restored functionality of the tumor suppressor gene."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Pancreatic ductal adenocarcinoma (PDA) is considered one of the most malignant types of cancer with relatively late detection and poor prognosis,14 with only 10%–15% of patients eligible for surgery, which is currently the only curative option.31 Several methods have been developed to unravel the genetic basis of PDA ranging from the generation of transgenic mouse models32 to the in vitro modification of cancer cell lines and explanted primary cells. The in vitro or ex vivo genetic modification of cells relies on the use of integrating vectors to generate cells that can persistently and stably express a gene of interest through cell division. These systems are mostly represented by integrating viral vectors such as lentivirus that take advantage of the integrating nature of the virus to transfer the genetic material into the cellular genome. In this process, the integration of the gene of interest happens randomly into the target cells, which may result in unstable transgene expression over time. The necessity of adequate facilities for viral handling as well as the laborious process necessary for their preparation and purification make these vectors not the ideal tool to swiftly generate tumor models. Then, viral antigens and nucleic acids can trigger the cellular immune response against infectious agents that generate undesired perturbation in the cellular and molecular behavior, leading to a high background during the studies. S/MAR vectors are a unique class of DNA constructs that can provide long-term transgene expression and mitotic stability in mammalian cells without relying on toxic viral components or random integration that can potentially disrupt the molecular behavior of the targeted cells. In this study, the pS/MAR vector was engineered with the aim of generating pancreatic cancer tumor models with a particular application of the rescue of the tumor suppressor gene SMAD4. The loss of SMAD4 is one of the best characterized events in pancreatic cancer development. In approximately 30% of all pancreatic cancers, SMAD4 is homozygously deleted, and another 20% display missense, nonsense, or frameshift mutations. The downregulation of SMAD4 counteracts TGF-β-induced cell cycle arrest and apoptosis, but the restoration of this tumor suppressor gene can reverse the invasive phenotype as well as attenuate the proliferation of pancreatic cancer cells.33 In this study, we generated two vectors: pS/MAR-Luc, responsible for the expression of the reporter gene luciferase, and pS/MAR SMAD4-Luc, where the expression of the tumor suppressor gene SMAD4 was linked to luciferase through the P2A self-cleavage sequence. These vectors were used to engineer the commonly used pancreatic cancer cell line Capan-1 genetically. We first investigated the capacity of the vectors to generate stable cell lines and to restore the expression of SMAD4 in vitro before these cells were used for the generation of orthotropic xenograft mouse models. We showed not only that we could restore the expression of a key tumor suppressor gene in vitro, but also that the engineered cells retained a stable expression of the transgene in vivo. The histopathological analysis of Capan-1 luciferase tumors showed that the modification of the cells with this vector technology had a minimal impact on the cells’ behavior, as they formed tumors that displayed a highly differentiated pancreatic adenocarcinoma morphology similarly to tumors formed from the unmodified parental Capan-1 cell line. The metastasis in the liver and in the lungs of mice injected with parental Capan-1 and Capan-1 luciferase cells also confirmed that the presence of the vector did not molecularly alter the cells’ behavior, and they retained their aggressive metastatic potential. In contrast, Capan-1 SMAD4-Luc cells formed tumors in the pancreas that appeared smaller with a lost capability of forming metastasis. Although the presence of the episomal vector did not influence the growth of the cells, the transcriptome analysis of Capan-1 luciferase cells revealed that at the molecular level the presence and the extrachromosomal replication of plasmids carrying bacterial sequences were responsible for the perturbation of about 400 genes that are mostly associated with antiviral and inflammation responses. These findings are in accordance with previous reports, where it was demonstrated that the presence of bacterial sequences in plasmids is responsible for the cell responses against foreign DNA that leads to its epigenetic silencing. As expected, the transcriptome analysis did not show upregulation for the transcripts responsible for the expression of the SMAD4 protein, as the microarray probes do not match the codon-optimized transgenic sequence (Figure S6). To improve the efficacy of our DNA vector technology and to test the potential toxicity of extraneous bacterial sequences, we decided to swap the bacterial backbone composed of a pUC origin of replication and the selectable selection kanamycin for the RNA-OUT system developed at Nature Technology Corporation (NTC). We called this novel class of minimally sized antibiotic-free vector DNA plasmids nano-S/MAR (nS/MAR). This new generation of DNA vectors was compared to the respective traditional plasmids in HEK293T cells, and we could show that the nS/MAR vectors had a higher establishment of efficacy and that they sustained more robust transgene expression in the established clones over time for a minimum of 35 days. In accordance with what was previously reported by Argyros et al.,3 cells that are modified with a plasmid carrying minimal bacterial sequences are characterized by a higher transgene expression, most likely due to a significant reduction in the CpG content. Also, in this novel class of vectors, the presence of the S/MAR sequence mediated the extrachromosomal replication, as we could demonstrate by Southern blot. We further challenged this vector technology in human primary pancreatic cells (PACO2). PACO2 cells were demonstrated to have a high constant secretion of the antiviral cytokine interferon-β,34 which makes them challenging to transfect with a canonical plasmid. The benefits of having a minimally sized bacterial backbone were evident in PACO2 cells where nS/MAR vectors could be more effectively delivered to cells. Furthermore, for the first time, we showed that the nS/MAR vectors could successfully be established in primary cells ex vivo and that the portion of unmodified cells was substantially reduced. As PACO2 cells carry a mutation in the SMAD4 locus, we could demonstrate the successful establishment of cell lines where we rescued the functionality of the tumor suppressor gene with nS/MAR vectors. At the molecular level, we investigated the impact of nS/MAR vectors on PACO2 cells by measuring their genome-wide RNA expression levels. PACO2-GFP cells surprisingly showed that although they had undergone the selection process and they were grown for 30 days with the episomal vectors, only two genes were perturbed by the process with changes in their expression profiles. This result shows the minimal impact of the vector system in primary cells during the engineering process. In high contrast, the PACO2 cells in which the expression of SMAD4 was rescued showed more profound changes, particularly in genes that were previously reported to be associated with SMAD4 functionality such as the transcriptional regulation of MMP1.35 The enrichment in the signature associated with TGF-β activation and EMT demonstrated the activity of the tumor suppressor gene and, indirectly, that the nS/MAR technology can provide the sustained expression of functional SMAD4 throughout hundreds of cell divisions. The parental and GFP PACO2 cells engrafted in mice with equivalent efficiency, forming indistinguishable tumors that grew out from the pancreas and into the abdominal cavity. The immunohistochemical analysis showed that the genetic modification of these cells with an nS/MAR-GFP had no impact on the behavior of the cells. They formed tumors that displayed the same aggressive phenotype characterized by ductal structures and active proliferation as demonstrated with the Ki67 staining. In contrast, the restoration of SMAD4 induced profound changes. The injected cells did not develop tumors in most mice, and in these cases where an outgrown tumor was found, it did not show the expression of the tumor suppressor, indicating that it arose from escaper cells. Before injection of PACO2 SMAD4-GFP cells, FACS analysis revealed that ∼97% of the cells were positive for the expression of the transgenic construct, and it is likely that the negative fraction of modified cell populations induced the tumor engraftment in a few mice.",
                "In this study, we conclude that although the originally described pS/MAR vectors can, in principle, be used to genetically modify most cell types, the presence of their large bacterial backbone represents a limitation in the application of this vector technology to primary cells that are known to respond against foreign DNA sequences. Herein, we show the generation of the nS/MAR nanovector platform, and we demonstrate its enhanced efficiency at modifying and generating novel cell lines that are characterized by higher transgene expression and lower vector-mediated molecular perturbation. We think that the novel nS/MAR DNA vector system will prove to be a valuable genetic tool useful for the generation of persistently modified isogenic cells, providing the utility to evaluate the expression of transgenes with minimal vector-mediated impact in cultured cell lines or typically refractory primary and patient-derived cells."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Vector Construction",
                    "paragraphs": [
                        "All of the vector modifications on pS/MAR were performed using the InFusion cloning strategy (Takara Biotech) following the manufacturer’s guidelines.",
                        "The vector pS/MAR ubiquitin C (UbiC)-luciferase was generated from the original pEPI vector. The UbiC promoter was introduced into the plasmid at the PcI restriction site (pS/MAR-UbiC), and the luciferase transgene was subsequently cloned into the vector through the BglII site. The luciferase-p2a-SMAD4 expression cassette was generated via PCR and cloned into the pS/MAR-UbiC plasmid at the BglII cloning site. p/MAR GFP was created replacing the GFP expression cassette of the original pEPI plasmid with the GFP-p2a-puromycin cassette generated by PCR.",
                        "nS/MAR-GFP and nS/MAR-SMAD4 were generated by swapping the bacterial backbone of the respective canonical plasmids with the R6K-RNA-OUT system developed at Nature Technology Corporation."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell Culture Conditions And Transfection",
                    "paragraphs": [
                        "HEK293T cells were maintained in DMEM medium (Sigma) supplemented with 10% fetal bovine serum (FBS) (Gibco) and 1× penicillin/streptomycin (Sigma). DNA constructs were transfected into HEK293T cells using JetPEI DNA transfection reagent (Polyplus-transfection). PACO2 cells were cultured as described by Noll et al.,30 and the transfection was carried with the Amaxa 4D-Nucleofector (Lonza) following the guidelines by Lonza. Briefly, 1 × 106 cells prior to transfection were isolated with Accutase (PromoCell) treatment and centrifuged at 200 × g for 5 min at room temperature. The supernatant was discarded, and the cells were re-suspended carefully in 100 μL of room temperature supplemented with Nucleofector solution SF per sample. 2 μg of plasmid DNA was then added to the solution, and the tube was gently flanked. The transfection was achieved by applying the pulse CM-120. After the pulse, 500 μL of pre-warmed media was added to the cuvette, and the cells transferred into a new well of a 12-well plate containing 1 mL of pre-warmed growth medium."
                    ],
                    "subsections": []
                },
                {
                    "title": "Colony-Forming Assay",
                    "paragraphs": [
                        "HEK293T cells were transfected with pS/MAR and nS/MAR. For each construct, 24 h post-transfection 100 positively transfected cells were plated into a 6-cm tissue culture dish after FACS sorting (FACSAria II) and cultured in the presence of 0.5 μg/mL puromycin (PanReac AppliChem) for 3 days. Cells were then cultured for 4 weeks in the absence of selection. Resistant colonies were fixed with 1% formaldehyde/PBS for 15 min at room temperature and subsequently stained with 0.5% crystal violet/25% methanol for 10 min at room temperature, as previously reported.29 Afterward, plates were rinsed with double distilled H2O (ddH2O) to remove excessive staining solution, and the colonies were counted."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "The results were generated using biological and technical replicates throughout each experiment. For data analysis, an unpaired t test was performed where the comparison was restricted to two groups, whereas when the analysis was extended to three or more groups, a one-way ANOVA followed by a Tukey’s post hoc test was performed for multiple comparisons."
                    ],
                    "subsections": []
                },
                {
                    "title": "Quantitative Real-Time Pcr",
                    "paragraphs": [
                        "Total RNA from Capan-1 parental, luciferase, and SMAD4 cells was extracted with the RNeasy kit (QIAGEN) and treated with a DNA-free kit (Thermo Fisher Scientific) following the manufacturers’ guidelines. 1μg of RNA was then reverse transcribed to cDNA with the RevertAid first strand cDNA synthesis kit (Thermo Fisher Scientific) prior to real-time quantitative PCR (qPCR) analysis into the LightCycler 96 (Roche). The expression of the transgenic construct SMAD4-P2A-luciferase (forward, 5′-ATCGGCAGCGGCGC-3′, reverse, 5′-GGGCCCAGGGTTTTCC-3′) was analyzed in Capan-1 parental, luciferase, and SMAD4-luciferase cells in comparison to the housekeeping gene β-actin (forward, 5′-CCTCGCCTTTGCTGCCGATCC-3′, reverse, 5′-GGATCTTCATGAGGTAGTCAGTC-3′). The following primers pairs were used to perform real-time quantitative PCR (qPCR) to evaluate the expression of vimentin (forward, 5′-TACAGGAAGCTGCTGGAAGG-3′, reverse, 5′-ACCAGAGGGAGTGAATCCAG-3′), SnaiL (forward, 5′-GCTGCAGGACTCTAATCCAGA-3′, reverse, 5′-ATCTCCGGAGGTGGGATG-3′), p21 (forward, 5′-TGAGCCGCGACTGTGATG-3′, reverse, 5′-GTCTCGGTGACAAAGTCGAAGTT-3′), and fibronectin (forward, 5′-GGGAGAATAAGCTGTACCATCG-3′, reverse, 5′-TCCATTACCAAGACACACACACT-3′)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Western Blot Analysis",
                    "paragraphs": [
                        "Cells were lysed in ice-cold radioimmunoprecipitation assay (RIPA) buffer (Cell Signaling Technology) for 30 min on ice, then the lysate was centrifuged at 12,000 × g for 15 min at 4°C, and the supernatant was transferred into a new tube. The proteins were separated by 4%–15% gradient SDS-PAGE and then transferred to polyvinylidene fluoride (PVDF) membranes using the standard program P3 (20 V for 7 min) of the iBlot 2 (Life Technologies). Western blot analyses were performed with the primary antibody anti-SMAD4 (B8, Santa Cruz Biotechnology), anti-p21 (C19, Santa Cruz Biotechnology), anti-SnaiL (L70G2, Cell Signaling Technology), anti-α-tubulin (DM1A, Sigma-Aldrich), and anti-GAPDH (G9, Santa Cruz Biotechnology). The peroxidase AffiniPure goat anti-mouse immunoglobulin G (IgG) (Jackson ImmunoResearch) was used as a secondary antibody to resolve the blots."
                    ],
                    "subsections": []
                },
                {
                    "title": "Southern Blot Analysis",
                    "paragraphs": [
                        "For DNA analysis, total DNA was extracted using the DNA Blood & Tissue kit (QIAGEN) and quantified using a NanoDrop 2000c spectrophotometer (Thermo Fisher Scientific). For Southern blot analysis, total DNA (10–15 μg) was digested overnight with BamHI mixed with 10× loading dye and separated on an 0.8% agarose gel at 20 mV overnight. The gel was immersed in 0.25 M HCl for 10 min, incubated twice for 15 min in depurination buffer, followed by a 15-min incubation in neutralization buffer. The gel was supported on a layer of Whatman 3MM paper with a tank containing 20× saline sodium citrate (SSC) nucleic acid transfer buffer. A Hybond-XL nylon membrane from Amersham Biosciences was soaked with buffer and placed on top of the gel, taking care to remove any bubbles. Once the paper towel was positioned, a weight was balanced on top, and the apparatus was left overnight to allow the complete transfer. The following day the apparatus was disassembled, and the nylon membrane was exposed to UV radiation for 1 min to cross-link the DNA to the membrane permanently. The GFP gene was used to generate DNA fragments that were labeled with 32P (Prime-It II random primer labeling kit, Agilent Technologies) and used as a probe. The hybridization was performed in Church’s buffer at 65°C for 16 h."
                    ],
                    "subsections": []
                },
                {
                    "title": "Facs Analysis",
                    "paragraphs": [
                        "For FACS analysis, HEK293T and PACO2 cells were detached from their culturing vessels with either trypsin or Accutase, washed three times in cold PBS, and resuspended in PBS containing 1% FBS. Prior to flow cytometry analysis (LSRFortessa, Becton Dickinson), the viability staining was performed by adding DAPI or the 7-aminoactinomycin D (7AAD) live/dead marker. Analysis of data was performed with the FlowJo software, which was also used to measure the median fluorescence intensity of the populations established with vector expression for the reporter gene GFP."
                    ],
                    "subsections": []
                },
                {
                    "title": "Orthotopic Injection",
                    "paragraphs": [
                        "NOD.Prkdcscid.Il2rgnull (NSG) mice were bred and housed under specific pathogen-free conditions at the central animal facility of the German Cancer Research Center (DKFZ). Female mice were used for the studies. All animal experiments were approved by the Governmental Committee for Animal Experimentation (Regierungspräsidium Karlsruhe).",
                        "For the orthotopic tumor growth experiments, 200,000 cells were mixed with Matrigel (2 mg/mL; Becton Dickinson) and injected into the mice’s pancreas. Engraftment of tumors and subsequent growth were monitored by regular palpation of the implantation site."
                    ],
                    "subsections": []
                },
                {
                    "title": "Gene Expression Analyses",
                    "paragraphs": [
                        "For the gene expression analysis of modified Capan-1, xenografted cells were harvested from the pancreas of the injected mice, and the RNA was extracted with the RNAeasy kit (QIAGEN), generating four replicates for each condition. The RNA from modified PACO2 cells was extracted with the same methodology. The DKFZ Core Facilities team performed expression analysis experiments using Illumina HumanHT-12 v4.0 gene expression BeadChips. The top differentially expressed genes were calculated using the limma package in RStudio employing an empirical Bayes model to generate moderated t test results. Figures were generated using the ggplot2 package. GSEA was conducted using the GSEA desktop application and the gene sets downloaded from the Broad Institute with 1,000 permutations. Quantile-normalized expression data were used as input."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunohistochemistry",
                    "paragraphs": [
                        "Tumor specimens were fixed in 10% formalin overnight and embedded in paraffin. For immunohistochemistry, slides were deparaffinized and rehydrated. Antigen retrieval was enhanced by boiling in a steam pot at pH 6 in Dako target retrieval solution (Dako) for 15 min, followed by cooling for 30 min and washing in distilled water. Nonspecific binding was blocked by using the Linaris avidin/biotin blocking kit (Vector Laboratories) according to the manufacturer’s instructions. Slides were incubated with primary antibodies for 30 min, rinsed in PBS-T (PBS with 0.5% Tween 20), incubated for 20 min with the appropriate secondary antibody using the Dako REAL detection system (Dako), and rinsed in PBS-T. After blocking of endogenous peroxidase and incubation with streptavidin-horseradish peroxidase (HRP) (20 min at room temperature), slides were developed with 3-amino-9-ethylcarbazole (AEC) (Dako) and counterstained with hematoxylin. All antibodies were diluted in Dako antibody diluent, including anti-SMAD4 (dilution 1:50; Santa Cruz), Ki67 (dilution 1:1,000, Sigma), and CK19 (dilution 1:200, Abcam)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Data Availability",
                    "paragraphs": [
                        "The data discussed in this publication have been deposited in NCBI’s Gene Expression Omnibus36 and are accessible through GEO: GSE142115 and GSE142117."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Author Contributions",
            "paragraphs": [
                "M.B. planned and performed the experiments, analyzed the data, and wrote the manuscript; E.W.G. performed the microarray analysis; A.D.R. participated in the experiments; C.K. performed the orthotopic injections; V.V. performed the immunohistological staining; E.E. planned the experiments and wrote the manuscript; R.O. and M.S. supervised the project; J.A.W. produced the nanoplasmids; and R.P.H. planned the experiments and wrote the manuscript."
            ],
            "subsections": []
        },
        {
            "title": "Conflicts Of Interest",
            "paragraphs": [
                "J.A.W. has commercial interests in Nature Technology Corporation (Lincoln, NE, USA)."
            ],
            "subsections": []
        }
    ]
}