{
    "id": "US20220228172",
    "authors": [
        "Meike Dorothee Holm-von Laer",
        "Emmanuel Heilmann",
        "Janine Kimpel",
        "Guido Wollmann",
        "Lisa Egerer",
        "Benedikt Hofer"
    ],
    "title": "Novel Mechanism to Control RNA Virus Replication and Gene Expression",
    "date": "2020-06-19 00:00:00",
    "abstract": "The present invention relates to a novel mechanism to control RNA virus replication and gene expression using a conditional protease approach using a specific protease inhibitor for regulation. More specifically it relates to a single-stranded RNA virus, preferably of the order Mononegavirales, comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease. The protease can be inhibited using a protease inhibitor and hence the protease and the cleavage site for said protease form a regulatable switch. By changing the insertion site of the regulatable switch from an INTRA- to an INTER-molecular location in the at least one protein essential for viral transcription and/or replication, the effect of the protease inhibitor can be altered from an ON switch to an OFF switch. RNA virus may further encode a heterologous protein, the expression of which is then regulated by regulating viral activity. The ON switch may also be used in an RNA virus to directly regulate heterologous protein expression. Further provided are in vivo and in vitro uses of said virus with conditional viral activity or heterologous protein expression.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a novel mechanism to control RNA virus replication and gene expression using a conditional protease approach using a protease specific inhibitor for regulation. More specifically it relates to a single-stranded RNA virus, preferably of the order Mononegavirales, comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease. The protease can be inhibited using a protease inhibitor and hence the protease and the cleavage site for said protease form a regulatable switch. By changing the insertion site of the regulatable switch from an INTRA- to an INTER-molecular location in the at least one protein essential for viral transcription and/or replication, the effect of the protease inhibitor can be altered from an ON switch to an OFF switch. RNA virus may further encode a heterologous protein, the expression of which is then regulated by regulating viral activity. The ON switch may also be used in an RNA virus to directly regulate heterologous protein expression. Further provided are in vivo and in vitro uses of said virus with conditional viral activity or heterologous protein expression."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to RNA virus replication control",
                        "introduce conditional protease approach"
                    ],
                    "num_characters": 1241,
                    "outline_medium": [
                        "introduce RNA virus replication control"
                    ],
                    "outline_short": [
                        "introduce RNA virus replication control"
                    ]
                },
                {
                    "title": "TECHNOLOGICAL BACKGROUND",
                    "paragraphs": [
                        "Genetically modified viruses have shown great potential as efficient gene therapy vectors, for viral immunotherapy or as oncolytic viruses in cancer virotherapy. Generally these three different types of treatments utilize gene overexpression, gene knockdown using RNA interference and suicide gene delivery. In a therapeutic setting temporal control of transgene or viral gene expression constitutes both a safety switch and a potency dial. While modifiers of activity of DNA viruses are well established, such as regulatable promoters (e.g. Tet system), these mechanisms cannot be used to regulate most RNA viruses (retroviruses being the exception).",
                        "Aptazymes are a mechanism to tightly control RNA viruses (Ketzer et al., PNAS, 2014, 111(5): E554-62). An aptazyme consists of an RNA structure responding to a small compound (aptamer) and an enzymatically active RNA (ribozyme). This mechanism was shown to be able to regulate spread of the RNA measles virus by serving as an OFF-switch to its fusion protein. However, viral transcription or replication activity was not controlled. In measles virus, aptazymes had to be placed into both 3′- and 5′ UTRs of the viral fusion protein to achieve effective inhibition of viral spread, resulting in reduction of viral progeny by 3 logarithmic orders. Inhibition was applied at a late stage of the virus replication cycle, i.e. fusion. Apparently, even small amounts of fusion protein are sufficient to facilitate virus spread. Therefore, the reduction of 3 logarithmic orders was only accomplished with a multistep infection assay (low MOI of 0.0001) and a long observation period of 8 days. Single insertions of aptazymes in either 3′- or 5′ UTRs did not drastically reduce titers.",
                        "Following a different approach, OFF switch control of measles virus RNA replication was shown via small molecule-assisted shutoff (SMASh)-tags fused C-terminally to the viral P-protein (Chung et al., Nature Chemical Biology, 2015, 11:713-722) controlling degradation of the protein.",
                        "We sought to develop a regulatable systems based on conditional proteolysis, which involved cloning of the small human immunodeficiency virus (HIV) protease (99 amino acids) flanked by HIV protease cleavage sites into different loci of the genome of the RNA vesicular stomatis virus (VSV) as a model protease. The HIV protease is active as a homodimer and functions as aspartyl protease. In HIV, it cleaves the polyprotein that is translated from the positive strand genome, into functional proteins. Since the HIV protease is essential for its virus replication cycle, several protease inhibitors have been approved by drug administration agencies and new inhibitors are being developed. One such protease inhibitor is amprenavir, which binds in the catalytic center between the HIV protease homodimers, thereby mitigating its function.",
                        "Vesicular stomatitis virus (VSV), a negative-sense single-strand RNA virus and prototypical member of the family Rhabdoviridae, is widely studied as vaccine vector, oncolytic virus, and tracing tool. Despite its broad use in virology basic science and the development of therapeutic viruses, VSV, being an RNA virus, has so far not been shown to be externally regulatable. The VSV RNA genome includes five viral genes in the following order from 3′ to 5′: nucleoprotein (N-protein), followed by the phosphoprotein (P-protein), the matrix protein (M-protein), the glycoprotein (G-protein) and finally the polymerase or large protein (L-protein). All VSV genes are transcribed in a sequential manner by the VSV polymerase using the same entry site at the 3′end (upstream the N-protein) from which transcription is initiated. The genes are interspersed with intergenic regions that enable the transcription of several viral mRNAs from one RNA genome. The first viral protein, the N protein covers the viral RNA genome and interacts with the viral polymerase complex, which is formed by the P- and L-protein. The M-protein forms the viral capsid and obstructs cellular translation via blockage of nuclear pores. The G-protein facilitates cell attachment and entry and its fusogenic characteristic constitutes another pathogenicity factor. VSVs clinical development has been limited by potential neurotoxic adverse effects shown in laboratory animals."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce genetically modified viruses",
                        "describe gene therapy vectors",
                        "discuss RNA interference and suicide gene delivery",
                        "introduce regulatable promoters (e.g. Tet system)",
                        "describe aptazymes for RNA virus regulation",
                        "discuss limitations of aptazymes",
                        "introduce small molecule-assisted shutoff (SMASh)-tags",
                        "describe HIV protease cloning into VSV genome"
                    ],
                    "num_characters": 4301,
                    "outline_medium": [
                        "describe gene therapy vectors",
                        "describe RNA virus limitations",
                        "introduce aptazymes",
                        "describe HIV protease"
                    ],
                    "outline_short": [
                        "describe gene therapy vectors",
                        "summarize limitations of current RNA virus regulation methods"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "We present here for the first time a regulatory switch putting the activity of an RNA virus under conditional control in the presence of an exogenously applied clinically approved compound. By changing the insertion site of the switch from an INTRA- to an INTER-molecular location, we can flip the effect of the compound from an ON switch to an OFF switch. These regulatory elements provide novel safety measures for RNA viruses currently considered for development as therapeutic viruses in the field of oncology and vaccinations. Furthermore, dependence on the presence of an applied drug provides an environmental safety shield in case of shedding of viruses during therapy. For the ON-switch, an autocatalytically active protease, such as the HIV protease, is inserted into an intramolecular insertion site, i.e., into the open reading frame, of an essential protein, such as the P-protein and/or the L-protein of the prototypical negative-stranded RNA virus, such as VSV. Addition of protease specific inhibitors, such as HIV protease inhibitors, prevent the cleavage of these essential viral proteins and viral polymerase activity can proceed. We further identified a new insertion site in the L-protein that only mildly affects viral replication. For the OFF-switch the autocatalytically active protease is inserted into an intermolecular insertion site and is fused to an essential protein, generating a non-functional fusion protein. Autoproteolysis releases the functional essential protein, such as the L-protein of the prototypical negative-stranded RNA virus VSV. Addition of specific protease inhibitors, such as HIV protease inhibitors, prevent the cleavage of the dysfunctional polyprotein and therefore blocks viral polymerase activity.",
                        "In one aspect a single-stranded RNA virus is provided comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein (a) the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease; or (b) the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease. Optionally the virus may further encode for a heterologous protein. In alternative (a) also referred to as ON-switch herein, the protease cleaves the least one protein essential for viral transcription and/or replication at the cleavage site for said protease at the intramolecular insertion site. In alternative (b) also referred to as OFF-switch herein, the protease cleaves at the cleavage site for said protease located at the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication encoded as a fusion protein to release the at least one protein essential for viral transcription and/or replication. In one embodiment of alternative (b) the fusion protein does not comprise an amino acid sequence of SEQ ID NO: 30. The protease may be any protease, as long as it can be inhibited using a protease inhibitor.",
                        "In one embodiment the at least one protein essential for viral transcription and/or replication is an RNA-dependent RNA polymerase or a protein of the polymerase complex comprising the RNA-dependent RNA polymerase or a nucleocapsid, preferably selected from the group consisting of polymerase cofactor (such as the P-Protein or a functional equivalent thereof), polymerase (such as the L-Protein) and nucleocapsid (such as the N-Protein).",
                        "Preferably the single-stranded RNA virus is a negative-sense single-stranded RNA virus, more preferably a negative-sense single-stranded RNA virus of the order Mononegavirales. In certain embodiments the single-stranded RNA virus is a virus of a family selected from the group consisting of Rhabdoviridae, Paramyxoviridae, Filoviridae, Nyamiviridae, Pneumoviridae and Bornaviridae. Preferably the single-stranded RNA virus is a virus of the family Paramyxoviridae, preferably a Measles morbillivirus (MeV) or a virus of the family Rhabdoviridae, preferably a virus of the genus Vesiculovirus, most preferred a Vesicular Stomatitis Virus (VSV). In one embodiment the virus is an oncolytic virus, preferably the oncolytic virus is VSV. In an even more preferred embodiment, the Vesiculovirus is a vesicular stomatitis virus with the glycoprotein GP of the lymphocytic choriomeningitis virus (LCMV), preferably with the strain WE-HPI. Such VSV is for example described in the WO2010/040526 and named VSV-GP.",
                        "In one embodiment the single-stranded RNA virus is a negative-sense single-stranded RNA virus of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is selected from the group consisting of polymerase cofactor, polymerase and nucleocapsid, preferably wherein the at least one protein essential for viral transcription and/or replication is (a) a polymerase cofactor, preferably a P-Protein or a functional equivalent thereof; (b) a polymerase, preferably a L-protein; and/or (c) combinations thereof.",
                        "The protease as used according to the invention regulates the activity of the at least one protein essential for viral transcription and/or replication. Thus, it also regulates viral transcription and/or replication. In one embodiment the protease is an autocatalytic protease. In another embodiment or in addition the protease is a viral protease, preferably the protease is from HCV or HIV. In another embodiment the protease is the HIV-1 protease, preferably a single chain dimer of the HIV-1 protease. Suitable HIV-1 protease inhibitors, without being limited thereto, are indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir or darunavir.",
                        "In the embodiment having the insert at the intramolecular insertion site (ON-switch), the insert at the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication does not or not substantially affect activity of the at least one protein essential for viral transcription and/or replication.",
                        "In certain embodiments, at least the cleavage site for said protease and optionally further the protease is located within the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication, and proteolytic cleavage of the protein cleaves the at least one protein essential for viral transcription and/or replication at the cleavage site for said protease within the intramolecular insertion site. Cleavage within the intramolecular insertion site inactivates the at least one protein essential for viral transcription and/or replication. Further cleavage within the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication inhibits viral transcription and/or replication. Thus, the virus is active in the presence of a specific inhibitor of the protease and inactive in the absence of a specific inhibitor of the protease. The virus may further encode at least one heterologous protein, wherein the heterologous protein is expressed if the virus is active in the presence of a specific inhibitor of the protease and is not expressed if the virus is inactive in the absence of a specific inhibitor of the protease.",
                        "In another embodiment the single-stranded RNA virus is Vesicular Stomatitis Virus (VSV) and the at least one protein essential for viral transcription and/or replication is the P-protein and/or the L-protein. An example, without being limited thereto, for a suitable intramolecular insertion site in the P-protein is the flexible hinge region of the VSV P-protein, preferably at a position corresponding to amino acid position 193-199, more preferably amino acid position 196 of VSVi P-protein (such as of the amino acid sequence of SEQ ID NO: 27). In one embodiment the VSV P-protein is from VSV Indiana (VSVi) and the intramolecular insertion site in the P-Protein is the flexible hinge region of the VSV P-protein, preferably at amino acid position 193-199, more preferably amino acid position 196 of VSVi P-protein (such as of the amino acid sequence of SEQ ID NO: 27). An example, without being limited thereto, for a suitable intramolecular insertion in the L-protein is in the loop of the methyltransferase (MT) domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625, and more preferably to amino acid 1620 of VSVi L-protein (such as of the amino acid sequence of SEQ ID NO: 28). In one embodiment the VSV L-protein is from VSV Indiana (VSVi) and the intramolecular insertion site in the L-protein is in the loop of the methyltransferase (MT) domain of the L-protein from amino acids 1614 to 1634, preferably from amino acids 1614 to 1629, more preferably from amino acids 1616 to 1625, and even more preferably at amino acid 1620 of VSVi L-protein (such as of the amino acid sequence of SEQ ID NO: 28). In one embodiment the Vesicular Stomatitis Virus (VSV) and the at least one protein essential for viral transcription and/or replication is the P-protein and the L-protein having an insert at an intramolecular insertion site as described above.",
                        "In the alternative having the insert at the intermolecular insertion site (OFF-switch), the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease. In certain embodiments proteolytic cleavage of the fusion protein releases the at least one protein essential for viral transcription and/or replication in its active form. The at least one protein essential for viral transcription and/or replication in the fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease is inactive without proteolytic cleavage. Proteolytic cleavage of the fusion protein may be inhibited using a specific inhibitor of the protease. Thus, the virus is inactive in the presence of a specific protease inhibitor of the protease and active in the absence of a specific inhibitor of the protease. The virus may further encode at least one heterologous protein, wherein the heterologous protein is not expressed if the virus is inactive in the presence of a specific inhibitor of the protease and is expressed if the virus is active in the absence of a specific inhibitor of the protease. The fusion protein may also comprise a further viral protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, wherein said further viral protein and said protease are also separated by the cleavage site for said protease. In one embodiment the protease is flanked by the cleavage site for said protease on either side and replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a further viral protein. Thus, loss of the protease leads to a further inactive fusion protein comprising the protein essential for viral transcription and/or replication and the further viral protein. The fusion protein may also comprise a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, wherein said heterologous protein and said protease are separated by a cleavage site for said protease. In one embodiment the protease is flanked by a cleavage site for said protease on either side and replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a heterologous protein. Thus, loss of the protease leads to a further inactive fusion protein comprising the protein essential for viral transcription and/or replication and the heterologous protein. The fusion protein may further comprise a linker between the protease and the at least one protein essential for viral transcription and/or replication or if applicable between the protease and the further viral protein or the heterologous protein. The linker may separate the protease and the cleavage site or the cleavage site and the at least one protein essential for viral transcription and/or replication; and/or the protease and the further viral protein or the heterologous protein.",
                        "In a preferred embodiment of this alternative (OFF-switch) the single-stranded RNA virus is a negative-sense single-stranded RNA virus of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is an L-protein. In another preferred embodiment of this alternative (OFF-switch) the fusion protein comprises the protease fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease. In yet another embodiment of this alternative (OFF-switch) the single-stranded RNA virus is a negative-sense single-stranded RNA virus of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is an L-protein, wherein the fusion protein comprises the protease fused to the N-terminal end of the L-protein separated by the cleavage site for said protease.",
                        "In another aspect the invention relates to an RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one heterologous protein, a protease and a cleavage site for said protease, wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease. The virus may be an oncolytic virus, wherein the oncolytic virus is preferably VSV.",
                        "The heterologous protein may be a therapeutic protein, a reporter or a tumor antigen.",
                        "In a further aspect, the invention relates to the RNA viruses according to the invention for use in therapy, particularly for use in treating cancer. The cancer may be a solid tumor, preferably selected from the group consisting of colon carcinoma, prostate cancer, breast cancer, lung cancer, NSCLC, skin cancer, liver cancer, bone cancer, ovary cancer, pancreas cancer, brain cancer, head and neck cancer, HNSCC, lymphoma (Hodgkin's and non-Hodgkin's lymphoma), brain cancer, neuroblastoma, mesothelioma, Wilm's tumor, retinoblastoma and sarcoma.",
                        "In yet another aspect, the invention relates to a recombinant VSV L-protein comprising an insert in the loop of the methyltransferase domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625 and more preferably to amino acid 1620 of VSVi L-protein (SEQ ID NO: 28). The insert may comprise a reporter protein (such as luciferase or a fluorescent protein) or alternatively a cleavage site for a protease or a protease and a cleavage site for said protease. In case the insert comprises a cleavage site for a protease or a protease and a cleavage site for said protease the protease may be a viral protease and/or an autocatalytic protease. Preferably the protease is from HCV or HIV. In one embodiment the protease is the HIV-1 protease, preferably a single chain dimer of the HIV-1 protease. Suitable HIV-1 protease inhibitors are, without being limited thereto, indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir or darunavir. In certain embodiments, the L-protein may comprise a secondary mutation. Also provided is a Vesicular Stomatitis Virus (VSV) comprising the recombinant VSV L-protein according to the invention.",
                        "The invention further provides a method for controlling RNA virus replication comprising (a) transducing or transfecting a host cell with the RNA virus according to the invention in the alternative having the insert at the intramolecular insertion site (ON-switch), and (b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor allows viral transcription and/or replication and the absence of said protease inhibitor inhibits viral transcription and replication.",
                        "The invention also provides a method for controlling RNA virus replication comprising (a) transducing or transfecting a host cell with the RNA virus according to the invention in the alternative having the insert at the intermolecular insertion site (OFF-switch), and (b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor inhibits viral transcription and/or replication and the absence of said protease inhibitor allows viral transcription and replication.",
                        "The invention also provides a method for controlling heterologous protein expression by a RNA virus comprising (a) transducing or transfecting a host cell with the RNA virus according to the invention in the alternative wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease; and (b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor allows heterologous protein expression and the absence of said protease inhibitor inhibits heterologous protein expression. The protein in the methods according may be an autocatalytic protease, preferably the autocatalytic protease is the HIV-1 protease, more preferably a single chain dimer of the HIV-1 protease. Suitable HIV-1 protease inhibitors are, without being limited thereto, indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir or darunavir."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce conditional protease approach",
                        "describe ON-switch and OFF-switch mechanisms",
                        "introduce autocatalytically active protease",
                        "describe protease insertion into essential viral protein",
                        "introduce HIV protease as example",
                        "describe protease inhibitor regulation",
                        "introduce negative-sense single-stranded RNA virus",
                        "describe VSV as model virus",
                        "introduce P-protein and L-protein as essential proteins",
                        "describe intramolecular insertion site",
                        "introduce flexible hinge region of P-protein",
                        "describe loop of methyltransferase domain of L-protein",
                        "introduce heterologous protein expression",
                        "describe oncolytic virus application",
                        "introduce VSV-GP as example",
                        "describe polymerase cofactor, polymerase, and nucleocapsid",
                        "introduce HIV-1 protease as example",
                        "describe HIV-1 protease inhibitors",
                        "introduce intermolecular insertion site",
                        "describe fusion protein with protease",
                        "introduce cleavage site for protease",
                        "describe inactive fusion protein",
                        "introduce proteolytic cleavage",
                        "describe active fusion protein",
                        "introduce further viral protein or heterologous protein",
                        "describe linker between protease and protein",
                        "introduce OFF-switch mechanism",
                        "describe L-protein as essential protein",
                        "introduce fusion protein with N-terminal protease",
                        "describe therapeutic protein, reporter, or tumor antigen",
                        "introduce oncolytic virus for cancer treatment",
                        "describe various cancer types",
                        "introduce recombinant VSV L-protein",
                        "describe insert in methyltransferase domain",
                        "introduce reporter protein or cleavage site",
                        "describe secondary mutation",
                        "introduce method for controlling RNA virus replication"
                    ],
                    "num_characters": 18612,
                    "outline_medium": [
                        "introduce conditional protease approach",
                        "describe regulatable switch",
                        "introduce ON-switch",
                        "describe intramolecular insertion site",
                        "introduce OFF-switch",
                        "describe intermolecular insertion site",
                        "describe protease inhibitor",
                        "describe viral polymerase activity",
                        "introduce single-stranded RNA virus",
                        "describe modified genome",
                        "describe polynucleotide sequence",
                        "describe essential protein",
                        "describe protease and cleavage site",
                        "describe heterologous protein",
                        "describe oncolytic virus",
                        "describe VSV",
                        "describe glycoprotein GP",
                        "describe protease regulation"
                    ],
                    "outline_short": [
                        "introduce conditional protease approach",
                        "describe ON-switch mechanism",
                        "describe OFF-switch mechanism",
                        "outline protease and cleavage site insertion",
                        "specify single-stranded RNA virus types",
                        "describe heterologous protein expression",
                        "outline protease inhibitor regulation",
                        "specify VSV as a preferred embodiment",
                        "summarize therapeutic applications"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The general embodiments “comprising” or “comprised” encompass the more specific embodiment “consisting of”. Furthermore, singular and plural forms are not used in a limiting way. As used herein, the singular forms “a”, “an” and “the” designate both the singular and the plural, unless expressly stated to designate the singular only.",
                        "The term “homologue” or “homologous” as used in the present invention means a polypeptide molecule or a nucleic acid molecule, which is at least 80% identical in sequence with the original sequence or its complementary sequence. Preferably, the polypeptide molecule or nucleic acid molecule is at least 90% identical in sequence with the reference sequence or its complementary sequence. More preferably, the polypeptide molecule or nucleic acid molecule is at least 95% identical in sequence with the reference sequence or its complementary sequence. Most preferably, the polypeptide molecule or a nucleic acid molecule is at least 98% identical in sequence with the reference sequence or its complementary sequence. A homologous protein further displays the same or a similar protein activity as the original sequence.",
                        "The term “corresponding to amino acid position” or “corresponds to amino acid position”, as used herein includes the defined sequence of VSVi, such as the amino acid sequence of the P-protein having the sequence of SEQ ID NO: 27 or the amino acid sequence of the L-protein having the sequence of SEQ ID NO: 28, but also to natural variations thereof or sequences from other VSV serotypes. Also, the skilled person will understand that genomic sequences of RNA viruses, such as of VSV, vary and may therefore not be identical with the sequences provided in SEQ ID NO: 27 or SEQ ID NO: 28, even if from the same serotype. However, using sequence alignment, the skilled person would know how to identify the position in a sequence in a specific VSV sequence, corresponding to the defined position in the sequence of SEQ ID NO:27 or SEQ ID NO: 28 of the P-protein or of the L-protein, respectively, i.e., the homologous position. Such sequence comprising the position corresponding to the defined position in the P-protein having the sequence of SEQ ID NO: 27 or the L-protein having the sequence of SEQ ID NO: 28 would have at least 80% sequence identity with the sequence of SEQ ID NO: 27 or with the sequence of SEQ ID NO: 28, preferably at least 90% identity with the sequence of SEQ ID NO: 27 or with the sequence of SEQ ID NO: 28. The corresponding sequence may also contain recombinant insertions, such as a protease and/or a cleavage site for said protease, which is not to be considered for determining the corresponding sequence.",
                        "The term “protein” is used interchangeably with “amino acid residue sequence” or “polypeptide” and refers to polymers of amino acids of any length. These terms also include proteins that are post-translationally modified through reactions that include, but are not limited to, glycosylation, acetylation, phosphorylation, glycation or protein processing. Modifications and changes, for example amino acid sequence substitutions, deletions or insertions, can be made in the structure of a polypeptide while the molecule maintains its biological functional activity. For example certain amino acid sequence substitutions can be made in a polypeptide or its underlying nucleic acid coding sequence and a protein can be obtained with the same properties. The term “polypeptide” typically refers to a sequence with more than 10 amino acids and the term “peptide” means sequences with up to 10 amino acids in length. However, the terms may sometimes be used interchangeably.",
                        "The term “fusion protein” refers to a chimeric protein made of parts from different sources, particularly created through joining of two or more genes or parts of genes that originally code for separate proteins or fragments thereof. Recombinant fusion proteins are created artificially by recombinant DNA technology. A fusion protein may contain full length proteins (i.e., comprising all functional domains) or a fragments thereof, such as one or more functional domain(s), a consensus motive, a cleavage site fused to another full length proteins (i.e., comprising all functional domains) or a fragments thereof. Fused means that the nucleotide sequence coding for the first polypeptide to the nucleotide sequence coding for the second polypeptide in frame, such that the nucleotide sequence will be expressed as a single protein. A polyprotein is a subtype of fusion proteins, typically occurring in RNA viruses. A polyprotein is a protein generated by translation of a single mRNA encoding several proteins in a single open reading frame, i.e., fused to each other (multicistronic mRNA). The polyprotein is processed post-translationally or co-translationally into single proteins, typically via proteases.",
                        "The term “genomic RNA” as used herein refers to the heritable genetic information of an RNA virus. However, in the context of the present invention the term “genome” typically also refers to the genome of an RNA virus and hence an RNA genome having a ribonucleic acid sequence. The person skilled in the art will understand that the genome of an RNA virus may also be provided as a DNA sequence in a vector, such as a plasmid. The RNA genome is then generated in a host cell following transfection of the host cell via transcription.",
                        "The term “gene” as used herein refers to a DNA or RNA locus of heritable genomic sequence which affects an organism's traits by being expressed as a functional product or by regulation of gene expression. Genes and polynucleotides may include introns and exons as in genomic sequence, or just the coding sequences as in cDNAs, such as an open reading frame (ORF), comprising a start codon (methionine codon) and a translation stop codon. Genes and polynucleotides can also include regions that regulate their expression, such as transcription initiation, translation and transcription termination. Thus, also included are regulatory elements such as a promoter.",
                        "The terms “nucleic acid”, “nucleotide”, and “polynucleotide” as used herein are used interchangeably and refer to a single or double-stranded polymer of deoxyribonucleotide bases or ribonucleotide bases read from the 5′ to the 3′ end and include double stranded DNA (dsDNA), single stranded DNA (ssDNA), single stranded RNA (ssRNA, negative-sense and positive-sense), double stranded RNA (dsRNA), genomic DNA, cDNA, cRNA, recombinant DNA or recombinant RNA and derivatives thereof, such as those containing modified backbones.",
                        "The term “ribonucleic acid”, “RNA” or “RNA oligonucleotide” as used herein describes a molecule consisting of a sequence of nucleotides, which are built of a nucleobase a ribose sugar, and a phosphate group. RNAs are usually single stranded molecules and can exert various functions. The term ribonucleic acid specifically comprises messenger RNA (mRNA), transfer RNA (tRNA), ribosomal RNA (rRNA), short interfering RNA (siRNA), small hairpin RNA (shRNA) and micro RNA (miRNA), each of which plays a specific role in biological cells. It includes small non-coding RNAs, such as microRNAs (miRNA), short interfering RNAs (siRNA), small hairpin RNA (shRNA), and Piwi-interacting RNAs (piRNA). The term “non-coding” means that the RNA molecule is not translated into an amino acid sequence.",
                        "The terms “upstream” and “downstream” refer to a relative position in DNA or RNA. Each strand of DNA or RNA possesses a 5′ end and a 3′ end, relating to the terminal carbon position of the deoxyribose or ribose units. By convention, “upstream” means towards the 5′ end of a polynucleotide, whereas “downstream” means towards the 3′ end of a polynucleotide. In the case of double stranded DNA, e.g. genomic DNA, the term “upstream” means towards the 5′ end of the coding strand, whereas “downstream” means towards the 3′ end of the coding strand.",
                        "The term “coding strand” or “positive-sense strand” refers to a RNA strand encoding for proteins.",
                        "The term “non-coding strand” “anti-sense strand” or “negative-sense strand” or “negative-strand” refers to a RNA strand that needs to be transcribed by an RNA-dependent RNA polymerase into a positive strand RNA prior to translation.",
                        "A “vector” is a nucleic acid that can be used to introduce a heterologous polynucleotide into a cell. One type of vector is a “plasmid”, which refers to a linear or circular double stranded DNA molecule into which additional nucleic acid segments can be ligated. Another type of vector is a viral vector (e.g., retroviruses, adenoviruses, adeno-associated viruses, VSV and MeV replication defective or active form), wherein additional DNA or RNA segments can be introduced into the viral genome.",
                        "The term “encodes” and “codes for” refers broadly to any process whereby the information in a polymeric macromolecule is used to direct the production of a second molecule that is different from the first. The second molecule may have a chemical structure that is different from the chemical nature of the first molecule. For example, the term “encode” describes the process of semi-conservative DNA replication, where one strand of a double-stranded DNA molecule is used as a template to encode a newly synthesized complementary sister strand by a DNA-dependent DNA polymerase. Further, a DNA molecule can encode an RNA molecule (e.g., by uses a DNA-dependent RNA polymerase) or a RNA molecule (negative stranded) can encode an RNA molecule (positive-stranded) (e.g., by use of a RNA-dependent RNA polymerase). Also, an RNA molecule (positive-stranded) can encode a polypeptide, as in the process of translation. When used to describe the process of translation, the term “encode” also extends to the triplet codon that encodes an amino acid. An RNA molecule can also encode a DNA molecule, e.g., by the process of reverse transcription using an RNA-dependent DNA polymerase. When referring to a DNA molecule encoding a polypeptide, a process of transcription and translation is referred to.",
                        "The term “heterologous polypeptide” or “heterologous protein” as used herein refers to a protein derived from a different organism or a different species from the recipient, i.e., the RNA virus. In the context of the present invention the skilled person would understand that it refers to a protein not naturally expressed by the virus. The term “heterologous” when used with reference to portions of a protein may also indicate that the protein comprises two or more amino acid sequences that are not found in the same relationship to each other in nature. In the context of the present invention it is typically a therapeutic protein, an antigen, such as a tumor-specific or tumor-associated antigen, or a reporter (such as luciferase or a fluorescent protein).",
                        "The term “therapeutic protein” refers to proteins that can be used in medical treatment of humans and/or animals. These include, but are not limited to antibodies, growth factors, blood coagulation factors, cytokines, such as interferons and interleukines, chemokines and hormones, preferably, growth factors, cytokines, chemokines and antibodies.",
                        "The term “cytokine” refers to small proteins, which are released by cells and act as intercellular mediators, for example influencing the behavior of the cells surrounding the secreting cell. Cytokines may be secreted by immune or other cells, such as T-cells, B-cells, NK cells and macrophages. Cytokines may be involved in intercellular signaling events, such as autocrine signaling, paracrine signaling and endocrine signaling. They may mediate a range of biological processes including, but not limited to immunity, inflammation, and hematopoiesis. Cytokines may be chemokines, interferons, interleukins, lymphokines or tumor necrosis factors.",
                        "As used herein, “growth factor” refers to proteins or polypeptides that are capable of stimulating cell growth.",
                        "The term “expression” as used herein refers to transcription and/or translation of a heterologous nucleic acid sequence within a host cell. The level of expression of a gene product of interest in a host cell may be determined on the basis of either the amount of the corresponding mRNA (or positive-stranded RNA) that is present in the cell, or the amount of the polypeptide encoded by the selected sequence. For example, RNA transcribed from a selected sequence can be quantified by Northern blot hybridization, ribonuclease RNA protection, in situ hybridization to cellular RNA or by PCR, such as qPCR. Proteins encoded by a selected sequence can be quantitated by various methods, e.g. by ELISA, by Western blotting, by radioimmunoassay, by immunoprecipitation, by assaying for the biological activity of the protein, by immunostaining of the protein followed by FACS analysis or by homogeneous time-resolved fluorescence (HTRF) assays. The level of expression of a non-coding RNA, such as a miRNA or shRNA may be quantified by PCR, such as qPCR.",
                        "The term “gene product” refers to both the mRNA polynucleotide and polypeptide that is encoded by a gene or DNA polynucleotide.",
                        "As used herein, a “reporter gene” is a polynucleotide encoding a reporter protein or “reporter” that can be easily detected and quantified. Thus, a measurement of the level of expression of the reporter is typically indicative of the level of transcription and/or translation. The gene encoding the reporter is a reporter gene. For example, a reporter gene can encode a reporter, for example, an enzyme whose activity can be quantified, for example, alkaline phosphatase (AP), chloramphenicol acetyltransferase (CAT), Renilla luciferase or firefly luciferase protein(s). Reporters also include fluorescent proteins, for example, green fluorescent protein (GFP) or any of the recombinant variants of GFP, including enhanced GFP (EGFP), blue fluorescent proteins (BFP and other derivatives), cyan fluorescent protein (CFP and other derivatives), yellow fluorescent protein (YFP and other derivatives) and red fluorescent protein (RFP and other derivatives) or other fluorescent proteins, such as mCherry and mWasabi.",
                        "The term “protease” or “proteinase” are used herein synonymously and refer to an enzyme that helps proteolysis, i.e., protein catabolism by hydrolysis of peptide bonds. Proteases can be classified into seven broad groups of serine proteases, cysteine proteases, threonine proteases, aspartic proteases, glutamic proteases, metalloproteases and asparagine peptide lyases. Proteases occur in all organisms, in prokaryotes, eukaryotes and viruses. In principle all proteases are suitable in the context of the present invention as long as they are highly specific, i.e., have a restricted set of substrate sequences, and a specific inhibitor is available. The protease inhibitor should be specific for the protease and be known to be suitable for in vivo use, i.e., being safe, bioavailable and active in vivo, such as following oral or parenteral administration to a subject, preferably a human subject. Viral proteases are advantageous as they are common targets for antiviral drugs and hence a number of protease inhibitors inhibiting viral proteases have been approved and tested to be safe in humans. For example, for the human immune deficiency (HIV) protease, various well-characterized protease inhibitors are available and allow regulation of the system with desired kinetics. Example of suitable HIV protease inhibitors are without being limited thereto, e.g., indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir and darunavir. In therapy the protease inhibitor, particularly the HIV protease inhibitor, may be administered in combination with ritonavir. Ritonavir augments the plasma concentration of the other protease inhibitors. Human proteases are advantages as they are endogenous proteins to human patients and hence do not elicit an immune response. The protease used in the RNA virus according to the invention is a heterologous protease, i.e., a protease not endogenous to the virus. The term “Prot” or “prot” as used herein is an abbreviation of protease, thus e.g., L-Prot refers to the L-protein comprising an intramolecular protease as disclosed herein and P-Prot refers to the P-protein comprising an intramolecular protease as disclosed herein or Prot-L refers to a protease fused to the L-protein and Prot-P refers to a protease fused to the P-protein.",
                        "The protease may be a monomer or a dimer. Preferably a dimer is used in form of a single-chain dimer, by linking the monomers via a flexible linker. Examples for a protease that is active only as a dimer is the HIV protease used in the Examples. As explained for the HIV-1 protease, single-chain dimers are preferably codon-optimized to avoid homology between the first and second protease. A codon optimized single-chain dimer of HIV 1 protease may, e.g., have the DNA sequence of SEQ ID NO: 5. This reduces the risk of “copy-choice” recombination events as previously described in VSV (Simon-Loriere and Holmes 2011), in which the viral polymerase, the L-protein, can switch between templates and skip sequence stretches. “Copy-choice” occurs when the polymerase is guided by sequence homology of the nascent RNA strand with the newly chosen template. Preferably the protease is autocatalytically active, i.e., it mediates cis-cleavage. This may be an inherent property of the protease or may be generated by cloning the respective cleavage site in close proximity to the protease, i.e., the protease has a N-terminal and/or a C-terminal cleavage site. Preferably the protease is framed by a cleavage site for said protease on either side. Thus, the protease has two cleavage sites for said protease, one on the N-terminal side and one on the C-terminal side of the protease. Preferably the two cleavage sites are not identical. The protease having a cleavage site may further have a linker on one or both side, either flanking the cleavage site on one or both sides or alternatively between the protease and the one or more cleavage sites.",
                        "Thus, the regulatory element or “switch” according to the present invention comprises a protease, at least one cleavage site for said protease and a protease inhibitor specific for said protease.",
                        "The term “RNA virus” as used herein refers to a virus that has a ribonucleic acid (RNA) as its genetic material. RNA viruses may be single-stranded (ssRNA) or double-stranded (dsRNA). Single-stranded RNA viruses include the category (Phylum) “negative-sense ssRNA virus” (Negarnaviricota), which includes among others the order Mononegavirales and Articulavirales (comprising the family orthomyxovirus, which includes the influenza virus) and the category “positive-sense ssRNA virus”, such as Coronaviridae, Flaviviridae, and Enteroviridae. The negative-sense ssRNA viruses, particularly of the order Mononegavirales, include, Bornaviridae (e.g., Borna disease Virus (BDV), Nyamaviridae (Nyamanini virus (NYMV), Rhabdoviridae (rabies virus, vesicular stomatitis virus (VSV), Maraba virus), Filobiridae (Ebola virus including EBOV), Paramyxoviridae (comprising measles virus (MeV), Newcastle disease virus (NDV)), and Pneumoviridae (e.g., Human Respiratory Syncytial-Virus (HRSV)). In the context of the present invention Rhabdoviridae and Paramyxoviridae are preferred, more preferably RNA virus of the genus Vesiculovirus.",
                        "Negative-sense viral RNA is complementary to mRNA and must be converted into positive-sense RNA by an RNA-dependent RNA polymerase before translation. Thus, purified RNA of a negative-sense RNA is not infectious as it needs to be transcribed first, which requires an RNA-dependent RNA polymerase comprised in the virus particle (virion). The sequence of recombinant RNA viruses is commonly provided as cDNA sequence, as the RNA sequence is reverse transcribed for sequencing.",
                        "The term “linker” refers to a sequence coding for a separating peptide of variable length of about 6 to 30 amino acids, preferably 7 to 15 amino acids that separate different parts of a protein without affecting the function of the different parts of the protein or having a function on its own. A linker may be flexible or rigid, preferably the linker is a flexible linker. Preferably no linker is used between the protease cleavage site and the at least one protein essential for viral transcription and/or replication."
                    ],
                    "subsections": [
                        {
                            "title": "Conditional Regulation for an RNA Virus",
                            "paragraphs": [
                                "In one aspect the invention relates to a single-stranded RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease. The protease cleaves the least one protein essential for viral transcription and/or replication at the cleavage site for said protease at the intramolecular insertion site. Cleavage at the intramolecular insertion site renders the protein essential for viral transcription and/or replication inactive. This aspect may also be referred to as the ON-switch in the context of the present invention, because the addition of a protease inhibitor “switches on” the at least one protein essential for viral transcription and/or replication. Preferably the insert comprises a flexible linker on either side, such as a glycine-serine linker.",
                                "In another aspect the invention relates to a single-stranded RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease. The fusion protein may or may not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication, such as a glycine-serine linker. More generally the fusion protein may or may not comprise a linker between the protease and the protein essential for viral transcription and/or replication, i.e., between the protease and the cleavage site or between the cleavage site and the protein essential for viral transcription and/or replication. Preferably the fusion protein does not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication. Alternatively the fusion protein may or may not comprise a linker between the protease and the cleavage site. The protease cleaves at the cleavage site for said protease located at the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication encoded as a fusion protein to release the at least one protein essential for viral transcription and/or replication. Thus, the protease and the protease cleavage site for said protease are at an intermolecular location. Proteolytic release of the at least one protein essential for viral transcription and/or replication renders said protein essential for viral transcription and/or replication active. In other words the proteolytic cleavage releases the active at least one protein essential for viral transcription and/or replication. The term “release” or “proteolytic release” as used herein refers to the removal of sequences fused to the at least one protein essential for viral transcription and/or replication that inactivate said protein. This aspect may also be referred to as the OFF-switch in the context of the present invention, because the addition of a protease inhibitor “switches off” the at least one protein essential for viral transcription and/or replication.",
                                "Thus, the fusion protein may consist of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease. The fusion protein may optionally further comprise a linker between the protease and the at least one protein essential for viral transcription and/or replication, such as a glycine-serine linker. Thus, the fusion protein may or may not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication; or alternatively the fusion protein may or may not comprise a linker between the protease and the cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication. However, no further elements are required for inactivation of the at least one protein essential for viral transcription and/or replication in said fusion protein. Thus, the fusion protein may consist of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease and optionally a linker. The fusion protein may also comprise or consist of (a) the protease fused to the N-terminal or C-terminal end of the protein essential for viral transcription and/or replication, separated by the cleavage site for said protease, and (b) a further viral protein or a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the protein essential for viral transcription and/or replication, and wherein said further viral protein or heterologous protein and said protease are also separated by a cleavage site for said protease. The fusion protein optionally further comprises a linker between the protease and the protein essential for viral transcription and/or replication, and/or a linker between the protease and the further viral protein or heterologous protein. In this context it is important that the protease comprises a cleavage site on either side of the protease (framed by a cleavage site for said protease on either side) in order to release both proteins, the protein essential for viral transcription and/or replication as well as the further viral protein or the heterologous protein. Preferably the protease is fused to the N-terminal end of the protein essential for viral transcription and/or replication, or the at least one protein essential for viral transcription and/or replication is an L-protein, or the protease is fused to the N-terminal end of an L-protein. The two cleavage sites for said protease (and the optional linkers) on either side are preferably different from each other. The protease having a cleavage site on either side may further have a linker on one or both side, either flanking the cleavage site on one or both sides or alternatively between the protease and the one or more cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the at least one protein essential for viral transcription and/or replication.",
                                "The RNA viruses suitable in the context of the present invention are particularly single-stranded RNA viruses. The term single-stranded RNA virus includes a positive-sense single-stranded RNA virus or a negative-sense single-stranded RNA virus. Preferably, the RNA virus is a negative-sense single stranded RNA virus. In one embodiment the RNA virus is of the order Mononegavirales. More specifically the single-stranded RNA virus of the order Mononegavirales may be a virus of a family selected from the group consisting of Rhabdoviridae, Paramyxoviridae, Filoviridae, Nyamiviridae, Pneumoviridae and Bornaviridae, preferably of the family Rhabdoviridae or Paramyxoviridae, preferably of the genus Vesiculovirus, more preferably a Vesicular Stomatitis Virus (VSV) or a Measles morbillivirus (MeV), even more preferably VSV.",
                                "In one embodiment the at least one protein essential for viral transcription and/or replication is an RNA-dependent RNA polymerase (RdRp) and/or a protein of the polymerase complex comprising the RNA-dependent RNA polymerase and/or a nucleocapsid protein. Preferably the at least one protein essential for viral transcription and/or replication is selected from the group consisting of polymerase cofactor, polymerase and nucleocapsid protein. The term polymerase cofactor refers to an essential component of the RNA polymerase transcription and replication complex. In VSV the RdRp complex comprises the large protein (L-protein) acting as the RdRp and the phosphoprotein (P-protein). The P-protein has two domains, the first being involved in transcription and the second in replication. It typically binds the viral ribonucleocapsid and positions the RNA-dependent RNA polymerase on the templates.",
                                "In certain embodiments the RNA virus is of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is a polymerase cofactor, e.g., the phosphoprotein (P-protein) or a functional equivalent thereof; a polymerase, e.g., the large protein (L-protein); and/or a nucleocapsid, e.g., the nucleoprotein (N-protein). The at least one protein essential for viral transcription and/or replication may be one, two or three proteins essential for viral transcription and/or replication, preferably one or two proteins essential for viral transcription and/or replication. The term “a functional equivalent” of the P-protein refers to an essential component of the RdRp complex other than the RNA-dependent RNA polymerase itself.",
                                "The order Mononegavirales includes without being limited thereto the families Bornoviridae, Nyamaviridae, Rhabdoviridae, Filoviridae and Paramyxoviridae, such as Paramyxovirinae and Pneumovirinae. The polymerase is referred to as L-protein in Bornoviridae (e.g., BDV), Nyamaviridae (e.g., NYMV), Rhabdoviridae (e.g., VSV, Maraba), Filoviridae (e.g., EBOV) and Paramyxoviridae, such as Paramyxovirinae (e.g., MeV) and Pneumovirinae (e.g., HRSV). The nucleocapsid is referred to as N-protein in Bornoviridae (e.g., BDV), Nyamaviridae (e.g., NYMV), Rhabdoviridae (e.g., VSV) and Paramyxoviridae, such as Paramyxovirinae (e.g., MeV) and Pneumovirinae (e.g., HRSV), whereas it is referred to as NP-protein in Filoviridae (e.g., EBOV). Thus, one example of a functional equivalent of the N-protein is the NP-protein in Filoviridae. The polymerase cofactor is referred to as P-protein in Nyamaviridae (e.g., NYMV), Rhabdoviridae (e.g., VSV) and Pneumovirinae (e.g., HRSV), whereas it is referred to as X/P-protein in Bornoviridae (e.g., BDV), VP35 in Filoviridae (e.g., EBOV) and P/V/C-protein in Paramyxovirinae (e.g., MeV). The Nyamaviridae comprise a further polymerase cofactor, the X-protein, in addition to the P-protein. Thus examples for a functional equivalent of the P-protein are the X/P-protein in Bornoviridae, the VP35-protein in Filoviridae, the P/V/C-protein in Paramyxovirinae and the X-protein in Nyamaviridae.",
                                "In one embodiment the RNA virus is of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is a polymerase cofactor, e.g., the P-protein or a functional equivalent thereof; and/or a polymerase, e.g., the L-protein; or a combination thereof. Preferably the at least one protein essential for viral transcription and/or replication is a polymerase, e.g. the L-protein. Without being bound by theory, as transcription of the viral genes occurs in sequential order from a single promoter at the 3′ end of the genome resulting in decreasing amounts of each transcript, modifications at the L-protein being last in the genome results in less attenuation compared to modifications in other proteins.",
                                "The protease regulates the activity of the at least one protein essential for viral transcription and/or replication. The protease inactivates the protein essential for viral transcription and/or replication with at least a cleavage site for said protease at an intramolecular location, whereas at the intermolecular location the protease activates the protein essential for viral transcription and/or replication. This refers to the protease in its active state and in the absence of a protein inhibitor for said protease. Thus, the protease also regulates viral transcription and/or replication. The term “cleavage site for said protease” refers to a consensus amino acid sequence that serves as a substrate for proteolytic cleavage of the polypeptide. Cleavage sites for the respective proteases are known in the art.",
                                "In one embodiment the protease is an autocatalytic protease or the protease acts as an autocatalytic proteases. A protease acts as an autocatalytic protease means that the protease is autocatalytically active, i.e., it mediates cis-cleavage. Typically an autocatalytically active protease also mediates trans-cleavage, i.e., in a different polypeptide comprising the respective cleavage site, in addition to cis-cleavage. Mediating cis-cleavage may be an inherent property of the protease (autocatalytic protease). For example the protease is flanked by one or more cleavage site(s). The protease therefore mediates cleavage of the polypeptide comprising the protease. In specific cases the protease may be released from a polyprotein by autocatalytic cleavage. A protease may also become autocatalytically active by incorporation of one or two cleavage site(s) at the N-terminal or C-terminal end of the protease. Thus, a protease acting as an autocatalytic protease or a protease that is catalytically active may also be generated by cloning the respective cleavage site in close proximity to the protease (not naturally expressing the cleavage site on the same polypeptide), such that the recombinant protease has a N-terminal and/or a C-terminal cleavage site. Preferably the protease is framed by a cleavage site for said protease on either side. Thus, the protease has two cleavage sites for said protease, one on the N-terminal side and one on the C-terminal side of the protease. An autocatalytic protease or a protease that acts as an autocatalytic protease is preferred for the aspect relating to the ON-switch (the addition of a protease inhibitor “switches on” the at least one protein essential for viral transcription and/or replication) as well as the aspect relating to the OFF-switch (the addition of a protease inhibitor “switches off” the at least one protein essential for viral transcription and/or replication). However, in the aspect relating to the ON-switch, the insert at the intramolecular insertion site may comprise only the cleavage site for said protease, while the protease may be provided in trans, i.e., as a separate polypeptide preferably encoded by the RNA virus. Therefore, the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease, preferably the protease and the cleavage site for said protease. Thus, in case the insert at the intramolecular insertion site comprising only the cleavage site for said protease, the protease is provided in trans.",
                                "Further the protease or autocatalytic protease may be any protease, particularly a viral protease, a prokaryotic protease or a eukaryotic protease, particularly a viral or a eukaryotic protease. The protease used in the RNA virus according to the invention is a heterologous protease, i.e., a protease not endogenous to the virus. In one embodiment the protease is a viral protease, such as the protease is from HCV or HIV. The person skilled in the art will understand that proteases suitable in the context of the present invention are highly specific, i.e., have a restricted set of unique and rare substrate sequences, and further have a specific inhibitor available. The availability of a specific inhibitor allows for conditional regulation of the RNA virus. The protease inhibitor inhibits the proteolytic activity of the protease, wherein inhibits means that the protease shows at least 80% inhibition, at least 90% inhibition, at least 95% inhibition, at least 99% inhibition and preferably 100% inhibition compared to the protease in the absence of the inhibitor. Preferably, the inhibitor is used at a dose corresponding to a therapeutic serum concentration.",
                                "The protease inhibitor should be specific for the protease and suitable for in vivo use, i.e., being safe, bioavailable and active in vivo, such as following oral or parenteral administration to a subject, preferably a human subject. Viral proteases are advantageous as they are common targets for antiviral drugs and hence a number of protease inhibitors inhibiting viral proteases have been approved and tested to be safe in humans. For example, for the human immune deficiency (HIV) protease, various well-characterized protease inhibitors are available and allow regulation of the system with desired kinetics. Examples of suitable HIV protease inhibitors are, without being limited thereto, e.g., indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir and darunavir. Human proteases are advantageous as they are endogenous proteins to human patients and hence do not elicit an immune response. Examples for suitable human proteases, without being limited thereto, are caspases and metalloproteinases. Examples of suitable human protease inhibitors are, without being limited thereto, e.g. caspase inhibitors emricasan and nivocasan; matrix metalloproteinase inhibitor batimastat and tanomastat, and ecaliximab.",
                                "The protease may be a monomer or a dimer. Preferably a dimer is used in form of a single-chain dimer, by linking the monomers via a flexible linker. Examples for a protease that is active only as a dimer is the HIV protease used in the Examples. As explained for the HIV-1 protease, single-chain dimers are preferably codon-optimized to avoid homology between the first and second protease. This reduces the risk of “copy-choice” recombination events as previously described in VSV (Simon-Loriere and Holmes 2011), in which the viral polymerase, the L-protein, can switch between templates and skip sequence stretches. “Copy-choice” occurs when the polymerase is guided by sequence homology of the nascent RNA strand with the newly chosen template. Preferably the protease is autocatalytically active, i.e., it mediates cis-cleavage. In one embodiment the protease is the HIV-1 protease, preferably a single chain dimer of the HIV-1 protease (e.g., a single chain dimer of the HIV-1 protease having the DNA sequence of SEQ ID NO: 5). Suitable HIV-1 protease inhibitors are, without being limited thereto, indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir or darunavir, preferably amprenavir, saquinavir or indinavir. In another embodiment the protease is the HCV protease NS3 and suitable NS3 inhibitors are, without being limited thereto, boceprevir, telaprevir, asunaprevir, ciluprevir, feldaprevir, vaniprevir, narlaprevir, simeprevir or danoprevir, preferably vaniprevir, narlaprevir, simeprevir or danoprevir.",
                                "The single-stranded RNA virus according to the invention may further encode a heterologous protein, preferably a therapeutic protein, a reporter or a tumor antigen, more preferably a therapeutic protein or a tumor antigen. Production of such heterologous protein depends on intact activity of the viral transcription complex.",
                                "In certain embodiments the virus is an oncolytic virus. An oncolytic virus is a virus that preferentially infects and kills cancer cells. The killed cancer cells release new infectious virus particles that infect further cancer cells and release cell fragments that stimulate an anti-tumor immune response in the host. Clinically tested oncolytic RNA viruses include without being limited thereto, reovirus, measles virus, Newcastle disease virus, influenza virus, Semliki Forest virus, Sindbis virus, poliovirus, Coxsackie virus, Seneca Valley virus, Maraba and VSV. Preferably the oncolytic virus is VSV. This includes derivatives thereof, such as VSV-GP pseudotyped with the glycoprotein (GP) of the lymphocytic choriomeningigtis virus (LCMV) as described in WO 2010/040526."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define single-stranded RNA virus",
                                "describe modified genome of virus",
                                "introduce ON-switch concept",
                                "explain protease cleavage site",
                                "describe fusion protein embodiment",
                                "detail linker options",
                                "outline proteolytic release",
                                "introduce OFF-switch concept",
                                "describe fusion protein with linker",
                                "explain multiple cleavage sites",
                                "describe RNA viruses suitable for invention",
                                "specify single-stranded RNA virus families",
                                "describe RdRp and polymerase complex",
                                "introduce phosphoprotein and nucleocapsid protein",
                                "describe RdRp complex in VSV",
                                "specify proteins essential for viral transcription and/or replication",
                                "describe functional equivalents of P-protein",
                                "outline order Mononegavirales families",
                                "describe polymerase and nucleocapsid proteins",
                                "specify functional equivalents of N-protein",
                                "describe polymerase cofactor proteins",
                                "outline RNA virus and protein essential for viral transcription and/or replication",
                                "describe protease regulation of protein activity",
                                "explain autocatalytic protease",
                                "describe cis-cleavage and trans-cleavage",
                                "outline protease and cleavage site",
                                "describe autocatalytic protease generation",
                                "specify protease framed by cleavage sites",
                                "describe ON-switch and OFF-switch aspects",
                                "outline protease and cleavage site in trans",
                                "describe viral, prokaryotic, and eukaryotic proteases",
                                "specify heterologous protease",
                                "describe protease inhibitor and inhibition",
                                "outline specific protease inhibitors",
                                "describe human proteases and inhibitors",
                                "specify caspase and metalloproteinase inhibitors",
                                "describe dimeric protease",
                                "outline single-chain dimer protease",
                                "specify HIV-1 protease and inhibitors",
                                "describe oncolytic virus and therapeutic protein production"
                            ],
                            "num_characters": 20030,
                            "outline_medium": [
                                "define single-stranded RNA virus with modified genome",
                                "describe ON-switch aspect with protease and cleavage site",
                                "describe OFF-switch aspect with fusion protein and cleavage site",
                                "specify RNA viruses suitable for the invention",
                                "identify at least one protein essential for viral transcription and/or replication",
                                "describe RdRp complex in VSV",
                                "specify order Mononegavirales and families thereof",
                                "identify polymerase cofactor, polymerase, and nucleocapsid protein",
                                "describe functional equivalent of P-protein",
                                "specify L-protein, P-protein, and N-protein in various families",
                                "describe regulation of viral transcription and/or replication by protease",
                                "define cleavage site for said protease",
                                "describe autocatalytic protease or protease acting as autocatalytic protease",
                                "specify protease framed by cleavage site on either side",
                                "describe ON-switch with insert at intramolecular insertion site",
                                "describe protease or autocatalytic protease from various sources",
                                "specify protease inhibitor and its properties",
                                "describe HIV protease inhibitors and human protease inhibitors",
                                "specify single-chain dimer of protease and its properties",
                                "describe oncolytic virus and its properties"
                            ],
                            "outline_short": [
                                "define conditional regulation of RNA virus",
                                "describe ON-switch aspect of invention",
                                "describe OFF-switch aspect of invention",
                                "specify RNA viruses suitable for invention",
                                "identify essential proteins for viral transcription and/or replication",
                                "describe protease regulation of essential proteins",
                                "specify protease characteristics and sources",
                                "describe protease inhibitors and their use",
                                "outline use of heterologous proteins in RNA virus",
                                "describe oncolytic virus applications"
                            ]
                        },
                        {
                            "title": "ON-Switch",
                            "paragraphs": [
                                "Provided is a single stranded RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease, preferably comprising the protease and the cleavage site for said protease.",
                                "The insert at the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication does not affect activity of the at least one protein essential for viral transcription and/or replication. Activity of the at least one protein essential for viral transcription and/or replication may be assessed by detecting viral reporter gene expression, TCID50 replication assays or MTT killing assays (see FIG. 13C), preferably using a TCID50 replication assay. Wherein the modified protein essential for viral transcription and/or replication carrying an insert at the intramolecular site may be expressed by the single-stranded RNA virus or may be expressed in trans on a plasmid together with a single-stranded RNA virus deficient in said protein essential for viral transcription and/or replication. The insert at the intramolecular insertion site of the at least one protein essential for viral transcription or replication is considered not to affect activity of the at least one protein essential for viral transcription and/or replication if the activity of the protein and hence viral replication as measured, e.g., by TCID50, provides titers of no more than 2 log lower titers, preferably no more than 1.5 log lower titers, more preferably no more than 1 log lower titers and more preferably equal titers compared to a recombinant single-stranded RNA virus without the insert at the intramolecular insertion site (control) and in case of a protease at the intramolecular insertion site in the presence of a protease inhibitor in the control and the test sample.",
                                "In the single-stranded RNA virus at least the cleavage site for said protease, and optionally further the protease, is located within the intramolecular insertion site of the least one protein essential for viral transcription and/or replication, and the proteolytic cleavage of the protein cleaves the at least one protein essential for viral transcription and/or replication at the cleavage site for said protease within the intramolecular insertion site. Cleavage within the intramolecular insertion site inactivates the at least one protein essential for viral transcription and/or replication. Thus, cleavage within the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication further inhibits viral transcription and/or replication. Consequently, the virus is active in the presence of a specific inhibitor of the protease and inactive in the absence of a specific inhibitor of the protease. The single-stranded RNA virus may further encode at least one heterologous protein, wherein the heterologous protein is expressed if the virus is active in the presence of a specific inhibitor of the protease and is not expressed if the virus is inactive in the absence of a specific inhibitor of the protease. Production of such heterologous protein depends on intact activity of the viral transcription complex. A suitable heterologous protein is a protein such as a therapeutic protein, a reporter or a tumor antigen.",
                                "In a specific embodiment the protease is the autocatalytic HIV protease dimer inserted at the intramolecular insertion site of one or two proteins of the vesicular stomatitis virus (VSV) that make up the polymerase complex (P-protein and/or L-protein, separately and in combination). In the presence of protease inhibitor, the integrity of the viral proteins is preserved and the virus replicates. Without protease inhibitors, the HIV protease dimer is autocatalytically active, cleaving the essential viral proteins upon translation. Analogous to regulatory modules in DNA viruses (e.g. Tet-On), this mechanism is referred to as “prot-ON” in the Examples.",
                                "In one embodiment the insert at the intramolecular insertion site comprises a protease and at least one cleavage site for said protease. At the intramolecular location, the protease has a two cleavage sites. Thus, the protease has a cleavage site on either side and optionally a linker on one or both sides. The linker may either flank the cleavage site on one or both sides or alternatively may be located between the protease and the one or more cleavage site. The two cleavage sites for said protease (and the optional linkers) on either side of the protease are preferably different from each other.",
                                "In one embodiment the RNA virus is of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is a polymerase cofactor, e.g., the P-protein or a functional equivalent thereof; a polymerase, e.g., the L-protein; and/or a nucleocapsid, e.g., the N-protein. The at least one protein essential for viral transcription and/or replication may be one, two or three proteins essential for viral transcription and/or replication, preferably one or two proteins essential for viral transcription and/or replication. In certain embodiments the at least one protein essential for viral transcription and/or replication is the P-protein or a functional equivalent thereof or the L-protein or a combination thereof.",
                                "The codon usage of the flexible linkers and protease dimer has been optimized to avoid homology between the first and second protease. This precaution was taken, since so called “copy-choice” recombination events in VSV have been described previously (Simon-Loriere and Holmes 2011), in which the viral polymerase, the L-protein, can switch between templates and also skip sequence stretches. “Copy-choice” occurs preferentially when the polymerase is guided by sequence homology of the nascent RNA strand with the newly chosen template. Furthermore, point mutations arise frequently in RNA viruses, in the case of VSV at a mutation rate of about 1 nucleotide in 10,000. Theoretically, every genome carries one mutation, which leads virologists to refer to the VSV genome (and other RNA virus genomes) not as one sequence, but to a mixture of so called “quasi-species”. Therefore, occurrence of mutations within the HIV protease sequence rendering the proteolytic switch inactive are a real possibility. To avoid such escape mutants or revertant viruses that may lose the conditional ON switch control, the protease module (ON-switch) may be doubled by introducing protease dimers in a first and a second essential VSV protein, such as the P-protein and the L-protein. The protease and the respective cleavage site may be the same in the two proteins essential for viral transcription and/or replication or may be different and hence may be regulated by the same or different protease inhibitors.",
                                "A suitable insertion site at amino acid 196 of the P-protein of VSV has already been described (Das et al., J Virol, 2006, 80(13):6368-6377 and Das and Pattnaik, J Virol, 2005, 79(13):8101-8112), wherein the numbering refers to the P-protein of serotype VSV Indiana (VSVi) (e.g., having the nucleotide sequence of SEQ ID NO: 1 and/or the amino acid sequence of SEQ ID NO: 27).",
                                "L-protein insertion sites have been described, but the resulting viruses were temperature sensitive and instable after passage (Ruedas and Perrault 2009, Ruedas and Perrault 2014). Based on the recently published full structure information on the VSV L-protein (Liang, Li et al. 2015) possible permissive sites were identified and tested, initially with fluorescence proteins and subsequently with the HIV protease dimer.",
                                "Thus, in one embodiment the single-stranded RNA virus is a Vesicular Stomatitis Virus (VSV). Although there are VSV serotypes, the VSV serotype best characterized and used in therapy is VSV Indiana (VSVi). All sequences disclosed and used herein are from VSVi. Also encompassed are derivatives of VSVi, such as VSV-GP as described in more detail in WO 2010/040526. Since VSV Indiana is a RNA virus, there are several complete genome nucleotide sequences available, one example is the cDNA sequence of SEQ ID NO: 22 (GenBank accession number MH919398.1). The viruses generated in the examples are derived from the DNA sequence of (SEQ ID NO: 20). The positions referred to in the following are therefore provided as corresponding to the provided amino acid position of the P-protein or the L-protein of VSVi or the P-protein or the L-protein of VSVi having the amino acid sequence of SEQ ID NOs: 27 or 28, respectively. The person skilled in the art would know how to identify the corresponding amino acid sequence in a further VSVi P-protein or L-protein sequence by sequence alignment.",
                                "In one embodiment the single-stranded RNA virus is VSV and the at least one protein essential for viral transcription and/or replication is the P-protein and/or the L-protein of VSV. A suitable intramolecular insertion site for the P-protein is in the flexible hinge region of the VSV P-protein, preferably at a position corresponding to amino acid position 193-199, more preferably amino acid position 196 of VSVi P-protein. In a specific embodiment the intramolecular insertion site of the P-protein is at amino acid position 193-199 of the P-protein of VSVi, preferably at amino acid 196 of the P-protein of VSVi. Wherein the numbering refers to the P-protein of VSVi, and one exemplary sequence of the P-protein of VSVi has the amino acid sequence of SEQ ID NO: 27. In one embodiment the intramolecular insertion site of the P-protein is at amino acid position 193-199 of the P-protein of VSVi having the sequence of SEQ ID NO: 27 or a homologue thereof, preferably at amino acid 196 of the P-protein of VSVi having the sequence of SEQ ID NO: 27 or a homologue thereof, wherein the homologue has at least 80% sequence identity with SEQ ID NO: 27, preferably at least 90% sequence identity with SEQ ID NO: 27. A suitable intramolecular insertion site for the L-protein is in the methyltransferase domain (MT) of the L-protein, particularly in the loop of the methyltransferase domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625, and more preferably to amino acid 1620 of VSVi L-protein. In a specific embodiment the intramolecular insertion site of the L-protein is between amino acids 1614 and 1634, preferably between amino acids 1614 and 1629, more preferably between amino acids 1616 and 1625, and more preferably at amino acid 1620 of VSVi L-protein. Wherein the numbering refers to the L-protein of VSVi, and one exemplary sequence of the L-protein of VSVi has the amino acid sequence of SEQ ID NO: 28. In one embodiment the intramolecular insertion site of the L-protein is between amino acids 1614 and 1634, preferably between amino acids 1614 and 1629, more preferably between amino acids 1616 and 1625, and even more preferably at amino acid 1620 of the L-protein of VSVi having the sequence of SEQ ID NO: 28 or a homologue thereof, wherein the homologue has at least 80% sequence identity with SEQ ID NO: 28, preferably at least 90% sequence identity with SEQ ID NO: 28. In another embodiment the single-stranded RNA virus is VSV and the P-protein comprises an insert at the intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease in the flexible hinge region of the VSV P-protein at a position corresponding to amino acid position 193-199 of VSVi P-protein, preferably at amino acid position 193-199 of VSVi P-protein or the L-protein comprises an insert at the intracellular insertion site comprising at least the cleavage site for said protease and optionally further the protease in the loop of the methyltransferase domain (MT) of the L-protein corresponding to amino acids 1614 to 1634 of VSVi L-protein, preferably between amino acids 1614 and 1634 of VSVi L-protein. In yet another embodiment the single-stranded RNA virus is VSV and the P-protein comprises an insert at the intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease in the flexible hinge region of the VSV P-protein at a position corresponding to amino acid position 193-199 of VSVi P-protein, preferably at amino acid position 193-199 of VSVi P-protein and the L-protein comprises an insert at the intracellular insertion site comprising at least the cleavage site for said protease and optionally further the protease in the loop of the methyltransferase domain (MT) of the L-protein corresponding to amino acids 1614 to 1634 of VSVi L-protein, preferably between amino acids 1614 and 1634 of VSVi L-protein. Placing an ON-switch into more than one, preferable two proteins essential for viral transcription and/or replication reduces the risk of escape mutants. Although no ON-switch escape mutants have been observed despite repetitive passages an insert in two proteins essential for viral transcription and/or replication provides more stability. The term “at amino acid position” as used herein refers to after, i.e., at amino acid position 196 of VSVi P-protein having the sequence of SEQ ID NO: 27 and means between amino acid positions 196 and 197 of VSVi P-protein having the sequence of SEQ ID NO: 27 and at amino acid 1620 of the L-protein of VSVi having the sequence of SEQ ID NO: 28 means between amino acid positions 1620 and 1621 of the L-protein of VSVi having the sequence of SEQ ID NO: 28.",
                                "The ON-switch system inherently harbors an environmental safety element. As virus progeny depend on presence of protease inhibitor, potentially shed virus is not active for productive infection. This may be important in case a therapeutic RNA virus can cause animal disease.",
                                "VSV is typically associated with neurotoxicity and intracranial spread. In vivo data have shown that the ON-switch system resulted in complete abrogation of neurotoxicity and intracranial spread. As the protease inhibitor amprenavir does not cross the blood brain barrier, systemic application of the compound did not confer virus activity in the brain and neurotoxicity was absent despite a systemically present ON-switch system resulting in virus replication in the presence of systemic amprenavir.",
                                "In one embodiment the single stranded RNA virus according to the invention is for use in therapy, particularly for use in cancer therapy, particularly in humans."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define ON-switch system",
                                "describe modified genome of single-stranded RNA virus",
                                "introduce protease and cleavage site",
                                "explain insert at intramolecular insertion site",
                                "describe activity of modified protein",
                                "summarize assessment methods",
                                "describe expression of modified protein",
                                "explain effect of protease inhibitor",
                                "describe specific embodiment of protease",
                                "introduce HIV protease dimer",
                                "describe insert at intramolecular insertion site",
                                "explain cleavage sites and linkers",
                                "describe RNA virus and essential proteins",
                                "introduce codon usage optimization",
                                "explain \"copy-choice\" recombination events",
                                "describe mutation rate in RNA viruses",
                                "introduce protease module doubling",
                                "describe suitable insertion site in P-protein",
                                "introduce L-protein insertion sites",
                                "describe VSV serotypes and sequences",
                                "introduce VSV Indiana and derivatives",
                                "describe genome nucleotide sequences",
                                "explain amino acid position numbering",
                                "describe intramolecular insertion site in P-protein",
                                "describe intramolecular insertion site in L-protein",
                                "introduce environmental safety element",
                                "describe neurotoxicity and intracranial spread",
                                "explain in vivo data results",
                                "describe therapeutic use of single-stranded RNA virus"
                            ],
                            "num_characters": 14820,
                            "outline_medium": [
                                "define modified genome of single-stranded RNA virus",
                                "describe insert at intramolecular insertion site",
                                "explain activity assessment of modified protein",
                                "describe expression of modified protein",
                                "outline proteolytic cleavage and inactivation",
                                "describe virus activity in presence/absence of protease inhibitor",
                                "introduce heterologous protein expression",
                                "describe specific embodiment with HIV protease dimer",
                                "outline insert with protease and cleavage sites",
                                "describe RNA virus and essential proteins",
                                "explain codon usage optimization",
                                "describe doubling of protease module",
                                "introduce suitable insertion sites for P-protein and L-protein",
                                "outline environmental safety element and therapeutic use"
                            ],
                            "outline_short": [
                                "define modified genome of single-stranded RNA virus",
                                "describe insert at intramolecular insertion site",
                                "explain proteolytic cleavage and inactivation of protein",
                                "detail specific embodiment with HIV protease dimer",
                                "describe codon usage optimization and avoidance of homology",
                                "discuss insertion sites in P-protein and L-protein of VSV",
                                "outline applications and advantages of ON-switch system"
                            ]
                        },
                        {
                            "title": "OFF-Switch",
                            "paragraphs": [
                                "Also provided is a single-stranded RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease. In one embodiment the fusion protein does not comprise an amino acid sequence of SEQ ID NO: 30. Preferably the protease is fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication. Thus, the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease directly fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease and optionally a linker. The fusion protein may or may not comprise a linker between the protease and the protein essential for viral transcription and/or replication, such as a glycine-serine linker. Thus, the fusion protein may or may not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication; or alternatively the fusion protein may or may not comprise a linker between the protease and the cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication.",
                                "The at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease and wherein proteolytic cleavage of the fusion protein releases the at least one protein essential for viral transcription and/or replication in its active form. Thus, the at least one protein essential for viral transcription and/or replication and the protease are expressed as a fusion protein separated by a cleavage site for said protease. Upon proteolytic cleavage, the protease and the at least one protein essential for viral transcription and/or replication are separated. The at least one protein essential for viral transcription and/or replication is inactive in the fusion protein and gets activated upon release by proteolytic cleavage (also referred to as proteolytic release). According to the invention, the fusion protein does not comprise an amino acid sequence of SEQ ID NO: 30. This sequence functions as a degron in a SMASh tag described by Chung et al. (Nature Chemical Biology (2015), 11: 713-722) resulting in degradation of a protein. By contrast, according to the present invention the fusion of the protease to the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease inactivates the at least one protein essential for viral transcription and/or replication. The fusion protein is therefore expressed and detectable, i.e., not degraded. Thus, within the fusion protein the at least one protein essential for viral transcription and/or replication is functionally inactive. Rendering the at least one protein essential for viral transcription and/or replication, such as the L-protein, functionally inactive in the fusion protein, is sufficient to efficiently switch-off virus production, without the need for protein degradation. The single-stranded RNA virus may further encode at least one heterologous protein, wherein the heterologous protein is expressed if the virus is active in the presence of a specific inhibitor of the protease and is not expressed if the virus is inactive in the absence of a specific inhibitor of the protease. Production of such heterologous protein depends on intact activity of the viral transcription complex. A suitable heterologous protein is a protein such as a therapeutic protein, a reporter or a tumor antigen.",
                                "Thus, the at least one protein essential for viral transcription and/or replication in the fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease without proteolytic cleavage is inactive. The proteolytic cleavage of the fusion protein is inhibited using a specific inhibitor of the protease. The single-stranded RNA virus is therefore inactive in the presence of a specific protease inhibitor of the protease and active in the absence of a specific inhibitor of the protease.",
                                "In one embodiment the protease and the cleavage site for said protease replace an intergenic region that links a protein essential for viral transcription and/or replication with a further viral protein. Thus, in one embodiment the fusion protein comprises a protein essential for viral transcription and/or replication and a further viral protein separated by the protease and the cleavage site for said protease, wherein the protease is preferably flanked by a cleavage site for said protease on either side (i.e., at the N-terminal and the C-terminal end of the protease). Thus, loss of the protease leads to a further inactive fusion protein comprising the protein essential for viral transcription and/or replication and the further viral protein. In other words, deletion of the protease and the cleavage site(s) for said protease in a revertant or escape mutant would lead to a new non-functional fusion protein comprising the protein essential for viral transcription and/or replication in its inactive state fused to the further viral protein. Thus, replacing the entire intergenic region makes the virus safer as deletion of the insert comprising the protease and the cleavage site for said protease results in a further fusion protein, wherein the further fusion protein comprises the protein essential for viral transcription and/or replication and the further viral protein. The further viral protein may be a second protein essential for viral transcription and/or replication. Since deletion of the protease insert does not provide any advantage to this virus, this feature provides protection from escape mutants.",
                                "In case the viral genome does not contain two proteins essential for viral transcription and/or replication adjacent to each other, this may be achieved by gene shuffling. For VSV it is known that the genes can be shuffled. However, the order of the genes in the genome correlates with translation frequency. Thus, gene shuffling usually comes with some degree of attenuation. Alternatively the further viral protein is a viral protein that is not essential for viral transcription and/or replication.",
                                "In another embodiment the protease and the cleavage site for said protease replace an intergenic region that links a protein essential for viral transcription and/or replication with a heterologous protein, such as shown in FIG. 17. In other words, the protease is fused to the protein essential for viral transcription and/or replication at one end and to at the heterologous protein at the other end, each separated by a cleavage site for said protease. Thus, in one embodiment the fusion protein may also comprise a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, wherein said heterologous protein and said protease are also separated by the cleavage site for said protease. In one embodiment the protease is flanked by the cleavage site for said protease on either side and replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a heterologous protein. Thus, loss of the protease leads to a further inactive fusion protein comprising the protein essential for viral transcription and/or replication and the heterologous protein.",
                                "In case the intergenic region is replaced by the protease, the protease should be an autocatalytic protease flanked on either side by a cleavage site for said protease, i.e., comprising two cleavage sites to said protease, one at the N-terminal and one at the C-terminal side of the protease (or the single chain dimer protease). Thus, in one embodiment the fusion protein further comprises a further viral protein or a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, and wherein said further viral protein or heterologous protein and said protease are also separated by the cleavage site for said protease. In a specific embodiment the protease flanked by a cleavage site for said protease on either side replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a further viral protein or heterologous protein, preferably wherein deletion of the protease in a revertant virus or an escape mutant leads to inactivation of the at least one protein essential for viral transcription and/or replication by forming a fusion protein with the at least one further viral protein or heterologous protein. Replacing the intergenic region with the protease has the advantage of reducing (in the case of a further viral protein) or of not increasing (in the case of a heterologous protein) the number of intergenic regions and hence reducing the risk of virus attenuation. The two cleavage sites for said protease (and the optional linkers) on either side of the protease are preferably different from each other.",
                                "In one embodiment the RNA virus is of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is a polymerase cofactor, e.g., the P-protein or a functional equivalent thereof; a polymerase, e.g., the L-protein; and/or a nucleocapsid, e.g., the N-protein. The at least one protein essential for viral transcription and/or replication may be one or two proteins essential for viral transcription and/or replication, preferably one protein essential for viral transcription and/or replication. Preferably the at least one protein essential for viral transcription and/or replication is the P-protein or a functional equivalent thereof or the L-protein, preferably the L-protein. Also, the protease is preferably fused to the N-terminal end of the P-protein (or a functional equivalent thereof) or the L-protein, more preferably to the N-terminal end of the L-protein.",
                                "In a preferred embodiment the at least one protein essential for viral transcription and/or replication is an L-protein; or the protease is fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease; or the at least one protein essential for viral transcription and/or replication is an L-protein and the protease is fused to the N-terminal end of the L-protein separated by the cleavage site for said protease. According to the invention, the at least one protein essential for viral transcription and/or replication, preferably the L-protein, is inactive in the fusion protein, preferably the fusion protein comprising the protease fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication, and gets activated upon release by proteolytic cleavage.",
                                "In one embodiment the single-stranded RNA virus comprises a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein consisting of the protease fused to the N-terminal or C-terminal end of the protein essential for viral transcription and/or replication, separated by the cleavage site for said protease, wherein the fusion protein optionally further comprises a linker between the protease and the protein essential for viral transcription and/or replication, such as a glycine-serine linker. Thus, the fusion protein may or may not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication; or alternatively the fusion protein may or may not comprise a linker between the protease and the cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication. Preferably the protease is fused to the N-terminal end of the protein essential for viral transcription and/or replication, or the at least one protein essential for viral transcription and/or replication is an L-protein, or the protease is fused to the N-terminal end of the L-protein.",
                                "In another embodiment the single-stranded RNA virus comprises a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising or consisting of (a) the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease, and (b) a further viral protein or a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, and wherein said further viral protein or heterologous protein and said protease are also separated by a cleavage site for said protease, wherein the fusion protein optionally further comprises a linker between the protease and the protein essential for viral transcription and/or replication, and/or a linker between the protease and the further viral protein or heterologous protein. Thus, the fusion protein may or may not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication; or alternatively the fusion protein may or may not comprise a linker between the protease and the cleavage site; and/or the fusion protein may or may not comprise a linker between the cleavage site and the further viral protein or heterologous protein; or alternatively the fusion protein may or may not comprise a linker between the other side of protease and the cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the protein essential for viral transcription and/or replication.",
                                "Preferably the protease is fused to the N-terminal end of the protein essential for viral transcription and/or replication, or the at least one protein essential for viral transcription and/or replication is an L-protein, or the protease is fused to the N-terminal end of an L-protein. The two cleavage sites for said protease (and the optional linkers) on either side of the protease are preferably different from each other. The protease having a cleavage site on either side may have a linker on one or both side, either flanking the cleavage site on one or both sides or alternatively between the protease and the one or more cleavage site. Preferably the fusion protein does not comprise a linker between the cleavage site and the at least one protein essential for viral transcription and/or replication.",
                                "In one embodiment the single stranded RNA virus according to the invention is for use in therapy, particularly for use in cancer therapy, particularly in humans."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define single-stranded RNA virus",
                                "describe modified genome of virus",
                                "introduce protease and cleavage site",
                                "explain fusion protein",
                                "describe inactive protein essential for viral transcription and/or replication",
                                "detail proteolytic cleavage",
                                "introduce specific inhibitor of protease",
                                "describe active and inactive states of virus",
                                "explain replacement of intergenic region",
                                "introduce autocatalytic protease",
                                "describe fusion protein with further viral protein or heterologous protein",
                                "explain loss of protease leads to inactivation",
                                "describe gene shuffling",
                                "introduce order of genes in genome",
                                "explain correlation of gene order with translation frequency",
                                "describe attenuation of gene shuffling",
                                "introduce alternative viral protein",
                                "describe preferred embodiment of protease and cleavage site",
                                "explain preferred embodiment of at least one protein essential for viral transcription and/or replication",
                                "describe preferred embodiment of fusion protein",
                                "introduce specific embodiment of single-stranded RNA virus",
                                "describe modified genome of virus",
                                "explain fusion protein with further viral protein or heterologous protein",
                                "describe preferred embodiment of protease and cleavage site",
                                "explain preferred embodiment of at least one protein essential for viral transcription and/or replication",
                                "describe preferred embodiment of fusion protein",
                                "introduce specific embodiment of single-stranded RNA virus",
                                "describe modified genome of virus",
                                "explain fusion protein with further viral protein or heterologous protein",
                                "describe preferred embodiment of protease and cleavage site",
                                "explain preferred embodiment of at least one protein essential for viral transcription and/or replication",
                                "describe use in therapy, particularly cancer therapy"
                            ],
                            "num_characters": 16080,
                            "outline_medium": [
                                "define single-stranded RNA virus",
                                "describe fusion protein with protease and cleavage site",
                                "explain inactivation of protein essential for viral transcription/replication",
                                "describe proteolytic cleavage and activation of protein",
                                "introduce specific inhibitor of protease",
                                "describe inactive fusion protein without proteolytic cleavage",
                                "explain replacement of intergenic region with protease and cleavage site",
                                "describe loss of protease leading to inactive fusion protein",
                                "introduce gene shuffling for adjacent proteins",
                                "describe alternative embodiment with heterologous protein",
                                "explain autocatalytic protease with two cleavage sites",
                                "describe preferred embodiments of protease and protein essential for viral transcription/replication",
                                "introduce modified genome of virus with polynucleotide sequence",
                                "describe optional linkers between protease and protein essential for viral transcription/replication",
                                "explain preferred embodiments of fusion protein",
                                "describe use of single-stranded RNA virus in therapy, particularly cancer therapy"
                            ],
                            "outline_short": [
                                "define single-stranded RNA virus with modified genome",
                                "describe fusion protein with protease and cleavage site",
                                "explain inactivation of protein essential for viral transcription/replication",
                                "detail proteolytic cleavage and activation of protein",
                                "describe replacement of intergenic region with protease and cleavage site",
                                "outline consequences of protease deletion in revertant virus",
                                "specify examples of proteins essential for viral transcription/replication",
                                "summarize preferred embodiments of single-stranded RNA virus"
                            ]
                        },
                        {
                            "title": "Conditional Expression of a Heterologous Protein",
                            "paragraphs": [
                                "The single-stranded RNA virus according to the invention comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein (a) the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease, or (b) the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease, may further encode at least one heterologous protein. Production of such heterologous protein depends on intact viral transcription and/or replication and therefore requires that the at least one protein essential for viral transcription and/or replication is active. Thus, in alternative (a) (ON-switch) the heterologous protein is expressed if the virus is active in the presence of a specific inhibitor of the protease and is not expressed if the virus is inactive in the absence of a specific inhibitor of the protease and in alternative (b) (OFF-switch) the heterologous protein is not expressed if the virus is inactive in the presence of a specific inhibitor of the protease and is expressed if the virus is active in the absence of a specific inhibitor of the protease. A suitable heterologous protein is a protein such as a therapeutic protein, a reporter or a tumor antigen. Particularly for therapeutic purposes, the heterologous protein is preferably a therapeutic protein with immune-modulatory or cell death modulatory function or a tumor antigen. The therapeutic protein may also be a protein encoded by suicide gene.",
                                "Also provided herein is an RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one heterologous protein, a protease and a cleavage site for said protease, wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease. In one embodiment the RNA virus is a single-stranded RNA virus.",
                                "The term single-stranded RNA virus includes a positive-sense single-stranded RNA virus or a negative-sense single-stranded RNA virus. Preferably, the RNA virus is a negative-sense single stranded RNA virus. In one embodiment the RNA virus is of the order Mononegavirales. More specifically the single-stranded RNA virus of the order Mononegavirales may be a virus of a family selected from the group consisting of Rhabdoviridae, Paramyxoviridae, Filoviridae, Nyamiviridae, Pneumoviridae and Bornaviridae, preferably of the family Rhabdoviridae or Paramyxoviridae, preferably of the genus Vesiculovirus, more preferably a Vesicular Stomatitis Virus (VSV) or a Measles morbillivirus (MeV), even more preferably VSV.",
                                "In certain embodiments the virus is an oncolytic virus. An oncolytic virus is a virus that preferentially infects and kills cancer cells. The killed cancer cells release new infectious virus particles that infect further cancer cells and release cell fragments that stimulate an anti-tumor immune response in the host. Clinically tested oncolytic RNA viruses include without being limited thereto, reovirus, measles virus, Newcastle disease virus, influenza virus, Semliki Forest virus, Sindbis virus, poliovirus, Coxsackie virus, Seneca Valley virus, Maraba virus and VSV. Preferably the oncolytic virus is VSV.",
                                "The term heterologous refers to the RNA virus rather than the host or patient infected with the virus and therefore explicitly encompasses eukaryotic, particularly human proteins. The heterologous protein is a protein derived from a different organism or a different species from the recipient, i.e., the RNA virus. The at least one heterologous protein encoded by the RNA virus according to the invention may be a therapeutic protein, a reporter or a tumor antigen. Preferably the at least one heterologous protein is a therapeutic protein with immune-modulatory or cell death modulatory function, preferably selected from the group consisting of cytokines, chemokines, growth factors and antibodies. The therapeutic protein may be also a membrane bound protein or may be rendered membrane bound by fusing a transmembrane domain, such as the transmembrane domain of CD4, to the heterologous protein, preferably linked via a linker. The therapeutic protein may also be an encoded suicide gene. Alternatively or in addition the at least one heterologous protein is a tumor antigen (including a tumor-specific and/or tumor-associated antigen), such as lineage antigens, neoantigens, testis antigens and oncoviral antigens. The term “tumor-specific antigen” refers to an antigen exclusively expressed in the tumor cell but not in any other tissue of the organism. The term “tumor-associated antigen” refers to an antigen overexpressed in the tumor cell compared to other tissue in the organism, i.e., expressed at a higher level. The tumor antigen may also be a neoantigen or neoantigens. Wherein neoantigens are newly formed antigens arising from tumor somatic mutations. The person skilled in the art would know how to detect and determine neoantigens from a patient. In another embodiment the heterologous protein is a reporter protein, such as green florescent protein, red florescent protein, mCherry or mWasabi. Particularly for therapeutic purposes, the heterologous protein is preferably a therapeutic protein with immune-modulatory or cell death modulatory function or a tumor antigen.",
                                "The person skilled in the art would understand that the insert comprising at least the cleavage site for said protease and optionally further the protease in the intramolecular insertion site corresponds to the insert comprising at least the cleavage site for said protease and optionally further the protease in the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication, i.e., the ON-switch. Thus, the above disclosure and the embodiments relating to the ON-switch likewise apply to the RNA virus comprising a modified genome of the virus comprising at least one heterologous protein, a protease and a cleavage site for said protease, wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease. In one embodiment the RNA virus is a single-stranded RNA virus.",
                                "The person skilled in the art would further understand that the aspect relating to the ON-switch in the heterologous protein may be combined with the ON-switch in the at least one protein essential for viral transcription and/or replication. Thus also envisaged are armed viruses with two independent switches, one controlling virus activity and one controlling the activity of the virus-encoded therapeutic proteins. Both switches would preferably be controlled by two independent compounds.",
                                "In one embodiment the RNA virus according to the invention is for use in therapy, particularly for use in cancer therapy, particularly in humans.",
                                "Also provided is a polynucleotide sequence encoding at least one recombinant protein, a protease and a cleavage site for said protease, wherein the at least one recombinant protein comprises an insert at an intramolecular insertion site comprising the protease and the cleavage site for said protease or a recombinant protein comprising an insert at an intramolecular insertion site comprising the protease and the cleavage site for said protease. Thus, the ON-switch as described herein can also be used for therapeutic proteins, particularly for therapeutic proteins with a small therapeutic window. Examples for such therapeutic proteins are cytokines.",
                                "In one embodiment the polynucleotide or the recombinant protein according to the invention is for use in therapy, particularly for use in therapy in humans. The protease is therefore preferably of human origin to prevent immune reactions.",
                                "Thus, in one embodiment the protease is a human protease, such as a metalloprotease or a caspase. Examples of suitable human protease inhibitors are, without being limited thereto, e.g. emricasan, nivocasan, batimastat, tanomastat, and ecaliximab. In a further embodiment the protease is an autocatalytic protease or a protease that acts as an autocatalytic protease. Thus, the protease may be flanked by a cleavage site for said protease, preferably the protease is flanked by a cleavage site for said protease on either side. The two cleavage sites for said protease (and the optional linkers) on either side of the protease are preferably different from each other. Preferably the insert comprises a flexible linker on either side, such as a glycine-serine linker."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce single-stranded RNA virus",
                                "describe modified genome of virus",
                                "explain fusion protein with protease and cleavage site",
                                "introduce heterologous protein",
                                "describe production of heterologous protein",
                                "explain dependence on viral transcription and/or replication",
                                "introduce specific inhibitor of protease",
                                "describe ON-switch and OFF-switch",
                                "explain expression of heterologous protein",
                                "introduce therapeutic protein",
                                "describe immune-modulatory or cell death modulatory function",
                                "explain tumor antigen",
                                "introduce reporter protein",
                                "describe RNA virus",
                                "explain single-stranded RNA virus",
                                "introduce oncolytic virus",
                                "describe VSV",
                                "explain use in therapy, particularly cancer therapy"
                            ],
                            "num_characters": 9026,
                            "outline_medium": [
                                "describe modified genome of virus with polynucleotide sequence",
                                "introduce insert at intramolecular insertion site with cleavage site and protease",
                                "explain conditional expression of heterologous protein",
                                "describe ON-switch and OFF-switch embodiments",
                                "introduce therapeutic protein, reporter, or tumor antigen as heterologous protein",
                                "describe oncolytic virus, particularly VSV",
                                "explain heterologous protein as therapeutic protein with immune-modulatory or cell death modulatory function",
                                "describe tumor antigen, including tumor-specific and tumor-associated antigens",
                                "describe use of RNA virus in therapy, particularly cancer therapy"
                            ],
                            "outline_short": [
                                "describe encoding of heterologous protein in single-stranded RNA virus",
                                "explain conditional expression of heterologous protein",
                                "specify examples of heterologous proteins",
                                "outline therapeutic applications of single-stranded RNA virus"
                            ]
                        },
                        {
                            "title": "Therapeutic Use",
                            "paragraphs": [
                                "Also provided herein is the single-stranded RNA virus according to the present invention comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein (a) the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease, or (b) the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease for use in therapy, wherein the single-stranded RNA virus optionally further encodes at least one heterologous protein, e.g., a therapeutic protein or a tumor antigen. Suitable therapies are cancer therapy, gene therapy and/or preventive and therapeutic vaccination.",
                                "In a preferred embodiment the single-stranded RNA virus is for use in treating cancer.",
                                "Also provided herein is the RNA virus according to the present invention comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one heterologous protein, a protease and a cleavage site for said protease, wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease for use in therapy. Suitable therapies are cancer therapy, gene therapy and/or preventive and therapeutic vaccination.",
                                "In a preferred embodiment the RNA virus is for use in treating cancer.",
                                "The virus may be administered intravenously, intratumoral, subcutaneously, intramuscular, intradermally, intranasally, intraperitoneally, preferably intravenously or intratumoral. The virus may be administered using physiological buffers or related formulations. The protease inhibitor used is specific for said protease. Example of suitable HIV protease inhibitors are without being limited thereto, e.g., indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir and darunavir. Other suitable protease inhibitors are well known in the art. In therapy the protease inhibitor, particularly the HIV protease inhibitor, may be administered in combination with a blocker of a degradation enzyme such as the Cyp family, e.g., ritonavir. Ritonavir or other inhibitors of degradation enzymes augment the plasma concentration of the other protease inhibitors.",
                                "The protease inhibitor may be administered by any suitable route, preferably subcutaneously, orally or intravenously, more preferably orally.",
                                "The cancer may be a solid tumor, preferably selected from the group consisting of colon carcinoma, prostate cancer, breast cancer, lung cancer, skin cancer, liver cancer, bone cancer, ovary cancer, pancreas cancer, brain cancer, head and neck cancer, lymphoma (Hodgkin's and non-Hodgkin's lymphoma) brain cancer, neuroblastoma, mesothelioma, Wilm's tumor, retinoblastoma and sarcoma (such as rhabdomyo sarcoma)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe therapeutic use of modified RNA virus",
                                "specify cancer therapy as preferred embodiment",
                                "outline administration routes and formulations",
                                "list protease inhibitors and their administration routes",
                                "specify types of cancer that can be treated",
                                "describe combination therapy with degradation enzyme blockers"
                            ],
                            "num_characters": 3218,
                            "outline_medium": [
                                "describe therapeutic use of modified RNA virus",
                                "specify cancer therapy and administration routes",
                                "list suitable protease inhibitors and their administration"
                            ],
                            "outline_short": [
                                "describe therapeutic applications of modified RNA virus"
                            ]
                        },
                        {
                            "title": "L-Protein Insertion Site",
                            "paragraphs": [
                                "Also provided is a recombinant VSV L-protein comprising an insert in the methyltransferase (MT) domain of the L-protein, particularly in the loop of the methyltransferase domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625, and more preferably to amino acid 1620 of VSVi L-protein, particularly of VSVi L-protein having the amino acid sequence of SEQ ID NO: 28. In a specific embodiment the intramolecular insertion site of the L-protein is between amino acids 1614 and 1634, preferably between amino acids 1614 and 1629, more preferably between amino acids 1616 and 1625, and even more preferably at amino acid 1620 of VSVi L-protein. Wherein the numbering refers to the L-protein of VSVi, and one exemplary sequence of the L-protein of VSVi has the amino acid sequence of SEQ ID NO: 28. In one embodiment the intramolecular insertion site of the L-protein is between amino acids 1614 and 1634, preferably between amino acids 1614 and 1629, more preferably between amino acids 1616 and 1625, and even more preferably at amino acid 1620 of the L-protein of VSVi having the sequence of SEQ ID NO: 28 or a homologue thereof, wherein the homologue has at least 80% sequence identity with SEQ ID NO: 28, preferably at least 90% sequence identity with SEQ ID NO: 28.",
                                "The term “insert” as used herein refers to an amino acid sequence of variable length, including a few amino acids (such as at least 3, at least 5, at least 10, preferably at least 15 amino acids) to several hundreds of amino acids, such as up to 500, up to 300 and up to 250 amino acids. An insert is introduced into another sequence, in the present case the L-protein sequence and results in a net addition of amino acids. Thus, it may for example comprise at least a cleavage site of a protease (e.g., at least about 15 amino acids as in SEQ ID NOs: 6 and 7); a protease and at least a cleavage site for said protein; or a reporter protein. Preferably the insert comprises a flexible linker on either side, such as a glycine-serine linker. In certain embodiments the insert is from 15 to 500 amino acids, preferably from 15 to 300 amino acids, more preferably from 15 to 250 amino acids. An insert results in a net addition of amino acids and does not include an amino acid substitution, i.e., a simple replacement of one or more amino acids with the same number of different amino acids.",
                                "The insert at the intramolecular insertion site of the L-protein does not affect activity of the L-protein. Activity of the L-protein may be assessed by detecting viral reporter gene expression, TCID50 replication assays or MTT killing assays (see FIG. 13C), preferably using a TCID50 replication assay. Wherein the modified L-protein carrying an insert at the intramolecular site may be expressed by the single-stranded RNA virus or may be expressed in trans on a plasmid together with a single-stranded RNA virus lacking the L-protein. The insert at the intramolecular insertion site of the L-protein is considered not to affect activity of the L-protein if the activity of the protein and hence viral replication as measured, e.g., by TCID50, provides titers of no more than 2 log lower titers, preferably no more than 1.5 log lower titers, more preferably no more than 1 log lower titers and more preferably equal titers compared to a recombinant single-stranded RNA virus without the insert at the intramolecular insertion site (control) and in case of a protease at the intramolecular insertion site in the presence of a protease inhibitor in the control and the test sample.",
                                "In one embodiment the insert comprises a fluorescent protein. In another embodiment the insert comprises a cleavage site for a protease or a protease and a cleavage site for said protease. The protease may be a single-chain dimer flanked by two protease cleavage sites; or the protease may be a monomer flanked with an N-terminal and/or a C-terminal protease cleavage site. In one embodiment the protease is a viral protease, such as from HCV or HIV. Preferably the protease is an autocatalytic protease or acts as an autocatalytic protease.",
                                "The autocatalytic protease may be the HIV-1 protease, preferably a single chain dimer of the HIV-1 protease, and the protease can be inhibited by a protease inhibitor selected from the group consisting of indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir and darunavir.",
                                "The L-protein may further comprise a secondary mutation, preferably in the methyltransferase domain of the L-protein. In one embodiment the secondary mutation restores L-protein activity.",
                                "Also provided herein is a Vesicular Stomatitis Virus (VSV) comprising the recombinant VSV L-protein according to the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe recombinant VSV L-protein with insert",
                                "specify location of intramolecular insertion site",
                                "define term \"insert\" and its characteristics",
                                "describe preferred insert compositions",
                                "specify that insert does not affect L-protein activity",
                                "outline methods for assessing L-protein activity",
                                "describe insert compositions with fluorescent protein",
                                "describe insert compositions with protease and cleavage site",
                                "specify autocatalytic protease and its inhibitors"
                            ],
                            "num_characters": 4824,
                            "outline_medium": [
                                "introduce recombinant VSV L-protein with insert",
                                "define intramolecular insertion site and its properties",
                                "describe insert properties and its effect on L-protein activity",
                                "specify examples of inserts and their characteristics"
                            ],
                            "outline_short": [
                                "define L-protein insertion site and insert characteristics",
                                "describe effects of insert on L-protein activity"
                            ]
                        },
                        {
                            "title": "In Vitro Method",
                            "paragraphs": [
                                "Further provided is a method for controlling RNA virus replication comprising transducing or transfecting a host cell with the single-stranded RNA virus according to the invention comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease; maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor allows viral transcription and/or replication and the absence of said protease inhibitor inhibits viral transcription and replication.",
                                "Also provided is a method for controlling RNA virus replication comprising transducing or transfecting a host cell with the single-stranded RNA virus according to the invention comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease; maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor inhibits viral transcription and/or replication and the absence of said protease inhibitor allows viral transcription and replication.",
                                "Further provided is a method for controlling heterologous protein expression by a RNA virus comprising transducing or transfecting a host cell with the RNA virus according to the invention, wherein the protease is located within an intramolecular insertion site of the at least one heterologous protein; maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease, wherein the addition of said protease inhibitor allows heterologous protein expression and the absence of said protease inhibitor inhibits heterologous protein expression.",
                                "Preferably the methods according to the invention are in vitro methods. Thus the steps of transducing or transfecting and maintaining are performed in cell culture ex vivo.",
                                "The protease is preferably an autocatalytic protease, more preferably the HIV-1 protease, even more preferably a single chain dimer of the HIV-1 protease. This protease is particularly advantageous as a number of protease inhibitors are available. Suitable protease inhibitors are, e.g., indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir or darunavir.",
                                "In view of the above, it will be appreciated that the invention also encompasses the following items:\n\n\n- 1. A single-stranded RNA virus comprising a modified genome of the\n  virus comprising a polynucleotide sequence encoding at least one\n  protein essential for viral transcription and/or replication, a\n  protease and a cleavage site for said protease, wherein\n  - (a) the at least one protein essential for viral transcription\n    and/or replication comprises an insert at an intramolecular\n    insertion site comprising at least the cleavage site for said\n    protease and optionally further the protease; or\n  - (b) the at least one protein essential for viral transcription\n    and/or replication is encoded as a fusion protein comprising the\n    protease fused to the N-terminal or C-terminal end, separated by the\n    cleavage site for said protease.\n- 2. The single-stranded RNA virus of item 1, wherein\n  - (a) the protease cleaves the least one protein essential for viral\n    transcription and/or replication at the cleavage site for said\n    protease at the intramolecular insertion site, or\n  - (b) the protease cleaves at the cleavage site for said protease\n    located at the N-terminal or C-terminal end of the at least one\n    protein essential for viral transcription and/or replication encoded\n    as a fusion protein to release the at least one protein essential\n    for viral transcription and/or replication.\n- 3. The single-stranded RNA virus of item 1 or 2, wherein the protease\n  can be inhibited using a protease inhibitor.\n- 4. The single-stranded RNA virus of any one of the preceding items,\n  wherein the at least one protein essential for viral transcription\n  and/or replication is an RNA-dependent RNA polymerase or a protein of\n  the polymerase complex comprising the RNA-dependent RNA polymerase or\n  a nucleocapsid, preferably wherein the at least one protein essential\n  for viral transcription and/or replication is selected from the group\n  consisting of polymerase cofactor, polymerase and nucleocapsid.\n- 5. The single-stranded RNA virus of any one of the preceding items,\n  wherein the single-stranded RNA virus is a negative-sense\n  single-stranded RNA virus, preferably a negative-sense single-stranded\n  RNA virus of the order Mononegavirales.\n- 6. The single-stranded RNA virus of any one of the preceding items,\n  wherein the single-stranded RNA virus is\n  - (a) a virus of a family selected from the group consisting of\n    Rhabdoviridae, Paramyxoviridae, Filoviridae, Nyamiviridae,\n    Pneumoviridae and Bornaviridae; and/or\n  - (b) a virus of the family Paramyxoviridae, preferably a Measles\n    morbillivirus (MeV) or a virus of the family Rhabdoviridae,\n    preferably a Vesicular Stomatitis Virus (VSV).\n- 7. The single-stranded RNA virus of item 5 or 6, wherein the at least\n  one protein essential for viral transcription and/or replication is\n  selected from the group consisting of polymerase cofactor, polymerase\n  and nucleocapsid, preferably wherein the at least one protein\n  essential for viral transcription and/or replication is\n  - (a) a polymerase cofactor, preferably a P-protein or a functional\n    equivalent thereof;\n  - (b) a polymerase, preferably a L-protein; and/or\n  - (c) combinations thereof.\n- 8. The single-stranded RNA virus of any one of the preceding items,\n  wherein\n  - (a) the protease regulates the activity of the at least one protein\n    essential for viral transcription and/or replication;\n  - (b) the protease regulates viral transcription and/or replication;\n  - (c) the protease is an autocatalytic protease;\n  - (d) the protease is a viral protease; and/or\n  - (e) the protease is from HCV or HIV.\n- 9. The single-stranded RNA virus of any one of the preceding items,\n  wherein the protease is the HIV-1 protease, preferably a single chain\n  dimer of the HIV-1 protease, and the protease can be inhibited by a\n  protease inhibitor selected from the group consisting of indinavir,\n  saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir,\n  fosamprenevir, atazanavir, tipranavir and darunavir.\n- 10. The single-stranded RNA virus of any one of the preceding items,\n  wherein the insert at the intramolecular insertion site of the at\n  least one protein essential for viral transcription and/or replication\n  does not affect activity of the at least one protein essential for\n  viral transcription and/or replication.\n- 11. The single-stranded RNA virus of any one of the preceding items,\n  wherein at least the cleavage site for said protease and optionally\n  further the protease is located within the intramolecular insertion\n  site of the least one protein essential for viral transcription and/or\n  replication, and wherein\n  - (a) proteolytic cleavage of the protein cleaves the at least one\n    protein essential for viral transcription and/or replication at the\n    cleavage site for said protease within the intramolecular insertion\n    site;\n  - (b) cleavage within the intramolecular insertion site inactivates\n    the at least one protein essential for viral transcription and/or\n    replication;\n  - (c) cleavage within the intramolecular insertion site of the at\n    least one protein essential for viral transcription and/or\n    replication inhibits viral transcription and/or replication;\n  - (d) the virus is active in the presence of a specific inhibitor of\n    the protease and inactive in the absence of a specific inhibitor of\n    the protease; and/or\n  - (e) the virus further encodes at least one heterologous protein,\n    wherein the heterologous protein is expressed if the virus is active\n    in the presence of a specific inhibitor of the protease and is not\n    expressed if the virus is inactive in the absence of a specific\n    inhibitor of the protease.\n- 12. The single-stranded RNA virus of any one of the preceding items,\n  wherein the single-stranded RNA virus is Vesicular Stomatitis Virus\n  (VSV), the at least one protein essential for viral transcription\n  and/or replication is the P-protein and/or the L-protein and wherein\n  the intramolecular insertion site is\n  - (a) in the flexible hinge region of the VSV P-protein, preferably at\n    a position corresponding to amino acid position 193-199, more\n    preferably amino acid position 196 of VSVi P-protein (e.g., the\n    sequence of SEQ ID NO: 27);\n  - (b) in the loop of the methyltransferase domain of the L-protein\n    corresponding to amino acids 1614 to 1634, preferably to amino acids\n    1614 to 1629, more preferably to amino acids 1616 to 1625, and more\n    preferably to amino acid 1620 of VSVi L-protein having the sequence\n    of SEQ ID NO: 28; or\n  - (c) a combination of (a) and (b).\n- 13. The single-stranded RNA virus of any one of items 1 to 9, wherein\n  the at least one protein essential for viral transcription and/or\n  replication is encoded as a fusion protein comprising the protease\n  fused to the N-terminal or C-terminal end of the at least one protein\n  essential for viral transcription and/or replication separated by the\n  cleavage site for said protease and wherein\n  - (a) proteolytic cleavage of the fusion protein releases the at least\n    one protein essential for viral transcription and/or replication in\n    its active form;\n  - (b) the at least one protein essential for viral transcription\n    and/or replication in the fusion protein comprising the protease\n    fused to the N-terminal or C-terminal end of the at least one\n    protein essential for viral transcription and/or replication\n    separated by the cleavage site for said protease is inactive without\n    proteolytic cleavage;\n  - (c) the proteolytic cleavage of the fusion protein is inhibited\n    using a specific inhibitor of the protease;\n  - (d) the virus is inactive in the presence of a specific protease\n    inhibitor of the protease and active in the absence of a specific\n    inhibitor of the protease;\n  - (e) the virus further encodes at least one heterologous protein,\n    wherein the heterologous protein is not expressed if the virus is\n    inactive in the presence of a specific inhibitor of the protease and\n    is expressed if the virus is active in the absence of a specific\n    inhibitor of the protease;\n  - (d) the fusion protein further comprises a further viral protein or\n    a heterologous protein fused to the opposite end of the protease\n    fused to the N-terminal or C-terminal end of the at least one\n    protein essential for viral transcription and/or replication, and\n    wherein said further viral protein or heterologous protein and said\n    protease are also separated by the cleavage site for said protease;\n  - (e) the protease flanked by the cleavage site for said protease on\n    either side replaces an intergenic region that links the at least\n    one protein essential for viral transcription and/or replication\n    with a further viral protein or a heterologous protein; and/or\n  - (f) the protease flanked by the cleavage site for said protease on\n    either side replaces an intergenic region that links the at least\n    one protein essential for viral transcription and/or replication\n    with a further viral protein or a heterologous protein, wherein loss\n    of the protease leads to a further inactive fusion protein\n    comprising the protein essential for viral transcription and/or\n    replication and the further viral protein or heterologous protein.\n- 14. The single-stranded RNA virus of claim **1** or **13**, wherein\n  the single-stranded RNA virus is a negative-sense single-stranded RNA\n  virus of the order Mononegavirales and the at least one protein\n  essential for viral transcription and/or replication is encoded as a\n  fusion protein comprising the protease fused to the N-terminal end or\n  the C-terminal end of the at least one protein essential for viral\n  transcription and/or replication separated by the cleavage site for\n  said protease, wherein\n  - (a) the at least one protein essential for viral transcription\n    and/or replication is an L-protein; and/or\n  - (b) the fusion protein comprises the protease fused to the\n    N-terminal end of the at least one protein essential for viral\n    transcription and/or replication separated by the cleavage site for\n    said protease.\n- 15. The single-stranded RNA virus of claim **1** or **13**, wherein\n  the at least one protein essential for viral transcription and/or\n  replication is encoded as a fusion protein\n  - (a) consisting of the protease fused to the N-terminal or C-terminal\n    end of the protein essential for viral transcription and/or\n    replication, separated by the cleavage site for said protease,\n    wherein the fusion protein optionally further comprises a linker\n    between the protease and the protein essential for viral\n    transcription and/or replication;\n  - (b) comprising the protease fused to the N-terminal or C-terminal\n    end of the at least one protein essential for viral transcription\n    and/or replication, separated by the cleavage site for said protease\n    and a further viral protein or a heterologous protein fused to the\n    opposite end of the protease fused to the N-terminal or C-terminal\n    end of the at least one protein essential for viral transcription\n    and/or replication, and wherein said further viral protein or\n    heterologous protein and said protease are also separated by a\n    cleavage site for said protease, and wherein the fusion protein\n    optionally further comprises a linker between the protease and the\n    at least one protein essential for viral transcription and/or\n    replication, and/or a linker between the protease and the further\n    viral protein or heterologous protein; or\n  - (c) that does not comprise an amino acid sequence of SEQ ID NO: 30.\n- 16. An RNA virus comprising a modified genome of the virus comprising\n  a polynucleotide sequence encoding at least one heterologous protein,\n  a protease and a cleavage site for said protease, wherein the at least\n  one heterologous protein comprises an insert at an intramolecular\n  insertion site comprising at least the cleavage site for said protease\n  and optionally further the protease.\n- 17. The RNA virus of item 16, wherein the heterologous protein is a\n  therapeutic protein, a reporter or a tumor antigen.\n- 18. The single-stranded RNA virus of any one of items 1 to 15 or the\n  RNA virus of item 16 or 17 for use in therapy.\n- 19. The single-stranded RNA virus of any one of items 1 to 15 or the\n  RNA virus of item 16 or 17 for use in treating cancer.\n- 20. The single-stranded RNA virus or the RNA virus for use of item 19,\n  wherein the cancer is a solid tumor, preferably selected from the\n  group consisting of colon carcinoma, prostate cancer, breast cancer,\n  lung cancer, skin cancer, liver cancer, bone cancer, ovary cancer,\n  pancreas cancer, brain cancer, head and neck cancer, lymphoma\n  (Hodgkin's and non-Hodgkin's lymphoma), brain cancer, neuroblastoma,\n  mesothelioma, Wilm's tumor, retinoblastoma and sarcoma.\n- 21. A recombinant VSV L-protein comprising an insert in the loop of\n  the methyltransferase domain of the L-protein corresponding to amino\n  acids 1614 to 1634, preferably to amino acids 1614 to 1629, more\n  preferably to amino acids 1616 to 1625 and more preferably to amino\n  acid 1620 of VSVi L-protein having the sequence of SEQ ID NO: 28.\n- 22. The recombinant VSV L-protein of item 21, wherein the L-protein\n  further comprises a secondary mutation.\n- 23. A Vesicular Stomatitis Virus (VSV) comprising the recombinant VSV\n  L-protein according to item 21 or 22.\n- 24. A method for controlling RNA virus replication comprising\n  - (a) transducing or transfecting a host cell with the RNA virus\n    according to any one of items 10 to 12, and\n  - (b) maintaining the host cell in the presence or absence of a\n    protease inhibitor specific for said protease,\n  - wherein the addition of said protease inhibitor allows viral\n    transcription and/or replication and the absence of said protease\n    inhibitor inhibits viral transcription and replication.\n- 25. A method for controlling RNA virus replication comprising\n  - (a) transducing or transfecting a host cell with the RNA virus\n    according to any one of items 13 to 15, and\n  - (b) maintaining the host cell in the presence or absence of a\n    protease inhibitor specific for said protease,\n  - wherein the addition of said protease inhibitor inhibits viral\n    transcription and/or replication and the absence of said protease\n    inhibitor allows viral transcription and replication.\n- 26. A method for controlling heterologous protein expression by a RNA\n  virus comprising\n  - (a) transducing or transfecting a host cell with the RNA virus\n    according to item 16 or 17, wherein the protease is located within\n    an intramolecular insertion site of the at least one heterologous\n    protein; and\n  - (b) maintaining the host cell in the presence or absence of a\n    protease inhibitor specific for said protease,\n  - wherein the addition of said protease inhibitor allows heterologous\n    protein expression and the absence of said protease inhibitor\n    inhibits heterologous protein expression."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide in vitro method for controlling RNA virus replication",
                                "describe modified genome of RNA virus",
                                "introduce protease and cleavage site",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe alternative embodiment of modified genome",
                                "introduce fusion protein",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe application of method for controlling heterologous protein expression",
                                "introduce single-stranded RNA virus",
                                "describe modified genome of single-stranded RNA virus",
                                "specify protease and cleavage site",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe alternative embodiment of modified genome",
                                "introduce fusion protein",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe application of method for controlling heterologous protein expression",
                                "introduce items 1-12",
                                "describe single-stranded RNA virus",
                                "specify protease and cleavage site",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe alternative embodiment of modified genome",
                                "introduce fusion protein",
                                "explain regulation of viral transcription and/or replication",
                                "specify host cell maintenance conditions",
                                "mention protease inhibitor specific for said protease",
                                "describe application of method for controlling heterologous protein expression"
                            ],
                            "num_characters": 18162,
                            "outline_medium": [
                                "describe in vitro method for controlling RNA virus replication",
                                "introduce modified genome of RNA virus",
                                "describe protease and cleavage site",
                                "outline method for controlling viral transcription and/or replication",
                                "specify in vitro method",
                                "list preferred proteases",
                                "list protease inhibitors",
                                "introduce single-stranded RNA virus",
                                "describe modified genome of single-stranded RNA virus",
                                "outline items 1-9",
                                "describe single-stranded RNA virus with modified genome",
                                "outline items 1-11",
                                "describe single-stranded RNA virus with fusion protein",
                                "outline items 1-13",
                                "describe single-stranded RNA virus with fusion protein and linker",
                                "introduce RNA virus with modified genome for heterologous protein expression",
                                "describe RNA virus with modified genome for therapeutic protein expression",
                                "outline uses of single-stranded RNA virus and RNA virus"
                            ],
                            "outline_short": [
                                "describe in vitro method for controlling RNA virus replication",
                                "provide alternative method for controlling RNA virus replication",
                                "describe method for controlling heterologous protein expression",
                                "specify preferred protease and protease inhibitors",
                                "outline items encompassed by the invention",
                                "describe single-stranded RNA virus with modified genome",
                                "specify characteristics of single-stranded RNA virus",
                                "describe regulation of viral transcription and replication",
                                "outline additional embodiments of single-stranded RNA virus"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define general embodiments",
                        "clarify singular and plural forms",
                        "define homologue",
                        "specify sequence identity",
                        "define corresponding to amino acid position",
                        "explain genomic RNA",
                        "define gene",
                        "describe nucleic acid",
                        "define ribonucleic acid",
                        "explain upstream and downstream",
                        "define coding strand",
                        "define non-coding strand",
                        "describe vector",
                        "define encode",
                        "explain process of translation",
                        "define heterologous polypeptide",
                        "describe therapeutic protein",
                        "define cytokine",
                        "explain growth factor",
                        "define expression",
                        "describe gene product",
                        "define reporter gene",
                        "explain protease",
                        "classify proteases",
                        "describe viral proteases",
                        "explain HIV protease inhibitors",
                        "define L-Prot and P-Prot",
                        "describe single-chain dimer",
                        "explain codon optimization",
                        "describe autocatalytically active protease",
                        "explain cis-cleavage",
                        "describe regulatory element",
                        "define RNA virus",
                        "classify RNA viruses",
                        "describe negative-sense ssRNA virus",
                        "explain positive-sense ssRNA virus",
                        "describe Rhabdoviridae and Paramyxoviridae",
                        "explain purified RNA of a negative-sense RNA",
                        "define linker",
                        "describe flexible linker"
                    ],
                    "num_characters": 20434,
                    "outline_medium": [
                        "define general embodiments",
                        "clarify singular and plural forms",
                        "define homologue",
                        "define corresponding to amino acid position",
                        "define fusion protein",
                        "define polyprotein",
                        "define genomic RNA",
                        "define gene",
                        "define nucleic acid",
                        "define ribonucleic acid",
                        "define upstream and downstream",
                        "define coding strand",
                        "define non-coding strand",
                        "define vector",
                        "define encode",
                        "define heterologous polypeptide",
                        "define therapeutic protein",
                        "define cytokine",
                        "define expression",
                        "define reporter gene"
                    ],
                    "outline_short": [
                        "define general embodiments",
                        "define homologue and homologous",
                        "define corresponding to amino acid position",
                        "define genomic RNA and genome",
                        "define gene and polynucleotides",
                        "define nucleic acid, nucleotide, and polynucleotide",
                        "define ribonucleic acid and RNA oligonucleotide",
                        "define upstream and downstream",
                        "define vector and plasmid",
                        "define encode, codes for, and expression"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "P-Protein",
                            "paragraphs": [
                                "The DNA sequence for the Phosphoprotein (P-protein having the cDNA sequence of SEQ ID NO: 1; corresponding to amino acid sequence of SEQ ID NO: 27) with a linked-dimer protease in position aa196 (P196PR2, DNA sequence of SEQ ID NO: 3) and the flanking sequences of the VSV Nucleoprotein and Matrix protein were synthetized by GeneArt. The P-protein gene in VSV Indiana was replaced by P196PR2. GFP at position 5 was used as marker gene. P196PR2 with flanking VSV-N and VSV-M sequences was amplified by PCR with sequences lapping over 2 restriction enzyme sites (XbaI and Bst11071) by 30 bp to the full length VSV vector, which was cut with said enzymes. The construct was then generated by Gibson assembly cloning (FIG. 4).",
                                "The protease linked-dimer construct (DNA sequence of SEQ ID NO: 5) was flanked by (GGSG)3 linker sequences (DNA sequence of SEQ ID NO: 4; amino acid sequence of SEQ ID NO: 29) to allow spatial separation between the P-protein and the protease dimer. The 5′ GGSG linker has the DNA sequence of SEQ ID NO: 8 and the 3′ GGSG linker has the DNA sequence of SEQ ID NO: 9. The linker codons were designed manually to avoid homologies of the upstream with the downstream linker. The cleavage sites are located between each protease domain and the linker and have the DNA sequences of SEQ ID NO: 6 and SEQ ID NO: 7). The protease dimer codons were chosen by the interplay of an optimization algorithm and manual adjustments. The optimization process was a compromise between human codon usage and avoidance of homologies between the first and second protease. Overhangs were introduced by Gibson assembly cloning.",
                                "The functionality of the Phosphoprotein-protease construct was first tested with a P expression plasmid (FIG. 2) in which the DNA of P196PR2 as generated by GeneArt was cloned by digestion of vector and insert with XbaI and Bst11071 and then ligated with a T4 ligase. BHK cells were transfected with this P-Prot (P-Protein and protease) construct and infected with a VSV-AP variant. The VSV-AP was equipped with a red fluorescent protein (RFP) as reporter gene. For the function of VSV-AP a working P-protein is necessary, which was provided in trans by the cell expressing P-Prot. In this set-up we could show that the activity of VSV-AP-RFP was directly linked to the presence of protease inhibitor (amprenavir, concentrations 0.1, 1 and 10 μM). Without protease inhibitor the P-protein was cleaved and no RFP signal detectable."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "design P-protein construct",
                                "generate P-protein gene",
                                "assemble P-protein construct",
                                "test P-protein functionality"
                            ],
                            "num_characters": 2462,
                            "outline_medium": [
                                "construct P-protein with linked-dimer protease",
                                "test functionality of P-protein-protease construct"
                            ],
                            "outline_short": [
                                "construct P-protein with linked-dimer protease"
                            ]
                        },
                        {
                            "title": "L-Protein",
                            "paragraphs": [
                                "VSV L virus insertions were introduced into the whole VSV genome by four-fragment Gibson assembly. The larger part of the vector (fragment 4) was provided by restriction enzyme digestion with enzymes SfoI and FseI of pVSV-GFP. The HIV protease dimer insert (fragment 1) was amplified with primer sequences specific for the flexible (GGSG)3-linkers, which are at both ends of the construct (DNA sequence of SEQ ID NO: 4; amino acid sequence of SEQ ID NO: 29). L-protein sequences surrounding fragment 1 (fragment 2 and 3), were amplified from pVSV introducing overhangs to the (GGSG)3 linker at the 5′ end of fragment 3 with the primer MT1620-insertGGSG for (SEQ ID NO: 25) and at the 3′ end of fragment 2 with primer MT1620-insertGGSG rev (SEQ ID NO: 26). The L-protein has the cDNA sequence of SEQ ID NO: 2 and the amino acid sequence of SEQ ID NO: 28, and the insert was introduced at amino acid position 1620 of SEQ ID NO: 28. The resulting L-protein with protease insert has the DNA sequence of SEQ ID NO: 10 as confirmed by sequencing. Additionally, overhangs to fragment 4 were introduced at the 5′ end of fragment 2 using the forward primer 49 bp-before-FseI [5′-GCT GCC AAG TAA TAC ACC GG-3′] (SEQ ID NO: 23 binding 49 nucleotides upstream of the nearest restriction enzyme cutting site FseI and at the 3′ end of Fragment 3 using the reverse primer 50 bp-after-SfoI [5′-TTT ATC TCC TCC TAA AGT TTC-3′](SEQ ID NO: 24) binding 50 nucleotides downstream of the nearest restriction enzyme cutting site SfoI."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "design L-protein construct",
                                "generate L-protein gene",
                                "assemble L-protein construct"
                            ],
                            "num_characters": 1511,
                            "outline_medium": [
                                "introduce HIV protease dimer into VSV L protein"
                            ],
                            "outline_short": [
                                "introduce HIV protease dimer into VSV L-protein"
                            ]
                        },
                        {
                            "title": "VSV Vectors",
                            "paragraphs": [
                                "WT VSV vector (Indiana) and VSV-GFP vector (Indiana) have the DNA sequences of SEQ ID NO: 20 and SEQ ID NO: 21, respectively (for more details see Schnell et al., J Virol. 1996, 70(4): 2318-2323, Boritz et al., J Virol, 1999. 73(8): 6937-6945, and Muik et al., Cancer Res. 2014, 74(13): 3567-3578). VSV-GFP-ΔP (recombinant VSV Indiana strain lacking the viral envelope protein P) was generated analogous as described elsewhere (Muik et al., J Mol Med (Berl), 2012, 90(8):959-970). Infectious viruses were retrieved in the presence of 10 μM amprenavir for Prot-On viruses and without amprenavir for non-protease containing and Prot-Off viruses with a standard helper virus-free calciumphosphat rescue technique in 293T cells (Witko et al., J Virol, 2006, 135(1):91-101). BHK21 cells were used for amplification of replication competent VSV variants."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe VSV vector generation"
                            ],
                            "num_characters": 848,
                            "outline_medium": [
                                "generate VSV vectors with protease insert"
                            ],
                            "outline_short": [
                                "generate VSV vectors with protease insert"
                            ]
                        },
                        {
                            "title": "Cell Lines",
                            "paragraphs": [
                                "BHK-21 cells (American Type Culture Collection, Manassas, Va.) were cultured in Glasgow minimum essential medium (GMEM) supplemented with 10% fetal calf serum, 5% tryptose phosphate broth, 100 units/ml penicillin, and 0.1 mg/ml streptomycin.",
                                "293T cells (293tsA1609neo) and 293-VSV (293 cells expressing N, P-GFP and L of VSV (Panda et al., J Virol, 2010, 84(9): 4826-4831) were cultured in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% FCS, 1% P/S, 2% glutamine, 1× sodium pyruvate and 1× non-essential amino acids."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe cell line culture conditions"
                            ],
                            "num_characters": 532,
                            "outline_medium": [
                                "describe cell lines used in experiments"
                            ],
                            "outline_short": [
                                "describe cell lines used for experiments"
                            ]
                        },
                        {
                            "title": "In Silico Experiments",
                            "paragraphs": [
                                "Structure visualization and molecular modeling: All structures were analyzed using Coot 0.8.7.1 (Emsley et al., Acta Crystallogr D Biol Crystallogr, 2010, 66(Pt4):486-501) and UCSF Chimera 1.12 (Pettersen et al., J Comp Chem, 2004, 25(13): 1605-1612). Images of molecular structures were generated with UCSF Chimera 1.12. A VSV-L-MT1620-mCherry model was generated as follows: VSV L-protein having the amino acid sequence of SEQ ID NO: 28 (Protein Data Bank (PDB) accession code 5a22) and mCherry (PDB accession code 2h5q) having the DNA sequence of SEQ ID NO: 11 (with linker) were docked with ZDock server (Pierce et al., Bioinformatics, 2014, 30(12):1771-1773). VSV L-protein was defined as the reference structure to which unrestrained mCherry was docked in rigid body mode. One of the top hits was chosen because N- and C-termini of mCherry were located nearby the MT1620 (amino acid 1620 of SEQ ID NO: 28 in the methyltransferase domain (MT) insertion site). Subsequently, FiberDock (Mashiach et al., Poteins, 2010, 78(6):1503-1519) was used for flexible refinement of the rigid-body protein docking solution. The (GGSG)3-Linkers were manually introduced in Coot 0.8.7.1 and modelled using ModLoop (Pieper et al., Nucleic Acids Res, 2014, 42(Database issue): D336-346).",
                                "RNA Extraction, cDNA Synthesis and PCR",
                                "First, viral RNA was purified by Viral DNA/RNA Kit, peqGOLD (Peqlab) according to manufacturer's instructions. Subsequently, cDNA synthesis was performed with RevertAid First Strand cDNA Synthesis Kit (Thermo Fisher Scientific) according to manufacturer's instructions. PCR was then performed with Q5® Hot Start High-Fidelity DNA Polymerase (NEB). Annealing temperature was chosen according to recommendations of NEB Annealing Temperature Calculator. Elongation time was 1 minute/1000 nucleotides."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "visualize protein structures",
                                "perform molecular modeling",
                                "generate protein model"
                            ],
                            "num_characters": 1814,
                            "outline_medium": [
                                "perform structure visualization and molecular modeling"
                            ],
                            "outline_short": [
                                "perform structure visualization and molecular modeling"
                            ]
                        },
                        {
                            "title": "Replication Kinetic",
                            "paragraphs": [
                                "BHK-21 cells were seeded in 24-well plates with 1×105 cells/well and incubated overnight at 37° C. The next day, medium was removed and cells were infected with a multiplicity of infection (MOI) of 0.1 of according VSV variant. Cells were incubated for 1 h with the inoculum and subsequently washed twice with PBS. One ml of fresh medium was added to the cells and cells were incubated at 37° C. 0 h values were collected directly after washing. Further supernatants were collected after 4 h, 8 h, 12 h, 16 h, 24 h and 36 h. Samples were stored at −80° C. until viral titers were determined via TCID50 assay on BHK21 cells."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe replication kinetic experiment"
                            ],
                            "num_characters": 623,
                            "outline_medium": [
                                "measure replication kinetics of VSV variants"
                            ],
                            "outline_short": [
                                "measure replication kinetics of VSV variants"
                            ]
                        },
                        {
                            "title": "Dose Response",
                            "paragraphs": [
                                "BHK-21 cells were seeded in 24-well plates with 1×105 cells/well and incubated overnight at 37° C. The next day, medium was removed and cells were infected with a multiplicity of infection (MOI) of 1 of according VSV variant. Amprenavir concentrations of 0, 30 nM, 100 nM, 300 nM, 1 μM, 3 μM, 10 μM, 30 μM and 100 μM were applied. Viral progeny were collected 24 hpi."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe dose response experiment"
                            ],
                            "num_characters": 367,
                            "outline_medium": [
                                "determine dose response of VSV variants to amprenavir"
                            ],
                            "outline_short": [
                                "determine dose response of VSV variants to amprenavir"
                            ]
                        },
                        {
                            "title": "TCID50 Assay",
                            "paragraphs": [
                                "Virus titers were determined using a 50% tissue culture infective dose (TCID50) assay using the method of Spearman-Ksrber as described previously (Kaerber, Archiv for Experimentalle Pathologie und Pharmakologie, 1931, 162:480-483). Briefly, 10-fold serial dilutions of virus were prepared. 100 μl of each dilution was added in quadruplicates to confluent BHK-21 cells in 96-well plates and incubated for 24-48 hours at 37° C. until a cytopathic effect was visible. Numbers of infected wells were counted and TCID50-values were calculated.",
                                "**In Vitro Cytotoxicity Assay**",
                                "Plaques were obtained by crystal violet staining and fixation of BHK-21 cells infected at a 60% confluency (15 g crystal violet from Fluka, 85 ml EtOH, 250 ml formaldehyde 37% ad 1000 ml H2O). The final confluency before fixation was approx. 80%. 5-fold serial dilutions of virus stocks were prepared: 1:106.5, 1:107, 1:107.5, 1:108, 1:108.5 and 1:109 were used to infect cells in 6-Well plates. One hour after infection, cells were washed with PBS and covered with a 2.5% plaque agarose/GMEM mixture. The agarose/medium mixture was carefully removed from the Wells prior to fixation, which was performed with crystal violet 24 h after infection.",
                                "**IFN Killing Assay**",
                                "Virus cell killing was assessed in an Interferon-response assay, in which IFN-competent BHK-21 cells were treated with increasing amounts (10, 100, 500 and 1000 U/ml) of recombinant universal type I IFN (PBL assay science, Piscataway Township, NJ) and infected with MOIs 0.1, 1 and 10. Cells were seeded at 104 one day before INF treatment. INF treatment was performed 16 h before infection. Infection proceeded for 72 h. After this period, Thiazolyl Blue was added for 4 h. Cells were then dissolved in 0.1 M NaCl with ×g SDS for another 4 h. MTT-Formazan was measured at 540 nm.",
                                "**Plaque Assay**",
                                "Monolayers of BHK-21 cells were infected with serial dilutions of virus stock. One hour after infection, cells were washed twice with PBS and overlayed with a 1:1 dilution of 2.5% plaque agarose and complete GMEM medium. The following day the plaque agarose was removed and cells were stained using crystal violet.",
                                "**Immunoblotting**",
                                "BHK-21 cells were infected with VSV, VSV-GFP, VSV-L-mCherry or VSV-GPF-L-mCherry at a MOI of 5, and cell lysates were prepared 4, 8, 12 and 24 h later. Uninfected BHK-21 cells were used as a control. Cells were lysed in ice-cold cell lysis buffer (50 mmol/liter HEPES, pH 7.5; 150 mmol/liter NaCl; 1% Triton X-100; 2% aprotinin; 2 mmol/liter EDTA, pH 8.0; 50 mmol/liter sodium fluoride; 10 mmol/liter sodium pyrophosphate; 10% glycerol; 1 mmol/liter sodium vanadate; and 2 mmol/liter Pefabloc SC) for 30 min. To dispose of cellular debris, cell lysates were centrifuged at 13.000 rpm for 10 minutes. Supernatants containing proteins were stored at −80° C.",
                                "SDS-PAGE of protein lysates was performed under reducing conditions on a 12% polyacrylamide gel. For comparison of VSV, VSV-GFP, VSV-L-mCherry and VSV-GFP-L-mCherry the 8 h time point lysates were used. Proteins were transferred to 0.45-μm nitrocellulose membranes (Whatman, Dassel, Germany) by using a tank blotting system. The blotting time was 90 minutes. The membrane was blocked over night with 1×PBS containing 5% skim milk and 0.1% Tween 20 (PBSTM) and incubated for 3 h at room temperature with a mCherry-specific rabbit monoclonal antibody diluted 1:1,000 in PBSTM. The antibody was raised against recombinant mCherry and purified in house (to be published later). After washing a peroxidase-conjugated rabbit IgG-specific antibody from goat (Invitrogen, Carlsbad, Calif.), diluted 1:5,000 in PBSTM was added and the blot was incubated for another hour. After extensive washing blots were developed with enhanced chemiluminescence (ECL). After the first detection the same blot was extensively washed and re-used to stain for loading control. Actin was stained with a β-actin specific monoclonal antibody from mouse (A2228; Sigma, Munich, Germany) diluted 1:5,000 in PBSTM and a secondary horseradish peroxidase-conjugated mouse IgG-specific antibody from goat was used. Washing, incubation times and Blot development were carried out as described above for the first detection.",
                                "**Transfections**",
                                "Transfection of L-mCherry expression plasmids was performed with a TransIT®-LT1 transfection kit from Mirus in 293T cells. Plasmid DNA and transfection reagent amounts were chosen according to manufactures' recommendations for 24-well plates, in which 2.7*105 293T cells per well were seeded one day before transfection. P-expression plasmids were co-transfected with L-mCherry expression plasmids. 24 h after transfection, 293T cells were infected with VSV-GFP-ΔL at an MOI of 10. Images were acquired 48 h after infection.",
                                "**Animal Experiments**",
                                "Animal experiments adhered to the national animal experimentation law. Animal trial permission was granted by national authorities.",
                                "Stereotaxis: Stereotactic mouse brain injections of virus were performed with a mouse stereotactic frame (Harvard Apparatus, Hollistion-MA). Anesthesia was induced by 100 mg/kg Ketamine and 10 mg/kg Xylazine mix. Analgesic therapy was performed with 5 mg/kg Ketoprofen, antibiotic therapy with 5 mg/kg Enrofloxacin after surgery. Analgesic therapy was sustained with oral Ibuprofen solution (0.1 mg/ml) in drinking water. During stereotactic surgery, mice were fixated in the stereotactic frame. Mouse heads were shaved, cleaned with 2× Betadine and 2× EtOH. Scalps were opened with a scalpel. The site for the injection hole was located by orienting towards the Bregma. The injection hole with a diameter of 1 mm was drilled with an electric drill (FST, Foster city CA). Virus injection volume was 10 μl applied at an injection rate of 1 μl/min. Mice were placed on a heating pad during surgery and their eyes protected with Vaseline.",
                                "Image analysis: A fluorescence microscope (Nikon, Japan) was used to analyze virus infected cells in culture and histological sections of mouse brain and tumor.",
                                "Statistical analysis: Statistical significance was determined by Student's t test and analysis of variance (ANOVA). P values of <0.05 were considered statistically significant. GraphPad prism software (GraphPad Software, Inc., La Jolla, Calif.) was used for statistical analysis and data presentation. Adobe Photoshop software was used for composition of multicolor photo panels and overlays.",
                                "**Example 1: Generating a Protease-Regulated ON-Switch, VSV-P-Prot**",
                                "To generate a regulatable switch to control activity of RNA viruses, we developed a system that incorporates an autocatalytically active protease sequence into genes essential for VSV gene expression and replication (FIG. 1a). In our first ON-switch construct we introduced an HIV protease dimer into the cofactor of the polymerase of VSV, the P-protein (SEQ ID NO: 1), generating VSV-P-prot. The intramolecular insertion site was previously shown to not affect P-protein function (Das et al., J Virol., 2006, 80(13):6368-6377). The HIV protease function requires dimerization. To facilitate instant post-translational proteolytic activity, the gene insertion construct was designed to harbor two copies of the HIV protease (PR) joined by a flexible linker (FIG. 1b, 2) (Krausslich, PNAS, 1991, 88(8): 3213-3217). Flexible linkers (SEQ ID Nos: 8 and 9) were also applied up- and downstream of the protease construct (SEQ ID NO: 5) resulting in a protease dimer with cleavage sites and likers having the coding sequence of SEQ ID NO: 4 to ensure independent function of the proteases from the rest of the fusion protein (Chen et al., Adv Drug Deliv Rev, 2013, 65(10:1357-1369). The codon usage of both protease sequences was a compromise to take into consideration human codon usage and the coordination between the two sequences to avoid sequence homologies to minimize risk for copy-choice events during replication (Simon-Loriere and Holmes, Nat Rev Microbiol, 2011, 9(8):617-626). The resulting amino acid sequence (SEQ ID NO: 29) is shown in FIG. 5. The single chain linked dimer (PR2) was further flanked by corresponding cleavage sites (SEQ ID Nos: 6 and 7) (de Oliveira et al., J Virol, 2003, 77(17):9422-9430) as shown in FIGS. 4 and 5 and cloned into the flexible hinge region of the VSV P-protein at position aa196 (P196), which was previously described as a region tolerating functional intramolecular insertion (Das et al. 2006).",
                                "To confirm intact VSV phospho-protein function with integrated autoproteolytic ON-switch we transfected BHK cells with a plasmid encoding the isolated P196PR2 construct followed by infection with a VSV lacking its P-protein and expressing an red fluorescent protein (RFP) reporter gene in its place (VSV-ΔP-RFP) (Muik et al., J Mol Med (Berl), 2012, 90(8):959-970). RFP signal in VSV-ΔP-RFP infected cells was only detectable in the presence of P196PR2 and a specific HIV protease inhibitor (here: amprenavir) (FIG. 3, photographs B1-B3). Absence of protease inhibitor resulted in lack of viral gene expression and virus replication (FIG. 3, photographs A1-A3) indicating P196PR2 maintains essential viral P-protein function and can be controlled via inhibition of the proteolytic on-switch.",
                                "We next generated a recombinant VSV expressing P196PR2 in place of its native P-protein (VSV-P-prot), which also contained an eGFP reporter gene in 5th gene position (FIG. 4). Rescue and propagation of VSV-P-prot was done in medium condition containing 10 μM amprenavir. PCR amplification and sequencing confirmed the correct integration of the P196PR2 construct into the VSV genome (FIG. 6A). Infection of BHK cells with VSV-P-prot resulted in strong GFP signal within 24 hours in the presence but not in the absence of amprenavir (10 μM) indicating the supplied protease inhibition controlled gene expression of VSV-P-prot (FIG. 6B). Conversely, viral replication observed by virus plaque formation of VSV-P-prot was also found to be protease inhibitor-dependent (FIG. 6C). Viral RNA was reverse transcribed and subject to sequence confirmation. Sequence of the insert from viral genomic sequence fully aligned with the virus construction plasmid.",
                                "**Example 2: VSV-P-Prot can be Regulated in a Dose-Dependent Fashion and by Various HIV Protease Inhibitors**",
                                "To test whether the amprenavir-dependent activity of VSV-P-prot would generalize to other members of the HIV protease inhibitor class, BHK cells were incubated with second generation compounds saquinavir (10 μM) and indinavir (10 μM) followed by infection with VSV-P-prot at an MOI of 0.01. In line with the amprenavir effect, both inhibitors facilitated viral gene expression (GFP signal) and viral replication (plaque formation) (FIG. 7) confirming the universal targetability of the HIV protease-based VSV on-switch system. Also lopinavir (10 μM) and other HIV protease inhibitors were shown to regulate VSV-P-prot (data not shown).",
                                "The amprenavir dose used for virus production and initial studies was chosen according to previously described APV plasma concentrations in patients treated orally with APV (Sadler et al., Antimicrob Agents Chemother, 1999, 43(7):1686-1692). Additionally, a dose response study was performed to address whether the amprenavir-controlled activity of VSV-P-prot is dose dependent. As discussed before, the effect of amprenavir on both viral gene expression (GFP) and viral replication (TCID50 replication assay) was assessed. BHK cells were infected with an MOI of 1 and viral infection assessed after 24 hours (FIG. 8A). A single step growth curved revealed that VSV-Pprot activity started at amprenavir doses of 100 nM, reached a plateau of maximum activity at a dose range between 3 and 100 μM and deteriorated at higher doses (FIG. 8B). Viral replication of standard recombinant VSV without P-prot control mechanism resulted in 1.5 log higher titers and was not affected by amprenavir doses up to 30 μM, indicating that amprenavir does not control VSV replication in the absence of the P-prot switch. The replication curve revealed a slight attenuation of VSV-P-prot over VSV.",
                                "**Example 3: Lack of Neurotoxicity and Intracranial Spread of VSV-Pprot**",
                                "VSV is known for pronounced neurotoxicity in laboratory animals once entered into the CNS space. The VSV glycoprotein shows a strong affinity to neurons and both anterograde and retrograde axonal spread have been described. To address to what extend neurotoxicity of VSV-P-prot is abrogated compared to normal VSV, we employed direct stereotactic injection into the mouse striatum. Intracranial instillation of wildtype-based VSV-dsRed (2×105 TCID50 in 2 μl) led to profound signs of neurotoxicity (FIG. 9A) expressed as hind-limb paralysis, lack of coordination, hunched position, and severe weight drop (FIG. 9C) starting within 2 days post injection. All mice had to be euthanized within 4 days for humane reason (FIG. 9B). In stark contrast, injection of the brain with VSV-P-prot at the same dose resulted in no signs of neurotoxicity. Mice also showed no brain-related adverse signs after intracranial VSV-P-prot injection when treated simultaneously with amprenavir and ritonavir (100 μM amprenavir, 25 μM ritonavir (inhibits degradation of APV) in 100 μl PBS i.p., administered two times a day for 10 days) (FIG. 9A-C). To study potential intracranial spread after stereotactic injection, brains were harvested at day of toxicity-related euthanasia (VSV-dsRed) or at day 10 past VSV-P-prot inoculation. Histological fluorescence analysis of coronal brain sections revealed extended spread of VSV-dsRed expressing red fluorescence. Virus infection was found throughout the striatum, subcortical areas and hypothalamus (bilateral). In contrast, GFP expression from VSV-P-prot was highly restricted to the immediate lining of the injection needle track without any signs of intracranial spread of VSV-P-prot regardless of whether amprenavir was systemically applied or not (FIG. 9D). These data confirm that VSV-P-prot is not associated with the neurotoxicity and intracranial spread typical for VSV.",
                                "Thus, the ligand-dependent virus activity was also confirmed in vivo by complete abrogation of neurotoxicity and intracranial spread associated with the parental VSV. As amprenavir does not cross the blood brain barrier, systemic application of the compound did not confer virus activity and neurotoxicity was absent despite a systemically present ON system.",
                                "**Example 4: Genetic Stability of Protease Inhibitor Dependency of VSV-P Prot**",
                                "RNA viruses are prone to frequent mutations, in the case of VSV at a mutation rate of about 1 in 10,000 (Steinhauer and Holland 1986, Steinhauer, de la Torre et al. 1989). To test whether the regulatable viral control ON switch of VSV-P-prot remains functionally stable throughout a number of viral replication rounds, we employed in-vitro serial virus passage in optimal (10 μM) and suboptimal (1 μM) amprenavir conditions. After each passage protease inhibitor dependency was assessed by GFP expression after transferring a sample of the supernatant onto parallel dishes incubated without amprenavir. After 20 passages (P20), no amprenavir escape virus variants could be observed (FIG. 10A). To confirm the genomic integrity of VSV-P-prot, viral genomic RNA collected from passage P20 from the suboptimal amprenavir-treated virus propagation was purified, reverse transcribed and a PCR performed on the insert P-196PR2. A VSV variant without protease insertion was used as negative control. We found the P-196PR2 and the protease negative P-protein PCR fragments to be at their expected sizes (FIG. 10B). Subsequent sequencing of the P-prot site and alignment comparison with the respective sequence in the parental plasmid construct (SEQ ID NO: 4) revealed one mutation (protease 2: nucleotide G23A; amino acid R8K) in the construct, which did not render the construct non-functional. It remains to be seen if this mutation is functionally fully silent, reflects an adaptation to low APV concentration or an exchange of a rare codon (R: 7%) to a frequent codon (K: 74%).",
                                "**Example 5: Identifying a Protease Insertion Site in VSV L-Protein**",
                                "In order to test whether the virus-controlling autocatalytically active protease approach could also function when inserted in an alternative essential VSV protein, we sought to generate a VSV-L-prot. As stable and unattenuated intramolecular insertions have not been successfully reported to date (Ruedas and Perrault, J Virol, 2009, 83(23):12241-12252; Ruedas and Perrault, J Virol, 2014, 88(24): 14458-14466), we first set out to study the ability of VSV L-protein to tolerate an insertion of a reporter gene (mCherry) or not. We used a structure-guided approach to identify five different L-protein insertion sites (amino acid position CD1506, CD1537, MT1603, MT1620 and MT1889 of the L-protein having the amino acid sequence of SEQ ID NO: 28) for mCherry, which we deemed plausible because they were located at the surface and in flexible loops, which should minimize the possibility of steric clashes (FIG. 11A, C). We also avoided insertion sites within alpha-helices and beta-sheets to conserve structural integrity of the L-protein. FIG. 11D depicts a model of the insertion at MT1620, which resulted in a replication competent virus as explained below. To screen the proposed in silico designed structure predictions for candidate insertion sites, VSV L-protein expression vectors with insertions at CD1506, CD1537, MT1603, MT1620 and MT1889 were generated. After transfection of these five constructs in HEK cells, infection with a propagation-incompetent VSV-GFP-ΔL virus, coding for eGFP as reporter, was performed. In this screening all sites showed mCherry signal, but only two sites (CD1506, MT1620) showed eGFP signal, indicating transcriptional activity of L-mCherry fusion protein (FIG. 12A). Thus, every insertion site allows correct mCherry folding, although with varying efficiency, but only two insertions retain polymerase activity. To test the eGFP positive clones for viral replication competency, we chose to clone these sites (CD1506, MT1620) in a full VSV genome. Each site was cloned into two VSV backbones, one with eGFP as reporter at fifth position in the genome, the other without eGFP. Neither of the VSV variants with the CD1506 construct could be rescued, even after multiple attempts. In contrast, VSV-L-MT1620 and VSV-GFP-L-MT1620 virus rescue yielded replication competent viruses. This was confirmed by the cytopathic effect and fluorescent signal (FIG. 12B). As expected, VSV-eGFP-L-MT1620-mCherry showed fluorescent signals in both FITC (green) and TRITC (red) channels, and VSV-L-MT1620-mCherry only in TRITC channel. mCherry flanked by a linker on each side has the DNA sequence of SEQ ID NO: 11. VSV-L-MT1620-mWasabi showed green fluorescence in the FITC channel (FIG. 12B). The protein mWasabi is likewise flanked by a linker on each side and is encoded by the DNA sequence of SEQ ID NO: 12. To verify mCherry presence at protein level we performed immunoblots with an mCherry specific antibody. BHK-21 cells were infected with VSV, VSV-GFP, VSV-L-MT1620-mCherry and VSV-GFP-L-MT1620-mCherry. As a positive control, a vector containing only mCherry was transfected in BHK-21 cells. mCherry inside L-protein displayed a signal at high molecular weight (expected at 267 kDa), in accordance with the production of the L-mCherry fusion protein after viral infection (FIG. 12C).",
                                "Taken together these results show the successful insertion of mCherry at position MT1620 leading to a replication competent virus.",
                                "To assess the replication capability and potential attenuation of VSV-L-insert compared to wild-type based VSV, plaque assays were performed to illustrate plaque size (FIG. 13A) and TCID50 assay was performed to quantify virus replication (FIG. 13B). Both tests revealed an attenuation of VSV-L-insert compared to wildtype VSV, with a reduction in virus replication titers of about 1-2 logs. In addition, MTT viability assays were performed to assess the ability of VSV-L-insert to induce cell killing in BHK cells in the presence or absence of interferon compared to VSV. In the absence of IFN, virus cytotoxicity after VSV-L-insert infection was comparable to VSV infection (FIG. 13C). In the presence of IFN, the two L-MT1620-mCherry VSV variants showed a stronger IFN-dependency and consequently a slightly reduced killing compared to VSV and VSV-GFP (FIG. 13C; data for GFP variants not shown) corroborating the finding that insertions of mCherry at position MT1620 lead to mild attenuation compared to wild-type VSV, without significantly impairing its replicative or cytolytic potential.",
                                "The sequencing results of L-mCherry obtained in this example are provided as the sequence of SEQ ID NO: 13. Upon sequence confirmation of all rescued VSV-L-insertion variants we observed one to three secondary non-synonymous mutations in most viruses, which were located in proximity to the site of insertion. These mutations may be conditional and advantageous for proper polymerase function.",
                                "**Example 6: Generating an Alternative Protease-Regulated ON-Switch, VSV-L-Prot**",
                                "The finding of a functional insertion site within the VSV L-protein allowed us to generate an alternative regulatable VSV-prot variant, VSV-L-Prot. Like VSV-P-prot, the VSV-L-Prot comprises a protease insert in the L-protein (SEQ ID NO: 10) and is therefore responsive to APV and replicates to high titers in its presence (also with saquinavir and indinavir) and does not replicate without protease inhibitors (FIG. 14A).",
                                "To test genomic integrity of VSV-L-Prot, viral genomic RNA was purified, reverse transcribed and a PCR performed on L-MT1620PR2. A VSV variant without protease insertion was used as negative control. We found the L-MT1620PR2 and the protease negative L-protein PCR fragments to be at their expected sizes (FIG. 14B).",
                                "We sequenced the site of insertion with two Sanger sequencing reactions to assess whether mutations have occurred within the protease dimer sequence. The sequencing results were aligned with the plasmid sequence. We observed no mutations in the protease dimer sequence).",
                                "**Example 7: VSV-Lprot can be Regulated in a Dose-Dependent Fashion**",
                                "Like with VSV-P-prot, a dose response study was performed to address whether the amprenavir-controlled activity of VSV-L-prot is dose dependent. As discussed before, the effect of amprenavir on both viral gene expression (GFP) (FIG. 15A) and viral replication (TCID50 replication assay) was assessed (FIG. 15B). VSV-L-prot activity started at amprenavir doses of 100 nM and reached a maximum activity at a dose of 30 μM. Higher amprenavir concentrations were not tested for L-prot, since they had shown to decrease titers by being toxic for cells in our previous VSV-P-prot studies. The replication curve also revealed a mild attenuation of VSV-L-prot over VSV comparable to that seen by VSV-P-prot.",
                                "**Example 8: Generating a Tandem Protease-Regulated ON-Switch, VSV-P-L-Prot**",
                                "Addressing the possibility of revertant virus development that may lose the conditional ON switch control, we further investigated the possibility of an insert in the P-protein and in the L-protein. We next generated a VSV with functional double intramolecular insertion into P and L, VSV-P-mWasabi-L-mCherry, as an initial proof of concept for functional double insert VSV variants. We confirmed the double insert function with the double fluorescence read-out and cytopathic effect in plaque assays (FIG. 16A) and the testing of genomic integrity by cDNA synthesis/PCR and Sanger sequencing.",
                                "To test genomic integrity of VSV-P-mWasabi-L-mCherry, viral genomic RNA was purified, reverse transcribed and a PCR performed on P-196-mWasabi (SEQ ID NO: 15) and L-MT1620-mCherry (SEQ ID NO: 14). A VSV variant without fluorescent protein insertions was used as negative control. We found the P-196-mWasabi, L-MT1620-mCherry and the fluorescent protein negative P and L-proteins PCR fragments to be at their expected sizes (FIG. 16B).",
                                "We sequence-confirmed the sites of insertion with two Sanger sequencing reactions to assess whether mutations might have occurred within the fluorescence marker sequences. The sequencing results were aligned with the plasmid sequence. We observed no mutations in the insertion sequence. The sequencing results are provided in cDNA sequences of P-196-mWasabi and L-MT1620-mCherry of VSV-P-mWasabi-L-mCherry as SEQ ID NO: 14 and SEQ ID NO: 15, respectively.",
                                "After confirming the feasibility of tandem intramolecular insertions we next generated a double ON switch regulated VSV variant, VSV-P-L-prot. The virus has been successfully rescued and seems to behave similar to both single switch constructs, VSV-P-prot and VSV-L-prot. This virus also showed protease inhibitor dependency, generating plaques only in the presence of amprenavir (data not shown). However, the double-switch virus showed slightly stronger attenuation compared to the single-switch virus.",
                                "Thus, overall we generated constructs, where the HIV protease dimer was inserted INTRA molecularly into two proteins of the vesicular stomatitis virus (VSV) that make up the polymerase complex (P-protein and L-protein, separately and in combination). In the presence of protease inhibitor, the integrity of the viral proteins was preserved and the viruses could replicate. Without protease inhibitors, the HIV protease dimer was autocatalytically active, cleaving the essential viral proteins upon translation. Analogous to regulatory modules in DNA viruses (e.g. Tet-On), we termed this mechanism “prot-ON”.",
                                "We optimized the codon usage of the flexible linkers and protease dimer to avoid homology between the first and second protease. This precaution was taken, since so called “copy-choice” recombination events in VSV have been described previously (Simon-Loriere and Holmes 2011), in which the viral polymerase, the L-protein, can switch between templates and also skip sequence stretches. “Copy-choice” occurs preferentially when the polymerase is guided by sequence homology of the nascent RNA strand with the newly chosen template. Furthermore, point mutations arise frequently in RNA viruses, in the case of VSV at a mutation rate of about 1 nucleotide in 10,000. Theoretically, every genome carries one mutation, which leads virologists to refer to the VSV genome (and other RNA virus genomes) not as one sequence, but to a mixture of so called “quasi-species”. Therefore, occurrence of mutations within the HIV protease sequence rendering the proteolytic switch inactive are a real possibility. To avoid such escape mutants or revertant viruses that may lose the conditional ON switch control, we doubled the protease module (ON-switch) by introducing protease dimers in a second essential VSV protein the P-protein and the L-protein.",
                                "The only other previously published functional intramolecular insertion site in a VSV protein, which would support viral replication over continuous passaging had been described in the M-protein (Soh and Whelan, Virol, 2015, 89(23):117050-11760). However, it is preferred to control the replication machinery of VSV directly, since regulation of the M-protein would still allow the virus to undergo replication, possibly facilitating escape mutations. Insertion sites within the L-protein have been described, but the resulting viruses were temperature sensitive and instable after passage (Ruedas and Perrault 2009, Ruedas and Perrault 2014). In contrast, we were able to generate functional insertions with initially fluorescence proteins and subsequently the HIV protease dimer. Both P-prot and L-prot responded to the presence of every HIV protease inhibitor we tested and replicated in a compound dose-dependent fashion. In the absence of protease inhibitors, virus gene expression ceased and replication stopped.",
                                "Although not tested in this study, the ON switch system inherently harbors an additional environmental safety element. As virus progeny depend on presence of protease inhibitor, potentially shed virus is not active for productive infection. This is of particular importance when therapeutic RNA viruses can cause or mimic notifiable animal diseases.",
                                "**Example 9: Generating a Protease-Regulated OFF-Switch, VSV-GFP-Prot-L**",
                                "Following the generation of a protease-based ON-switch we also generated a VSV variant VSV-Prot-Off that can be switched off. Using the same HIV protease mediated autocatalytic switch system, a location change of the insertion from INTRA- to INTER-molecular site results in a reversal of direction from virus promoting to virus stopping control. For this OFF-switch, the protease dimer with a variant codon optimization was inserted into the VSV genome to create a fusion protein of GFP, the protease dimer and the viral polymerase L. This large fusion protein with the protease dimer fused to the N-terminus of the L protein is expected to be functionally inactive, but to be activated by proteolytic liberation of L protein in the absence of protease inhibitor. In this OFF construct we replaced an intergenic region of VSV with the HIV protease flanked by its cleavage sites. Intergenic regions play a crucial part in generating multiple proteins from one RNA strand. We chose the intergenic region between the non-essential reporter protein GFP and the L-protein (FIG. 17A) in VSV-GFP and generated two viruses. The first one carried flexible linker regions surrounding the HIV protease dimer construct (SEQ ID NO: 16) and a second one having no regions surrounding the HIV protease dimer construct (SEQ ID NO: 17). It would be advantageous to avoid flexible linker regions, because they would remain as C-terminal tag on GFP and N-terminal tag on the L-protein, after the HIV protease dimer has cleaved its recognition sequence. However, the two constructs differ only slightly in their replicative capacity. Adding of amprenavir (10 μM) resulted in stop of virus activity both at the level of viral transgene expression (GFP) as well as virus replication (plaque assays) (FIG. 18A). An additional unique safety feature has been added to this system. In theory, a potential loss of the protease insert could result in viral progeny escaping the OFF switch control. We therefore put the protease OFF switch in place of the intergenic region, so that an insert loss would come with a penalty of forming a fusion protein of two neighboring VSV proteins or in this case a VSV protein with GFP resulting in a dysfunctional virus.",
                                "To test genomic integrity of VSV-GFP-Prot-L, viral genomic RNA was purified, reverse transcribed and a PCR performed on GFP-Prot-L. A VSV variant without protease insertion was used as negative control. We found the VSF-GFP-Prot-L and the protease negative L-protein PCR fragments to be at their expected sizes (FIG. 18B).",
                                "We sequenced the site of insertion with two Sanger sequencing reactions to assess whether mutations have occurred within the protease dimer sequence. The sequencing results were aligned with the plasmid sequence. We observed one mutation in the protease dimer sequence in each construct. The mutations are at amino acid positions 85 in the construct with linker corresponding to nt 623 of the cDNA sequence of the protease dimer with linker having the sequence of SEQ ID NO: 18 (or nt 254 of the second protease nucleotide sequence) and at amino acid position 86 in the construct without linker corresponding to nt 589 of the cDNA sequence of the protease dimer without linker having the sequence of SEQ ID NO: 19 (or nt 256 of the second protease nucleotide sequence), both in the second protease. The mutations are not described as typical protease inhibitor resistance mutations and do not interfere with regulation by protease inhibitors. Possibly these mutations made the protease more active when fused between GFP and L.",
                                "**Example 10: VSV-GFP-Prot-L can be Regulated in a Dose-Dependent Fashion and by Different Protease Inhibitors**",
                                "Like with the two prot-ON constructs, a dose response study was performed to address whether the amprenavir-controlled activity of VSV-GFP-Prot-L (VSV-Prot-Off) is dose dependent. As discussed before, the effect of amprenavir on both viral gene expression (GFP) and viral replication (TCID50 replication assay) was assessed (FIGS. 19 A and B). In the absence of protease inhibitors, VSV-GFP-Prot-L activity was unattenuated compared to normal VSV. VSV-GFP-Prot-L activity was high at low amprenavir concentrations (0-300 nM) and started to decline at 1 μM. We also tested whether VSV-GFP-Prot-L would respond to other protease inhibitors than amprenavir. 10 μM saquinavir treatment resulted in even stronger inhibition of virus replication than amprenavir (FIG. 19B). This was further confirmed in FIG. 19 C using saquinavir concentrations of 0-30 μM). Further a single step replication kinetic was determined by seeding 105 BHK cells per well in 12-Well plates and infected at an MOI of 3 with VSV-Prot-Off or VSV-GFP (FIG. 19D). One hour after infection, cells were washed twice with PBS and incubated in 500 μl GMEM until indicated time points. For starting values, i.e. 0-hour time points, the 500 μl GMEM were collected immediately. VSV-Prot-Off showed no attenuation compared to VSV-GFP (FIG. 19D).",
                                "Thus, using the same autoproteolytic system as in the “prot-ON” constructs but in a functionally different genome location, we also developed the reversal mechanism of protease-dependent OFF regulation, which works by the replacement of an intergenic region with the HIV protease dimer. In this construct the protease must be active to separate two viral proteins, similar as it does in HIV. Adding protease inhibitor in this construct leads to non-functional fusion proteins (polyproteins), which inhibit viral activity. Continuing the Tet-On/Tet-Off analogy, we termed this construct “prot-Off”. For optimal virus activity control, both ON and OFF switches were designed to interfere with an early stage of virus propagation by modulating proteins of the viral replication/transcription machinery. Hence our approach expands and potentially bests the current methods of RNA virus regulation.",
                                "The replacement of the intergenic region in the Prot-Off viruses has been exemplified between a non-essential reporter protein, GFP, and the essential L-protein, however, the Prot-Off may equally replace an intergenic region that links an essential viral protein with a further viral protein, thereby making the virus safer, since deletion of the protease construct would result in a non-functional fusion protein. Classical resistance mutations, as they occur in HIV under continuous treatment with protease inhibitors could theoretically still occur in the Prot-OFF construct. However, the broad spectrum of available protease inhibitors could compensate for such point mutations.",
                                "**Example 11: VSV-Pprot can be Regulated In Vivo by Administration of Protease Inhibitor**",
                                "To validate the ON-switch viruses in vivo, a luciferase expressing variant VSV-P-prot-Luc was generated as described in Example 1 and shown in FIG. 4, comprising a luciferase reporter gene in place of the eGFP reporter gene for in vivo imaging. Six- to eight-week old female athymic nude mice (Janvier Labs, Le Genest-Saint-Isle, France) were housed in a BL2 facility with a 12-hour light/dark cycle with unrestricted access to food and water. For subcutaneous xenografts, 100 μl human U87 glioblastoma cell suspension containing 2×106 cells were injected into the right flanks of nude mice. After an engraftment period, U87 xenografts with a median volume of 0.1 cm3 were intratumorally injected with a single dose of 30 μl containing 107 virus (titrated via TCID50) of VSV-Pprot-Luc or control buffer. Protease inhibitor treatment (50 μl intraperitoneal of 0.8 mM APV+0.2 mM RTV every 12 hours in drug vehicle containing 10% DMSO, 40% PEG300, 5% Tween80 and 45% PBS) was initiated one hour before virus application. Ritonavir serves as a blocker of degradation enzymes (Cyp family) in vivo. It augments the concentration of the other PI. RTV is also used as additive in the treatment of HIV for exactly that purpose. Additionally it blocks p-glycoproteins and therefore increases the concentration of the other PI in the brain. Bioluminescence in vivo imaging of luciferase expressing VSV variants was performed using an IVIS® Lumina II (Perkin Elmer, Waltham, Mass.) system as described by Urbiola C. et al., (int. J. Cancer, 2018, 148: 1786-1796). FIG. 20A shows representative bioluminescence images from 8 days after virus injection. At day 8, luminescence is only detected in mice that have been treated with protease inhibitor. This is also confirmed by the bioluminescence imaging (BLI) quantified luciferase signal data shown in FIG. 20B. In the absence of protease inhibitor the luciferase signal is maximal between days 2 to 3 and then starts to decline. The initial bioluminescence signal independent of protease inhibitor application can be explained by the fact that the virus preparation contained amprenavir to block autoproteolysis during virus production and storage. Without further protease inhibitor injections, the bioluminescence signal decreased significantly after 3 days (FIG. 20B), followed by loss of tumor control (data not shown). By contrast, in the presence of protease inhibitor the luciferase signal plateaued for 17 days at an overall much higher level (FIG. 20B) and tumors were controlled in size (data not shown). These data demonstrates in vivo functionality of the ON switch construct, allowing virus replication and expression of a transgene, such as the reporter gene luciferase as used in this experiment or a therapeutic protein, in the presence of a protease inhibitor.",
                                "**Example 12: VSV-L-Prot can be Regulated In Vivo by Administration of Protease Inhibitor**",
                                "The in vivo data could be further confirmed using VSV-L-prot, expressing GFP as a reporter. Nude mice were subcutaneously xenografted with U87 glioblastoma cells as described in Example 11. At a median volume of 0.1 cm3 mice were intratumorally injected with a single dose of VSV-L-prot, VSV control or control buffer (mock). The generation of VSV-L-prot is described in Example 6 above. A protease inhibitor (PI) mix comprising 0.8 mM amprenavir (APV) and 0.2 mM ritonavir (RTV) and was administered intraperitoneally at 50 μl every 12 hours. Tumors were measured with a caliper and volume was calculated using the formula: length×width2×0.4. Intratumoral treatment of subcutaneus U87 tumors with VSV-L-prot resulted in reduced tumor growth (FIG. 21A) and survival benefits increased survival (FIG. 21B) in the presence of protease inhibitor mix compared to treatment without the protease inhibitor. The concentration of protease inhibitor used in this proof-of-concept study is relatively low and could be further increased. Overall, these data further validate the in vivo applicability of the virus ON-switch.",
                                "**Example 13: Protease Inhibitor Regulates VSV-Prot-Off Activity In Vivo**",
                                "We further tested the OFF-switch in vivo. Six- to eight-week old female NOD.CB-17-Prkdcscid/Rj mice (Janvier Labs, Le Genest-Saint-Isle, France) were housed in a BL2 facility with a 12-hour light/dark cycle with unrestricted access to food and water. For subcutaneous xenografts, 100 μl glioblastoma cell suspension containing 2×106 human G62 glioma cells were injected into the right flanks of NOD-SCID mice. To test the OFF-switch system, G62 xenografts with a median volume of 0.07 cm3 were intratumorally injected with 30 μl containing 2×107 virus (TCID50) of VSV-Prot-Off (n=16), VSV-GFP (n=8) or control buffer (mock; n=7). Virus treatment was repeated seven days later. The generation of VSV-Prot-OFF (VSV-GFP-prot-L) is described in Example 6 above and depicted in FIG. 17A. Protease inhibitor mix treatment (50 μl intraperitoneal of 0.8 mM SQV+0.2 mM RTV every 8 hours in drug vehicle containing 10% DMSO, 40% PEG300, 5% Tween80 and 45% PBS) was initiated 8 days post second virus injection when tumor regression was observed. Tumors were measured with a caliper and volume was calculated using the formula: length×width2×0.4. Starting on day 6, mice treated with VSV-GFP showed signs of neurotoxicity (FIG. 22B). 15 days post-treatment, the first among the mice treated with VSV-Prot-Off developed neurological symptoms, the remaining mice were randomly divided into 2 groups. One group (n=7) received no protease inhibitor allowing continuous virus replication, which maintained tumor control but also led to further neurotoxicity in some mice. However, neurotoxicity was reduced compared to parental VSV-GFP treated mice (3 vs 6 out of 8 mice). The second group (n=8) was subsequently treated with the protease inhibitor mix (SQV+RTV) 3 times a day to initiate the OFF switch. No signs of neurotoxicity were observed in this group. No signs of neurotoxicity were observed in this group (FIG. 22B). After OFF switch activation, tumor control was diminished and relapse occurred (FIG. 22A).",
                                "**Example 14: Protease Inhibitor Regulates VSV-Prot-Off Activity In Vivo as Shown by Immunofluorescence**",
                                "Xenografts were engrafted as described in Example 13. G62 xenografts with a median volume of 0.07 cm3 were intratumorally injected with 30 μl containing 2×106 virus (TCID50) of VSV-Prot-Off or VSV-GFP and protease inhibitor treatment (50 μl intraperitoneal of 0.8 mM SQV+0.2 mM RTV every 8 hours in drug vehicle containing 10% DMSO, 40% PEG300, 5% Tween80 and 45% PBS) was initiated 3 days post single virus treatment. One week later (day 10) tumors were harvested and analysed for virus spread using anti-VSV-N antibody staining. Representative images (FIG. 23) show wide intratumoral spread of VSV-GFP and slightly reduced intratumoral spread of VSV-Prot-OFF in the absence of protease inhibitor, suggesting that VSV-Prot OFF is attenuated to some extent in vivo. In contrast, protease inhibitor treatment starting 3 days after virus inoculation abrogated spread of the virus, which was limited to a minor isolated region.",
                                "**Example 15: Protease Inhibitor Saquinavir Regulates Soluble IL12 Expression Using VSV with a Protease-Regulated OFF-Switch**",
                                "To further investigate whether transgene expression of a therapeutic protein can be regulated using the OFF-switch VSV-GP-IL12-Prot-Off was tested in cell culture. VSV-GP-IL12-Prot-Off (schematically depicted in FIG. 24A, top) is based on VSV-GP pseudotyped with the glycoprotein (GP) of the lymphocytic choriomeningigtis virus (LCMV) and has been developed to overcome the neurotoxicity of VSV as described in more detail in WO 2010/040526. 105 BHK cells per well were seeded in 12-Well plates. Cells were infected at an MOI of 0.1 of VSV variants VSV-GP, VSV-GP-IL12, VSV-GP-GFP-IL12-Prot-Off-wl or VSV-GP-GFP-IL12-Prot-Off_w/ol. One hour after infection, cells were washed with PBS and incubated with standard GMEM without protease inhibitor (-ctrl) or 10, 100, 300, 1.000, 10.000 nmol of protease inhibitor saquinavir. 30 hours post infection, supernatants were collected. Virus titers were determined via TCID50. Virus titer of VSV-GP-IL12-Prot-Off with and without linker (wl, w/ol) were dependent on the presence and concentration of PI saquinavir (FIG. 24A). Next, an enzyme-linked immunosorbant assay (ELISA) was performed to determine, whether the expressed transgene IL12 was also dependent on saquinavir concentration. VSV-GP-IL12-Prot-Off-w/ol had mildly preferable titer characteristics (higher titers without and stronger response to PI) and was therefore used for the subsequent ELISA. VSV-GP-IL12 and non-inhibited Prot-Off viruses resulted in IL12 concentrations above the assay detection limit. Only control samples without PI (-ctrl) were diluted and measured. IL12 concentration was proportional to virus titer in the Prot-Off virus treated with different doses of saquinavir (FIG. 24B).",
                                "**Example 16: Protease Inhibitor Atazanavir Regulates Soluble IL12 Expression Using VSV with a Protease-Regulated OFF-Switch**",
                                "105 BHK cells per well were seeded in 12-Well plates. Cells were infected at an MOI of 1 of VSV variants VSV-GP-IL12, VSV-GP-Luc-IL12-Prot-Off-wl (FIG. 25A), VSV-GP-Luc-IL12-Prot-Off-w/ol (comprising GFP instead of Luc as shown in 25A). One hour after infection, cells were washed with PBS and incubated with standard GMEM without PI (-ctrl) or 10, 100, 300, 1.000, 10.000 nmol of a more recently developed protease inhibitor called atazanavir. 30 hours post infection, supernatants were collected. Virus titers were determined via TCID50. Again, the Prot-Off variant without linkers replicated to higher titers and reacted quicker to atazanavir (FIG. 25A). Therefore, this variant was used for the IL12 ELISA. VSV-GP-IL12 and non-inhibited Prot-Off viruses resulted in IL12 concentrations above the assay detection limit. Only control samples without PI (-ctrl) were diluted and measured (FIG. 25B).",
                                "**Example 17: Replication Kinetics of VSV with a Protease-Regulated OFF-Switch Encoding IL12 and a Reporter Protein**",
                                "105 BHK cells per well were seeded in 12-Well plates. Cells were infected at an MOI of 3 of VSV variants VSV-GP-IL12, VSV-GP-Prot-Off-w/ol GFP IL12 (FIG. 26A, top), VSV-GP-Prot-Off-w/ol Luc IL12 (FIG. 26A, bottom) for a single-step replication kinetic. One hour after infection, cells were washed twice with PBS and incubated in 500 μl GMEM until indicated time points. For starting values, i.e. 0-hour time points, the 500 μl GMEM were collected immediately. VSV-Prot-Off variants showed mild attenuation in early time points compared to origin virus VSV-GP-IL12 (FIG. 26B).",
                                "**Example 18: Proof-of-Concept for the Expression of Membrane Bound Therapeutic Proteins Using a Protease-Regulated OFF-Switch (FIGS. 27 and 28)**",
                                "Due to strong toxicity of systemically applied IL12, membrane anchored variants have been developed to retain IL12 at desired sites (Poutou, J. et al., Gene Therapy (2015) 22, 696-706). We applied this principle to gain several advantages over soluble IL12 constructs. First, as has been described by Poutou et al., locally produced IL12 decreases systemic toxicity. Nevertheless, toxicity is not abrogated completely; therefore, further regulation is still desirable. By fusing IL12 with a transmembrane domain of CD4 directly to the VSV polymerase (L protein) as shown in FIG. 27, both viral replication and transgene expression can be decreased through the presence of protease inhibitors. Furthermore, in the context of virus escape mutants, fusing the possibly toxic transgene to the protease dimer in the regulatory virus OFF-switch variant would force the virus to delete both transgene and regulatory switch at once. Deletion of only the switch would still result in a non-functional transgene-polymerase fusion protein. Additionally, by combining both transgene and OFF-switch, coding capacity the virus is economized. Typically, genes are added to the VSV genome by further intergenic regions. VSV genes are transcribed in a continuous gradient, whereby every intergenic region reduces the expression of the downstream transcript. Therefore, introduction of a transgene without the need for an extra intergenic region could reduce virus attenuation.",
                                "Previous Prot-Off constructs showed that a flexible linker between the HIV protease dimer and the polymerase result both in lower titers in the absence of protease inhibitors and a slightly less stringent regulation. Residual linker after protease cleavage attached to the N-terminus of the polymerase could be an explanation for the first phenomenon. A flexible linker between the HIV protease and the polymerase could furthermore allow some activity due to less stringent sterical hindrance, possibly resulting in less stringent regulation. Transmembrane anchored IL12 virus variants were therefore designed with either a flexible linker only between IL12-TM and the HIV protease dimer (forward linker—fl) or without any linker flanking the protease (without linker—w/ol). We designed the forward linker construct to provide some additional space between the CD4 membrane anchor and the protease-polymerase fusion protein. The transmembrane domain has the amino acid sequence of SEQ ID NO: 31 (encoded by nucleic acid sequence of SEQ ID NO: 32) and is separated from IL12 encoded by the nucleotide sequence of SEQ ID NO: 33 by a linker having the amino acid sequence of SEQ ID NO: 34 (encoded by nucleic acid sequence of SEQ ID NO: 35).",
                                "Viral titer and IL-12 expression was determined in cell culture. 105 BHK cells per well were seeded in 12-Well plates. Cells were infected at an MOI of 1 of VSV variants VSV-GP-TM-IL12-Prot-Off-w/ol, VSV-GP-TM-IL12-Prot-Off-fl or VSV-GP-IL12 (control). One hour after infection, cells were washed with PBS and incubated with standard GMEM without PI (-ctrl) or 10, 100, 300, 1.000, 10.000 nmol of atazanavir. 30 hours post infection, supernatants were collected. Virus titers were determined via TCID50 (FIG. 28A). Furthermore, unfiltered supernatants were tested for IL12 in an ELISA. Since IL12 was membrane-bound, in principle only virus-lysed cells would shed the protein. Indeed, maximal IL12 concentrations were lower in PI-negative control samples compared to secreted IL12 (compare FIG. 28B with FIGS. 24B and 25B). Other than with secreted variants, the ELISA assay limit was not exceeded by 2-3 log scales in undiluted samples.",
                                "We therefore compared samples comprising lysed cells, supernatant with cells and supernatant only. Lysed cells comprise the cells, non-filtered supernatant with dead cells and lysis buffer added at 1:1. Supernatant with cells refers to non-filtered supernatant with dead cells and supernatant has been centrifuged to remove dead cells. Thus, in supernatant only comprises IL12 liberated by virus cell killing. When samples were diluted in cell lysis buffer, IL12 concentration increased 10-fold due to protein liberated from cellular membranes. Vice-versa, centrifugation and therefore clearance of supernatants from remaining IL12-bearing cells further decreased the concentration of IL12 in the sample.",
                                "We further analysed replication kinetics of transmembrane IL12 encoding VSV in cell culture. 105 BHK cells per well were seeded in 12-Well plates. Cells were infected at an MOI of 3 of VSV variants VSV-GP-TM-IL12-Prot-Off-fl, VSV-GP-TM-IL12-Prot-Off-w/ol or VSV-GP-IL12 for a single-step replication kinetic. One hour after infection, cells were washed twice with PBS and incubated in 500 μl GMEM until indicated time points. For starting values, i.e. 0-hour time points, 500 μl GMEM were collected immediately. VSV-Prot-Off transmembrane IL12 variants showed modest attenuation in early time points compared to origin virus VSV-GP-IL12 (FIG. 28D). Possibly this early attenuation is caused by expression of the IL12-protease-polymerase fusion protein at the endoplasmic reticulum. VSVs replication complexes however form within the cytoplasm. Thus, liberated polymerase has to diffuse from the ER to virus replication sites. At later time points, however, no attenuation was apparent and further no difference between the constructs with forward linker or without linker has been observed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce TCID50 assay",
                                "describe virus titration method",
                                "explain cytopathic effect",
                                "count infected wells",
                                "calculate TCID50 values",
                                "describe plaque assay",
                                "introduce crystal violet staining",
                                "fix BHK-21 cells",
                                "prepare 5-fold serial dilutions",
                                "infect cells with virus stocks",
                                "wash cells with PBS",
                                "add agarose/medium mixture",
                                "remove agarose/medium mixture",
                                "fix cells with crystal violet",
                                "describe IFN killing assay",
                                "treat cells with recombinant IFN",
                                "infect cells with MOIs",
                                "add Thiazolyl Blue",
                                "dissolve cells in NaCl with SDS",
                                "measure MTT-Formazan",
                                "describe plaque assay",
                                "overlay cells with agarose/medium mixture",
                                "stain cells with crystal violet",
                                "describe immunoblotting",
                                "infect BHK-21 cells with VSV",
                                "prepare cell lysates",
                                "centrifuge cell lysates",
                                "store supernatants at -80°C",
                                "perform SDS-PAGE",
                                "transfer proteins to nitrocellulose membrane",
                                "block membrane with PBSTM",
                                "incubate with mCherry-specific antibody",
                                "incubate with peroxidase-conjugated antibody",
                                "develop blots with ECL",
                                "describe transfections",
                                "transfect L-mCherry expression plasmids",
                                "co-transfect with P-expression plasmids",
                                "infect 293T cells with VSV-GFP-ΔL",
                                "acquire images",
                                "describe animal experiments",
                                "perform stereotactic mouse brain injections",
                                "analyze virus-infected cells",
                                "perform statistical analysis",
                                "describe data presentation",
                                "introduce TCID50 assay",
                                "perform dose response study",
                                "assess effect of amprenavir on viral gene expression",
                                "assess effect of amprenavir on viral replication",
                                "generate tandem protease-regulated ON-switch",
                                "confirm double insert function",
                                "test genomic integrity",
                                "sequence-confirm insertion sites",
                                "generate double ON-switch regulated VSV variant",
                                "test protease inhibitor dependency",
                                "discuss advantages of prot-ON mechanism",
                                "optimize codon usage",
                                "discuss copy-choice recombination events",
                                "discuss mutation rates in RNA viruses",
                                "generate protease-regulated OFF-switch",
                                "insert HIV protease dimer into VSV genome",
                                "test replicative capacity",
                                "add safety feature to OFF-switch system",
                                "test genomic integrity of VSV-GFP-Prot-L",
                                "sequence-confirm insertion site",
                                "perform dose response study for VSV-GFP-Prot-L",
                                "test response to different protease inhibitors",
                                "determine single step replication kinetic",
                                "discuss advantages of prot-Off mechanism",
                                "discuss potential applications of prot-ON and prot-Off systems",
                                "introduce TCID50 assay",
                                "describe Example 11: VSV-Pprot-Luc regulation",
                                "detail in vivo experiment setup",
                                "present bioluminescence imaging results",
                                "interpret results: in vivo functionality of ON-switch construct",
                                "introduce Example 12: VSV-L-prot regulation",
                                "describe in vivo experiment setup",
                                "present tumor growth and survival results",
                                "interpret results: in vivo applicability of ON-switch",
                                "introduce Example 13: VSV-Prot-Off regulation",
                                "describe in vivo experiment setup",
                                "present tumor growth and neurotoxicity results",
                                "interpret results: in vivo functionality of OFF-switch",
                                "introduce Example 14: VSV-Prot-Off regulation",
                                "describe immunofluorescence experiment",
                                "present virus spread results",
                                "interpret results: in vivo attenuation of VSV-Prot-Off",
                                "introduce Example 15: VSV-GP-IL12-Prot-Off regulation",
                                "describe cell culture experiment setup",
                                "present virus titer and IL12 expression results",
                                "interpret results: regulation of IL12 expression",
                                "introduce Example 16: VSV-GP-IL12-Prot-Off regulation",
                                "describe cell culture experiment setup",
                                "present virus titer and IL12 expression results",
                                "interpret results: regulation of IL12 expression",
                                "introduce Example 17: VSV-GP-Prot-Off replication kinetics",
                                "describe cell culture experiment setup",
                                "present replication kinetics results",
                                "interpret results: mild attenuation of VSV-Prot-Off",
                                "introduce Example 18: membrane-bound IL12 expression",
                                "describe cell culture experiment setup",
                                "present virus titer and IL12 expression results"
                            ],
                            "num_characters": 51315,
                            "outline_medium": [
                                "introduce TCID50 assay",
                                "describe virus titration method",
                                "explain cytopathic effect",
                                "count infected wells",
                                "calculate TCID50 values",
                                "introduce in vitro cytotoxicity assay",
                                "describe plaque assay",
                                "introduce immunoblotting",
                                "describe SDS-PAGE",
                                "transfer proteins to nitrocellulose membrane",
                                "block membrane with skim milk and Tween 20",
                                "incubate with mCherry-specific antibody",
                                "wash and incubate with peroxidase-conjugated antibody",
                                "develop blots with enhanced chemiluminescence",
                                "introduce transfections",
                                "describe transfection of L-mCherry expression plasmids",
                                "introduce animal experiments",
                                "describe stereotactic mouse brain injections",
                                "introduce image analysis",
                                "describe fluorescence microscope analysis",
                                "introduce statistical analysis",
                                "describe statistical significance determination",
                                "introduce TCID50 assay",
                                "perform dose response study",
                                "generate tandem protease-regulated ON-switch",
                                "confirm genomic integrity",
                                "test genomic integrity of VSV-P-mWasabi-L-mCherry",
                                "generate double ON switch regulated VSV variant",
                                "optimize codon usage of flexible linkers and protease dimer",
                                "generate protease-regulated OFF-switch",
                                "test genomic integrity of VSV-GFP-Prot-L",
                                "perform dose response study for VSV-GFP-Prot-L",
                                "test response to different protease inhibitors",
                                "determine single step replication kinetic",
                                "introduce TCID50 assay",
                                "describe Example 11: VSV-Pprot-Luc regulation",
                                "describe bioluminescence imaging results",
                                "describe Example 12: VSV-L-prot regulation",
                                "describe tumor growth and survival benefits",
                                "describe Example 13: VSV-Prot-Off regulation",
                                "describe tumor regression and neurotoxicity",
                                "describe Example 14: VSV-Prot-Off regulation",
                                "describe immunofluorescence analysis",
                                "describe Example 15: VSV-GP-IL12-Prot-Off regulation",
                                "describe soluble IL12 expression",
                                "describe Example 16: VSV-GP-IL12-Prot-Off regulation",
                                "describe soluble IL12 expression with atazanavir",
                                "describe Example 17: VSV-GP-Prot-Off replication kinetics",
                                "describe Example 18: membrane-bound IL12 expression",
                                "describe regulation of membrane-bound IL12 expression"
                            ],
                            "outline_short": [
                                "describe TCID50 assay method",
                                "introduce virus titers determination",
                                "explain cytopathic effect observation",
                                "count infected wells",
                                "calculate TCID50 values",
                                "introduce in vitro cytotoxicity assay",
                                "describe plaque assay method",
                                "introduce immunoblotting",
                                "describe transfections",
                                "introduce animal experiments",
                                "describe statistical analysis",
                                "describe TCID50 assay",
                                "generate tandem protease-regulated ON-switch",
                                "optimize codon usage and avoid homology",
                                "generate protease-regulated OFF-switch",
                                "test genomic integrity of VSV-GFP-Prot-L",
                                "regulate VSV-GFP-Prot-L in a dose-dependent fashion",
                                "describe TCID50 assay",
                                "validate ON-switch viruses in vivo",
                                "regulate VSV-L-prot in vivo",
                                "test OFF-switch in vivo",
                                "regulate VSV-Prot-Off activity in vivo",
                                "regulate soluble IL12 expression",
                                "regulate membrane-bound therapeutic proteins",
                                "analyze replication kinetics of VSV variants"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A single-stranded RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one protein essential for viral transcription and/or replication, a protease and a cleavage site for said protease, wherein\n(a) the at least one protein essential for viral transcription and/or replication comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease; or\n(b) the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end, separated by the cleavage site for said protease.",
        "2. The single-stranded RNA virus of claim 1, wherein the protease can be inhibited using a protease inhibitor.",
        "3. The single-stranded RNA virus of claim 1 or 2, wherein the single-stranded RNA virus is a negative-sense single-stranded RNA virus, preferably a negative-sense single-stranded RNA virus of the order Mononegavirales.",
        "4. The single-stranded RNA virus of claim 3, wherein the at least one protein essential for viral transcription and/or replication is selected from the group consisting of polymerase cofactor, polymerase and nucleocapsid, preferably wherein the at least one protein essential for viral transcription and/or replication is\n(a) a polymerase cofactor, preferably a P-protein or a functional equivalent thereof;\n(b) a polymerase, preferably a L-protein; and/or\n(c) combinations thereof.",
        "5. The single-stranded RNA virus of any one of the preceding claims, wherein the protease is the HIV-1 protease, preferably a single chain dimer of the HIV-1 protease, and the protease can be inhibited by a protease inhibitor selected from the group consisting of indinavir, saquinavir, ritonavir, nelfinavir, lopinavir, amprenavir, fosamprenevir, atazanavir, tipranavir and darunavir.",
        "6. The single-stranded RNA virus of any one of the preceding claims, wherein at least the cleavage site for said protease and optionally further the protease is located within the intramolecular insertion site of the least one protein essential for viral transcription and/or replication, and wherein\n(a) proteolytic cleavage of the protein cleaves the at least one protein essential for viral transcription and/or replication at the cleavage site for said protease within the intramolecular insertion site;\n(b) cleavage within the intramolecular insertion site inactivates the at least one protein essential for viral transcription and/or replication;\n(c) cleavage within the intramolecular insertion site of the at least one protein essential for viral transcription and/or replication inhibits viral transcription and/or replication;\n(d) the virus is active in the presence of a specific inhibitor of the protease and inactive in the absence of a specific inhibitor of the protease; and/or\n(e) the virus further encodes at least one heterologous protein, wherein the heterologous protein is expressed if the virus is active in the presence of a specific inhibitor of the protease and is not expressed if the virus is inactive in the absence of a specific inhibitor of the protease.",
        "7. The single-stranded RNA virus of any one of the preceding claims, wherein the single-stranded RNA virus is Vesicular Stomatitis Virus (VSV), the at least one protein essential for viral transcription and/or replication is the P-protein and/or the L-protein and wherein the intramolecular insertion site is\n(a) in the flexible hinge region of the VSV P-protein, preferably at a position corresponding to amino acid position 193-199, more preferably amino acid position 196 of VSVi P-protein;\n(b) in the loop of the methyltransferase domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625, and more preferably to amino acid 1620 of VSVi L-protein; or\n(c) a combination of (a) and (b).",
        "8. The single-stranded RNA virus of any one of claims 1 to 5, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease and wherein\n(a) proteolytic cleavage of the fusion protein releases the at least one protein essential for viral transcription and/or replication in its active form;\n(b) the at least one protein essential for viral transcription and/or replication in the fusion protein comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease is inactive without proteolytic cleavage;\n(c) the proteolytic cleavage of the fusion protein is inhibited using a specific inhibitor of the protease;\n(d) the virus is inactive in the presence of a specific protease inhibitor of the protease and active in the absence of a specific inhibitor of the protease;\n(e) the virus further encodes at least one heterologous protein, wherein the heterologous protein is not expressed if the virus is inactive in the presence of a specific inhibitor of the protease and is expressed if the virus is active in the absence of a specific inhibitor of the protease;\n(d) the fusion protein further comprises a further viral protein or a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, and wherein said further viral protein or heterologous protein and said protease are also separated by a cleavage site for said protease;\n(e) the protease flanked by the cleavage site for said protease on either side replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a further viral protein or a heterologous protein; and/or\n(f) the protease flanked by the cleavage site for said protease on either side replaces an intergenic region that links the at least one protein essential for viral transcription and/or replication with a further viral protein or a heterologous protein, wherein loss of the protease leads to a further inactive fusion protein comprising the protein essential for viral transcription and/or replication and the further viral protein or heterologous protein.",
        "9. The single-stranded RNA virus of claim 1 or 8, wherein the single-stranded RNA virus is a negative-sense single-stranded RNA virus of the order Mononegavirales and the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein comprising the protease fused to the N-terminal end or the C-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease, wherein\n(a) the at least one protein essential for viral transcription and/or replication is an L protein; and/or\n(b) the fusion protein comprises the protease fused to the N-terminal end of the at least one protein essential for viral transcription and/or replication separated by the cleavage site for said protease.",
        "10. The single-stranded RNA virus of claim 1 or 8, wherein the at least one protein essential for viral transcription and/or replication is encoded as a fusion protein\n(a) consisting of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease, wherein the fusion protein optionally further comprises a linker between the protease and the protein essential for viral transcription and/or replication; or\n(b) comprising the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, separated by the cleavage site for said protease, and a further viral protein or a heterologous protein fused to the opposite end of the protease fused to the N-terminal or C-terminal end of the at least one protein essential for viral transcription and/or replication, and wherein said further viral protein or heterologous protein and said protease are also separated by a cleavage site for said protease.",
        "11. An RNA virus comprising a modified genome of the virus comprising a polynucleotide sequence encoding at least one heterologous protein, a protease and a cleavage site for said protease, wherein the at least one heterologous protein comprises an insert at an intramolecular insertion site comprising at least the cleavage site for said protease and optionally further the protease, preferably wherein the heterologous protein is a therapeutic protein, a reporter or a tumor antigen.",
        "12. The single-stranded RNA virus of any one of claims 1 to 10 or the RNA virus of claim 11 for use in therapy.",
        "13. The single-stranded RNA virus of any one of claims 1 to 10 or the RNA virus of claim 11 for use in treating cancer.",
        "14. The single-stranded RNA virus or the RNA virus for use of claim 13, wherein the cancer is a solid tumor, preferably selected from the group consisting of colon carcinoma, prostate cancer, breast cancer, lung cancer, skin cancer, liver cancer, bone cancer, ovary cancer, pancreas cancer, brain cancer, head and neck cancer, lymphoma (Hodgkin's and non-Hodgkin's lymphoma), brain cancer, neuroblastoma, mesothelioma, Wilm's tumor, retinoblastoma and sarcoma.",
        "15. A recombinant VSV L-protein comprising an insert in the loop of the methyltransferase domain of the L-protein corresponding to amino acids 1614 to 1634, preferably to amino acids 1614 to 1629, more preferably to amino acids 1616 to 1625 and more preferably to amino acid 1620 of VSVi L-protein having the amino acid sequence of SEQ ID NO: 28.",
        "16. A Vesicular Stomatitis Virus (VSV) comprising the recombinant VSV L-protein according to claim 15.",
        "17. A method for controlling RNA virus replication comprising\n(a) transducing or transfecting a host cell with the RNA virus according to claim 6 or 7, and\n(b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease,\nwherein the addition of said protease inhibitor allows viral transcription and/or replication and the absence of said protease inhibitor inhibits viral transcription and replication; or\n(a) transducing or transfecting a host cell with the RNA virus according to any one of claims 8 to 10, and\n(b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease,\nwherein the addition of said protease inhibitor inhibits viral transcription and/or replication and the absence of said protease inhibitor allows viral transcription and replication; or\n(a) transducing or transfecting a host cell with the RNA virus according to claim 119, wherein the protease is located within an intramolecular insertion site of the at least one heterologous protein; and\n(b) maintaining the host cell in the presence or absence of a protease inhibitor specific for said protease,\nwherein the addition of said protease inhibitor allows heterologous protein expression and the absence of said protease inhibitor inhibits heterologous protein expression."
    ]
}