{
    "id": "https://semopenalex.org/work/W3090538590",
    "authors": [
        "G. Aeppli",
        "Markus Müller",
        "Manuel Grimm",
        "Adrian Beckert"
    ],
    "title": "Universal Quantum Computing Using Electronuclear Wavefunctions of Rare-Earth Ions",
    "date": "2021-01-21",
    "abstract": "We propose a scheme for universal quantum computing based on Kramers rare-earth ions. Their nuclear spins in the presence of a Zeeman-split electronic crystal field ground state act as 'passive' qubits which store quantum information. The qubits can be activated optically by fast coherent transitions to excited crystal field states with a magnetic moment. The dipole interaction between these states is used to implement CNOT gates. We compare our proposal with a similar one based on phosphorus donor atoms in silicon and discuss the significantly improved CNOT gate time as compared to rare-earth implementations via the slower dipole blockade.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "Rare-earth (RE) ions embedded in an insulating solidstate matrix provide an interesting platform for quantum information processing. The nuclear spins and the electronic crystal field (CF) levels of RE ions can be used to store and manipulate quantum states. Because of the long coherence times of the quantum states of RE ions, they are well suited for the implementation of qubits. Dephasing times ranging from 100 μs for electronic transitions between CF states [1] to 1.3 s for nuclear transitions [2], and even up to six hours by employing dynamical decoupling [3] have recently been demonstrated.",
                "Furthermore, the possibility to read out single spin states has been demonstrated using detection of photons emitted from yttrium aluminum garnet [4,5], yttrium orthovanadate [6], and yttrium orthosilicate [7][8][9]. Some RE ions exhibit CF transitions in the frequency range used in telecommunications, which makes them well suited as quantum repeaters [10,11].",
                "Previous schemes for quantum computing with RE ions proposed to use electric dipolar interactions of CF states, suggesting to realize a controlled NOT (CNOT) gate via an indirect dipole blockade [12][13][14]. In that scheme, the dipole field from the control qubit shifts the transition frequencies of the target qubit. This is exploited to implement a CNOT gate with a sequence of pulses, which is effective only if the control bit is in the logical 1 state.",
                "Here instead we propose a faster two-qubit gate based on the magnetic dipole interaction, which is inspired by Ref. [15] and has some similarity to hybrid electron and nuclear spin schemes for nitrogen-vacancy centers in diamond [16]. In Fig. 1 we show the basic principle, and the underpinning hierarchy of relevant energy scales is presented in Fig. 2. By making use of the nontrivial unitary evolution of the active qubits under this Hamiltonian (i.e., a state-dependent phase accumulation), the full interaction strength can be exploited to execute the gate. For qubits spaced by more than of the order of 1 nm, the gate time is reduced by up to two orders of magnitude as compared with the dipole-blockade scheme. In contrast to the dipole-blockade gate, this faster gate that couples qubits at longer ranges requires a precise knowledge of the dipolar interaction strength.",
                "Our quantum computing scheme shares several features with that proposed by Hill et al. [15] for phosphorus donors in silicon. As in that proposal, we use nuclear spins as passive qubits, dipole-coupled active qubits, and essentially the same CNOT implementation. However, our scheme has substantial advantages in speed (a factor of 600 faster for single-qubit gates), interaction strength, and simplicity. There are also schemes that use electric dipolar interactions, e.g., between phosphorus donors in silicon; The passive (memory) qubit consists of nuclear degrees of freedom in the presence of polarized electronic RE spins. Even though the electronic spins create substantial internal fields, they are much smaller than the external field, such that the electronic system remains in its gapped, fully polarized ground state and spin flips are suppressed. The nuclear qubits can be selectively activated by optical excitation to a (locally tunable) electronic CF doublet with a large magnetic moment. Two activated qubits communicate via the electronic (magnetic) dipolar interaction, allowing for fast two-qubit gates over distances of several 10 nm, as long as the dipolar interaction is sufficiently strong as compared with the inverse lifetime of the active qubits. This enables gates between non-nearest neighbors. cf. Ref. [17]. While similar concepts could be implemented with RE ions, we do not pursue this route here.",
                "The paper is organized as follows. In Sec. II we propose our RE-based qubits and discuss necessary and desirable CF properties of their host material. We describe how to carry out fast single-qubit gates in Sec. III. In Sec. IV we present the core idea: the implementation of a CNOT gate between RE qubits via magnetic dipolar interactions. A discussion of the DiVincenzo criteria for quantum computing [18], in particular the stability of the qubits that are not directly addressed in one-and two-qubit operations as well as the selective addressability of individual qubits, is given in Appendix C. We compare our scheme with the CNOT implementation via the dipole blockade and to the Si:P proposal of Hill et al. [15] in Sec. V. Finally, Sec. VI contains a case study of erbium-doped Y 2 SiO 5 as a promising material for implementing our ideas, and in Sec. VII we summarize the main results."
            ],
            "subsections": []
        },
        {
            "title": "A. Hamiltonian",
            "paragraphs": [
                "To realize qubits, we use the hyperfine states of single FIG. 2. The optimal level scheme of a Kramers RE ion in a CF field, showing the energy scales governing Hamiltonian (1). We use the ground state and one excited spin-orbit manifold, requiring the lowest-lying states of both manifolds to be CF doublets with different anisotropy directions, which we then Zeeman split with an external field. From the ground state doublet we only need the lower Zeeman state. The coupling to a nuclear spin with I = 1/2 splits the electronic states into pairs of hyperfine states, where the nuclear spins are either aligned or antialigned with the electronic spin. The spatial density of the RE ions is adjusted such that the dipolar interactions J dip have by far the smallest energy scale (apart from the nuclear Zeeman energy). An analogous bound applies to the operation temperature T.",
                "Kramers RE ions, i.e., ions with an odd number of electrons and thus halfinteger total angular momentum J , in a solid-state matrix and subjected to an external magnetic field. The effect of the crystal environment on the RE ions is captured by the CF potential [19,20]. It breaks the spherical symmetry of the isolated ion and splits its (2J + 1)-fold degenerate J manifold into CF levels, whose degeneracy and magnetic properties depend on the point symmetry of the RE site in the crystal. The splitting between different J manifolds is governed by Hund's rules and is typically very large, J /h ∼ 100 THz. Within a given J manifold, the single-ion Hamiltonian consists of the CF potential (H CF ), Zeeman terms (H Z,e + H Z,n ) in the presence of an external magnetic field B, and the hyperfine interaction (H HF ) between the electronic spin, J , and the nuclear spin, I ,",
                "In Fig. 2 we illustrate the hierarchy of the terms in Hamiltonian (1) of the ideal qubit setup. The CF potential V CF ( J ) induces the largest splitting within a given J manifold, typically of the order of hundreds of gigahertz up to several terahertz. The electronic Zeeman term with the Landé factor g J lifts the degeneracy of time-reversal-symmetryprotected Kramers doublets. It induces a splitting linear in the field, of the order of about 2μ B /h ≈ 30 GHz/T. These two terms determine the electronic level structure, which we use to coherently manipulate the electronic wavefunctions of the RE ions. The hyperfine interactions with the nuclear spin I are usually well captured by a contact interaction of the form J • I with the hyperfine constant A J ; typically, A J /h is of the order of gigahertz. This interaction is used to transfer quantum information from nuclear to electronic degrees of freedom, and back. Since the hyperfine interaction is much smaller than the electronic Zeeman splitting, its main effect is to (anti)align the nuclear spins with the polarized magnetic moments of the electronic doublet states. In the theoretical discussion of this paper, for simplicity, we assume the nuclear spin to be I = 1/2, but similar reasonings and results apply to larger nuclear spins, for example, in the showcase material Er 3+ :Y 2 SiO 5 with I = 7/2.",
                "The last relevant energy scale is the (magnetic) dipole interaction between RE ions. We make use of the interaction between excited electronic states to build a gate between two qubits located at a finite spatial distance. A system of two active qubits is governed by two single-ion Hamiltonians as in Eq. ( 1), and by the magnetic dipolar interaction between the RE electrons",
                "with the dipolar coupling",
                "Here the superscripts 1 and 2 label the two RE ions, while r 12,α (α = x, y, z) are the Cartesian components of the vector r 12 connecting the locations of the two qubits in the lattice. In the following, we always assume the dipole interaction to be much smaller than the hyperfine splitting, which is the case for qubit distances exceeding r",
                "Because of the tiny nuclear moment μ N , the nuclear Zeeman term and dipolar interactions involving nuclear spins have much smaller energy scales. For our scheme, the Zeeman term only plays an indirect role, insofar as it increases the fidelity of our two-qubit gate by tuning off resonance a class of undesired higher-order spin-flip processes that could occur while carrying out the gate operation. The effects of dipolar interactions between electronic and nuclear spins is analyzed in Appendix C 3, where we conclude that they are negligible. The purely nuclear dipole interactions create entanglement between the nuclear spin qubits on a timescale corresponding to (μ B /μ N ) 2 ∼ 10 6 two-qubit operations, which constitutes an intrinsic decoherence time of the qubits."
            ],
            "subsections": []
        },
        {
            "title": "B. Active and passive qubits: an ideal RE system",
            "paragraphs": [
                "The optimal CF level structure for our qubit scheme is shown in Fig. 2. The level and qubit structure is chosen such as to maximize life and coherence times, while minimizing single-qubit and two-qubit gate times.",
                "To achieve long coherence times, we store the quantum information in the nuclear spin states (|+ n , |n ) on Kramers RE ions, whose electron shell is in its ground state. These nuclear states serve as memory or \"passive\" qubits. We denote their states as |0 pas and |1 pas , respectively. Given the small magnetic moments of the nuclear spins, they hardly interact with each other. Moreover, they couple to phonons only very weakly (indirectly via the electrons), so their coherence time is much larger than that of electronic states. Coherence times of such hyperfine states of up to six hours have been measured in RE systems [3].",
                "For the electronic dipolar interaction (2) not to entangle the passive qubits, we require a nondegenerate electronic ground state |GS e [21], which is achieved by polarizing electronic doublets with a magnetic field. We further assume that all RE ions can be cooled efficiently (e.g., by pumping schemes involving higher excited CF states, as demonstrated in Refs. [2,6,22,23]) to occupy that state. Because of the relative smallness of the dipolar interaction compared with the Zeeman splitting (provided that the RE ions are far enough apart in the host medium, J dip /(μ B B) ∼ 10 -6 for distances r = 10 nm and B = 1 T), we can neglect dipole-induced spin-flip terms in the electronic ground state. This effectively \"switches off\" the electronic interaction between the passive qubits [24].",
                "Since the passive qubits are well protected on the timescales discussed above, their quantum information needs to be transferred to \"active\" qubits before one can implement efficient quantum gates on them. A natural candidate for an active qubit is a doublet of excited CF states, which we denote by |↑ e ,|↓ e . In general, these have sizable magnetic moments of a few μ B , which allow them to interact with other active qubits through dipolar coupling. The hyperfine interaction with the nuclear spin splits each of these CF states into a pair of hyperfine states, similarly as in the passive ground state. One level of either hyperfine pair is selected to represent one of the two active qubit states |0 act and |1 act . To limit decay processes, it is best to choose the qubit state |0 act as the lowest of the four hyperfine states. This leaves us with two choices of how to assign the other qubit state |1 act to either of the two hyperfine levels of the higher-lying Zeeman state. Accordingly, we distinguish between an electronuclear qubit and a purely electronic qubit, respectively, referring to the degrees of freedom in which the two qubit states differ; see Fig. 3. The choice of the optimal active qubit with respect to the CNOT gate fidelity is discussed in Sec. IV.",
                "It is advantageous to further require that the doublets of electronic ground and excited states come with different g-factor anisotropy and therefore favor different magnetization directions. This excludes implementations with cubic point symmetries at the RE site. The different anisotropies help to reduce the single-qubit gate time by allowing for an efficient implementation of nuclear spin flips in the ground state by driving optical transitions via the excited doublet states since there is significant overlap between all nuclear spin states in the ground and excited doublets. Vastly different anisotropies are unusual, and a vanishing perpendicular g factor g ⊥ [25] requires special symmetries at the RE sites: tetragonal symmetry with J = 3/2, or trigonal or hexagonal symmetry with J > 1/2; see Table I in Appendix D for more details on the symmetry constraints. Nonetheless, as long as the anisotropies of the ground and excited state doublets differ sufficiently, one can carry out fast single-qubit gates.",
                "Finite perpendicular g factors cannot occur for non-Kramers doublets. Thus, it is impossible to obtain nonparallel magnetization directions for different doublets in these systems [26]. We therefore restrict ourselves to Kramers ions. To electrically gate such Kramers ions, as discussed in the Appendix C2, one needs a material where the RE site does not contain an inversion symmetry such that all CF states have a finite electrical dipole moment [27].",
                "To achieve long lifetimes of the active qubits, the active excited doublet should be the lowest CF level of a higherlying J manifold, whose gap to lower J manifolds is significantly larger than the Debye frequency. Under these conditions, the active qubit state |0 act can only decay via multiphonon emission or slow photon emission [28]. The decay rate of the excited Zeeman state due to phonon emission is generally very small as well, since the Debye density of states at the frequency of the Zeeman splitting is tiny. Indeed, lifetimes as long as 60 s have been reported, e.g., in (the ground state doublet of) erbium-doped Y 2 SiO 5 [29].",
                "To activate qubits (i.e., to transfer the quantum wavefunction from a nuclear spin to electronic degrees of freedom), one can use laser pulses that are resonant with specific transitions in the level scheme shown in Fig. 3. By coupling to the transition dipole moments between CF states, one can coherently manipulate their populations via Rabi oscillations, as demonstrated, for example, in Refs. [1,2,30,31]."
            ],
            "subsections": []
        },
        {
            "title": "A. Implementation of single-qubit gates",
            "paragraphs": [
                "Single-qubit gates on passive qubits could be implemented by coupling directly to the nuclear spins with microwaves, which drive Rabi oscillations within the pair of hyperfine states constituting the passive qubit. However, this has the severe drawback that the coupling to the nuclear moment is very weak, which implies very long gate times of the order of t ∼ /(μ N B ac ) = 21 μs (for an amplitude of the driving field of B ac = 1mT). Similar qubit proposals based on phosphorus donors in silicon as in Refs. [15,32] suffer from this problem [33].",
                "Here we present a much faster alternative, which takes advantage of the nonparallel magnetic polarizations in ground and excited electronic doublet states. The latter implies that the nuclear spin is not conserved upon switching between ground and excited electronic states. This allows us to drive transitions between the passive qubit levels by passing via excited doublet states, which merely requires coupling to the electronic degrees of freedom. For example, an X gate, i.e., a logical spin flip, is achieved with three consecutive laser pulses, as sketched in Fig. 4. In this scheme, the gate time is limited by the inverse of the electronic matrix elements, which are typically much larger than the Zeeman coupling to the nuclear moments.",
                "The speedup of this method depends on selection rules, which involve the value of J in the ground and excited doublet states. The largest speedup is achieved if magnetic dipole transitions are allowed between the ground and excited J manifolds, i.e., if J = 0, ±1 [34]. As compared with the direct manipulation of the nuclear spin, one achieves speedup by a factor of the order of μ B /(3μ N ) = 600 [35]. The corresponding gate time is of the order of FIG. 4. Implementation of a fast X gate via an excited state. The blue arrows denote π pulses that switch the population of the states they connect. The pulses are applied in the order of the indicated numbers. The differing g-factor anisotropies in the ground and excited doublets ensure sizable matrix elements for all three transitions. t ∼ 3 /(μ B B ac ) = 35 ns for an amplitude of the laser field of B ac = 1 mT. This concept of nonparallel g factors in different CF doublets has been used in, e.g., Refs. [1,2,30] in order to measure spin-echo coherence times."
            ],
            "subsections": []
        },
        {
            "title": "A. Implementation of a CNOT gate",
            "paragraphs": [
                "To achieve universal quantum computing, one needs gates that entangle two qubits [18,36]. We show here an implementation of a logical CNOT gate that follows a similar scheme proposed in Refs. [15,32]. The CNOT gate flips the target qubit if and only if the control qubit is in state |1 .",
                "Before carrying out a two-qubit gate operation, we need to activate the two passive qubits by two π pulses, as illustrated in Fig. 3. Since the pair of active moments is no longer fully polarized (unlike in the passive ground state) but in a superposition of different polarization states, the dipolar interaction entangles the qubits by inducing a configuration-dependent phase. In order to avoid resonances due to flip-flops, i.e., the simultaneous flipping of (electronic and/or nuclear) spins on both RE ions, both active qubits are chosen of the same type ('electronuclear', or, for g ⊥ = 0, 'electronic'); see Fig. 5 and the next subsection.",
                "Upon projection onto the active qubit subspace, the dipole interaction between two active qubits reduces to an Ising-like interaction",
                "σ (1)  z σ (2)   z ≡ J dip σ (1)  z σ (2)  z ,",
                "where m denotes the direction of the magnetic moment in the excited doublet and σ z is the Pauli matrix acting in the eigenbasis of an active qubit. The small corrections due We use here the same level structure as for the excited doublet in Fig. 3, with the indices 1 and 2 labeling the two ions on which the CNOT gate acts. The red arrows denote the electronuclear and electronic \"spin flip-flop\" matrix elements for (a) and (b), respectively. Such a simultaneous swap of both RE qubits is exactly resonant. The blue and green arrows in (b) denote the nuclear and electronuclear flipflops, respectively, which are nearly resonant up to the nuclear Zeeman energy. These processes limit the fidelity of the CNOT gate in the most favorable case of active qubits with g ⊥ = 0, for which the electronic qubit (b) minimizes the gate error. In most host materials g ⊥ is nonzero and the electronuclear qubit (a) should be used.",
                "to transverse interaction terms are addressed in the next subsection.",
                "Using the Ising interaction (4) in conjunction with single-qubit gates, one can implement a CNOT gate on two active qubits as [37] CNOT",
                "Here",
                "z is implemented by unitary time evolution under the Ising interaction for a time t CNOT = π/(4J dip ), which is approximately the gate time of the two-qubit gate. However, the full Hamiltonian (2) does not only consist of this Ising interaction, but contains additional terms, namely the single-ion Zeeman and hyperfine interactions in Eq. ( 1) as well as those two-qubit interactions that are non-Ising. Even with such terms present, we can reproduce an effective C(π/2) operation by eliminating their effect with a spin echo, namely,",
                "Here it is assumed that the X gates are much faster than t CNOT and thus can be approximated as instantaneous. After completing a CNOT operation, the quantum information is transferred from active back to passive qubits, analogous to the activation.",
                "Note that the interaction of active qubits with all other (passive) qubits is small: because of the applied spin echo in the scheme above, the longitudinal part of the dipolar field (with respect to m) created by passive qubits cancels out for the active qubit. The dephasing effect of the transverse part is negligible since the dipolar interaction is much smaller than the Zeeman energy, as discussed in more detail in Appendix C 3. As a consequence, the activated qubits effectively only talk to each other."
            ],
            "subsections": []
        },
        {
            "title": "B. Fidelity of the CNOT gate",
            "paragraphs": [
                "Let us consider the fidelity of our CNOT implementation. So far we have neglected the transverse (non-Ising) parts of the hyperfine and dipolar interactions, that is, those terms that flip one or both (electronic or nuclear) spins within the excited doublet states. This is motivated by the fact that if we choose to use active electronuclear qubits (and also for electronic qubits, if we assume that g ⊥ = 0), spinflip terms appear only in higher-order perturbation theory in the transverse terms in Hamiltonian (2). Nevertheless, such transverse perturbations can become important if they connect states that are close in energy.",
                "In order to minimize the number of such resonant matrix elements, one should realize the active qubits of the same type (\"electronic\" or \"electronuclear\") on the two concerned ions; see Fig. 5. Indeed, this leaves only one residual resonant process that has an initial state in the twoqubit subspace. The optimal choice, as well as the resulting fidelity, depend on whether or not the transverse g factor of the excited doublet vanishes. If g ⊥ = 0, there are no residual interactions that act directly within the excited doublet. Any non-Ising matrix elements are thus due to tunneling through intermediate, higher-lying CF states. This reduces the magnitude of residual matrix elements and therefore leads to a high fidelity of our CNOT implementation. Typically, the electronic active qubit is the better choice in this case. The intrinsic gate error due to the non-Ising terms is then limited by the off-resonant nuclear or electronuclear \"spin flip-flops\"; see Fig. 5(b). It can be estimated to be negligibly small, 1 -F min ∼ 10 -14 for a distance of r = 10 nm between the qubits, as we show in detail in Appendix B 3.",
                "In the case of a finite g ⊥ , the purely electronic active qubit is ruled out, since the transverse part of the dipole interaction mediates a resonant electronic flip-flop process with matrix element V ∝ (g ⊥ /g )J dip , which leads to a substantial gate error 1 -",
                ". However, the electronuclear qubit is still viable. The gate error due to the residual interactions can then be estimated to be 1 -F min ∼ 10 -5 for a distance of r = 10 nm between the qubits; see Appendix B 3. While this is substantially smaller than the intrinsic fidelity for the case g ⊥ = 0, it is still reasonably small.",
                "Since the spin-flip errors are rather small, the two most important error sources in an experimental setting are most likely rather (i) the coherence time (T 2 ) of active qubits, and (ii) the finite time (t act ) to activate the qubits and for the spin-echo pulse. These impose a lower bound on the typical error",
                "with the two-qubit gate time t CNOT . Both t act and t CNOT , and thus both of these lower bounds, can be tuned within some range by the angle of the applied magnetic field. On the one hand, the orientation of the field determines the overlap between nuclear spin states in the active and passive qubits and thereby the single-qubit gate time. On the other hand, the field direction also determines the magnetic moment μ m of the Zeeman-split active qubit states, 2μ 2 , and thereby affects the dipolar interaction strength and thus the two-qubit gate time. The orientation of the magnetic field should be chosen such as to minimize these errors."
            ],
            "subsections": []
        },
        {
            "title": "A. Comparison with CNOT implementation via dipole blockade",
            "paragraphs": [
                "We now compare our scheme with alternative implementations of CNOT gates with dipole-coupled RE ions. References [12][13][14] proposed to use the so-called dipole blockade. Here the qubits consist either of two electronic CF states or of two hyperfine levels of a single electronic level. An auxiliary state, to which one qubit state can be excited, is needed as well. All these states interact via their magnetic or electronic dipole moments. For RE ions, magnetic and electric dipolar interactions are usually of similar strength, since the electric dipole moments are typically very small, while typical magnetic moments are fairly large.",
                "The dipole blockade works as follows. If the control qubit is in state |0 , it is transferred to an excited state with different dipole moment. Through its dipolar interaction with the target qubit, the level structure of the latter is changed. Now a sequence of three pulses, whose frequencies match the unmodified level structure of the target qubit, is applied. This swaps states |0 and |1 of the target qubit, but only if the control qubit is left in state |1 , since the pulse sequence is off-resonant if the control qubit is excited; see Fig. 6. After this conditional swap, the control qubit is brought back to its initial state.",
                "Such a dipole blockade could also be implemented with our magnetic states, and it is thus interesting to compare it with our proposed scheme. We consider the regime FIG. 6. Pulse sequence for the dipole-blockade scheme. If the control qubit is in state |0 , it is excited, which shifts the levels of the target qubit out of resonance with the swapping pulses. A swap is thus only carried out if the control qubit is in state |1 . The indices \"ctrl\" and \"tar\" denote the control and target qubits, respectively.",
                "where the dipolar interaction is much smaller than the experimentally achievable Rabi frequencies, such that our scheme can be applied (while in the opposite limit only the dipole blockade can be used). This is the regime of qubit distances beyond r [μ 0 μ B /(4π B ac )] 1/3 ≈ 1 nm (with B ac = 1 mT). Here our CNOT implementation is significantly faster, since, being based on the state-dependent phase accumulation, it makes use of the full interaction strength between two RE ions, achieving a gate time equal to t CNOT ≈ π/(4J dip ). Thereby the interaction strength needs to be known precisely, and the gate duration has to be adjusted accordingly. The dipole blockade instead relies on the ability to resolve the frequency shift induced by the dipole interaction. This requires Rabi frequencies smaller than the interaction strength and consequently gate times that are substantially longer than in our scheme. We estimate the gate time of the dipole blockade in Appendix A by minimizing the π -pulse duration for a fixed fidelity goal. We numerically evaluated the unitary time evolution in the rotating-wave approximation and optimized with respect to both the pulse cutoff T cut and the Gaussian pulse width T, such that, for all detunings larger than J dip , the gate error is below a threshold value 1 -F. Like for our direct gate, the gate time of the dipole blockade is proportional to /J dip , but, in addition, it grows logarithmically with the desired gate fidelity; see Fig. 7. Therefore, if one requires gate errors to be less than 10 -4 , the indirect dipole blockade is a factor of roughly 50 slower than our gate.",
                "In Fig. 7 we show that the minimal gate time required in the dipole blockade increases monotonically with the required fidelity, but does so in an oscillatory manner. This originates from Rabi-like oscillations of the (unwanted) transition probability, which in turn result from the nonadiabatic switching on and off of the pulses at t = ±T cut ; see Appendix A for a detailed calculation. Viewing the fidelity as a function of the π -pulse duration T π = 2T cut , the local maxima of the fidelity are spaced by T π = 4π/ ω dip .  CNOT implementation is reduced as compared with that of a dipole-blockade scheme carried out with Gaussian pulses (assuming that the dipolar interaction is smaller than the hyperfine splitting and the largest achievable Rabi frequencies). The speedup increases logarithmically with the maximally admissible gate error 1 -F that we assume to be given by the probability of a nonresonant excitation (rather than by the decoherence time of the qubits). The oscillatory behavior traces back to Rabi oscillations in the unwanted transition probability.",
                "We note that a CNOT gate speedup implies that the gate error due to the finite decoherence time in Eq. ( 7) is smaller by the same factor in our scheme as compared with the dipole blockade. This allows for the entanglement of qubits at longer distances with better (coherence-limited) fidelity in our scheme. On the other hand, the dipole blockade has the advantage that it can also be used in the regime where the dipolar interaction is larger than the hyperfine splitting. Thus, for very close-by qubits (r 1 nm), the dipole blockade is the faster gate. If such neighbors could be addressed individually (by magnetic adatoms or gating) in an experimental setting, an approach that combines dipole blockade and the scheme presented here might be used to entangle close and distant pairs of qubits, respectively.",
                "Note that the dipole blockade does not require precise knowledge of the dipolar interaction strength, as long as it is large enough. In contrast, our two-qubit gate does require that knowledge. This is, however, not a substantial drawback, since the interaction depends only on the atomic positions in the crystal, which are very stable over time. It thus suffices to initially characterize the interactions with a precision higher than the desired gate fidelity, so as to ensure precise gates with well-timed pulse sequences."
            ],
            "subsections": []
        },
        {
            "title": "B. Comparison with implementation with phosphorus donors in silicon",
            "paragraphs": [
                "Our scheme resembles in several aspects that proposed for phosphorus donors in Ref. [15], where the nuclear spins of 31 P + are used to store quantum information. In contrast to our scheme, the donors have no electronic spin. Instead, they are tunnel coupled to single-electron transistor structures. By gating these, an extra electron is loaded into a spin-down state onto the donor. This operation is equivalent to our gate tuning the RE qubits by a local Stark shift, which singles out the qubits that are later selectively addressed. In the proposal of Ref. [15], resonant microwave pulses then transfer the stored quantum information from the nuclear spins to the electronic states. This is the analog of the activation step of our electronic qubits. Two active qubits interact by dipolar interactions, and the CNOT gate is realized in a similar way as we discuss in this paper. In comparison with donors in silicon, our scheme has several advantages. (i) The magnetic moment of (effective) RE spins are much larger (typically, by a factor of 5-7) than those of single electrons. This allows for a much shorter two-qubit gate time, which is inversely proportional to the square of the magnetic moment entering the dipole interaction. (ii) Our single-qubit gate time is up to approximately 600 times faster since we can make use of the hyperfine interaction and manipulate the nuclear spin states via electronic transitions instead of coupling electromagnetic pulses directly to the nuclear spins. (iii) The qubit activation in our scheme is simpler and does not involve a charge transfer over interatomic distances (with associated dipole moments and the danger of exciting the lattice). This is likely to reduce the activation error."
            ],
            "subsections": []
        },
        {
            "title": "VI. CASE STUDY OF Er 3+ :Y 2 SiO 5",
            "paragraphs": [
                "To illustrate our scheme and the main ideas of this paper, we discuss a specific RE material: 167 Er-doped Y 2 SiO 5 , 167 Er 3+ being a Kramers ion with nuclear spin I = 7/2. There are two inequivalent Er sites each with C 1 symmetry. The absence of inversion symmetry allows for electrical gating of the qubits. For simplicity, we discuss only Er site 1 (using the notation of Ref. [38]). Similar results hold for site 2 as well. A detailed evaluation with all the experimentally measured parameters can be found in Appendix E.",
                "Here we summarize the main results.",
                "We choose the active qubit to be of electronuclear type, consisting of the lowest and second-highest hyperfine levels of the excited doublet, i.e., the states with nuclear spin projections -7/2 and -5/2 with respect to the polarization axis of the excited doublet. The latter is the lowest CF level in the first excited manifold J = 13/2, accessible with the convenient optical transition wavelength 1536.5 nm. The finite coherence time T 2 of the excited states has been measured to be as long as T 2 = 4.4 ms [31] for sufficiently low temperatures and large magnetic fields [39].",
                "The direction of the externally applied magnetic field is still a further parameter to tune the single-and twoqubit gate times, as discussed in Sec. IV B. We optimize it numerically in order to achieve the best two-qubit fidelities for qubit spacings r = 10 nm. This leads to a coherencetime-limited gate fidelity of the CNOT implementation, with F min ≈ 99.9% and a total gate time of 4.2 μs. A fidelity of above 99% can be achieved for a range of qubit distances r, which allows us to directly entangle qubits beyond the nearest-neighbor distance.",
                "This theoretical fidelity is already above the threshold for quantum error correction. If even higher fidelities are desired, faster single-qubit gates (stronger pulses) and/or longer decoherence times are needed. To improve the latter, one could try to decouple the electronic spins from the surrounding nuclear spins sitting on other (non-RE) atoms. This can be achieved via dynamical decoupling and/or by choosing a host material where the non-RE ions have smaller or even vanishing magnetic moments.",
                "The above fidelity estimation shows that Y 2 SiO 5 is a very good host system. It might also be an interesting candidate when doped with other RE ions such as Nd 3+ [40] or Yb 3+ [41]. Another interesting host system to explore is isotopically enriched silicon, where decoherence due to nuclear spins is minimized. However, for that material, we currently do not have precise g-tensor values and coherence time measurements."
            ],
            "subsections": []
        },
        {
            "title": "VII. CONCLUSION",
            "paragraphs": [
                "In this paper we have proposed an implementation of qubits using RE ions subject to a CF and hyperfine coupling. Our scheme constitutes a promising platform for universal quantum computing. We use nearly decoupled passive (memory) qubits and transfer them to less protected active qubits only when they are involved in a twoqubit gate. The passive qubits are well-protected nuclear spin states serving as quantum memory. The active qubit states are magnetized electronic states that can interact over relatively long distances.",
                "The central idea of this paper is to implement a CNOT gate based on the phase accumulation due to the Ising-like dipole interaction between two active qubits. This achieves a speedup by up to two orders of magnitude as compared with the standard dipole blockade, in the regime where dipolar interactions are weak as compared with typical optical Rabi frequencies and the hyperfine splitting (i.e., for qubits spaced by more than of the order of 1 nm).",
                "The level scheme of a single ion (illustrated in Fig. 2) should have the following essential ingredients: (i) a Zeeman-split magnetic ground state; (ii) a nuclear spin and strong hyperfine interactions; (iii) a doublet state at the bottom of an excited J manifold, having a magnetic anisotropy differing from that of the ground state. The last requirement can only be met with Kramers RE ions with noncubic point symmetry groups. Our estimation of gate errors due to residual (non-Ising) interactions suggest that typically the two-qubit gate fidelity is limited by the coherence time T 2 of the active qubit. Using a crystal where the RE site has no inversion symmetry generally allows for electrical gating of the qubits and thereby assures that individual qubits can be addressed selectively.",
                "As a concrete example and illustration of our scheme, we have discussed the case of Er-doped Y 2 SiO 5 . However, the scheme proposed here equally applies to molecular magnets and crystals hosting transition metal ions, as long as they generate a CF level structure that matches the above three criteria. Given the possibilities offered by isotope enrichment and semiconductor processing, we believe silicon doped with RE ions [42,43] to be a very promising platform.",
                "In summary, we propose the implementation of RE qubits with coupled electronuclear degrees of freedom and fast single-qubit and CNOT gates that can entangle not only nearest neighbors, but also relatively distant qubits in an array. Combined with the readout capability of single ions and the possibility of coupling RE ions to optical modes, networks of such ions are promising candidates for scalable quantum computing."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX A: COMPARING DIRECT DIPOLE INTERACTION VERSUS DIPOLE BLOCKADE AS CNOT IMPLEMENTATIONS",
            "paragraphs": [
                "We compare the CNOT gate time of our implementation with the gate time of the dipole blockade as explained in Sec. V A of the main text; see Fig. 6 therein.",
                "First let us discuss the magnitudes of the magnetic and electric dipolar interactions. As mentioned in the main text, the 4f configurations of RE ions have fairly small electric dipole moments. On the other hand, one can have large magnetic moments that compensate for the weaker magnetic interaction. As a consequence, it turns out that the magnetic and electric dipole interactions are typically comparable in magnitude. For example, in the material Eu 3+ :Y 2 SiO 5 , proposed in Ref. [14] as a candidate material for quantum computing, the electric dipole moments of ground and excited manifolds differ by μ e = 7.7 × 10 -32 C m. Typical (differences of) dipole moments are smaller than this value, but of a similar order of magnitude. A magnetic moment of only μ m = 2.5μ B of the doublet states leads to the same interaction strength between the two active qubits, assuming vacuum permittivity, i.e., μ 2 e / 0 ≈ μ 2 m /μ 0 . For a distance r 12 = 10 nm between qubits 1 and 2, the electric dipole shift between RE ions is ω dip ∼ ( μ e ) 2 /(4 0 π r 3  12 ). This evaluates to ω dip = 2π × 80 kHz/[(r 12 /10 nm) 3 ], which is much smaller than the typical hyperfine splittings of RE ions. It is also much smaller than the highest experimentally achievable Rabi frequencies for electric dipole transitions. This implies that it is the smallness of the dipolar shift in the spectrum that limits the gating time. Indeed, if the swapping operation on the target qubit is to take place only if the control qubit is in state |1 , the Rabi frequency of the three pulses used to swap the target qubit must be significantly smaller than the dipolar shift. In our implementation, the gating time is instead limited by the time evolution under the magnetic dipole interaction, leading to a gate time of t CNOT ≈ π/(4J dip ), where the dipolar interaction strength is comparable with the dipole energy shift above ω dip ∼ J dip / . The advantage of our scheme is that the system entanglement follows directly from the dynamics governed by this Hamiltonian. Below we estimate the speedup of our implementation compared with the dipole-blockade scheme with Gaussian pulses."
            ],
            "subsections": []
        },
        {
            "title": "Dipole blockade with Gaussian pulses",
            "paragraphs": [
                "To estimate the gate time of the dipole-blockade scheme, we use Gaussian pulses (with cutoffs), since they drive the desired transition more selectively than other pulse shapes [37]. The temporal envelope of the pulse is described by (t) = 0 e -t 2 /T 2 θ(T cut -|t|), where 0 is the Rabi frequency corresponding to the maximal amplitude at time t = 0 and T is the pulse width. The latter is not to be confused with the pulse duration equal to T π = 2T cut . Our goal is to optimize the two parameters T cut and 0 such as to minimize the π -pulse duration for a given desired CNOT gate fidelity F and dipolar frequency shift ω dip = J dip / . Note that, since the pulse should carry out a π rotation on the resonant state ( ω = 0), the pulse width T is not a free parameter, but depends on T cut and 0 , as shown below.",
                "For simplicity, we consider a two-level system, with one state being the addressed qubit state and the other state being the excited ancillary state. The unaddressed qubit state as well as all other CF states are neglected, as they are assumed to be far off resonance. The Hamiltonian of this two-level system in the rotating frame of the pulse frequency and with the rotating-wave approximation is [44] ",
                "where ω is the detuning between the transition and pulse frequencies. In the dipole-blockade scheme ω corresponds to the dipolar interaction ω/2 = J dip / . We first derive the pulse width T as a function of 0 and T cut . The Gaussian pulse should carry out a π rotation on the resonant state ( ω = 0). Because Hamiltonian (A1) commutes with itself at different times for ω = 0, the pulse width is determined from the condition on the action integral",
                "where erf(x) = (π ) -1/2 x -x dt e -t 2 denotes the error function.",
                "We minimize the π -pulse duration T π = 2T cut numerically by simulating the unitary time evolution with Hamiltonian (A1) for fixed 0 and varying T cut and ω. We then determine the minimal pulse duration T π as follows. For each T cut , we find the smallest detuning ω such that, for all larger detunings, the gate error is below some desired threshold. From this we deduce the minimal T cut in units of 1/ ω. The result is shown in Fig. 8, where we plot the maximal error 1 -F π of the optimized pulse as a function of its duration. For truncated Gaussian pulses, we find that T π grows logarithmically with (1 -F π ) -1 and exhibits 4π/ ω periodic oscillations in log(1 -F π ).",
                "To understand this result, we use first-order timedependent perturbation theory and estimate the small spinflip probability on a state with given detuning ω. For the following calculations, we assume a large detuning ω 0 , as otherwise the spin-flip probability is nonnegligible. Using the interaction picture formalism, the time-evolution operator is expressed as",
                "First-order pert. theory First-order pert. theory (fit) Full unitary evolution Full unitary evolution (fit)  ",
                "where T is the time-ordering operator. The second term in the last line (as well as the neglected higher-order terms) are expected to be small for ωT/2 1. In this limit, we can expand the error function for large absolute values of the argument and find the fidelity F π of a single π pulse as",
                "where x ≡ T cut /T and y ≡ ωT/2 are the real and imaginary parts of the argument of the error function, respectively. Our aim is to minimize the pulse time T π = 2 T cut = 4xy under the constraint of a fixed error rate 1 -F π . For the optimal pulse, x and y will both be large and relatively close to each other. Thus, due to the exponential factors in Eq. (A4), x and y scale to leading order with the large parameter ",
                "to leading order in S. The gate time follows as",
                "With this we reproduce the aforementioned scaling T π ∼ 2 log[1/(1 -F π )]. Now α + β has to be minimized subject to constraint (A5), which yields a term that periodically oscillates with log[1/(1 -F π )]. This reflects Rabilike oscillations of the transition probability as T cut ω increases by multiples of 2π , which results in oscillations with 4π/ ω periodicity in T π . The numerically evaluated maximal gate error as a function of the pulse time is shown in Fig. 8 for both the first-order expression (A3) and the full unitary time evolution. The first-order result exhibits the expected slope",
                "We demonstrate this by fitting a curve of the following form to the numerical result:",
                "We find that a = 1.06, which agrees very well with the analytical result (A6). The result of the full time evolution shows the same functional behavior with 1 -F π , albeit with a = 1.51 and a different value of b. An oscillatory behavior with 4π/ ω is still present. Finally, we estimate the total gate time of the dipoleblockade scheme for the pulse sequence in Fig. 6 of the main text. Only the pulses on the target qubit are taken into account since their durations are limited by the small dipole interaction strength. Using our approximation of the single π pulses in Eq. (A7), the minimal gate time t db CNOT of the dipole-blockade scheme divided by the gate time",
                "In conclusion, we find that the CNOT implementation via dipole blockade is a factor of 25 slower than our implementation for a desired fidelity of F = 99.9%, and even a factor of 75 slower for 1 -F = 10 -7 (the fidelity we estimated for our scheme in the ideal case g ⊥ = 0 in the main text). The resulting speedup calculated using the full numerical optimization is presented in Fig. 7 in the main text. Note that, for the numerical evaluation of the total gate time as a function of the targeted error rate, we take into account the fact that the duration of pulses 2 and 4 is determined by imposing half of the desired gate error, i.e., (1 -F)/2, whereas the duration of pulse 3 is adjusted such that a maximal error of 1 -F results."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX B: FIDELITIES 1. Fidelity of the single-qubit gate",
            "paragraphs": [
                "Gate fidelities F or, equivalently, the gate errors 1 -F are important because the inverse of the latter yield an estimate of how many gate operations can be carried out until quantum error correction is required. The fidelity of the proposed single-qubit gate is intrinsically limited by 1 -F t gate /T 2 due to the excited state's decoherence time T 2 and the finite single-qubit gate time t gate . Because of the long T 2 times of the excited states (up to several milliseconds) such errors are negligible for our fast single-qubit gates that last typically t gate ∼ 35 ns.",
                "A further source of gate errors is the population transfer of the addressed qubit to (or from) a nontargeted hyperfine state on the same ion. To ensure that the single-qubit operations have a high fidelity, (i) the inverse timescale for these processes, i.e., the single-qubit Rabi frequency , must be significantly smaller than the hyperfine splitting of the addressed level set and (ii) smooth, selective pulses such as (truncated) Gaussian pulses should be chosen so as to limit the range of frequencies they contain. Since the hyperfine splittings are large (of the order of gigahertz), they do not seriously limit the experimental Rabi frequencies, as discussed in more detail in the next subsection. There we also discuss further negligible sources of errors due to nuclear and electronic spin flips of nearby passive qubits during an activation pulse.",
                "Probably the most important source of single-qubit errors in our scheme is the unintended activation of nontargeted qubits. This can be prevented by a large detuning of the levels of nearby ions, which can be achieved, e.g., by locally inducing Stark shifts via electrical gating. Since such detunings are limited to moderate shifts, it is paramount to use selective pulses to minimize the errors on nontargeted qubits, while maintaining a sensible gate speed. The required detunings and electrical fields are discussed in more detail in Appendix C 2. In conclusion, we expect that sufficiently large Stark shifts can be applied, such that the single-qubit gate fidelity will not be a limiting factor for quantum computing."
            ],
            "subsections": []
        },
        {
            "title": "Fidelity of the single-qubit gate: details",
            "paragraphs": [
                "The minimal gate fidelity is defined as [45,46] ",
                "where U ideal is the unitary operator of the ideal quantum gate to be implemented, while U exp is its actual implementation.",
                "To ensure that the single-qubit operations have a high fidelity, the inverse timescale for these processes (the single-qubit Rabi frequency ) has to be significantly smaller than the hyperfine splitting of the addressed qubit. For simple square pulses, the error due to \"nearly resonant\" states with detuning ω is estimated from the theory of Rabi oscillations as of the order of ( / ω) 2 . The weak algebraic suppression in / ω is due to the sharp cutoff of a square pulse that entails a broad frequency spectrum. The selectivity of the pulses can be drastically increased (i.e., substantially suppressing errors due to detuned transitions) by choosing smoother pulses such as (cutoff) Gaussian pulses. The error of a single Gaussian π pulse is exponentially suppressed for large detuning ω ,",
                "as follows from first-order perturbation theory; cf. Eq. (A4). Note that in an experimental setting one should optimize the pulse cutoff so as to minimize the pulse duration for a given fidelity, in a similar way as discussed in Appendix A for the CNOT gate based on the dipole blockade. From Eq. (B2), it follows that, for a desired fidelity of a single π pulse, F π , and a given detuning ω, the admissible Rabi frequency is bounded from above by",
                "It follows that, for a desired single-pulse fidelity of, e.g., 1 -F π = 10 -6 , the maximally admissible Rabi frequency is / ω ≈ 0.33 (numerically one finds that / ω ≈ 0.26). This does not impose a serious restriction on the Rabi pulses. Indeed, for experimental pulses with magnetic field strengths of the order of B ac ∼ 1mT, the Rabi frequencies are of order μ B B ac / ∼ 90MHz, which is already much smaller than the hyperfine energy scale ω of the order of gigahertz. Note that the finite decoherence time of the excited state induces a Lorentzian lineshape, which entails a (weak) asymptotic tail of the pulse fidelity that scales with the inverse square of the detuning, even for Gaussian pulses. We have checked that the error due to this Lorentzian tail is negligible for the Rabi frequencies, fidelities, and coherence times (T 2 of the order of milliseconds) considered in this paper.",
                "Above we have only discussed gate errors due to undesired excitations. The laser will, however, also induce an ac Stark effect [47], which amounts to a coherent phase accumulation of the qubits. These possibly non-negligible effects have to be taken into account when carrying out multiqubit operations."
            ],
            "subsections": []
        },
        {
            "title": "Fidelity of the CNOT gate: details",
            "paragraphs": [
                "The gate fidelity of our proposed CNOT gate is discussed in the main text. Here we provide further details.",
                "The error of the CNOT implementation due to the offdiagonal matrix elements is quantified by the minimal gate fidelity Eq. (B1) and can be estimated as follows. A residual interaction connects two states with energy difference by a matrix element V, which we assume to be sufficiently small. For states with mismatch larger than the inverse gate time 1/t CNOT ∼ J dip , we assume the matrix element to be much smaller than , V",
                ". Otherwise, we assume that V J dip . In the latter case, the maximal gate error due to a single residual interaction is estimated as",
                "This decrease in fidelity is due to the resonant matrix element between the (nearly) degenerate configurations that leads to oscillations of the state population between the degenerate states during the gate time.",
                "On the other hand, if a gate error is dominated by a nonresonant process ( J dip , V), the minimal gate fidelity is approximated as",
                "This error is due to a finite admixing of a nonresonant state, which leads to an incorrect rotation within the qubit space.",
                "The decrease in gate fidelity due to any residual interaction, resonant or not, can be summarized as",
                "To optimize the gate fidelity of our CNOT implementation, we have to look at all possible spin-flip processes with the initial state in the active qubit subspace. Here we consider only processes to a final state within the excited electronic doublet space, since processes connecting to other states are detuned by the large CF splitting. Note also that only spin-flip terms mediated by the dipolar interaction lead to gate errors, whereas single-qubit terms by themselves only lead to a renormalization of the energy levels. In a given experimental setup, one should then choose the active qubit realization that minimizes the gate error",
                "where the {V α } are the residual matrix elements and the { α } are the corresponding energy mismatches. The latter typically involve the Zeeman energy or the hyperfine coupling and are thus always bigger than the dipolar interaction. The only exceptions are processes that are exactly resonant, α = 0, and, potentially, those that have a mismatch of order of the nuclear Zeeman energy E Z,n . The active qubits with the best decoherence properties are realized in an excited doublet with g ⊥ = 0. In this case there are no residual interactions that act directly within the excited doublet. Any non-Ising matrix elements are thus due to tunneling through intermediate, higher-lying CF states. This reduces the magnitude of residual matrix elements and therefore leads to a high fidelity of our CNOT implementation. The scaling of the matrix elements and therefore the dominant gate errors (assuming the hierarchy of energy scales J dip A J E Z CF ) can be deduced from perturbation theory for the electronuclear (en) and purely electronic (e) qubits as",
                "where CF is the gap to the dominantly admixed CF state.",
                "For strong dipole interactions J dip > (A 2 J / CF ), both qubit choices lead to the same gate error. On the other hand, for weaker dipole interactions J dip < (A 2 J / CF ), and if in addition A 2 J / CF < E Z,n , the purely electronic qubit is the better choice. For typical values A J /h of the order of gigahertz and CF /h ∼ 100GHz, and an applied field of B = 1 T, this is the case if the qubits are separated by distances r 1.2nm. The gate error is then limited by the off-resonant nuclear or electronuclear \"spin flip-flops.\" It can be estimated to be as small as 1 -F min ∼ 10 -14 for a distance of r = 10nm between the qubits.",
                "Let us also briefly comment on the case where the transverse g factor of the excited doublet is finite, g ⊥ > 0. We have to choose the electronuclear active qubit due to the resonant electronic spin flip-flop matrix element. Assuming a sizable CF splitting, the gate error will be dominated by a process that does not involve higher-lying CF states. It scales as",
                "For typical values of the hyperfine interaction and an applied field of B = 1 T, the gate error is dominated by the resonant electronuclear flip-flop as soon as the qubit spacing exceeds r 1.3nm (assuming that g ⊥ /g = O( 1)).",
                "The gate error due to the residual interactions can then be estimated to be 1 -F min ∼ 10 -5 for a distance of r = 10nm between the qubits."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX C: DIVINCENZO CRITERIA AND ROBUSTNESS OF NONTARGETED PASSIVE QUBITS DURING GATE OPERATIONS 1. DiVincenzo criteria",
            "paragraphs": [
                "For a system to qualify as a platform for quantum computing, the DiVincenzo criteria [18] require that the following conditions hold.",
                "(1) A scalable physical system with well-characterized qubits.-In our case the well-characterized single RE ions serve as qubits, as described in the main text. Scalability and the addressability of single qubits will be discussed in the next subsection. ( 2 gates can be implemented efficiently, as described in Sec. III. To realize a universal set of quantum gates, one needs only one entangling two-qubit gate [36]. We choose to implement the CNOT gate; see Sec. IV A. Our implementation is about two orders of magnitude faster than previously proposed implementations based on the dipole blockade. (5) A qubit-specific measurement capability.-In principle, one could measure single RE spins by detecting the emission of a photon after excitation to a high-energy manifold [4,5]. However, since singlephoton measurements have low fidelities, repeated measurements would have to be made; since the emission process destroys quantum information, this approach is not viable for our RE qubits. The readout fidelity and rate can be increased by cavity integration. Such setups have been demonstrated in, for example, Refs. [6,8,48,49]. A further possibility to read out the qubits consists in measuring the RE charge state after an optical excitation. Such single-ion measurements have been demonstrated, for example, with erbium defects in silicon [42].",
                "Another way to measure RE spins was suggested in Ref. [14]: a different RE ion nearby may serve as the readout ion. One then uses the electric (or magnetic) dipole blockade to shift the transition frequencies of the readout ion. If the qubit to be measured is in state |0 , an external laser excites the readout ion and emission can be detected. The excitation and the emission measurement can be repeated without altering the qubit information (apart from the initial wavefunction collapse that projects onto the eigenstate basis of the qubit), assuming that the excited readout ion decays back to its ground state sufficiently rapidly and that there is no component of its wavefunction that becomes entangled with the qubit ions. Alternatively, we could also perform a CNOT operation analogous to the two-qubit gate, with the qubit as the control bit and the readout ion (in its ground state) as the target bit. This allows for a faster readout than the dipoleblockade scheme, as discussed below, but it necessitates more control over the readout ion. The requirements for the readout ion are discussed in Ref. [14]. We note that this method of readout adds more complexity to the system as compared with a cavity integration and might therefore be less favorable."
            ],
            "subsections": []
        },
        {
            "title": "A scalable quantum computing scheme: addressability of selected qubits",
            "paragraphs": [
                "A key feature of any viable programmable computer, quantum or classical, is the ability to address only the desired (qu)bits during the fundamental one-and two-(qu)bit gate operations, even as we scale up the processor to handle many qubits. Below we address this issue explicitly.",
                "Our scheme implements single-qubit manipulations by resonant electromagnetic pulses. These should address one and only one qubit at a time. In general, one will spatially separate the qubits and work with dilute magnetic RE ions, using materials in which most RE sites are occupied by nonmagnetic ions, e.g., trivalent yttrium. Nevertheless, the distance between qubits will still be much smaller than the wavelength of the laser light used for the various gate operations, such that a laser cannot be focused on a single qubit [50]. Therefore, moderate dilution by nonmagnetic ions is by itself insufficient to ensure the selective addressability of single qubits. This problem can be overcome by locally altering the gap between the electronic ground state doublet and the excited state doublet of the RE ion to be addressed.",
                "Addressability by static modulation.-If scalability is not an immediate concern, but the aim is merely to selectively address and entangle a few qubits (which is sufficient, e.g., for quantum repeaters), one can achieve a spatially restricted, static modulation of qubit parameters with polarized magnetic adatoms, most easily realized by another species of RE that will be subject to the same (polarizing) external field already imposed on the qubit atoms. Similar ideas to address qubits by statically shifting transition frequencies have been proposed previously (see, e.g., Refs. [14,51,52]), where naturally occurring local strains in the material are exploited to individually address RE ions due to their shifted transition energies. This allows addressing of even single ions, as demonstrated in, e.g., Refs. [6,8,9,53,54]. Strains can also be engineered by adding adatoms, as shown in Ref. [55]. We suggest to further induce local strains or varying crystal fields by engineering the thickness of the top and bottom layers of the crystal for a two-dimensional array of qubits, as discussed below (see also Fig. 9). These methods could also be combined with the dynamic addressing based on electrical gating below.",
                "Addressability by dynamic modulation.-For a quantum computer, it is more convenient to generate the spatial modulation of transition frequencies dynamically. To achieve this, we propose to apply local electric fields by local gating. An electric field induces a Stark shift in all CF levels that have electric dipole moments. An array of gates similar to a setup proposed in Ref. [15] for phosphorus donors in silicon or in Ref. [14] for Eu ions doped into a Y 2 SiO 5 matrix allows tuning of selected RE ions into resonance with a particular laser resonance line, so as to either activate a qubit or perform selective singlequbit operations, as sketched in Fig. 9. The point groups for which the Kramers doublets always have electric dipole moments-and therefore allow for electrical gating-are highlighted in bold in Table I in Appendix D.",
                "We estimate the required electric field differences assuming that the single-qubit fidelity is limited by the activation error of the nontargeted qubits and that the CNOT gate is limited by the finite activation time. We use a truncated Gaussian pulse with the activation (or single-qubit gate) time t act ≈ 2 √ π/ act , where act is the Rabi frequency. For simplicity, we assume the same Stark detuning for all N nontargeted qubits within the laser spot size.",
                "To achieve an activation fidelity (i.e., single-qubit gate fidelity) F act , the Rabi frequency needs to be smaller than act ω St π/(2 log{N π 2 /[4(1 -F act )]}), as we show in Eq. (B3), and thus the activation time is larger than t act 2 √ π/ act . On the other hand, to achieve a CNOT fidelity F CNOT , the activation has to be faster than the bound given by the second term in Eq. (7). Combining these two restrictions, the required Stark detuning between targeted and nontargeted qubits can be estimated as",
                "We consider two levels of desired fidelities, F act = F CNOT = 99% (a lower bound required for topological error correcting codes [56]) and F act = F CNOT = 99.99%. Assuming a qubit spacing of r = 10nm and a laser spot size of approximately 1 μm 2 (i.e., N ∼ 10 4 affected qubits) with a Stark coefficient ∂ν St /∂E = 35kHz/(V/cm) as for Eu-doped Y 2 SiO 5 , this requires a difference of electric fields acting on targeted and nontargeted qubits of E = ω St /(2π∂ν St /∂E) 50-600 V/cm. Such field strengths are indeed realistic to achieve in an experimental setting.",
                "To electrically gate any selected qubit, one needs to arrange the qubits in a two-dimensional array. This can be achieved, e.g., by growing a single layer containing dilute magnetic ions on top of bulk material that contains no RE qubits, and covering it with a thin layer of magnetically inert bulk material. This could be realized, e.g., using liquid phase epitaxy [57][58][59] or pulsed laser deposition [60][61][62] with first results reviewed in Ref. [63]. Another route is to implant RE ions in silicon [64][65][66][67], which would allow us to profit from the advanced technology developed for silicon electronics [68]. Single-ion implantation with secondary electron detection for feedback enables the high-fidelity fabrication of two-dimensional arrays of implanted ions [67]. If methods are used that incorporate RE atoms with considerable positional randomness (unlike in Ref. [67]), the RE layer in Fig. 9 will need to be surveyed to identify those atoms usable for qubits and quantum gates. Approaches could include superresolution or near-field microscopy where we take advantage of the strong fluorescence of the RE ions. Voltages applied to the gating grids could tune in and tune out the fluorescence response and so locate the RE atoms with respect to the gating grids."
            ],
            "subsections": []
        },
        {
            "title": "Robustness of nontargeted passive qubits during gate operations",
            "paragraphs": [
                "While the unintended activation of nontargeted qubits can be suppressed with local detunings, we also need to consider the interactions between targeted and nontargeted qubits during (single-and two-qubit) gate operations. These induce errors that cannot be eliminated by the Stark shift above and are therefore intrinsic to our scheme. We argue below that these errors are extremely small and most likely negligible compared with other error sources.",
                "During (de)activation pulses, one potential source of error is flips of the electronic or nuclear spins of nontargeted RE ions induced by the time-varying dipolar field of the addressed RE ion. However, the dipolar fields that drive those transitions are much weaker than the fields associated with activation pulses, and thus are a subdominant source of dephasing [69]. In addition to spinflip errors, the dipolar field during the pulses results in accumulated phases on the surrounding passive qubits. This error is also negligible since the phase amounts to at most δφ ∼ J dip (μ N /μ B )(t act / ) ∼ μ 0 μ N /(4π r 3 B ac ) ∼ 5 × 10 -7 per single-qubit operation for experimental pulses B ac = 1mT and a qubit spacing of r = 10nm. These essentially random phases accumulate to an O(1) error only after approximately 1/δφ 2 ∼ 10 12 operations.",
                "The last error source that we have to consider is due to interactions between active qubits and nearby passive qubits during two-qubit gate operations where the targeted RE ions stay activated for an extended period. These interactions can be described in terms of a dipolar field that depends on the active qubit's state and acts on the passive qubits. The field can be decomposed into components parallel and transverse to the existing average local field on the passive qubit. The effect of the longitudinal part cancels out once a spin echo (within the active qubit) is applied, as is indeed the case for our CNOT scheme. However, the transverse part of the field induces a second-order correction to the level splitting, which does not reverse under the spin echo. This results in a deterministic phase accumulation in the passive qubits. The (distance-dependent) phase factor δφ for nearby ions is of order δφ ∼ A",
                "10 -8 (with r = 10nm, B = 1 T) and can theoretically be taken into account when multiqubit operations are carried out. However, it is most likely negligible compared with other error sources.",
                "The considerations above show the robustness of the passive qubits during gate operations in our proposed scheme."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX D: REQUIREMENTS ON THE CRYSTAL SYMMETRY",
            "paragraphs": [
                "Our scheme relies on the existence of magnetic doublet states with different magnetic anisotropy within the same CF environment. This enables fast single-qubit operations and qubit activation and deactivation processes. We have also shown that g ⊥ = 0 in the excited doublet is a desirable (but not necessary) property since it significantly enhances the intrinsic fidelity of our CNOT gate implementation. These requirements impose constraints on the point symmetry group of the RE ion. TABLE I. Kramers ions will always have some doublets with nonvanishing g ⊥ = 0, irrespective of the point group. Here we tabulate the possibility that doublets with g ⊥ = 0 also occur in the various crystallographic point groups. Point symmetry groups with Kramers doublets that also allow for electric dipole moments are highlighted in bold."
            ],
            "subsections": []
        },
        {
            "title": "Crystal structure Symmetry group Doublets with g",
            "paragraphs": [
                "Kramers ions.-For Kramers ions, (at least) doubly degenerate states are ensured by time-reversal symmetry whose longitudinal g factor g is generally nonvanishing independent of crystal symmetry. Furthermore, due to time-reversal symmetry, CF doublets that contain wavefunctions of the J manifold with J z eigenvalues |m z = ±1/2 always have a finite transverse g factor g ⊥ = 0. Thus, doublets with different anisotropy directions are expected for Kramers ions independent of the crystal symmetry. This does not hold for the cubic point groups, where the g factors are isotropic. Thus, cubic symmetries are not suitable for this scheme. In Table I, we indicate which point symmetry groups also allow for doublets having g ⊥ = 0, and which ones allow for Stark shifts of the doublets, enabling the electrical gating of qubits.",
                "Non-Kramers ions.-Non-Kramers ions can host magnetic (degenerate) CF states only if the point symmetry group of the RE ion has irreducible representations that are higher dimensional or complex. This is the case for the tetragonal, trigonal, hexagonal, and cubic point symmetry groups. However, all these non-Kramers doublets are of Ising type, having vanishing perpendicular g factors. Only the triplets of the cubic groups allow for finite matrix elements of the transverse magnetization operator between degenerate states. However, those come with an isotropic g factor, which is not suitable for our scheme."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX E: CASE STUDY OF Er 3+ :Y 2 SiO 5",
            "paragraphs": [
                "The ground state manifold has angular momentum J GS = 15/2. Because of the low symmetry at the RE site, the g tensor has three inequivalent eigenvalues g x = g y = g z (in contrast to the discussion in the main part of the paper with g x = g y ≡ g ). The full g tensor and its principal components are listed in Table II. Each doublet state splits into an octuplet of hyperfine states upon coupling to the nuclear spin I = 7/2. The passive qubit is encoded in the two states of lowest energy, i.e., with nuclear spin projections -7/2 and -5/2, respectively, with respect to the polarization axis of the electronic ground state. The hyperfine interaction tensor was measured in Ref. [70], which seems to be close to the isotropic form in Eq. ( 1). We deduce the hyperfine strength from the largest principal component as A 15/2 /h = 103.6MHz. The nuclear g factor is g N = -0.16 [71].",
                "The first excited J manifold has total angular momentum J exc = 13/2 at an energy of J /h = 195 THz, corresponding to a wavelength of 1536.5 nm. The g tensor of the lowest doublet is given in Table II. Since we have no data on this manifold's hyperfine constant, which usually does not change dramatically between manifolds, we assume that A 13/2 = A 15/2 . As the transverse g factors do not vanish, the active qubit must be chosen to be an electronuclear qubit. More specifically, we choose the active qubit to consist of the lowest and second-highest hyperfine levels of the excited doublet, i.e., the states with nuclear spin projections -7/2 and -5/2 with respect to the polarization axis of the excited doublet; see Fig. 10.",
                "Because of the similar anisotropies of the g factors in the ground and excited doublets, the activation of the qubits (i.e., the transition |0/1 pas ↔ |0/1 act ) is faster by a factor of approximately 3.5 than the application of an X gate Active qubit FIG. 10. Sketch of our choice of passive and active qubits in 167 Er 3+ :Y 2 SiO 5 . The nuclear spin states denote the projections in the electronic polarization directions, i.e., they are not the same for the ground state and excited doublets. Because of the similar g-factor anisotropies in the ground and excited doublets, the transitions indicated with blue arrows are a factor of 3.5 faster than the transitions indicated with green arrows. on the active qubits, which involves the slow transitions |0/1 pas ↔ |1/0 act ; see Fig. 10. To maximize the gate fidelity, it is therefore better to deactivate one of the two qubits while applying an X gate (for the spin echo) on the other active qubit.",
                "We now estimate the total gate time and CNOT fidelity by taking into account the finite activation and X -gate times. For simplicity, we neglect all single-qubit gates in the scheme except for the spin echo that implements the two-qubit operation C(π/2); cf. Eq. ( 5). The activation times are estimated with the oscillator strength of the transition between the two doublets f = 1.1 × 10 -7 [72], which corresponds to an electric transition dipole moment of μ e = 2.0 × 10 -32 C m. Assuming pulses with magnetic field amplitudes B ac = 1 mT, we find with the optimal polar and azimuthal angles of the magnetic field φ = 132 • and θ = 35 • , respectively, for a qubit spacing of r = 10 nm, leading to an extrinsic gate fidelity of the CNOT implementation of F min ≈ 99.9% and a total gate time of 4.2 μs.",
                "H doublet = (μ B /2)[g B z σ z + g ⊥ (B x σ x + B y σ y )]. For simplicity, we restrict to point symmetries where the g matrix takes this form.",
                "[26] This symmetry consideration does not take into account the possibility of mixing two different, but energetically close CF levels by a static magnetic field. If two such states are connected by a finite J x/y matrix element, a magnetic field hybridizes them to create two polarized states with a magnetic moment in the transverse direction, even for non-Kramers ions. However, significantly hybridized states with non-negligible transverse magnetization occur only for fine-tuned CF Hamiltonians.",
                "[27] The only exceptions occur in the groups C 3h , D 3h , and T d .",
                "For the double groups of C 3h and D 3h , only the doublets of the Ē3 representation have an electric dipole moment (using the notation of Ref. [73]).",
                "[28] For RE ions, the photon emission rate is strongly suppressed, because the electric dipole operator only couples states with opposite parity.",
                "[29] S. R. Hastings-Simon, B. Lauritzen [33] Working instead in the regime where the magnetic field is of the order of the hyperfine interaction allows one to exploit states at avoided hyperfine crossings, where the relevant eigenstates are superpositions of both electronic polarization states, that are entangled with the nuclear spin. This structure enables fast transitions within the (passive) qubit owing to purely electronic matrix elements [74][75][76]. This regime, however, has the drawback that it is unclear how such qubits could be individually addressed and how magnetic dipolar interactions could be \"switched on\" in a fast manner so as to entangle qubits. Furthermore, the (passive) qubit lifetimes are drastically reduced compared with our proposed qubits, because two passive qubits can swap their states directly via the magnetic dipolar interaction.",
                "[34] In some cases it may nevertheless be favorable to choose an excited manifold that cannot be reached from the ground state by a magnetic dipole transition. In such cases the electric dipole transition from the ground state to the excited doublet can be used. The associated electric dipole moments are typically in the range μ e = 10 -34 -10 -32 C m (values for Ho 3+ :LiYF 4 [77]). The speedup as compared with direct nuclear spin transitions is still of the order of a factor (cμ e )/(3μ N ) = 2-200. [35] To minimize the single-qubit gate time, the overlap of the nuclear spin states in the passive and active qubits should be maximized. For I = 1/2, the optimal angle between the polarization directions of the active and passive doublet is"
            ],
            "subsections": []
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "paragraphs": [
                "The authors would like to thank A. Grimm for useful comments on the manuscript. This work is supported by the Swiss National Science Foundation (SNSF) under Grant No. 200021_166271."
            ],
            "subsections": []
        }
    ]
}