{
    "id": "https://semopenalex.org/work/W2184773485",
    "authors": [
        "Stephen Gottschalk",
        "Jordan S. Orange",
        "Winfried S. Wels",
        "Matthew L. Baker",
        "Kevin Chow",
        "Kevin Bielamowicz",
        "Kristen Fousek",
        "Nabil Ahmed",
        "Malini Mukherjee",
        "Vita S. Brawley",
        "Antonella Pignata",
        "Meenakshi Hegde",
        "Tiara Byrd",
        "Amanda Wakefield",
        "Zakaria Grada",
        "G. Dotti"
    ],
    "title": "A bispecific chimeric antigen receptor molecule enhances T cell activation through dual immunological synapse formation and offsets antigen escape in glioblastoma",
    "date": "2015-11-04",
    "abstract": "Meeting abstracts Antigen escape tumor cell variants prevail in tumors recurring after treatment with chimeric antigen receptor (CAR) T cells with a single specificity. Recurrent tumors preserve alternative non-targeted tumor associated antigens. A bispecific CAR will mitigate antigen escape",
    "sections": [
        {
            "title": "Background",
            "paragraphs": [
                "Antigen escape tumor cell variants prevail in tumors recurring after treatment with chimeric antigen receptor (CAR) T cells with a single specificity. Recurrent tumors preserve alternative non-targeted tumor associated antigens."
            ],
            "subsections": []
        },
        {
            "title": "Hypothesis",
            "paragraphs": [
                "A bispecific CAR will mitigate antigen escape enhancing the antitumor activity of T cells."
            ],
            "subsections": []
        },
        {
            "title": "Methods And Results",
            "paragraphs": [
                "HER2 and IL13Rα2 are currently targeted in Phase I glioblastoma (GBM) trials using CAR T cells. We created a bispecific CAR molecule with a HER2-specific scFv joined in tandem to an IL13Rα2-binding moiety in the CAR exodomain (Tandem CAR) and a CD28.ζ signaling endodomain. We used computational modeling to interrogate this design. GBM patients' Tandem CAR T cells showed distinct binding to soluble HER2 and IL13Rα2 and killed primary autologous GBM cells. Three-dimensional reconstitution and quantification of confocal images of the Tandem CAR T cell/tumor interface revealed enhanced bifunctional immunological synapses compared to conventional CARs. Further, Tandem CAR T cells exhibited significantly enhanced inexhaustible activation dynamics when compared to conventional HER2 or IL13Rα2 CAR T cells and better controlled established GBM in an orthotopic murine model by offsetting both HER2 and IL13Rα2 escape."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "Tandem chimeric antigen receptors enhance T cell activation and mitigate antigen escape through bifunctional immunological synapse formation in GBM."
            ],
            "subsections": []
        }
    ]
}