{
    "id": "https://semopenalex.org/work/W2035405944",
    "authors": [
        "Hartmut J. Ehrlich",
        "Jan Rosing",
        "Friedrich Scheiflinger",
        "Rudolf Hartmann",
        "Ulrich Reineke",
        "Hans Brandstetter",
        "Michael Dockal",
        "M. Christella L. G. D. Thomassen",
        "Thomas Polakowski",
        "Alexandra C.A. Heinzmann",
        "A. Griessner",
        "Markus Fries",
        "Frank Osterkamp"
    ],
    "title": "Small Peptides Blocking Inhibition of Factor Xa and Tissue Factor-Factor VIIa by Tissue Factor Pathway Inhibitor (TFPI)",
    "date": "2014-01-01",
    "abstract": "Tissue factor pathway inhibitor (TFPI) is a Kunitz-type protease inhibitor that inhibits activated factor X (FXa) via a slow-tight binding mechanism and tissue factor-activated FVII (TF-FVIIa) via formation of a quaternary FXa-TFPI-TF-FVIIa complex. Inhibition of TFPI enhances coagulation in hemophilia models. Using a library approach, we selected and subsequently optimized peptides that bind TFPI and block its anticoagulant activity. One peptide (termed compound 3), bound with high affinity to the Kunitz-1 (K1) domain of TFPI (Kd ∼1 nm). We solved the crystal structure of this peptide in complex with the K1 of TFPI at 2.55-Å resolution. The structure of compound 3 can be segmented into a N-terminal anchor; an Ω-shaped loop; an intermediate segment; a tight glycine-loop; and a C-terminal α-helix that is anchored to K1 at its reactive center loop and two-stranded β-sheet. The contact surface has an overall hydrophobic character with some charged hot spots. In a model system, compound 3 blocked FXa inhibition by TFPI (EC50 = 11 nm) and inhibition of TF-FVIIa-catalyzed FX activation by TFPI (EC50 = 2 nm). The peptide prevented transition from the loose to the tight FXa-TFPI complex, but did not affect formation of the loose FXa-TFPI complex. The K1 domain of TFPI binds and inhibits FVIIa and the K2 domain similarly inhibits FXa. Because compound 3 binds to K1, our data show that K1 is not only important for FVIIa inhibition but also for FXa inhibition, i.e. for the transition of the loose to the tight FXa-TFPI complex. This mode of action translates into normalization of coagulation of hemophilia plasmas. Compound 3 thus bears potential to prevent bleeding in hemophilia patients.",
    "sections": [
        {
            "title": "Conclusion:",
            "paragraphs": [
                "The peptide binds to the Kunitz domain 1 of TFPI and blocks inhibition of factor Xa and factor VIIa by TFPI. Significance: The peptide can potentially prevent bleeding in hemophilia patients.",
                "Tissue factor pathway inhibitor (TFPI) is a Kunitz-type protease inhibitor that inhibits activated factor X (FXa) via a slowtight binding mechanism and tissue factor-activated FVII (TF-FVIIa) via formation of a quaternary FXa-TFPI-TF-FVIIa complex. Inhibition of TFPI enhances coagulation in hemophilia models. Using a library approach, we selected and subsequently optimized peptides that bind TFPI and block its anticoagulant activity. One peptide (termed compound 3), bound with high affinity to the Kunitz-1 (K1) domain of TFPI (K d ϳ1 nM). We solved the crystal structure of this peptide in complex with the K1 of TFPI at 2.55-A ˚resolution. The structure of compound 3 can be segmented into a N-terminal anchor; an ⍀-shaped loop; an intermediate segment; a tight glycine-loop; and a C-terminal ␣-helix that is anchored to K1 at its reactive center loop and two-stranded ␤-sheet. The contact surface has an overall hydrophobic character with some charged hot spots. In a model system, compound 3 blocked FXa inhibition by TFPI (EC 50 ‫؍‬ 11 nM) and inhibition of TF-FVIIa-catalyzed FX activation by TFPI (EC 50 ‫؍‬ 2 nM). The peptide prevented transition from the loose to the tight FXa-TFPI complex, but did not affect formation of the loose FXa-TFPI complex. The K1 domain of TFPI binds and inhibits FVIIa and the K2 domain similarly inhibits FXa. Because compound 3 binds to K1, our data show that K1 is not only important for FVIIa inhibition but also for FXa inhibition, i.e. for the transition of the loose to the tight FXa-TFPI complex. This mode of action translates into normalization of coagulation of hemophilia plasmas. Compound 3 thus bears potential to prevent bleeding in hemophilia patients. * M. D"
            ],
            "subsections": []
        },
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Reagents-The chromogenic substrate CS-11(65) (N-␣benzyloxycarbonyl-D-arginyl-L-glycyl-L-arginine-p-nitroaniline-dihydrochloride) and the fluorogenic substrate Fluophen Xa (Suc-Ile-Gly (Pip)Gly-Arg-AMC) were purchased from Hyphen BioMed (Mason, OH). Human FXa, human FX, and human FVIIa were purchased from Innovative Research (Novi, MI) and bovine FXa was purified from bovine plasma (27). Protein S was from Hematologic Technologies (Essex Junction, VT). Relipidated recombinant TF (Innovin) was from Siemens. 1,2-Dioleoyl-sn-glycero-3-phosphocholine (DOPC), 1,2-dioleoyl-sn-glycero-3-phosphoserine (DOPS), and 1,2dioleoyl-sn-glycero-3-phosphoethanolamine (DOPE) were obtained from Avanti Polar Lipids (Delfzijl, The Netherlands). Phospholipid vesicles (20% DOPS, 20% DOPE, and 60% DOPC) were prepared as described (28). CaCl 2 , NaCl, and EDTA were obtained from Merck Chemicals (Darmstadt, Germany). HEPES, Tris-HCl, bovine serum albumin (BSA), ovalbumin, and reagents for SDS-PAGE were obtained from Sigma. Chromatographic media for protein purification were obtained from GE Healthcare. PPP-Reagent Low, FluCa-Kit, and thrombin calibrator were obtained from Thrombinoscope BV (Maastricht, The Netherlands). Normal pooled plasma, plasma from patients with severe hemophilia A and B (factor levels Ͻ1%), and plasma from patients with hemophilia A and inhibitory antibodies (49 Bethesda units/ml) were obtained from George King (Overland Park, KS).",
                "Expression, Purification, and Characterization of TFPI Proteins-The cell line SK-Hep-1 (ATCC number HTB-52), which produces TFPI endogenously was used as a source for human fulllength TFPI. Cells were cultured in DMEM containing 10% fetal bovine serum (Life Technologies) and full-length TFPI was purified from conditioned media by a two-step affinity purification protocol. First, total TFPI was captured by a biotinylated anti-TFPI peptide coupled to streptavidin-Sepharose and eluted with 100 mM glycine (pH 2.3), 175 mM NaCl, 0.01% polysorbate 80, and 10 mM benzamidine (Sigma). The full-length TFPI was further purified on an antibody affinity matrix using a monoclonal anti-C terminus antibody (TFPI-27, Sanquin, Amsterdam, The Netherlands). Homogeneous human full-length protein was characterized by mass spectrometry for molecular weight determination and SDS-PAGE at reducing and non-reducing conditions followed by Coomassie staining, silver staining, or immunoblotting. The active concentration of full-length TFPI was determined by titrating a known amount of bovine FXa with TFPI (29).",
                "The TFPI constructs TFPI-(1-150) and TFPI-(1-150)-Thr, containing a thrombin cleavage site between K1 and K2 were expressed as insoluble inclusion bodies in Escherichia coli BL21(DE3)pLysS (Merck, Darmstadt, Germany) using the expression vector pET19b (Merck). Solubilized (8 M urea, 20 mM DTT, 50 mM Tris-HCl, pH 8.0) TFPI-(1-150)-Thr was folded in 50 mM Tris-HCl (pH 10.0), 1.1 mM oxidized glutathione by rapid dilution followed by dialysis against 20 mM Tris-HCl (pH 7.0). TFPI-(1-1-150)-Thr was purified using a twostep purification procedure, a Q-Sepharose column, and a streptavidin affinity column with an immobilized peptide specific toward TFPI. Purified TFPI-(1-150)-Thr was digested by incubation with thrombin resulting in the generation of TFPI-(1-83)-Thr and TFPI-(90 -150)-Thr. TFPI-(1-83)-Thr was purified from the digestion mixture using benzamidine-Sepharose for removal of thrombin, followed by the peptide affinity column. Purified TFPI-(1-83)-Thr was used for complex formation with compound 3 and further crystallization.",
                "Peptide Synthesis-Peptides were synthesized using standard Fmoc-Solid Phase Peptide Synthesis conditions. Starting with a Fmoc-Rink-Amide resin Fmoc deprotection was done by treatment with 20% piperidine in N,N-dimethylformamide. Coupling of the individual Fmoc-amino acids (5 equivalents) was carried out by activation with O-(7-azabenzotriazol-1-yl)-N,N,NЈ, NЈ-tetramethyluronium hexafluorophosphate (GL Biochem, Shanghai, China)/N,N-diisopropylethylamine (Sigma) in N,N-dimethylformamide or N-methyl-2-pyrrolidone (Sigma). The coupling steps of aminoisobutyric acid and Leu following an aminoisobutyric acid residue were performed twice. After completion of the synthesis the peptides were deprotected and cleaved from the solid support by standard trifluoroacetic acid cleavage mixtures. After precipitation the crude peptides were purified by preparative reversed phase HPLC (Ն90% at 230 nm) (30).",
                "Crystallization and Structure Determination-Successful co-crystallization of equimolar complexes of TFPI-(1-83)-Thr and compound 3 was obtained under 100 mM MES (pH 6.5), 20% PEG 4000, 600 mM NaCl. Crystals diffracted to better than 2.5-Å resolution, albeit with some non-merohedral twinning. Diffraction data were processed to 2.5-Å resolution with iMosflm and SCALA from the CCP4 program package, revealing a monoclinic crystal form with unit cells dimensions of a ϭ 113.67 Å, b ϭ 69.32 Å, c ϭ 42.37 Å, ␣ ϭ 90.0°, ␤ ϭ 92.97°, ␥ ϭ 90.0°, space group C2 (31,32). Self-rotation calculations indicated an ϳ2-fold non-crystallographic symmetry. Consistent herewith, two molecules were localized in the asymmetric unit related by a 170°rotation. The Patterson search was carried out using the program PHASER and a structure ensemble of the available Kunitz domain 2 crystal structures as search model (33). The unit cell contains ϳ64% solvent. Non-crystallographic electron density averaging, model building, and model refinement was carried out with the programs Coot, Refmac, MAIN, and CNS (34 -37). The current model is completely defined for both copies of the compound 3 peptide and the interaction with the protein with current r ϭ 0.257, R free ϭ 0.298, deviation from ideal geometry root mean square (bond) ϭ 0.008 Å, root mean square (angle) ϭ 1.8°. Crystallographic data are deposited in the Protein Data Bank (code 4bqd).",
                "Affinity Measurement by Biacore-Biacore experiments were performed on a BIAcore T200 (GE Healthcare). Full-length human TFPI was immobilized on a CM5 chip (GE Healthcare) aiming at 500 response units using amine coupling chemistry. Peptide binding to TFPI was analyzed in a single cycle kinetic analysis in the concentration range from 0.6 to 9.6 nM peptide using HBS-P buffer (10 mM HEPES, pH 7.4, 150 mM NaCl, 0.05% P20) at a flow rate of 30 l/min at 37 °C. Biacore T200 Evaluation Software 1.0 (GE Healthcare) was used to analyze the data.",
                "Effect of Peptides on FXa Inhibition by TFPI-Varying concentrations of TFPI were incubated in HNBSA buffer (50 mM HEPES, pH 7.7, 175 mM NaCl, 5 mg/ml of BSA) containing 125 M of the FXa-specific chromogenic substrate CS-11(65), 1 mM EDTA or 3 mM CaCl 2 and if present, varying concentrations peptide, 40 nM protein S and/or 30 M phospholipid vesicles (20:60:20, DOPS/DOPC/DOPE) for 10 min at 37 °C. hFXa was added and the increase in absorbance at 405 nm was followed in an Ultra Microplate Reader (Bio-Tek, Burlington, VT) until a steady state rate of chromogenic substrate conversion was achieved (ϳ60 min).",
                "Effect of Peptides on the Inhibition of TF-FVIIa-catalyzed FX Activation-Varying concentrations of TFPI were preincubated in a microtiter plate at 37 °C in 90 l of HNBSA buffer containing FVIIa, the fluorogenic substrate Fluophen Xa, and peptide. After 7 min 10 l of TF and phospholipid vesicles (20: 60:20, DOPS/DOPC/DOPE) were added and after 10 min FX activation was started by adding 25 l of FX. The final reaction mixture contained 2 pM TF, 500 pM FVIIa, 100 nM FX, 10 M phospholipid vesicles, 0.36 nM TFPI, 400 M Fluophen Xa, 3 mM CaCl 2 , and various concentrations of peptide in HNBSA buffer (pH 7.7) and incubated at 37 °C.",
                "FXa generation was monitored by following Fluophen Xa conversion in a Fluoroskan Ascent reader (Thermo Labsystems, Helsinki, Finland) with filter sets at 390 nm excitation and 460 nm emission. A FXa standard was used to correct the raw fluorescence data for substrate consumption and first derivative of the data divided by the calibration factor obtained from the measurement with the FXa standard yielded the FXa generation curve.",
                "Effect of Peptides on Thrombin Generation in Plasma-Thrombin generation in plasma was determined using calibrated automated thrombography (CAT) (38). Coagulation was initiated with 1 pM rhTF and 4 M phospholipid (PPP-Reagent Low). Thrombin activity in plasma was monitored continuously at 37 °C with the fluorogenic substrate ZGGR-AMC. In separate wells, 113 nM thrombin calibrator was added to plasma to obtain a calibration curve for the conversion of fluorescence into thrombin concentration. Fluorescence was read in a Fluoroskan Ascent FL reader (Thermo Labsystems, Helsinki, Finland) equipped with a 390/460 nm filter set and thrombin generation curves were calculated with the Thrombinoscope software (Thrombinoscope version 3.0). Each well contained 80 l of plasma in a total volume of 120 l. To prevent contact activation, all samples were measured in the presence of 41.3 g/ml of corn trypsin inhibitor (Hematologic Technologies, Essex Junction, VT). Thrombin generation was measured in normal plasma, in normal plasma supplemented with an amount of anti-human FVIII heat-treated goat plasma (Z994) that completely abolished intrinsically triggered thrombin generation (39) and in plasmas from a hemophilia A, a hemophilia B, and a hemophilia A inhibitor patient.",
                "TFPI ELISA-Plasma TFPI was quantified by ELISA as described in Knappe et al. (39). Full-length TFPI was detected using a monoclonal mouse antibody raised against the C terminus of human TFPI (Sanquin) as a capture antibody. The fulllength TFPI protein standard (Baxter BioScience, Austria), controls, and samples were incubated at room temperature for 2 h, followed by washing. Full-length TFPI was detected by incubating a primary (polyclonal rabbit anti-human TFPI; American Diagnostica Inc.) and a secondary antibody (antirabbit whole molecule IgG peroxidase conjugate; Sigma). The peroxidase substrate Sure Blue TMB (KPL Inc.) was applied for a colorimetric reaction. The reaction was stopped with 1 M HCl and absorption was measured at 450 nm on an ELx 405 reader (Bio-Tek Instruments Inc.).",
                "The detection of total TFPI was equivalent to full-length TFPI with the following changes: the capture antibody was a mouse monoclonal anti-human raised against the KD-2 domain (Sanquin). Human TFPI (R&D Systems) was used as the standard. The concentrations of total and full-length TFPI were quantified based on the respective standard curve. Every sample was tested in duplicate."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Identification and Optimization of Peptides That Neutralize",
                    "paragraphs": [
                        "TFPI-Screening of a 27-mer mRNA display library (Cosmix, Braunschweig, Germany) resulted in the identification of several peptides that bind and inhibit TFPI. Truncations and substitutional analysis of one hit (compound 1) led to the active core sequence, a 20-mer peptide (compound 2, Ac-FQSKGN-VFVDGYFERLRAKL-NH 2 ). Surface plasmon resonance experiments showed that compound 2 binds to immobilized TFPI with a K D of 17.7 Ϯ 5.9 nM (Fig. 1A, closed symbol) and acts as a TFPI antagonist that blocks FXa inhibition by TFPI in kinetic experiments in a model system (Fig. 1B). Affinity and stability improvement by iterative amino acid substitutions in compound 2 resulted in an optimized peptide (compound 3, Ac-FQSKpNVHVDGYFERL-Aib-AKL-NH 2 ) that binds to immobilized TFPI with an affinity of 0.5 Ϯ 0.2 nM (Fig. 1A, open symbol). The affinity optimization is mainly due to an improvement of the dissociation rate characterized by 47-fold reduction in k off (3.6 Ϯ 0.8 ϫ 10 Ϫ2 s Ϫ1 for compound 2 versus 7.7 Ϯ 2.9 ϫ 10 Ϫ4 s Ϫ1 , compound 3). At steady state conditions of FXa inhibition by TFPI, compound 3 caused 50% inhibition of TFPI at ϳ11.6 nM (Fig. 1B, closed symbols) and is ϳ25 times more active as a TFPI antagonist than compound 2 (Fig. 1B, open symbols). Two scrambled versions of compound 3 neither bound to TFPI (Fig. 1A) nor blocked inhibition of FXa by TFPI (data not shown).",
                        "Structural Basis for TFPI-K1 Binding Specificity-For elucidation of the atomic details of peptide-TFPI interactions, the crystal structure of compound 3 complexed to recombinant TFPI-(1-83) was solved (Fig. 2). The K1 structure is defined in the electron density from Glu 15 through Asp 79 ; whereas chemically present, the N-terminal sequence (amino acids 1-14) and K1-K2 linker sequence (amino acids 80 -83) are conformationally disordered in each of the two crystallographically independent copies of the molecule. As with other Kunitz domains, only ϳ 1 ⁄ 3 of the structure is engaged in secondary structure elements; these are two short ␣-helical elements at Ser-24 -Ala-27 (␣1) and Leu-69 -Cys-76 (␣2) and a two-stranded ␤ sheet comprising Met-39 -Asn-45 (␤1) and Arg-49 -Ile-55 (␤2) (Fig. 2, B andC). These elements form the topological framework that is stabilized by the three canonical disulfide bonds involving Cys-26 -Cys-76, Cys-35-Cys-59, and Cys-51-Cys-72. Additional stabilization derives from a remarkably hydrophobic cluster formation, contributed by Phe-42-Phe-43-Phe-44. This triple aromatic residue cluster is universally conserved in all Kunitz inhibitors.",
                        "Like in related Kunitz inhibitor domains, the reactive center loop (RCL) is exposed and well accessible to interact with its target protein. The P4 to P2Ј sequence is Gly-33-Pro-34 -Cys-35-Lys-36 -Ala-37-Ile-38. Although Cys-Lys/Arg is a rather conserved P2-P1 motif, reflecting the topological restraints in Kunitz protease inhibitors, proline at position P3 induces an additional conformational constrain to the RCL, which would not be tolerated in the narrow active site of FXa. Proline at P3 and to a lesser extent Lys rather than Arg at P1 thus represent two major specificity determinants of K1 toward FVIIa over FXa (40). Although the surface charge distribution is overall balanced, there is some negatively charged cluster surrounding the RCL, generated by Asp-31-Asp-32, Glu-60 as well as several solvent-exposed carbonyl oxygen atoms (Fig. 2, A andC).",
                        "Compound 3 Is Segmented into Structural Modules-The structure of the 20-mer peptide can be segmented into (i) the N-terminal anchor consisting of acetylated Phe-1 AP -Gln-2 AP ; (ii) an ⍀-shaped loop comprising Ser-3 AP -Asn-6 AP ; (iii) an intermediate segment built from Val-7 AP and His-8 AP ; (iv) a tight glycine-loop containing Val-9 AP -Gly11 AP ; and (v) the C-terminal ␣-helix comprising Tyr-12 AP -Leu-20 AP (Fig. 2, A andC). The subscript AP indicates the sequence numbering in the antagonistic peptide. The conformation of the ␣-helix is stabilized by a non-natural ␣-methyl alanine positioned at the center of the helix (position 17 AP ); a C-terminal amide allowing to complete the 1-4 hydrogen bonding pattern of the ␣-helix; and a stacked cluster by the aromatic side chains of His-8 AP , Tyr-12 AP , and Phe-13 AP . These effects cooperate to stabilize the C-terminal ␣-helix spontaneously in solution, consistent with circular dichroism data on the peptide (supplemental Fig. S1 and Table S1). The observed aromatic side chain stacking by His-8 AP , Tyr-12 AP , and Phe-13 AP enforces a left-handed helical turn that can be only accomplished by glycine at position 11 AP , cf. Fig. 2C. Consistent with this structural constraint, replacement of Gly-11 AP by any other amino acid is reflected by dramatic losses in binding affinity toward K1, as such residues would compromise the main chain trace of the antagonistic peptide (supplemental Table S2). The conformation of the N-terminal loop segment is partly stabilized by a D-proline, known to induce a tight turn conformation, and a 1-4 hydrogen bond by the carbonyl oxygen of Ser-3 AP with the amide nitrogen of Asn6 AP . Importantly, all ring side chains (Tyr-1 AP , Pro-5 AP , His-8 AP , Tyr-12 AP , and Phe-13 AP ) point in the same direction, enabling them to interact with the K1 domain of TFPI (Fig. 2A). "
                    ],
                    "subsections": [
                        {
                            "title": "Characteristics of the Interaction between Compound 3 and K1-",
                            "paragraphs": [
                                "The contact surface of compound 3, derived from atoms with an intermolecular distance of less than 4.5 Å, shows an overall hydrophobic character with some distinct positively and negatively charged hot spots that correspond to Arg-15 AP , Lys-19 AP , as well as some peptide bond amide nitrogens (Fig. 2A). Conversely, the TFPI-derived contact surface (Ͻ4.5 Å) exhibits a distinct negative charge cluster, corresponding to Asp-31, Asp-32 (Fig. 2, A andC). This charge complementarity is indeed exploited by the interaction, which involves a bidentate salt bridge of Asp-32 with Arg-15 AP and Lys-19 AP . Another charged interaction is realized by Asp-10 AP and Lys-29 (Fig. 2, B andC). The observed charge complementarity is complemented by an extended steric surface complementarity of the binding partners.",
                                "The antagonistic peptide has been systematically optimized, including the modification of its termini. We found a more than 5-fold improvement in the binding affinity by acetylation of the free N terminus (data not shown). This effect is likely caused by eliminating the positive charge of the free N terminus, which leads to electrostatic repulsion by Lys-29 positioned near ␣1 of TFPI. Although the side chain of Phe-1 AP interacts nonspecifically with ␣1, Gln-2 AP forms a deeply buried contact in a pocket formed by the exit turn of ␣1 and strand ␤1.",
                                "The ⍀-shaped loop (Ser-3 AP -Asn-6 AP ) makes few nonspecific interactions with the connecting loop between ␤1 and ␤2; most notably, the pyrrolidine ring of D-Pro-5 AP contacts with Phe-47, whereas the pyrrolidine ring of L-Pro at position 5 AP would be oriented away from K1 toward the solvent. The polar interaction by the side chains of Asn-6 AP and Lys-29 (␣1) may further stabilize the conformation of both residues.",
                                "Val-7 AP confers well shielded hydrophobic contacts with Asn-45 and Phe-43, forming the entrance to the binding pocket utilized by Gln-2 AP . Whereas His-8 AP hardly contributes direct contacts with TFPI, it exhibits important intra-molecular stacking interaction, mostly with Tyr-11 AP and partly with Phe-13 AP (Fig. 2, A andC). The subsequent glycine-loop makes rather negligible interactions with the protein; the strict requirement for glycine at position 11 AP can be explained by the special conformation of the loop.",
                                "The C-terminal helix is anchored to TFPI at its RCL and the two-stranded ␤-pleated sheet. Important interactions are mediated by Tyr12 AP via its hydroxyl O with the amide nitrogen of Ile 55 , positioned on ␤2. Arg-15 AP forms a perfect bidentate-bidentate interaction with Asp-32, positioned close to the RCL (Fig. 2C). Similarly, Lys-19 AP forms important contacts, both hydrophobic and polar in nature, reaching the carbonyl oxygen of Ala-37 (RCL-P1Ј). Another attractive interaction for Lys-19 AP seems possible via a cation trap formed by the carbonyls of Asp-32 and Gly-33 (RCL-P5-P4); this interaction is mediated by solvent molecules located at the cation trap.",
                                "Effect of Compound 3 on the Kinetics of Inhibition of FXa by TFPI-TFPI inhibits FXa via a so-called slow-tight binding mechanism that involves rapid formation of a loose FXa-TFPI complex that subsequently slowly isomerizes to a tight FXa-TFPI* complex (1, 2) (Equation 1).",
                                "Hence, progress curves of FXa inhibition by TFPI followed by continuous measurement of the conversion of a FXa-specific chromogenic substrate are biphasic (1, 2) with a rapid loss of part of the FXa amidolytic activity as the result of fast formation of the loose FXa-TFPI complex followed by a gradual but more pronounced loss of amidolytic activity representing the slow transformation of the loose FXa-TFPI to the tight FXa-TFPI* complex.",
                                "Progress curves of chromogenic substrate conversion can be fitted to the integrated rate equation (1, 2, 41) for slow-tight binding inhibition (Equation 2),",
                                "FIGURE 2. Crystal structure of the K1-compound 3 complex. A, the accessible surface of K1 is colored by its electrostatic potential, indicating the mixed interaction type. The K1-compound 3 complex exhibits a remarkable steric complementarity. B, representation of the accessible surface of compound 3 in identical orientation as in A). Characteristic surface patches can be assigned by the ribbon representation of the matching image in A and B. C, detailed interaction of the compound 3-K1 complex in stereo representation. Note the D-chirality of Pro-5 AP , which is necessary to orient its pyrrolidine ring toward the K1 domain for attractive interaction. Gly-11 AP adopts dihedral angles (; ) of 80.8°; 8.0°, corresponding to a left-handed helical turn (see C, light blue). This conformation is rather unique to glycine residues over all other amino acids.",
                                "in which A t is absorbance at 405 nm at time t; A 0 is initial absorbance at 405 nm; v s is final steady-state velocity; v 0 is initial velocity; k obs is apparent rate constant for the transition from v 0 to v s (FXa-TFPI to FXa-TFPI*). v 0 and v s values relative to rates of chromogenic substrate conversion by FXa in the absence of TFPI represent the extent of loose and tight FXa-TFPI complex formation.",
                                "The effectiveness by which TFPI inhibits FXa increases in the presence of phospholipids (PL) and is further enhanced when protein S is included in the reaction mixture (2) (Fig. 3, A-C). At all conditions, compound 3 impaired the inhibition of FXa by TFPI, but the antagonistic activity of the peptide decreased by the addition of PL and PL ϩ protein S. Visual inspection of the progress curves suggests that the biphasic character of FXa inhibition is gradually lost at increasing compound 3 concentrations and that it is particularly the second phase of FXa inhibition, i.e. the slow conversion of the loose to the tight FXa-TFPI complex that is affected by compound 3.",
                                "That this is indeed the case is shown in Fig. 4A, which depicts the effect of compound 3 on the inhibition of FXa by a much higher TFPI concentration. This experiment was performed at a high TFPI concentration to get a reliable measurement of v 0 and v s (loose and tight complex formation) and the effect of compound 3 thereon. Fig. 4B shows that compound 3 indeed affects v s and has no effect on v 0 indicating that the peptide does not interfere with the formation of the loose FXa-TFPI complex, but prevents the isomerization step and the formation of the tight FXa-TFPI* complex.",
                                "To quantify the effect of compound 3, v s values obtained after fitting the progress curves using Equation 2were plotted as a function of the compound 3 concentration and fitted to a hyperbola (data not shown), which yielded an E max , which is the extent by which a saturating concentration compound 3 blocks inhibition of FXa by TFPI (E max ϭ 100% means full inhibition of TFPI by peptide), and an EC 50 , which is the concentration of compound 3 required to obtain 50% of the E max (Table 1). The E max decreased in the order Ca 2ϩ , Ca 2ϩ ϩ PL, and Ca 2ϩ ϩ PL ϩ protein S, whereas the EC 50 appeared to be virtually independent of the presence of Ca 2ϩ , PL, and protein S. These observations indicate that the affinity of compound 3 for TFPI is high (sub-nanomolar range) and is not affected by PL and protein S. Because both PL and protein S enhance the formation of the loose FXa-TFPI complex and hardly affect the isomerization to the tight FXa-TFPI* complex (2), a decrease of the E max in the presence of PL and protein S is in line with the observation (Fig. 4, A andB) that compound 3 inhibits the isomerization of the loose to the tight FXa-TFPI complex (affects v s ). The lack of an effect of PL and protein S on the EC 50 supports the notion that compound 3 has no effect on the formation of the loose encounter complex (v 0 ).",
                                "Effect of Compound 3 on the Dissociation of Preformed FXa-TFPI Complexes-The data presented thus far indicate that compound 3 effectively blocks inhibition of FXa by TFPI. Fig. 5 shows that compound 3 is also able to reverse FXa-TFPI complex formation and dissociate preformed tight FXa-TFPI* complexes. In this experiment, FXa was incubated with TFPI during 45 min, which is sufficiently long to establish the inhibition equilibrium (Equation 1) and allow for full tight FXa-TFPI* complex formation (97% inhibition of FXa). Addition of varying  "
                            ],
                            "subsections": [
                                {
                                    "title": "TABLE 1 Compound 3 requirement for TFPI inhibition",
                                    "paragraphs": [
                                        "V s values obtained after fitting the progress curves presented in Fig. 3 were plotted as function of the compound 3 concentration and fitted to a hyperbola, which yielded an E max (extent of TFPI inhibition at saturating compound 3 concentration) and the EC 50 (the compound 3 concentration required to obtain 50% of the E max ). For these parameters the mean values Ϯ S.D. and the number of experiments (n) are given. concentrations of compound 3 to the FXa-TFPI mixture after 45 min resulted in a concentration-dependent dissociation of FXa-TFPI* complexes and a recovery of active non-inhibited FXa. At compound 3 concentrations Ͼ10 nM, i.e. higher than the TFPI concentration, ϳ60% of the FXa activity was recovered."
                                    ],
                                    "subsections": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "EC",
                    "paragraphs": [
                        "Effect of Compound 3 on the Inhibition of TF-FVIIa-catalyzed FX Activation by TFPI-TFPI not only inhibits FXa, but also is a potent inhibitor of the TF-FVIIa complex and rapidly inhibits TF-FVIIa-catalyzed FX activation via formation of a quaternary TFPI-FXa-TF-FVIIa complex (3,4). Compound 3 also blocks inhibition of TF-FVIIa-catalyzed FX activation by TFPI (Fig. 6). In the absence of compound 3, 0.36 nM TFPI almost completely inhibited FX activation within 2 min. Compound 3 reduced inhibition of FX activation by TFPI in a concentration-dependent manner. Although compound 3 concentrations in 10-fold excess of TFPI did not fully block TFPI, FXa generation was restored to 50% of that observed without TFPI at ϳ2 nM compound 3.",
                        "Effect of Compound 3 on TF-triggered Thrombin Generation in Plasma-The ability of compound 3 to block the anticoagulant activity of TFPI in plasma was tested by measuring its effect on TF-triggered thrombin generation in normal plasma (Fig. 7A), in normal plasma in which FVIII was inhibited with a polyclonal FVIII antibody (Fig. 7B), plasma from a hemophilia A (Fig. 7C) or hemophilia B patient (Fig. 7D), and in plasma from a hemophilia patient with a FVIII inhibitor (Fig. 7E). Compound 3 enhanced thrombin generation (thrombin peak height) in all plasmas tested to the level of normal plasma control or higher (hemophilia B patient plasma, Fig. 7D). The concentration of compound 3 that caused 50% enhancement of thrombin generation (EC 50 ) was similar in the five plasmas tested (Table 2). However, the extent by which compound 3 increased thrombin generation (thrombin peak height) was more pronounced in plasma without functional FVIII or FIX than in normal plasma (Table 2)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "TFPI is a multi-Kunitz domain protease inhibitor that downregulates the extrinsic pathway of the blood coagulation by inhibiting FXa and FVIIa. TFPI consists of a negatively charged N terminus, 3 Kunitz domains designated K1, K2, and K3, and a positively charged C terminus (5). With respect to the structure-function relationship of TFPI it has been reported that K1 binds to and inhibits FVIIa and K2 binds and inhibits FXa (4). However, there are several reports that indicate the involvement of TFPI domains other than K2 in the inhibition of FXa (8 -11, 13). The physiological importance of TFPI as an anticoagulant protein is underscored by the observations that low levels of TFPI are associated with an increased risk of venous thrombosis (16,17) but may protect FV-deficient patients from severe bleeding (18) and that inhibition of TFPI with antibodies, aptamers, and sulfated polysaccharides shortens the clotting time of plasma and restores coagulation in animal hemophilia models (19 -23, 25, 26).",
                "The objective of the current investigation was to develop peptide inhibitors of TFPI that enhance coagulation in hemophilia models and that might be used in the treatment of hemophilia patients. Using a library approach, we identified several peptides de novo that bind to TFPI and block FXa inhibition by TFPI. These peptides were analyzed and subsequently optimized by serial truncations and amino acid substitutions. This resulted in several peptides with an improved affinity for TFPI, one of which (compound 3) was further characterized in a structure-function study. Surface plasmon resonance (Biacore) experiments showed that compound 3 binds with high affinity to TFPI (K D : 0.5 nM). The peptide also blocks inhibition of FXa by TFPI with an EC 50 of ϳ5 nM and TF-FVIIa- catalyzed FX activation with an EC 50 of ϳ2 nM. The fact that K D and EC 50 values are of the same order of magnitude shows that binding of compound 3 to TFPI is paralleled by blocking the ability of TFPI to inhibit FXa and FVIIa. Compound 3 not only blocked the inhibition of FXa and FVIIa by TFPI in model systems, but also exhibited TFPI antagonist activity in plasma (Fig. 7) and increased the thrombin peak height of low TF-triggered thrombin generation in normal plasma ϳ3-fold with an EC 50 ϳ16 nM (Table 2). Similar amounts of compound 3 were required to stimulate thrombin generation in plasmas, which did not contain FVIII or FIX. However, compared with normal plasma, the extent of stimulation was substantially more pronounced (10 -30-fold) in plasma from hemophilia patients and in plasma containing FVIII-inhibiting antibodies (ϳ10-fold). The more pronounced increase of thrombin generation in plasmas without functional FVIII or FIX is likely explained by the fact that in these plasmas thrombin generation is fully dependent on TF-FVIIa, whereas in plasma with FVIII/FIX (normal plasma) there is a contribution to thrombin generation independent of TF-FVIIa, i.e. via FIXa-FVIIIa, a pathway that is less sensitive to TFPI than the TF-FVIIa pathway. The large increase of thrombin generation in FVIII-deficient plasma may be caused by its high TFPI content of this particular plasma that resulted in very low thrombin generation in the absence of compound 3 (Fig. 7D) and upon inhibition with compound 3 will result in a high enhancement factor.",
                "The crystal structure of K1 in complex with compound 3 was solved at 2.55-Å resolution. The complex structure highlights the relevance of both enthalpic and entropic contributions to the free energy of the protein-ligand interaction. Electrostatic interactions often determine the specificity of intermolecular recognition, as is also observed in the K1-compound 3 complex, e.g. Asp-32 interacting with Arg-15 AP and Lys-19 AP or Asp-10 AP binding to Lys-29. However, the major gain in binding affinity was obtained by optimizing the entropy of binding. Following a dual strategy, we first minimized the internal degrees of freedom of TFPI antagonist compound 2 by stabilizing its structural modules. Examples include the introduction of an ␣-methyl alanine at position 17 AP acting as a helix-stabilizing element or D-proline at position 5 AP acting as a turn-stabilizing element. These measures minimize the loss of entropy upon complex formation. Additionally, we aimed to gain entropy by "
            ],
            "subsections": [
                {
                    "title": "TABLE 2 Effect of compound 3 on thrombin generation in different plasmas",
                    "paragraphs": [
                        "Thrombin generation was measured at varying compound 3 concentrations with CAT as described in the legend to Fig. 7 and under \"Experimental Procedures.\" A plot of the increase of the thrombin peak as a function of the compound 3 concentration was fitted to a hyperbola yielding the EC 50 and the maximum increase of the thrombin peak at saturating compound 3 concentration. S.D. is standard deviation of 2 independent experiments in duplicate. The TFPI levels were determined as described under experimental procedures."
                    ],
                    "subsections": []
                },
                {
                    "title": "Plasma (donor-lot)",
                    "paragraphs": [
                        "Mean EC 50 S.D. displacing surface-bound water molecules from the binding partners. The release of solvent molecules was optimized by designing highly complementary surface patches on the ligand with respect to the target protein, i.e. TFPI-K1. TFPI is known to bind to FXa in a bivalent manner, where K2 as well as K1 including the acidic N terminus contribute to binding (8,9). Although there exists a large body of evidence that indicates K2 binds to the active site via its RCL in a substrate-like manner, the binding mode of K1 and the acidic N-terminal segment to FXa are currently unknown. To investigate this question, we hypothesized that K1 will exploit one of the three major exosites that have been described for FXa and other related serine proteases. These exosites are located near the Ca 2ϩ site (exosite I, located east to the active site); at the heparin binding site near the C-terminal helix (exosite II, located north to the active site); and at the cofactor factor Va binding site near the 170-helix (exosite III, located to the west of the active site). Among these possibilities exosite I can explain the observed calcium dependence of TFPI binding to FXa most easily (42)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Fold",
                    "paragraphs": [
                        "The K1 surface patch that binds to the antagonistic peptide compound 3 largely overlaps with the putative FVIIa contact area, as deduced from docking K1 to the active site of FVIIa. The structure of the complex between compound 3 and K1 explains the antagonistic effect of compound 3 to the K1-FVIIa interactions. By contrast, the antagonistic effect of compound 3 toward TFPI-FXa binding may be more complicated. Possibly, this effect invokes conformational rearrangements that are induced upon compound 3 and FXa binding toward TFPI. Such reordering may be incompatible with and may lead to the interruption of the FXa-TFPI binding. This conclusion is consistent with the slow-tight binding kinetics of the FXa-TFPI complex.",
                        "It is interesting to note that inhibition of TFPI by compound 3 was not complete and that compound 3 only partially inhibited TFPI. The extent of inhibition of TFPI by compound 3 was most pronounced when FXa inhibition was investigated in the presence of Ca 2ϩ ions only and gradually became less when phospholipids and protein S were included in the reaction mixture (Fig. 3, Table 1). This decrease of the TFPI antagonistic activity of compound 3 is likely explained by the fact that the effectivity of TFPI to inhibit FXa gradually increases in the order Ca 2ϩ , Ca 2ϩ /phospholipid, and Ca 2ϩ /phospholipid/protein S (1, 2). Furthermore, we observed that FXa inhibition by TFPI in the absence of compound 3 was biphasic and became monophasic at high concentrations of compound 3. The biphasic inhibition pattern in the absence of compound 3 is characteristic for a so-called slow-tight binding mechanism of inhibition (cf. Figs. 1, 3, and 4), which involves rapid formation of a low affinity TFPI-FXa complex followed by a slow transition to a tight FXa-TFPI* complex (1,2,41). Our kinetic data indicate that binding of compound 3 to TFPI only affects the second slow phase of FXa inhibition, i.e. prevents the transition of the weak to the tight FXa-TFPI* complex, but does not interfere with the rapid formation of the weak encounter complex (Figs. 4 and5). This also explains why the antagonistic effect of compound 3 is less when FXa is inhibited by TFPI in the presence of phospholipids and protein S, which both have been reported to primarily decrease the K i of TFPI and promote the formation of the encounter complex (1,2). Because encounter complex formation is not affected by binding of compound 3 to TFPI, the extent of inhibition of TFPI by compound 3 is less in the presence of phospholipids and protein S.",
                        "The fact that compound 3 binds to the K1 domain of TFPI and acts as a TFPI antagonist indicates that the acidic N terminus and/or K1 domain of TFPI contribute to the inhibition of FXa by TFPI. Although the K2 domain of TFPI is considered to be responsible for the inhibition of FXa (4), there are several reports that indicate that other domains of TFPI also contribute to factor Xa inhibition because inhibition of FXa by full-length TFPI is ϳ1000-fold more effective than inhibition of FXa by the isolated K2 domain (9). Apparently, the K1 domain of TFPI significantly contributes to the differences in FXa inhibition by the K2 domain and TFPI by promoting transition of the weak encounter to the tight FXa-TFPI complex, which is in line with recent observations of Peraramelli et al. (12). Because the K i of TFPI for the weak encounter complex formation is some 100fold higher than the K i for tight complex formation (1, 2), the N terminus and/or K1 domain of TFPI have an important contribution to the inhibition of FXa.",
                        "In summary, our data show that compound 3 is a potent TFPI antagonist that blocks inhibition of both FXa and the TF-FVIIa complex by TFPI and enhances thrombin generation in normal plasma and hemophilia plasma as well as in plasma from a hemophilia A patient with a circulating FVIII inhibitor. Because inhibition of TFPI with fucoidan, aptamers, and (monoclonal) antibodies shortens the clotting time of plasma and restores coagulation in animal hemophilia models (19 -26), compound 3 can potentially be used to prevent bleeding in hemophilia patients. However, it should be emphasized that compound 3 differs from the above mentioned TFPI inhibitors in the sense that compound 3 selectively binds to the K1 domain of TFPI, whereas the aptamer BAX 499 binds to K1, K3, and the C-terminal domain (25) of TFPI and monoclonal antibody mAb2021 binds to the K2 domain (26). With respect to the binding site of fucoidan there are conflicting reports. Liu et al. (21) showed that fucoidan inhibits both full-length TFPI and a K1K2 construct that indicates that it binds to K1 and/or K2, whereas others (24,43) reported that fucoidan requires the C terminus of TFPI to bind to and neutralize the anticoagulant activity of TFPI. It is not yet known which domain(s) of TFPI can be best targeted to obtain an optimal therapeutic effect of a TFPI inhibitor to provide a safe and efficient treatment of hemophilia patients."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}