{
    "id": "https://semopenalex.org/work/W4200272261",
    "authors": [
        "Sepehr Shakeri Yekta",
        "Jan Moestedt",
        "Ingrid Sundgren",
        "Erik Nordell",
        "Annika Björn",
        "Sandra Waern"
    ],
    "title": "Thermal post-treatment of digestate in order to increase biogas production with simultaneous pasteurization",
    "date": "2022-01-01",
    "abstract": "Biogas production by anaerobic digestion (AD) of organic wastes is important for the transition to fossil free fuels in both the transport sector, industries and shipping. The aim of this study was to target the residual organic matter in the outgoing residue from the AD process, so called digestate, with different thermal treatment methods in order to improve digestate degradability and biogas potential upon post-digestion. The thermal treatment was performed at 55 °C in 24 h, 70 °C in 1 h and by thermal hydrolysis process (THP; 165 °C, 8 bar in 0.33 h), and were carefully selected to offer a simultaneous possibility for pasteurization of the digestate according to the regulations in Sweden. Digestates from ten full-scale biogas plants were collected, with different substrate profiles including wastewater treatment plant (WWTP), food waste digestion, agriculture digestion and manure digestion. The results showed that all thermal treatment methods caused increased dissolved organic carbon concentration (DOC). Four of the thermal treated digestates with the highest increase in DOC were subsequently tested for the bio-methane potential. Thermal treatments at 70 °C and THP, respectively, resulted in the highest increase in bio-methane potentials, with an increase of 15-39% for one WWTP, 38 - 40% for digestate from an agriculture digestion plant and 20 - 22% for digestate from a co-digestion plant treating food waste. Interestingly, the bio-methane potential from digestate treated with the energy-intense THP method, did not show any significant difference compared to thermal treatment at 70 °C for 1 h. The outcomes of this study suggest that placing a pasteurization unit between a main digester and a post digester, when applying two-step digestion allows for a combined pasteurization and increased biogas production.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Biogas production from organic wastes using anaerobic digestion (AD) technologies is an important part in the transition towards fossil free fuels for the transport sector, industries, and shipping. In Sweden, around 2.1 TWh of biogas is produced on an annual basis from different types of organic wastes, of which 35% originates from the digestion of sewage sludge, 49% from co-digestion of food waste and industrial waste and the rest from agriculture rest products and landfills (Swedish Energy Agency, 2021). Biogas production from food-and slaughterhouse waste is generally characterized by high degree of degradation > 75% (measured as degradation of volatile solids), i.e. the conversion of organic matter into biogas is efficient (Nordell et al., 2016;Schnurer, 2016). In contrast, digestion of agriculture wastes, manure and sewage sludge often have lower degradation around 50-60% (measured as degradation of volatile solids) (Ahlberg-Eliasson et al., 2017;Appels et al., 2008;Neumann et al., 2016). Hence, the fraction of ingoing organic matter to AD processes that remains undegraded is greater with these substrates compared to food-and slaughterhouse wastes. Furthermore, most co-digestion biogas plants need to consider that foodand slaughterhouse wastes need to be pasteurized before the nutrient-rich left-over from AD processes, so called digestate, can be applied on agricultural land as biofertilizers (e.g. Animal By-Products Regulation (EC) No. 1069/2009 of the European Parliament and of Abbreviations: AD;, Anaerobic digestion; BMP;, Bio-methane potential; DOC;, Dissolved organic carbon; FM;, Fresh material; THP;, Thermal hydrolysis process; WWTP;, Wastewater treatment plant. the Council).",
                "Pasteurization is typically attained by thermal treatment of the material at a minimum of 70 • C for at least 1 h prior to AD (Grim et al., 2015). This thermal treatment could be viewed as a pre-treatment of the feedstock since it may affect the biodegradability of ingoing organic material (Grim et al., 2015). For instance, the added heat may increase the kinetics of the degradation, which could for example be a consequence of the emulation of fat into the liquid at higher temperatures making it more accessible to the microorganisms (Ek et al., 2011). Nazari et al. (2017) reported that thermal pre-treatments (80 • C, 5 h and pH 10) of different municipal wastewater sludges resulted in an increased methane production rates compared to untreated controls, while the ultimate methane yields were not significantly affected by the treatment. Appels et al. (2010) found that the efficiency of the AD slightly decreased for sewage sludge treated at 70 • C in 1 h (Grim et al., 2015;Ware and Power, 2016). In our laboratory, we observed that thermal treatment of municipal sewage sludge under pasteurization condition (70 • C for 1 h) did not have any positive effect on rate nor degree of methane production (Fig. 1; Supplementary Information). It is therefore evident that there is no conclusive evidence that pasteurization of the substrate before AD results in positive effect on methane formation rate nor yield.",
                "In general, biogas plants which treat sewage sludge are not under the same regulations regarding pasteurization. In 2013, a new proposal from the Swedish Government suggested that also WWTP sludge should be regulated, with thermal treatment as one of the main methods in order to achieve the pasteurization effect (REVAQ, 2011). One alternative to conventional thermal treatment of 70 • C for 1 h would be to use in-situ pasteurization in biogas reactors (semi-continuously fed reactors) at thermophilic temperatures (52-55 • C) with an exposure time for > 8 h (Liu et al., 2019). In-situ pasteurization does not require a separate tank which reduces the investment cost and may quite easily be introduced at an existing biogas plant. The disadvantage is however that the biogas production will be fluctuating due to the exposure time (for at least 8 h) (Liu et al., 2019), hence all equipment, such as pumps and gas upgrading unit, must be dimensioned for higher flows. Additionally, Moestedt et al. (2017) showed that thermophilic digestion in a WWTP could potentially be negative for the biogas yield compared to traditional mesophilic digestion.",
                "Alternatively, the thermal treatment for pasteurization purposes could be placed after the AD-unit (Nordell et al., 2021). Since the digestate from AD of sewage sludge typically has a dry content (total solids; TS) of 3-6% of total weight and volatile solids (VS) of 60-75% of TS (Moestedt et al., 2017), there is a large residual fraction of organic material in the outgoing material from biogas processes that remains undegraded. Enhancing the biodegradability of this residual fraction offers a possibility to increase the biogas production if an additional post-digester unit is operated. Different studies have shown a potential of increasing biogas production with 3-12% by applying a post-digester after the main digester (treating different types of substrates, e.g. food waste, manure and dewatered digested sludge), without adding new substrates nor applying any treatment of the digestate (Boe et al., 2009;Nordell and Karlsson, 2011;Nordell et al., 2021). These results are also confirmed by several years of full-scale operation with a post-digester at Linköping biogas plant operated by Tekniska verken i Linköping AB (publ.) with around 5-8% additional gas according to online measurements (personal communication Sara Hallin, process engineer at Linköping Biogas plant). It is therefore clear that the outgoing digestate can be a source of increased biogas yields with additional methane potential, depending on primarily substrate composition and organic loading rate (Menardo et al., 2011). The potential effect of the thermal treatment for pasteurization purposes on degradability of digestate and methane yield in a post-digestion unit is not fully explored. Positive effects on the overall bio-methane yield have been observed for post-treatment (e.g. thermal, mechanical and chemical treatments) of the digestate before post digestion (Kaparaju and Rintala, 2005;Somers et al., 2018). As observed by Svensson et al. (2018) thermal post-treatment could be beneficial compared to pre-treatment since AD typically is applied to reduce sludge volume, and hence, due to gas production, a smaller volume would need to be treated and therefore the thermal energy need would be lower.",
                "This study aimed to evaluate the feasibility of thermal treatment of digestate as a method to increase the overall methane yield in a postdigester unit and to simultaneously pasteurize the digestate. The specific purpose was to determine changes in dissolved organic carbon (DOC) concentrations in the digestate from several full-scale biogas plants treating different types of substrate upon thermal treatment, as a quantitative indication of the thermal treatment efficiency to solubilize residual organic matter after AD processes. Thereafter, bio-methane potential (BMP) were determined for digestates which demonstrated a high degree of DOC solubilization after thermal treatment. The use of DOC solubilization as a screening method before employing timeconsuming BMP was thus also evaluated. Additionally, a net energy balance of the thermal post-treatments was performed together with a qualitative evaluation of changes in DOC characteristics by fluorescence spectroscopy, to elucidate the mechanisms behind the effects of thermal treatment on digestate organic matter and the overall biogas yield of AD processes."
            ],
            "subsections": []
        },
        {
            "title": "Materials and methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Sample sources and overall properties",
                    "paragraphs": [
                        "Digestates were collected from different full-scale biogas plants in Sweden, including mesophilic co-digestion plants (CD), a post digester at mesophilic co-digestion plant (CDP), thermophilic co-digestion plants (TCD), wastewater treatment plants (WWTP), an agriculture biogas plant (AC) and a manure-based agriculture biogas plant (ACM) (Table 1). The full-scale biogas plants, CD1/CD2/TCD4 had pasteurization (70 • C, 1 h) of the substrate prior to the digestion. TCD3 had insitu pasteurization in the digesters by applying a thermophilic digestion temperature. ACM had post-pasteurization (70 • C, 1 h) of the digestate, samples for ACM were collected after the digester but prior to the pasteurization while ACM-70 was sampled directly after the pasteurization unit. AC/WWTP1/WWTP2 had no pasteurization of neither the substrate nor the digestate in full-scale operation (Table 1)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Thermal treatments",
                    "paragraphs": [
                        "Three thermal treatment methods were chosen based on the likelihood to be approved as a pasteurization method in Sweden. This included the thermal treatments for 55 • C and 70 • C which were performed in 500 mL bottles in water bath, exposed for 24 h and 1 h respectively starting from when the temperature in the bottles reached the target temperature. All bottles were covered with caps, but they were not gas-tight in order to avoid pressure build up. Thermal hydrolysis process (THP) treatments were also included, performed at the pilot plant at the Faculty of Engineering at Lund University (Lund, Sweden). Each treatment was performed with a sample volume of 10 L. The target temperature was 165 • C in the THP which was reached for all samples in top of the pilot tank. However due to ineffective thermal-transfer, the lowest obtained temperature in the bottom of the tank was > 96 • C for all digestate samples (WWTP1 119 • C; WWTP2 96 • C; CD1 96 • C; ACM 99 • C; AC 98 • C). The pressure was 7.5-8.0 bar prior to pressure release down to atmospheric pressure. The exposure time of the THP treatment was 20 min (0.33 h) per sample. Moreover, THP treatment resulted in a dilution of the digestate due to that steam was injected into THP chamber. All results with respect to DOC and BMP results have been compensated for this dilution to obtain comparable data. After the thermal treatments, the samples were stored at + 2 • C until the startup for selected samples of the BMP test."
                    ],
                    "subsections": []
                },
                {
                    "title": "DOC-quantifiation",
                    "paragraphs": [
                        "Immediately after each thermal treatment, the samples were centrifuged (11,000 rpm (13,000 g) for 20 min, Centrifuge 5810, Eppendorf, Germany), filtered (0.45 µm glass fiber filter, Millipore, USA) and then preserved (HCl, 2 M). THP samples were centrifuged in two steps: first 3000 rpm (RCF = 970g) for 10 min (Heraeus Labofuge 200, Thermo, US) in order to reduce the sample volume, and finally 13,000 rpm (RCF = 11,300 x g) for 10 min (MiniSpin, Eppendorf, Germany). Dissolved organic carbon (DOC) was analyzed according to standard SS-EN 1484 in triplicates from digestates (AnalytikJena multi N/C 3100, Germany). For samles to be analyzed on the spectrofluorometer the DOC was analyzed with a TOC-V analyzer (Shimadzu Corporation, Japan) using TC-IC method according to manufacturer's instructions. Total solids (TS) and volatile solids (VS) were measured and calculated according to Swedish Standard method: SS 02 81 13: 1 1981-05-20. The absorbance (254 nm) and fluorescence were simultaneously measured with a spectrofluorometer (Aqualog, Horiba Jobin Yvon) according to the manufacturer´s instructions. Synchronous-scan excitation spectra were obtained over a range of 240-600 nm with a constant offset of Δλ = 3 nm between excitation and emission wavelengths. Excitation-emission matrix spectra (EEMs) were obtained by subsequently scanning the emission spectra from 211.44 nm to 620.81 nm by increasing the excitation wavelenghts by 3.28 nm increments. The following indices were calculated from the absorbance and fluorescence values in order to assess changes in fluorescence pattern of dissolved organic matter due to thermal treatments: Slope ratio (Helms et al., 2008) (Weishaar et al., 2003); Fluoroscence index (FI) (McKnight et al., 2001); Freshness index (β: α) (Wilson and Xenopoulos, 2009); and humification index (HIX) (Ohno, 2002)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bio-methane potential test",
                    "paragraphs": [
                        "After the thermal treatments and DOC-analysis, four digestates were selected to undergo bio-methane potential test (BMP) at mesophilic conditions (38 • C), the substrate fraction WWTP1-S was evaluated separately. The BMP-tests were performed in an AMPTSII system (Bioprocess Control Sweden AB, Lund) (Strömberg et al., 2014). The principle of AMPTSII includes a CO 2 fixation unit where CO 2 is captured from the produced biogas. The remaining methane gas is volumetrically measured and registered as the volume of produced methane gas at standard conditions, i.e. at air pressure 1013.25 hPa and temperature 0 • C according to Holliger et al. (2016). The control (untreated) digestate was used as reference to withdraw the \"background\" methane production from the experiment batches (thermal treated digestate). The digestates evaluated in the BMP test were: WWTP1, WWTP2, AC and CD1. All series were performed in triplicates of glass bottles, all with dis-continuous stirring (120 s on/off). The active volume of inoculum and sample was 500 mL for each bottle. The organic loading rate was 2:1 on VS-basis (inoculum:sample). The experiment lasted for 30 d until termination, the criteria for termination according to standard method VDI 4630 was reached for all experimental batches except for AC1. The experimental batch was terminated for AC1 although the criteria was not reached since it was considered unlikely that longer degradation time would be possible in industrial application.",
                        "The rate constant (k) was calculated at day 5 according to the exponentially decreasing equation as described by Moestedt et al. (2015): kx) ) Y = Gas production; C max = maximum gas production (BMP 30 ); x = d; k = rate constant. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Energy assessment",
                    "paragraphs": [
                        "For the calculation of energy balance, the heat capacity for digestate was assumed to equal to water (1.167 kWh/t/ • C). The energy content of 1 m 3 bio-methane (P = 1,01325 bar and T = 0 • C) was set to 9.97 kWh and BMP values from day 15 was used since the HRT in a plausible postdigester were considered to likely be around that time."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical evaluation",
                    "paragraphs": [
                        "Effects of the different treatments were evaluated with paired t-Test (α: 0.05) assuming that the differences between controls and each treatment were normally distributed. Predictiveness of DOC for BMP and biomethane production rate were evaluated by calculating Pearson correlation coefficient (α: 0.05)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results and discussion",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Effects of thermal treatments on solubility of organic matter in digestate",
                    "paragraphs": [
                        "The DOC-concentrations in un-treated digestates from WWTP were low (150-153 mg/L) compared to the digestates from other plants (1180-1770 mg/L) and was also lower compared to the DOC-level reported in a similar study on anaerobic digestate at WWTP (Fernández Rodríguez et al. (2012) (624 mg/L). This low lever indicates that the soluble fraction represented a small part of the sewage sludge in the WWTPs included in this study. The DOC-levels after all thermal treatments were significantly higher compared to the untreated digestates. For digestates from WWTPs the thermal treatments resulted in a relative increase of DOC by 540-810% (up to 961-1367 mg/L) for WWTP1 and by 420-550% (up to 775-973 mg/L) for WWTP2 (Fig. 1). The highest release of DOC for WWTP1 and WWTP2 was achieved during 70 • C post-treatment (Fig. 1). Surprisingly the more energy intense THP treatment did not result in higher effects than 70 • C treatment. Several other studies have shown positive effects of THP treatment on ingoing sludge to WWTP (Chen et al., 2019;Svensson et al., 2018;Wilson and Novak, 2009), however these studies applied higher temperatures than used in this study. Solubilization of proteins, which typically is a major fraction of the organic material in digestates with high bacterial biomass (e.g. from sewage sludge digesters) may require temperatures above 150 • C (Bougrier et al., 2008). Svensson et al. (2018) observed a higher increase in biogas yield for THP on post-treatment on a process treating sewage sludge compared to food waste, which is in contradiction to the results in our study.",
                        "Anaerobic digestion of sludge in WWTPs often results in low degree of degradation and is typically assumed to be limited by the hydrolysis of the recalcitrant organic material (Appels et al., 2008). An increase in DOC concentration after thermal treatment suggests that the recalcitrant structures in the digestate has been solubilized (i.e. hydrolyzed). This suggests that placing thermal treatment after a AD unit in WWTP could allow for an enhanced solubilization of the organic material. For the co-digestion plants (CD1 and CD2) and corresponding post digestion units (CDP1 and CDP2) the thermal treatments also resulted in an increased DOC-concentration, indicating successful solubilization of organic material (Fig. 1). Compared to control, thermal treatment at 55 • C resulted in an increase in DOC by 35-121% (up to 576-1910 mg/L) while 70 • C resulted in an increase by 56-148% (up to 1000-2020 mg/L). THP was only applied on digestate from CD1 and CDP1 where the increased DOC concentrations had marginal differences compared to DOC concentrations in digestate samples treated at 70 • C, similar to the results for WWTPs (Fig. 1).",
                        "The high increase in DOC levels after 70 • C, 1 h treatment was not expected for digestates CD1, CDP1, CD2, CDP2 and TCD4 since all these plants already have pasteurization of the substrate at 70 • C, 1 h prior to AD unit. Hence, despite that the material has already been treated for 1 h at 70 • C, a repetition of the treatment after AD resulted in an additional effect on the DOC-level. Since all the incoming material has already been thermally treated, the positive effect on digestates suggest, like the WWTP, that some conversion of the organic material during the AD process has occurred, resulting in higher receptiveness to thermal treatment after digestion. This result is in line with earlier studies showing that post-treatment could be favorable compared to pretreatment, another reason emphasized has been that the anaerobic processes result in smaller volumes to treat and consequently lower heat demand for post-compared to pre-treatment (Svensson et al., 2018). The positive effects of thermal treatment on DOC solubilization, might be related to lysis of microorganisms involved in the AD process and/or hydrolysis of by-products and residues of the digestion process such as extracellular polymeric substances (EPS), which have been reported to be formed during AD (Achu-Nges et al., 2012). The lowest effect of the thermal treatment (70 • C) on DOC concentration occurred in the digestates from thermophilic AD systems (TCD3 by 12-14% and TCD4 by 40-49%). Even though there was a slight increase when treating them for 1 h at 70 • C, the increase was only significant in TCD4 (Fig. 1). As expected, treatment at 55 • C, 24 h did not have any significant effect on the thermophilic digestates since it only represents a prolongation of the digestion process with 24 h. Hence, a thermophilic digestion temperature could be assumed to accomplish the similar effect as thermal post-treatment. THP was not evaluated for the thermophilic digestates due to lack of capacity in the pilot plant of the THP.",
                        "The AC and ACM plants had substrates dominated by agricultural wastes rich in lignocellulosic materials, such as cereals, crops and grain chaffs (Table 1). Such materials are often considered recalcitrant due to the complex structure and pre-treatments has been vastly evaluated (Carrere et al., 2016). The thermal post-treatments proved to be efficient in increasing the DOC-content of both AC and ACM. Although both 55 • C, 24 h (increased by 40-52%) and THP-treatment (increased by 47-64%) had significant effect on the DOC-concentration the 70 • C, 1 h had the highest impact, increasing the DOC-concentration to 2700-3100 mg/L (increase by 77-78%). In order to confirm the applicability of the experimental results from this study to full-scale the ACM plant was selected since it already had thermal post-treatment at 70 • C and post-digestion at place. Hence, samples were retrieved before and after the post-treatment. In full-scale the DOC concentration (in ACM-70) was 2700 mg/L, and the experimental results from treating ACM at 70 • C, 1 h, resulted in 2733 mg/L (Fig. 1). Due to the almost identical results from full-scale and the experiments, the results obtained in this study can be considered applicable to full-scale processes."
                    ],
                    "subsections": []
                },
                {
                    "title": "Effects of thermal treatments on overall DOC properties in digestate",
                    "paragraphs": [
                        "The chemical and structural characteristics of dissolved organic mater (DOM) have been reported most likely to affect its biodegradation (Guo et al., 2012). DOM has several different fluorophores whose fluoresent characteristics contain a lot of information about structure and functional groups. Thus certain spectral parameters can be used to assess e.g. changes in degree of humification, aromaticity, and molecular weight of DOM (Guo et al., 2012). In this study apparent molecular weight of DOC decreased after thermal treatment, represented by increased SR index (Table 2), indicating the presence of smaller organic molecules in thermal treated digestate. Although the main mechanisms cannot be discerned by available data, these observations suggest that thermal treatment might have resulted in hydrolysis of larger organic molecules and a release of their mono-and oligomeric units. Also, in general fluorescence characteristics of digestate DOC revealed that the relative contribution of aromatic carbon decreased after thermal treatment represented by decreased SUVA 254 index (Table 2). This suggests that mainly non-aromatic compounds were liberated from the solid phase after thermal treatment of digestate, which corresponds to increased bio-methane potentials determined. Alternatively, this was a result of aromatic compounds being degraded. This was reinforced by the humification index (HIX) which indicated a lower contribution of humic-like substances after thermal treatment, except for digestate from TCD3 and TCD4 (Table 2). The chemical and structural characteristics of DOC have been reported earlier most likely to affect its biodegradation (Guo et al., 2012). Also, the operational temperature of CD reactors has been reported as a likely important factor regarding observed differences in DOC characteristics (Yekta et al., 2012).",
                        "Interestingly, freshness index (β: α) increased particularly from 0.70 to 0.72 in untreated controls to 1.0-1.86 after thermal treatment of digestate from sewage sludge digesters (Table 2). Assuming that lower values for this index represents predominance of decomposed (i.e. aged) organic moiety, it can be postulated that potential lysis of microbial cells and the release of cell-content upon thermal treatment might have contributed to higher values of the freshness index particularly in WWTP1 and WWTP2. However, there was no conclusive observation with respect to changes in FI (Table 2)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bio-methane potential tests (BMP)",
                    "paragraphs": [
                        "Digestates that demonstrated the highest release of DOC upon thermal treatment were selected for BMP analysis and Fig. 2 illustrates the results of BMP test on untreated and thermally treated digestate samples. Both WWTPs had high relative release of DOC (> 420%) and were selected together with CD1 (increased with 120-150%) and AC (increased with 40-80%) for BMP test. For these samples, treatment at the 70 • C and THP had shown the highest effect on the release of DOC and the efficiency of the treatments was confirmed by the increase in BMP, except for WWTP2 (Fig. 2). The BMP results for thermally treated digestate from WWTP2 were instead in line with results by Sambusiti et al. (2015) that reported negative effect by thermal treatment (80 • C) on digestates from agricultural wastes. To evaluate the predictiveness of BMP using DOC analysis, correlation analysis was performed on both absolute numbers and relative change compared to controls. Accordingly, WWTP1 (r = 0.95) and AC (r = 0.97) showed significant correlation between absolute values (p < 0.05) and DOC while comparing relative change resulted in significant correlation (p < 0.05) for AC (r = 0.98) and CD1 (r = 0.94). This indicates that change in DOC can be used as an indicator for BMP, although it was not accurate for all digestates.",
                        "In addition, thermal treatments resulted in higher rate of biomethane formation compared to untreated digestate (Fig. 3). As shown in Fig. 3, different digestates were grouped in two clusters when studying the The WWTPs had similar DOC as well as similar rate constant before and after treatment while AC and CD1 grouped together. Interestingly, increasing DOC resulted in increasing rate constant for all samples and treatments and correlation analysis of the biomethane formation rate and DOC levels after thermal treatment were significant (p < 0.05) for WWTP1 (r = 0.88), WWTP2 (r = 0.95) and AC (r = 0.96). For CD1 the correlation however was not significant (r = 0.68, p = 0.06). This however shows that the released DOC resulted in an enhanced access ability of residual organic matter in digestate and faster conversion into biogas. Moreover, thermally treated samples of WWTP1 (55/70/THP) reached their maximal BMP already after 15 d, while the control still had a positive slope in production when the experiment was terminated after 30 d (Fig. 2; Fig. 4). In WWTP2 the formation rate was similar but the untreated sample did result in the highest BMP, which was an exception compared to the other three digestates evaluated. Furthermore, the THP treatment of the digestates did not show any additional increase compared to treatment at 70 • C even though both treatments seemingly have a greater effect on BMP than 55 • C, 24 h. Evaluating the difference in BMP between thermal treatments and controls at day 15 (illustrated in Fig. 4) showed that only treatment at 70 • C for 1 h resulted in significantly increased BMP. Since THPtreatment additionally in general is more energy demanding compared to 70 • C, 1 h, and since district heating or residual heating may be used to heat up to 70 • C, 70 • C was determined to be the most promising thermal post treatment regarding the possibility to realize it in full-scale with respect to economics in both operational cost as well as investment cost. It should be noted that the temperature used in this study during THP treatment was lower than other similar studies reporting more positive effects from THP-treatments. Wilson and Novak (2009) studied solubilization of primary-and secondary sludge at temperatures from   C showing increasing release of DOC at higher temperatures. Higher DOC formation and BMP could therefore be expected if higher temperatures had been used for THP-treatment in this study."
                    ],
                    "subsections": []
                },
                {
                    "title": "Energy assessment",
                    "paragraphs": [
                        "An essential factor in the evaluation of the thermal post treatment is the net energy balance. Therefore, the energy balance for the two strictly thermal treatments (55 • C and 70 • C) were calculated for the digestates that were included in the BMP-evaluation (Table 3). Despite the higher BMP after treatment except for WWTP2, all energy balances were negative, meaning that more heat is required compared to the energy content of the extra biogas gained after thermal treatment. Accordingly, no thermal treatment should be applied as a method to only increase the biomethane production. However, it should be noted that biogas can be considered a primary energy source that holds a higher commercial value compared to heat as a secondary energy source. The value of biogas (in terms of monetary value/kWh) is around six times higher than that of district heating. Taking that into account, thermal post treatment of WWTP1 (55 • C and 70 • C) and CD1 (70 • C) would be profitable. If a pasteurization step needs to be added following legislation, for example at WWTP1, it is obvious that it would be favorable to position the thermal treatment after the AD unit, which allows for partial compensation of the energy needed for pasteurization through production of biogas. Additionally, biogas production does lead to reduced amount of sludge (as organic matter are converted to methane and carbon dioxide), the volume reduction following higher biogas production could theoretically lead to reduced sludge-handling cost."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "The outcomes of this study highlight that DOC change upon thermal treatment is a reasonable indicator to predict changes in methane production rate, as well as the BMP. Thermal treatment at investigated temperatures (55, 70, THP) resulted in increased DOC concentrations as well as changed DOC properties compared to the untreated control in all digestate samples from mesophilic AD plants in this study. Moreover, thermal post-treatment of digestate, particularly under pasteurization condition of 70 • C for 1 h increased the methane potential, except for the digestate sample from WWTP. Nevertheless, our observations suggest that placing a pasteurization unit after AD unit but prior to a postdigestion unit may allow to increase methane production simultaneously with pasteurization. However, a thermal post treatment is recommended only if a positive energy balance can be obtained and/or pasteurization is required prior to downstream processing of the digestate. Thus, possible synergies with potentially extended pasteurization directive at biogas plants exist. In future studies on thermal post treatment the effects on sludge treatment, e.g. dewatering and volume of sludge for disposal, should be evaluated.   "
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "This study was supported by the Swedish Energy Agency [Grant number: 35624-2] and Tekniska verken i Linköping AB (public) and conducted within the Biogas Research Center hosted by Linköping University, Sweden. Tekniska verken i Linköping, Scandinavian Biogas Fuels, NSR, Swedish Biogas International, Västblekinge Miljö and Purac are acknowledged for their active contributions to the project. The authors would like to thank Borbála Erdei at the Faculty of Engineering at Lund University for her time and effort with the THP treatments, and Anna Sieczko and Luka Safaric at the Depratment of Thematic Studies Environmental Change at Linköping University for their support connected to the fluorescence spectroscopic analyses."
            ],
            "subsections": []
        },
        {
            "title": "Declaration of Competing Interest",
            "paragraphs": [
                "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
            ],
            "subsections": []
        },
        {
            "title": "Appendix A. Supporting information",
            "paragraphs": [
                "Supplementary data associated with this article can be found in the online version at doi:10.1016/j.jbiotec.2021.12.007."
            ],
            "subsections": []
        }
    ]
}