{
    "id": "US20220347135",
    "authors": [
        "Marina Sirota",
        "Brian Le",
        "Ronald Wong",
        "David Stevenson"
    ],
    "title": "Methods of Treatment of Spontaneous Preterm Birth",
    "date": "2020-03-20 00:00:00",
    "abstract": "Spontaneous preterm birth (sPTB) is premature delivery prior to 37 weeks of pregnancy and is a leading cause of infant mortality worldwide. sPTB is associated with a unique gene expression profile. Identified herein are numerous safe and proven therapeutic compositions used for unrelated indications that have the biological effect of reversing, in part, the gene expression profile of sPTB and which can be used in preventative or interventional treatments to prevent, delay, or ameliorate sPTB. The repurposed drugs include several Class A and Class B therapeutics that are regarded as safe or low risk in pregnant subjects.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Preterm birth (PTB) or birth before 37 weeks of gestation is the leading cause of infant mortality worldwide. According to global estimates in 2015, complications arising from PTB were responsible for 35.5% of neonatal deaths (and 17.8% of deaths in children under 5). Estimated rates of PTB vary by country with rates as low as 5% and as high as 18%, with a worldwide estimate of 11.1%. Even in non-fatal cases, prematurely-born children are at a higher risk for life-long neurodevelopmental sequelae, such as motor and cognitive impairments. Approximately two-thirds of PTB cases are spontaneous preterm births (sPTBs), an umbrella term for both spontaneous preterm labor (early onset of regular contractions and cervical changes) and preterm premature rupture of the membranes (PPROM, early water breaking). sPTB is difficult to predict, with ongoing studies focused on identifying biological and demographic risk factors as well as potential warning signs during pregnancy. Some studies have suggested that sPTB may be caused by changes in the maternal immune system or in the interplay between the fetal and maternal immune systems.",
                        "While early diagnosis and identification of patients at risk for sPTB is an important goal, there are very few therapeutic options available to prevent sPTB. Cervical cerclage, a surgical procedure to close the cervix, has been shown to have some success in preventing sPTB, however, it is an invasive procedure. For pharmacological measures, vaginally-applied progesterone (P4) supplementation has shown some success in preventing PTB in women with short cervixes. In 2011, the United States Food and Drug Administration (FDA) approved injections of hydroxyprogesterone caproate, a synthetic progestin P4, to prevent recurrent sPTB in the USA. However, these treatments have limited success, reducing the risk of PTB by approximately one-third. Accordingly, there remains a need in the art foe new therapies and preventative medicines for PTB."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define preterm birth",
                        "describe limitations of current treatments",
                        "motivate need for new therapies"
                    ],
                    "num_characters": 1983,
                    "outline_medium": [
                        "describe preterm birth"
                    ],
                    "outline_short": [
                        "describe preterm birth"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "Traditional development of novel pharmaceuticals is both expensive and time-consuming. Drug repositioning, or drug “repurposing”, is the process of discovering new indications for existing drugs. By searching for new applications of drugs that are already FDA-approved for use in humans, development time and costs can be substantially reduced. Existing drugs have already undergone extensive clinical testing and development and have well-established safety and pharmacokinetic profiles. Some examples of successful repositioning include atomoxetine for attention-deficit hyperactivity disorder (ADHD), sildenafil for erectile dysfunction, and finasteride for hair loss. Safety is an especially important consideration within the context of pregnancies; therefore, by working with existing approved drugs, such as FDA-approved drugs, potential drugs for prevention of sPTB with no known adverse effects to the mother or the fetus could potentially be identified.",
                        "With the increasing availability of large public datasets, computational drug repositioning has emerged as a potential approach to identify novel indications for existing drugs. Gene expression microarrays have been used extensively to study genome-wide effects of perturbagens (e.g. drugs) as well as disease states. Differential gene expression profiles can be generated by comparing microarray data from drug-treated samples with those of unperturbed samples. These profiles consist of genes that are up- or down-regulated in cells treated with different compounds relative to those unperturbed. Similarly, disease gene expression signatures can be generated by comparing disease samples with healthy controls. One computational approach utilizes a pattern-matching strategy to find drugs and diseases with opposite differential gene expression profiles—that is, combinations in which genes up- or down-regulated in a disease are down- or up-regulated, respectively, by drug treatment. The hypothesis behind this strategy is that if a disease with a set of gene changes is matched with a drug with the opposite set of gene changes, then that drug could potentially be used therapeutically for the disease.",
                        "During pregnancy, the immune system maintains a tolerogenic anti-inflammatory state by proliferating regulatory T-cells until late gestation. At the end of pregnancy, a switch to a pro-inflammatory state promotes labor. To sustain pregnancy, the balance between innate and adaptive immune cells must be maintained, with a premature shift in the balance potentially leading to preterm labor. In a prior study by the inventors of the present disclosure, a cross-study meta-analysis was performed to identify genome-wide differences associated with sPTB, as described in Vora, et al. Meta-Analysis of Maternal and Fetal Transcriptomic Data Elucidates the Role of Adaptive and Innate Immunity in Preterm Birth. Front Immunol. 2018;9:993. Pathway analyses of these genes identified enrichment in immune-related pathways, with sPTB associated with the up-regulation of innate immunity and down-regulation of adaptive immunity. In particular, genes that were down-regulated were involved in biological processes including T-cell receptor signaling and transduction, B-cell receptor signaling, leukocyte activation, and lymphocyte activation. Upregulated innate immunity processes included IL-1-signaling and neutrophil degranulation.",
                        "With the immune system implicated in sPTB, the inventors of the present disclosure applied a computational drug repositioning approach to drug and disease gene expression profiles to identify potential new treatments for sPTB. FIG. 1 summarizes the general workflow of the repositioning search. Data from the Gene Expression Omnibus (GEO), a public genomics data repository administered by the National Center for Biotechnology Information, contains over 103,000 gene expression studies across 2.6 million microarray samples. Data in GEO was used to first identify a human gene expression profile of sPTB, followed by querying existing drug gene expression profiles (derived from human cell lines) from the Connectivity Map (CMap) and the Library of Integrated Network-Based Cellular Signatures (LINCS) L1000 datasets, resulting in the identification a set of drugs with reversed differential gene expression profiles from that of sPTB. The identified drugs are medications that are all currently used in humans for different indications.",
                        "P4, the existing standard for preventing sPTB, is one of the 83 compounds identified in the screen. Of the identified drugs, 81 of these have a higher reversal score than P4. The list was further narrowed down by focusing on those with plausible safety profiles that fall within the pregnancy category A or B designation, yielding a total of 13 potential drugs.",
                        "Provided herein are novel therapeutic methods for the prevention of sPTB, by the novel administration of certain known agents to subjects at risk of sPTB, wherein the agents partially reverse gene expression profiles associated with sPTB, creating a therapeutic effect that prevents or treats sPTB. The methods of the invention are described in more detail next."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce drug repositioning",
                        "describe benefits of repositioning",
                        "explain computational approach",
                        "describe gene expression profiles",
                        "summarize disease gene expression signatures",
                        "explain pattern-matching strategy",
                        "describe immune system during pregnancy",
                        "summarize prior study on sPTB",
                        "apply computational approach to sPTB",
                        "summarize identified potential treatments"
                    ],
                    "num_characters": 5168,
                    "outline_medium": [
                        "motivate drug repositioning",
                        "explain computational drug repositioning",
                        "describe immune system in pregnancy",
                        "summarize prior study on sPTB",
                        "outline computational approach"
                    ],
                    "outline_short": [
                        "motivate drug repositioning",
                        "describe computational approach"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The general method of the invention encompasses a method of treating sPTB in a subject by the novel administration of a therapeutic composition to the subject, wherein the therapeutic composition comprises one or more repurposed drugs having an sPTB gene expression reversal effect. The therapeutic composition is administered in a therapeutically effective amount to a subject at risk of or suffering from sPTB.",
                        "As used herein spontaneous preterm birth or sPTB is as known in the art, a condition characterized by delivery at less than thirty seven weeks of pregnancy, as defined by the World Health Organization. As used herein, the “treatment” of sPTB means a treatment that has any beneficial effect in sPTB, including, for example, a treatment that reduces the risk of sPTB, reduces one or more symptoms associated with sPTB, delays delivery by a subject having sPTB symptoms, prevents delivery by a subject having sPTB symptoms, reduces the risk of perinatal mortality, reduces the risk of fetal morbidity or mortality, or otherwise inhibits, ameliorates, or prevents the occurrence of preterm delivery or symptoms associated therewith. Maternal symptoms of sPTB include, preterm labor, preterm spontaneous rupture of membranes, preterm premature rupture of membranes (PPROM), decidual hemorrhage, abruptionuterine overdistention, cervical incompetence, and cervicovaginal infections. Fetal morbidities associated with sPTB include respiratory distress syndrome, neurodevelopmental problems, cerebral palsy, bronchopulmonary dysplasia, seizure disorders, blindness, deafness, and retinopathy of prematurity. In some embodiments, treatment delays delivery, compared to delivery time in untreated mothers undergoing sPTB, which may help the fetus have better post-birth outcomes by allowing developmental advance.",
                        "The subject may be any pregnant female animal, including a human or non-human animal species such as a test animal, domestic animal, livestock animal, or veterinary subject, including mice, rats, dogs, cats, cows, horses, and other animals.",
                        "In a primary implementation, the treatment is a preventative treatment administered to a subject at risk of sPTB. The treatment may also be an interventional treatment applied to a subject undergoing premature delivery, in order to inhibit delivery, delay delivery, or decrease fetal morbidity or mortality. In one embodiment, the subject at risk of sPTB is a pregnant subject at any stage of pregnancy. In some embodiments, the subject is a pregnant subject at between 8 weeks and 37 weeks, a pregnant subject at between 16 weeks and 37 weeks, a pregnant subject at between 8 weeks and successful delivery, a subject at between 16 weeks and successful delivery, or a subject at any other stage of pregnancy. In another embodiment, the subject is a pre-pregnancy subject, for example, a subject utilizing the sPTB reversing agents of the invention as a pre-pregnancy treatment to reduce the risk of sPTB in a subsequent pregnancy. In one embodiment, the subject is a subject having one or more risk factors of sPTB, including, for example, a subject having prior sPTB history, a subject having a short cervical length, for example, less than 25 mm, a subject having abnormal uterine Doppler flow, Caucasian ethnicity, having a maternal family history of diabetes or preeclampsia, a family history of low birth weight babies, short stature, receipt of hormonal fertility treatment, hypertension, family history of gestational diabetes, and maternal family history of miscarriage, low BMI (for example, a BMI of less than 20). In various embodiments, the subject at risk of sPTB is a subject having any symptoms of premature delivery, including, premature contractions, PPROM, decidual hemorrhage, abruptionuterine overdistention, and other conditions associated with premature delivery.",
                        "The treatment encompasses the administration of one or more sPTB-reversing agents. An sPTB-reversing agent is any composition of matter which partially reverses differential gene expression of one or more sPTB genes. An sPTB gene, as used herein, is a gene wherein the expression of the gene is typically altered in subjects having sPTB, for example, being upregulated or downregulated as compared to its expression in pregnant subjects not having sPTB. For example, if a gene's expression is increased in sPTB, the selected sPTB-reversing agent will decrease the expression of the gene, and likewise, if a gene is downregulated in sPTB, the selected sPTB-reversing agent will increase the expression of the sPTB gene. In one embodiment, the sPTB gene is a gene selected from Table 2. With respect to an enumerated sPTB gene, an sPTB-reversing agent is a composition of matter that reverses the sPTB-associated upregulation or downregulation of the gene, for example, partially or wholly reversing the sPTB expression level. In various embodiments, the reversal is at least 10%, at least 20%, at least 30%, at least 40%, at least 50%, at least 60%, at least 70%, at least 80%, at least 90%, or full reversal of the differential expression of the gene observed in sPTB subjects.",
                        "In various embodiment, the sPTB-reversing agent is an agent which reverses the expression of multiple sPTB genes comprising an sPTB signature or profile. The sPTB profile comprises a grouping of one or more genes that are upregulated or downregulated in sPTB compared to expression in non-sPTB subjects. In various embodiments, the sPTB signature comprises at least 10, at least 20, at least 30, at least 40, at least 50, at least 60, at least 75, at least 100, at least 125, at least 150, at least 175, or at least 200 sPTB genes, for example, sPTB genes selected from Table 2. In one embodiment, the sPTB signature comprises all or substantially all genes from Table 2.",
                        "The sPTB-reversing agent may be any agent having a biological effect encompassing partial offset of an sPTB gene expression profile, meaning any measurable reversal effect for one or more differentially expressed sPTB genes. In various embodiments, the reversal comprises measurable reversal of at least 10%, at least 15%, at least 20%, at least 25%, at least 30%, at least 35%, at least 40%, at least 45%, at least 50%, at least 55%, at least 60%, at least 65%, at least 70%, at least 75%, at least 80%, or at least 90% of the genes defining the selected PTB gene expression profile, for example, genes selected from Table 2. in various implementations, the reversal may encompass reversing sPTB-associated differential gene expression of at least five, at least 10, at least 20 at least 50, or at least 100 PTB genes in the selected sPTB gene expression profile, for example an sPTB gene expression profile based on genes in Table 2.",
                        "The sPTB-reversing agent will be administered in a therapeutically effective amount. As used herein, a therapeutically effective amount is an amount sufficient to measurably reverse the expression of a selected number or percentage genes in a selected sPTB gene expression profile, for example, at reversing the expression of at least 5, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 125, 150, 175, or 200 sPTB genes from the selected signature, for example an sPTB signature comprising at least 25, 50, 75, 100, 125, 150, 175, 200, or all genes of Table 2.",
                        "The one or more sPTB-reversing agents may comprise an agent selected from Table 1. The one or more sPTB-reversing agents may be administered in a therapeutic composition. A therapeutic composition is a composition comprising at least one sPTB-reversing agent, and may further comprise any number of additional pharmaceutically acceptable (e.g., biocompatible, safe, and/or well tolerated) constituents, for example, carriers, excipients, fillers, salts, bulking agents, stabilizers, solubilizers, release kinetics modulating compositions, and other compositions suitable for administration of the selected agent.",
                        "Any method of administration suitable for the therapeutic composition may be utilized, including by oral, intravenous, subcutaneous, intramuscular, intravaginal (e.g. by cream or suppository), or topical drug delivery routes. Dosages will be selected based on the effective therapeutic range of the selected composition and its toxicity, ADMIT, and other characteristics, as known in the art.",
                        "Therapeutic compositions comprising combination products are within the scope of the invention, a combination product being a therapeutic composition comprising two or more sPTB-reversing agents in a single formulation or dosage form, for example, a tablet, capsule, tube, suppository, injection vial, or other dosage form wherein the two or more sPTB-reversing agents are combined. In an alternative implementation, the two or more sPTB-reversing agents are provided together as separate dosage forms, for example, two separate capsules or tablets, for example, packaged in a single packet, box, or other packaging item.",
                        "It will be understood that the scope of the invention encompasses sPTB-reversing agents comprising derivatives, analogs, and variants of the sPTB-reversing agents enumerated herein, e.g. any chemical variant of an agent enumerated herein agent which retains substantial level of activity of the parent composition.",
                        "Specific Implementations of the Invention. In a primary implementation, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, comprising one or more agents that partially reverse the gene expression profile associated with sPTB. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of one or more agents that partially reverse the gene expression profile associated with sPTB. In another aspect, the scope of the invention encompasses a method of making a medicament for use in the treatment of sPTB comprising the use of one or more agents that partially reverse the gene expression profile associated with sPTB. In various embodiments, the one or more agents that partially reverse the gene expression profile associated with sPTB is selected from Table 2. In various embodiments, the treatment is a preventative treatment that reduces the risk of sPTB or ameliorates the severity of one or more sPTB symptoms. In various embodiments, the subject is a subject that is pregnant, for example, a subject having one or more risk factors or symptoms of sPTB. In various embodiments, the treatment is interventional, administered to a subject undergoing or having a symptom of premature delivery.",
                        "The scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, comprising one or more agents that partially reverse the gene expression profile associated with sPTB selected from the group consisting of: naproxen, cefotaxime, levopropoxyphene, prednisone, vorinostat, brompheniramine, genistein, valproic acid, cefoperazone, alprostadil, lansoprazole, iopamidol, letrozole, molindone, fluticasone, estradiol, isoxicam, thiamphenicol, guanabenz, isometheptene, isoniazid, sulfadimethoxine, ribavirin, pioglitazone, benzocaine, pentoxifylline, meclofenamic acid, rosiglitazone, methotrexate, domperidone, amitriptyline, vinblastine, naringenin, fulvestrant, sodium phenylbutyrate, haloperidol, zalcitabine, zuclopenthixol, iohexol, adenosine phosphate, iodixanol, viomycin, nimodipine, ciclosporin, rifabutin, podophyllotoxin, ceforanide, sirolimus, ajmaline, diloxanide, chlortalidone, trimethobenzamide, timolol, tenoxicam, ketotifen, geldanamycin, dantrolene, dapsone, streptozocin, raloxifene, ambroxol, benzathine benzylpenicillin, finasteride, trifluoperazine, vanoxerine, thiamazole, homosalate, levomepromazine, co-dergocrine mesilate, oxyphenbutazone, promazine, carisoprodol, niclosamide, methoxamine, tocainide, cefotiam, maprotiline, resveratrol, progesterone, and nadolol. In one embodiment, the agent is lansoprazole. In one embodiment, the agent is cefotaxime. In one embodiment, the agent is rifabutin. In one embodiment, the agent is chlortalidone. In one embodiment, the agent is benzathine benzylpenicillin. In one embodiment, the agent is maprotiline. In one embodiment, the agent is naproxen.",
                        "In other embodiments, the agent that partially reverses the gene expression profile associated with sPTB is metformin, folic acid, or clotrimazole.",
                        "In related implementations, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount one or more agents selected from the group consisting of: naproxen, cefotaxime, levopropoxyphene, prednisone, vorinostat, brompheniramine, genistein, valproic acid, cefoperazone, alprostadil, lansoprazole, iopamidol, letrozole, molindone, fluticasone, estradiol, isoxicam, thiamphenicol, guanabenz, isometheptene, isoniazid, sulfadimethoxine, ribavirin, pioglitazone, benzocaine, pentoxifylline, meclofenamic acid, rosiglitazone, methotrexate, domperidone, amitriptyline, vinblastine, naringenin, fulvestrant, sodium phenylbutyrate, haloperidol, zalcitabine, zuclopenthixol, iohexol, adenosine phosphate, iodixanol, viomycin, nimodipine, ciclosporin, rifabutin, podophyllotoxin, ceforanide, sirolimus, ajmaline, diloxanide, chlortalidone, trimethobenzamide, timolol, tenoxicam, ketotifen, geldanamycin, dantrolene, dapsone, streptozocin, raloxifene, ambroxol, benzathine benzylpenicillin, finasteride, trifluoperazine, vanoxerine, thiamazole, homosalate, levomepromazine, co-dergocrine mesilate, oxyphenbutazone, promazine, metformin, carisoprodol, niclosamide, methoxamine, folic acid, clotrimazole, tocainide, cefotiam, maprotiline, resveratrol, progesterone, and nadolol. In one embodiment, the agent is lansoprazole. In one embodiment, the agent is cefotaxime. In one embodiment, the agent is rifabutin. In one embodiment, the agent is chlortalidone. In one embodiment, the agent is benzathine benzylpenicillin. In one embodiment, the agent is maprotiline. In one embodiment, the agent is naproxen.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising lansoprazole. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of lansoprazole, for example lansoprazole administered at a dosage of 0.1-5 mg/kg/day, for example, 0.5 to 1.5 mg/kg/day, for example, formulated for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising cefotaxime. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of cefotaxime, for example cefotaxime administered at a dosage of 20-200 mg/kg/day, for example, 50-180 mg/kg/day, for example, formulated for intravenous or intramuscular injection delivery and administered by intravenous or intramuscular injection.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising rifabutin. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of rifabutin, for example rifabutin administered at a dosage of 5-50 mg/kg/day, for example, formulated. for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising chlortalidone, also known as chlorthalidone. in a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of chlortalidone, for example chlortalidone administered at a dosage of 25-100 mg/kg/day, for example, formulated for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising benzathine benzylpenicillin. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of benzathine benzylpenicillin, for example chlortalidone administered at a dosage of 25-100 mg/kg/day, for example, 1-3 million International Units, for example, formulated for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising metformin. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of metformin, for example metformin administered at a dosage of 10-100 mg/kg/day, for example, 2050 mg/kg/day, for example, formulated for oral delivery and administered orally",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising folic acid or folate. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of folic acid, for example folic acid administered at a dosage of 1-5 mg/kg/day, for example, formulated for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising clotrimazole. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of clotrimazole, for example clotrimazole administered at a dosage of 1-50 mg/kg/day, for example, 5-10 mg/kg/day, for example, formulated for oral delivery and administered orally or formulated for topical delivery, for example, as a vaginal cream or vaginal suppository.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising maprotiline. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of maprotiline, for example maprotiline administered at a dosage of 1-50 mg/kg/day, for example 10-25 mg/kg/day, for example, formulated for oral delivery and administered orally.",
                        "In one embodiment, the scope of the invention encompasses a therapeutic composition for use in a method of treating sPTB, the therapeutic comprising naproxen. In a related embodiment, the scope of the invention encompasses a method of treating sPTB in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of naproxen, for example maprotiline administered at a dosage of 1-10 mg/kg/day, for example 2-5 mg/kg/day, for example, formulated for oral delivery and administered orally. Additional sPTB-reversing agents include: antihistamines antipsychotics, antidiabetics, adrenergic agonists, nonsteroidal anti-inflammatory compositions, antibiotics, antifungals, proton-pump inhibitors, calcium channel blockers, modulators, including inhibitors, of CYP1A2, modulators, including inhibitors, of CYP3A4, modulators, including inhibitors, of CYP2C9, modulators, including inhibitors, of CYP2D6, modulators, including inhibitors, of multidrug resistance protein 1 (MDR1), modulators, including inhibitors, of dopamine receptor D2 (D2R), modulators, including inhibitors, of histamine receptor H1 (HRH1), and modulators, including inhibitors, of prostaglandin G/H synthase 1 (PTGS1)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define spontaneous preterm birth (sPTB)",
                        "describe symptoms of sPTB",
                        "describe fetal morbidities associated with sPTB",
                        "introduce subject of treatment",
                        "describe primary implementation of treatment",
                        "describe interventional treatment",
                        "introduce sPTB-reversing agents",
                        "describe sPTB gene expression profile",
                        "define therapeutically effective amount",
                        "describe administration routes",
                        "introduce therapeutic composition",
                        "describe combination products",
                        "introduce derivatives, analogs, and variants of sPTB-reversing agents",
                        "describe primary implementation of therapeutic composition",
                        "describe method of treating sPTB",
                        "describe method of making medicament",
                        "introduce specific sPTB-reversing agents",
                        "describe preventative treatment",
                        "describe interventional treatment",
                        "describe subject selection",
                        "introduce naproxen as sPTB-reversing agent",
                        "introduce cefotaxime as sPTB-reversing agent",
                        "introduce rifabutin as sPTB-reversing agent",
                        "introduce chlortalidone as sPTB-reversing agent",
                        "introduce benzathine benzylpenicillin as sPTB-reversing agent",
                        "introduce maprotiline as sPTB-reversing agent",
                        "introduce metformin as sPTB-reversing agent",
                        "introduce folic acid as sPTB-reversing agent",
                        "introduce clotrimazole as sPTB-reversing agent",
                        "describe dosage of lansoprazole",
                        "describe dosage of cefotaxime",
                        "describe dosage of rifabutin",
                        "describe dosage of chlortalidone",
                        "describe dosage of benzathine benzylpenicillin",
                        "describe dosage of metformin",
                        "describe dosage of folic acid",
                        "describe dosage of clotrimazole",
                        "describe dosage of maprotiline",
                        "describe dosage of naproxen",
                        "introduce additional sPTB-reversing agents",
                        "conclude description of invention"
                    ],
                    "num_characters": 20969,
                    "outline_medium": [
                        "define spontaneous preterm birth (sPTB)",
                        "describe treatment of sPTB",
                        "introduce therapeutic composition",
                        "define sPTB gene expression profile",
                        "describe sPTB-reversing agents",
                        "introduce therapeutically effective amount",
                        "describe administration routes",
                        "introduce combination products",
                        "describe derivatives, analogs, and variants",
                        "introduce primary implementation",
                        "describe method of treating sPTB",
                        "introduce method of making a medicament",
                        "describe preventative treatment",
                        "describe interventional treatment",
                        "introduce specific sPTB-reversing agents",
                        "describe naproxen",
                        "describe cefotaxime",
                        "describe rifabutin",
                        "describe chlortalidone",
                        "describe benzathine benzylpenicillin"
                    ],
                    "outline_short": [
                        "define spontaneous preterm birth (sPTB)",
                        "describe treatment of sPTB using therapeutic composition",
                        "introduce sPTB-reversing agents and their effects",
                        "describe administration of sPTB-reversing agents",
                        "discuss therapeutic compositions and their components",
                        "outline methods of administration for therapeutic compositions",
                        "provide specific implementations of the invention",
                        "list examples of sPTB-reversing agents",
                        "describe specific embodiments of the invention using listed agents",
                        "mention additional sPTB-reversing agents"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1 Computational Discovery of Therapeutic Candidates for Preventing Preterm Birth",
                            "paragraphs": [
                                "A bioinformatics approach was applied leveraging publicly-available transcriptomic data to identify potential new treatments for sPTB. This computational pipeline scored the reversal between two lists of differentially expressed genes, with the hypothesis that an sPTB-drug pair with a negative reversal score indicated the drug could be therapeutic for sPTB. The gene expression signature of sPTB was scored with each drug in CMap, resulting in a list of 83 sPTB-drug pairs with a significant reversal score. The list was narrowed down by focusing on 6 drugs belonging to pregnancy category B.",
                                "Gene expression signature of sPTB. As described in Vora et al., a cross-study meta-analysis identifying genome-wide differential gene expression signals in sPTB is known. Three studies (GSE46510, GSE59491, and GSE73685) relating to sPTB were identified in GEO. These studies analyzed a total of 339 whole blood samples from women delivering prematurely (n=134) or at term (n=205). The three studies were aggregated together and then corrected for batch effects, resulting in a normalized dataset of 4,648 genes after applying a false discovery rate (FDR) of 0.1. After applying a threshold of a 1.3-fold increase or decrease in differential gene expression, the gene list was further reduced to a final set containing 210 genes (65 up- and 145 down-regulated, Table 2).",
                                "Gene expression profiles of drugs. Differential gene expression profiles for drugs were collected from two complementary sources: CMap (GSE70138), as described in Lamb J, et al. The Connectivity Map: using gene-expression signatures to connect small molecules, genes, and disease. Science. 2006;313(5795):1929-1935 and the LINCS L1000 dataset, as described in Subramanian et al. A Next Generation Connectivity Map: L1000 platform and the first 1,000,000 profiles. Cell. 2017;171(6):1437-1452.e17. Both are collections of differential gene expression profiles of cultured human cells treated with a variety of small molecule perturbagens. Using DNA microarrays to assay mRNA expression, the creators of CMap generated a broad database cataloging the effects of drugs on genes. CMap is a deep, genome-wide profiling of the effects of approximately 1,300 drugs on a variety of cell lines. The LINCS L1000 dataset can be characterized as a shallow profiling (978 genes) of over 10,000 drugs. While the depth of the CMap dataset and the breadth of the LINCS L1000 dataset provide two complementary views into the effects of drugs on gene expression, the genome-wide aspect of the CMap was utilized in the present disclosure. Of the 210 differentially-expressed genes identified by the sPTB meta-analysis study, 159 were also profiled in CMap, while only 16 were profiled in LINCS. As a result, the present disclosure combined the sPTB gene expression signature with the drug gene expression profiles from CMap.",
                                "Computational gene expression pattern matching. To identify potential therapeutic drugs, a non-parametric rank-based method was used to identify candidates based on differential gene expression profiles as described in Sirota M, et al. Discovery and Preclinical Validation of Drug Indications Using Compendia of Public Gene Expression Data. Science Translational Medicine. 2011;3(96):96ra77; Dudley JT, et al. Computational Repositioning of the Anticonvulsant Topiramate for Inflammatory Bowel Disease. Science Translational Medicine. 2011;3(96):96ra76; Chen B, et al. Computational Discovery of Niclosamide Ethanolamine, a Repurposed Drug Candidate That Reduces Growth of Hepatocellular Carcinoma Cells In Vitro and in Mice by Inhibiting Cell Division Cycle 37 Signaling. Gastroenterology. 2017;152(8):2022-2036; and Chen B, et al. Reversal of cancer gene expression correlates with drug efficacy and reveals therapeutic targets. Nature Communications. 2017;8:16022. The goal was to identify drugs with gene changes that are the reverse of those observed in sPTB. Based on the Kolmogorov-Smirnov statistic, this type of analysis was originally suggested by Lamb et al. in their original publication of the CMap database. This was extended and applied in the present study to specifically identify new uses for existing drugs. Build 02 version of CMap was used to obtain genome-wide gene expression profiles (relative to controls) from a variety of cell lines treated with small-molecule perturbagens. This database provided differential gene expression profiles (˜22,000 genes) for 1,309 drugs/compounds cultured in up to 5 different cell lines. A total of 6,100 drugs were tested with variations in both concentrations and durations of treatment. A pre-filtering step was applied for the profiles similar to a previous computational drug repurposing pipeline. Of the 210 differentially-expressed genes identified by the cross-study meta-analysis, 159 (44 up- and 115 down-regulated, Table 2) were present in the drug gene expression profiles in CMap. Drugs were given scores based on the relationship between their differential gene expression profiles relative to the sPTB gene expression profile. A negative score indicated a reverse profile between the drug and sPTB, where the up-regulated genes in sPTB were lower ranked (more down-regulated) and the down-regulated genes in sPTB were higher ranked (more up-regulated) in the drug profiles. Conversely, a positive score indicated a similar profile between the drug and sPTB. Significances of scores were obtained by a comparison to a distribution of scores generated from random permutations and then adjusted for multiple comparisons; only scores with FDR<0.05 were kept. For drugs with multiple gene expression profiles (from testing on different cell lines and dosages), the profile with the lowest negative (most reversed) score was used.",
                                "Statistical Analysis. Reversal scores were generated for sPTB-drug pairs using a non-parametric, rank-based method based on the Kolgomorov-Smirnov test. Reversal score p-values were obtained by comparing to a distribution of 100,000 random scores and then adjusted via FDR for multiple comparisons. An individual random score was generated by selecting a random subset of genes matching the disease signature (44 ranked up-regulated genes, 115 ranked down-regulated genes) from the entire CMap gene list to act as a proxy signature and then compared to a random CMap drug for score calculation. To ensure that the significance of the score is specific to the drug in question, for one candidate drug, lansoprazole, we also compared 1,000 random input signatures to the lansoprazole profile. The PTB reversal score for lansoprazole was more extreme than each of the 1,000 generated random scores for lansoprazole, highlighting the significance of the findings. For testing the distributions in the mouse model studies, comparisons were made using the 2-tailed Student's t-test and adjusted via FDR for multiple comparisons. A P value less than 0.05 was considered significant.",
                                "Results. Computational identification of drug repositioning candidates. By comparing the drug signatures from CMap with the differential gene expression for sPTB, 83 sPTB-reversing drugs were identified, including P4, which significantly reversed the disease gene expression signature. This list can be narrowed down by safety profiles during pregnancy. In the past, the FDA applied broad labels known as pregnancy categories to drugs based on results from both human and animal studies. Letter grades of categories were broadly based upon risk to the pregnant mother and her fetus. Pregnancy category B corresponds to drugs that have failed to demonstrate risk in animal studies with no adequate studies in pregnant women, while pregnancy category A is reserved for drugs for which human studies have failed to demonstrate a risk. By ruling out drugs with no known pregnancy category and drugs with pregnancy categories with positive evidence of risk, a subset of thirteen category A or category B compounds was identified, including cefotaxime, lansoprazole, iopamidol, iohexol, iodixanol, rifabutin, chlorotalidone, benzathine benzylpenicillin, metformin, folic acid, chotrimazole, maprotiline, and progesterone. Notably, P4 is one of the thirteen drug hits identified. Only one pregnancy category A drug was identified: folic acid. Belonging to pregnancy category B are P4 and 11 of the other drugs: three antibiotics (benzathine benzylpenicillin and cefotaxime, and rifabutin), an antifungal (clotrimazole), a PPI (lansoprazole), an antidepressant (maprotiline), an anti-diabetic (metformin), an antihypertensive (chlortalidone), and three contrast agents (iopamidol, iohexol, and iodixanol). Each of the compounds exhibited a clear reversal of the sPTB gene expression signature.",
                                "Common protein interactions among 13 pregnancy category A/B drug hits. Using DrugBank as a reference, 27 proteins that interact with at least 2 of the drug hits were identified. By using these interactions to construct a network (FIG. 2), shared interactions between the drug hits can be visualized (with no interactions recorded for the three contrast agents). Common proteins include members of the cytochrome P450 family (most commonly CYP2D6), members of solute carrier family 22, and multidrug resistance protein 1 (ABCB1). Cytochrome P450 1B1 (CYP1B1) is the only common protein that is also shared by the PTB signature.",
                                "Inflammation-induced mouse model validation of lansoprazole. Despite having the highest reversal score, cefotaxime shares few protein interactions. Lansoprazole has the next highest reversal score. Moreover, lansoprazole is available over-the- counter, whereas cefotaxime requires a prescription. Lansoprazole has also been connected to the stress-response protein heme oxygenase-1 (HO-1), and deficiencies in HO-1 have been linked with pregnancy disorders. Thus, a validation study of lansoprazole was conducted. A mouse model of inflammation using LPS to induce fetal wastage in pregnant mice was employed. In addition to lansoprazole, P4 was tested as a positive control since it is currently indicated for the prevention of sPTB. The counts of viable mouse fetuses at E12.5 for each treatment group are summarized in FIG. 3A and 3B. The LPS-100 group had significantly (p<0.05) fewer viable fetuses compared to the saline group, demonstrating the effectiveness of the LPS- induced model. Treatment with oil (oil+LPS-100) alone (P4 vehicle) had no effect on fetal viability. The positive control group (3×P4+LPS-100) showed some effectiveness at recovering the number of viable fetuses at E12.5. Lastly, LPS-100 alone was compared to the lansoprazole group (3×lansoprazole+LPS-100). The lansoprazole group was able to significantly (P<0.05) increase the number of viable fetuses compared with LPS-100 alone. Treatment with 5% DMSO (DMSO+LPS-100) alone (lansoprazole vehicle) had no effect on fetal viability.",
                                "The experiments disclosed herein identified existing drugs for repositioning by applying a computational approach to transcriptomics. By comparing the differential gene expression signature for sPTB (derived from maternal blood samples) with the differential gene expression profiles of drug experiments (derived from human cell lines), 83 drugs were found whose profiles were significantly reversed compared to sPTB. As the data were derived from human gene expression, the physiology of sPTB should be especially represented in the drug predictions. Thirteen of these drugs—benzathine benzylpenicillin, cefotaxime, chlortalidone, clotrimazole, folic acid, iodixanol, iohexol, iopamidol, lansoprazole, maprotiline, metformin, P4, and rifabutin—belong to pregnancy category A or B, indicating no known risk in pregnant women.",
                                "P4, clotrimazole, metformin, and folic acid have shown some efficacy against PTB in past studies. P4 treatment has been shown to be effective in reducing the rate of sPTB in cases where pregnant women have short cervixes, as described in Fonseca et al., Fetal Medicine Foundation Second Trimester Screening Group. Progesterone and the risk of preterm birth among women with a short cervix. N Engl J Med. 2007;357(5):462-469. Clotrimazole, an anti-fungal with no teratogenic effects, is used to treat yeast and fungal infections. An analysis of 17 years of Hungarian births found that mothers receiving clotrimazole treatment during pregnancy tended to have longer pregnancies, with a significant reduction in the rate of PTB, suggesting a protective effect that could not be explained by other factors, as described in Czeizel et al., Preterm birth reduction after clotrimazole treatment during pregnancy. Eur J Obstet Gynecol Reprod Biol. 2004;116(2):157-163. Metformin, an anti-diabetic, has been found to reduce the rate of PTB compared with placebo in women with polycystic ovary syndrome, as described in Vanky et al., .On the potential of metformin to prevent preterm delivery in women with polycystic ovary syndrome—an epi-analysis. Acta Obstetricia et Gynecologica Scandinavica. 2012;91(12):1460-1464. Folic acid, commonly taken during early pregnancy, was observed to have a possible reduction of preterm birth in another Hungarian population study, Czeizel et al., Possible association of folic acid supplementation during pregnancy with reduction of preterm birth: a population-based study. Eur J Obstet Gynecol Reprod Biol. 2010; 148(2):135-140.",
                                "In summary, a computational drug repurposing analysis was applied to identify potential novel therapeutics for the prevention of PTB. In addition to P4, the only drug currently used to prevent recurrent sPTB, twelve other plausible candidates were identified with no known safety risk in pregnancy. Lansoprazole was validated in pilot studies on an LPS-induced inflammation mouse model. These results demonstrate the novel therapeutic application of lansoprazole the other drug hits identified by the analysis in preventing sPTB.",
                                "All patents, patent applications, and publications cited in this specification are herein incorporated by reference to the same extent as if each independent patent application, or publication was specifically and individually indicated to be incorporated by reference. The disclosed embodiments are presented for purposes of illustration and not limitation. While the invention has been described with reference to the described embodiments thereof, it will be appreciated by those of skill in the art that modifications can be made to the structure and elements of the invention without departing from the spirit and scope of the invention as a whole."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "apply bioinformatics approach",
                                "identify potential new treatments for sPTB",
                                "score reversal between two lists of differentially expressed genes",
                                "focus on 6 drugs belonging to pregnancy category B",
                                "describe gene expression signature of sPTB",
                                "identify studies relating to sPTB in GEO",
                                "aggregate and correct for batch effects",
                                "apply threshold to differential gene expression",
                                "reduce gene list to 210 genes",
                                "collect gene expression profiles of drugs",
                                "describe CMap and LINCS L1000 datasets",
                                "utilize CMap for genome-wide profiling",
                                "combine sPTB gene expression signature with drug gene expression profiles",
                                "use non-parametric rank-based method for pattern matching",
                                "identify candidates based on differential gene expression profiles",
                                "generate reversal scores for sPTB-drug pairs",
                                "obtain p-values for reversal scores",
                                "adjust for multiple comparisons",
                                "identify 83 sPTB-reversing drugs",
                                "narrow down list by safety profiles during pregnancy",
                                "identify 13 category A or category B compounds",
                                "identify common protein interactions among drug hits",
                                "validate lansoprazole in mouse model",
                                "describe mouse model of inflammation",
                                "summarize counts of viable mouse fetuses",
                                "discuss effectiveness of lansoprazole",
                                "discuss previous studies on P4, clotrimazole, metformin, and folic acid",
                                "summarize computational drug repurposing analysis",
                                "discuss novel therapeutic application of lansoprazole"
                            ],
                            "num_characters": 14550,
                            "outline_medium": [
                                "apply bioinformatics approach",
                                "identify gene expression signature of sPTB",
                                "collect gene expression profiles of drugs",
                                "perform computational gene expression pattern matching",
                                "identify potential therapeutic drugs",
                                "perform statistical analysis",
                                "generate reversal scores",
                                "identify sPTB-reversing drugs",
                                "narrow down drug list by safety profiles",
                                "identify common protein interactions among drug hits",
                                "validate lansoprazole in mouse model",
                                "summarize computational approach",
                                "discuss efficacy of identified drugs",
                                "conclude novel therapeutic application"
                            ],
                            "outline_short": [
                                "apply bioinformatics approach to identify therapeutic candidates",
                                "derive gene expression signature of sPTB",
                                "collect gene expression profiles of drugs",
                                "perform computational gene expression pattern matching",
                                "analyze results and identify potential therapeutic drugs",
                                "validate lansoprazole in mouse model study",
                                "summarize findings and discuss potential therapeutic applications"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1-9. (canceled)",
        "10. A method of treating spontaneous preterm birth in a subject in need of treatment therefor by the administration to the subject of a therapeutic composition comprising a therapeutically effective amount of one or more agents that partially reverse the gene expression profile associated with spontaneous preterm birth.",
        "11. The method of claim 10, wherein the subject is\na subject at any stage of pregnancy.",
        "12. The method of claim 10, wherein the subject is\na subject having one or more risk factors or symptoms of spontaneous preterm birth.",
        "13. The method of claim 10, wherein\nthe treatment is a preventative treatment.",
        "14. The method of claim 10, wherein\nthe therapeutic composition comprises an agent that partially reverses the gene expression profile associated with spontaneous preterm birth selected from the group consisting of: naproxen, cefotaxime, levopropoxyphene, prednisone, vorinostat, brompheniramine, genistein, valproic acid, cefoperazone, alprostadil, lansoprazole, iopamidol, letrozole, molindone, fluticasone, estradiol, isoxicam, thiamphenicol, guanabenz, isometheptene, isoniazid, sulfadimethoxine, ribavirin, pioglitazone, benzocaine, pentoxifylline, meclofenamic acid, rosiglitazone, methotrexate, domperidone, amitriptyline, vinblastine, naringenin, fulvestrant, sodium phenylbutyrate, haloperidol, zalcitabine, zuclopenthixol, iohexol, adenosine phosphate, iodixanol, viomycin, nimodipine, ciclosporin, rifabutin, podophyllotoxin, ceforanide, sirolimus, ajmaline, diloxanide, chlortalidone, trimethobenzamide, timolol, tenoxicam, ketotifen, geldanamycin, dantrolene, dapsone, streptozocin, raloxifene, ambroxol, benzathine benzylpenicillin, finasteride, trifluoperazine, vanoxerine, thiamazole, homosalate, levomepromazine, co-dergocrine mesilate, oxyphenbutazone, promazine, carisoprodol, niclosamide, methoxamine, tocainide, cefotiam, maprotiline, resveratrol, and nadolol.",
        "15. The method of claim 14, wherein\ntherapeutic composition comprises lansoprazole.",
        "16. The method of claim 14, wherein\nthe therapeutic composition comprises cefotaxime.",
        "17. The method of claim 14, wherein\nthe therapeutic composition comprises",
        "18. The method of claim 14, wherein the therapeutic composition comprises chlortalidone.",
        "19. The method of claim 14, wherein the therapeutic composition comprises benzathine benzylpenicillin.",
        "20. The method of claim 14, wherein\nthe therapeutic composition comprises maprotiline.",
        "21. The method of claim 14, wherein\nthe therapeutic composition comprises naproxen."
    ]
}