{
    "id": "US20130217641",
    "authors": [
        "Annalisa Santucci",
        "Natale Figura",
        "Adriano Spreafico",
        "Giovanni Cavallo",
        "Roberto Filippo Marcolongo"
    ],
    "title": "COMPOSITIONS FOR TREATING HELICOBACTER PYLORI INFECTION",
    "date": "2011-05-26 00:00:00",
    "abstract": "Pharmaceutical compositions for treating infection from Helicobacter pylori. are described, containing, as the active ingredients, polysorbate and an antibiotic selected from clarithromycin, metronidazole and a mixture thereof.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention concerns compositions for treating infection from Helicobacter pylori. More specifically, the invention concerns the use as anti-infective agents of antibiotic compositions containing, as the active ingredients, combinations of a known emulsifying and non-ionic surface active agent, i.e. polysorbate, with one of two specific antibiotics already in use for the H. pylori eradication treatment."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Helicobacter pylori infection treatment"
                    ],
                    "num_characters": 416,
                    "outline_medium": [
                        "introduce Helicobacter pylori infection treatment"
                    ],
                    "outline_short": [
                        "introduce Helicobacter pylori infection treatment"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "As it is known, Helicobacter pylori is a helix-shaped Gram-negative microaerophilic microorganism that can inhabit the stomach and the duodenum, adapting itself to the inhospitable environment of the gastric mucosa in a quite particular way, to the point that it often fails to produce any detectable symptoms. Actually, it is considered that more than 80% of the individuals infected with H. pylori are asymptomatic. Such microorganism infects more than half of the world population at the level of the gastro-duodenal tract. The transmission route of the infection has not been clarified, although infection seems to be typically acquired in the childhood.",
                        "The stomach is protected from its own gastric juice, made of concentrated hydrochloric acid and rich of digestive enzymes, by a thick layer of mucus which covers the gastric mucosa and within which the Helicobacter may penetrate and survive, resisting to the possible acid that may reach it thanks to an enzyme produced by such bacterium, urease. Urease converts the urea contained in large amounts in the stomach into bicarbonate and ammonium. Therefore, a basic environment Is established in the vicinity of the bacterial colony, such environment being capable of neutralizing the hydrochloric acid of gastric secretions, thereby protecting H. pylori.",
                        "Another protective mechanism available to Helicobacter pylori consists in that the natural immune defences of the body cannot reach it in the gastric mucus. The immune system reacts to the H. pylori infection by sending leukocytes, killer T lymphocytes and other defence factors, but these cannot reach the infection site, as they cannot easily penetrate through the mucus layer, and remain and accumulate in the site, leaving there their destructive content (consisting of superoxide radicals) when they die. Additional nutrients are sent on the site to assist the white blood cells, and this fact does no more than further feeding Helicobacter itself. As a result, a gastritis develops in a few days, which may sometimes progress up to peptic ulcer. In view of the foregoing, it is considered that the causative agent of the damage to the gastric mucosa is not H. pylori itself, but the inflammation and, consequently, the immune response to the microorganism.",
                        "From the scientific literature it appears that infection from Helicobacter pylori is the main cause of chronic gastritis and the most relevant factor for the development of peptic ulcer (Warren J R, Marshall B J. Unidentified curved bacilli on gastric epithelium in active chronic gastritis. Lancet 1983; 1:1273-5). By colonizing the stomach, H. pylori induces a persistent inflammation (chronic gastritis) which may last years without developing with clinical symptoms. However, in 10-20% of the cases, it may result in the development of gastric or duodenal ulcers.",
                        "Also gastric cancer (gastric adenocarcinoma and non-Hodgkin gastric lymphoma) is often associated with H. pylori (Moss S F. The carcinogenic effect of H. pylori on the gastric epithelial cell. J Physiol Pharmacol 1999; 50:847-56). In the frame of a wide review of cases of gastric carcinoma it has been shown that the presence of H. pylori results in a six-fold increase of the risk of gastric cancer. I is believed that chronic gastritis may lead to intestinal metaplasia, which in turn, may degenerate into malignant cancer. The low grade malignant lymphoma o MALToma, in turn, seems to derive from the malignant degeneration of lymphoid tissue associated with the mucosa. In this case, retrospective bioptic studies demonstrated that 90% of these MALTomes are associated he presence of H. pylori.",
                        "The various strains of Helicobacter pylori are not endowed with the same pathogenic power: strains having in their chromosome an insertion defined “cag pathogenicity island” (cagPAI), a set of genes involved in the virulence of the microorganism, exhibit a higher inflammatory potential. About 50-70% of the H. pylori strains found in western countries contain the cag pathogenicity island, and the patients infected with bacteria containing the cag PAI have a stronger gastric inflammatory response and a higher risk of developing peptic ulcers or gastric cancer compared to patients infected with strains that do not contain such insertion in their genome. The cag-positive strains are able to inject in the colonized gastric cells an oncoprotein (codified by one the cag genes) named cagA, which increases the risk of developing neoplastic lesions (Censini S, Lange C, Xiang Z, Crabtree J E, Ghiara P, Borodovsky M, et al. cag, a pathogenicity island of Helicobacter pylori, encodes type I-specific and disease-associated virulence factors. Proc Natl Acad Sci USA 1996; 93:14648-53).",
                        "Once the infection from Helicobacter pylori has been diagnosed in patients with peptic ulcer, the normal procedure consists in eradicating pharmacologically the microorganism, thus allowing the ulcer to heal. At present, the first choice standard treatment, known as “triple therapy” consists in the administration of:\n\n\n- - a) a gastric proton pump inhibitor;\n  - b) two antibiotics, selected from amoxicillin, clarithromycin,\n    metronidazole or tetracycline.",
                        "As it is known, the gastric proton pump is a metabolic mechanism typical of the stomach lining cells which allows them to secrete hydrochloric acid in the gastric juice. The gastric pump inhibitors are a group of molecules the main action of which is to reduce for a long term (from 18 to 24 hours) the acidity of gastric juice. They act through the inhibition of the gastric enzyme H+/K+-ATPase (the proton pump), i.e. the catalyst of the H+ and K+ ions exchange.",
                        "Such active ingredients, the most widespread of which are omeprazole, lansoprazole and esomeprazole, lead to a remarkable reduction of the gastric acidity, and are therefore used in the treatment of dyspepsia, gastro-oesophageal reflux and peptic ulcer, where they have practically replaced the drugs previously in use for similar indications, i.e. histamine H2 receptor antagonists or H2 anti-histamines, as ranitidine and cimetidine.",
                        "In the H. pylori eradication treatment, the proton pump inhibitors are used to alleviate the symptoms of peptic ulcer and to facilitate the actions of antibiotics, while the proper eradication action is carried out by the latter, which are administered with the precautions and limitations typical of any antibiotic treatment.",
                        "In the course of the years, the therapeutic protocols have progressively improved, allowing to go, in standard cases, from therapies of two weeks to therapies of 7 or 10 days, thus reducing the number of dosage units to be administered daily and limiting the toxicity and side effects of the same. Alternative protocols have been developed in case of allergies to specific drugs; second line treatment schedules have been designed in case of failure of the first cycle of therapy, and the overall eradication efficacy has improved, affording success rates of at least 80%. The case of undesired effects are kept within a limit of 10-15% of the patients, and normally such effects are not so serious to result in abandonment of the therapy.",
                        "Such undesired effects, both local and systemic, however, make the said therapy poorly tolerable. The most common of such side effects are, apart from cases of true intolerance to the active ingredient, dizziness and sense of confusion, oral bad taste, nausea and digestive or intestinal discomfort.",
                        "In addition, and more critically, an ever increasing number of patients appears to be infected by resistant bacteria: in most of the world several clarithromycin-resistant strains have been already evidenced, as well as metrodinazole-resistant strains. For the patients infected by resistant H. pylori strains the use of alternative antibiotics has been proposed, to be possibly exploited in case of failure of the first treatment cycle. For instance, for the treatment of clarithromycin-resistant strains the use of levofloxacin has been suggested, in a second-line triple therapy (Perna F, Zullo A, Ricci C, Hassan C, Morini S, Vaira D. Levofloxacin-based triple therapy for Helicobacter pylori re-treatment: role of bacterial resistance. Dig Liver Dis, 2007, 39(11):1001-5).",
                        "In the light of the foregoing, it is evident that pharmacological therapies for the eradication of Helicobacter pylori require continuous revision and updating, not only in order to improve the efficacy or tolerability of the drugs, but also as a consequence of the evolution of antibiotics-resistant strains in some populations, also depending on the use the various antibiotics in the different territories.",
                        "As recent studies have shown that the addition of substances having scavenging activity against free radicals, such as vitamin C, to the medicaments used to treat H. pylori infections improves the eradication rates, the interest of microbiologists and clinicians has concentrated on biologically active natural compounds, in particular plant extracts, known for being provided with antioxidant and/or antibacterial activity. The latter should be combined with the pharmacological therapies or should be used as nutritional supplements (Correa P, Malcom G, Schmidt B, Fontham E, Ruiz B, Bravo J C, et al. Antioxidant micronutrients and gastric cancer. Aliment Pharmacol Ther 1998; 1: 73-8). Several studies has shown the antibacterial effect of a wide variety of fruits and derivatives thereof, such as berries, garlic, onion, kiwi, citrus fruits and wine, as well as extracts from plant and drugs, in particular essential oils, cinnamon, thyme, propolis, licorice, paprika, tea and rice (see, for istance, Nostro A, Cellini L, Di Bartolomeo S, Di Campli E, Grande R, Cannatelli M A, et al. Antibacterial effect of plant extracts against Helicobacter pylori. Phytother Res 2005; 19:198-202; e Ohno T, Kita M, Yamaoka Y, Imamura S, Yamamoto T, Mitsufuji S, et al. Antimicrobial activity of essential oils against Helicobacter pylori. Helicobacter 2003; 8:207-15).",
                        "In such a frame, some of the present authors have recently studied and identified the phenolic compounds present in the thorn bush leaves (Rubus ulmifolius) and in the common wheat flour, and have ascertained the antioxidant activity and antibacterial power thereof against H. pylori strains (Martini S, D'Addario C, Colacevich A, Focardi S, Borghini F, Santucci A, Figura N, Rossi C. Antimicrobial activity against Helicobacter pylori strains and antioxidant properties of blackberry leale (Rubus ulmifolius) and isolated components. Int. J Antimicrob Agents. 2009; 34:50-9).",
                        "Amongst the phenolic components most abundantly present in such extracts there is ferulic acid, a lignin component making up the vegetal cell walls, that is largely found in rice, wheat and other cereals, as well as in coffee and in different seeds and fruits. The antioxidant properties of ferulic acid have led to propose its use in a wide variety of therapeutic applications for the prevention and treatment of pathologies ranging from cancer to neurodegenerative diseases, to diabetes, cardiovascular dysfunctions and also in the field of peptic ulcer and for the treatment of H. pylori infections, through several vegetal extracts containing it.",
                        "Considering the various further substances that have been proposed as active ingredients or adjuvants in the pharmacological treatment of Helicobacter pylori eradication in view of their antibacterial properties, the international patent application publ. No. WO 96/05822 (New England Medical Center Hospital) discloses the use of some molecules normally employed as non-ionic surfactants and emulsifiers, suitable for use in foods, cosmetics and pharmaceutical products, among which, specifically, polysorbates. Such compounds are a class of substances derived from polyethoxylated or PEG-ylated sorbitan ((3S)-2-(1,2-dihydroxyethyl)tetrahydrofuran-3,4-diol, a cyclic polyhydroxy compound obtained from the dehydration of sorbitol), having the four hydroxyl groups etherified with polyethylene glycol chains, in turn esterified with a fatty acid chain (monolaurate, monopamitate, monostearate or monooleate).",
                        "The polysorbates known with the commercial name Tween are often used in view of their solubilising properties as emulsifiers and antifoam additives in fermentations. Starting from experimentations on Helicobacter pylori cultures, the authors of the cited patent application have found that such compounds behave as potent inhibitors of bacterial growth. For such reasons the cited document proposes the administration of polysorbate-based compositions for the treatment of H. pylori infections in the frame of a sequential eradication treatment, wherein, however, any temporal overlapping between the antibiotic treatment and the treatment with polysorbate it is absolutely excluded.",
                        "As a matter of fact it had been found that the proposed surface active/emulsifying agents have bactericidal activity at some given concentrations, but only bacteriostatic activity at lower concentrations, and inhibit the H. pylori growth without totally eradicating it. Since many antibiotics used in clinics are active only on microorganisms being in an active growth phase, the simultaneous presence of the surface active/emulsifying agent proposed and the antibiotic would have been counterproductive. The therapy proposed by the cited document consists, therefore, in administering the known antibiotics for the treatment of Helicobacter in the absence of the proposed surfactant/emulsifying agent and, thereafter, administering such agent alone.",
                        "Also the international patent application publ. No, WO 97/36600 (AMBI Inc.), filed sometime later, proposes the use of polysorbates-containing compositions in the treatment of gastrointestinal disorders caused by H. pylori. The authors report to have found that polysorbates, in particular, non only inhibit H. pylori growth, but rapidly kill said bacterial strains, and therefore they may be used alone in the eradication of the microorganism. The cited document describes the use of polyoxyethilene sorbitan (and in particular polysorbate 20, which is the monolaurate ester of polysorbate) alone or in combination with other known antiulcer agents, including H2 receptor antagonists, bismuth salts, antacids and proton pump inhibitors and, specifically, in combination with mucolytic agents, but not in combination with systemic antibiotics. On the contrary, the administration together with antibiotics, which may be absorbed in the systemic circulation or pass through the intestine, is expressly not recommended."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe Helicobacter pylori",
                        "explain Helicobacter pylori infection",
                        "discuss transmission route",
                        "describe stomach protection",
                        "explain urease function",
                        "discuss immune response",
                        "describe gastritis development",
                        "link Helicobacter pylori to peptic ulcer",
                        "link Helicobacter pylori to gastric cancer",
                        "discuss cag pathogenicity island",
                        "describe cagA oncoprotein",
                        "introduce triple therapy",
                        "describe proton pump inhibitors",
                        "explain gastric proton pump mechanism",
                        "discuss antibiotic treatment",
                        "describe side effects",
                        "discuss antibiotic resistance",
                        "introduce alternative antibiotics",
                        "discuss antioxidant micronutrients",
                        "describe antibacterial effect of plant extracts",
                        "introduce phenolic compounds",
                        "discuss ferulic acid properties",
                        "propose ferulic acid use",
                        "introduce polysorbates",
                        "describe polysorbate properties",
                        "discuss prior art polysorbate use",
                        "introduce international patent application",
                        "discuss polysorbate antibacterial activity",
                        "discuss prior art limitations"
                    ],
                    "num_characters": 14622,
                    "outline_medium": [
                        "describe Helicobacter pylori",
                        "explain Helicobacter pylori infection",
                        "discuss transmission route",
                        "describe stomach protection",
                        "explain immune response",
                        "discuss chronic gastritis and peptic ulcer",
                        "link Helicobacter pylori to gastric cancer",
                        "describe cag pathogenicity island",
                        "discuss triple therapy",
                        "explain proton pump inhibitors",
                        "discuss antibiotics resistance",
                        "introduce alternative therapies",
                        "discuss antioxidant and antibacterial properties",
                        "summarize prior art"
                    ],
                    "outline_short": [
                        "describe Helicobacter pylori",
                        "explain Helicobacter pylori infection symptoms",
                        "discuss Helicobacter pylori eradication treatment",
                        "describe limitations of current treatments",
                        "introduce alternative antibacterial compounds",
                        "discuss prior art on polysorbate-based compositions",
                        "summarize need for improved treatment"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "On the grounds of such prior art, an object of the present invention is, thus, to provide new pharmaceutical preparations for the treatment of Helicobacter pylori infections having improved activity and tolerability, and able to treat more successfully the resistant bacterial strains, while not excessively departing from the therapeutic protocols already consolidated for the pharmacological treatment of H. pylori eradication.",
                        "Based on the studies carried out in the frame of the present invention, it has been found that, differently from what suggested by the prior art, the combinations of the non-ionic surface active/emulsifying agents known by the common name polysorbates and by the commercial name Tween and with two of the antibiotics currently used for the eradication treatment of H. pylori, specifically metrodinazole and clarithromycin, show an unexpected synergistic activity, and result in compositions surprisingly effective also against strains resistant to the said antibiotics."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce new pharmaceutical preparations"
                    ],
                    "num_characters": 1000,
                    "outline_medium": [
                        "introduce new pharmaceutical preparations"
                    ],
                    "outline_short": [
                        "introduce new pharmaceutical preparations for Helicobacter pylori treatment"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "Therefore, the present invention specifically provides pharmaceutical compositions for the treatment of infection from Helicobacter pylori containing, as active ingredients, polysorbate and an antibiotic selected from clarithromycin, metronidazole and a mixture of the same, characterized in that the weight ratio of polysorbate to antibiotic or mixture of antibiotics is from 0.5:5 to 5:1.",
                        "For the purposes of the present description polysorbates are in general intended to be the esters polyoxyethylene (20) sorbitan and lauric, palmitic, stearic or oleic acid, wherein the digit 20 represents the total number of oxyethylene units of the molecule. In particular, polysorbate 80 or Tween 80 is polyoxyethylene (20) sorbitan monooleate, polysorbate 20 or Tween 20 is polyoxyethylene (20) sorbitan monolaurate, polysorbate 40 or Tween 40 is polyoxyethylene (20) sorbitan monopalmitate and polysorbate 60 o Tween 60 is polyoxyethylene (20) sorbitan monostearate.",
                        "According to a preferred embodiment of the invention, the antibiotic that is formulated in combination with polysorbate is clarithromycin, while according to another equally preferred embodiment said antibiotic is metronidazole. Indeed, it has found through the experimentation connected to the present research, for instance, that the activity of polysorbate when used in combination with the specific antibiotics metronidazole and clarithromycin is of the synergistic type, as the minimal bactericide concentrations (CMB, or MBC) of either of polysorbate and antibiotic when used in combination are several times lower (8 times lower for clarithromycin in a polysorbate-clarithromycin combination) than the CMB of the two substances separately tested.",
                        "Preferably, according to the invention, the polysorbate employed is polysorbate 80. Such product is already widespread as emulsifier in food products, in particular in the production of ice cream, in pharmaceutical products for parenteral administration, as antifoaming additive, in bacterial cultures, for instance for the production of vaccines, and is considered to be a safe and well tolerated product in humans.",
                        "Based on the results of a repeated toxicity study of 13 weeks in rats treated with polysorbate 60, it has been established that the minimum NOAEL (NO Adverse Effect Level) for the class of polysorbates is 1000 mg/kg (day. The latter, therefore, represents the maximum preclinical dose free from side effects. Once established the NOAEL=100 mg/kg/day, in order to fix the ADI (Accettable Daily Dose) for humans, a safety factor equal to 100 is applied, and consequently the present ADI is fixed to 10 mg/kg/day. Therefore, the dose considered to be free from side effects both from a food point of view and from the regulatory point of view for polysorbate is about 700-750 mg/day for an adult and 200 mg/day for a child. Such limit is largely prudential, however it can be exceeded, even slightly, for strictly pharmaceutical purposes.",
                        "The polysorbates are oily liquids at room temperature; in particular, polysorbate 80 appears to be a viscous water-soluble yellow liquid. A pharmaceutical composition according to the invention, based on polysorbate and an antibiotic selected from metronidazole and clarithromycin or mixtures thereof, may be preferably formulated in a pharmaceutical preparation in the form of a solution, colloidal suspension, emulsion, syrup or granulate. The administration in fluid form appears to be advantageous in view of its immediate ability to disperse onto the stomach walls.",
                        "According to some preferred embodiments of the invention, the proposed preparation is formulated in such a way that each dosage unit of the said composition—liquid, semisolid or solid—contains from 500 to 750 mg of polysorbate and 500 mg clarithromycin or 500 mg metronidazole.",
                        "Accordingly, considering that in the standard triple therapy for the eradication of Helicobacter the dosage of antibiotic is 500 mg twice a day (excluding amoxicillin, the usual dosage of which is 1 g twice a day), it is possible to propose a formulation, for instance in the form of a syrup, containing, in each dosage unit equal to 10 o 20 ml, a predetermined amount of 500-750 mg of polysorbate 80 and an amount of 500 mg of antibiotic (clarithromycin or metronidazole). Such preparation should be administered twice daily, in a dosage of 10 or 20 ml by volume (1 o 2 tablespoons).",
                        "In a therapy similar to the standard triple therapy, therefore, a treatment performed with the polysorbate-antibiotic combination of the invention can be effected, for instance, according to the following schedule:\n\n\n- - omeprazole 20 mg twice daily;\n  - amoxicillin 1 g twice daily;\n  - polysorbate 80-clarithromycin syrup (or polysorbate 80-metronidazole\n    syrup) 10 ml twice daily (equivalent, e.g., to 500 mg of\n    polysorbate+500 mg of antibiotic twice daily).",
                        "According to some further preferred embodiments of the invention, the pharmaceutical composition proposed also contains, as a further active ingredient, ferulic acid. The purpose of adding ferulic acid to polysorbate is to exploit its antioxidant and antibacterial action against H. pylori, already described in the foregoing. Actually, as noted above, recent studies have demonstrated that the addition of substances having scavenging activity against free radicals, such as vitamin C, to the agents used to treat H. pylori infections increases the eradication rates.",
                        "As shown in the formulation examples reported below, pharmaceutical preparations particularly preferred in view of their practicality of realization and use in the eradication treatment of H. pylori are sachets of powder or granulated product, normally containing 4 g of preparation, to be dispersed in a glass of water before administration, or the syrup forms with dosing cap, wherein the antibiotic (or the antibiotics mixture) is contained with part of the excipients in the dosing cap, while the polysorbate, with another part of the excipients and the water required, are contained in form of a solution in the bottle. Similar embodiments allow a wide versatility in the definition o the formulation.",
                        "Specifically, the respective ratios of the various active agents can be selected from a wide range of proportions. According to some preferred embodiments of the invention, some of which are described further below, the ratio by weight of polysorbate 80 to antibiotic or antibiotics mixture is comprised between 1:5 and 4:1 (polysorbate/antibiotic).",
                        "It is also possible to foresee a further use of the active compounds proposed according to the invention in support of the antibiotic treatment for H. pylori eradication. Thus, ferulic acid and polysorbate can be included in a preparation, for instance a syrup, not containing the antibiotic, and containing, for instance, besides polysorbate and ferulic acid, vitamin E or derivatives thereof, e/or probiotics for the protection of intestinal bacterial flora.",
                        "A possible preparation that may be used for this purpose is a syrup containing, for instance, 5% polysorbate 80, 1% ferulic acid, 0.5% PEG-ylated vitamin E (and, optionally, some probiotics), to be administered in doses of 10 ml 2 times/day, as a support of the H. pylori eradication treatment.",
                        "According a further aspect thereof, the present invention provides the use for the treatment of infection from Helicobacter pylori of a combination of polysorbate and antibiotic selected from clarithromycin, metronidazole and a mixture thereof, wherein the weight ratio of polysorbate and antibiotics or mixture of antibiotics is comprised between 0.5:5 and 5:1.",
                        "As already noted, in some preferred embodiments of the invention the proposed preparation is a combination of polysorbate and clarithromycin, while in other such forms the preparation is a combination of polysorbate and metronidazole. In all cases, the type of polysorbate which is preferably included in the formulation is polysorbate 80, and formulation also comprises, preferably, ferulic acid as an antioxidant and coadjuvant of the antibacterial activity of the formulation.",
                        "It is to be noted that combinations and preparations of the same kind as those proposed according to the invention for the treatment of infection from Helicobacter pylori in humans can also be foreseen for veterinary use, for the treatment of similar bacterial species colonizing the oral cavity e the gastro-intestinal apparatus of animals.",
                        "H. pylori species which can be interested by veterinary treatments include, for instance H. canis and H. felis, representing the corresponding pathogens for dogs and cats.",
                        "As it is evident the pharmaceutical composition proposed according to the invention may be employed in general as antibacterial in the treatment of infections from bacteria sensitive to metronidazole or clarithromycin, but it is specifically proposed for use in the frame of an eradication treatment for Helicobacter pylori. Such treatment comprises the simultaneous administration of another antibiotic belonging to the group of antibiotics already consolidated for the treatment in question, first of all amoxicillin.",
                        "More preferably, as it will be evident in the further below, the treatment with the preparation according to the invention may be applied in cases where the Helicobacter to be eradicated belongs to a strain resistant to clarithromycin and/or to metronidazole."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe pharmaceutical compositions",
                        "introduce polysorbate-antibiotic combination",
                        "discuss synergistic activity",
                        "describe preferred embodiments",
                        "introduce clarithromycin and metronidazole",
                        "discuss minimal bactericide concentrations",
                        "prefer polysorbate 80",
                        "discuss toxicity study",
                        "establish NOAEL and ADI",
                        "describe pharmaceutical preparation forms",
                        "introduce syrup and granulate forms",
                        "describe administration schedule",
                        "introduce ferulic acid",
                        "discuss antioxidant and antibacterial action",
                        "describe sachet and syrup forms",
                        "discuss ratio of active agents",
                        "propose further use of active compounds",
                        "discuss veterinary use"
                    ],
                    "num_characters": 9409,
                    "outline_medium": [
                        "describe polysorbate and antibiotic combinations",
                        "explain synergistic activity",
                        "discuss preferred embodiments",
                        "describe polysorbate 80",
                        "discuss toxicity study",
                        "formulate pharmaceutical composition",
                        "introduce ferulic acid",
                        "discuss further embodiments",
                        "summarize invention"
                    ],
                    "outline_short": [
                        "describe polysorbate-antibiotic compositions",
                        "discuss synergistic activity of polysorbate and antibiotics",
                        "provide formulation examples",
                        "discuss additional uses of active compounds"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "The present invention is being also described, for merely illustrative purposes, in the following examples, showing possible formulations based on polysorbate, clarithromycin and/or metronidazole for use in the treatment of infection from H. pylori as proposed according to the invention. The formulations for two different pharmaceutical forms are reported in the following examples:\n\n\n- - product in powder, 4 grams sachet, to be dispersed in a glass of\n    water before administration;\n  - product in solution, syrup to be prepared before use, consisting of\n    a dosing cap containing the antibiotics and a20 ml bottle containing\n    the polysorbate 80 solution."
                    ],
                    "subsections": [
                        {
                            "title": "Formulations Containing Clarithromycin, Metronidazole and Polysorbate 80",
                            "paragraphs": [
                                "A. 4 Grams Sachets of Powder Product",
                                "For each one of the following examples a first mixture (Antibiotic mixture) is prepared, containing the antibiotics and part of the excipients. A second mixture is prepared (Surfactant mixture) containing polysorbate 80 and another part of the excipients. The two mixtures are then joined and mixed in the proportions shown in the table for each one of the following examples.",
                                "The division in two parts evidences that polysorbate 80 does not have a technological function, rather it is a true active ingredient which is prepared separately from the antibiotic mixture.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 1:5**",
                                "Preparation Method of Surfactant Mixture",
                                "Maltodextrin powders, mannitol and xylitol are granulated with a solution of polysorbate 80 in water in the proportions shown in the following table, and are then dried with fluidized bed to afford a surfactant mixture of the composition necessary for the formulation of the preparation.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 1:2.5**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 1:1.25**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 1:1**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "**Example 5**",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 1.25:1**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 2:1**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "**Preparation with Polysorbate/Antibiotics Ratio: 2.5:1**",
                                "Maltodextrin powders, mannitol and xylitol, dosed in proportions corresponding to the present composition, are granulated with a solution of polysorbate 80 in water and are then dried to afford the surfactant mixture, in the same way as in Example 1.",
                                "B. Syrup: Bottle with Dosing Cap",
                                "For each one of the following examples a first mixture (Antibiotic mixture) is prepared, containing the antibiotics and part of the excipients, that is to be inserted in the dosing cap of a 20 ml bottle. The second mixture (Surfactant mixture), containing polysorbate 80 and another part of the excipients, is in the form of an aqueous solution, and is placed directly in the bottle. The two mixtures are prepared to be joined by the user just before the use, in order not to compromise the antibiotics stability in the solution.",
                                "Also in this case the division in two parts evidences that polysorbate 80 does not have a technological function, rather it is a true active ingredient which is prepared separately from the antibiotic mixture."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe preparation method of surfactant mixture",
                                "describe preparation with polysorbate/antibiotics ratio: 1:5",
                                "describe preparation with polysorbate/antibiotics ratio: 1:2.5",
                                "describe preparation with polysorbate/antibiotics ratio: 1:1.25",
                                "describe preparation with polysorbate/antibiotics ratio: 1:1",
                                "describe preparation with polysorbate/antibiotics ratio: 1.25:1",
                                "describe preparation with polysorbate/antibiotics ratio: 2:1 and 2.5:1"
                            ],
                            "num_characters": 3650,
                            "outline_medium": [
                                "describe preparation method",
                                "provide examples of formulations",
                                "highlight polysorbate 80 as active ingredient"
                            ],
                            "outline_short": [
                                "describe preparation methods for different polysorbate/antibiotics ratios"
                            ]
                        },
                        {
                            "title": "Formulations Containing Metronidazole and Polysorbate 80",
                            "paragraphs": [
                                "A. 4 Grams Sachets of Powder Product",
                                "The preparation method is the same as for the formulations in sachets containing clarithromycin, metronidazole and polysorbate.",
                                "**Preparation with Polysorbate/Metronidazole: 2.5:1**",
                                "B. Syrup: Bottle with Dosing Cap",
                                "The preparation method is the same as for the formulations in syrup containing clarithromycin, metronidazole and polysorbate."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe preparation method"
                            ],
                            "num_characters": 381,
                            "outline_medium": [
                                "describe preparation method"
                            ],
                            "outline_short": [
                                "describe preparation methods for different polysorbate/metronidazole ratios"
                            ]
                        },
                        {
                            "title": "Formulations Containing Clarithromycin and Polysorbate 80",
                            "paragraphs": [
                                "A. 4 Grams Sachets of Powder Product",
                                "The preparation method is the same as for the formulations in sachets containing clarithromycin, metronidazole and polysorbate.",
                                "**Preparation with Polysorbate/Clarithromycin: 2:1**",
                                "B. Syrup: Bottle with Dosing Cap",
                                "The preparation method is the same as for the formulations in syrup containing clarithromycin, metronidazole and polysorbate.",
                                "**Preparation with Polysorbate/Clarithromycin: 3:1**",
                                "The specific features of the invention, as well as the advantages of the same in comparison with the solutions of the known techniques, will result more clearly with reference to the experimentation reported for merely exemplificative purposes below.",
                                "Evaluation of the Antibacterial Activity of the Proposed Combinations Against H. pylori",
                                "In order to ascertain the performance of the proposed combinations of active ingredients according to the invention in the pharmacologic treatment of eradication of Helicobacter pylori, it has been hypothesized to start from the standard pharmacological treatments as previously described for the triple therapy, detecting the in vitro effectiveness of the antibiotic agents used in such therapy, alone or in combination with the anti-microbial additional agent proposed.",
                                "For the sensitivity tests 10 strains of H. pylori were used, the features of which are reported in the following Table 1.",
                                "As previously noted, the bacterial strains containing the cag pathogenicity island are much more virulent than those that do not contain it. The cag-positive strains and the cag-negative strains are so different from each other that for this species the concept of “quasi-species” has been created”.",
                                "This is mainly the reason why when carrying our studies on the effectiveness of antibacterial agents on Helicobacter pylori it is necessary to test some representatives of both groups of bacterial clones (i.e., strains with the cag pathogenicity island and strains without the said island).\n\n\n- - (table follows)",
                                "For the execution of the antibacterial activity tests against the various H. pylori strains, the test materials have been prepared as follows.",
                                "Polysorbate 80 has been solubilised in water at 5% concentration. Ferulic acid has been solubilised in TRIS buffer at 0.4% (weight/volume) concentration.",
                                "After further dilution in Brucella broth containing 10% bovine fetal serum, the samples were sterilized by filtration through membranes with 0.22 μm pores.",
                                "The various antibiotics, amoxicillin, metronidazole, clarithromycin and levofloxacin were used already dissolved, in their formulation for intravenous infusion. As the moment of the test the samples were diluted in double Brucella broth, in a volume of 100 μL, in “Microtiter” plates.",
                                "The various strains were cultured in Brucella agar with 10% fetal bovine serum in jars were a reduced oxygen tension atmosphere had been established, obtained with “Campypack” bags, at 37° C. for 48 hours",
                                "At the time of the test, each strain was suspended in Brucella broth at the optical density corresponding to the McFarland opacity standard #4 (about 108 CFU/ml) and further diluted 1:20 in the same broth (5×105 CFU/ml approx.); 4 μL of each bacterial suspension were then added to the various dilutions of the samples; each well contained, thus, about 2×105 CFU/ml.",
                                "After incubation for one night in the same microaerophilic atmosphere at 37° C., 3 μL of each dilution were placed on agar plates of Brucella-bovine fetal serum, which were immediately incubated at 37° C. in the same atmosphere for 3-5 days.",
                                "The lowest concentration in broth of the test sampled whose subculture on agar showed the full absence of bacterial growth was considered to be the minimal bactericidal concentration. (MBC).",
                                "The results of several tests are gathered in the following Table 2.",
                                "From the data reported in the preceding table the following observations can be drawn.\n\n\n- - the MBC of clarithromycin vs. the multiresistant strain M/C-R2 drops\n    from 2500 μg/ml to 2.5 μg/ml when the antibiotic is used in\n    combination with polysorbate.\n  - the synergistic activity of polysorbate is shown with the sensitive\n    strains as well; the MBCs of the antibiotics drop by 8-10 times when\n    polysorbate and clarithromycin are used in combination (strains CCUG\n    17874 and 328).\n  - the MBCs of polysorbate, metronidazole and clarithromycin against\n    the strain 328 are, respectively, 62 μg/ml, 16 μg/ml and 0.2 μg/ml;\n    the MBCs of the polysorbate-metronidazole combination are 16 μg/ml\n    and 0.25 μg/ml; those of the polysorbate-clarithromycin combination\n    are 32 μg/ml and 0.025 μg/ml. This strain is resistant to\n    metronidazole only. It may be seen that the activity of\n    metronidazole combined with polysorbate increases 64 times and the\n    activity of clarithromycin in combination with polysorbate increases\n    8 times.\n  - the MBCs of polysorbate, metronidazole and clarithromycin against\n    the resistant strain M/C-R1 are respectively 160 μg/ml, 40 μg/ml,\n    and 320 μg/ml. the MBCs of the combination polysorbate-metronidazole\n    are 80 μg/ml and 4 μg/ml; those of the polysorbate-clarithromycin\n    combination are 80 μg/ml and 20 μg/ml. The resistance levels to\n    metronidazole and to clarithromycin were reduced, respectively, by\n    10 and 16 times.\n  - the MBCs of polysorbate and clarithromycin vs. the resistant strain\n    M/C-R2 are, respectively, 62 μg/ml e 2500 μg/ml; those of the\n    polysorbate-clarithromycin combination are 32 μg/ml and 2.5 μg/ml.\n    In this case the MBC was reduced down to clarithromycin levels\n    considered almost inactive (1 μg/ml, according to someone, 2 μg/ml,\n    according to others).\n  - the fact that the combination with polysorbate greatly enhances the\n    bactericidal activity of the two antibiotics metronidazole and\n    clarithromycin has an immediate relevance as concerns metronidazole,\n    since it has already been observed that low resistance levels to\n    metronidazole can be overcome by increasing the dosage of the\n    medicament. It may be hypothesized that also in the case of\n    clarithromycin the reduction of resistance due to the combination\n    with polysorbate is translated into a a higher efficacy of the\n    treatment.\n  - the amoxicillin/polysorbate 80 combination and the\n    levofloxacin/polysorbate 80 combination, on the contrary, have shown\n    an activity of a merely additive type. Considering the example of\n    the strains G50 and 10K, the MBCs of polysorbate are respectively 4\n    μg/ml and 6.2 μg/ml. The MBCs of amoxicillin are 0.04 μg/ml and 0.08\n    μg/ml; those of the polysorbate/amoxicillin combination are 0.02\n    μg/ml (in another test, 2/0.04 μg/ml has been obtained) and 6.2/0.08\n    μg/ml. The MBCs of levofloxacin for the two strains are respectively\n    0.16 μg/ml and 0.31 μg/ml; those of the polysorbate/levofloxacin\n    combination are 4/0.08 μg/ml and 6.2/0.31 μg/ml.",
                                "With reference to the same table, in connection with the experimentation with ferulic acid the following results were obtained.\n\n\n- - Ferulic acid showed a bactericidal activity against all of the *H.\n    pylori* strains, including the two\n    metronidazole/clarithromycin-resistant strains. The MBCs range from\n    0.8 to 1.2 mg/ml.\n  - The ferulic acid/polysorbate combination showed an activity of the\n    additive type.",
                                "From the experimental study synthesized above it is possible to draw the following conclusions:\n\n\n- - The polysorbate/metronidazole combination and the\n    polysorbate/clarithromycin combination, differently from the\n    combinations of polysorbate with other antibiotics, show a\n    synergistic bactericidal activity, which is kept also against the\n    strains resistant to the two antibiotics.\n  - The antioxidant product of a natural origin ferulic acid is active\n    as antibacterial against *H. pylori*, even if the combination\n    ferulic acid/polysorbate shows a merely additive activity.",
                                "The present invention has been disclosed with particular reference to some specific embodiments thereof, but it should be understood that modifications and changes may be made by the persons skilled in the art without departing from the scope of the invention as defined in the appended claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe preparation method",
                                "describe preparation with polysorbate/clarithromycin: 2:1",
                                "describe preparation with polysorbate/clarithromycin: 3:1",
                                "introduce evaluation of antibacterial activity",
                                "describe sensitivity tests",
                                "describe bacterial strains",
                                "describe antibacterial activity tests",
                                "describe test materials preparation",
                                "describe sample preparation",
                                "describe bacterial suspension preparation",
                                "describe incubation and subculture",
                                "describe minimal bactericidal concentration (MBC) determination",
                                "present results in table",
                                "discuss results",
                                "describe synergistic activity of polysorbate",
                                "describe additive activity of ferulic acid/polysorbate combination"
                            ],
                            "num_characters": 8247,
                            "outline_medium": [
                                "describe preparation method",
                                "provide examples of formulations",
                                "highlight polysorbate 80 as active ingredient",
                                "describe evaluation of antibacterial activity",
                                "describe test materials preparation",
                                "describe antibacterial activity tests",
                                "present results of tests",
                                "draw conclusions from results"
                            ],
                            "outline_short": [
                                "describe preparation methods for different polysorbate/clarithromycin ratios",
                                "describe preparation methods for syrup formulations",
                                "describe preparation methods for powder product formulations",
                                "summarize preparation methods for different formulations"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce examples of formulations"
                    ],
                    "num_characters": 666,
                    "outline_medium": [
                        "describe formulations"
                    ],
                    "outline_short": [
                        "provide formulations for treatment of H. pylori infection"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of treating an infection from Helicobacter pylori, comprising administering to a subject in need thereof a pharmaceutical composition containing, as active ingredients, polysorbate and an antibiotic selected from clarithromycin, metronidazole and a mixture of the same, characterized in that the weight ratio of polysorbate to antibiotic or mixture of antibiotics is from 0.5:5 to 5:1.",
        "2. The method according to claim 1, wherein the said antibiotic is clarithromycin.",
        "3. The method according to claim 1, wherein the said antibiotic is metronidazole.",
        "4. The method according to claim 1, wherein the said polysorbate is polysorbate 80.",
        "5. The method according to claim 4, wherein the pharmaceutical composition is formulated in a pharmaceutical preparation in the form of a solution, a colloidal suspension, an emulsion, a syrup or a granulate.",
        "6. The method according to claim 5, wherein each liquid, semisolid or solid dosage unit in the said pharmaceutical composition contains from 500 to 750 mg of polysorbate and 500 mg of clarithromycin and/or 500 mg of metronidazole.",
        "7. The method according to claim 4, wherein the pharmaceutical composition comprises, as a further active ingredient, ferulic acid.",
        "8. The method according to claim 1, wherein the weight ratio of polysorbate to antibiotic or mixture of antibiotics is from 1:5 to 4:1.",
        "9. A method of treating an infection of Helicobacter pylori, comprising administering to a subject in need thereof polysorbate and an antibiotic selected from clarithromycin, metronidazole and a mixture of the same, wherein the weight ratio of polysorbate to antibiotic or mixture of antibiotics is from 0.5:5 to 5:1.",
        "10. The method according to claim 9, wherein the said antibiotic is a combination of clarithromycin and metronidazole.",
        "11. The method according to claim 9, wherein the said antibiotic is clarithromycin.",
        "12. The method according to claim 9, wherein the said antibiotic is metronidazole.",
        "13. The method according to claim 9, wherein the said polysorbate is polysorbate 80.",
        "14. The method according to claim 9, wherein the method comprises the eradication of Helicobacter pylori.",
        "15. The method according to claim 14, wherein the said Helicobacter pylori belongs to a strain resistant to clarithromycin and/or to metronidazole."
    ]
}