{
    "id": "US20120213762",
    "authors": [
        "Jonathan H. LeBowitz",
        "John Maga"
    ],
    "title": "LYSOSOMAL TARGETING PEPTIDES AND USES THEREOF",
    "date": "2012-02-17 00:00:00",
    "abstract": "The present invention provides further improved compositions and methods for efficient lysosomal targeting based on the GILT technology. Among other things, the present invention provides methods and compositions for targeting lysosomal enzymes to lysosomes using furin-resistant lysosomal targeting peptides. The present invention also provides methods and compositions for targeting lysosomal enzymes to lysosomes using a lysosomal targeting peptide that has reduced or diminished binding affinity for the insulin receptor.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Normally, mammalian lysosomal enzymes are synthesized in the cytosol and traverse the ER where they are glycosylated with N-linked, high mannose type carbohydrate. In the golgi, the high mannose carbohydrate is modified on lysosomal proteins by the addition of mannose-6-phosphate (M6P) which targets these proteins to the lysosome. The M6P-modified proteins are delivered to the lysosome via interaction with either of two M6P receptors. The most favorable form of modification is when two M6Ps are added to a high mannose carbohydrate.",
                        "More than forty lysosomal storage diseases (LSDs) are caused, directly or indirectly, by the absence of one or more lysosomal enzymes in the lysosome Enzyme replacement therapy for LSDs is being actively pursued. Therapy generally requires that LSD proteins be taken up and delivered to the lysosomes of a variety of cell types in an M6P-dependent fashion. One possible approach involves purifying an LSD protein and modifying it to incorporate a carbohydrate moiety with M6P. This modified material may be taken up by the cells more efficiently than unmodified LSD proteins due to interaction with M6P receptors on the cell surface.",
                        "The inventors of the present application have previously developed a peptide-based targeting technology that allows more efficient delivery of therapeutic enzymes to the lysosomes. This proprietary technology is termed Glycosylation Independent Lysosomal Targeting (GILT) because a peptide tag replaces M6P as the moiety targeting the lysosomes. Details of the GILT technology are described in U.S. Application Publication Nos. 2003-0082176, 2004-0006008, 2003-0072761, 2005-0281805, 2005-0244400, and international publications WO 03/032913, WO 03/032727, WO 02/087510, WO 03/102583, WO 2005/078077, the disclosures of all of which are hereby incorporated by reference."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe lysosomal enzymes and their synthesis",
                        "explain lysosomal storage diseases and enzyme replacement therapy",
                        "introduce Glycosylation Independent Lysosomal Targeting (GILT) technology"
                    ],
                    "num_characters": 1844,
                    "outline_medium": [
                        "describe lysosomal storage diseases and enzyme replacement therapy"
                    ],
                    "outline_short": [
                        "describe lysosomal storage diseases and enzyme replacement therapy"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention provides further improved compositions and methods for efficient lysosomal targeting based on the GILT technology. Among other things, the present invention provides methods and compositions for targeting lysosomal enzymes to lysosomes using furin-resistant lysosomal targeting peptides. The present invention also provides methods and compositions for targeting lysosomal enzymes to lysosomes using a lysosomal targeting peptide that has reduced or diminished binding affinity for the insulin receptor. The present invention encompasses unexpected discovery that furin-resistant lysosomal targeting peptides according to the invention have reduced binding affinity for the insulin receptor.",
                        "In some embodiments, the present invention provides a furin-resistant IGF-II mutein. In some embodiments, the present invention provides a furin-resistant IGF-II mutein having an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1) and a mutation that abolishes at least one furin protease cleavage site.",
                        "In some embodiments, the present invention provides an IGF-II mutein comprising an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1) and a mutation that reduces or diminishes the binding affinity for the insulin receptor as compared to the wild-type human IGF-II.",
                        "In some embodiments, the furin-resistant IGF-II mutein has diminished binding affinity for the IGF-I receptor relative to the affinity of naturally-occurring human IGF-II for the IGF-I receptor.",
                        "In some embodiments, the present invention provides a targeted therapeutic fusion protein containing a lysosomal enzyme; and an IGF-II mutein having an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), wherein the IGF-II mutein is resistant to furin cleavage and binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner.",
                        "In some embodiments, the present invention provides a targeted therapeutic fusion protein containing a lysosomal enzyme; and an IGF-II mutein having an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), and having diminished binding affinity for the insulin receptor relative to the affinity of naturally-occurring human IGF-II for the insulin receptor; wherein the IGF-II mutein binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner.",
                        "In some embodiments, the present invention provides a targeted therapeutic fusion protein containing a lysosomal enzyme; and an IGF-II mutein having an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), and having diminished binding affinity for the insulin receptor relative to the affinity of naturally-occurring human IGF-II for the insulin receptor; wherein the IGF-II mutein is resistant to furin cleavage and binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner.",
                        "In some embodiments, an IGF-II mutein suitable for the invention includes a mutation within a region corresponding to amino acids 30-40 of SEQ ID NO:1. In some embodiments, an IGF-II mutein suitable for the invention includes a mutation within a region corresponding to amino acids 34-40 of SEQ ID NO:1 such that the mutation abolishes at least one furin protease cleavage site. In some embodiments, a suitable mutation is an amino acid substitution, deletion and/or insertion. In some embodiments, the mutation is an amino acid substitution at a position corresponding to Arg37 or Arg40 of SEQ ID NO:1. In some embodiments, the amino acid substitution is a Lys or Ala substitution.",
                        "In some embodiments, a suitable mutation is a deletion or replacement of amino acid residues corresponding to positions selected from the group consisting of 31-40, 32-40, 33-40, 34-40, 30-39, 31-39, 32-39, 34-37, 32-39, 3-39, 34-39, 35-39, 36-39, 37-40, 34-40 of SEQ ID NO:1, and combinations thereof.",
                        "In some embodiments, an IGF-II mutein according to the invention further contains a deletion or a replacement of amino acids corresponding to positions 2-7 of SEQ ID NO:1. In some embodiments, an IGF-II mutein according to the invention further includes a deletion or a replacement of amino acids corresponding to positions 1-7 of SEQ NO:1. In some embodiments, an IGF-II mutein according to the invention further contains a deletion or a replacement of amino acids corresponding to positions 62-67 of SEQ ID NO:1. In some embodiments, an IGF-II mutein according to the invention further contains an amino acid substitution at a position corresponding to Tyr27, Leu43, or Ser26 of SEQ ID NO:1. In some embodiments, an IGF-II mutein according to the invention contains at least an amino acid substitution selected from the group consisting of Tyr27Leu, Leu43Val, Ser26Phe and combinations thereof. In some embodiments, an IGF-II mutein according to the invention contains amino acids corresponding to positions 48-55 of SEQ ID NO:1. In some embodiments, an IGF-II mutein according to the invention contains at least three amino acids selected from the group consisting of amino acids corresponding to positions 8, 48, 49, 50, 54, and 55 of SEQ ID NO:1. In some embodiments, an IGF-II mutein of the invention contains, at positions corresponding to positions 54 and 55 of SEQ ID NO:1, amino acids each of which is uncharged or negatively charged at pH 7.4. In some embodiments, the IGF-II mutein has diminished binding affinity for the IGF-I receptor relative to the affinity of naturally-occurring human IGF-II for the IGF-I receptor.",
                        "In some embodiments, a lysosomal enzyme suitable for the invention is human acid alpha-glucosidase (GAA), or a functional variant thereof. In some embodiments, a lysosomal enzyme suitable for the invention includes amino acids 70-952 of human GAA.",
                        "In some embodiments, a targeted therapeutic fusion protein of the invention further includes a spacer between the lysosomal enzyme and the furin-resistant IGF-II mutein. In some embodiments, the spacer contains an amino acid sequence Gly-Ala-Pro.",
                        "The present invention also provides nucleic acids encoding the IGF-II mutein or the targeted therapeutic fusion protein as described in various embodiments above. The present invention further provides various cells containing the nucleic acid of the invention.",
                        "The present invention provides pharmaceutical compositions suitable for treating lysosomal storage disease containing a therapeutically effective amount of a targeted therapeutic fusion protein of the invention. The invention further provides methods of treating lysosomal storage diseases comprising administering to a subject in need of treatment a targeted therapeutic fusion protein according to the invention. In some embodiments, the lysosomal storage disease is Pompe Disease. In some embodiments, the lysosomal storage disease is Fabry Disease. In some embodiments, the lysosomal storage disease is Gaucher Disease.",
                        "In another aspect, the present invention provides a method of producing a targeted therapeutic fusion protein including a step of culturing mammalian cells in a cell culture medium, wherein the mammalian cells carry the nucleic acid of the invention, in particular, as described in various embodiments herein; and the culturing is performed under conditions that permit expression of the targeted therapeutic fusion protein.",
                        "In yet another aspect, the present invention provides a method of producing a targeted therapeutic fusion protein including a step of culturing furin-deficient cells (e.g., furin-deficient mammalian cells) in a cell culture medium, wherein the furin-deficient cells carry a nucleic acid encoding a fusion protein comprising a lysosomal enzyme and an IGF-II mutein having an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), wherein the IGF-II mutein binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner; and wherein the culturing is performed under conditions that permit expression of the targeted therapeutic fusion protein.",
                        "Other features, objects, and advantages of the present invention are apparent in the detailed description that follows. It should be understood, however, that the detailed description, while indicating embodiments of the present invention, is given by way of illustration only, not limitation. Various changes and modifications within the scope of the invention will become apparent to those skilled in the art from the detailed description."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce improved compositions and methods for lysosomal targeting",
                        "describe furin-resistant lysosomal targeting peptides",
                        "describe peptides with reduced binding affinity for insulin receptor",
                        "introduce unexpected discovery of reduced binding affinity",
                        "describe furin-resistant IGF-II mutein",
                        "describe IGF-II mutein with reduced binding affinity for insulin receptor",
                        "describe IGF-II mutein with reduced binding affinity for IGF-I receptor",
                        "describe targeted therapeutic fusion protein with lysosomal enzyme",
                        "describe IGF-II mutein with resistance to furin cleavage",
                        "describe IGF-II mutein with binding to cation-independent M6P receptor",
                        "describe IGF-II mutein with mutations in specific regions",
                        "describe IGF-II mutein with deletion or replacement of amino acids",
                        "describe IGF-II mutein with specific amino acid substitutions",
                        "describe lysosomal enzyme suitable for the invention",
                        "describe targeted therapeutic fusion protein with spacer",
                        "describe nucleic acids encoding IGF-II mutein or fusion protein",
                        "describe pharmaceutical compositions and methods of treatment"
                    ],
                    "num_characters": 8619,
                    "outline_medium": [
                        "introduce GILT technology",
                        "describe furin-resistant lysosomal targeting peptides",
                        "describe peptides with reduced binding affinity for insulin receptor",
                        "describe IGF-II muteins with mutations",
                        "describe targeted therapeutic fusion proteins",
                        "describe nucleic acids encoding IGF-II muteins or fusion proteins",
                        "describe pharmaceutical compositions and methods of treatment",
                        "describe methods of producing targeted therapeutic fusion proteins"
                    ],
                    "outline_short": [
                        "introduce GILT technology for lysosomal targeting",
                        "describe furin-resistant lysosomal targeting peptides",
                        "outline targeted therapeutic fusion proteins",
                        "summarize methods for treating lysosomal storage diseases"
                    ]
                },
                {
                    "title": "DEFINITIONS",
                    "paragraphs": [
                        "Amelioration: As used herein, the term “amelioration” is meant the prevention, reduction or palliation of a state, or improvement of the state of a subject. Amelioration includes, but does not require complete recovery or complete prevention of a disease condition. In some embodiments, amelioration includes reduction of accumulated materials inside lysosomes of relevant diseases tissues.",
                        "Furin-resistant IGF-II mutein: As used herein, the term “furin-resistant IGF-II mutein” refers to an IGF-II-based peptide containing an altered amino acid sequence that abolishes at least one native furin protease cleavage site or changes a sequence close or adjacent to a native furin protease cleavage site such that the furin cleavage is prevented, inhibited, reduced, or slowed down as compared to a wild-type human IGF-II peptide. As used herein, a furin-resistant IGF-II mutein is also referred to as an IGF-II mutein that is resistant to furin.",
                        "Furin protease cleavage site: As used herein, the term “furin protease cleavage site” (also referred to as “furin cleavage site” or “furin cleavage sequence”) refers to the amino acid sequence of a peptide or protein that serves as a recognition sequence for enzymatic protease cleavage by furin or furin-like proteases. Typically, a furin protease cleavage site has a consensus sequence Arg-X-X-Arg (SEQ ID NO: 2), X is any amino acid. The cleavage site is positioned after the carboxy-terminal arginine (Arg) residue in the sequence. In some embodiments, a furin cleavage site may have a consensus sequence Lys/Arg-X-X-X-Lys/Arg-Arg (SEQ ID NO: 3), X is any amino acid. The cleavage site is positioned after the carboxy-terminal arginine (Arg) residue in the sequence.",
                        "Furin: As used herein, the term “furin” refers to any protease that can recognize and cleave the furin protease cleavage site as defined herein, including furin or furin-like protease. Furin is also known as paired basic amino acid cleaving enzyme (PACE). Furin belongs to the subtilisin-like proprotein convertase family. The gene encoding furin was known as FUR (FES Upstream Region).",
                        "Furin-de lent cells: As used herein, the term “furin-deficient cells” refers to any cells whose furin protease activity is inhibited, reduced or eliminated. Furin-deficient cells include both mammalian and non-mammalian cells that do not produce furin or produce reduced amount of furin or defective furin protease.",
                        "Glycosylation Independent Lysosomal Targeting: As used herein, the term “glycosylation independent lysosomal targeting” (also referred to as “GILT”) refer to lysosomal targeting that is mannose-6-phosphate-independent.",
                        "Human acid alpha-glucosidase: As used herein, the term “human acid alpha-glucosidase” (also referred to as “GAA”) refers to precursor wild-type form of human GAA or a functional variant that is capable of reducing glycogen levels in mammalian lysosomes or that can rescue or ameliorate one or more Pompe disease symptoms.",
                        "Improve, increase, or reduce: As used herein, the terms “improve,” “increase” or “reduce,” or grammatical equivalents, indicate values that are relative to a baseline measurement, such as a measurement in the same individual prior to initiation of the treatment described herein, or a measurement in a control individual (or multiple control individuals) in the absence of the treatment described herein. A “control individual” is an individual afflicted with the same form of lysosomal storage disease (e.g., Pompe disease) as the individual being treated, who is about the same age as the individual being treated (to ensure that the stages of the disease in the treated individual and the control individual(s) are comparable).",
                        "Individual, subject, patient: As used herein, the terms “subject,” “individual” or “patient” refer to a human or a non-human mammalian subject. The individual (also referred to as “patient” or “subject”) being treated is an individual (fetus, infant, child, adolescent, or adult human) suffering from a lysosomal storage disease, for example, Pompe disease (i.e., either infantile-, juvenile-, or adult-onset Pompe disease) or having the potential to develop a lysosomal storage disease (e.g., Pompe disease).",
                        "Lysosomal storage diseases: As used herein, “lysosomal storage diseases” refer to a group of genetic disorders that result from deficiency in at least one of the enzymes (e.g., acid hydrolases) that are required to break macromolecules down to peptides, amino acids, monosaccharides, nucleic acids and fatty acids in lysosomes. As a result, individuals suffering from lysosomal storage diseases have accumulated materials in lysosomes. Exemplary lysosomal storage diseases are listed in Table 1.",
                        "Lysosomal enzyme: As used herein, the term “lysosomal enzyme” refers to any enzyme that is capable of reducing accumulated materials in mammalian lysosomes or that can rescue or ameliorate one or more lysosomal storage disease symptoms. Lysosomal enzymes suitable for the invention include both wild-type or modified lysosomal enzymes and can be produced using recombinant and synthetic methods or purified from nature sources. Exemplary lysosomal enzymes are listed in Table 1.",
                        "Spacer: As used herein, the term “spacer” (also referred to as “linker”) refers to a peptide sequence between two protein moieties in a fusion protein. A spacer is generally designed to be flexible or to interpose a structure, such as an alpha-helix, between the two protein moieties. A spacer can be relatively short, such as the sequence Gly-Ala-Pro (SEQ ID NO: 4) or Gly-Gly-Gly-Gly-Gly-Pro (SEQ ID NO: 5), or can be longer, such as, for example, 10-25 amino acids in length.",
                        "Therapeutically effective amount: As used herein, the term “therapeutically effective amount” refers to an amount of a targeted therapeutic fusion protein which confers a therapeutic effect on the treated subject, at a reasonable benefit/risk ratio applicable to any medical treatment. The therapeutic effect may be objective (i.e., measurable by some test or marker) or subjective (i.e., subject gives an indication of or feels an effect). In particular, the “therapeutically effective amount” refers to an amount of a therapeutic fusion protein or composition effective to treat, ameliorate, or prevent a desired disease or condition, or to exhibit a detectable therapeutic or preventative effect, such as by ameliorating symptoms associated with the disease, preventing or delaying the onset of the disease, and/or also lessening the severity or frequency of symptoms of the disease. A therapeutically effective amount is commonly administered in a dosing regimen that may comprise multiple unit doses. For any particular therapeutic fusion protein, a therapeutically effective amount (and/or an appropriate unit dose within an effective dosing regimen) may vary, for example, depending on route of administration, on combination with other pharmaceutical agents. Also, the specific therapeutically effective amount (and/or unit dose) for any particular patient may depend upon a variety of factors including the disorder being treated and the severity of the disorder; the activity of the specific pharmaceutical agent employed; the specific composition employed; the age, body weight, general health, sex and diet of the patient; the time of administration, route of administration, and/or rate of excretion or metabolism of the specific fusion protein employed; the duration of the treatment; and like factors as is well known in the medical arts.",
                        "Treatment: As used herein, the term “treatment” (also “treat” or “treating”) refers to any administration of a therapeutic fusion protein that partially or completely alleviates, ameliorates, relieves, inhibits, delays onset of, reduces severity of and/or reduces incidence of one or more symptoms or features of a particular disease, disorder, and/or condition. Such treatment may be of a subject who does not exhibit signs of the relevant disease, disorder and/or condition and/or of a subject who exhibits only early signs of the disease, disorder, and/or condition. Alternatively or additionally, such treatment may be of a subject who exhibits one or more established signs of the relevant disease, disorder and/or condition. For example, treatment can refer to improvement of cardiac status (e.g., increase of end-diastolic and/or end-systolic volumes, or reduction, amelioration or prevention of the progressive cardiomyopathy that is typically found in Pompe disease) or of pulmonary function (e.g., increase in crying vital capacity over baseline capacity, and/or normalization of oxygen desaturation during crying); improvement in neurodevelopment and/or motor skills (e.g., increase in AIMS score); reduction of glycogen levels in tissue of the individual affected by the disease; or any combination of these effects. In some embodiments, treatment includes improvement of glycogen clearance, particularly in reduction or prevention of Pompe disease-associated cardiomyopathy.",
                        "As used in this application, the terms “about” and “approximately” are used as equivalents. Any numerals used in this application with or without about/approximately are meant to cover any normal fluctuations appreciated by one of ordinary skill in the relevant art."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define amelioration",
                        "define furin-resistant IGF-II mutein",
                        "define furin protease cleavage site",
                        "define furin",
                        "define furin-deficient cells",
                        "define Glycosylation Independent Lysosomal Targeting (GILT)",
                        "define human acid alpha-glucosidase (GAA)",
                        "define improve, increase, or reduce",
                        "define individual, subject, patient",
                        "define lysosomal storage diseases",
                        "define lysosomal enzyme",
                        "define spacer",
                        "define therapeutically effective amount",
                        "define treatment",
                        "describe use of about and approximately",
                        "define specific terms related to Pompe disease",
                        "define specific terms related to Fabry disease",
                        "define specific terms related to Gaucher disease"
                    ],
                    "num_characters": 9275,
                    "outline_medium": [
                        "define amelioration",
                        "define furin-resistant IGF-II mutein",
                        "define furin protease cleavage site",
                        "define furin",
                        "define furin-deficient cells",
                        "define glycosylation independent lysosomal targeting",
                        "define human acid alpha-glucosidase",
                        "define improve, increase, or reduce",
                        "define individual, subject, patient, lysosomal storage diseases, lysosomal enzyme, spacer, therapeutically effective amount, and treatment"
                    ],
                    "outline_short": [
                        "define amelioration",
                        "define furin-resistant IGF-II mutein",
                        "define furin protease cleavage site",
                        "define various terms related to lysosomal storage diseases"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The present invention provides improved methods and compositions for targeting lysosomal enzymes based on the glycosylation-independent lysosomal targeting (GILT) technology. Among other things, the present invention provides IGF-II muteins that are resistant to furin and/or has reduced or diminished binding affinity for the insulin receptor and targeted therapeutic fusion proteins containing an IGF-II mutein of the invention. The present invention also provides methods of making and using the same.",
                        "Various aspects of the invention are described in detail in the following sections. The use of sections is not meant to limit the invention. Each section can apply to any aspect of the invention. In this application, the use of “or” means “and/or” unless stated otherwise."
                    ],
                    "subsections": [
                        {
                            "title": "Lysosomal Enzymes",
                            "paragraphs": [
                                "A lysosomal enzyme suitable for the invention includes any enzyme that is capable of reducing accumulated materials in mammalian lysosomes or that can rescue or ameliorate one or more lysosomal storage disease symptoms. Suitable lysosomal enzymes include both wild-type or modified lysosomal enzymes and can be produced using recombinant or synthetic methods or purified from nature sources. Exemplary lysosomal enzymes are listed in Table 1.",
                                "In some embodiments, a lysosomal enzyme suitable for the invention includes a polypeptide sequence having 50-100%, including 50, 55, 60, 65, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99 and 100%, sequence identity to the naturally-occurring polynucleotide sequence of a human enzyme shown in Tables 1, while still encoding a protein that is capable of reducing accumulated materials in mammalian lysosomes or that can rescue or ameliorate one or more lysosomal storage disease symptoms.",
                                "“Percent (%) amino acid sequence identity” with respect to the lysosomal enzyme sequences is defined as the percentage of amino acid residues in a candidate sequence that are identical with the amino acid residues in the naturally-occurring human enzyme sequence, after aligning the sequences and introducing gaps, if necessary, to achieve the maximum percent sequence identity, and not considering any conservative substitutions as part of the sequence identity. Alignment for purposes of determining percent amino acid sequence identity can be achieved in various ways that are within the skill in the art, for instance, using publicly available computer software such as BLAST, ALIGN or Megalign (DNASTAR) software. Those skilled in the art can determine appropriate parameters for measuring alignment, including any algorithms needed to achieve maximal alignment over the full length of the sequences being compared. Preferably, the WU-BLAST-2 software is used to determine amino acid sequence identity (Altschul et al., Methods in Enzymology 266, 460-480 (1996); http://blast.wustUedu/blast/README.html). WU-BLAST-2 uses several search parameters, most of which are set to the default values. The adjustable parameters are set with the following values; overlap span=1, overlap fraction=0.125, world threshold (T)=11. HSP score (S) and HSP S2 parameters are dynamic values and are established by the program itself, depending upon the composition of the particular sequence, however, the minimum values may be adjusted and are set as indicated above."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define lysosomal enzymes",
                                "describe suitable lysosomal enzymes",
                                "specify polypeptide sequence identity",
                                "explain alignment for sequence identity",
                                "introduce Pompe disease as an example"
                            ],
                            "num_characters": 2561,
                            "outline_medium": [
                                "define lysosomal enzymes",
                                "describe characteristics of lysosomal enzymes"
                            ],
                            "outline_short": [
                                "define lysosomal enzymes for treating lysosomal storage diseases"
                            ]
                        },
                        {
                            "title": "Pompe Disease",
                            "paragraphs": [
                                "One exemplary lysosomal storage disease is Pompe disease. Pompe disease is a rare genetic disorder caused by a deficiency in the enzyme acid alpha-glucosidase (GAA), which is needed to break down glycogen, a stored form of sugar used for energy. Pompe disease is also known as glycogen storage disease type II, GSD II, type II glycogen storage disease, glycogenosis type II, acid maltase deficiency, alpha-1,4-glucosidase deficiency, cardiomegalia glycogenic diffusa, and cardiac form of generalized glycogenosis. The build-up of glycogen causes progressive muscle weakness (myopathy) throughout the body and affects various body tissues, particularly in the heart, skeletal muscles, liver, respiratory and nervous system.",
                                "The presenting clinical manifestations of Pompe disease can vary widely depending on the age of disease onset and residual GAA activity. Residual GAA activity correlates with both the amount and tissue distribution of glycogen accumulation as well as the severity of the disease. Infantile-onset Pompe disease (less than 1% of normal GAA activity) is the most severe form and is characterized by hypotonia, generalized muscle weakness, and hypertrophic cardiomyopathy, and massive glycogen accumulation in cardiac and other muscle tissues. Death usually occurs within one year of birth due to cardiorespiratory failure. Hirschhorn et al. (2001) “Glycogen Storage Disease Type II: Acid Alpha-glucosidase (Acid Maltase) Deficiency,” in Scriver et al., eds., The Metabolic and Molecular Basis of Inherited Disease, 8th Ed., New York: McGraw-Hill, 3389-3420. Juvenile-onset (1-10% of normal GAA activity) and adult-onset (10-40% of normal GAA activity) Pompe disease are more clinically heterogeneous, with greater variation in age of onset, clinical presentation, and disease progression. Juvenile- and adult-onset Pompe disease are generally characterized by lack of severe cardiac involvement, later age of onset, and slower disease progression, but eventual respiratory or limb muscle involvement results in significant morbidity and mortality. While life expectancy can vary, death generally occurs due to respiratory failure. Hirschhorn et al. (2001) “Glycogen Storage Disease Type II: Acid Alpha-glucosidase (Acid Maltase) Deficiency,” in Scriver et al., eds., The Metabolic and Molecular Basis of Inherited Disease, 8th Ed., New York: McGraw-Hill, 3389-3420.",
                                "A GAA enzyme suitable for treating Pompe disease includes a wild-type human GAA, or a fragment or sequence variant thereof which retains the ability to cleave α1-4 linkages in linear oligosaccharides."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Pompe disease",
                                "describe symptoms and progression",
                                "explain residual GAA activity correlation",
                                "describe infantile-onset, juvenile-onset, and adult-onset forms",
                                "mention life expectancy and mortality"
                            ],
                            "num_characters": 2588,
                            "outline_medium": [
                                "introduce Pompe disease",
                                "describe symptoms and characteristics of Pompe disease"
                            ],
                            "outline_short": [
                                "describe Pompe disease as a lysosomal storage disease"
                            ]
                        },
                        {
                            "title": "Enzyme Replacement Therapy",
                            "paragraphs": [
                                "Enzyme replacement therapy (ERT) is a therapeutic strategy to correct an enzyme deficiency by infusing the missing enzyme into the bloodstream. As the blood perfuses patient tissues, enzyme is taken up by cells and transported to the lysosome, where the enzyme acts to eliminate material that has accumulated in the lysosomes due to the enzyme deficiency. For lysosomal enzyme replacement therapy to be effective, the therapeutic enzyme must be delivered to lysosomes in the appropriate cells in tissues where the storage defect is manifest. Conventional lysosomal enzyme replacement therapeutics are delivered using carbohydrates naturally attached to the protein to engage specific receptors on the surface of the target cells. One receptor, the cation-independent M6P receptor (CI-MPR), is particularly useful for targeting replacement lysosomal enzymes because the CI-MPR is present on the surface of most cell types.",
                                "The terms “cation-independent mannose-6-phosphate receptor (CI-MPR),” “M6P/IGF-II receptor,” “CI-MPR/IGF-II receptor,” “IGF-II receptor” or “IGF2 Receptor,” or abbreviations thereof, are used interchangeably herein, referring to the cellular receptor which binds both M6P and IGF-II."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce enzyme replacement therapy",
                                "describe lysosomal enzyme delivery"
                            ],
                            "num_characters": 1206,
                            "outline_medium": [
                                "describe enzyme replacement therapy"
                            ],
                            "outline_short": [
                                "introduce enzyme replacement therapy for lysosomal storage diseases"
                            ]
                        },
                        {
                            "title": "Glycosylation Independent Lysosomal Targeting",
                            "paragraphs": [
                                "We have developed a Glycosylation Independent Lysosomal Targeting (GILT) technology to target therapeutic enzymes to lysosomes. Specifically, the GILT technology uses a peptide tag instead of M6P to engage the CI-MPR for lysosomal targeting. Typically, a GILT tag is a protein, peptide, or other moiety that binds the CI-MPR in a mannose-6-phosphate-independent mariner. Advantageously, this technology mimics the normal biological mechanism for uptake of lysosomal enzymes, yet does so in a manner independent of mannose-6-phosphate.",
                                "A preferred GILT tag is derived from human insulin-like growth factor II (IGF-II). Human IGF-II is a high affinity ligand for the CI-MPR, which is also referred to as IGF-II receptor. Binding of GILT-tagged therapeutic enzymes to the M6P/IGF-II receptor targets the protein to the lysosome via the endocytic pathway. This method has numerous advantages over methods involving glycosylation including simplicity and cost effectiveness, because once the protein is isolated, no further modifications need be made.",
                                "Detailed description of the GILT technology and GILT tag can be found in U.S. Publication Nos. 20030082176, 20040006008, 20040005309, and 20050281805, the teachings of all of which are hereby incorporated by references in their entireties."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce GILT technology",
                                "describe GILT tag and CI-MPR binding"
                            ],
                            "num_characters": 1288,
                            "outline_medium": [
                                "introduce GILT technology"
                            ],
                            "outline_short": [
                                "describe GILT technology using peptide tags for lysosomal targeting"
                            ]
                        },
                        {
                            "title": "Furin-Resistant GILT Tag",
                            "paragraphs": [
                                "During the course of development of GILT-tagged lysosomal enzymes for treating lysosomal storage disease, it has become apparent that the IGF-II derived GILT tag may be subjected to proteolytic cleavage by furin during production in mammalian cells (see the examples section). Furin protease typically recognizes and cleaves a cleavage site having a consensus sequence Arg-X-X-Arg (SEQ ID NO: 2), X is any amino acid. The cleavage site is positioned after the carboxy-terminal arginine (Arg) residue in the sequence. In some embodiments, a furin cleavage site has a consensus sequence Lys/Arg-X-X-X-Lys/Arg-Arg (SEQ ID NO: 3), X is any amino acid. The cleavage site is positioned after the carboxy-terminal arginine (Arg) residue in the sequence. As used herein, the term “furin” refers to any protease that can recognize and cleave the furin protease cleavage site as defined herein, including furin or furin-like protease. Furin is also known as paired basic amino acid cleaving enzyme (PACE). Furin belongs to the subtilisin-like proprotein convertase family that includes PC3, a protease responsible for maturation of proinsulin in pancreatic islet cells. The gene encoding furin was known as FUR (FES Upstream Region).",
                                "The mature human IGF-II peptide sequence is shown below.",
                                "As can be seen, the mature human IGF-II contains two potential overlapping furin cleavage sites between residues 34-40 (bolded and underlined). Arrows point to two potential furin cleavage positions.",
                                "We have developed modified GILT tags that are resistant to cleavage by furin and still retain ability to bind to the CI-MPR in a mannose-6-phosphate-independent manner. Specifically, furin-resistant GILT tags can be designed by mutating the amino acid sequence at one or more furin cleavage sites such that the mutation abolishes at least one furin cleavage site. Thus, in some embodiments, a furin-resistant GILT tag is a furin-resistant IGF-II mutein containing a mutation that abolishes at least one furin protease cleavage site or changes a sequence adjacent to the furin protease cleavage site such that the furin cleavage is prevented, inhibited, reduced or slowed down as compared to a wild-type IGF-II peptide (e.g., wild-type human mature IGF-II). Typically, a suitable mutation does not impact the ability of the furin-resistant GILT tag to bind to the human cation-independent mannose-6-phosphate receptor. In particular, a furin-resistant IGF-II mutein suitable for the invention binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner with a dissociation constant of 10−7 M or less (e.g., 10−8, 10−9, 10−10, 10−11, or less) at pH 7.4. In some embodiments, a furin-resistant IGF-II mutein contains a mutation within a region corresponding to amino acids 30-40 (e.g., 31-40, 32-40, 33-40, 34-40, 30-39, 31-39, 32-39, 34-37, 32-39, 33-39, 34-39, 35-39, 36-39, 37-40, 34-40) of SEQ ID NO:1. In some embodiments, a suitable mutation abolishes at least one furin protease cleavage site. A mutation can be amino acid substitutions, deletions, insertions. For example, any one amino acid within the region corresponding to residues 30-40 (e.g., 31-40, 32-40, 33-40, 34-40, 30-39, 31-39, 32-39, 34-37, 32-39, 33-39, 34-39, 35-39, 36-39, 37-40, 34-40) of SEQ ID NO:1 can be substituted with any other amino acid or deleted. For example, substitutions at position 34 may affect furin recognition of the first cleavage site. Insertion of one or more additional amino acids within each recognition site may abolish one or both furin cleavage sites. Deletion of one or more of the residues in the degenerate positions may also abolish both furin cleavage sites.",
                                "In some embodiments, a furin-resistant IGF-II mutein contains amino acid substitutions at positions corresponding to Arg37 or Arg40 of SEQ ID NO:1. In some embodiments, a furin-resistant IGF-II mutein contains a Lys or Ala substitution at positions Arg37 or Arg40. Other substitutions are possible, including combinations of Lys and/or Ala mutations at both positions 37 and 40, or substitutions of amino acids other than Lys or Ala.",
                                "In some embodiments, the furin-resistant IGF-II mutein suitable for the invention may contain additional mutations. For example, up to 30% or more of the residues of SEQ ID NO:1 may be changed (e.g., up to 1%, 2%, 3%, 4%, 5%, 6%, 7%, 8%, 9%, 10%, 11%, 12%, 13%, 14%, 15%, 16%, 17%, 18%, 19%, 20%, 21%, 22%, 23%, 24%, 25%, 26%, 27%, 28%, 29%, 30% or more residues may be changed). Thus, a furin-resistant IGF-II mutein suitable for the invention may have an amino acid sequence at least 70%, including at least 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99%, identical to SEQ ID NO:1.",
                                "In some embodiments, a furin-resistant IGF-II mutein suitable for the invention is targeted specifically to the CI-MPR. Particularly useful are mutations in the IGF-II polypeptide that result in a protein that binds the CI-MPR with high affinity (e.g., with a dissociation constant of 10−7 M or less at pH 7.4) while binding other receptors known to be bound by IGF-II with reduced affinity relative to native IGF-II. For example, a furin-resistant mutein suitable for the invention can be modified to have diminished binding affinity for the IGF-I receptor relative to the affinity of naturally-occurring human IGF-II for the IGF-I receptor. For example, substitution of IGF-II residues Tyr 27 with Leu, Leu 43 with Val or Ser 26 with Phe diminishes the affinity of IGF-II for the IGF-I receptor by 94-, 56-, and 4-fold respectively (Torres et al. (1995) J. Mol. Biol. 248(2):385-401). Deletion of residues 1-7 of human IGF-II resulted in a 30-fold decrease in affinity for the human IGF-I receptor and a concomitant 12 fold increase in affinity for the rat IGF-II receptor (Hashimoto et al. (1995) J. Biol. Chem. 270(30):18013-8). The NMR structure of IGF-II shows that Thr 7 is located near residues 48 Phe and 50 Ser as well as near the 9 Cys-47 Cys disulfide bridge. It is thought that interaction of Thr 7 with these residues can stabilize the flexible N-terminal hexapeptide required for IGF-I receptor binding (Terasawa et al. (1994) EMBO J. 13(23)5590-7). At the same time this interaction can modulate binding to the IGF-II receptor. Truncation of the C-terminus of IGF-II (residues 62-67) also appear to lower the affinity of IGF-II for the IGF-I receptor by 5 fold (Roth et al. (1991) Biochem. Biophys. Res. Commun. 181(2):907-14).",
                                "The binding surfaces for the IGF-I and cation-independent M6P receptors are on separate faces of IGF-II. Based on structural and mutational data, functional cation-independent M6P binding domains can be constructed that are substantially smaller than human IGF-II. For example, the amino terminal amino acids (e.g., 1-7 or 2-7) and/or the carboxy terminal residues 62-67 can be deleted or replaced. Additionally, amino acids 29-40 can likely be eliminated or replaced without altering the folding of the remainder of the polypeptide or binding to the cation-independent M6P receptor. Thus, a targeting moiety including amino acids 8-28 and 41-61 can be constructed. These stretches of amino acids could perhaps be joined directly or separated by a linker. Alternatively, amino acids 8-28 and 41-61 can be provided on separate polypeptide chains. Comparable domains of insulin, which is homologous to IGF-II and has a tertiary structure closely related to the structure of IGF-II, have sufficient structural information to permit proper refolding into the appropriate tertiary structure, even when present in separate polypeptide chains (Wang et al. (1991) Trends Biochem. Sci. 279-281). Thus, for example, amino acids 8-28, or a conservative substitution variant thereof, could be fused to a lysosomal enzyme; the resulting fusion protein could be admixed with amino acids 41-61, or a conservative substitution variant thereof, and administered to a patient.",
                                "IGF-II can also be modified to minimize binding to serum IGF-binding proteins (Baxter (2000) Am. J. Physiol Endocrinol Metab. 278(6):967-76) to avoid sequestration of IGF-II/GILT constructs. A number of studies have localized residues in IGF-II necessary for binding to IGF-binding proteins. Constructs with mutations at these residues can be screened for retention of high affinity binding to the M6P/IGF-II receptor and for reduced affinity for IGF-binding proteins. For example, replacing Phe 26 of IGF-II with Ser is reported to reduce affinity of IGF-II for IGFBP-1 and -6 with no effect on binding to the M6P/IGF-II receptor (Bach et al. (1993) J. Biol. Chem. 268(13):9246-54). Other substitutions, such as Lys for Glu 9, can also be advantageous. The analogous mutations, separately or in combination, in a region of IGF-I that is highly conserved with IGF-II result in large decreases in IGF-BP binding (Magee et al. (1999) Biochemistry 38(48):15863-70).",
                                "An alternate approach is to identify minimal regions of IGF-II that can bind with high affinity to the M6P/IGF-II receptor. The residues that have been implicated in IGF-II binding to the M6P/IGF-II receptor mostly cluster on one face of IGF-II (Terasawa et al. (1994) EMBO J. 13(23):5590-7). Although IGF-II tertiary structure is normally maintained by three intramolecular disulfide bonds, a peptide incorporating the amino acid sequence on the M6P/IGF-II receptor binding surface of IGF-II can be designed to fold properly and have binding activity. Such a minimal binding peptide is a highly preferred lysosomal targeting domain. For example, a preferred lysosomal targeting domain is amino acids 8-67 of human IGF-II. Designed peptides, based on the region around amino acids 48-55, which bind to the M6P/IGF-II receptor, are also desirable lysosomal targeting domains. Alternatively, a random library of peptides can be screened for the ability to bind the M6P/IGF-II receptor either via a yeast two hybrid assay, or via a phage display type assay."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce furin-resistant GILT tag",
                                "describe furin protease and cleavage site",
                                "show mature human IGF-II peptide sequence",
                                "identify potential furin cleavage sites",
                                "describe mutations to abolish furin cleavage sites",
                                "specify suitable mutations",
                                "describe Lys or Ala substitutions",
                                "mention additional mutations",
                                "specify percentage of residues that can be changed",
                                "describe binding to CI-MPR",
                                "specify dissociation constant",
                                "describe mutations in IGF-II polypeptide",
                                "describe diminished binding affinity for IGF-I receptor",
                                "specify substitutions to reduce affinity",
                                "describe deletion of residues",
                                "describe truncation of C-terminus",
                                "describe binding surfaces for IGF-I and CI-MPR",
                                "describe construction of targeting moiety",
                                "describe minimal regions of IGF-II for binding"
                            ],
                            "num_characters": 10017,
                            "outline_medium": [
                                "introduce furin-resistant GILT tag",
                                "describe furin cleavage site",
                                "describe mutations to abolish furin cleavage site",
                                "describe characteristics of furin-resistant IGF-II mutein",
                                "describe binding affinity of furin-resistant IGF-II mutein",
                                "describe additional mutations to furin-resistant IGF-II mutein",
                                "describe targeting moiety",
                                "describe minimizing binding to serum IGF-binding proteins",
                                "describe screening for binding affinity"
                            ],
                            "outline_short": [
                                "introduce furin-resistant GILT tags for lysosomal targeting",
                                "describe mutations to abolish furin cleavage sites",
                                "specify mutations at positions 34, 37, or 40 of IGF-II",
                                "describe additional mutations to improve binding affinity"
                            ]
                        },
                        {
                            "title": "Binding Affinity for the Insulin Receptor",
                            "paragraphs": [
                                "The inventors of the present application discovered unexpectedly that many furin-resistant IGF-II muteins described herein have reduced or diminished binding affinity for the insulin receptor. Thus, in some embodiments, a peptide tag suitable for the invention has reduced or diminished binding affinity for the insulin receptor relative to the affinity of naturally-occurring human IGF-II for the insulin receptor. In some embodiments, peptide tags with reduced or diminished binding affinity for the insulin receptor suitable for the invention include peptide tags having a binding affinity for the insulin receptor that is more than 1.5-fold, 2-fold, 3-fold, 4-fold, 5-fold, 6-fold, 7-fold, 8-fold, 9-fold, 10-fold, 12-fold, 14-fold, 16-fold, 18-fold, 20-fold, 50-fold, 100-fold less than that of the wild-type mature human IGF-II. The binding affinity for the insulin receptor can be measured using various in vitro and in vivo assays known in the art. Exemplary binding assays are described in the Examples section."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe reduced binding affinity for insulin receptor",
                                "specify binding affinity measurement"
                            ],
                            "num_characters": 1020,
                            "outline_medium": [
                                "describe binding affinity of furin-resistant IGF-II mutein for insulin receptor"
                            ],
                            "outline_short": [
                                "describe reduced binding affinity for insulin receptor in furin-resistant GILT tags"
                            ]
                        },
                        {
                            "title": "Mutagenesis",
                            "paragraphs": [
                                "IGF-II muteins can be prepared by introducing appropriate nucleotide changes into the IGF-II DNA, or by synthesis of the desired IGF-II polypeptide. Variations in the IGF-II sequence can be made, for example, using any of the techniques and guidelines for conservative and non-conservative mutations set forth, for instance, in U.S. Pat. No. 5,364,934. Variations may be a substitution, deletion or insertion of one or more codons encoding IGF-II that results in a change in the amino acid sequence of IGF-II as compared with a naturally-occurring sequence of mature human IGF-II. Amino acid substitutions can be the result of replacing one amino acid with another amino acid having similar structural and/or chemical properties, such as the replacement of a leucine with a serine, i.e., conservative amino acid replacements. Amino acid substitutions can also be the result of replacing one amino acid with another amino acid having dissimilar structural and/or chemical properties, i.e., non-conservative amino acid replacements. Insertions or deletions may optionally be in the range of 1 to 5 amino acids. The variation allowed may be determined by systematically making insertions, deletions or substitutions of amino acids in the sequence and testing the resulting variants for activity in the in vivo or in vitro assays known in the art (such as binding assays to the CI-MPR or furin cleavage assays).",
                                "Scanning amino acid analysis can also be employed to identify one or more amino acids along a contiguous sequence. Among the preferred scanning amino acids are relatively small, neutral amino acids. Such amino acids include alanine, glycine, serine, and cysteine. Alanine is typically a preferred scanning amino acid among this group because it eliminates the side-chain beyond the beta-carbon and is less likely to alter the main-chain conformation of the variant. Alanine is also typically preferred because it is the most common amino acid. Further, it is frequently found in both buried and exposed positions [Creighton, The Proteins, (W. H. Freeman & Co., N.Y.); Chothia, J. Mol. Biol., 150:1 (1976)]. If alanine substitution does not yield adequate amounts of variant, an isoteric amino acid can be used.",
                                "The variations can be made using methods known in the art such as oligonucleotide-mediated (site-directed) mutagenesis, alanine scanning, and PCR mutagenesis. Site-directed mutagenesis [Carter et al., Nucl. Acids Res., 13:4331 (1986); Zoller et al., Nucl. Acids Res., 10:6487 (1987)], cassette mutagenesis [Wells et al., Gene, 34:315 (1985)], restriction selection mutagenesis [Wells et al., Philos. Trans. R. Soc. London SerA, 317:415 (1986)] or other known techniques can be performed on the cloned DNA to produce IGF-II muteins."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce mutagenesis",
                                "describe nucleotide changes",
                                "specify conservative and non-conservative mutations",
                                "describe insertions, deletions, and substitutions",
                                "mention scanning amino acid analysis"
                            ],
                            "num_characters": 2752,
                            "outline_medium": [
                                "describe methods for preparing IGF-II muteins",
                                "describe scanning amino acid analysis"
                            ],
                            "outline_short": [
                                "describe methods for introducing mutations into IGF-II DNA"
                            ]
                        },
                        {
                            "title": "Spacer",
                            "paragraphs": [
                                "A furin-resistant GILT tag can be fused to the N-terminus or C-terminus of a polypeptide encoding a lysosomal enzyme. The GILT tag can be fused directly to the lysosomal enzyme polypeptide or can be separated from the lysosomal enzyme polypeptide by a linker or a spacer. An amino acid linker or spacer is generally designed to be flexible or to interpose a structure, such as an alpha-helix, between the two protein moieties. A linker or spacer can be relatively short, such as the sequence Gly-Ala-Pro (SEQ ID NO: 4) or Gly-Gly-Gly-Gly-Gly-Pro (SEQ ID NO: 5), or can be longer, such as, for example, 10-25 amino acids in length. The site of a fusion junction should be selected with care to promote proper folding and activity of both fusion partners and to prevent premature separation of a peptide tag from a GAA polypeptide. In a preferred embodiment, the linker sequence is Gly-Ala-Pro (SEQ ID NO: 4).",
                                "Additional constructs of GILT-tagged GAA proteins that can be used in the methods and compositions of the present invention were described in detail in U.S. Publication No. 20050244400, the entire disclosure of which is incorporated herein by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe GILT tag fusion",
                                "describe linker or spacer design"
                            ],
                            "num_characters": 1162,
                            "outline_medium": [
                                "describe spacer design"
                            ],
                            "outline_short": [
                                "describe spacer design"
                            ]
                        },
                        {
                            "title": "Cells",
                            "paragraphs": [
                                "Any mammalian cell or cell type susceptible to cell culture, and to expression of polypeptides, may be utilized in accordance with the present invention, such as, for example, human embryonic kidney (HEK) 293, Chinese hamster ovary (CHO), monkey kidney (COS), HT1080, C10, HeLa, baby hamster kidney (BHK), 3T3, C127, CV-1, HaK, NS/0, and L-929 cells. Non-limiting examples of mammalian cells that may be used in accordance with the present invention include, but are not limited to, BALB/c mouse myeloma line (NSO/1, ECACC No: 85110503); human retinoblasts (PER.C6 (CruCell, Leiden, The Netherlands)); monkey kidney CV1 line transformed by SV40 (COS-7, ATCC CRL 1651); human embryonic kidney line (293 or 293 cells subcloned for growth in suspension culture, Graham et al., J. Gen Virol., 36:59 (1977)); baby hamster kidney cells (BHK, ATCC CCL 10); Chinese hamster ovary cells +/−DHFR (CHO, Urlaub and Chasin, Proc. Natl. Acad. Sci. USA, 77:4216 (1980)); mouse sertoli cells (TM4, Mather, Biol. Reprod., 23:243-251 (1980)); monkey kidney cells (CV1 ATCC CCL 70); African green monkey kidney cells (VERO-76, ATCC CRL-1 587); human cervical carcinoma cells (HeLa, ATCC CCL 2); canine kidney cells (MDCK, ATCC CCL 34); buffalo rat liver cells (BRL 3A, ATCC CRL 1442); human lung cells (W138, ATCC CCL 75); human liver cells (Hep G2, HB 8065); mouse mammary tumor (MMT 060562, ATCC CCL51); TR1 cells (Mather et al., Annals N.Y. Acad. Sci., 383:44-68 (1982)); MRC 5 cells; FS4 cells; and a human hepatoma line (Hep G2). In some embodiments, the fusion protein of the present invention is produced from CHO cell lines.",
                                "The fusion protein of the invention can also be expressed in a variety of non-mammalian host cells such as, for example, insect (e.g., Sf-9, Sf-21, Hi5), plant (e.g., Leguminosa, cereal, or tobacco), yeast (e.g., S. cerivisae, P. pastoris), prokaryote (e.g., E. Coli, B. subtilis and other Bacillus spp., Pseudomonas spp., Streptomyces spp), or fungus.",
                                "In some embodiments, a fusion protein with or without a furin-resistant GILT tag can be produced in furin-deficient cells. As used herein, the term “furin-deficient cells” refers to any cells whose furin protease activity is inhibited, reduced or eliminated. Furin-deficient cells include both mammalian and non-mammalian cells that do not produce furin or produce reduced amount or defective furin protease. Exemplary furin deficient cells that are known and available to the skilled artisan, including but not limited to FD11 cells (Gordon et al (1997) Infection and Immunity 65(8):3370 3375), and those mutant cells described in Moebring and Moehring (1983) Infection and Immunity 41(3):998 1009. Alternatively, a furin deficient cell may be obtained by exposing the above-described mammalian and non-mammalian cells to mutagenesis treatment, e.g., irradiation, ethidium bromide, bromidated uridine (BrdU) and others, preferably chemical mutagenesis, and more preferred ethyl methane sulfonate mutagenesis, recovering the cells which survive the treatment and selecting for those cells which are found to be resistant to the toxicity of Pseudomonas exotoxin A (see Moehring and Moehrin (1983) Infection and Immunity 41(3):998 1009).",
                                "**Underglycosylation**",
                                "Targeted therapeutic proteins of the invention can be underglycosylated, that is, one or more carbohydrate structures that would normally be present on a naturally-occurring human protein is preferably omitted, removed, modified, or masked. Without wishing to be bound by any theories, it is contemplated that an underglycosylated protein may extend the half-life of the protein in a mammal. Underglycosylation can be achieved in many ways. In some embodiments, the targeted fusion protein of the invention can be produced using a secretory signal peptide to facilitate secretion of the fusion protein. For example, the fusion protein can be produced using an IGF-II signal peptide. In general, the fusion protein produced using an IGF-II signal peptide has reduced mannose-6-phosphate (M6P) level on the surface of the protein compared to wild-type enzyme. In some embodiments, a protein may be completely underglycosylated (as when synthesized in E. coli), partially unglycosylated (as when synthesized in a mammalian system after disruption of one or more glycosylation sites by site-directed mutagenesis), or may have a non-mammalian glycosylation pattern. For example, underglycosylated fusion proteins may be generated by modifying, substituting or eliminating one or more glycosylation sites by site-directed mutagenesis. For example, wild-type GAA typically have seven sites that match the canonical recognition sequence for N-linked glycosylation, Asn-Xaa-Thr/Ser (SEQ ID NO: 7) (Xaa can be any residue except Pro), namely, Asn-140, -233, -390, -470, -652, -882 and -925 (Hoefsloot et al., 1988; Martiniuk et al., 1990b). One or more Asn at the above described positions may be changed or eliminated to generated underglycosylated GAA. In some embodiments, Asn may be changed to Gln.",
                                "In some embodiments, a therapeutic fusion protein can be deglycosylated after synthesis. For example, deglycosylation can be through chemical or enzymatic treatments, and may lead to complete deglycosylation or, if only a portion of the carbohydrate structure is removed, partial deglycosylation.",
                                "In some embodiments, glycosylation of a lysosomal enzyme is modified, e.g., by oxidation and reduction, to reduce clearance of the therapeutic protein from the blood. For example, a lysosomal enzyme can be deglycosylated by periodate treatment. In particular, treatment with periodate and a reducing agent such as sodium borohydride is effective to modify the carbohydrate structure of most glycoproteins. Periodate treatment oxidizes vicinal diols, cleaving the carbon-carbon bond and replacing the hydroxyl groups with aldehyde groups; borohydride reduces the aldehydes to hydroxyls. For example, at 1 mM concentration, periodate exclusively oxidizes sialic acid groups and at or above 10 mM all available vicinal diols are converted to aldehydes (Herrnanson, G. T. 1996, Bioconjugate techniques. Academic press). Once formed, aldehyde groups are highly reactive and may form Schiff's base linkages with primary amino groups in the protein resulting intramolecular linkages. Therefore, aldehyde groups formed ought to be reduced to alcohol groups. A commonly used reducing agent is NaBH4 and the reaction is best run under alkaline conditions. Many sugar residues including vicinal diols, therefore, are cleaved by this treatment. Nevertheless, while this treatment converts cyclic carbohydrates into linear carbohydrates, it does not completely remove the carbohydrate, minimizing risks of exposing potentially protease-sensitive or antigenic polypeptide sites.",
                                "Grubb, J. H., et al (Grubb et al, 2008, PNAS 105:26(6) report treatment of human 8-glucuronidase with sodium metaperiodate followed by sodium borohydride reduction. The modified beta-glucuronidase retained 90% of activity, but lost both mannose and mannose-6-phosphate dependent receptor uptake activity. The alkaline pH condition used in the reduction due to sodium borohydride reagent as described by Grubb et al is not suitable for all lysosomal enzymes, many of which are labile under alkaline conditions.",
                                "Therefore, in some embodiments, sodium cyanoborohydride is used as reducing agent. While the rate of reduction of aldehydes by cyanoborohydride is negligible at neutral pH and above, the rate of reaction becomes rapid at acidic pH (Borch, et al. 1971, JACS 93:2897). For example, regimens using sodium metaperiodate and cyanoborohydride at pH 3.5-4 can be used.",
                                "For example, treatment of GAA or alpha galactosidase A, the enzymes deficient in Pompe and Fabry diseases respectively, with periodate and cyanoborohydride at pH 5.6 resulted in good recovery of enzyme activity. Enzyme was incubated with equal volume mixture containing 20 mM sodium metaperiodate and 40 mM sodium cyanoborohydride in 0.1 M Na acetate, pH 5.6 for 60 min on ice. The unreacted periodate was quenched with glycerol (10% final concentration) for 15 min on ice. The proteins were finally exchanged into phosphate buffered saline, pH 6.2 by diafiltration using Amicon centrifugal filter devices. Other reducing reagents for example, dimethylamine borane, may also be useful to reduce aldehydes generated by sodium metaperiodate oxidation of glycoproteins such as GAA under acidic conditions.",
                                "Thus, in some embodiments, the reduction of sodium metaperiodate treated GAA involves use of sodium cyanoborohydride at acidic pH from pH 3.0 to pH 6. Optimal conditions for the chemical modification can be readily determined by using two assays: loss of binding to ConA sepharose, and diminished uptake into J774E macrophage.",
                                "For example, the ability of periodate/borohydride modified β-glucuronidase to bind to ConA-sepharose was compared to that of untreated β-glucuronidase. The enzymes were incubated with 50 μl ConA beads in 20 mM Tris-HCl, pH 6.8, 0.5 M NaCl for 15 min at room temperature. Beads were centrifuged at maximum speed for 15 sec. Supernatant (flow through) was carefully withdrawn, assayed for GUS activity and analyzed by SDS/PAGE. When we treated GUS exactly as reported in Grubb et al., 60% ConA binding activity was lost and unbound GUS was present only in the flow through of periodate treated and subsequently sodium borohydride reduced sample.",
                                "**Administration of Therapeutic Proteins**",
                                "In accordance of the invention, a therapeutic protein of the invention is typically administered to the individual alone, or in compositions or medicaments comprising the therapeutic protein (e.g., in the manufacture of a medicament for the treatment of the disease), as described herein. The compositions can be formulated with a physiologically acceptable carrier or excipient to prepare a pharmaceutical composition. The carrier and composition can be sterile. The formulation should suit the mode of administration.",
                                "Suitable pharmaceutically acceptable carriers include but are not limited to water, salt solutions (e.g., NaCl), saline, buffered saline, alcohols, glycerol, ethanol, gum arabic, vegetable oils, benzyl alcohols, polyethylene glycols, gelatin, carbohydrates such as lactose, amylose or starch, sugars such as mannitol, sucrose, or others, dextrose, magnesium stearate, talc, silicic acid, viscous paraffin, perfume oil, fatty acid esters, hydroxymethylcellulose, polyvinyl pyrolidone, etc., as well as combinations thereof. The pharmaceutical preparations can, if desired, be mixed with auxiliary agents (e.g., lubricants, preservatives, stabilizers, wetting agents, emulsifiers, salts for influencing osmotic pressure, buffers, coloring, flavoring and/or aromatic substances and the like) which do not deleteriously react with the active compounds or interference with their activity. In a preferred embodiment, a water-soluble carrier suitable for intravenous administration is used.",
                                "The composition or medicament, if desired, can also contain minor amounts of wetting or emulsifying agents, or pH buffering agents. The composition can be a liquid solution, suspension, emulsion, tablet, pill, capsule, sustained release formulation, or powder. The composition can also be formulated as a suppository, with traditional binders and carriers such as triglycerides. Oral formulation can include standard carriers such as pharmaceutical grades of mannitol, lactose, starch, magnesium stearate, polyvinyl pyrollidone, sodium saccharine, cellulose, magnesium carbonate, etc.",
                                "The composition or medicament can be formulated in accordance with the routine procedures as a pharmaceutical composition adapted for administration to human beings. For example, in a preferred embodiment, a composition for intravenous administration typically is a solution in sterile isotonic aqueous buffer. Where necessary, the composition may also include a solubilizing agent and a local anesthetic to ease pain at the site of the injection. Generally, the ingredients are supplied either separately or mixed together in unit dosage form, for example, as a dry lyophilized powder or water free concentrate in a hermetically sealed container such as an ampule or sachette indicating the quantity of active agent. Where the composition is to be administered by infusion, it can be dispensed with an infusion bottle containing sterile pharmaceutical grade water, saline or dextrose/water. Where the composition is administered by injection, an ampule of sterile water for injection or saline can be provided so that the ingredients may be mixed prior to administration.",
                                "The therapeutic protein can be formulated as neutral or salt forms. Pharmaceutically acceptable salts include those formed with free amino groups such as those derived from hydrochloric, phosphoric, acetic, oxalic, tartaric acids, etc., and those formed with free carboxyl groups such as those derived from sodium, potassium, ammonium, calcium, ferric hydroxides, isopropylamine, triethylamine, 2-ethylamino ethanol, histidine, procaine, etc.",
                                "A therapeutic protein (or a composition or medicament containing a therapeutic protein) is administered by any appropriate route. In a preferred embodiment, a therapeutic protein is administered intravenously. In other embodiments, a therapeutic protein is administered by direct administration to a target tissue, such as heart or muscle (e.g., intramuscular), or nervous system (e.g., direct injection into the brain; intraventricularly; intrathecally). Alternatively, a therapeutic protein (or a composition or medicament containing a therapeutic protein) can be administered parenterally, transdermally, or transmucosally (e.g., orally or nasally). More than one route can be used concurrently, if desired.",
                                "A therapeutic protein (or a composition or medicament containing a therapeutic protein) can be administered alone, or in conjunction with other agents, such as antihistamines (e.g., diphenhydramine) or immunosuppressants or other immunotherapeutic agents which counteract anti-GILT-tagged lysosomal enzyme antibodies. The term, “in conjunction with,” indicates that the agent is administered prior to, at about the same time as, or following the therapeutic protein (or a composition or medicament containing the therapeutic protein). For example, the agent can be mixed into a composition containing the therapeutic protein, and thereby administered contemporaneously with the therapeutic protein; alternatively, the agent can be administered contemporaneously, without mixing (e.g., by “piggybacking” delivery of the agent on the intravenous line by which the therapeutic protein is also administered, or vice versa). In another example, the agent can be administered separately (e.g., not admixed), but within a short time frame (e.g., within 24 hours) of administration of the therapeutic protein.",
                                "The therapeutic protein (or composition or medicament containing the therapeutic protein) is administered in a therapeutically effective amount (i.e., a dosage amount that, when administered at regular intervals, is sufficient to treat the disease, such as by ameliorating symptoms associated with the disease, preventing or delaying the onset of the disease, and/or also lessening the severity or frequency of symptoms of the disease, as described above). The dose which will be therapeutically effective for the treatment of the disease will depend on the nature and extent of the disease's effects, and can be determined by standard clinical techniques. In addition, in vitro or in vivo assays may optionally be employed to help identify optimal dosage ranges using methods known in the art. The precise dose to be employed will also depend on the route of administration, and the seriousness of the disease, and should be decided according to the judgment of a practitioner and each patient's circumstances. Effective doses may be extrapolated from dose-response curves derived from in vitro or animal model test systems. The therapeutically effective dosage amount can be, for example, about 0.1-1 mg/kg, about 1-5 g/kg, about 5-20 mg/kg, about 20-50 mg/kg, or 20-100 mg/kg. The effective dose for a particular individual can be varied (e.g., increased or decreased) over time, depending on the needs of the individual. For example, in times of physical illness or stress, or if disease symptoms worsen, the dosage amount can be increased.",
                                "The therapeutically effective amount of the therapeutic protein (or composition or medicament containing the therapeutic protein) is administered at regular intervals, depending on the nature and extent of the disease's effects, and on an ongoing basis. Administration at an “interval,” as used herein, indicates that the therapeutically effective amount is administered periodically (as distinguished from a one-time dose). The interval can be determined by standard clinical techniques. In some embodiments, the therapeutic protein is administered bimonthly, monthly, twice monthly, triweekly, biweekly, weekly, twice weekly, thrice weekly, or daily. The administration interval for a single individual need not be a fixed interval, but can be varied over time, depending on the needs of the individual. For example, in times of physical illness or stress, or if disease symptoms worsen, the interval between doses can be decreased.",
                                "As used herein, the term “bimonthly” means administration once per two months (i.e., once every two months); the term “monthly” means administration once per month; the term “triweekly” means administration once per three weeks (i.e., once every three weeks); the term “biweekly” means administration once per two weeks (i.e., once every two weeks); the term “weekly” means administration once per week; and the term “daily” means administration once per day.",
                                "The invention additionally pertains to a pharmaceutical composition comprising a therapeutic protein, as described herein, in a container (e.g., a vial, bottle, bag for intravenous administration, syringe, etc.) with a label containing instructions for administration of the composition for treatment of Pompe disease, such as by the methods described herein.",
                                "The invention will be further and more specifically described by the following examples. Examples, however, are included for illustration purposes, not for limitation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list mammalian cells for expression",
                                "describe HEK 293 cells",
                                "describe CHO cells",
                                "describe monkey kidney cells",
                                "describe HT1080 cells",
                                "describe C10 cells",
                                "describe HeLa cells",
                                "describe BHK cells",
                                "describe 3T3 cells",
                                "describe C127 cells",
                                "describe CV-1 cells",
                                "describe HaK cells",
                                "describe NS/0 cells",
                                "describe L-929 cells",
                                "describe BALB/c mouse myeloma line",
                                "describe human retinoblasts",
                                "describe monkey kidney CV1 line",
                                "describe human embryonic kidney line",
                                "describe baby hamster kidney cells",
                                "describe Chinese hamster ovary cells",
                                "describe mouse sertoli cells",
                                "describe monkey kidney cells",
                                "describe African green monkey kidney cells",
                                "describe human cervical carcinoma cells",
                                "describe canine kidney cells",
                                "describe buffalo rat liver cells",
                                "describe human lung cells",
                                "describe human liver cells",
                                "describe mouse mammary tumor",
                                "describe TR1 cells",
                                "describe MRC 5 cells",
                                "describe FS4 cells",
                                "describe human hepatoma line",
                                "describe insect cells",
                                "describe plant cells",
                                "describe yeast, prokaryote, or fungus cells"
                            ],
                            "num_characters": 18380,
                            "outline_medium": [
                                "list mammalian cell types",
                                "describe HEK 293 cells",
                                "describe CHO cells",
                                "describe monkey kidney cells",
                                "describe human retinoblasts",
                                "describe COS-7 cells",
                                "describe BHK cells",
                                "describe human embryonic kidney cells",
                                "describe mouse sertoli cells",
                                "describe African green monkey kidney cells",
                                "describe human cervical carcinoma cells",
                                "describe canine kidney cells",
                                "describe buffalo rat liver cells",
                                "describe human lung cells",
                                "describe human liver cells",
                                "describe mouse mammary tumor cells",
                                "describe TR1 cells",
                                "describe non-mammalian host cells"
                            ],
                            "outline_short": [
                                "list mammalian cell types for expression",
                                "describe non-mammalian host cells",
                                "define furin-deficient cells",
                                "describe methods for obtaining furin-deficient cells",
                                "list examples of furin-deficient cells",
                                "describe mutagenesis treatment",
                                "describe selection of resistant cells",
                                "describe production of fusion protein in CHO cells",
                                "describe production of fusion protein in other cells"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce GILT technology for lysosomal targeting"
                    ],
                    "num_characters": 778,
                    "outline_medium": [
                        "introduce GILT technology for lysosomal targeting"
                    ],
                    "outline_short": [
                        "introduce GILT technology for lysosomal targeting"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Furin Cleaves an IGF-II Based GILT Tag**",
                                "ZC-701 has been developed for the treatment of Pompe disease. ZC-701 is a chimeric protein that contains an N-terminal IGF-II based GILT tag fused via a three amino acid spacer to residues 70-952 of human acid-α-glucosidase (hGAA). Specifically, ZC-701 includes amino acids 1 and 8-67 of human IGF-II (i.e., Δ2-7 of mature human IGF-II), the spacer sequence Gly-Ala-Pro, and amino acids 70-952 of human GAA. The full length amino acid sequence is shown below. The spacer sequence is bolded. The sequence N-terminal to the spacer sequence reflects amino acids 1 and 8-67 of human IGF-II and the sequence C-terminal to the spacer sequence reflects amino acids 70-952 of human GAA. The two potential overlapping furin cleavage sites within the IGF-II tag sequence is bolded and underlined. Arrows point to two potential furin cleavage positions.",
                                "During the course of development of ZC-701, it has become apparent that the IGF-II derived GILT tag on a fraction of the ZC-701 molecules is subjected to proteolytic cleavage by furin during production in CHO cells. N-terminal analysis of ZC-701 batch 10-2-F45-54 revealed the presence of two n-terminal sequences. One conformed to the predicted n-terminus of ZC-701 indicating the presence of the predicted ZC-701 protein. The other n-terminal sequence aligned with sequence within the tag portion of ZC-701 indicating the presence of a derivative of ZC-701 consistent with an endoproteolytic cleavage at amino acid residue 34 of ZC-701. Based on the estimated molar ratios of the two n-termini, this batch of ZC-701 was found to have about a 1:1 ratio of intact and cleaved species.",
                                "Upon receipt of this result, each of the other batches of ZC-701 were subjected to n-terminal sequencing. All of the batches displayed the same two n-termini with the cleaved species ranging from 20-50% of the total compound. One batch, previously shown to have low uptake activity, displayed a set of n-termini indicative of additional proteolysis. We concluded that the proteolytic event responsible for the second species in all of our batches of ZC-70I was perpetrated by furin or a furin-like protease.",
                                "FIG. 1 shows a map of the amino terminus of ZC-701. The two amino acid boxed residues are the sites of n-termini mapped in all of the ZC-701 batches. The first of the N-termini is the site of signal peptide cleavage, which yields the predicted n-terminus of ZC-701. The second boxed residue is the site of an undesired proteolytic cleavage event. The amino acid sequence proximal to the cleavage site is Arg-Arg-Ser-Arg (SEQ ID NO: 9). This matches the canonical cleavage site of a protease present in CHO cells called furin, which cleaves after Arg-X-X-Arg (SEQ ID NO: 10). Furin is a member of a family of prohormone convertases that includes PC3, a protease responsible for maturation of proinsulin in pancreatic islet cells. In fact the PC3 cleavage site in proinsulin is conserved and identical to the site at which furin cleaves the IGF-II tag.",
                                "The Furin cleaved ZC-701 differs in molecular weight from intact ZC-701 by about 3000 daltons, which represents less than a 3% difference in molecular weight. Due to the heterogeneity of the oligosaccharide in the protein, the presence of the cleaved ZC-701 was not previously detected by SDS-PAGE. However, if ZC-701 is first deglycosylated by treatment with Peptide N-Glycosidase F (PNGase F), then the cleaved protein can be resolved from the intact ZC-701 by SDS-PAGE.",
                                "As shown in FIG. 2, lane 1 of the SDS-PAGE gel shows the electrophoretic pattern of deglycosylated purified ZC-701. Two bands are evident. The upper band is believed to be intact ZC-701 and the lower band is believed to be furin cleaved ZC-701. To prove that the lower band is indeed Furin cleaved ZC-701, same proteins loaded in lane I were first treated with furin and then loaded in lane 2. As shown in FIG. 2, all of the proteins in lane 2 co-migrates with the lower band in lane 1 indicating that the lower band is in fact furin cleaved ZC-701.",
                                "We have estimated the proportion of ZC-701 that has been cleaved with furin in a number of batches of ZC-701 by quantification of the band intensity in SDS-PAGE and by quantification of amino acids released in N-terminal sequencing experiments. As discussed above, the fraction of cleaved ZC-701 has ranged from 20% to 50% in different batches."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce ZC-701 protein",
                                "describe furin cleavage of IGF-II tag",
                                "analyze N-terminal sequencing results",
                                "identify furin cleavage site",
                                "describe SDS-PAGE analysis",
                                "quantify cleaved ZC-701",
                                "discuss implications of furin cleavage",
                                "conclude on ZC-701 heterogeneity"
                            ],
                            "num_characters": 4404,
                            "outline_medium": [
                                "describe ZC-701 protein",
                                "identify furin cleavage site",
                                "analyze cleaved ZC-701 by SDS-PAGE",
                                "quantify cleaved ZC-701"
                            ],
                            "outline_short": [
                                "describe furin cleavage of IGF-II based GILT tag",
                                "analyze cleaved ZC-701 protein"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**Targeted Fusion Proteins Containing a Furin-Resistant IGF-II Based GILT Tag**",
                                "We can design around the problem of furin cleavage by altering the amino acid sequence IGF-II such that the amino acid alteration abolishes at least one furin cleavage site. A series of mutant versions of ZC-701 were generated and assayed for resistance to cleavage by furin. Exemplary mutant versions of ZC-701 were generated as described below.",
                                "**ZC-701**",
                                "The GILTΔ2-7-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7-GAA70-952 (Plasmid p701). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70.",
                                "**Construct 1459**",
                                "The GILTΔ2-7/K37-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7/K37-GAA70-952 (Plasmid p1459). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7/K37 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7/K37 cassette contains an Arg to Lys substitution at amino acid 37 of the human IGF-II sequence (uppercase bold).",
                                "**Construct 1460**",
                                "The GILTΔ2-7/K40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7/K40-GAA70-952 (Plasmid p1460). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7/K40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7/K40 cassette contains an Arg to Lys substitution at amino acid 40 of the human IGF-II sequence (uppercase bold).",
                                "**Construct 1461**",
                                "The GILTΔ2-7/A37-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7/A37-GAA70-952 (Plasmid p1461). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7/A37 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7/A37 cassette contains an Arg to Ala substitution at amino acid 37 of the human IGF-II sequence (uppercase bold).",
                                "**Construct 1463**",
                                "The GILTΔ2-7/A40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7/A40-GAA70-952 (Plasmid p1463). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7/A40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7/A40 cassette contains an Arg to Ala substitution at amino acid 40 of the human IGF2 sequence (uppercase bold).",
                                "**Construct 1479**",
                                "The GILTΔ2-7M1/K37-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7M1/K37-GAA70-952 (Plasmid p1479). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7M1/K37 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7M1/K37 cassette contains an Arg to Lys substitution at amino acid 37 of the human IGF-II sequence (uppercase bold).",
                                "**Construct 1487**",
                                "The GILTΔ2-7M1/A37-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7M1/A37-GAA70-952 (Plasmid p1487). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7M1/A37 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7M1/A37 cassette contains an Arg to Ala substitution at amino acid 37 of the human IGF-II sequence (uppercase bold).",
                                "As shown in FIG. 3, three exemplary mutants (i.e., constructs 1459, 1460 and 1461) in which alanine or lysine has been substituted for one of the canonical arginine residues were expressed without detectable cleavage by furin. As also shown in FIG. 3 (right panel), construct 1461 containing a R37A substitution is additionally resistant to addition of exogenous furin.",
                                "**Construct 1726**",
                                "The GILTΔ2-7Δ30-39-GAA70-952 cassette below was cloned using the Asp718 and Nod sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ30-39-GAA70-952 (Plasmid 1726). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ30-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ30-39 cassette contains a deletion of amino acid residues 30-39 (Arg-Pro-Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1749**",
                                "The GILTΔ2-7Δ31-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ31-39-GAA70-952 (Plasmid 1749). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ31-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ31-39 cassette contains a deletion of amino acid residues 31-39 (Pro-Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1746**",
                                "The GILTΔ2-7Δ32-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ32-39-GAA70-952 (Plasmid 1746). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ32-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ32-39 cassette contains a deletion of amino acid residues 32-39 (Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1747**",
                                "The GILTΔ2-7Δ33-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ33-39-GAA70-952 (Plasmid 1747). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ33-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ33-39 cassette contains a deletion of amino acid residues 33-39 (Ser-Arg-Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1758**",
                                "The GILTΔ2-7Δ34-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ34-39-GAA70-952 (Plasmid 1758). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ34-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ34-39 cassette contains a deletion of amino acid residues 34-39 (Arg-Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1750**",
                                "The GILTΔ2-7Δ35-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ35-39-GAA70-952 (Plasmid 1750). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ35-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ35-39 cassette contains a deletion of amino acid residues 35-39 (Val-Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1748**",
                                "The GILTΔ2-7Δ36-39-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ36-39-GAA70-952 (Plasmid 1748). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ36-39 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ36-39 cassette contains a deletion of amino acid residues 36-39 (Ser-Arg-Arg-Ser) from the human IGF-II sequence.",
                                "**Construct 1751**",
                                "The GILTΔ2-7Δ29-40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ29-40-GAA70-952 (Plasmid 1751). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ29-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ29-40 cassette contains a deletion of amino acid residues 29-40 (Ser-Arg-Pro-Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1752**",
                                "The GILTΔ2-7Δ30-40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ30-40-GAA70-952 (Plasmid 1752). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ30-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ30-40 cassette contains a deletion of amino acid residues 30-40 (Arg-Pro-Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1753**",
                                "The GILTΔ2-7Δ31-40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ31-40-GAA70-952 (Plasmid 1753). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ31-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ31-40 cassette contains a deletion of amino acid residues 31-40 (Pro-Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1754**",
                                "The GILTΔ2-7Δ32-40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ32-40-GAA70-952 (Plasmid 1754). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ32-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-76, 32-40 cassette contains a deletion of amino acid residues 32-40 (Ala-Ser-Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1755**",
                                "The GILTΔ2-7Δ33-40-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ33-40-GAA70-952 (Plasmid 1755). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ33-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ33-40 cassette contains a deletion of amino acid residues 33-40 (Ser-Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1756**",
                                "The GILTΔ2-7Δ34-40-GAA70-952 cassette below was cloned using the Asp718 and NotI s of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7Δ34-40-GAA70-952 (Plasmid 1756). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7Δ34-40 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7Δ34-40 cassette contains a deletion of amino acid residues 34-40 (Arg-Val-Ser-Arg-Arg-Ser-Arg) from the human IGF-II sequence.",
                                "**Construct 1763**",
                                "The GILTΔ2-7M1/L27A37-GAA70-952 cassette below was cloned using the Asp718 and NotI sites of the cassette and vector pCEP4 to produce pCEP-GILTΔ2-7M1/L27A37-GAA70-952 (Plasmid 1763). Restriction sites for cloning are in lowercase bold. The spacer amino acid sequence Gly, Ala, Pro (underlined sequence) separate the GAA gene and GILTΔ2-7M1/L27A37 tag (upper case sequence). The spacer and tag are placed upstream of GAA residue Ala70. The GILTΔ2-7M1/L27A37 cassette contains Y27L and R37A substitutions in the human IGFII sequence. The DNA sequence of the GILT cassette differs from the human DNA sequence at every 6th codon."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce targeted fusion proteins",
                                "describe mutant versions of ZC-701",
                                "detail construct 1459",
                                "detail construct 1460",
                                "detail construct 1461",
                                "detail construct 1463",
                                "detail construct 1479",
                                "detail construct 1487",
                                "express and analyze mutants",
                                "describe resistance to furin cleavage",
                                "detail construct 1726",
                                "detail construct 1749",
                                "detail construct 1746",
                                "detail construct 1747",
                                "describe deletion mutants",
                                "detail construct 1758",
                                "detail construct 1750",
                                "detail construct 1748",
                                "detail construct 1751",
                                "detail construct 1752",
                                "detail construct 1753",
                                "detail construct 1754",
                                "detail construct 1755",
                                "detail construct 1756",
                                "detail construct 1763"
                            ],
                            "num_characters": 12963,
                            "outline_medium": [
                                "design furin-resistant IGF-II based GILT tags",
                                "generate mutant versions of ZC-701",
                                "clone GILTΔ2-7/K37-GAA70-952 cassette",
                                "clone GILTΔ2-7/K40-GAA70-952 cassette",
                                "clone GILTΔ2-7/A37-GAA70-952 cassette",
                                "clone GILTΔ2-7/A40-GAA70-952 cassette",
                                "clone GILTΔ2-7M1/K37-GAA70-952 cassette",
                                "clone GILTΔ2-7M1/A37-GAA70-952 cassette",
                                "express and analyze mutant proteins",
                                "clone GILTΔ2-7Δ30-39-GAA70-952 cassette",
                                "clone additional deletion mutants",
                                "analyze furin resistance of mutant proteins"
                            ],
                            "outline_short": [
                                "design furin-resistant IGF-II based GILT tags",
                                "construct plasmids with modified GILT tags",
                                "express and analyze mutant proteins",
                                "test resistance to furin cleavage",
                                "describe deletion mutants of GILT tags",
                                "analyze expression and furin resistance of deletion mutants"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Tissue Culture**",
                                "GILT-tagged GAA plasmids were each transfected into suspension FreeStyle 293-F cells as described by the manufacturer (Invitrogen). Briefly, cells were grown in Opti-MEM I media (Invitrogen) in polycarbonate shaker flasks on an orbital shaker at 37° C. and 8% CO2. Cells were adjusted to a concentration of 1×106 cells/ml, then transfected with a 1:1:1 ratio of ml cells:μg DNA:μl 293fectin. Culture aliquots were harvested 5-7 days post-transfection and centrifuged at 5,000×g for 5 minutes. Supernatants were stored frozen at −80° C.",
                                "**Protein Purification and Concentration**",
                                "Starting material was mammalian cell culture supernatant, as described above, thawed from storage at −80° C. Citric acid was added to reach pH 6.0, then ammonium sulfate was added to reach a final concentration of 1M. The material was passed through a 0.2 μm Supor-Mach filter (Nalgene).",
                                "The filtered material was loaded onto a Phenyl-Sepharose 6 Low-Sub Fast-Flow (GE Healthcare) column prepared with HIC Load Buffer (50 mM citrate pH 6.0, 1M AmSO4). The column was washed with 10 column volumes of HIC Wash Buffer (50 mM citrate pH 6.0, 0.8M AmSO4), and eluted with 5 column volumes of HIC Elution Buffer (50 mM citrate pH 6.0). Samples from the elution peaks were pooled and bugger was exchanged into phosphate buffered saline (145.15 mM NaCl, 2.33 mM KCl, 10 mM Na2HPO4, 2 mM KH2PO4, pH 6.2) using centricon spin concentrators (Amicon) and Bio-Spin-6 de-salting columns (Bio-Rad).",
                                "**Enzyme Activity**",
                                "GAA expression was determined by a para-nitrophenol (PNP) enzymatic assay. GAA enzyme was incubated in 50 μl reaction mixture containing 100 mM sodium acetate pH 4.2 and 10 mM Para-Nitrophenol (PNP) a-glucoside substrate (Sigma N1377). Reactions were incubated at 37° C. for 20 minutes and stopped with 300 μl of 100 mM sodium carbonate. Absorbance at 405 nm was measured in 96-well microtiter plates and compared to standard curves derived from p-nitrophenol (Sigma N7660). 1 GAA PNP unit is defined as 1 nmole PNP hydrolyzed/hour."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe tissue culture",
                                "detail protein purification and concentration",
                                "describe enzyme activity assay",
                                "conclude on GAA expression"
                            ],
                            "num_characters": 2041,
                            "outline_medium": [
                                "describe tissue culture and transfection",
                                "describe protein purification, concentration, and enzyme activity"
                            ],
                            "outline_short": [
                                "describe protein purification, concentration, and enzyme activity assay"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Competitive Receptor Binding Assays**",
                                "The affinity of GILT-tagged proteins for the IGF2 receptor (IGF2R), IGF1 receptor (IGF1R) and the insulin receptor (IR) was examined in competitive binding experiments performed in a 96-well plate format. Receptors were coated at room temperature overnight onto Reacti-bind white plates (Pierce, Cat#437111) in Coating Buffer (0.05M Carbonate buffer, pH 9.6) at a concentration of either 0.5 μg/well (IGF2R) or 1 μg/well (IGF1R, IR). Plates were washed with wash buffer (Phosphate Buffered Saline plus 0.05% Tween-20), then blocked in Super Blocking Buffer (Pierce, Cat#37516) for 1 hour. After another plate washing, biotinylated ligands (Cell Sciences) were added to wells; IGF2R wells received 8 nM IGF2-biotin, IGF1R wells received 30 nM IGF1-biotin, and IR wells received 20 nM insulin-biotin. Along with the biotinylated ligands, wells also contained serial dilutions of the GILT-tagged GAA protein samples or non-biotinylated control ligands to act as binding inhibitors for the biotinylated ligands. Following a two-hour rocking incubation, plates were washed and bound biotinylated ligands were detected with a streptavidin-HRP incubation (R&D, Cat#890803, 1:200 dilution in blocking buffer, 30 minutes), followed by a Super Elisa Pico Chemiluminescent Substrate incubation (Pierce, Cat#7070, 5 minutes). The chemiluminescent signal was measured at 425 nm.",
                                "The percent bound biotinylated ligand was calculated for each competitor concentration in the IGF2R binding competition assay and the IC50 values were determined (F1G. 4). Protein 1752 with a deletion of IGF2 residues 30-40 displayed a similar IC50 value as the GILT-tagged ZC-701 (F1G. 4), indicating that deletion of these residues in the IGF2 loop region does not appear to effect IGF2R binding. Protein 1751 with a deletion of IGF2 residues 29-40 displayed a higher IC50 value (FIG. 4), indicating that it does not compete as well for binding to the IGF2R.",
                                "On a separate IGF2R assay plate, comparison of ZC-701 and protein 1763 yielded IC50 values that differed by 35% (See FIG. 5).",
                                "In an assay measuring the competition of biotinylated insulin binding to plate-bound insulin, 1751 and 1752 proteins were not as effective as inhibitors compared to 701 or IGF-II (See FIG. 6). This indicates that the 1751 and 1752 proteins, with deletions in the loop region corresponding to amino acids 30-40 of the GILT tag, had a reduced affinity for the insulin receptor compared to the intact GILT tag on 701 or IGF-II.",
                                "In an assay measuring the competition of biotinylated IGF-I binding to plate-bound IGF IR, 1763 protein was not as effective as an inhibitor compared to 701, IGF-II or IGF-I (See FIG. 7). This indicates that the 1763 protein, with Δ2-7. Y27L and R37A mutations in the GILT tag, had a reduced affinity for the IGF1 receptor compared to ZC-701 or IGF-II.",
                                "**Additional Insulin Receptor Binding Assay**",
                                "Protein ZC-1487 was tested for its binding affinity for the insulin receptor. Protein ZC-1487 contains the GILTD2-7M1/A37 cassette contains with and Arg to Ala substitution at amino acid 37 of the human IGF2 sequence and is resistant to proteolysis by furin. Two different batches of this protein purified from CHO cells, ZC-1487-B26 and ZC-1487-B28 were analyzed in an assay measuring the competition of biotinylated insulin binding to plate-bound insulin.",
                                "An insulin receptor binding assay was conducted by competing insulin, IGF-II, ZC710B20 and ZC1487B26 or ZC-1487-B28 with Biotinylated-insulin binding to the insulin receptor (Insulin-R).",
                                "Specifically, white Reucti-Bind™ plates were coated with Insulin-R at a concentration of 1 ug/well/100 ul (38.4 nM). The coated plates were incubate over night at room temperature, then washed 3× with washing buffer (300 ul/well). The plates were then blocked with blocking buffer (300 ul/well) for 1 hour. The washing steps were repeated and any trace of solution in the plates was taken out.",
                                "Biotinylated-insulin was mixed at 20 nM with different concentrations of insulin, IGF-II, ZC701B20, B26 and B28 by serial dilutions (final concentrations are shown in Table 2). 100 ul of diluted Insulin, IGF-II, ZC710B20, ZC1487B26, and ZC1487B28 in 20 nM Insulin-biotin were added into the coated plates and the plates were incubated at room temperature for 2 hours. The plates were then washed 3 times with washing buffer. 100 ul of strepavidin-HRP working solution (50 ul strepavidin-HRP in 10 ml blocking buffer) was added into the plates and the plates were incubated at room temperature for 30 minutes. 100 ul of Elisa-Pico working solution containing Elisa-Pico chemiluminescent substrate was added and the chemiluminescence was measured at 425 nm. Exemplary results are shown in Table 2, FIG. 8, and FIG. 9. Both batches of ZC-1487 were not as effective as inhibitors compared to ZC-701 or the insulin control. As can be seen from Table 2 and FIG. 8, furin resistant peptide ZC-1487B26 binds to the insulin receptor more than 10-fold less avidly than does ZC-701 and more than 20-fold less than does the wild-type IGF-II",
                                "This indicates that the 1487 protein had a reduced affinity for the insulin receptor compared to the GILT tag on ZC-701."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce competitive receptor binding assays",
                                "describe IGF2R binding competition assay",
                                "calculate percent bound biotinylated ligand",
                                "determine IC50 values",
                                "compare IC50 values of different proteins",
                                "describe insulin receptor binding assay",
                                "measure competition of biotinylated insulin binding",
                                "compare binding affinity of different proteins",
                                "describe additional insulin receptor binding assay",
                                "analyze binding affinity of ZC-1487 protein"
                            ],
                            "num_characters": 5216,
                            "outline_medium": [
                                "perform competitive receptor binding assays",
                                "calculate IC50 values for IGF2R binding competition",
                                "compare binding affinities for IGF2R, IGF1R, and IR",
                                "conduct additional insulin receptor binding assay",
                                "analyze results of binding assays"
                            ],
                            "outline_short": [
                                "perform competitive receptor binding assays",
                                "analyze binding affinity of GILT-tagged proteins"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Uptake Assays**",
                                "Some mutants were tested for retention of uptake activity. HEK293 cells ere transfected with constructs 1479 (R37K), 1487 (R37A) or ZC-701. After harvest, culture supernatants were partially purified by HIC chromatography. All samples were treated with PNGase prior to electrophoresis.",
                                "FIG. 10 shows partially purified preparations of targeted fusion proteins containing a furin-resistant IGF-II mutein tag analyzed by SDS-PAGE and immunoblotting. As can be seen, the fusion protein encoded by construct 1487 containing R37A mutation is resistant to exogenous furin.",
                                "FIG. 11 illustrates exemplary uptake results of furin resistant GILT-tagged GAA into rat L6 myoblasts. As shown in FIG. 11, exemplary Kuptakes for proteins 1479, 1487, ZC-701, and purified ZC-701 are 4.5 nM, 4.4 nM, 5.0 nM and 2.6 nM, respectively, which indicates that the proteins encoded by constructs 1487 (R37A) and 1479 (R37K) retain the ability for efficient uptake into rat L6 myoblasts. The efficient uptake of fusion proteins containing a furin-resistant GILT tag also indicates that the furin-resistant tag retains high affinity for the CI-MPR."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe uptake assays",
                                "analyze uptake results of furin resistant GILT-tagged GAA"
                            ],
                            "num_characters": 1143,
                            "outline_medium": [
                                "perform uptake assays and analyze results"
                            ],
                            "outline_short": [
                                "test uptake activity of mutants"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EQUIVALENTS",
                    "paragraphs": [
                        "Those skilled in the art will recognize, or be able to ascertain using no more than routine experimentation, many equivalents to the specific embodiments of the invention described herein. The scope of the present invention is not intended to be limited to the above Description, but rather is as set forth in the appended claims. The articles “a”, “an”, and “the” as used herein in the specification and in the claims, unless clearly indicated to the contrary, should be understood to include the plural referents. Claims or descriptions that include “or” between one or more members of a group are considered satisfied if one, more than one, or all of the group members are present in, employed in, or otherwise relevant to a given product or process unless indicated to the contrary or otherwise evident from the context. The invention includes embodiments in which exactly one member of the group is present in, employed in, or otherwise relevant to a given product or process. The invention also includes embodiments in which more than one, or all of the group members are present in, employed in, or otherwise relevant to a given product or process. Furthermore, it is to be understood that the invention encompasses variations, combinations, and permutations in which one or more limitations, elements, clauses, descriptive terms, etc., from one or more of the claims is introduced into another claim dependent on the same base claim (or, as relevant, any other claim) unless otherwise indicated or unless it would be evident to one of ordinary skill in the art that a contradiction or inconsistency would arise. Where elements are presented as lists, e.g., in Markush group or similar format, it is to be understood that each subgroup of the elements is also disclosed, and any element(s) can be removed from the group. It should it be understood that, in general, where the invention, or aspects of the invention, is/are referred to as comprising particular elements, features, etc., certain embodiments of the invention or aspects of the invention consist, or consist essentially of, such elements, features, etc. For purposes of simplicity those embodiments have not in every case been specifically set forth herein. It should also be understood that any embodiment of the invention, e.g., any embodiment found within the prior art, can be explicitly excluded from the claims, regardless of whether the specific exclusion is recited in the specification.",
                        "It should also be understood that, unless clearly indicated to the contrary, in any methods claimed herein that include more than one act, the order of the acts of the method is not necessarily limited to the order in which the acts of the method are recited, but the invention includes embodiments in which the order is so limited. Furthermore, where the claims recite a composition, the invention encompasses methods of using the composition and methods of making the composition. Where the claims recite a composition, it should be understood that the invention encompasses methods of using the composition and methods of making the composition."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define equivalents",
                        "interpret articles",
                        "interpret \"or\" in claims",
                        "include embodiments",
                        "encompass variations",
                        "understand method order"
                    ],
                    "num_characters": 3115,
                    "outline_medium": [
                        "define scope of invention",
                        "interpret language in specification",
                        "clarify claim limitations"
                    ],
                    "outline_short": [
                        "define scope of invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1-31. (canceled)",
        "32. A method of treating Sanfilippo B disease (MPS IIIB) comprising a step of\nadministering intrathecally to a subject in need of treatment a fusion protein comprising α-N-acetylglucosaminidase (Naglu) and a lysosomal targeting moiety,\nwherein the lysosomal targeting moiety is an IGF-II mutein comprising an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), with a mutation within a region corresponding to amino acids 30-40 of SEQ ID NO:1, and\nwherein the IGF-II mutein is (a) resistant to furin cleavage, (b) has diminished binding affinity for the insulin receptor relative to the affinity of naturally-occurring human IGF-II for the insulin receptor, and (c) binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner.",
        "33. The method of claim 32, wherein the Naglu comprises an amino acid sequence at least 80% identical to wild-type Naglu.",
        "34. The method of claim 32, wherein the IGF-II mutein comprises an amino acid sequence including residues 8-67 of mature human IGF-II (SEQ ID NO:1).",
        "35. The method of claim 32, wherein the fusion protein further comprises a linker between the Naglu and the lysosomal targeting moiety.",
        "36. The method of claim 35, wherein the linker comprises the amino acid sequence GAP (SEQ ID NO:4).",
        "37. The method of claim 32, wherein the lysosomal targeting moiety is fused directly or via the linker to the C-terminus of the Naglu.",
        "38. The method of claim 32, wherein the lysosomal targeting moiety is fused directly or via a linker to the N-terminus of the Naglu.",
        "39. The method of claim 32, wherein the Naglu is produced from human cells.",
        "40. The method of claim 32, wherein the intrathecal administration results in reduced intensity, severity, or frequency, or delayed onset of at least one symptom or feature of MPS IIIB.",
        "41. The method of claim 32, wherein the intrathecal administration takes place at an interval selected from once every two weeks, once every month, and once every two months.",
        "42. The method of claim 32, wherein the intrathecal administration is used in conjunction with intravenous administration.",
        "43. The method of claim 32, wherein the intrathecal administration is not used in conjunction with intravenous administration.",
        "44. A therapeutic fusion protein comprising\nan α-N-acetylglucosaminidase (Naglu);\na lysosomal targeting moiety; and\nwherein, once administered, the therapeutic fusion protein is targeted to lysosomes and is therapeutically active in vivo,\nwherein the lysosomal targeting moiety is an IGF-II mutein comprising an amino acid sequence at least 70% identical to mature human IGF-II (SEQ ID NO:1), with a mutation within a region corresponding to amino acids 30-40 of SEQ ID NO:1, and\nwherein the IGF-II mutein is (a) resistant to furin cleavage, (b) has diminished binding affinity for the insulin receptor relative to the affinity of naturally-occurring human IGF-II for the insulin receptor, and (c) binds to the human cation-independent mannose-6-phosphate receptor in a mannose-6-phosphate-independent manner.",
        "45. The therapeutic fusion protein of claim 44, wherein the Naglu comprises an amino acid sequence at least 80% identical to wild-type Naglu.",
        "46. The therapeutic fusion protein of claim 44, wherein the fusion protein further comprises a linker between the Naglu and the lysosomal targeting moiety.",
        "47. The therapeutic fusion protein of claim 46, wherein the linker comprises the amino acid sequence GAP (SEQ ID NO:4).",
        "48. The therapeutic fusion protein of claim 44, wherein the lysosomal targeting moiety is fused directly or via a linker to the C-terminus of the Naglu."
    ]
}