{
    "id": "US20180016735",
    "authors": [
        "Luke Haverhals",
        "Brent Tisserat"
    ],
    "title": "COLD AQUEOUS ALKALINE TREATMENTS FOR COTTON YARN AND RELATED SYSTEMS AND METHODS",
    "date": "2017-08-21 00:00:00",
    "abstract": "Methods and systems for treating cotton yarn are provided. Cotton yarn is partially dissolved by applying a cold aqueous alkaline solvent, rinsing the partially dissolved cotton yarn in water and drying the cotton yarn. Temperature of the solvent and time of exposure to the solvent greatly affect the improved mechanical properties of the cotton yarn.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "The present invention relates generally to systems for and methods of treating cotton yarn with a cold aqueous alkaline solution. More specifically, the cold aqueous alkaline solution treatment improves the mechanical properties of the cotton yarn."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to systems for and methods of treating cotton yarn"
                    ],
                    "num_characters": 248,
                    "outline_medium": [
                        "relate to systems for treating cotton yarn"
                    ],
                    "outline_short": [
                        "relate to systems for treating cotton yarn"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The textile industry is important in the U.S. and global economy. For example, the U.S. textile industry generated about $54 billion in export shipments in 2012. Cotton is the most important natural fiber in the textile industry with over 25 million tons of cotton produced from 35 million hectares from 50 countries in 2007. The textile industry is ever seeking to improve its quality control of the product.",
                        "To remain competitive in a global market, textile manufactures are always looking for new and unique ways to improve efficiency and lower costs. Historically, this has been achieved by the use of high-speed automated spinning machinery. In 1980, each spindle could transfer around 200 pounds of cotton per day. By 1995, that had increased to 600 pounds of cotton per day. Cotton thread strength increased from 26 grams/tex in 1990 to 29 grams/tex in 1995, which is about a 12% increase (Clapp et al., 2016).",
                        "Premium cotton fiber quality is necessary for high-tech spinning operations. For spinning speeds to increase, an increase in fiber strength is paramount. Methods to improve cotton fiber that spins into consistent, high-strength yarn at high speeds are sought by the industry. The limiting factor in improving cotton spinning quality control and production is cotton strength.",
                        "The use of alkaline solutions in a process called mercerization to improve cotton thread has been long recognized. Mercerization is treatment of cellulosic materials (e.g. cotton threads) with a caustic soda (NaOH) solution to improve their dying properties and thread strength and give them a lustrous appearance. Under the well-known mercerization process, cotton thread is held under specified tension for 10 minutes with an application of between 21%-23% NaOH at room temperature. During this process the chemical structure of the cotton fiber is altered whereby the fiber inter-converts from alpha- and beta-cellulose mixture to thermodynamically favorable cellulose II polymorph. The mercerization process causes the fiber cell walls to swell resulting in an increase in surface area and reflection and provides a softer feel. Optionally, an additional step of holding the thread over an open flame known as “singeing” or “gassing the thread” is often conducted.",
                        "Cotton fiber is composed of greater than 94% cellulose, 1-1.5% protein, and 1-1.5% pectin acid, mineral substances, acids, sugars, pigments and waxes (Textile Technologist, 2012). Cellulose is a particularly recalcitrant polysaccharide that is composed of hundreds to thousands of chains of β(1→4) linked D-glucose units held together by hydrogen bonding (Cai and Zhang, 2005; Heinze and Koschella, 2005; Li et. al., 2010; Liu et al., 2010; Medronho and Lindman, 2014; 2015; Nechita et al., 2010; Perez-Pimienta et al., 2013; Pinkert et al., 2009; Sarul et al., 2010; Satyanarayana et al., 2009; Sen et al., 2013; Tisserat et al., 2015; Zhao et al., 2008; Zhou et al., 2004). Much research interest has been devoted to break down cellulose into carbohydrate components to serve as intermediates for biobased fuels and products. Recently, cold alkaline aqueous solvent treatments (CAT) have been employed to break down the hydrogen bonds (Cai and Zhang, 2005; Cai et al., 2003; 2008; Chen et al., 2006; 2007; Fu et al., 2014; Gan et al., 2015; Keshk, 2015; Kihlman et al., 2012; 2013; Li et. al., 2010; Li et al., 2014; Liu et al., 2010; Liu et al., 2009; Lue et al., 2011; Mao et al, 2008; Qi et al., 2009; Qin et al., 2013; Ruan et al., 2004; Zhang et al., 2002; 2009; Zhao et al., 2008; Zhou et al., 2004). Cold sodium hydroxide (7% NaOH) and sodium hydroxide/urea solutions (˜7% NaOH/12% urea solution) at −12° C. are capable of breaking linkages between cellulose which could be subsequently regenerated to synthesize cellulose derivatives (Li et al., 2010; Zhou et al., 2002. It has been noted that cold alkaline treatments (e.g., 5% NaOH solution at −5° C.) of lignocellulosic fibers causes homogenous swelling but did not result in dissolvement (Li et al., 2010). Cai and Zhang (2005) employed various aqueous alkaline/urea solvents coupled with low temperature regimes to dissolve cellulose and found that LiOH H2O/urea was superior to NaOH/urea or KOH/urea. Associated with these studies was the observation that dissolved cellulose materials could regenerate into novel all-cellulose composites once the alkaline solution was removed (Cai and Zhang, 2005; Cai et al., 2004; Zhang et al., 2009; Li et al., 2014). Cotton linter could produce fibers via wet spinning following treatment with aqueous alkaline solutions with low temperatures (7% NaOH/12% urea at −10° C.) (Cai et al., 2004; Qi et al., 2009). In addition, regenerated fibers could be prepared via wet spinning from cellulose cotton linter using a 8% NaOH/6.5% Thiourea/8% urea solution at −8° C. (Zhang et al., 2009) or using a 9.5% NaOH/4.5% thiourea solution at −10° C. (Ruan et al., 2004). These cotton linter studies suggested that cellulose could be completely dissolved and reassembled to produce unique cotton threads.",
                        "What is needed is a method to produce unique cotton yarn that does not completely dissolve the cotton fibers and reassemble them into a cotton yarn, but rather starts with a cotton yarn and merely partially dissolves the cotton yarn to improve the mechanical properties."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce textile industry importance",
                        "describe cotton production and textile industry growth",
                        "discuss need for premium cotton fiber quality",
                        "introduce mercerization process",
                        "describe cotton fiber composition",
                        "discuss cellulose structure and properties",
                        "introduce cold alkaline aqueous solvent treatments",
                        "describe previous studies on cellulose dissolution and regeneration",
                        "discuss limitations of previous studies",
                        "highlight need for new method to improve cotton yarn mechanical properties"
                    ],
                    "num_characters": 5336,
                    "outline_medium": [
                        "introduce textile industry",
                        "discuss importance of cotton fiber quality",
                        "describe mercerization process",
                        "discuss composition of cotton fiber",
                        "summarize research on cold alkaline aqueous solvent treatments"
                    ],
                    "outline_short": [
                        "introduce textile industry",
                        "motivate need for improving cotton fiber strength"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The present inventive concept relates to systems and methods for the treatment of cotton yarn with a cold aqueous alkaline solution to improve the mechanical properties of the cotton yarn. In contrast to previous studies utilizing cold aqueous alkaline treatments, the present inventive concept is a plug-in technology step that can be added to existing commercial cotton yarn production procedures. Previous studies seek to assemble novel reconstituted threads from fully dissolved cotton fibers and linter. The present inventive concept relates to an intermediate step of only partial dissolution of the cotton yarn to improve its strength.",
                        "The present inventive concept has several unique characteristics. First, the thread composition remains the same, but the mechanical properties are improved. Second, the inventive process improves the mechanical properties of all cotton yarn and thread types. Third, in the manufacture of composite threads using commercial thread and cellulose gels the resulting composites are entirely biological in origin since they are not manufactured with plastic ingredients (i.e. nylon or polyester), therefore, they are composites that are completely biodegradable and compostable.",
                        "One object of the present inventive concept is to provide a method of treating cotton yarn. The method includes: providing a predetermined quantity of cotton yarn, partially dissolving the cotton yarn by applying a cold aqueous alkaline solvent, rinsing the partially dissolved cotton yarn with water and drying the cotton yarn. In some embodiments, the cotton yarn is pulled through a cold aqueous alkaline solvent that includes a predetermined quantity of dissolved cotton cellulose fiber in a gel state. In some embodiments, the cotton yarn is pulled through a first bath of cold aqueous alkaline solvent, a second bath of cold aqueous alkaline solvent gel with a predetermined quantity of dissolved cotton cellulose fiber, rinsed in a water bath and then dried.",
                        "Another object of the present inventive concept is to provide a system for treating cotton yarn. The system includes: a predetermined quantity of cotton yarn, a yarn-pulling apparatus, a bath of cold aqueous alkaline solvent through which the cotton yarn is pulled, and a water bath to rinse the cotton yarn. In some embodiments, the cotton yarn is pulled through a cold aqueous alkaline solvent that includes a predetermined quantity of dissolved cotton cellulose fiber in a gel state. In some embodiments, the cotton yarn is pulled through a first bath of cold aqueous alkaline solvent, a second bath of cold aqueous alkaline solvent gel with a predetermined quantity of dissolved cotton cellulose fiber, rinsed in a water bath and then dried.",
                        "The foregoing and other objects are intended to be illustrative of the invention and are not meant in a limiting sense. Many possible embodiments of the invention may be made and will be readily evident upon a study of the following specification and accompanying drawings comprising a part thereof. For example, dimensional values included herein are provided for exemplary purposes, and embodiments of the present invention contemplate systems and methods for treating cotton yarn having various dimensional values. Furthermore, various features and subcombinations of invention may be employed without reference to other features and subcombinations. Other objects and advantages of this invention will become apparent from the following description taken in connection with the accompanying drawings, wherein is set forth by way of illustration and example, an embodiment of this invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce present inventive concept",
                        "describe plug-in technology step for existing commercial cotton yarn production",
                        "highlight unique characteristics of present inventive concept",
                        "describe method of treating cotton yarn",
                        "introduce system for treating cotton yarn",
                        "describe embodiments of present inventive concept",
                        "highlight objects and advantages of present invention"
                    ],
                    "num_characters": 3628,
                    "outline_medium": [
                        "introduce present inventive concept",
                        "describe unique characteristics of inventive concept",
                        "summarize objects of inventive concept"
                    ],
                    "outline_short": [
                        "summarize inventive concept"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The following detailed description of the invention references the accompanying drawings that illustrate specific embodiments in which the invention can be practiced. The embodiments are intended to describe aspects of the invention in sufficient detail to enable those skilled in the art to practice the invention. Other embodiments can be utilized and changes can be made without departing from the scope of the present invention. The following detailed description is, therefore, not to be taken in a limiting sense.",
                        "In this description, references to “one embodiment,” “an embodiment,” or “embodiments” mean that the feature or features being referred to are included in at least one embodiment of the technology. Separate references to “one embodiment,” “an embodiment,” or “embodiments” in this description do not necessarily refer to the same embodiment and are also not mutually exclusive unless so stated and/or except as will be readily apparent to those skilled in the art from the description. For example, a feature, structure, act, etc. described in one embodiment may also be included in other embodiments, but is not necessarily included. Thus, the present technology can include a variety of combinations and/or integrations of the embodiments described herein.",
                        "The present inventive concept is directed to systems and methods of treating cotton yarn. Referring to FIGS. 1 through 3, the method includes the following steps: First, a predetermined quantity of cotton yarn 101 is provided. This cotton yarn is wound on a spool in some embodiments. In other embodiments, the cotton yarn is run through the treatment process immediately upon manufacture and before being wound on a spool.",
                        "Second, the cotton yarn is partially dissolved by applying a treatment of cold aqueous alkaline solvent. In some embodiments, the treatment is applied by pulling the cotton yarn through one or more bath of cold aqueous alkaline solvent 104. In some embodiments, the cold aqueous alkaline solvent 104 is a solution comprised of LiOH H2O, Urea, and water. In some other embodiments, the cold aqueous alkaline solvent 104 is a solution comprised of LiOH H2O, NaOH, Urea, and water. In the embodiments where the cold aqueous alkaline solvent 104 is a solution comprised of LiOH H2O, Urea, and water, preferably, the LiOH H2O is in the range of 5% to 15% of the total solution, and more preferably 8.1%. Preferably, the urea is in the range of 10% to 20% and more preferably 15%.",
                        "In the embodiments where the cold aqueous alkaline solvent 104 is a solution comprised of LiOH H2O, NaOH, Urea, and water, preferably, the LiOH H2O is in the range of 3% to 6% of the total solution, and more preferably 4.8%. Preferably, the NaOH is in the range of 3% to 6% and more preferably 4.4%. Preferably, the urea is in the range of 10% to 20% and more preferably 15%.",
                        "In some embodiments, the cold aqueous alkaline solvent 104 is maintained at a temperature in the range of −15° C. to −5° C., preferably −12.5° C. In some embodiments, the cold aqueous alkaline solvent includes some dissolved cotton cellulose fiber in a gel state 105. In some embodiments, the cotton yarn receives two treatments, a first one of cold aqueous alkaline solvent 104 and a second of cold aqueous alkaline solvent gel (that includes some dissolved cotton cellulose fiber) 105, before being rinsed and dried. In such embodiments, preferably the first treatment 104 lacks dissolved cotton cellulose fiber in a gel state and the second treatment 105 includes dissolved cotton cellulose fiber in a gel state. In some preferred embodiments, the dissolved cotton cellulose fiber is in the range of 1% to 3%, and more preferably 2.2%.",
                        "Third, after the cotton yarn is partially dissolved in the cold aqueous alkaline solvent 104, it is rinsed in a water treatment 106. Fourth, it is dried.",
                        "In some embodiments, the cotton yarn is pulled (103 indicates the direction of pull) through one or more cold aqueous alkaline solvent bath 104 at a rate that is in the range of 42 to 286 inches per minute, preferably 118. In some embodiments, the cotton yarn is pulled through a water bath 106 at the same rate as the solvent 104. In some embodiments, the cotton yarn remains soaking in at least one of the solvent baths for a period of time in the range of 5 seconds to 5 minutes, preferably 5 to 10 seconds. In some embodiments, the cotton yarn is rinsed in the water bath 106 for a period of time in the range of about 1 to 5 minutes.",
                        "In other embodiments of the present inventive concept, a system for treating cotton yarn is provided. The system includes the methods as described above."
                    ],
                    "subsections": [
                        {
                            "title": "Examples",
                            "paragraphs": [
                                "Unique and strong cotton yarn were obtained by subjecting cotton yarn to cold alkaline aqueous solvents and cold temperature treatments with and without additional cotton reinforcement. Subjection of commercial threads, used to manufacture textile, to a dilute matrix of a cellulose material or gel (e.g., cotton) that was liquefied using an aqueous alkaline solvent solution (NaOH-urea, LiOH-urea and/or a LiOH/NaOH-urea mixture) under cold temperatures (−5° C. to −15° C.) caused the matrix cellulose to readily adhered and/or incorporate/encapsulate the cellulose into the thread. Physical testing of these cold alkaline treated threads showed that treated threads had superior mechanical properties compared to untreated threads. High speed runs of cotton threads using a motorized pull-thru system demonstrated that large scale treatment of cotton thread with cold aqueous alkaline solvent is feasible.",
                                "In the examples that follow, the following materials were used: Commercial cotton thread 30/1 OE cones were provided by Cotton Inc., Cary, N.C., USA. The cotton thread linear density was 20 tex. Commercially available alkaline hydroxides (LiOH.H2O and NaOH) and urea were of analytical grade (Aldrich-Sigma, St. Louis, Mo.) and used as received without further purification. Rolled cotton (Dukal Corporation, Hauppauge, N.Y.) provided cotton fibers and were used without modification.",
                                "Solvent formulations employed in these examples were comprised of LiOH H2O:Urea:water aqueous solution (weight ratios of 8.1:15:76.9) and LiOH H2O:NaOH:Urea water (weight ratios of 4.8:4.4:15:75.8). Initially, cotton threads were given various solvent treatments pre-cooled to −12.5° C. for various durations (1 to 5 min) followed by soaking in a water bath for 5 min to determine their effect on cotton thread. Following solvent testing threads were soaked in water for 5 min and dried with a heat gun (model 1875 Watt ionic dryer, Revlon, New York, N.Y., USA). Unless indicated elsewhere the following procedure was employed to modification of cotton yarn. The assembly of the apparatus for mass treatment of thread using a pulling thread through solvents was constructed as shown in FIG. 1. A reel attached to a variable speed motor (1-100 rpm) (Model 7553-71, Cole Parmer Instrument Company, Chicago, Ill.) connected to a speed controller (Model 7567-70, Cole Parmer) pulled cotton thread through the solvent baths. Cotton thread was first given treatments in the following order: solvent only, solvent gel solution, solvent rinse bath, drying and then winding. Solvents were pre-cooled (−5 to −12.5° C.) in 2 stainless steel tray vessels (150 mm width×170 mm length×90 mm height; 1750 ml cap.). The solvent gel solution comprised a 2.2% solution of rolled cotton fiber immersed in the pre-cooled solvent and stirred intermittently to partially dissolve cellulose in order to obtain a solvent gel solution. The following motor speeds were administered to cotton thread: 42, 118, 186, and 286 in/min.",
                                "The mechanical properties of cotton threads were tested for tenacity at break (TB), tensile modulus (E), tensile strength (σu), and elongation at break (% El)) using a universal testing machine (Instron Model 1122, Instron Corporation, Norwood, Mass.). Cotton threads were evaluated using ASTM D2256-80 method. The gauge length was 101.6 mm and the tensile speed was 12.5 mm per min. Thirty to fifty specimens of each formulation were tested. The average values and standard errors were reported. Comparisons of the mechanical properties of the treated threads with commercial non-treated thread were conducted through a normalization processes. The untreated and treated thread were examined using a Wild Heerbrugg M5 Stereo dissecting microscope (Leica Microsystems GMbH, Wetzlar, Germany) to evaluate the effect of the cold aqueous alkaline treatments on their morphologies.",
                                "As shown in Table 1 (below), solvent soaking of cotton yarn altered of the mechanical properties. For example, soaking the cotton yarn for 5 min in a solvent solution changed the αu, E, % EL, and TB values compared to untreated thread by +24%, −7%, −17%, and +28%. The strength properties of the thread were improved while the stiffness and elongation properties declined (Table 1). Tensile strength and Tenacity at Break properties are considered the more important mechanical properties associated with cotton thread in order to obtain an improved thread that would result in improved textiles. Therefore, it is apparent that a simple cold aqueous alkaline treatment did improve cotton thread. In further studies, soaking thread in solvent/gel solution only for 1 to 5 min also had effects on the mechanical properties (Table 1). For example, soaking thread for 5 min in a solvent solution changed the σu, E, % EL, and TB values compared to untreated thread by +39%, +9%, −20%, and +28%. Likeness, in tests were thread was soaked in solvent 1 min followed by a solvent/gel treatment of 1, 3 or 5 min resulted in similar tensile strength improvements (Table 1). Optical examination of the thread treated with solvent/gel compared to the untreated thread clearly revealed a morphological change in the thread. The untreated thread exhibited the characteristic weave pattern and stray fibers while the treated thread did not. This indicates the cold alkaline treatment causes a fusion of the thread.",
                                "Tests were conducted using the cotton thread pull-thru system shown in FIG. 1. In this system, cotton thread was only given a few seconds of cold aqueous alkaline solvent (about 5 to 10 seconds) and solvent/gel (about 5 to 10 seconds) treatments. A variety of speeds were administered to thread to determine if pseudo-commercial treatment system was feasible. The mechanical properties of the resultant treated cotton threads obtained in these tests are presented in FIG. 4. All threads regardless of the speed run showed improvement in their σu, E, and F values while the % EL values decreased. For example, treated cotton threads obtained via this system run at 118 in/min showed changes in the σu, E, % EL, and TB values when compared to untreated thread by +35%, +50%, −38%, and +26%. These results suggest that even relatively brief soaking (about 5 to 10 seconds) of cotton threads in cold solvent in sufficient to improve their strength values. The strength improvement of treated threads compared to untreated thread merit their fabrication into textiles for further examination.",
                                "FIG. 5 graphically compares the mechanical properties of various treated threads run at various speeds with untreated control threads normalizing the treated threads to control thread materials. For example, the σu, E, % ELO, and TB values of the CATs run at 118 in/min were +135, +1354, +56, and +217% of that of untreated control thread, respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce examples",
                                "describe materials used",
                                "describe solvent formulations",
                                "describe treatment process",
                                "describe mechanical property testing",
                                "present results of mechanical property testing",
                                "describe optical examination of treated threads",
                                "describe pull-thru system testing",
                                "present results of pull-thru system testing",
                                "compare treated threads to control threads",
                                "describe normalization process",
                                "present normalized results",
                                "conclude examples"
                            ],
                            "num_characters": 6821,
                            "outline_medium": [
                                "describe experimental setup",
                                "report results of mechanical property testing",
                                "compare treated and untreated threads",
                                "describe effect of treatment on thread morphology",
                                "discuss feasibility of large-scale treatment",
                                "summarize results of treatment process"
                            ],
                            "outline_short": [
                                "describe experimental setup and results of treating cotton yarn",
                                "provide data on mechanical properties of treated cotton yarn",
                                "show optical examination of treated cotton yarn"
                            ]
                        },
                        {
                            "title": "Exemplary Embodiments",
                            "paragraphs": [
                                "1. A system for treating cotton yarn for improved mechanical properties, the system comprising:\n\n\n- - a predetermined quantity of cotton yarn;\n  - a yarn-pulling apparatus;\n  - a first bath of aqueous alkaline solvent configured such that said\n    cotton yarn is soaked and partially dissolved when said cotton yarn\n    is pulled through said first bath of aqueous alkaline solvent at a\n    predetermined rate for a predetermined period of time, said first\n    bath of aqueous alkaline solvent having a predetermined temperature;\n  - a bath of water configured such that said soaked and partially\n    dissolved cotton yarn is rinsed when said cotton yarn is pulled\n    through said water bath at a predetermined rate for a predetermined\n    period of time.  \n    2. The system of embodiment 1, further comprising:\n  - a second bath of aqueous alkaline solvent gel configured such that\n    said cotton yarn is soaked and partially dissolved when said cotton\n    yarn is pulled through said second bath of aqueous alkaline solvent\n    gel at a predetermined rate for a predetermined period of time, said\n    second bath of aqueous alkaline solvent gel having a predetermined\n    temperature, and said second bath of aqueous alkaline solvent gel\n    includes a predetermined quantity of dissolved cotton cellulose\n    fiber.  \n    3. The system of embodiment 1, wherein said first bath of aqueous\n    alkaline solvent includes a predetermined quantity of dissolved\n    cotton cellulose fiber  \n    4. The system of embodiment 1, wherein said predetermined rate of\n    pulling said cotton yarn through said first bath of aqueous alkaline\n    solvent is in the range of 42 to 286 inches per minute, preferably\n    118 inches per minute.  \n    5. The system of embodiment 1, wherein said predetermined rate of\n    pulling said cotton yarn through said water bath is in the range of\n    42 to 286 inches per minute, preferably 118 inches per minute.  \n    6. The system of embodiment 2, wherein said predetermined rate of\n    pulling said cotton yarn through said second bath of aqueous\n    alkaline solvent gel is in the range of 42 to 286 inches per minute,\n    preferably 118 inches per minute.  \n    7. The system of embodiment 1, wherein said predetermined period of\n    time for soaking said cotton yarn in said first bath of aqueous\n    alkaline solvent is in the range of 5 seconds to 5 minutes,\n    preferably in the range of 5 to 10 seconds.  \n    8. The system of embodiment 1, wherein said predetermined period of\n    time for rinsing said cotton yarn in said water bath is in the range\n    of 1 minute to 5 minutes.  \n    9. The system of embodiment 2, wherein said predetermined period of\n    time for soaking said cotton yarn in said second bath of aqueous\n    alkaline solvent gel is in the range of 5 seconds to 5 minutes,\n    preferably in the range of 5 to 10 seconds.  \n    10. The system of embodiment 1, wherein said predetermined\n    temperature of said first bath of aqueous alkaline solvent is in the\n    range of −15° C. to −5° C., preferably −12.5° C.  \n    11. The system of embodiment 2, wherein said predetermined\n    temperature of said second bath of aqueous alkaline solvent gel is\n    in the range of −15° C. to −5° C., preferably −12.5° C.  \n    12. The system of embodiment 2, wherein said predetermined quantity\n    of dissolved cotton cellulose fiber is in the range of 1% to 3%,\n    preferably 2.2%.  \n    13. The system of embodiment 3, wherein said predetermined quantity\n    of dissolved cotton cellulose fiber is in the range of 1% to 3%,\n    preferably 2.2%.  \n    14. The system of embodiment 1, wherein said first bath of aqueous\n    alkaline solvent is a solution comprised of LiOH H₂O, Urea, and\n    water.  \n    15. The system of embodiment 1, wherein said first bath of aqueous\n    alkaline solvent is a solution comprised of LiOH H₂O, NaOH, Urea,\n    and water.  \n    16. The system of embodiment 14, wherein said LiOH H₂O is in the\n    range of 5% and 15% of said aqueous alkaline solvent solution by\n    weight, preferably 8.1%.  \n    17. The system of embodiment 14, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    18. The system of embodiment 15, wherein said LiOH H₂O is in the\n    range of 3% and 6% of said aqueous alkaline solvent solution by\n    weight, preferably 4.8%.  \n    19. The system of embodiment 15, wherein said NaOH is in the range\n    of 3% and 6% of said aqueous alkaline solvent solution by weight,\n    preferably 4.4%.  \n    20. The system of embodiment 15, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    21. The system of embodiment 2, wherein said second bath of aqueous\n    alkaline solvent gel is a solution comprised of LiOH H₂O, Urea, and\n    water.  \n    22. The system of embodiment 2, wherein said second bath of aqueous\n    alkaline solvent gel is a solution comprised of LiOH H₂O, NaOH,\n    Urea, and water.  \n    23. The system of embodiment 21, wherein said LiOH H₂O is in the\n    range of 5% and 15% of said aqueous alkaline solvent solution by\n    weight, preferably 8.1%.  \n    24. The system of embodiment 21, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    25. The system of embodiment 22, wherein said LiOH H₂O is in the\n    range of 3% and 6% of said aqueous alkaline solvent solution by\n    weight, preferably 4.8%.  \n    26. The system of embodiment 22, wherein said NaOH is in the range\n    of 3% and 6% of said aqueous alkaline solvent solution by weight,\n    preferably 4.4%.  \n    27. The system of embodiment 22, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    28. A method of treating cotton yarn for improved mechanical\n    properties, the method comprising:\n  - providing a predetermined quantity of cotton yarn;\n  - partially dissolving said cotton yarn by pulling said cotton yarn\n    through a first bath of aqueous alkaline solvent at a predetermined\n    rate such that said cotton yarn soaks in said first aqueous alkaline\n    solvent bath for a predetermined period of time, said first bath of\n    aqueous alkaline solvent having a predetermined temperature;\n  - pulling said partially dissolved cotton yarn through a bath of water\n    at a predetermined rate such that said soaked cotton yarn is rinsed\n    in said water bath for a predetermined period of time; and\n  - drying said soaked, partially dissolved and rinsed cotton yarn.  \n    29. The method of embodiment 28, further comprising:\n  - pulling said soaked and partially dissolved cotton yarn through a\n    second bath of aqueous alkaline solvent gel at a predetermined rate\n    such that said cotton yarn soaks in said second aqueous alkaline\n    solvent gel bath for a predetermined period of time, said second\n    bath of aqueous alkaline solvent gel having a predetermined\n    temperature, and said second bath of aqueous alkaline solvent gel\n    includes a predetermined quantity of dissolved cotton cellulose\n    fiber.  \n    30. The method of embodiment 28, wherein said first bath of aqueous\n    alkaline solvent is a solution comprised of LiOH H₂O, Urea, and\n    water.  \n    31. The method of embodiment 28, wherein said first bath of aqueous\n    alkaline solvent is a solution comprised of LiOH H₂O, NaOH, Urea,\n    and water.  \n    32. The method of embodiment 30, wherein said LiOH H₂O is in the\n    range of 5% and 15% of said aqueous alkaline solvent solution by\n    weight, preferably 8.1%.  \n    33. The method of embodiment 30, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    34. The method of embodiment 31, wherein said LiOH H₂O is in the\n    range of 3% and 6% of said aqueous alkaline solvent solution by\n    weight, preferably 4.8%.  \n    35. The method of embodiment 31, wherein said NaOH is in the range\n    of 3% and 6% of said aqueous alkaline solvent solution by weight,\n    preferably 4.4%.  \n    36. The method of embodiment 31, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    37. The method of embodiment 29, wherein said second bath of aqueous\n    alkaline solvent gel is a solution comprised of LiOH H₂O, Urea, and\n    water.  \n    38. The method of embodiment 29, wherein said second bath of aqueous\n    alkaline solvent gel is a solution comprised of LiOH H₂O, NaOH,\n    Urea, and water.  \n    39. The method of embodiment 37, wherein said LiOH H₂O is in the\n    range of 5% and 15% of said aqueous alkaline solvent solution by\n    weight, preferably 8.1%.  \n    40. The method of embodiment 37, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.  \n    41. The method of embodiment 38, wherein said LiOH H₂O is in the\n    range of 3% and 6% of said aqueous alkaline solvent solution by\n    weight, preferably 4.8%.  \n    42. The method of embodiment 38, wherein said NaOH is in the range\n    of 3% and 6% of said aqueous alkaline solvent solution by weight,\n    preferably 4.4%.  \n    43. The method of embodiment 38, wherein said Urea is in the range\n    of 10% and 20% of said aqueous alkaline solvent solution by weight,\n    preferably 15%.",
                                "While the present general inventive concept has been shown in the drawings and fully described above with particularity and detail in connection with what is presently deemed to be the most practical and preferred embodiment(s) of the invention, it will be apparent to those of ordinary skill in the art that many modifications thereof may be made without departing from the principles and concepts set forth herein, including, but not limited to, variations in size, materials, shape, form, function and manner of operation, assembly and use.",
                                "It is also to be understood that the following claims are intended to cover all of the generic and specific features of the invention herein described, and all statements of the scope of the invention which, as a matter of language, might be said to fall there between. Hence, the proper scope of the present general inventive concept should be determined only by the broadest interpretation of the appended claims so as to encompass all such modifications as well as all relationships equivalent to those illustrated in the drawings and described in the specification.",
                                "Finally, it will be appreciated that the purpose of the annexed Abstract is to enable the U.S. Patent and Trademark Office and the public generally, and especially the scientists, engineers and practitioners in the art who are not familiar with patent or legal terms or phraseology, to determine quickly from a cursory inspection the nature and essence of the technical disclosure of the application. Accordingly, the Abstract is neither intended to define the invention or the application, which only is measured by the claims, nor is it intended to be limiting as to the scope of the invention in any way."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe system for treating cotton yarn",
                                "describe system with additional solvent gel bath",
                                "describe system with dissolved cotton cellulose fiber",
                                "describe pulling rate through solvent bath",
                                "describe pulling rate through water bath",
                                "describe pulling rate through solvent gel bath",
                                "describe soaking time in solvent bath",
                                "describe rinsing time in water bath",
                                "describe soaking time in solvent gel bath",
                                "describe temperature of solvent bath",
                                "describe temperature of solvent gel bath",
                                "describe dissolved cotton cellulose fiber quantity",
                                "describe LiOH H2O concentration in solvent",
                                "describe Urea concentration in solvent",
                                "describe NaOH concentration in solvent",
                                "describe LiOH H2O concentration in solvent gel",
                                "describe Urea concentration in solvent gel",
                                "describe NaOH concentration in solvent gel",
                                "describe method of treating cotton yarn",
                                "describe method with additional solvent gel bath",
                                "describe method with dissolved cotton cellulose fiber",
                                "conclude embodiments"
                            ],
                            "num_characters": 11249,
                            "outline_medium": [
                                "describe system for treating cotton yarn",
                                "detail first bath of aqueous alkaline solvent",
                                "describe second bath of aqueous alkaline solvent gel",
                                "specify rate of pulling cotton yarn through solvent",
                                "specify rate of pulling cotton yarn through water bath",
                                "describe period of time for soaking in solvent",
                                "describe period of time for rinsing in water bath",
                                "specify temperature of solvent",
                                "describe composition of solvent solution",
                                "describe method of treating cotton yarn",
                                "provide variations of method and system"
                            ],
                            "outline_short": [
                                "describe system for treating cotton yarn",
                                "provide variations of the system with additional features",
                                "specify parameters for the treatment process",
                                "describe method of treating cotton yarn",
                                "provide additional variations of the method"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce invention",
                        "describe embodiments",
                        "detail cotton yarn treatment steps",
                        "describe cold aqueous alkaline solvent composition",
                        "describe cotton yarn treatment process",
                        "describe system for treating cotton yarn",
                        "describe method of treating cotton yarn",
                        "provide examples of treated cotton yarn",
                        "conclude description"
                    ],
                    "num_characters": 4647,
                    "outline_medium": [
                        "introduce invention concept",
                        "describe method of treating cotton yarn",
                        "provide examples of treatment process",
                        "discuss variations of treatment process"
                    ],
                    "outline_short": [
                        "describe treatment of cotton yarn using cold aqueous alkaline solvent",
                        "provide specific embodiments of the treatment process"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of treating cotton yarn for improved mechanical properties, the method comprising:\nproviding a predetermined quantity of cotton yarn;\npartially dissolving said cotton yarn by applying a first treatment of aqueous alkaline solvent at a predetermined rate for a predetermined period of time, said first treatment of aqueous alkaline solvent having a predetermined temperature;\napplying to said partially dissolved cotton yarn a treatment of water at a predetermined rate such that said treated cotton yarn is rinsed in said water treatment for a predetermined period of time; and\ndrying said partially dissolved and rinsed cotton yarn.",
        "2. The method of claim 1, further comprising:\napplying to said partially dissolved cotton yarn a second treatment of aqueous alkaline solvent gel at a predetermined rate for a predetermined period of time, said second treatment of aqueous alkaline solvent gel having a predetermined temperature, and said second treatment of aqueous alkaline solvent gel includes a predetermined quantity of dissolved cotton cellulose fiber.",
        "3. The method of claim 1, wherein said first treatment of aqueous alkaline solvent includes a predetermined quantity of dissolved cotton cellulose fiber",
        "4. The method of claim 1, wherein said predetermined rate of treatment of aqueous alkaline solvent of said cotton yarn comprises pulling said cotton yarn through a first bath of aqueous alkaline solvent in the range of 42 to 286 inches per minute.",
        "5. The method of claim 1, wherein said predetermined rate of treatment of water of said cotton yarn comprises pulling said cotton yarn through a water bath in the range of 42 to 286 inches per minute.",
        "6. The method of claim 2, wherein said predetermined rate of treatment of aqueous alkaline solvent gel of said cotton yarn comprises pulling said cotton yarn through a second bath of aqueous alkaline solvent gel in the range of 42 to 286 inches per minute.",
        "7. The method of claim 1, wherein said predetermined period of time for treatment of said cotton yarn in said first treatment of aqueous alkaline solvent is in the range of 5 seconds to 5 minutes.",
        "8. The method of claim 1, wherein said predetermined period of time for rinsing said cotton yarn in said water treatment is in the range of 1 minute to 5 minutes.",
        "9. The method of claim 2, wherein said predetermined period of time for treatment of said cotton yarn in said second treatment of aqueous alkaline solvent gel is in the range of 5 seconds to 5 minutes.",
        "10. The method of claim 1, wherein said predetermined temperature of said first treatment of aqueous alkaline solvent is in the range of −15° C. to −5° C.",
        "11. The method of claim 2, wherein said predetermined temperature of said second treatment of aqueous alkaline solvent gel is in the range of −15° C. to −5° C.",
        "12. The method of claim 2, wherein said predetermined quantity of dissolved cotton cellulose fiber is in the range of 1% to 3%.",
        "13. The method of claim 3, wherein said predetermined quantity of dissolved cotton cellulose fiber is in the range of 1% to 3%.",
        "14. A system for treating cotton yarn for improved mechanical properties, the system comprising:\na predetermined quantity of cotton yarn;\na yarn-pulling apparatus;\na first bath of aqueous alkaline solvent configured such that said cotton yarn is soaked and partially dissolved when said cotton yarn is pulled through said first bath of aqueous alkaline solvent at a predetermined rate for a predetermined period of time, said first bath of aqueous alkaline solvent having a predetermined temperature;\na bath of water configured such that said soaked and partially dissolved cotton yarn is rinsed when said cotton yarn is pulled through said water bath at a predetermined rate for a predetermined period of time.",
        "15. The system of claim 14, further comprising:\na second bath of aqueous alkaline solvent gel configured such that said cotton yarn is soaked and partially dissolved when said cotton yarn is pulled through said second bath of aqueous alkaline solvent gel at a predetermined rate for a predetermined period of time, said second bath of aqueous alkaline solvent gel having a predetermined temperature, and said second bath of aqueous alkaline solvent gel includes a predetermined quantity of dissolved cotton cellulose fiber.",
        "16. The system of claim 14, wherein said first bath of aqueous alkaline solvent includes a predetermined quantity of dissolved cotton cellulose fiber"
    ]
}