{
    "id": "US20220025425",
    "authors": [
        "Haitian Zhang",
        "Fan Zuo",
        "Feiran Li",
        "Jong Hyun Choi",
        "Shriram Ramanathan"
    ],
    "title": "ULTRALOW CONCENTRATION SENSING OF BIO-MATTER WITH PEROVSKITE NICKELATE DEVICES AND ARRAYS",
    "date": "2019-12-10 00:00:00",
    "abstract": "Disclosed herein is an ultralow concentration sensor of biomarkers, and the use thereof to help heath industry, medical centers and food industry to sense biomarkers by catalyst assisted charge transfer from the biomarkers to the sensor device, resulting increased electrical resistance of the sensor. Specifically, perovskite nickelate RNiO3 is used to sense biological material facilitated by specific enzymatic activity in the proximity.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF INVENTION",
                    "paragraphs": [
                        "This disclosure is related to novel devices and arrays to detect ultralow concentration of bio-matter in physiological conditions. Specifically, perovskite nickelate RNiO3 is used to sense biological material facilitated by specific enzymatic activity in the proximity."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce biomolecule sensing devices"
                    ],
                    "num_characters": 269,
                    "outline_medium": [
                        "introduce biomolecule sensing devices"
                    ],
                    "outline_short": [
                        "introduce biomolecule sensing devices"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Nickel forms a series of mixed oxide compounds which are commonly called nickelates. A nickelate is an anion containing nickel or a salt containing a nickelate anion, or a double compound containing nickel bound to oxygen and other elements. Nickel can be in different or even mixed oxidation states, ranging from +2, +3 to +4. The anions can contain a single nickel ion, or multiple ions to form a cluster ion. The solid mixed oxide compounds are often insulating, but can also be metallic. They have a variety of electrical and magnetic properties. Rare-earth elements form a range of perovskite nickelates, in which the properties vary systematically as the rare-earth element changes. Fine-tuning of properties is achievable with mixtures of elements, applying stress or pressure, or varying the physical form.",
                        "Rare-earth nickelates with nickel in a +3 oxidation state have an electronic configuration similar for cuprates and so are of interest to high-temperature superconductor researchers. Other rare-earth fickelates can function as fuel cell catalysts. The ability to switch between an insulating and a conducting state in some of these materials is of interest in the development of new transistors that have higher on to off current ratios.",
                        "Despite the physical features of these rare earth materials are studied in conductor industry, the exploration of rare-earth nickelates in health care or medical devices is in its infancy or non-existent."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe nickelates and their properties",
                        "highlight lack of exploration in healthcare"
                    ],
                    "num_characters": 1459,
                    "outline_medium": [
                        "discuss nickelates and their properties"
                    ],
                    "outline_short": [
                        "discuss nickelates and their properties"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "This disclosure provides biomolecule sensing devices based on enzyme-mediated spontaneous hydrogen transfer from bio-markers which function at body temperature in brain and in biological environments (e.g. artificial cerebrospinal fluid). The devices could be broadly used in health sciences, brain interfaces and biological routes to dope emerging semiconductors.",
                        "One embodiment of the instant disclosure provides an ultrasensitive device for detecting low concentration of biomarker in a biological fluid. The device comprises:\n\n\n- - a perovskite nickelate film comprising RNiO3 or strongly correlated\n    oxides such as transition metal oxide (eg. NiO, FeOx), wherein the\n    perovskite nickelate film is configured as a lattice or with\n    micro-fluidic channels, wherein R is selected from the group\n    consisting of Sm, Nd, Eu, Gd, Dy, Y, Lu, Pr, and La; and\n  - an enzyme or other catalyst conjugated to a conductive material,\n    wherein the conductive material is associated with said perovskite\n    nickelate film or in close proximity to the perovskite nickelate\n    film, wherein the enzyme or other catalyst facilitates hydrogen\n    transfer from the biomarker to the perovskite nickelate film and\n    reduces conductivity at the interface between the perovskite\n    nickelate film and the biomarker.",
                        "In one preferred embodiment the aforementioned device further comprises an electrode, wherein the electrode captures increased resistivity in the perovskite nickelate film.",
                        "In one preferred embodiment the conductive material in aforementioned device is Au electrode.",
                        "In one preferred embodiment the enzyme in aforementioned device is glucose oxidase and the biomarker is glucose in body fluid, such as blood, sweat or urine.",
                        "In one preferred embodiment the enzyme in aforementioned device is horseradish peroxidase (HRP) and the biomarker is dopamine in cerebrospinal fluid.",
                        "In one preferred embodiment enzyme in aforementioned device is conjugated to Au electrode surface via cystamine.",
                        "In one preferred embodiment the enzyme in aforementioned device is configured as arrays with large-scale circuits on a single chip, wherein various enzymes or other catalysts are conjugated to the arrays rendering specificity to different biomarkers simultaneously in the single chip.",
                        "The disclosure provides a method of detecting ultra-low concentration of biomarker in biological fluid. The method comprises the following steps:",
                        "Providing a device comprising following components:\n\n\n- - a perovskite nickelate film comprising RNiO3 or strongly correlated\n    oxides with similar transition metal oxide (eg. NiO, FeOx), wherein\n    the perovskite nickelate film is configured as a lattice or with\n    micro-fluidic channels, wherein R is selected from the group\n    consisting of Sm, Nd, Eu, Gd, Dy, Y, Lu, Pr, and La; and\n  - an enzyme or other catalyst conjugated to a conductive material,\n    wherein the conductive material is associated with the perovskite\n    nickelate film or in close proximity to the perovskite nickelate\n    film, wherein the enzyme or other catalyst facilitates hydrogen\n    transfer from the biomarker to the perovskite nickelate film and\n    increases the resistivity of nickelate film;\n  - Measuring the resistance reading R₀ between the device and the\n    conductive material;\n  - Immersing the device to a biological fluid;\n  - Measuring the resistance reading R between the device and the\n    conductive material after the immersing step; and\n  - Identifying the biological fluid with ratio of R/R₀ greater than 1\n    as the sample comprising said enzyme targeted biomarker.",
                        "In some preferred embodiment the aforementioned method is used to detect glucose in the biological fluid.",
                        "In some preferred embodiment the aforementioned method is used to detect dopamine in cerebrospinal fluid.",
                        "In some preferred embodiment the aforementioned method is conducted at room temperature or body temperature.",
                        "In some preferred embodiment the aforementioned method is to detect concentrations of biomarker between the ranges of about 10−16 M to about 10−17 M.",
                        "In some preferred embodiment the device in aforementioned method comprising Au as the conductive material.",
                        "In some preferred embodiment the device in aforementioned method comprising an enzyme selected from the group consisting of glucose oxidase and Horseradish peroxidase (HRP).",
                        "In some preferred embodiment the device in aforementioned method is configured as arrays with large scale circuits on a single chip to simultaneously sense various biomarkers that corresponding enzymes or other catalysts specifically recognize and facilitate hydrogen transfer.",
                        "In some preferred embodiment the aforementioned method further comprising integrating the device into a wearable electronic platform for personal healthcare monitoring.",
                        "In some preferred embodiment the aforementioned method is conducted in room temperature or body temperature.",
                        "In some preferred embodiment the aforementioned method is conducted spontaneously with biological fluid immersion of the device and free of external energy input.",
                        "This disclosure further provides a method for detecting ultra-low concentration of biomarker in a sample. The method comprises the following steps:\n\n\n- - Providing a perovskite nickelate film having strongly correlated\n    oxides from rare-earth or related transition metal oxides;\n  - Providing a catalyst that may act on the biomarker in the sample and\n    alter the physical property of the film, wherein the catalyst is in\n    close proximity to the film;\n  - Contacting the film with the sample; and\n  - Measuring the film's optical, magnetic or thermal properties before\n    and after said contact to determine the existence of the biomarker.",
                        "These and other features, aspects and advantages of the present invention will become better understood with reference to the following figures, associated descriptions and claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce biomolecule sensing devices",
                        "describe device components",
                        "explain enzyme-mediated hydrogen transfer",
                        "describe resistance measurement method",
                        "identify biological fluid with ratio of R/R₀",
                        "provide preferred embodiments for glucose detection",
                        "provide preferred embodiments for dopamine detection",
                        "describe device configurations",
                        "describe method for detecting biomarkers",
                        "provide preferred embodiments for method",
                        "describe integration into wearable electronic platform"
                    ],
                    "num_characters": 5934,
                    "outline_medium": [
                        "introduce enzyme-mediated biomolecule sensing devices",
                        "describe device components",
                        "outline method of detecting biomarkers",
                        "highlight advantages of the invention",
                        "mention various embodiments"
                    ],
                    "outline_short": [
                        "describe biomolecule sensing devices",
                        "outline method of detecting biomarkers"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "While the concepts of the present disclosure are illustrated and described in detail in the figures and the description herein, results in the figures and their description are to be considered as exemplary and not restrictive in character; it being understood that only the illustrative embodiments are shown and described and that all changes and modifications that come within the spirit of the disclosure are desired to be protected.",
                        "Unless defined otherwise, the scientific and technology nomenclatures have the same meaning as commonly understood by a person in the ordinary skill in the art pertaining to this disclosure.",
                        "Functional interfaces between electronics and biological matter are essential to diverse fields including health sciences (e.g. detection of early stage diseases), soft robotics (e.g. sensory interfaces for autonomous systems), bio-engineering and search for life in extreme environments in land or water bodies on Earth, other planets or asteroids. Energy and information flow in biological and living matter occurs through ionic currents, however in traditional semiconductor devices, it is due to electrons and holes. Functional interfaces between biological and synthetic matter therefore can greatly benefit from simultaneous ion-electron transfer coupled with signaling capability in a range of biological and body/brain environments. Synthetic matter that responds to reaction intermediates at low concentrations therefore can be game-changing in this context, however must be functional near room (or body) temperature while constantly exposed to complex biological media. As a promising candidate, the perovskite nickelate SmNiO3 (SNO, space group Pbnm), is water-stable, and belongs to a class of strongly correlated quantum materials, whose properties are highly sensitive to the occupancy of electrons in their partially-filled orbitals. When doped with charge carriers, SNO shows massive electronic structure changes: For one electron/unit cell doping from hydrogen, the electrical resistance changes by ˜10 orders of magnitude.",
                        "This disclosure provides a new device and system to detect biological molecules (such as glucose and dopamine) down to ultra-low concentrations. This device is based on rare earth perovskite nickelate RNiO3 (R can be Sm, Nd, Eu, Gd, Dy, Y, Lu, Pr, La, etc). FIG. 2 shows the sensing mechanism and device where the electrical resistance of the device changes (increases) with the presence of biological molecules. In this sensing process, hydrogen atoms from the biological molecules are first transferred to an enzyme, and then into the RNiO3 lattice. This process occurs spontaneously without the need for any external energy input. The hydrogen then bonds with oxygen anions and occupies interstitial sites among the oxygen octahedra in RNiO3, contributing an electron to the d orbitals of nickel. As a result, the singly occupied Ni eg orbitals in glucose-reacted RNiO3 become doubly occupied and the additional electron in the eg orbital imposes large on-site Mott-Hubbard electron-electron repulsion, leading to localization of the charge carriers and resistivity increase. Such a hydrogen-induced conduction suppression serves as a unique and ultra-sensitive platform for chemical transduction at the interface between the nickelate films and biological molecules. Schematic figure of the enzyme-RNiO3 device is presented in FIG. 2 (b). The enzymes are anchored on a gold electrode via cystamine bonding and transfer hydrogen from biological molecules to the perovskite channel. The sensing function can be initiated by adding biological molecules on top of the device surface.",
                        "After the biological molecules were added, the resistance of the perovskite nickelate device increased, due to the hydrogen transfer and its consequential electron localization as described in FIG. 2. The perovskite nickelate devices are highly responsive to dilute biological molecule concentrations and showed good selectivity. For the responsivity test, the perovskite nickelate devices were soaked in glucose and dopamine solutions with different concentrations for one hour and then the resistance ratio (R/R0) was plotted in FIG. 3. In all the cases, the device resistance increased after the reaction, and R/R0 becomes larger with increasing glucose concentration, and the detection limit is determined as 5×10−16 M and 5×10−17 M for glucose and dopamine, respectively (signal to noise ratio >3). The high detection limit in our perovskite nickelate devices is a unique attribute of strong electron correlations, a quantum mechanical effect wherein miniscule perturbation to the electron occupancy of orbitals can result in giant modulation of the transport gap. The devices were also found functional at body temperature (37° C.) and artificial cerebrospinal fluid (ACSF) environment.",
                        "The advantages of this technique include sensing bio-molecules (such as dopamine and glucose) down to ultralow concentration, one order better than current state of the art techniques. Additionally, the sensing process is spontaneous, and no external energy is required in this process.",
                        "It is contemplated that strongly correlated oxides (such as but not limited to rare earth perovskite nickelate, and related transition metal oxides such as NiO, FeOx) are used as biomolecule sensors.",
                        "Without limiting to any particular theory, it is contemplated to use the strong election correlation effect in this class of materials to achieve high detection limit.",
                        "Exemplified but not limited to any particular theory, enzymes or other catalysts that facilitate proton transfer between bio-molecules and strongly correlated oxides is shown to be effective to sense bio-molecules.",
                        "Without being limited by any theory, it is also contemplated that other than resistivity change of strongly correlated oxides due to the proton transfer, change of optical, magnetic and thermal properties can also be utilized as possible sensing means.",
                        "Arrays of such devices can be fabricated to design large scale circuits on a chip to rapidly sense bio-molecules. Micro-fluidic channels can be integrated with such devices to direct flow of fluids onto the surfaces and sense presence of bio-matter. Various enzymes can be positioned at discrete devices and simultaneously several classes of bio-molecules can be sensed in a single chip. This can help rapidly identify bio-matter for health sciences such as diabetes or sweat or urine, blood monitoring. The devices can also be integrated into wearable electronic platforms for personal health monitoring."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce functional interfaces between electronics and biological matter",
                        "describe perovskite nickelate properties",
                        "explain sensing mechanism",
                        "describe device configuration",
                        "explain hydrogen transfer process",
                        "describe resistance increase",
                        "provide responsivity test results",
                        "describe device functionality at body temperature",
                        "highlight advantages of technique",
                        "contemplate use of strongly correlated oxides",
                        "contemplate use of enzymes or catalysts",
                        "contemplate use of optical, magnetic, and thermal properties",
                        "describe potential applications"
                    ],
                    "num_characters": 6586,
                    "outline_medium": [
                        "discuss functional interfaces between electronics and biological matter",
                        "introduce perovskite nickelate SmNiO3",
                        "describe sensing mechanism and device",
                        "outline device fabrication and testing",
                        "discuss advantages and potential applications",
                        "contemplate other sensing means and device arrays"
                    ],
                    "outline_short": [
                        "motivate functional interfaces between electronics and biological matter",
                        "describe perovskite nickelate properties and sensing mechanism",
                        "outline device fabrication and testing"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1. Fabrication of the Perovskite Nickelate Bio-Sensor Device",
                            "paragraphs": [
                                "Perovskite nickelate films were grown using sputtering. Before deposition, LaAlO3 substrates were rinsed by acetone and isopropanol, after which the substrates were dried by nitrogen. Co-sputtering of rare earth and Ni targets were performed with R at a radio frequency (RF) power at 170 W, and Ni at direct current (DC) power at 70 W. This growth condition ensures a stoichiometric ratio of R to Ni cations as characterized by energy-dispersive X-ray spectroscopy (EDS). The growth was carried out at room temperature with a background pressure of argon and oxygen mixture at 5 mTorr. Then the film was annealed at 500° C. for 24 hours under 100 bar of O2 in a home-built high-pressure tube furnace. Au electrodes (50 nm thick with 3 nm Ti adhesion layer) were deposited using electron beam evaporation, and the devices were fabricated with shadow masks (500 μm gap). The GOx enzyme is selective to glucose oxidation while the horseradish enzyme (HRP) can be used to study dopamine release. To anchor the GOx enzyme and HRP enzyme respectively to the Au electrode surface, the SNO devices were first immersed in 10 mM cystamine solution for 2 hours at room temperature in dark. The GOx enzyme (Sigma-Aldrich catalog number G6125), HRP enzyme (Sigma-Aldrich catalog number P8375) and cystamine were purchased from Sigma-Aldrich Corporation. The SNO devices were then rinsed with DI water to remove the unreacted cystamine and dried with compressed air. Next, the glucose oxidase (GOx) was oxidized in order to conjugate to the cystamine on the Au surface. For this purpose, 30 mg sodium metaperiodate was added into 20 μM GOx solution (in 5 mL 0.1 M pH 6.8 Sodium Phosphate buffer). The mixture was incubated in 4° C. for 1 hour. Then 6.97 μL ethylene glycol was added into the mixture and incubated at room temperature for 30 mins to stop the reaction. This product was purified by PD-10 desalting column (GE Healthcare) to collect oxidized GOx as well as changing the buffer back to 0.1 M pH 6.8 Sodium Phosphate. The reacted SNO device was immersed in the collected GOx solution for 1 hour at 4° C. and then rinsed with DI H2O. The device was then dried by compressed air and stored at 4° C. ready for use."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe film growth process",
                                "describe annealing process",
                                "describe electrode deposition",
                                "describe enzyme anchoring process"
                            ],
                            "num_characters": 2209,
                            "outline_medium": [
                                "describe film growth and annealing",
                                "outline enzyme anchoring and device fabrication"
                            ],
                            "outline_short": [
                                "describe device fabrication process"
                            ]
                        },
                        {
                            "title": "Example 2. Glucose Detection",
                            "paragraphs": [
                                "As shown in FIG. 1 (a), literature reports on glucose sensing mechanisms can be summarized into four categories: field effect transistor devices, optical methods, direct electron (e−) collection, and electrochemical methods. The field effect transistor devices utilize gate voltage signal from the glucose reaction to modulate the channel conductance for glucose detection. Optical methods were performed by monitoring the optical emission/properties change at certain wavelength that is specific to the glucose reaction. Direct electron collection measures the glucose concentration by directly collecting the electron signal in certain glucose reactions. Electrochemical methods involve cyclic voltammetry to detect the reduction/oxidation peaks of glucose. The glucose detection limit is typically between 10−6 to 10−8 M, with the highest value being 10−12 M for the transistor device, and 2×10−15 M for the voltage based electrochemical method with a specially designed reaction cell. The mechanism reported in this work is based on extreme electron localization in SmNiO3 by carrier doping and has a detection limit of ˜5×10−16 M."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize literature reports on glucose sensing mechanisms",
                                "compare detection limits"
                            ],
                            "num_characters": 1135,
                            "outline_medium": [
                                "compare glucose detection limits"
                            ],
                            "outline_short": [
                                "compare glucose detection limits"
                            ]
                        },
                        {
                            "title": "Example 3. Dopamine Detection",
                            "paragraphs": [
                                "As shown in FIG. 1(b), literature reports on dopamine sensing mechanisms can be summarized into six categories: carbon-based methods, polymer-based methods, aptamer-based methods, catalyst-enhanced methods, molecular imprinted polymer (MIP) based methods and optical sensing. Carbon-based materials such as carbon nanotubes and graphene can be used to detect dopamine through electrical and electrochemical measurements. Polymer based sensors are used due to their biological compatibility. In the Aptamer based methods, short DNA or RNA oligomers are specially designed so that they bind with dopamine for its detection. Catalysts enhanced methods use catalysts to modify electrodes (such as polymer, graphene and carbon fiber etc.), and enhance sensor performance. In the molecular imprinted polymer (MIP) methods, functional monomers first polymerize with template molecules, and then the template molecules are removed. In this way, the detection surface area is increased, and the target molecules bind to the functional sites more preferentially. The optical sensing methods detect local change in optical properties or fluorescence due to the presence of dopamine. The mechanism reported in this work utilizes strong electron correlations induced by hydrogen doping leading to electron localization in SmNiO3 and has a detection limit of ˜5×10−17 M."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize literature reports on dopamine sensing mechanisms",
                                "compare detection limits"
                            ],
                            "num_characters": 1356,
                            "outline_medium": [
                                "compare dopamine detection limits"
                            ],
                            "outline_short": [
                                "compare dopamine detection limits"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An ultrasensitive device for detecting low concentration of biomarker in a biological fluid, comprising:\na perovskite nickelate film comprising RNiO3 or strongly correlated transition metal oxide (eg. NiO, FeOx), wherein said perovskite nickelate film is configured as a lattice or with micro-fluidic channels, wherein R is selected from the group consisting of Sm, Nd, Eu, Gd, Dy, Y, Lu, Pr, and La; and\nan enzyme or other catalyst conjugated to a conductive material, wherein said conductive material is associated with said perovskite nickelate film or in close proximity to said perovskite nickelate film, wherein said enzyme or other catalyst facilitates hydrogen transfer from said biomarker to said perovskite nickelate film and reduces conductivity at the interface between the perovskite nickelate film and said biomarker.",
        "2. The ultrasensitive device according to claim 1 further comprising an electrode, wherein said electrode captures increased resistivity in said perovskite nickelate film.",
        "3. The ultrasensitive device according to claim 1 wherein said conductive material is Au electrode.",
        "4. The ultrasensitive device according to claim 1, wherein said enzyme is glucose oxidase and the biomarker is glucose in body fluid.",
        "5. The ultrasensitive device according to claim 4, wherein the body fluid is blood, sweat or urine.",
        "6. The ultrasensitive device according to claim 1, wherein said enzyme is horseradish peroxidase (HRP) and the biomarker is dopamine in cerebrospinal fluid.",
        "7. The ultrasensitive device according to claim 3 wherein said enzyme is conjugated to Au electrode surface via cystamine.",
        "8. The ultrasensitive device according to claim 1 is configured as arrays with large scale circuits on a single chip, wherein various enzymes or other catalysts are conjugated to said arrays rendering specificity to different biomarkers simultaneously in said single chip.",
        "9. A method of detecting ultra-low concentration of biomarker in biological fluid, comprising:\nProviding a device comprising following components:\na perovskite nickelate film comprising RNiO3 or strongly correlated oxides with similar transition metal oxide (eg. NiO, FeOx), wherein said perovskite nickelate film is configured as a lattice or with micro-fluidic channels, wherein R is selected from the group consisting of Sm, Nd, Eu, Gd, Dy, Y, Lu, Pr, and La; and\nan enzyme or other catalyst conjugated to a conductive material, wherein said conductive material is associated with said perovskite nickelate film or in close proximity to said perovskite nickelate film, wherein said enzyme or other catalyst facilitates hydrogen transfer from said biomarker to said perovskite nickelate film and reduces conductivity at the interface between the perovskite nickelate film and said biomarker;\n\nMeasuring the resistance reading R0 between the device and the conductive material;\nImmersing the device to a biological fluid;\nMeasuring the resistance reading R between the device and the conductive material after the immersing step; and\nIdentifying the biological fluid with ratio of R/R0 greater than 1 as the sample comprising said enzyme targeted biomarker.",
        "10. The method according to claim 9 is used to detect glucose in said biological fluid.",
        "11. The method according to claim 9 is used to detect dopamine in cerebrospinal fluid.",
        "12. The method according to claim 9 is conducted at room temperature or body temperature.",
        "13. The method according to claim 9 is to detect concentrations of biomarker between the ranges of about 10−16 M to about 10−17 M.",
        "14. The method according to claim 9 wherein the device comprising Au as the conductive material.",
        "15. The method according to claim 9 wherein the device comprising an enzyme selected from the group consisting of glucose oxidase and Horseradish peroxidase (HRP).",
        "16. The method according to claim 9 wherein the device is configured as arrays with large scale circuits on a single chip to simultaneously sense various biomarkers that corresponding enzymes or other catalysts specifically recognize and facilitate hydrogen transfer.",
        "17. The method according to claim 10 further comprising integrating said device into a wearable electronic platform for personal healthcare monitoring.",
        "18. The method according to claim 10 is conducted in room temperature or body temperature.",
        "19. The method according to claim 10 is conducted spontaneously with biological fluid immersion of the device and free of external energy input.",
        "20. A method for detecting ultra-low concentration of biomarker in a sample, comprising:\nProviding a perovskite nickelate film having strongly correlated oxides from rare-earth or related transition metal oxides;\nProviding a catalyst that may act on said biomarker in said sample and alter the physical property of said film, wherein said catalyst is in close proximity to said film;\nContacting said film with said sample; and\nMeasuring said film's optical, magnetic or thermal properties before and after said contact to determine the existence of said biomarker and use as detection mechanism."
    ]
}