{
    "id": "https://semopenalex.org/work/W2035527934",
    "authors": [
        "Jun Hirabayashi",
        "Hisashi Narimatsu",
        "Tatsuro Irimura",
        "Masakazu Yamamoto",
        "Yasuni Nakanuma",
        "Yuzuru Ikehara",
        "Junichi Shoda",
        "Atsushi Matsuda",
        "Toru Kawamoto",
        "Hitomi Matsuzaki",
        "Nobuhiro Ohkohchi",
        "Atsushi Kuno",
        "Yoh Zen"
    ],
    "title": "Wisteria floribunda agglutinin-positive mucin 1 is a sensitive biliary marker for human cholangiocarcinoma",
    "date": "2010-03-08",
    "abstract": "Cholangiocarcinoma (CC) is an aggressive malignant tumor for which useful markers are not presently available for early and precise diagnosis. The aim of this study was therefore to identify a high-performance diagnostic marker with a special focus on glyco-alteration of glycoproteins. In the course of study, we found that Wisteria floribunda agglutinin (WFA) is the best probe to differentiate intrahepatic cholangiocarcinoma (ICC) lesions from normal bile duct epithelia (BDE) (P < 0.0001). The subsequent histochemical study confirmed ICC-specific WFA staining on 165 tissue specimens. On the other hand, the WFA staining was shown to be closely associated with that of MY.1E12 established previously against sialylated mucin 1 (MUC1) by double-staining experiments. Moreover, glyco-alteration of MUC1 could be verified by western blotting of WFA-captured bile samples from patients with CC patients. Thus, we attempted to construct an enzyme-linked immunosorbent assay system for more convenient CC diagnosis, where WFA-coated plates, the specific monoclonal antibody MY.1E12, and the bile specimens from CC including ICC (n = 30) and benign diseases (n = 38) were combined. As a result, CC was clearly distinguished from benign diseases with statistical scores (sensitivity = 90.0%, specificity = 76.3%, and area under the curve = 0.85). As a particular note, the obtained sensitivity is the highest score among those having been so far reported.Our approach focusing significant glyco-alteration of a particular glycoprotein yielded a novel diagnostic system for CC with satisfactory clinical scores.",
    "sections": [
        {
            "title": "Patients and Methods",
            "paragraphs": [
                "Specimens. Archival formalin-fixed, paraffin-embedded liver tissue specimens from 105 surgical cases of ICC (14 with hepatolithiasis and 91 without hepatolithiasis), 10 cases of hepatocellular-intrahepatic cholangiocellular carcinoma (HCC-ICC), 25 cases of HCC, and 25 samples of normal liver (from patients with metastatic liver tumors) were used in this study. Supporting Table 1 summarizes the sex and mean age of the patients, and the pathological features of these cases. In detail, tissue specimens from 45 cases of ICC (14 with hepatolithiasis and 31 without) were used in the lectin microarray analysis. For histochemical analysis, specimens from 83 cases of ICC, 10 cases of HCC-ICC, 25 cases of HCC, and 25 normal livers were used.",
                "Bile specimens were obtained by percutaneous transhepatic biliary drainage from 18 patients with CC and at surgery from 12 patients with CC. In the analysis of bile cytology, three of the 18 specimens obtained by percutaneous transhepatic biliary drainage were positive (class V), eight were negative (class I, II, or IIIa), and the other seven were suspect (class IIIb or IV). These bile samples were obtained from the patients diagnosed with CC by surgical resection. In addition, for 16 patients with hepatolithiasis, ductal bile was obtained at surgery from the hepatic ducts affected by intrahepatic stones and the unaffected hepatic ducts, with particular care taken to avoid contamination with blood. For patients with common bile duct stones (n ¼ 9), gallbladder stones (n ¼ 10), cholangiectasis (n ¼ 1), bile duct stenosis (n ¼ 1), and pancreatitis (n ¼ 1), ductal bile was also obtained from the common bile ducts at surgery. The bile specimens were stored at À80 C until use. The study protocol conformed to the ethical guidelines of the Declaration of Helsinki (1975). All patients provided written informed consent for the analysis of the biopsy specimens or drainage bile. The protocol for this study was approved by the ethical committee of Kanazania University, Tokyo Women's Medical University and University of Tsukuba.",
                "Lectin Microarray Analysis Using Samples from Tissue Sections. Differential glycan profiling of tissue sections was performed essentially as described. 21 Briefly, formalin-fixed, paraffin-embedded ICC tissue sections were deparaffinized, and the relevant tissue fragments including cancerous (n ¼ 45) and normal bile duct epithelia (BDE) (n ¼ 38) lesions (corresponding to 1.0 mm square and 5 lm thickness, respectively) were then scratched from the glass slide using a needle (gauge size: 21 G) under a microscope. Total protein extracts from the scratched tissue fragments thus obtained were fluorescence-labeled with 10 lg of Cy3-succimidyl ester (SE; Amersham Biosciences, Tokyo, Japan). After blocking free Cy3-SE with 0.5 M glycine in Tris-buffered saline containing 1% Triton X-100 (TBSTx), an aliquot ( 1 = 4 ) was applied to a lectin microarray slide. Fluorescence signals were measured on a GlycoStation scanner (Moritex Co., Tokyo, Japan). The obtained lectin microarray data were analyzed on the basis of normalized signal intensities as described, 23 where the lectin showing the strongest signal intensity (max intensity) was assigned a value of 1.0.",
                "Statistics. The values are presented as the median 6 standard error of the mean (SEM). A two-sided Welch or Student t test was used to compare the clini-copathological data between groups. All calculations were performed using Origin version 7.5 software for Windows (OriginLab Co., Northampton, MA). Receiver operating characteristic (ROC) curve analysis was performed to evaluate the differences between ICC and benign disease on the bases of sensitivity and specificity at various cutoff levels. An area under the ROC curve (AUC) of 1.0 indicates perfect discrimination, whereas an area of 0.5 indicates that the test discriminates no better than chance. 24 Histochemical Analysis. WFA staining was performed using biotinylated WFA (Vector Co., Burlingame, UK). Detection was made with Histofine Simple Stain MAX-PO (Nichirei Co., Tokyo, Japan). The tissue sections were deparaffinized and then autoclaved to enhance the WFA reactivity. After cooling to room temperature, endogenous peroxidase was blocked by incubating the sections in methanol containing 0.3% hydrogen peroxide. The tissue sections were blocked with phosphate-buffered saline (PBS) containing 1% (wt/vol) bovine serum albumin (BSA), and the sections were incubated with 2 lg/mL of biotinylated WFA in 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid for 1 hour at room temperature. The sections were incubated with streptavidin-peroxidase reagents, reacted with 3,3 0 -diaminobenzidine tetrahydrochloride for visualization, and counterstained with hematoxylin.",
                "Fluorescent double-staining was performed with biotinylated WFA and Cy5-SE-labeled anti-biotin antibody, together with mAb MY.1E12, whose epitope structure has been established, MUC1 with sialylated-T antigen, and Alexa Fluor 488-labeled secondary antibody. 25,26 For nucleic acid staining, the slides were incubated with TO-PRO-3 (Invitrogen, Carlsbad, CA; 1:5000 in PBS) for 10 minutes. The slides were washed with PBS, mounted in ProLong Gold Antifade Reagent (Invitrogen) and examined using an LSM 510 confocal laser microscope (Carl Zeiss Inc., Oberkochen, Germany).",
                "Lectin-Affinity Purification of Bile Specimens. Bile samples from the patients with central type CC and the patients with hepatolithiasis were centrifuged at 16,000g for 20 minutes at 4 C, and the supernatants were collected. The protein concentration was measured with Micro BCA (Pierce, Rockford, IL) using BSA as a standard. 27,28 For WFA-affinity purification, 20 lg of total protein from the bile samples described above and 2 lg of preconjugated biotinylated WFA, streptavidin-immobilized magnetic beads (Streptavidincoupled Dynabeads; Invitrogen) were used. 29 The beads were incubated with bile for 9 hours at 4 C, the supernatants were then excluded, and the beads were washed twice with 200 lL of PBS containing 1% Triton X-100 (PBSTx). Elution was performed with 10 lL of elution buffer (1% sodium dodecyl sulfate in PBS containing 0.2 M galactosamine). To ensure complete elution, the beads were incubated overnight at room temperature, and the supernatants were then collected and used as the eluted fractions.",
                "Western Blotting Analysis Using MY.1E12 mAb. The eluted fractions and 20 lg of supernatants in the crude bile samples were dissolved in sample buffer (12 mM Tris-HCl, pH 6.8, 5% [vol/vol] glycerol, 0.4% sodium dodecyl sulfate, 0.02% bromophenol blue). The proteins were separated by 1% agarose gel electrophoresis at 50 mA for 90 minutes under nonreducing conditions and then transferred onto a polyvinylidene fluoride membrane by vacuum blotting. The transferred membrane was blocked with 4% (wt/ vol) skim milk in TBS-t (TBS containing 1% Tween 20) overnight at 4 C and then incubated with 0.5 lg/ mL of mAb MY.1E12 in TBS-t containing 1% BSA for 2 hours at room temperature. After washing with TBS-t, the membrane was incubated with 1/10,000diluted alkaline phosphatase-conjugated anti-mouse IgG in TBS-t for 1 hour at room temperature. After washing, the membrane was visualized with Western blue detection reagents (Promega, Madison, WI).",
                "Sandwich ELISA with Combination of MY.1E12 and WFA. Flat-bottomed 96-well streptavidin-precoated microtiter plates (Nunc International, Tokyo, Japan) were treated with biotinylated WFA (Vector, 1.0 lg/well) for immobilization for 1 hour at room temperature. The plates were incubated with bile (protein amount adjusted to 10 lg/well) in PBS containing 0.1% Tween20 (PBS-t) for 2 hours at room temperature and then with either 50 ng/well of MY.1E12 in PBS-t for 2 hours at room temperature. For conventional antibody-antibody sandwich assay as a control, MY.1E12 (0.5 lg/well) was coated on flat-bottomed 96-well microtiter plates (Greiner Bio-one Co., Tokyo, Japan), and 100 ng/well of biotinylated MY.1E12 in PBS-t was overlaid. The plates were washed extensively and then incubated with 100 lL of either a 1/4000diluted solution of horseradish peroxidase (HRP)-conjugated anti-mouse IgG (Jackson ImmunoResearch Laboratories Inc., Philadelphia, PA) in PBS-t for MY.1E12 or a 1/20,000 diluted solution of HRP-conjugated streptavidin (Jackson) in PBS-t for biotinylated MY.1E12 for 1 hour at room temperature. One hundred microliters of the substrate 3,3 0 ,5,5 0 -tetramethyl benzidine (Thermo Fisher Scientific, Fremont, CA) solution was added to each well. The enzyme reaction was stopped by adding 100 lL of 1 M sulfuric acid, and the optical density (OD) was measured at 450 nm. For differential analysis, the ratios were measured relative to values in healthy volunteer sera. All experiments were performed in duplicate, and the median was used as the final value for each sample."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [
                "Lectin-Microarray Analysis Using Tissue Sections. To identify the most relevant lectin specific for CC, we first performed differential glycan profiling using paraffin-embedded, formalin-fixed ICC tissue sections, which include both cancerous lesions and normal BDE (Supporting Table 2). We found significant differences in several lectins. The signal intensities of four lectins, T/Tn-antigen binder BPL, H-antigen binder TJA-II, terminal a/b-GalNAc binder WFA, 30 and a Tantigen binder ACA, were higher in the cancerous lesions than in the normal BDE. The ratios between the values in tumor versus normal BDE (T/N) for the relative signals were 2.3 for BPL, 2.4 for TJA-II, 4.6 for WFA, and 2.0 for ACA, respectively. These were significant at P < 0.0001. Comparison of cancerous lesions and normal BDE in the same patient's specimen (14 and 10 cases with and without stones, respectively) showed the highest values for the WFA signal among the four lectins (P < 0.0001 without stones and P < 0.0015 with stones) (Fig. 1). The WFA signal also showed the best result in the ROC curve analysis, with high scores for sensitivity (87.4%), specificity (92.1%), and AUC (0.93) (Table 1). These results strongly suggest that the high WFA signal observed correlated closely with the glycosylation change specific for cancerous lesions of ICC.",
                "Histochemical Approach to Analyze the Specific Expression of WFA-Reactive Glycans in ICC. To confirm the above result, we took a histochemical approach to visualize the expression of WFA-reactive glycans using biotinylated WFA. Cancerous lesions of ICC (n ¼ 90), normal BDE (n ¼ 25), hepatocellular carcinoma (HCC) (n ¼ 25), and combined HCC-ICC (n ¼ 10) were used as specimens. The observed results are summarized in Table 2. In the ICC cancerous lesions, significant WFA staining was detected with high frequency in both ICC (83/90; 92.2%) and ICC elements of HCC-ICC (8/10; 80.0%). In normal BDE, some staining was observed, but with much less frequency (8/25; 32.0%) and intensity than for the cancerous lesions (Fig. 2). Conversely, no WFA-positive staining was observed (0/10; 0%) in hepatocellular carcinoma cells of HCC and HCC lesions of HCC-ICC. These results support the idea that WFA-reactive glycans are expressed specifically in ICC.",
                "Double-Staining Analysis with MY.1E12 and WFA. It is known that the expression of sialylated MUC1 increases in CC and correlates significantly with tumor malignancy. For this molecular species, a specific mAb, MY.1E12, has been established and characterized. 25,26,31,32 We investigated the possibility that sialylated MUC1 colocalizes with the WFA-reactive glycans using a fluorescence double-staining method of ICC tissue sections. The staining was performed with MY.1E12 and Alexa Fluor 488-labeled anti-mouse IgG antibody (green, Fig. 3B), together with biotinylated WFA and Cy5-SE-labeled anti-biotin mAb (red, Fig. 3C). Both WFA and MY.1E12 probes stained mainly the apical surface of epithelial cells in the cancerous lesions (Fig. 3B,C). The two stains merged well (yellow, Fig. 3D). These results indicated that WFA-reactive glycans are carried, at partly, on sialylated MUC1 in cancerous lesions. Pulldown Assay of Sialylated MUC1-and WFA-Reactive Glycoproteins in Bile. The above results strongly implied that sialylated MUC1 is a candidate glycoprotein that carries ICC-associated, WFA-reactive glycans. As the next step, we performed a pulldown assay using biotinylated WFA preconjugated streptavidin beads and bile samples. The samples were the bile specimens from hepatolithiasis patients as the benign disease control (n ¼ 5) and from patients of intra and extra hepatic CC (n ¼ 5). The pretreated bile was probed with MY.1E12 by western blotting (for experimental details, see Patients and Methods). The presence of sialylated MUC1 was observed even in the Fig. 1. Differential glycan analysis in ICC and normal BDE lesions within the same patient with stones and without stones in the tissue. A dot graph representation of the data obtained for four representative lectins shows significant differences in signals between ICC and normal BDE lesions in the same specimens (i.e., patients and dates). (A) The results of differential analysis of 10 specimens obtained from the ICC patients without intrahepatic stones. (B) The results of differential analysis of 14 specimens obtained from ICC patients with stones. Significant differences between ICC and normal BDE lesions within the same tissue sections were validated by a corresponding t test using normalized data sets of the selected four lectins obtained by lectin microarray analysis.  crude bile in four of five control samples, and all five CC samples (Fig. 4A), indicating that sialylated MUC1 is a common structure to both hepatolithiasis and CC. By contrast, sialylated MUC1 expression was much lower in WFA-pretreated bile (only one of five samples) but was observed in all five CC samples (Fig. 4B). These results show clearly that sialylated MUC1 carries WFA-reactive glycans contained in the bile of CC patients.",
                "Diagnosis of Bile-Sialylated MUC1 with mAb MY.1E12/WFA Sandwich ELISA. Because the WFA-MY.1E12 combination showed good potential to identify CC-specific markers in bile (Fig. 4), we next attempted to develop a sandwich ELISA system, where WFA is immobilized to capture CC-specific glycan moiety and MY.1E12 is used as the detection probe (for experimental details, see Patients and Methods). The assay was performed to distinguish CC (n ¼ 30, comprising intra and extra hepatic CC) from benign duct disease bile with hepatolithiasis (n ¼ 16), common bile duct stones (n ¼ 9), gallbladder stones (n ¼ 10), cholangiectasis (n ¼ 1), bile duct stenosis (n ¼ 1), and autoimmune pancreatitis (n ¼ 1). S/N ratios were determined with normal sera of healthy volunteers as a negative control (n ¼ 3). The values were significantly higher in patients with CC than in those with benign bile duct disease (P ¼ 0.0004; Fig. 5A). To evaluate the performance of the ELISA system in discriminating CC from benign bile duct diseases, we analyzed the ROC curve. The AUC ¼ 0.86 at a cutoff value of S/N ¼ 6.64 (solid line in Fig. 5C), providing the best separation (i.e., minimal false-negative and  false-positive results). We correctly identified 27 of 30 patients with CC (90.0% sensitivity) and excluded 29 of 38 patients with benign duct disease (76.3% specificity). For comparison, a conventional format of antibody-antibody sandwich system, i.e., MY.1E12-MY.1E12, was also performed. However, none of the obtained scores was better than those of the present WFA-MY.1E12 system: (P ¼ 0.0138). The sensitivity was 56.7%; specificity, 84.2%; and AUC, 0.75 at a cutoff value of S/N ¼ 9.36 (Fig. 5B and broken line in Fig. 5C). These results are better than those produced by biliary cytology (Table 3)."
            ],
            "subsections": []
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Early and correct diagnosis of CC is still an urgent issue even with the aid of modern detection technologies. Although many CC-associated serological markers, such as CA19-9, 6,8,9 MUC5AC, 33 and Mac-2-binding protein, 7 have been proposed, none of them has satisfactory sensitivity. With special focus on cancer-associated glyco-alteration, we recently proposed a robust strategy to develop high performance glycoprotein biomarkers using advanced technologies of glycopropteomics. 17,34 Along with the established strategy, we attempted differential glycan analysis using tissue sections containing both normal BDE and ICC lesions from the same patients. An ultrasensitive glycan profiling technology, lectin microarray mined WFA 30 as the most promising probe to differentiate ICC from normal BDE with a significant P value (<0.0001). Subsequent histochemical analysis of 150 ICC sections using biotinylated WFA could confirm the strong expression of WFA-reactive glycans specific in cancerous lesions.",
                "The main aim of this study is to develop a robust diagnostic system targeting molecular bio-markers involved in body fluids. We have chosen bile as the primary target, because the bile is in direct downstream of CC, and thus, is expected to contain much higher amounts of candidate marker molecules than in serum. In this study, we hypothesized that sialylated MUC1, established as an antigen for MY.1E12 monoclonal antibody and known to express well in BDE and CC cells, is one of the glycoproteins that carries the WFA-reactive glycans. As expected, staining with both MY.1E12 and WFA merged well in the cancerous lesions in ICC tissue sections (Fig. 3). In addition, the presence of sialylated MUC1 carrying WFA-reactive glycans was confirmed by western blot analysis using WFA-enriched bile fractions (Fig. 4). Therefore, it is conclusive that sialylated MUC1 is a carrier protein of WFA-reactive glycans in both ICC tissues and bile fluids. Thus, we developed a novel sandwich ELISA system that combined WFA and MY.1E12 to target bile samples (30 cases of CC and 38 cases of benign bile duct diseases). The sensitivity (90.0%) and AUC (0.86) obtained were superior to those produced by previous methods. Biliary cytology gave only poor sensitivity (10/18; 55.6%), though it is performed as a routine test in the present diagnosis of biliary tract carcinoma. The result of CA19-9 using a commercial kit and the same specimens for comparison was also unsatisfactory: i.e., sensitivity (62.1%), specificity (51.4%), and AUC (0.56) (Matsuda et al., detailed data unpublished). On the other hand, the obtained specificity of the present assay was relatively low (76.3%). However, there remains possibility that nine cases of the ''false positive'' among the present group of benign duct diseases (gallbladder stone, common bile duct stone and hepatolithiasis) included ''premalignancy'' with serious inflammation. In fact, our preliminary histochemical experiments detected coincidental expression of WFA-reactive glycans and sialylated MUC1 in premalignant conditions (data not shown). For this validation, further evaluation of bile samples from patients with other types of benign diseases, such as primary sclerosing cholangitis and primary biliary cirrhosis, is needed.",
                "Another important result obtained in this study is that WFA staining could also distinguish ICC from HCC elements in the combined type of HCC-ICC (100% accuracy as far as 10 specimens were examined). If WFA staining works so perfectly for ICC-HCC discrimination, it should be of great clinical value, because this task is quite difficult in conventional pathology.",
                "Moreover, the combined type of HCC-ICC is mostly fatal, and the cure for ICC differs substantially from that for HCC: whereas radiotherapy is effective for HCC, ICC is resistant. 35,36 Therefore, the only effective cure for ICC is presently surgical resection at an early stage. For this purpose, several markers or diagnostic systems have been reported. Both cytokeratin families and epithelial cell adhesion molecule (EpCAM) expressed in the BDE and ICC can be used to distinguish ICC from HCC immunohistochemically. [37][38][39][40] Quantitative real-time polymerase chain reaction using several genes can also distinguish ICC from HCC. 41 Although these approaches target multiple proteins or genes, the proposed WFA-staining approach is simple and sensitive, and combination with the former methods is also possible. Analyzing the expression of WFAreactive glycans together with these known markers should produce more accurate and convenient methods for diagnosis. To evaluate the usefulness of the WFAstaining method, increase in the number of combined type HCC-ICC specimens is inevitable.",
                "In summary, we demonstrated that our newly developed WFA-MY.1E12 sandwich detection ELISA is a high-sensitivity diagnostic method for CC using bile specimens. Because our new method has much higher sensitivity than biliary cytology, its inclusion in the routine testing for CC in biliary diagnosis is promising. A further validation study with a much larger cohort is the most necessary step to establishing the usefulness of testing for this glycoprotein marker. Structural analysis of glycans of WFA-associated MUC1 remains to be carried out in a more rigorous manner. This should give useful clues to design a more specific probe (i.e., antibody) than the WFA lectin used in this study. In this respect, our ultimate goal is to develop a robust diagnostic system directly applicable to serum. Values are expressed as the ratios relative to those in healthy volunteer sera. As disease controls, samples from patients with one of three benign biliary tract diseases (gallbladder stone, common bile duct stone, and hepatolithiasis) were compared with samples from patients with CC. The statistical scores differentiated CC from benign diseases (P ¼ 0.0004). (B) Results of the conventional sandwich ELISA system with MY.1E12 and biotinylated MY.1E12. This assay shows significant differences between samples from patients with benign diseases (P ¼ 0.0138). However, the significance level was lower in this assay than in the new heterogeneous sandwich system using WFA and MY.1E12. The averages and medians of the samples are represented as the circles and bars, respectively. (C) The ROC curves obtained for the WFA-MY.1E12 (solid line) and MY.1E12-MY.1E12 (dashed line) systems to differentiate patients with CC from those with benign bile duct disease. WFA-MY.1E12 had a higher sensitivity (90.0%) at a cutoff value of 6.64 and a good AUC score (0.86). The sensitivity, specificity, and AUC score of MY.1E12-MY.1E12 were 56.7%, 84.2%, and 0.75, respectively. Eighteen bile specimens were analyzed by both WFA-MY.1E12 and biliary cytology. Biliary cytology was diagnosed as positive class V and negative class I, II, or IIIa. Classes IIIb and IV were diagnosed as suspect. In WFA-MY.1E12, the diagnosis was made using the cutoff value obtained (7.59) in the ROC curve analysis (Fig. 5).",
                "assistance. We also thank Y. Itakura and M. Sogabe for helpful discussion."
            ],
            "subsections": []
        }
    ]
}