{
    "id": "https://semopenalex.org/work/W2608623672",
    "authors": [
        "Paul S. Fennell",
        "Jason P. Hallett",
        "T.M. Lammens",
        "Agnieszka Brandt-Talbot",
        "James Weale",
        "Florence J. V. Gschwend",
        "B.S. Tan"
    ],
    "title": "An economically viable ionic liquid for the fractionation of lignocellulosic biomass",
    "date": "2017-01-01",
    "abstract": "Cost-effective fractionation (pretreatment) of lignocellulosic biomass is necessary to enable its large-scale use as a source of liquid fuels, bio-based materials and bio-derived chemicals.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "The vast majority of today's transportation fuels and organic chemicals are derived from fossil resources, mainly from oil. However, the continued use of oil-based fuels is unsustainable, since their utilisation currently contributes roughly a third of anthropogenic CO 2 emissions and is hence a driver of dangerous climate change. Wood or lignocellulosic biomass is an abundant, renewable and offers potentially carbon-neutral alternative to petroleum. 1 Biomass accounts for around 12% of the global energy supply today, but is mostly used for lowgrade heat applications. 2 In order to replace petroleum, the utilisation of lignocellulose needs to be evolved. 3,4 One option is to separate the main components of wood and valorise them individually through chemical and biological processing.",
                "Lignocellulose is a natural composite material, made of roughly 65% sugar polymers (40% cellulose and 25% hemicellulose), 25% lignin and ca. 10% other, minor components. The material is recalcitrant towards mild chemical and biological modification and thus requires a pretreatment step before the sugars contained in the biomass can be processed biologically (fermentation) or chemically. Several chemical and physical pretreatment methods have been proposed, including the use of steam, 5 ammonia, 6 dilute acid, 7 the organosolv process, 8 and, most recently, ionic liquids 9 liquid organic salts with tuneable solvent properties. 10 Pretreatment technologies such as dilute (aqueous) acid and steam explosion enable the hydrolysis of the sugar polymers without prior removal of lignin. However, pretreatment using a fractionative, lignin-extracting solvent has a number of advantages, including lower enzyme loadings in the saccharification step, due to reduced non-productive binding of enzymes, 11 and higher saccharification yields for hardwoods and softwoods due to reduced steric hindrance from lignin † Electronic supplementary information (ESI) available: Details of fractionation, compositional analysis, saccharification assay procedures and XPS analysis of the insoluble ash, GPC molecular weight profiles and unedited HSQC NMR spectra, numerical values for mass balances, assumptions for the economic estimations. See DOI: 10.1039/c7gc00705a ‡ Both of these authors contributed equally to this work.",
                "adhering to the cellulose. 12 Additional benefits are higher titres of fermentation products due to the absence of carbohydrate and lignin derived inhibitors, 13 smaller reactors for hydrolysis and fermentation, and a lignin that is more suited for further valorisation. 14 Ionic liquid pretreatment is a comparatively new pretreatment technology, offering deconstruction of lignocellulose with low melting point salts. The use of ionic liquids as biomass processing solvents started with the discovery of cellulose dissolving ILs, 15 followed by investigations into the use of the identified ILs as alternative solvents for the spinning of man-made cellulose fibres (e.g. the Ioncell-F process). 16 Another area that has shown promise is the transformation of sugars into the platform chemical HMF, where ionic liquids excel through high yields and selectivities. 17 A number of review papers have summarised the research efforts into applying ILs in chemical processing 10,18 as well as bio-processing in particular. 19 Two distinct strategies for the ionic liquid pretreatment of lignocellulosic biomass are under development: 9 one strategy is the disruption of the lignocellulose composite including the crystalline cellulose (dissolution pretreatment), which evolved directly from cellulose dissolution using ionic liquids. [20][21][22][23] The second, more recent, strategy uses ionic liquids to fractionate lignocellulose through dissolving lignin and hemicellulose, but leaving behind the cellulose as a filterable solid (ionoSolv pretreatment). [24][25][26] This is similar to organosolv processing 8 but takes place at atmospheric pressure. Distinct features of ionic liquid based pretreatment compared to other pretreatment options are low process pressures, 27 reduced friction/ abrasion 28 and novel product separations. 29 The dissolution pretreatment relies on a relatively small number of ionic liquids containing highly hydrogen-bond basic anions (required for cellulose solubility), the most widely used solvent being 1-ethyl-3-methylimidazolium acetate, [C 2 C 1 im][OAc] or [Emim][OAc]. This and similar ionic liquids dissolve all or most of the lignocellulose without substantial delignification or hemicellulose removal. The lignocellulose dissolving ionic liquid disrupts the composite's extended hydrogen-bonding network, including the hydrogen bonds in the highly crystalline cellulose fibrils. The material regenerated after treatment with [Emim][OAc] exhibits high yields after enzymatic saccharification (ca. 50 times higher enzymatic hydrolysis rate) 29,30 due to increased accessibility of the sugar polymers and low cellulose crystallinity. 31 This works well even for recalcitrant feedstocks such as softwood. 32 However, the required ionic liquids suffer from a number of drawbacks, such as high cost ( price estimates for [Emim][OAc] range from $20-101 kg -1 ), 33 low thermal stability 34 and low tolerance to moisture. 35 To be effective at dissolving cellulose, these ionic liquids require low water contents that are at odds with the high moisture content of freshly harvested biomass (up to 50%) and the ionic liquids' high affinity for water. 36,37 The ionoSolv pretreatment dissolves lignin and hemicellulose in the presence of substantial quantities of water, leaving a cellulose-rich solid or pulp. 26 Although the cellulose remains crystalline, saccharification yields are boosted to 70-90% of the theoretical maximum due to exposing of the cellulose fibrils. Previous studies have shown that addition of 10-40% water to ionoSolv ILs is needed for effective fractionation to occur. 24,26 The hypothesis is that the water is needed for (1)  hydrolysis reactions that are required to separate the components from each other (e.g. hydrolysis of lignin ether linkages, ferulic acid ester linkages and glycosidic hemicellulose linkages), (2) to prevent sulfation reactions between hydrogen sulfate and hydroxyl groups in the biomass, and (3) to reduce the viscosity of the solvent.",
                "The use of the ionic liquid 1-butyl-3-methylimidazolium hydrogen sulfate, [C 4 C 1 im][HSO 4 ], was reported by our group in 2011, 24 followed by application of its protic analogue 1-butylimidazolium hydrogen sulfate, [HC 4 im][ HSO 4 ]. 26 Both demonstrated high effectiveness. For example, 1-butylimidazolium hydrogen sulfate achieved up to 90% fermentable glucose after enzymatic saccharification of the cellulose-rich Miscanthus pulp. Effective application of a protic ionic liquid in the pretreatment of lignocellulose was a major boost to economic viability of ionoSolv pretreatment, as these ionic liquids are inevitably cheaper than their peralkylated analogues. This is due to replacing the conversion of the base into the cation by an alkylation reaction and a potential subsequent ion exchange step with the simple mixing of an acid and a base. A recent techno-economic analysis of the bulk-scale synthesis of 1-methylimidazolium hydrogen sulfate demonstrated that alkylimidazolium hydrogen sulfate water mixtures can be made available for $2.96-5.88 kg -1 , 38 which is well below estimates of future bulk prices of frequently investigated ionic liquids: $40-81 kg -1 (ref. 39; the price was calculated based on 2002 estimates in the source, an exchange rate of 1.1 $ € -1 and a cost index ratio 2012/2014 of 1.47), or 5 to 20 times of the price of organic solvents. 18 It was previously shown that the anion often determines the solvation chemistry taking place in the ionic liquid, with the cation having a secondary effect. 9 To assess whether further reductions in ionic liquid solvent cost were possible through using cheaper cation precursors, a recent study explored the suitability of protic hydrogen sulfate ionic liquids made from a number of low-cost alkylamines. 25 The study not only concluded that triethylammonium hydrogen sulfate, [H(C 2 ) 3 N][HSO 4 ] or [TEA][HSO 4 ] (Fig. 1), exhibited the best performance under the conditions of the screening, but demonstrated that the number and length of alkyl chains on the ammonium cation plays a crucial role for pretreatment effec- tiveness. This is very promising, as triethylammonium hydrogen sulfate water mixtures can be produced at bulk scale for as little as $1.24 kg -1 . 38 This price is similar to that of common organic solvents such as acetone and toluene, addressing one of the greatest concerns raised in conjunction with applying ionic liquids in large volumes, their perceived high cost.",
                "Ionic liquid cost is not the only crucial consideration; their recovery and recycling are also important. 46 The solvent cost determines how much solvent loss and purge can be tolerated before process economics are impacted excessively. 46,47 For example: if 99% of the ionic liquid was recycled, a solvent priced at $50 kg -1 ( price selected based on the study by Klein-Marcuschamer et al.) 47 would incur a replacement cost of $5.56 per litre of ethanol (assuming 300 L per dry ton of biomass), while an IL at $1.24 kg -1 would incur $0.13 per litre. These values represent 1400% and 32% of the current ethanol selling price, respectively ($0.77 L -1 , NASDAQ). Despite this, to date, only a limited number of studies have investigated the reuse of ionic liquids after pretreatment, [48][49][50][51][52][53] all of them applying the dissolution pretreatment and only probing the recycling at low biomass loadings (5% or less), which is not representative of industrial requirements (10% or more is desirable).",
                "Despite the low cost of [TEA][HSO 4 ], a literature review revealed that application of triethylammonium hydrogen sulfate as a solvent did not receive significant attention prior to the work by George et al. A study from 2007 reported on the physical solvent properties of [TEA][HSO 4 ] 40 and one published in 2008 reported the use of the organic salt as an additive for catalysing Fisher esterifications. 41 Other triethylamine-acid mixtures have been utilised for a variety of applications. [TEA] formate has been used as hydrogen donor in the Pd catalysed reduction of aromatic triflate, 42 nitro, nitrile and halo 43 groups to aromatic hydrocarbons as well as the reduction of acetylenes to cis-monoenes and the hydrogenolysis of tertiary allylic amines. 44 Furthermore [TEA] acetate and phosphate salt have been shown to have strong stabilizing properties for the protein α-chymotrypsin. [TEA] acetate was indeed found to be a refolding additive for the enzyme. 45 The feedstock used in the present study was Miscanthus x giganteus. Miscanthus is a promising high-yielding biorefinery feedstock. 9 Its cell wall structure and composition are representative of a large number of industrially significant lignocellulosic crops, including agricultural residues such as wheat straw, corn stover and sugarcane bagasse. In addition, a number of studies concerned with the pretreatment of Miscanthus with ionic liquids and other methodologies have been published, 20,24,26 providing suitable comparative data.",
                "The majority of aspects investigated in this work have not been previously considered by any other study. Examples are variation of the pretreatment time, recovery and characterisation of lignin isolated after [TEA][HSO 4 ] pretreatment, as well as solvent recycling, biomass component mass balances and co-product recovery for the ionoSolv pretreatment in general."
            ],
            "subsections": []
        },
        {
            "title": "Results and discussion",
            "paragraphs": [
                "In this study, virgin Miscanthus x giganteus biomass was pretreated with solutions of [TEA][HSO 4 ], with 20 wt% water as an additive, at 1 : 10 solids loading and a temperature of 120 °C for various lengths of time. In a separate experiment, the solution was recycled four times at a pretreatment time selected after considering the time course results. The pretreatment resulted in fractionation of the biomass into the following components: (1) a cellulose rich material, (2) a precipitated lignin and (3) a recovered ionic liquid solution containing a range of solutes. The workflow schematic diagram for the experiment is shown in Fig. 2. The resulting two materials and the ionic liquid solution were analysed in detail, for the first pass time course and also for the recycling experiment. These data were then used to generate a preliminary techno-economic analysis."
            ],
            "subsections": [
                {
                    "title": "Cellulose rich material ( pulp)",
                    "paragraphs": [
                        "Yield and compositional analysis. The cellulose rich pulp is the undissolved material recovered from the pretreatment after washing, and is the desired intermediate for isolating cellulose as a material or producing glucose via saccharification. Fig. 3 shows the yield of the pulp at different pretreatment times at 120 °C and a 1 : 10 solids loading as well as its composition (numerical data is shown in Table S1 in the ESI †).",
                        "The data demonstrate that dissolution of material from the virgin biomass mainly occurred during the initial 4 h of the treatment, with little change in pulp yield and composition from 8-24 h.",
                        "Compositional analysis of the pulp material confirmed the extraction of lignin and hemicellulose into the ionic liquid solution as the major reason for the mass loss relative to the initial biomass weight. Hemicellulose sugars were barely detected after long pretreatment times (24 h), while lignin removal fell from ca. 90% at 16 h to below 80% at 24 h. The amount of glucan remaining in the pulp did not change significantly throughout the pretreatment (ca. 85-95% relative to the glucan content in the initial biomass), confirming that cellulose was not significantly hydrolysed by the ionic liquid under the applied conditions. It should be noted that some of the glucan in Miscanthus is part of the hemicellulose and present as mixed linkage glucans, 54,55 suggesting that nearquantitative cellulose recovery in the pulp was achieved. It should also be noted that the majority of the hemicellulose and lignin extraction occurred within the first 4 h, suggesting that short pretreatments can be used, even at the relatively mild temperature of 120 °C.",
                        "Enzymatic saccharification. Saccharification of the celluloserich pulp with cellulolytic enzymes is a key measure of pretreatment effectiveness. A separate study into the material properties of the cellulose retained in ionoSolv pulp is underway and will be published shortly. We depict the saccharification yields in Fig. 4 as a percentage of the sugars contained in the untreated biomass. The saccharification yields achieved after fractionation with the [TEA][HSO 4 ] solution are shown for both xylose and glucose. The part that was not saccharified either dissolved into the ionic liquid solution during pretreatment or was present in the pulp but not accessible to the enzymes.",
                        "The optimum glucan availability, 77%, was achieved after 8 h of pretreatment; this is 1.7 times the saccharification yield achieved in the previous screening study (45%). 25 The glucose yield peaked at around 8 h, something that was not observed in our previous study utilising 1-butyl-3-methylimidazolium hydrogen sulfate under equivalent conditions, where glucose yields remained high even at extended treatment times. 24 We speculate that the decline in saccharification yield at longer pretreatment times is caused by re-deposition of non-carbohydrate material onto the exposed cellulose fibrils, 56 and evidence for this will be discussed later. We note that the best saccharification yield was broadly comparable to yields obtained in the past with imidazolium based hydrogen sulfate ionic liquids, 24,26 although enzymatic saccharification yields after [TEA][HSO 4 ] pretreatment were slightly lower overall. This is possibly due to a higher residual lignin content (ca. 20%) in the [TEA][HSO 4 ] pulp, which could include (pseudo)lignins that inhibit saccharification. It was surprising that the maximum glucose yield was achieved at the same pretreatment time (8 h at 120 °C) for both the triethylammonium and the 1-butyl-3-methylimidazolium hydrogen sulfate based solvents, 24 given that the viscosity 57 and acidity 58 of the solutions are likely to be different.",
                        "Other pretreatments have achieved comparable sugar yields. AFEX pretreated Miscanthus x giganteus released 96% of the glucose after 7 days of enzymatic hydrolysis, 59 and a 64% yield was achieved after 96 h of enzymatic hydrolysis of Miscanthus pretreated by acid pre-soaking followed by wet oxidation using hydrogen peroxide combined with steam explosion. 60 83% was released after 72 h of enzymatic hydrolysis of Miscanthus x giganteus after dilute acid pretreatment, 61 and 78-98% cellulose-to-glucose conversions was achieved after 48 h saccharification following Organosolv fractionation. 62 This demonstrates that pretreatment with low-cost ionic liquids can rapidly achieve saccharification yields similar to those with other ILs or non-IL pretreatment technologies.",
                        "The maximum xylose yield was achieved at around 2 h of pretreatment, when the xylose yield became limited by hemicellulose removal, as can be seen by comparison with the pulps' xylose content, shown in Fig. 3. The fact that xylan and glucan yields cannot be optimized simultaneously in the presence of acidic solvents has been reported previously 24,27,63 and indicates that the ionoSolv pretreatment is best utilized for producing high purity glucose streams rather than for maximizing pentose yields.",
                        "Fig. 5 highlights the stability of glucan recovery in the pulp throughout the 24 h pretreatment course, compared to a very pronounced hemicellulose removal. The high glucan recovery may be linked to the moderate acidity of the ionoSolv solution and the fairly mild treatment temperature employed in this study. Fig. 5 also demonstrates that the saccharification yield tracked the glucan recovery between 8 h and 16 h, with the saccharification yield being somewhat lower than the glucan recovery."
                    ],
                    "subsections": []
                },
                {
                    "title": "Lignin",
                    "paragraphs": [
                        "In previous studies, we demonstrated that lignin dissolves into the ionoSolv solution during the pretreatment and can sub-  sequently be precipitated by diluting the solution with water. 24,26 This is similar to isolating Organosolv lignin. 64 After washing and drying the precipitate, the lignin yield can be determined 24,26 and the precipitate can be characterized using a number of techniques. 65 Delignification and lignin yield. Fig. 6 shows the yields for the precipitated lignin and relates them to the lignin removal/ delignification. Lignin yield and the delignification are presented relative to the original lignin content in Miscanthus, and the saccharification yields are shown for comparison.",
                        "Fig. 6 demonstrates that precipitated lignin yield, delignification and saccharification yield loosely tracked each other during the time course experiment. This is distinct from cellulose swelling acetate-or chloride-based IL pretreatment, which rely on the disruption of the hydrogen-bonding network and hence can achieve high saccharification yields with only partial lignin removal. 32 Examining the curves more closely shows that delignification increased rapidly until 8 h, plateaued and then decreased slightly after 16 h, while the lignin yield increased between 0 and 16 h and also dropped slightly after 16 h. The maximum lignin yield was 82% at 16 h, which was only a little lower than the respective delignification (88%). The lignin yields reported here were similar or slightly higher than the yields observed previously with the protic imidazolium IL 1-butylimidazolium hydrogen sulfate (1 : 1 cation anion mixture). 26 The lignin yields were also higher than is often achieved with Organosolv fractionation, whose yields rarely exceed 50% 66 and often requires solvent acidification.",
                        "We note that the lignin yield reached a later maximum (16 h) than the delignification (4 h). The delayed maximum in lignin yield could be due to the coupling (condensing) of short, water-soluble lignin fragments in the ionic liquid solution, leading to the formation of higher molecular weight, insoluble lignin oligomers. 65 In addition, production of lignin-like polymers could be responsible for the late increase in the precipitate yield. Such polymers have previously been attributed to the formation of polymeric carbohydrate degradation products that are insoluble in acidic pretreatment solvents. Due to a lack of structural information for these poorly defined substance(s), they have been called pseudo-lignin, as occurrence is detected as acid-insoluble lignin during compositional analysis. 26 It is a limitation of the gravimetric compositional analysis assay that it does not differentiate between acid-insoluble lignin, re-condensed lignin and other acid-insoluble polymers.",
                        "Similar to the saccharification yield, we observed that the delignification and lignin yield decreased at long pretreatment times. A drop in delignification is equivalent to the lignin content in the pulp increasing. This suggests that a lignin-like substance became associated with the pulp during the later stages of [TEA][HSO 4 ] pretreatment. This deposition of condensed lignin or pseudo-lignin on the pulp surface could explain the marked reduction of the extent of enzymatic saccharification observed after 8 h treatment time. Although the involvement of carbohydrate-derived pseudolignin in reducing saccharification yield has not been proven conclusively, some evidence has been presented by Hu et al. 67 Further investigations into the chemistry of dissolved carbohydrates and lignins under acidic conditions are urgently required.",
                        "Characterisation of the isolated lignin. Since the ionoSolv pretreatment is a lignin extraction, and saccharification yields are strongly affected by the presence of lignin, a fuller analysis of the lignin chemistry was carried out. We utilised techniques previously applied to Miscanthus lignin isolated using an [HC 4 im][HSO 4 ] water mixture. 65 Miscanthus giganteus lignin has been identified as a G/S/H (grass) type lignin, containing around 52% guaiacyl (G), 44% syringyl (S) and 4% hydroxyphenyl (H) units, approximately 0.4 β-O-4 linkages and ca. 0.1 p-coumarate ester units (PCA) per aromatic ring (structures depicted in Fig. 7). 68 Linkages and subunit composition of isolated lignin. The lignin isolated as part of the time course study was characterized by 1 H- 13 C heteronuclear quantum coherence (HSQC) NMR spectroscopy in order to detect the most common linkages and the subunits present (Fig. 7).",
                        "Fig. 8 highlights key parts of the HSQC spectra for lignin isolated with the [TEA][HSO 4 ] water mixture at an early stage (1 h), a mid-stage (4 h) and a late stage (72 h). Both the aromatic and side chain regions are highlighted. The side chain region shows the three most common linkages, β-O-4 ether (A),  β-β (resinol, B) and β-5 ( phenylcoumaran, C), while the aromatic region shows the most common unsaturated subunit structures, syringyl (S 2,6 , S cond. ), guaiacyl (G 2 , G 5 , G 6 , G cond. ), p-coumaric acid (PCA 2,6 , PCA β ) and p-hydroxyphenyl (H 2,6 ).",
                        "We also observed peaks at 7.7/128, 7.7/131 ppm and 4.1/67 ppm, which we assign to the plasticiser bis(2-ethylhexyl) phthalate (DEHP), based on the HSQC NMR and also a complementary Heteronuclear Multiple Bond Correlation (HMBC) NMR spectrum (the latter not shown). We presume that the plasticizer was leached from the seals of the pressure tubes used for heating the biomass with the ionic liquid and subsequently precipitated with the lignin fraction during antisolvent addition.",
                        "Fig. 9a shows the abundance of the linkages obtained using volume peak integration. The integration was carried out after confirming that the G 2 + G cond integral remains stable relative to the internal standard p-xylene which was added to some samples (the maximum amount of change to the integral size seen over a 23 hour period of time was 6.6%). It can be seen that 80% of the β-O-4 linkages present in the earliest lignin precipitate (arguably the closest to a native lignin structure) were broken or modified after 24 h. The decreased intensities of signals assigned to β-β and β-5 linkages indicate that these linkages were also modified. As they contain C-C bonds, it is unlikely that the linkages are truly broken and more likely that they are chemically altered. Evidence exists that the five-membered tetrahydrofuran rings contained in both structures can be hydrolysed and substituted. 69 The side chain region further contained signals from residual carbohydrates, which disappeared over time, resulting in a carbohydrate-free lignin after 4 h. Fig. 9b shows how the relative abundance of selected unsaturated/aromatic structures changed with pretreatment time. Similar to findings for [HC 4 im][HSO 4 ] lignin, the H content of the precipitated lignin increased over time while the PCA content decreased in a complementary fashion, suggesting that PCA is converted to H during pretreatment in [TEA][HSO 4 ]. 65 As mentioned above, hydrolysis of the lignin polymer is thought to compete with lignin condensation under certain conditions. We previously concluded that the decrease of G 6 signal intensity relative to G 2 is an indication of lignin condensation taking place in the acidic ionic liquid solutions. 65 This has now also been observed for [TEA][HSO 4 ], and is further supported by our observation that the abundance of condensed S and G units increased over time (Fig. 9b).",
                        "Subunit composition and linkages of lignin remaining in the pulp. We also performed HSQC NMR analysis on the solid remaining after saccharification, the 'post-hydrolysis solid' (Fig. 10), in order to characterise the lignin that was not removed from the pulp. The post-hydrolysis solids obtained at an early time point (2 h of pretreatment) and at a late time point (24 h of pretreatment) were compared.",
                        "For the 2 h post-hydrolysis lignin, the HSQC NMR spectrum contained signals typical for early stage lignin (no noticeable G cond. , S cond. or H peaks, significant PCA signal). A substantial amount of carbohydrates was also dissolved from the pulp into the DMSO-d 6 that was used to dissolve the post-hydrolysis lignin, suggesting that carbohydrates may still be bound to the lignin via lignin carbohydrate complexes at the early stages. The spectrum of the 24 h post-hydrolysis lignin showed signal intensity in the area of the G 5 /H 3,5 /PCA 3,5 peak and the methoxy signal but barely any signals that could be assigned to linkages or other lignin subunits. This confirms that the pulp lignin after long pretreatment consisted mainly of pseudo-lignin and highly condensed lignins, which contain few aromatic or oxygenated C-H units.",
                        "Lignin molecular weight. The lignin isolated during the time course study was further subjected to GPC analysis (Fig. 11 and Table S2, Fig. S1 in the ESI †). As can be seen from Fig. 11a, the molecular weight of the isolated lignin (both number average molecular weight, M n , and weight average molecular weight, M w ) decreased in the first 4 hours of pretreatment. The M n decreased from 1600 to 1000 Da, while the M w decreased from 4600 to 3800 Da. The shortening of the Fig. 7 Major linkages and subunits present in native lignin. Subunits abbreviations and carbon atom numbering correspond to the labels used for assigning HSQC NMR spectra. lignin was previously observed by us in lignins isolated with another acidic ionic liquid solution. 65 Reduction of the lignin molecular weight is common during pretreatment and has been observed for Organosolv lignins, although the Organosolv lignins usually have a higher molecular weight. 66,70 This finding and the reduction of ether linkage signals observed by HSQC NMR spectroscopy indicate that the lignin chains were progressively shortened by hydrolysis of ether bonds.",
                        "We note that the decrease in M w was followed by an increase to around 5400 Da beyond 4 h pretreatment time. The M n changed to a lesser extent at longer pretreatment times, remaining at around 1200 Da. The different trends for M n and M w , highlighted by an increasing polydispersity index (PDI), indicate that there was a small but growing fraction of higher molecular weight polymers in the lignin isolated after longer pretreatment times. This supports our hypothesis that part of the dissolved lignin became insoluble in the ionic liquid solu- tion as pretreatment time increased, until some of it redeposited onto the cellulose. Further evidence for this can be found when comparing the actual molecular weight profiles (Fig. 11b and S1 in the ESI †). Lignin obtained after 1 hour of pretreatment had a shoulder of high M w in the gel permeation chromatogram which was not present in the 4 h chromatogram; this disappearance is reflected in the decrease in M w at 4 h compared to at 1 h. The high molecular weight shoulder reappeared at longer treatment times and was almost the same size as the low M w peak at 24 hours of pretreatment. Lignin isolated after 72 hours of pretreatment however did not exhibit this shoulder any more, which may be due to the high M w (condensed) polymers becoming too large to be solubilized in the IL, hence precipitating onto the pulp surface during the heating or pulp washing steps rather precipitating during antisolvent addition."
                    ],
                    "subsections": []
                },
                {
                    "title": "Solutes in the ionic liquid solutions",
                    "paragraphs": [
                        "Compositional analysis of the cellulose-rich pulp in this and previous ionoSolv studies have shown that the majority of the hemicellulose dissolves into the ionic liquid solution. In addition, HSQC NMR spectra presented here and previously 65 show that hemicellulose sugars do not precipitate with the ionoSolv lignin, apart from during the very early stages of pretreatment. We have also shown previously that significant amounts of xylose and arabinose extracted from Miscanthus can be found in the ionic liquid solution as monomers or furfural. 24 This is unsurprising, as Miscanthus hemicellulose or matrix polysaccharides are chiefly composed of xylose, with arabinose, galactose, glucose, acetic acid and glucuronic acid as minor components. 55 It is also known that xylose and arabinose dehydrate to furfural under acidic conditions, while glucose and galactose dehydrate to 5-hydroxymethylfurfural (HMF), which can hydrolyse further to levulinic and formic acids (see Fig. 12 for mechanism). In comparison, acid (dilute sulfuric acid) as well as base (ammonia, lime) catalysed pretreatment of corn stover was found to result in the formation of significant amounts of acetic and formic acid and smaller amounts of lignin derived 4-hydroxycoumaric acid and ferulic acid. Acidic conditions further lead to the formation of furfural and, to a lesser extent, 5-HMF, levulinic acid, lactic acid and itaconic acid. 71 We hence analysed the ionic liquid solutions created in this study for xylose, arabinose, glucose, acetic acid, furfural and HMF, and the HMF hydrolysis products levulinic and formic acid (Fig. 13). This was done by HPLC analysis of the ionic liquid solutions, either immediately after the heating step or after lignin precipitation.",
                        "Fig. 13 shows the amount of solutes detected in the ionic liquid solution during the pretreatment. Up to 4 h, the amount of hemicellulose (as monomeric xylose/galactose and arabinose) detected in the liquid phase increased.",
                        "The maximum amount of xylose detected in the liquor was ca. 10% of the total biomass and ca. 50% of the xylan, which occurred at 4 h. This maximum coincided with the pulp xylan content dropping significantly according to the compositional analysis and hence becoming limiting for the enzymatic saccharification. After 4 h, the xylose concentration in the IL solution decreased, which must have been due to more xylose being consumed in dehydration and other side reactions than xylose being extracted from the biomass into the ionic liquid solution.",
                        "The furfural content in the liquor increased until 12 h and then remained fairly stable, indicating that furfural, too, was not only created but also consumed, the latter through reactions such as polymerisations, which could produce the aforementioned pseudolignins. 74 It is noteworthy that furfural is not an undesired by-product, but can be an interesting biorefinery product that has a high value today, albeit in a limited and mature market. Furfural has the potential to be converted into a number of chemical products such as fuels, solvents and fine chemicals, 75 which can become attractive if furfural can be produced at lower cost than is possible with current processes.",
                        "Fig. 13 further shows that another major solute in the ionic liquid solutions was acetic acid. The acetic acid concentration It is noteworthy that we only detected small quantities of glucose, traces of HMF, and no levulinic acid in the ionic liquid solution. The small amounts of glucose in the liquor agree with the high retention of glucan in the cellulose-rich pulp. As there was some loss of glucose from the pulp over time, the stable glucose content in the ionic liquid solution suggests that the dissolved glucose reacts to form HMF and probably other products. The amount of HMF detected in the IL solution increased slightly with pretreatment time; nevertheless the stable HMF concentration indicates that the rate of HMF formation was approximately equal to the rate of conversion into further degradation products. Since levulinic acid was not detected, the major pathway of HMF reactivity in the IL solution appears to be humin formation, and this is consistent with the previously reported absence of levulinic acid formation from HMF in hydrogen sulfate ionic liquids. 17 Similar to this, dilute acid and Organosolv pretreatment of Miscanthus also resulted in the release of xylose (up to 15 mg g -1 for dilute acid and up to 10 mg g -1 for Organosolv) and arabinose into the ethanol-water mixtures and conversion of the dissolved sugars into furans. 62 We also carried out HPLC analysis of the ionic liquid solution after lignin precipitation and drying of the ionic liquid (Fig. S2 in ESI †). The analysis revealed that the furfural and acetic acid were removed completely during work-up. We speculate that the removal of the volatile fraction from the ionic liquid happens during concentration of the ethanol ionic liquid washes and during removal of the water that had been added during lignin precipitation. The amount of sugar monomers found in the reconstituted solution, in particular xylose, was very similar to the fraction of sugar monomers found directly after pretreatment, suggesting that the lignin isolation and the subsequent drying of the ionoSolv solution (under vacuum at 40 °C) did not dehydrate or otherwise alter the dissolved sugar monomers."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mass balances for time course experiments",
                    "paragraphs": [
                        "The comprehensive data set of this study allows us, for the first time, to show mass balances for the lignin, glucan and hemicellulose fractions. Mass balances are important when performing techno-economic analyses and carbon tracking. It is also crucial for holistic utilisation of the biomass, as minor fractions and by-products can have a significant impact on process validity. Fig. 14a demonstrates that mass recovery in the two solid fractions (solid pulp and solid lignin) was 70-80% at any point of the pretreatment time course, with 20-30% of the biomass dissolved inside the IL solution. We hence combined the findings from compositional analysis and measurement of the lignin yields with the solution analysis to better track the fate of the different biopolymers during pretreatment (Fig. 14b-d, numerical values listed in the ESI †).",
                        "Lignin mass balance. Lignin was found as a solid in the precipitate, as a portion of the solid pulp (residual lignin), and it can also remain dissolved in the ionic liquid solution (Fig. 14b). It has so far not been possible to identify and quantify dissolved lignin fragments in the ionic liquid solution. We therefore assume the lignin in solution to be the difference between the initial lignin content in the biomass and the sum of the lignin found in the two solid fractions. Lignin that remains in solution must have a sufficiently high solubility in water (the antisolvent), which is possible if the dissolved lignin is present as small hydrophilic fragments. The fragments have not been identified as part of this study, but this should be investigated in more detail by future research.",
                        "As Fig. 14b shows, roughly half of the lignin (46%) was still in the pulp after 1 h, which decreased to 12-14% at 4-16 h. The amount of precipitated lignin increased with pretreatment time, and at 24 h, the precipitate yield was roughly equivalent to the amount of extracted lignin. This could be an indication of complete lignin recovery or a sign that hemicellulose degradation products (humins) were increasingly incorporated into the precipitate. The amount of dissolved lignin decreased steadily after the first 2 h.",
                        "As our analytical methods do not allow for a differentiation between acid insoluble lignin and other acid insoluble organic material, it cannot be inferred that there were no dissolved lignin fragments in the liquor at 24 h of pretreatment. The chemical mechanism of lignin precipitate formation requires further investigation before conclusions can be drawn. Analysis and studies are currently underway in our lab to obtain more insight.",
                        "Glucan mass balance. Fig. 14c shows the glucan mass balance for the ionoSolv pretreatment time course. As the compositional data indicated, between 85 and 96% of the glucose was retained in the pulp. When analysing the IL solution, we found that most of the 4-15% of the dissolved glucan could not be detected as glucose, HMF or levulinic/formic acid and hence remained unaccounted for. It may exist in the form of soluble cellulose and hemicellulose oligomers, such as mixed linkage   glucans, or soluble degradation products, for example levoglucosan, neither of which could be identified by our HPLC method. The glucan may also have been converted into insoluble degradation products and been measured as part of the lignin precipitate. Conversion of glucose into unknown degradation products in hydrogen sulfate ionic liquids has been shown previously. 76 Hemicellulose sugar mass balance. Fig. 14d shows that the vast majority (97%) of the xylose and arabinose was accounted for at short pretreatment times (1 and 2 h). It was either present in the ionic liquid solution as monomers or furfural, or in the pulp as xylan polymers. The excellent mass balance closure at shorter treatment times indicates that the [TEA][HSO 4 ] solution may have limited solubility for sugar oligomers, as the mass balance could be closed well at 1 and 2 h while only detecting dissolved arabinose and xylose as monomers. Over time, the amount of accounted-for xylose decreased. At 24 h, over 50% of the hemicellulose could no longer be identified. The unaccounted-for hemicellulose fraction is likely to be in the form of degradation products, such as soluble and insoluble humins/pseudo-lignin, as discussed in the lignin and glucose mass balance sections.",
                        "Overall mass balance. Fig. 15 shows the overall mass balance for four selected time points. Between 10% and 20% of the untreated biomass remained unaccounted for at each time point. At short pretreatment times, this was largely due to less-than-quantitative lignin recovery, while at longer pretreatment times it was mainly due to at least half of the hemicellulose fraction becoming unaccounted for. As evidenced before, it is expected that part of the hemicellulose fraction is wrongly counted in the lignin mass balance at longer pretreatment times, due to its participation in the formation of pseudolignin.",
                        "The effect of ionic liquid acidity on the pretreatment outcome Protic hydrogen sulfate ionic liquids can be created with almost any acid : base ratio desired (and not just a stoichiometric 1 : 1 complex). In one of our previous studies, increased acidity was achieved by adding a slight excess of sulfuric acid, which was shown to accelerate pretreatment. 26 Adding more acid than amine has economic advantages, e.g. it would lead to reduced ionic liquid cost, using more of the less expensive sulfuric acid, and higher rates lead to lower reactor cost due to the higher through-put. Here, pretreatments were performed with [TEA][HSO 4 ] containing an excess of acid (9 mol% in this case) to investigate if the pretreatment process could be accelerated. The results from saccharification, compositional analysis and lignin precipitation are displayed in Fig. 16. It can be seen that generally similar pretreatment results were achieved at shorter pretreatment times, as reported previously. 26 However, we also observed more (unwanted) side reactions.",
                        "Yields. Maximum saccharification yields were achieved earlier than in the case of the standard 1 : 1 ionic liquid solution. A glucose release of 61% was obtained after 2 hours of pretreatment (Fig. 16) as opposed to 42% after 2 h without an excess of acid (Fig. 4). However the maximum glucose yield was below the maximum glucose yield of 77% found at 8 h for the IL with a 1 : 1 acid base ratio.",
                        "Since the glucan recovery was not substantially reduced at 2 h treatment with the excess acid solution (compared to 8 h treatment with the 1 : 1 mixture), we suspect that the redeposition of condensed material onto the cellulose surface was accelerated, resulting in an earlier decrease in saccharification yield when compared to the 1 : 1 IL solution.",
                        "Hemicellulose and lignin removal were also accelerated (Fig. 16). Hemicellulose removal was complete at 4 h compared to 24 h for the 1 : 1 mixture, and delignification peaked after 2 h, compared to 4 h for the 1 : 1 ionic liquid solution. The lignin yield continued to rise throughout the time course, with no maximum observed, and exceeded the delignification after 4 h of pretreatment (94% vs. 81%), pointing to the formation of pseudo-lignin, while an excess lignin yield was never achieved for the 1 : 1 mixture.",
                        "Lignin isolated with excess acid. To understand whether changes in the structure of the recovered lignin were affected by the presence of excess acid, HSQC NMR spectroscopy was applied again to quantify the relative abundance of different lignin functionalities. The relative size of the volume integrals are displayed in Fig. 17 17 show that the more acidic environment led to acceleration of ether bond cleavage. After 2 h of pretreatment with the more acidic ionic liquid solution, the recovered lignin contained fewer ether bonds than the lignin isolated after 8 h pretreatment without an excess of acid. Similarly, condensation after 1 to 2 h with the excess acid IL was similar to the condensation observed after 8 h with 1 : 1 IL, as evidenced by the relative peak intensities of S 2,6 and G 2 and their condensed counterparts.",
                        "Fig. 18 depicts the molecular weight parameters of lignins isolated after extraction with the excess acid IL solution (the molecular weight profiles are shown in Fig. S3 † and the numerical values given in Table S3 in the ESI †). The M n for excess acid lignin was not much different for the lignin isolated with the 1 : 1 solution. It is noteworthy, that the M n at 4 h was only slightly higher for the excess acid lignin than the M n for the lignin isolated with the 1 : 1 IL solution. The corresponding M w and PDI, on the other hand, were substantially higher for the excess acid lignin. The minimum M w for the 1 : 1 mixture was at 4 h and at 2 h for the excess acid pretreatment, the latter corresponding to the best saccharification yield achieved for the excess acid pretreatment time course.",
                        "The earlier minimum for M w together with the trends observed with HSQC NMR analysis indicate that both cleavage and re-condensation reactions proceed faster in the presence of excess acid. This suggests that lignin extraction, depolymerisation and recovery can be accelerated by additional acid, but the concomitant acceleration of pseudolignin formation and condensation reactions requires careful control of reaction conditions.",
                        "In summary, a (small) excess of acid could afford shorter pretreatment times while maintaining high saccharification yields, therefore decreasing ionic liquid and reactor costs. However, if applied excessively and poorly controlled, it may also lead to significant adverse effects, such as low saccharification yields due to wide-spread hemicellulose degradation and lignin condensation."
                    ],
                    "subsections": []
                },
                {
                    "title": "The effect of ionic liquid recycling",
                    "paragraphs": [
                        "This study is the first to investigate the feasibility of recycling an ionoSolv ionic liquid for lignocellulose deconstruction. This has been identified as a key driver for economic biorefining with ionic liquids and is hence a crucial experiment. 47 An optimal pretreatment time of 9 h was used for the recycling (helping give significant age to the later recycles), otherwise the conditions (T = 120 °C, 10 wt% biomass loading, 20 wt% water) were identical to those used for the time course study. The conditioning between uses was simple and consisted of drying the IL solution to the starting water content, before contacting it again with fresh Miscanthus.",
                        "In order to elucidate the impact of recycling on the fractionation and the ionic liquid solution, the pulps, the lignins and the ionic liquid solutions were characterised in detail.",
                        "Yield and composition of the pulp. For the recycling part of the study, we again investigated the yield and composition for the cellulose rich pulp (Fig. 19 and Table S4 in the ESI †).",
                        "After the initial pretreatment with fresh IL, the pulp yield was 44%. This is similar to the 8 h pretreatment in the time course (48%), albeit slightly lower. Compositional analysis showed that cellulose recovery in the recycling experiment was 79%, which was lower than the recovery after 8 h pretreatment in the time course (89%). Both the lower pulp yield and the lower glucan recovery could be due to the slightly higher acidity of the fresh ionic liquid solution used for the recycling study compared to ionic liquid solution in the time course study, as different batches of IL were used. This highlights the sensitivity to subtle changes in acidity occurring during preparation of the IL solution. In the recycling experiment, the pulp yield increased gradually to 51% for pretreatment cycles 2, 3 and 4. This was accompanied by significantly increased cellulose recovery (87% in cycle 4).",
                        "We speculate that the improved glucan yield could be due to a reduction in acidity of the ionic liquid solution during  repeated use. We hence measured the IL acidity in the IL liquor before and after four uses and compared the measured pH to (crudely) estimate the proton concentration in the undiluted ionic liquid solutions. The results are shown in Table S5 in the ESI. † The concentration of dissociable protons in the recycled IL solution was approximately 9 mol% lower than in the fresh ionic liquid solution, which is significant and likely reduced acid-catalysed hydrolysis and degradation of the cellulose portion. We have previously shown that pretreatment of grass lignocellulose releases acids (for example, acetic and p-coumaric acid), which are weaker acids than the IL anion ( pK a ∼ 2) and so it was expected that this release would reduce, not increase, solution acidity. This is different to autohydrolysis pretreatments, where release of organic acids decrease the pH. 77 In addition, the results suggest that the acidity of the ionic liquid may need to be adjusted during repeated use, which could be achieved by adding a small amount of sulfuric acid after each cycle to maintain the acidity.",
                        "No trend was observed for the xylan content in the pulp. After each IL use, ca. 10-20 wt% of xylan was recovered in the pulp compared to 20% in the 8 h time course experiment. Compositional analysis also revealed that lignin removal from the biomass declined slightly during recycling. When [TEA][HSO 4 ] was used fresh, 87% of lignin was removed after the first use (88% at 8 h in time course experiment), while 81% of the lignin was extracted during the fourth use. The acid soluble lignin content in the pulps was low compared to untreated Miscanthus, regardless of cycle. A low acid-soluble lignin content is typical for ionoSolv pretreated cellulose rich pulps. Overall, delignification and hemicellulose removal efficiency was largely maintained upon recycling.",
                        "The pulp ash content measured by compositional analysis also remained low during recycling (0.3-0.4%). It should be noted that compositional analysis only measures waterinsoluble inorganic components as ash. Thermogravimetric analysis (TGA) was used as a second method to determine the ash content in the recycled pulp and the results are displayed in Fig. S4 in the ESI. † The pulp ash content measured by TGA was indeed higher (1.2-1.9%) than the ash content determined by compositional analysis. In addition, the pulp ash content appeared to increase with IL reuse, nearly doubling between first and fourth use.",
                        "The measuring of a lower ash content by compositional analysis could be due to water soluble ash being dissolved into the sulfuric acid solution during the acid digestion step, for example conversion of CaSO 4 into soluble CaHSO 4 . The watersoluble ash component would be the one that increased over time. This hypothesis is supported by our observation that the residue after compositional analysis was silica only (XPS spectra shown in ESI †), while we have observed CaSO 4 crystals on the pulp surface using EDX (Energy-Dispersive X-ray) spectroscopy (results not shown).",
                        "Residual IL content in the pulp. We also analysed the pulps for their sulfur and nitrogen content (Table S6 in the ESI †), which are representative of residual ionic liquid content (N: cation, S: anion) in order to assess whether ionic liquid was accumulating during recycling. We found that the nitrogen content in both the first cycle and fourth cycle pulps was very low, close to the detection limit of the method (0.1%). The sulfur content was higher, suggesting that more sulfate (assuming the sulfur did not change its oxidation state) was deposited than triethylammonium cations. The sulfur content in the pulp also did not increase significantly when the ionic liquid was reused.",
                        "A sulfur content of 1.2% corresponds to 3.6% hydrogen sulfate by weight (mass ratio 97.1/32.1), if all sulfur is assumed to be present as [HSO 4 ] -, however, it is unclear in what form the sulfur was present. Similarly, a 0.1% and 0.2% nitrogen content translates into a 0.7 and 1.4 wt/wt% [TEA] + cation content in the pulp, respectively.",
                        "Surprisingly, the pulp sulfate content estimated from elemental analysis was higher than expected from the ash content measured by either compositional analysis (0.3%) or TGA (1.2-1.9%). It is possible that the latter method underestimated the ash content by reducing sulfates to sulfides, possibly volatilising the sulfur as H 2 S. It should be noted that since the anion is the less costly component (sulfuric acid represents only 7% of the IL production cost), 38 the sulfur lost to the pulp should have a low impact on operating costs, as sulfate can be replaced by adding the equivalent amount of (inexpensive) sulfuric acid.",
                        "Enzymatic saccharification. The cellulose rich pulps obtained after the recycling pretreatment were subjected to enzymatic saccharification for 96 h (5 days). The final glucose yield was 62% after the first pretreatment, which was lower than the saccharification yield achieved after 8 h pretreatment in the time course study (77%). We attribute the reduction in saccharification yield to a slight excess of acid in the IL batch used for the recycling experiments, which are more typical of those when excess acid is added deliberately (for example, 61% saccharification yield with 9% excess acid after 2 h, Fig. 16).",
                        "Remarkably, significantly higher saccharification yields were obtained after the third and fourth use of the [TEA][HSO 4 ] solution (72 and 71%), showing that the ionic liquid recycling did not have a negative impact on saccharification yields. On the contrary, in this study, the reused ionic liquid solutions improved the release of glucose, consistent with our hypothesis that excess acid was consumed in the early cycles.",
                        "We examined the increase in saccharification yield more closely by calculating the glucan digestibility, which describes the amount of glucose released from the pulp compared to the glucan content of the pulp (Fig. 20). This revealed that the ability of cellulases to release glucose was not substantially affected by repeated use of the IL, as the digestibility was around 81% for each cycle. Since reduced glucan recovery in the pulp (79%) was observed for the first and second use, the majority of the increased saccharification yields was caused by improved glucan recovery.",
                        "It is also of note that glucan digestibility remained the same although the residual lignin content in the pulp increased slightly with repeated IL use (13% for the first cycle compared to 19% for the fourth cycle). This suggests that although extra lignin was present in pulps isolated from the recycled IL solutions, it did not pose a barrier to the cellulase enzymes. The additional lignin is therefore probably not redeposited pseudo-lignin, as this would negatively impact saccharification yields when compared to lignin itself. 67 It is possible that the additional residual lignin precipitated onto the pulp during the ethanol washing, which will be discussed in the next section. Overall, saccharification yields were not negatively affected over 3 IL reuses.",
                        "Delignification and lignin yield. The precipitated lignin yield during recycling is shown in Fig. 21 alongside the delignification. After the first use, the precipitate yield was lower than the amount of lignin extracted. We have observed in the past that the lignin recovery is often lower than extraction with fresh IL, and this is also common for Organosolv lignin yields. It was hence unexpected that during the second use, the lignin yield doubled and substantially exceeded the delignification during this cycle. We attribute the excess yield in cycle 2 to the lignin that was not precipitated in cycle 1. The lignin yield in cycle 2 was the highest of all four uses, which we attribute to the concentration of dissolved fragments in the IL solution being highest after cycle 1. The lignin yields in cycle 3 and 4 were lower than the yields in cycle 2 but remained higher than the cycle 1 yield.",
                        "This suggests that the ionic liquid solution may be selfcleaning to some degree, avoiding substantial build-up of lignin in the ionic liquid solution. We hypothesise that the mechanism of self-cleaning involves lignin condensation reactions between freshly extracted lignin and lignin fragments left inside the ionic liquid from the previous cycle. If these reactions could be balanced against lignin redeposition, there is potential to maximise both lignin yield and saccharification yield with recycled liquor, potentially at higher levels than for single-pass IL use.",
                        "We also show the cumulative lignin yield in Fig. 21, which was calculated by summing the lignin recoveries over all previous cycles and dividing by the total amount of lignin available for extraction during those cycles. It can be seen that the cumulative lignin yield approached 100% after four cycles. This means that the cumulative lignin yield exceeded the amount of lignin extracted (around 80%), indicating that carbohydrates or minor components joined the precipitate, again likely as pseudo-lignin. The hypothesis that hemicellulose may be incorporated into the precipitate fraction was already supported by the hemicellulose mass balance established for the single pass pretreatment (Fig. 15), where a significant proportion of hemicellulose carbohydrates (22% at 8 h pretreatment time) could not be traced as sugars or furfural.",
                        "Characteristics of lignin obtained from recycled IL solutions. To characterise the recycling lignin, we analysed its molecular weight, its side chain and subunit composition (HSQC NMR), its hydroxyl content ( 31 P-NMR), and its elemental composition. The molecular weight data for the lignins isolated from the recycled IL solutions are shown in Table 1. The M n remained fairly stable during recycling, at around 1200, with the exception of cycle 2 where the M n increased to 1500. The polydispersity of all isolated lignins was fairly large (>4.8).",
                        "The M w was higher with values between 5800 and 9800, with cycle 2 lignin having the largest M w and also the largest variation between samples.   When examining the molecular weight profiles more closely, it appeared that subpopulations of lignin were present (Fig. 22): a small quantity of short fragments with a molecular weight (M w ) of approximately 200 g mol -1 , a main population with a peak molecular weight around 2000-3000 g mol -1 , a second main population with a peak molecular weight around 10 000 g mol -1 , and a tail population made up of very long polymer chains of up to 100 000 g mol -1 . The first cycle lignin was mainly monomodal, made up of lignin fragments between 500 and 10 000 g mol -1 , while the second cycle lignins exhibited a clear shoulder with molecular weight above 10 000 g mol -1 . The first and third cycle lignins contained a noticeable subpopulation of the short fragments (an M w of 200 would indicate dimers). The large M w and PDI of the cycle 2 lignins were due to a strong presence of the second main peak and a tail comprised of very long polymers. The appearance of the second main peak in cycle 2 lignin is an interesting phenomenon. It could be related to the increased coupling of lignin fragments during cycle 2, creating long condensed lignins in addition to the shorter extracted lignins. Appearance of the second main peak is consistent with the high lignin yield for cycle 2 recycling pretreatment and the high molecular weight observed for the 24 h single-pass pretreatments (also a bimodal distribution, see Fig. 11b), which had a similar residence time to the fragments after two cycles.",
                        "We also analysed the lignin isolated from the recycled ionic liquid solutions with HSQC NMR spectroscopy. Fig. 23 shows that the side chains and aromatic functionalities of the recycled lignin were fairly consistent over time. Signals for the β-O-4 ether linkage decreased with reuse. New peaks emerged that we are unfamiliar with. We speculate that these could be caused by pseudo-lignin or humins, but more research is needed to ascertain which motifs they belong to. The amount of PCA appeared to decrease and the amount of H-type subunits increase, consistent with PCA transformation described earlier. 65 We also observed that the peaks assigned to condensed syringyl and guaiacyl subunits increased between cycle 1 and 2 (annotated spectrum for cycle 2 lignin shown in Fig. S22 in the ESI †), but not between cycle 2 and 4. In fact, the cycle 4 lignin appeared to be slightly less condensed than the cycle 2 lignin. This highlights the distinctive properties of the second cycle lignin, which stood out through high yield, high molecular weight and a large polydispersity.",
                        "Elemental analysis was used to estimate the amount of residual IL in the lignin (Table S6 in the ESI †). The lignins' nitrogen and sulfur contents were low (<1% and <2%, respectively). The nitrogen content in the lignin was slightly higher than in the pulp while the lignins' sulfur content tended to be lower. Washing by Soxhlet extraction appeared to reduce the amount of residual IL in the lignin to a certain level. The lignins' cation and anion content did not increase with reuse. Hence ionic liquid contamination can be ruled out as a reason for the increased lignin recovery in cycles 2-4. An increase in carbon content in the cycle 4 lignins was observed which can be attributed to the lignin being more condensed (containing more C-C bonds and fewer C-H and C-O bonds) than singlepass lignins.",
                        "We further analysed the hydroxyl content of the lignin by substituting the OH groups with a phosphorous compound and analyzing the derivatized lignin by quantitative 31 P NMR. Table 2 shows the abundance of hydroxyl group types in the lignins obtained during repeated ionic liquid use. Generally, the hydroxyl contents were stable. There appeared to be some fluctuation for the aliphatic and the aromatic OH groups, which we cannot explain at present. The cycle 2 lignins exhibited a greater variation among samples, and particularly low aliphatic and phenolic (S, G and H type) hydroxyl group contents. This is unusual, as it has been observed previously that aliphatic hydroxyl content and phenolic hydroxyl content are inversely related for single pass ionoSolv lignins. 65 A possible explanation is that the cycle 2 (and cycle 4) lignin is more condensed and less hydrolysed, which would agree with the higher molecular weight and polydispersity. Alternatively, the lignins with a lower hydroxyl content could be associated with higher amounts of pseudolignin being present.",
                        "In summary, lignin with consistent properties can be isolated when recycling [TEA][HSO 4 ], confirming that the quality of the isolated lignin remains similar after reuse, especially after the start-up phase in the first two cycles. Furthermore, the lignin recovery during recycling appears to rely on condensation reactions, which result in the formation of higher molecular weight polymers.",
                        "Fate of hemicellulose during recycling. We also determined the content of hemicellulose solutes in the ionic liquid solution after the recycling had been completed. Table 3 shows the content of detectable solutes in the cycle 4 ionic liquid solution reconstituted to 20 wt% water content. It can be seen that there was little build-up for glucose, acetic acid, levulinic acid, HMF and furfural. The furfural content was below detection limit, and the acetic acid content was less than 4% of the theoretical possible, which was due to furfural and acetic acid evaporating during the fractionation. Glucan hydrolysis products such as glucose, HMF and levulinic acid were low due to high recovery of glucose in the cellulose pulp and further reac- "
                    ],
                    "subsections": [
                        {
                            "title": "tions of glucose and HMF into further degradation products.",
                            "paragraphs": [
                                "There was, however, a significant build-up of hemicellulose monomers in the IL solution. 15% of the overall xylan was detected in the ionic liquid solution as xylose, and almost a third of the introduced arabinose was still present. Although we did not follow up on this in detail, we expect that the xylose   content in the ionic liquid solution reaches a steady state that is determined by the hemicellulose extraction efficiency and the speed of reaction for conversion to furfural and pseudolignin."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Characteristics of recycled ionic liquid",
                    "paragraphs": [
                        "Recovery and recycle rate. As much as ionic liquid cost is important, the IL recycling rate is also a key variable for the process economics, as the amount of the make-up solvent is one of most important contributors to operating costs for IL based pretreatment processes. 46,47 This is not surprising as solvent cost and make-up quantity are cost multipliers for each other. Published techno-economic models suggest that a recovery above 96% is required, even if the ionic liquid is inexpensive, and recovery is preferably higher.",
                        "The ionic liquid recoveries achieved in this study are listed in Table 4. [TEA][HSO 4 ] recovery was 98% or higher in each cycle, and 99% in three out of four cycles. We would expect a slightly higher recovery (ca. 2%) for the first use, due to increased retention of lignin in the liquid. However, the error of our measurement was too large to show this. It may also be possible to obtain a higher recovery in an industrial process, where surface losses (i.e. to glassware) are significantly lower.",
                        "Photos of the IL before and after the recycling are shown in Fig. S5 in the ESI. † The visual impact of ionoSolv fractionation is a permanent discolouration of the ionic liquid after use, suggesting that solutes are left behind. The discolouration intensified with further uses (Fig. S5C in the ESI †). However, as shown in this study, these solutes did not appear to have a detrimental impact on the reusability or effectiveness of the ionic liquid.",
                        "Inorganic salts in the IL solution. Build-up of inorganic impurities in the ionic liquid is another concern for scale-up and continuous use of the [TEA][HSO 4 ]. The biomass can introduce a variety of inorganic components such as silica, calcium (Ca), potassium (K) and sodium (Na) salts. 78 We hence monitored the concentrations of three inorganic cations in the recovered ionic liquid using Inductively Coupled Plasma Optical Emission Spectroscopy (ICP-OES).",
                        "Fig. S6 in the ESI † shows the concentrations of the two alkali metals K and Na and the alkaline earth metal Ca in the fresh and recycled ionic liquids. The concentration of these metals was low before use, which was expected for freshly synthesized ionic liquid. Only sodium was present in appreciable amounts, which could have been introduced by the synthesis chemicals. The concentration of the ions increased after the first and second fractionation cycle and then declined. This suggests that salts containing these ions do not accumulate in the ionic liquid.",
                        "The cause of the reduction in inorganic cation content is not clear at this point. It should be noted that the solubility of inorganic salts in ionic liquids is often low. For example, the solubility of NaCl in 1-ethyl-3-methylimidazolium ethyl sulfate was reported as 0.56% (at 25 °C). 79 There are several possibilities for where the ions went after the second use. Considering the ash contents in the pulps and lignins (Fig. S4 in the ESI †), the ions may have partitioned with both pulp and lignin. The pulp ash content increased with reuse, while the lignin ash content appeared to increase during the 4 th cycle (although this is quite speculative, given the large standard deviation).",
                        "Ionic liquid degradation products. We recorded 1 H-NMR spectra of the ionic liquids before and after recycling (Fig. S7 in the ESI †). This is a suitable method for detecting a potential accumulation of ionic liquid degradation products, 34 since dealkylation of the cation is the dominant ionic liquid degradation mechanism for ionic liquids such as [TEA][HSO 4 ]. 80 The signals in NMR spectra of [TEA][HSO 4 ] originated from the cation: the proton attached to the nitrogen atom (9.0 ppm), as well as the methylene (3.1 ppm) and methyl groups (1.2 ppm) of the ethyl chains. The acidic proton on the hydrogen sulfate anion exchanges rapidly with the water in the ionoSolv solution, hence both appeared as one broad peak in the spectrum at around 4.5 ppm.",
                        "For [TEA][HSO 4 ], we would expect diethylammonium or monoethylammonium to form during degradation. They would appear up-field of the triethylammonium methylene and methyl signals. A spiking experiment confirmed that this was indeed the case. When we analysed the recycled ionic liquid by NMR (4 th cycle ionic liquid, Fig. S7 in the ESI †), however, we did not detect signals for the expected dealkylation products. This demonstrates the thermal stability of the ionic liquid at the conditions employed in this study.",
                        "The low amount of organic solutes visible in the NMR spectrum is also noteworthy. Given the high lignin recovery and the low amount of carbohydrate monomers, furfurals and acetic acid detected in the recycled liquors (Table 3), this was expected.  water stream to precipitate lignin. The diluted ionic liquid solution consisting of IL, wash water and the water-soluble fraction is distilled, regenerating the concentrated IL solution, and yielding organic volatiles and water which is looped back as wash water. It should be noted that the washing steps with both ethanol and water presented in our protocols were optimised (overdone) to give clean NMR spectra and are not representative of usage in an industrial process. Indeed, preliminary data (not shown here) suggest that lignin precipitation is complete with roughly 0.5 volume equivalents of water, while we use 3 equivalents in our protocols to give a clean separation. In order to move toward an industrial ionoSolv pretreatment process, several aspects need to be further considered. In this paper, we have outlined that the high recycle rate (99%lower than commonly assumed for Organosolv processing for less promising economic estimates 81 ) achieved combined with the ionic liquid's low cost (ca. $1 kg -1 ) can be economically advantageous. It should be noted that this solvent cost is based on 2014 commodity chemical prices, and these have typically fallen by 60% from 2014-2016, leading to a current IL cost of ca. $0.50 kg -1 , and a corresponding drop to $0.06 per liter; this would be ca. 5-10% of the levelized ethanol cost, depending on the current minimum ethanol selling price. However, as this tracks the price of oil (and therefore minimum selling ethanol price), these costs will always be proportional to the profit margin."
                    ],
                    "subsections": []
                },
                {
                    "title": "Preliminary techno-economic analysis and process considerations",
                    "paragraphs": [
                        "Furthermore, a higher solvent recycling rate is likely possible at larger scale, and, given the minimal nitrogen (amine) losses we observed during recycling, the makeup \"solvent\" stream is likely to be predominantly aqueous sulfuric acid, which has negligible cost. This could again be advantageous for the economics of ionoSolv pretreatment.",
                        "There are additional process advantages related to the use of ionic liquidsthe capital cost of a pretreatment reactor is expected to be low compared to aqueous or organic pretreatments due to the lack of substantial pressure, which could also enable continuous processing (low pressure biomass feeding). The ability to use a higher solids loading or higher temperatures would further reduce the cost of this vessel. For operating expenses, the clear advantages of ionoSolv are in solvent cost (1-2 orders of magnitude lower than acetate or chloride based ionic liquids) and high chemical and thermal stability. This will reduce or eliminate the rate of intrinsic solvent degradation. If the process can achieve 99% solvent recovery, then at 10% solids loading, 10 kg of biomass will be processed per kg of solvent (or $0.09 IL cost per kg of biomass; a more than 98% reduction from $5.56 per liter), lower than for Organosolv processes, strictly due to comparable solvent costs, higher solvent recovery (96-98% for Organosolv 64 ) and higher solids loading. At a more reasonable industrial scale purge size, 99.5% solvent recovery would lead to cost of $0.05 kg -1 , and at an optimistic case of 99.9% recovery less than $0.01 kg -1 of biomass. Only at high purge losses (95% solvent recycling) would we see solvent costs become limiting ($0.45 kg -1 ), and these could still make economic sense as the glucose price only exceeds the current market rate at 94% solvent recycling. There will also be lower energy requirements than Organosolv pretreatments, due to the elimination of solvent distillation, 81 although the relative amount of water to be added to achieve lignin precipitation is likely to affect this conclusion. This will be strongly dependent on the potential to minimize the water required for lignin precipitation, or to develop lower-energy methods of lignin recovery. Relative to aqueous processes, the reduction in waste water and large reduction in process heat (due to lower solvent volumes) should easily offset the increased solvent cost. 82 It should be noted that Baral et al. identified 97% IL recovery and 90% waste heat recovery as necessary targets in economical IL pretreatment at $1 kg -1 IL cost. 46 While we have demonstrated the first and third of these targets here, the impact of the ILbased pretreatment on downstream process stepsand therefore considerations such as heat integrationis not yet fully understood.",
                        "To assess these effects, we undertook a preliminary (highlevel) technoeconomic assessment of the ionoSolv process, in comparison to published data for dilute acid pretreatment, which is considered the cheapest pretreatment option viable for a range of (non-softwood) biomass types. This preliminary analysis has revealed that ionoSolv has a 40% reduction in capital expenditure, even with increased material of construction costs. The operating expenditures were reduced by 30%, almost entirely due to energy costs associated with solvent heating (the main energy cost in both processes), which in an industrial process would be achieved mainly through lowgrade heat integration. Details are provided in the ESI. † Overall, this yielded an estimated cost of glucose production at $0.19 kg -1 , which was below the raw sucrose trading price in early 2016 of $0.26 kg -1 . While we did not include attempts to valorise lignin (beyond heat recovery), we do note that hemicellulose valorisation is important to supplementing the profitability of the process. While furfural was used as a model organic product in our analysis (due to our production in situ), this is not the only product available (additional fermentable sugars is another). It is also noteworthy that the reduction in capital and operating costs render the ionoSolv process potentially profitable even without valorisation of lignin or hemicellulose.",
                        "While the high-level analysis presented here is greatly encouraging, there is the need for more detailed verification of the model and potential for further improvement through higher solid loadings, higher temperatures or higher acidity (shorter pretreatment times) and lower water usage during lignin recovery. There are also clear technical challenges associated with hemicellulose sugars (currently we recover these as furfural or pseudolignin), where an additional processing step to recover hemicellulose sugars would increase total biofuel yield, and may improve overall economics. There is also the open research question of lignin valorisation (we assumed in our model that lignin possesses heating value only). These are clearly opportunities for further research, and a more detailed technoeconomic assessment is underway to uncover the parameters of these opportunities."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Experimental",
            "paragraphs": [
                "Starting materials for ionic liquid synthesis were purchased from Sigma Aldrich and used as received, unless stated otherwise. 1 H NMR spectra were recorded on a Bruker 400 MHz spectrometer. Chemical shifts (δ) are reported in ppm. The DMSO solvent signal was at 2.500 ( 1 H dimension) and 39.520 ( 13 C dimension). Electrospray mass spectrometry was measured by Dr Lisa Haigh (Imperial College London, Chemistry Department) on a Micromass Premier spectrometer. The Karl-Fisher titrator used in this work was a V20 volumetric Titrator (Mettler-Toledo) and the analytical balance a Sartorius CPA 1003 S balance (±0.001 g)."
            ],
            "subsections": [
                {
                    "title": "Synthesis of triethylammonium hydrogen sulfate [TEA][HSO 4 ]",
                    "paragraphs": [
                        "Triethylamine (75.9 g, 750 mmol) was cooled with an ice bath in a round-bottom flask. Under stirring, 150 ml of 5 M H 2 SO 4 (750 mmol) were added dropwise. The water was removed using the rotary evaporator and the product dried using the Schlenk line at 70 °C overnight. The ionic liquid was recovered as a white, hygroscopic solid. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Fractionation of lignocellulosic biomass",
                    "paragraphs": [
                        "Fig. 2 is a schematic of the pretreatment process. Pretreatments were carried out according to a standard operating procedure of our laboratory. 83 A biomass to solvent ratio of 1 : 10 g g -1 was used with 80 wt% triethylammonium hydrogen sulfate and 20 wt% water as the solvent. A detailed description can be found in the ESI. †"
                    ],
                    "subsections": []
                },
                {
                    "title": "Ionic liquid recovery and recycling",
                    "paragraphs": [
                        "A clean 250 ml round bottom flask with magnetic stir bar was weighed and the wash water from each sample added. The combined water washes were dried using the parallel evaporator, the rotary evaporator or a combination of both. Once further drying could not be achieved using these, the round bottom flask was attached to a vacuum line providing 2 mbar vacuum and the liquid further dried at 45 °C overnight. The weight of the flask was recorded and the wet-yield of ionic liquid determined. 20 wt% water was added to the ionic liquid and the mixture stirred while gently heating until a homogenous solution formed. The water content in the reconstituted IL liquor was measured in duplicate using a Karl Fisher titrator, with reproducibility better than 0.4 wt%. The averaged water content was used to calculate the residual water content in the recovered IL. The water content in the reconstituted ionoSolv solutions was between 20% and 24%.",
                        "The recovery of ionic liquid was calculated using the following equation:",
                        "where-by m dried before was the dry-mass of [TEA][HSO 4 ] before cycle i, m after was the quantity of dried [TEA][HSO 4 ] after cycle i, and w i+1 was the water content (mass fraction) of the [TEA][HSO 4 ] solution prepared for the next cycle.",
                        "After IL recovery, approximately 500 µl of the aqueous ionic liquid solutions was saved for further analysis. The remainder was transferred into a clean pressure tube, mixed with a new batch of air-dried Miscanthus (10 wt% of the transferred solution's weight) and treated again using the same procedure as above. The cumulative lignin yield for the recycling experiments was calculated by averaging the lignin yields (in %) obtained in the respective and any preceding cycle(s)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Feedstock and pulp characterisation",
                    "paragraphs": [
                        "Moisture content. For both native biomass and recovered pulp the moisture content was determined according to the NREL protocol 'Determination of Total Solids in Biomass and Total Dissolved Solids in Liquid Process Samples' 84 by weighing out approximately 100 mg of biomass/pulp onto a preweighed piece of aluminium foil and recording the weight using the analytical balance. The foil with the biomass/pulp was folded and oven dried (T = 105 °C) overnight. The hot packets were placed in a desiccator to allow cooling to room temperature. The weight was recorded immediately and the moisture content calculated. This was performed in triplicate for untreated biomass and once per sample for recovered pulp.",
                        "Compositional analysis. The composition of the untreated and pretreated solids was determined according to the NREL protocol 'Determination of Structural Carbohydrates and Lignin in Biomass'. 85 A detailed description can be found in the ESI. † Delignification and hemicellulose removal. The delignification was calculated using the following equation:",
                        "where-by Lignin untreated is the lignin content in untreated Miscanthus, Lignin pulp is the lignin content in the pulp and Yield pulp is the oven-dried yield of pulp. Hemicellulose removal was calculated using the following equation:",
                        "where-by Hem untreated is the hemicellulose sugar content in untreated Miscanthus, Hem pulp is the hemicellulose content in the pulp and Yield pulp is the oven-dried yield of pulp. Enzymatic saccharification assay. Saccharification assays were carried out according to NREL protocol 'Enzymatic saccharification of lignocellulosic biomass' 86 in triplicate. All reagents and enzymes were purchased from Sigma Aldrich. 100 ± 10 mg (calculated on an ODW basis) air-dried biomass was placed into a Sterilin tube and the weight recorded. Three blanks were run with 100 µL of purified water in order to correct for sugar residues present in the enzyme solutions. 9.9 mL solution made from 5 mL 1 M sodium citrate buffer at pH 4.8, 40 µL tetracycline solution (10 mg mL -1 in 70% ethanol), 30 µL cycloheximide solution (10 mg mL -1 in purified water), 4.71 mL purified water, 60 µL cellulase from Trichoderma reesei ATCC 26921 solution and 60 µL cellobiase from Aspergillus niger solution was added, the tubes closed and placed into an Stuart Orbital Incubator (S1500) at 50 °C and 250 rpm.",
                        "Saccharification end point samples were obtained by filtering 1 mL of the saccharification mixture though a PTFE syringe filter. Samples were analysed on Shimadzu HPLC system with RI detector and an Aminex HPX-87P column (BioRad, 300 × 7.8 mm) with purified water as mobile phase (0.6 mL min -1 ). The column temperature was 85 °C and acquisition time was 40 min. Calibration standards with concentrations of 0.1, 1, 2 and 4 mg mL -1 of glucose, xylose, mannose, arabinose and galactose and 8 mg mL -1 of glucose were used."
                    ],
                    "subsections": []
                },
                {
                    "title": "Analysis of ionic liquid solutions",
                    "paragraphs": [
                        "Concentration of solutes. Ionic liquid solutions were analysed directly after pretreatment by removing ca. 200 mg of the solution with a pipette into an Eppendorf micro centrifuge tube. The exact weight was recorded, ca. 600 mg of water added and the exact weight recorded again. The tube was shaken and centrifuged with a VWR MICRO STAR 17R centrifuge at 4 °C and 13.3 G for 10 min to remove any waterinsoluble material. The supernatant was pipetted off into a HPLC vial and submitted for analysis on a Shimadzu HPLC system with RI and UV/Vis detector and an Aminex HPX-87H column (BioRad, 300 × 7.8 mm) with 0.01 M H 2 SO 4 as mobile phase (0.6 mL min -1 ). The column temperature was 55 °C and acquisition was run for 55 min. Calibration was carried out using standards with concentrations of 0.01, 0.02, 0.1, 0.2 and 0.4, 1, 2 and 4 mg mL -1 of glucose, xylose, arabinose, furfural, 5-HMF, acetic acid and formic acid. Analyte concentrations in the HPLC sample were calculated using the resulting calibration curves. The mass fraction w/w of analytes detected in the ionic liquid solution (in mg g -1 of dried biomass) was determined using the following equation:",
                        "c HPLC : analyte concentration as determined by HPLC analysis in mg mL -1 ; m sample : mass of ionic liquid solution sampled in mg; m water : mass of water added in order to dilute IL sample in mg; m IL : dry mass of ionic liquid used for pretreatment in g. ρ HPLC : density of HPLC sample in g mL -1 (value used 1.045 g mL -1 ); wc sample : water content of the sample; ODW BM : oven dried weight of the biomass used for pretreatment in g; IL solution acidity. The amount of protons in the ionic liquid was measured by diluting 1 ml ionic liquid solution (80% [TEA][HSO 4 ] 20% water) obtained either fresh or after four uses with 9 ml deionised water. The pH of the diluted solution was measured using a Jenway 3510 pH meter equipped with a VWR Ag/AgCl SympHony electrode (0.02 pH precision). The pH of the solution was converted into a proton concentration using the following equation:",
                        "[H + ] IL : calculated proton concentration in the ionic liquid; pH: measured pH value; IL conc : ionic liquid concentration in the analysed sample (here 80 mg mL -1 ).",
                        "Inductively coupled plasma optical emission spectroscopy. ICP-OES measurements were performed on a PerkinElmer Optima 2000. Analyte solutions were prepared by mixing 80/20 wt% ionoSolv solutions with 10 wt% nitric acid. The triethylammonium hydrogen sulfate concentration was 5-10 mg ml -1 . Plain 10% nitric acid was the reference. Standards were prepared using a multielement standard solution in 10% nitric acid (TraceCERT, Sigma-Aldrich). The standard concentrations were (in mg L -1 ) Na: 50, 10, 1; K: 100, 20, 2; Ca: 10, 2, 0.2. One sample each was analysed for fresh IL and use 1-3, while two independent samples were analysed for the 4 th use, displaying excellent reproducibility. The values given in the results are averages of three measurements per sample."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mass balance calculations",
                    "paragraphs": [
                        "Mass balance calculations were based on the initial content of glucan, hemicelluloses and lignin in the biomass as measured by compositional analysis (see 'Compositional analysis' section).",
                        "Biomass components in the pulp were obtained from compositional analysis and expressed as a percentage of their content in the untreated Miscanthus. Dissolved carbohydrate monomers and their dehydration products were quantified using the method described under 'analysis of ionic liquid solutions', with the addition of applying a molecular mass transformation factor F T which was 0.9 for glucose, 0.88 for xylose and arabinose, 1.37 for furfural and 1.26 for HMF to account for molecular weight changes for these during their transformation. The obtained percentage was then expressed as a percentage of the biomass component of origin (glucan; xylan and arabinan combined) in the untreated Miscanthus. The lignin precipitate was determined as described in 'Fractionation of Biomass' and expressed as a percentage of initial lignin content. All components determined using the procedures above were added up for each time point and the difference to 100% assigned as 'unaccounted'. Extractives were assumed to dissolve into the liquor and not taken into consideration for the mass balance. Eqn (6) summarises the calculations conducted: : the percentage of compound i found in the pulp; m prec : the mass recovered through precipitation in g; r(%) prec i : the percentage found of compound i in the precipitate (assumed to be 100% for lignin and 0 for all others); cont. (%) c : the initial content of component c in the biomass and ODW BM : ovendried weight of biomass used."
                    ],
                    "subsections": []
                },
                {
                    "title": "Lignin characterisation",
                    "paragraphs": [
                        "HSQC NMR spectroscopy. For HSQC NMR experiments of precipitated lignin, ca. 20 mg of lignin was dissolved in 0.25 mL of DMSO-d 6 and the solution transferred to a Shigemi tube. HSQC NMR spectra were recorded on a Bruker 600 MHz spectrometer ( pulse sequence hsqcetgpsi2, spectral width of 10 ppm in F2 ( 1 H) with 2048 data points and 160 ppm in F1( 13 C) with 256 data points, 16 scans and 1 s interscan delay).",
                        "For the analysis of lignin/pseudo-lignin after saccharification, the saccharification residue was filtered and washed with copious amounts of water. The washed residue was air-dried and transferred to a centrifuge tube. 0.6 mL DMSO-d 6 was added, the centrifuge tube shaken and left to incubate for at least 1 h. The tube was then centrifuged, the supernatant carefully removed and filtered through a syringe filter into a Shigemi tube. HSQC spectra were recorded as above with 32 scans.",
                        "The spectra were analysed using MestReNova (Version 8.0.0, Mestrelab Research 2012). All spectra were referenced to the DMSO peak at 2.500 ppm ( 1 H) and 39.520 ppm ( 13 C). Integrals were determined simultaneously for a group of spectra. This was achieved by gathering the relevant spectra in one file and selecting all and then determining the oval integration area in one spectrum. Integration areas were selected visually. For ether linkages, the C-H α -signals were integrated and for PCA and H, the 2,6-signals were integrated. The integration was normalized to the sum of the G 2 and the G cond volume integrals.",
                        "Gel permeation/size exclusion chromatography GPC measurements were performed using an Agilent 1260 Infinity instrument equipped with a Viscotek column set (AGuard, A6000 M and A3000 M). The Agilent 1260 Infinity RID detector was used for detection. GPC grade DMSO containing LiBr (1 g L -1 ) was used as eluent at a flow rate of 0.4 mL min -1 at 60 °C. Samples were prepared by dissolving 20 mg lignin in 1 ml eluent and filtering through a 0.2 µm syringe filter. Ten pullulan standards (Agilent calibration kit, 180 < Mp < 780 000) were used to calibrate the instrument. Standard deviations for the time course lignins were M n ±100, M w ±300 and PDI ±0.3 or less.",
                        "Hydroxyl group quantification using 31 P-NMR spectroscopy A solution of 1.6 : 1 (v/v) of anhydrous pyridine and deuterated chloroform was prepared. This 'stock solution' was used to prepare a further two mixtures: (1) a solution 20 mg mL -1 of the internal standard cyclohexanol dissolved in the stock solution, (2) a solution containing 5.6 mg mL -1 of chromium(III) acetylacetonate, a relaxation agent. The lignin was dried under vacuum (1 mbar) at 40-45 °C for 24 hours. 10 mg dried lignin was weighed into a clean HPLC glass vial. To each lignin sample, the following reagents were added: 100 μL of anhydrous pyridine and deuterated chloroform solution, 50 μL of the cyclohexanol solution, 50 μL of the phosphitylating reagent 2-chloro-4,4,5,5-tetramethyl-1,3,2-dioxaphospholane (TMDP) and 50 μL of the relaxation agent solution. The sealed solution was vortex-mixed intensely for 5 minutes or until completely dissolved and transferred to a Shigemi tube (note: the quantity is not sufficient to adequately fill a standard 5 mm NMR tube). An inverse gated decoupling pulse sequence was used to obtain quantitative spectra on a Bruker Avance 500 MHz NMR machine using the following settings: 298 K (room temperature), relaxation delay 25 s, 30°pulses, 127 scans. The quantity of the various hydroxyl group types was determined by integration using MestReNova relative to the concencentration of the internal standard."
                    ],
                    "subsections": []
                },
                {
                    "title": "Ash content in pulp and lignin by thermogravimetric analysis",
                    "paragraphs": [
                        "Thermogravimetric analysis (TGA) of pulp and lignin was performed on a Q500 (TA Instruments) thermogravimetric analyser fitted with a valve switch. 2-4 mg of isolated air-dried pulp or lignin were loaded per run. Each time point was analysed in triplicate. During the TGA analysis, the gas flow was 100 ml min -1 . The sample was equilibrated at 50 °C in 100% nitrogen atmosphere. The temperature was raised to 110 °C at 60 °C min -1 and kept at 110 °C for 20 min to dry the sample. Subsequently, the temperature was raised at 60 °C min -1 to 600 °C and kept at this temperature for 15 min. Subsequently, the gas stream was changed to 10% air and 90% nitrogen to remove all organic material and determine the ash content. Data were exported using the TA universal analysis software and analysed in Microsoft Excel. The sample weight after 20 min (dried weight) and 59 min (ash weight) was determined and ash content calculated using the following formula:",
                        "Residual IL content by elemental analysis Elemental analysis (CHNS) was carried out by Medac Limited, UK, one measurement each was performed on two samples per recycling pulp or lignin."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "In this study, an in-depth characterisation of a fractionative lignocellulose pretreatment with a low cost IL was presented, and based on this a preliminary technoeconomic analysis was outlined.",
                "We investigated the mechanism of the pretreatment with the low-cost ionic liquid triethylammonium hydrogen sulfate [TEA][HSO 4 ] at a mild temperature (120 °C). When using fresh ionic liquid, we found an optimum pulp saccharification performance at around 8 h pretreatment time, with an 80% yield of glucose. An increase of the acid base ratio shifted the optimum to around 2 h. In terms of lignin processing, more than 85% delignification and 80% lignin recovery was achieved. The recovered lignin had up to 80% of its ether bonds cleaved, with the effects accelerated by the addition of excess acid. This indicates that with harsher conditions (>16 h pretreatment time for the 1 : 1 IL and >4 h with 9% excess acid) condensed lignin and pseudo-lignin begin to attach to the pulp, inhibiting saccharification. Evidence for lignin condensation was seen in the HSQC NMR spectra and in the molecular weight data. Lignin re-precipitation at prolonged pretreatment times also decreased lignin recovery.",
                "We also investigated the fate of dissolved hemicellulose during this process, revealing that it was solubilized mainly as monomers and converted into furfural and further unidentified degradation products during processing. The hemicellulose mass balance supports our theory that products formed during hemicellulose dehydration join the lignin in the precipitate fraction as pseudolignin. HMF production also appeared to occur, but since the vast majority of the glucose remained in the cellulose-rich pulp, this process was negligible.",
                "We also demonstrated that the [TEA][HSO 4 ] solution can be reused multiple times and showed how the reuse impacts the properties of cellulose pulp and the lignin. The ionic liquid recovery rate at the bench-scale was excellent (>99%), which was attributed to the non-volatility of the ionic liquid solvent. The fractionation efficiency was maintained during recycling, demonstrated by repeatedly high lignin extraction and increasing saccharification yields with re-use. There was no observable build-up of lignin fragments or inorganic salts, as the solution exhibited self-cleaning properties. The involvement of carbohydrates in increasing lignin yields was supported by the excess lignin recovery during the recycling experiment.",
                "Our technoeconomical analysis predicted that capital and operating cost will be lower than for the bench-mark dilute acid pretreatment. Areas of future process development work were highlighted, such as pretreatment temperature, solid loadings, hemicellulose recovery, up-scaling and heat integration. This comprehensive data set is a useful basis for further process optimisation and design, in-depth techno-economical modelling and for developing new biomass chemistries within this solvent. Already now, the ionoSolv pretreatment system shows clear potential for industrial scale up due to high efficiency and very low solvent cost compared to other ionic liquid or organic solvent based pretreatment systems."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgements",
            "paragraphs": [
                "The authors wish to acknowledge Shell Global Solutions and the Engineering and Physical Sciences Research Council (EP/K014676/1) for funding for AB, and the Grantham Institute for Climate Change and the Environment for a studentship for FJVG. Additional funding was provided by Climate-KIC. The authors are also grateful to Dr Long Chen for providing preliminary data and Harsh Shukla for preparing the ionoSolv process flow diagram. Any requests for data can be made through www.imperial.ac.uk/people/j.hallett. The authors wish to thank Dr Kevin Lovelock for performing the XPS experiments shown in the ESI."
            ],
            "subsections": []
        }
    ]
}