{
    "id": "US20190241679",
    "authors": [
        "Jason Hallett",
        "Paul Fennell",
        "Florence Gschwend",
        "Agnieszka Brandt-Talbot",
        "Geoffrey Kelsall"
    ],
    "title": "Process for the Extraction of Metal Pollutants from Treated Cellulosic Biomass",
    "date": "2016-11-21 00:00:00",
    "abstract": "The present invention relates to a process for extracting oxidised metal pollutants from treated cellulosic or lignocellulosic biomass to recover the metal. The treatment also generates a cellulosic or lignocellulosic biomass which can to be used as a feedstock for biofuel, for making cellulose containing materials, and provides a source of other renewable chemicals.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "The present invention relates to a process for extracting oxidised metal pollutants from treated cellulosic or lignocellulosic biomass to recover the metal. The treatment also generates a cellulosic or lignocellulosic biomass which can to be used as a feedstock for biofuel, for making cellulose containing materials, and provides a source of other renewable chemicals.",
                "A significant portion of wood used in the construction industry is treated with metal based preservatives. This is done to protect the wood from attack by microbes and insects during service. The preservatives contain copper (II) and sometimes also chromium (VI) (as chromate) and arsenic (V) (as arsenic pentoxide). Other metal pollutants are also found in wood such as zinc (II), iron (II/III) and lead (II). The main applications for preservative treated wood are decks, fences, landscape architecture, playground equipment, docks, marinas, utility poles, bridges, highway sound barriers, roller coasters, wood foundations and mine shafts. These preservative formulations are toxic: copper (II) is toxic to aquatic life and arsenic (V) and chromium (VI) are known to be very toxic to any multicellular life including humans. Leaching from in-service-material is limited, although public health concerns have been raised. Apart from this, the non-degradability of the wood and toxicity of the preservatives pose a definitive problem when the wood is taken out of service.",
                "Common preservative formulations used are alkaline copper quaternary (ACQ), copper azole (CA, Tanalith E) and micronized copper quaternary (MCQ), which all contain substantial amounts of copper (up to 3700 ppm). Chromated copper arsenate (CCA, Tanalith C), a mixture of CuO, CrO3 and As2O has been used extensively between the 1930s until the early 2000s. Timber treated with CCA can contain over 5000 mg kg−1 of arsenic (V) and chromium (VI). This is the most hazardous wood treatment, hence CCA use was heavily curtailed in Europe and the US in 2003-2004. However, CCA treated timber still in service will pose a substantial problem for the next 20-years. Reportedly, up to 2.5×106 m3 a−1 of spent CCA-treated wood will be removed from service in the next 20 years in Canada. It has been estimated that 6-10×106 m3 a−1 of CCA-treated wood waste will be produced in the USA by 2030.",
                "The treated timber is classified as hazardous waste and cannot be directly used in biomass-to-heat conversion or recycled into panel boards or similar, thus incurring high costs for specialist disposal, such as landfilling. Copper (II) only treated timber may be incinerated in monitored specialist boilers and the waste reduced to metal containing ash. In contrast, incineration of arsenic (V) containing wood is problematic, as the arsenic (V) compounds generated during thermal treatment are volatile and at least partially emitted into the atmosphere.",
                "The following recovery methods of the metal additives from the treated wood are in being used or currently explored:\n\n\n- - (1) Controlled landfill Landfills that are not in contact with the\n    ground water table are deemed suitable for disposal of treated wood\n    waste. However, landfill sites are becoming scarcer and landfilling\n    is becoming expensive.\n  - (2) Thermal treatment and disposal of metal enriched ash Boilers for\n    thermal treatment of hazardous timber are not operated in the UK due\n    to high demand on furnace specifications and monitoring (Regional\n    Market Assessment for Wood Waste for North East England, 2007).\n    However, thermal treatment may be feasible for wood treated with the\n    newer, copper only, preservatives. Copper compounds are non-volatile\n    and thus only a small percentage escapes as fly ash into the\n    atmosphere upon combustion of the contaminated biomass (less than\n    7%). Processes deriving value from combustion, gasification or\n    pyrolysis do not currently exist.\n  - (3) Leaching and disposal of chemically precipitated metal ions\n    Leaching of the oxidised metals from the wood has been proposed.\n    Options discussed in the literature are\n    - a. Leaching with dilute acid solution or aqueous solutions\n      containing chelating agents\n    - b. Complete dissolution of waste wood in concentrated sulfuric\n      acid\n  -  The metal-containing effluents are treated as heavy metal\n    contaminated waste water (metal ions removed e.g. by flocculation\n    and precipitation). Recovered wood can be incinerated as normal\n    waste wood if the metal content is sufficiently low. The recovered\n    wood cannot be used as a source of biofuel as the wood is decomposed\n    during the process and not suitable for subsequent use in the\n    saccharification process. Electrodeposition of Cu^(II) from aqueous\n    solution has been demonstrated recently. A recent study presented\n    insights obtained from operating a pilot plant and the associated\n    techno-economic model for dilute acid-leaching. It was estimated\n    that the operating cost would be \\$250-289 t⁻¹ of treated wood. This\n    shows that metal extraction should be integrated with a value-adding\n    application.",
                "The mentioned decontamination methods for metal containing timber are costly, in the area of $180 t1 waste timber. On the other hand, cost of virgin wood feedstock for biofuel production is estimated to be $80 t−1. Currently, there are a handful of commercial-scale cellulosic biofuel plants in operation, all using virgin biomass (mostly agricultural residues and energy grasses) and steam based pre-treatment technologies.",
                "The use of contaminated waste wood as feedstock for a biorefinery would hence eliminate a waste management problem and increase the economic viability of lignocellulosic biomass for biofuel and biochemical production. Electrochemical recovery of the metals in a useful elemental form would further add value.",
                "Lignocellulosic biomass, such as wood, consists of 3 major components arranged in an intricate, yet physically and chemically stable material. Approximately 40% of wood is cellulose. Cellulose is long chains of glucose arranged infibrils. They give wood its high strength and stiffness.",
                "Hemicellulose, 25 weight % of the material, acts as a filler matrix that binds the cellulose fibrils together. Lignin, also approximately 25% of the material, is a glue infused into the cellulose hemicellulose matrix, conferring elasticity and water-proofness. Cellulose and hemicellulose are long chains composed of sugars, while lignin's repeat units contain aromatic rings.",
                "For cellulosic biofuel production, the lignocellulosic matrix is opened up during pre-treatment/fractionation (at elevated temperature). A separate fraction of cellulose is obtained. The sugar molecules can be released from washed cellulose using an enzymatic hydrolysis step. The resulting sugar solution can be converted to biofuels or other biochemicals by fermentation. If a preservative treated lignocellulosic biomass source was used, the presence of the metals e.g. copper from the preservatives would kill the microbes used in the fermentation step. Therefore, only virgin (untreated) biomass sources have been used to date. The lignin present in the lignocellulosic biomass can be used for energy recovery and production of renewable materials such as resins, polyols, carbon fibres and chemicals, depending on the extraction conditions and purity.",
                "The fractionation of cellulose and lignin from lignocellulosic biomass using ionic liquids has been previously described in WO 2012/080702 and WO2014/140643.",
                "The present invention describes a process of extracting metals from treated cellulosic or lignocellulosic biomass, such as wood, using an ionic liquid (IL). The ionic liquids fractionate metal containing cellulosic or lignocellulosic biomass waste into a cellulose rich solid material, and a liquid phase. The liquid phase comprises a hemicellulose fraction and a lignin fraction, and retains the metals in the IL solution. The cellulose rich material can be used to produce biofuels and plant derived chemicals. The metal, and optionally the lignin, can also be recovered from the IL, and the IL can be recycled.",
                "Thus in the first aspect the invention provides a process for the extraction of metal pollutants from treated cellulosic biomass comprising contacting the treated cellulosic biomass with an ionic liquid, said ionic liquid comprising an anion and an organic cation. As used herein an “organic” cation refers to a cation containing carbon and hydrogen and optionally one or more heteroatoms such as oxygen, nitrogen, phosphorous and sulfur.",
                "“Extraction” as used herein refers to the removal of metal ions from the treated cellulosic or lignocellulosic biomass. The metal ions dissolve in the ionic liquid. The extraction process removes sufficient metal so that fermentation of the cellulose rich material produced is not inhibited by the presence of the metal pollutants. At least 50% of the metal present in the treated cellulosic or lignocellulosic biomass is removed, more preferably at least 60%, 70%, 75%, 80%, 85%, 90%, 95% or 99% of the metal present. Most preferably the process removes at least 85% of the metal present.",
                "As used herein the term “cellulosic” or “lignocellulosic biomass” refers to living or dead biological material that can be used in one or more of the disclosed processes. It can comprise any cellulosic or lignocellulosic material and includes materials comprising cellulose, and optionally further comprising hemicellulose, lignin, starch, oligosaccharides and/or monosaccharides, biopolymers, natural derivatives of biopolymers, their mixtures, and breakdown products. It can also comprise additional components, such as protein and/or lipid. The biomass can be derived from a single source, or it can comprise a mixture derived from more than one source. Some specific examples of biomass include, but are not limited to, bioenergy crops, agricultural residues, municipal solid waste, industrial solid waste, sludge from paper manufacture, sewage sludge, residue from composting, food waste, spent distilling grain, spent Brewer's yeast, anaerobic digestive, yard waste, wood and forestry waste. Additional examples of biomass include, but are not limited to, corn grain, corn cobs, crop residues such as corn husks, corn stover, grasses including Miscanthus×giganteus, Miscanthus sinensis and Miscanthus sacchariflorus, wheat, wheat straw, hay, rice straw, switchgrass, waste paper, sugar cane bagasse, sorghum, soy, components obtained from milling of grains, trees (e.g. pine), branches, roots, leaves, wood chips, wood pulp, sawdust, shrubs and bushes, vegetables, fruits, flowers, animal manure, multi-component feed, and crustacean biomass (i.e., chitinous biomass). It may be preferable to treat the biomass before use in the method of the invention. For example the biomass could be mechanically treated e.g. by milling or shredding.",
                "Preferably, the treated cellulosic biomass is a treated lignocellulosic biomass. “Treated cellulosic” or “treated lignocellulosic biomass” as used herein refers to wood or other cellulose or lignocellulose containing biomass which has been processed so that it contains metal or metal ions (metal pollutants). For example it has been treated with a preservative or other metal-based formulation e.g. copper-based fungicide. The preservative is preferably a metal based preservative such as one containing an alkaline copper quaternary (ACQ), copper azole (CA, Tanalith E), micronized copper quaternary (MCQ), or Chromated copper arsenate (CCA, Tanalith C). It also includes wood or other cellulosic or lignocellulosic biomass which has been painted for example with a lead-based paint, or paint containing titanium dioxide. Other forms of treated cellulosic or lignocellulosic biomass include sewage sludge, which may contain cadmium (II) and/or mercury (I/II), waste paper and municipal solid waste which may contain titanium as titanium dioxide. Preferably the treated cellulosic biomass is a lignocellulosic biomass, such as wood treated with a preservative.",
                "A “metal pollutant” as used herein is a metal present within the cellulosic or lignocellulosic biomass which is not present in the cellulosic or lignocellulosic biomass in its natural state. The metal pollutant is preferably present as an oxidised metal compound or metal ions. In particular it refers to a metal which inhibits the downstream hydrolysis and/or fermentation of the cellulose rich material derived from the cellulosic or lignocellulosic biomass. The metal is preferably selected from zinc (II), lead (II), copper (II), arsenic (V), iron (II/111), titanium and chromium (VI).",
                "Preferably the metal is selected from copper (II), arsenic (V) or chromium (VI), more preferably copper (II). The metal is preferably derived from a preservative.",
                "The IL is preferably heated with the biomass at 100-180° C., preferably 120-170° C. The reaction is carried out for 5 min-22 hours, preferably 20 min-13 hours, more preferably 30 min-8 hours i.e. 10, 15, 20, 30, 45 min, 1 hr, 2 hr, 3 hr, 4 hr, 5 hr, 6 hr, 7 hr, 9 hr, 10 hr, 11 hr, 12 hr, 15 hr, 17 hrs, 20 hrs and ranges there between. Preferably the mixture is stirred, for example at 50-200 rpm.",
                "As used herein “ionic liquid” refers to an ionized species (i.e. cations and anions). Typically they have a melting point below about 100° C. It is important to choose an ionic liquid which is both thermally and chemically stable, so that is does not decompose during the treatment process or electrodeposition. The ionic liquid comprises one or more anion with one or more cation.",
                "The anion is preferably selected from C1-20alkyl sulfate [Alkyl SO4]−, chloride [Cl]−, bromide [Br]−, hydrogen sulfate [HSO4]−, hydrogen sulfite [HSO3]−, Trifluoromethanesulfonate [OTf]− and acetate [OAc]− or mixtures thereof. More preferably the anion is chloride [Cl]−, or hydrogen sulfate [HSO4]−.",
                "Preferably but not essentially, the lignin in the wood or lignocellulosic biomass is soluble in the ionic liquid at the treatment temperature, but the cellulose is not, so that a solid residue or pulp comprising the cellulose is produced. Other components such as hemicellulose may preferably also dissolve in the ionic liquid. The metal pollutants are retained in the ionic liquid.",
                "The cation is preferably a protic cation ion, i.e. they are capable of donating a H+ (proton).",
                "The cation ion can be an ammonium derivative. These cations have the general formula",
                "wherein",
                "X is N; and",
                "A1 to A4 are each independently selected from H, an aliphatic, C3-6 carbocycle, C6-10 aryl, alkylaryl, and heteroaryl.",
                "Preferably at least one of A1 to A4 is H. Preferably A1 to A4 are each independently selected from H, and an aliphatic. In one embodiment one of A1 to A4 is H, and the remaining three are each independently an aliphatic. Alternatively two of A1 to A4 are each H and the remaining two are each independently an aliphatic. Alternatively one of A1 to A4 is an aliphatic, and the remaining three are all H. Preferably the cation is not ammonium (NH4+.) i.e. at least one of A1 to A4 is not H.",
                "The term “aliphatic” as used herein refers to a straight or branched chain hydrocarbon which is completely saturated or contains one or more units of unsaturation. Thus, aliphatic may be alkyl, alkenyl or alkynyl, preferably having 1 to 12 carbon atoms, preferably up to 6 carbon atoms or more preferably up to 4 carbon atoms. The aliphatic can have 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, or 12 carbon atoms.",
                "The term “alkyl” as used herein, is typically a linear or branched alkyl group or moiety containing from 1 to 20 carbon atoms, such as 11, 12, 13, 14, 15, 16, 17, 18, or 19 carbon atoms. Preferably the alkyl group or moiety contains 1-10 carbon atoms i.e. 2, 3, 4, 5, 6, 7, 8, 9, or 10 carbon atoms such as a C1-4 alkyl or a C1-6 alkyl group or moiety, for example methyl, ethyl, n-propyl, i-propyl, n-butyl, i-butyl and t-butyl, n-pentyl, methylbutyl, dimethylpropyl, n-hexyl, 2-methylpentyl, 3-methylpentyl, 2,3-dimethylbutyl, and 2,2-dimethylbutyl.",
                "As used here in the term “alkenyl” refers to a linear or branched alkenyl group or moiety containing from 2 to 20 carbon atoms, such as 11, 12, 13, 14, 15, 16, 17, 18, or 19 carbon atoms. Preferably the alkyl group or moiety contains 2-10 carbon atoms i.e. 3, 4, 5, 6, 7, 8, 9, or 10 carbon atoms such as a C2-4 alkenyl or a C2-6 alkenyl group or moiety, for example ethenyl, 2-propenyl, 1-propenyl.",
                "The term “carbocycle” as used herein refers to a saturated or partially unsaturated cyclic group having 3 to 6 ring carbon atoms, i.e. 3, 4, 5, or 6 carbon atoms. A carbocycle is preferably a “cycloalkyl”, which as used herein refers to a fully saturated hydrocarbon cyclic group. Preferably, a cycloalkyl group is a C3-C6 cycloalkyl group.",
                "The term “C6-10 aryl group” used herein means an aryl group constituted by 6, 7, 8, 9 or 10 carbon atoms and includes condensed ring groups such as monocyclic ring group, or bicyclic ring group and the like. Specifically, examples of “C6-10 aryl group” include phenyl group, indenyl group, naphthyl group or azulenyl group and the like. It should be noted that condensed rings such as indan and tetrahydro naphthalene are also included in the aryl group.",
                "The terms “alkylaryl” as used herein refers to an alkyl group as defined herein substituted with an aryl as defined above. The alkyl component of an “alkylaryl” group may be substituted with any one or more of the substituents listed above for an aliphatic group and the aryl or heteroaryl component of an “alkylaryl” or “alkylheteroaryl” group may be substituted with any one or more of the substituents listed above for aryl, and carbocycle groups. Preferably, alkylaryl is benzyl.",
                "The term “heteroaryl” as used herein refers to a monocyclic or bicyclic aromatic ring system having from 5 to 10 ring atoms, i.e. 5, 6, 7, 8, 9, or 10 ring atoms, at least one ring atom being a heteroatom selected from O, N or S.",
                "An aryl, heteroaryl, or carbocycle group as referred to herein may be unsubstituted or may be substituted by one or more substituents independently selected from the group consisting of halo, lower alkyl, —NH2, —NO2, —OH —COOH, or —CN.",
                "The term “halogen atom” or “halo” used herein means a fluorine atom, a chlorine atom, a bromine atom, an iodine atom and the like, preferably a fluorine atom or a chlorine atom, and more preferably a fluorine atom.",
                "Preferably the cation is an alkylammonium or a mixture thereof, preferably protic alkylammoniums, although aprotic alkylammoniums may also be used. Optionally one or more of the alkyl groups may be substituted with —OH to form an alkanolammonium, which can also be referred to as an alcoholammonium. As used herein an “alkylammonium” includes tetraalkylammoniums, trialkylammoniums, dialkylammoniums, monoalkylammoniums, and alcoholammoniums including trialcoholammoniums, dialcoholammoniums and monoalcoholammonium. Trialkylammoniums include trimethylammonium, triethylammonium, and triethanolammonium. Examples of dialkylammoniums include diethylammonium, diisopropylammonium, and diethanolammonium. Monoalkylammoniums include methylammonium, ethylammonium, and monoethanolammonium.",
                "Preferably the tetraalkylammonium is aprotic, i.e. not capable of acting as a proton donor.",
                "Preferred alkylammonium cations are triethylammonium, diethylammonium dimethylethylammonium, diethylmethylammonium, dimethylbutylammonium and diethanolammonium.",
                "The ionic liquid may contain one of the listed ammonium cations, or a mixture thereof.",
                "The cation can also contain a nitrogen-containing heterocyclic moiety which, as used herein, refers to mono- or bicyclic ring systems which include one nitrogen atom and optionally one or more further heteroatoms selected from N, S and O. The ring systems contain 5-9 members, preferably 5 or 6 members for monocyclic groups, and 9 or 10 members for bicyclic groups. The rings can be aromatic, partially saturated or saturated and thus, includes both a “heteroalicyclic” group, which means a non-aromatic heterocycle and a “heteroaryl” group, which means an aromatic heterocycle. The cation is preferably selected from",
                "wherein R1 and R2 are independently selected from H, a C1-6 alkyl or a C1-6 alkoxyalkyl group, and R3, R4, R5, R6, R7, R8 and R9, when present are independently H, a C1-6 alkyl, C1-6 alkoxyalkyl group, or C2-6 alkyoxy group. Preferably R1 and R2 are C1-4 alkyl, with one being methyl and R3-R9, (R3, R4, R5, R6, R7, R8 and R9), when present, are H. Preferably the cation ring is imidazolium or pyridinium.",
                "“C2-6 Alkoxy” refers to the above C1-6 alkyl group bonded to an oxygen that is also bonded to the cation ring. A “C2-6 alkoxyalkyl group” refers to an alkyl containing an ether group, with the general formula X—O—Y wherein X and Y are each independently a C1-5 alkyl and the total number of carbon atoms is between 2 and 6 e.g. 2, 3, 4, 5, or 6.",
                "Preferred cations are imidazolium based cations or a mixture thereof in particular protic imidazolium based cations. Preferably the imidazolium based cations is selected from 1-ethyl-3-methylimidazolium ([EMIM]+), 1-butylimidazolium ([HBIM]+) and 1-methylimidazolium ([HMIM]+, also referred to as [HC1im]+ herein) or a mixture thereof.",
                "Preferred cations include protic alkylammonium, protic methylimidazolium, protic pyridinium, aprotic tetraalkylammonium and aprotic dialkylimidazolium ions.",
                "The ionic liquid may contain one of the listed cations, or a mixture thereof.",
                "Preferred ionic liquids for use in the invention are triethylammonium hydrogen sulfate [TEA][HSO4], N,N-dimethyl-N-butylammonium hydrogen sulfate [DM BA][HSO4], 1-methylimidazolium hydrogen sulfate [HMIM][HSO4], I butylimidazolium hydrogen sulfate [HBIM][HSO4], diethylammonium hydrogen sulfate [DEA][HSO4], diethanolammonium Chloride [DEtOHA][Cl], 1-methylimidazolium hydrogen chloride [HMIM][Cl], 1-ethyl-3-methylimidazolium chloride [EMIM][Cl], 1-ethyl-3-methylimidazolium acetate [EMIM][OAc], 1-ethyl-3-methylimidazolium trifluoromethanesulfonate [EMIM][OTf]. Particularly preferred ionic liquids are 1-methylimidazolium hydrogen sulfate [HMIM][HSO4] and 1-methylimidazolium chloride [HMIM][Cl].",
                "Ionic liquids can be prepared by methods known to the person skilled in the art or obtained commercially. For example, the ILs can be made from a simple alkylamine, such as triethylamine, and sulfuric acid in a one-step synthesis, for example as described in George et al., (2015) “Design of low-cost ionic liquids for lignocellulosic biomass treatment” Green Chemistry 17:1728-173.",
                "Usually in an ionic liquid the cation and anion are present in equimolar amounts. However, the ionic liquid may preferably comprise excess base, preferably protonated base. ‘Base’ as used herein refers to the base from which the cation is derived e.g. amine/imidazole. Preferably the ionic liquid comprises 10% molar excess base, preferably 4-8%, 5-7.5% excess base. The ionic liquid may comprise 2%, 3%, 4%, 5%, 6%, 7%, 8% 9% or 10% molar excess base.",
                "It has been surprisingly found that the yield in the saccharification step can be improved if the ionic liquid composition comprises water. Therefore in one preferred embodiment the composition comprises the IL and 10-40% v/v water. Preferably the composition comprises 20-30% v/v water. Water is added at around 20% to prevent reactions between IL and treated cellulosic or lignocellulosic biomass, reduce viscosity and promote depolymerisation of lignin.",
                "It has also been discovered that the presence of an excess of acid accelerates the pre-treatment resulting in improved lignin removal and thus enhanced saccharification yields, as lignin interferes with the enzyme binding. Thus, the glucose yield is improved. Therefore in one preferred embodiment the composition further comprises 0.01-20% molar excess acid, preferably 1-5% molar excess acid, as a percentage of the IL. The addition of a small amount of acid significantly accelerates the pre-treatment process, when other variables such as water content and temperature are kept constant. The acid can be selected from any known strong acid such as hydrochloric acid, sulfuric acid, nitric acid, phosphoric acid hydroiodic acid, perchloric acid and hydrobromic acid. Preferably the acid is sulfuric or, hydrochloric or phosphoric acid.",
                "In a preferred embodiment the treated cellulosic or lignocellulosic biomass is contacted with the ionic liquid composition prior to mechanical treatment. It has been found that contacting the treated cellulosic or lignocellulosic biomass with the ionic liquid can reduce the energy required to grind the treated cellulosic or lignocellulosic biomass. The IL composition appears to work as a lubricant during the grinding phase. The treated cellulosic or lignocellulosic biomass can be impregnated briefly with an IL composition at slightly elevated temperature (70-100° C., preferably 90° C.) to harness their lubrication properties before a mechanical size reduction step is applied. The IL composition can be contacted with the treated cellulosic or lignocellulosic biomass for any length of time from several minutes to 18 hours or longer, preferably 5 minutes to 1 hour. This can be followed by further treatment with an ionic liquid composition as described herein to extract the metal pollutants and also solubilise the lignin content of the treated lignocellulosic biomass.",
                "This invention adds a novel aspect to the fractionation of cellulosic or lignocellulosic biomass with ionic liquids by integrating the cellulose or lignocellulose fractionation with pollutant metal extraction. As described in the examples, pre-treatments with an ionic liquid of softwood impregnated with a copper-based preservative achieved up to 98% removal of the CuII in a single pass.",
                "The metal can be recovered from the IL, thereby providing an additional income stream, and by removing the metal pollutant increases the value of biomass utilised, as the cellulosic or lignocellulosic biomass will be converted from a negative-value waste into a positive-value fuel resource (FIG. 1). Cellulosic biofuel production and hazardous waste wood processing in one step has not been described previously.",
                "Ionic liquids are highly conductive solvents due to their ionic nature and regarded as superior media for the electrodeposition of metals and semiconductors. Key advantages that enable the ILs to overcome the limits imposed by common aqueous or organic media are their wide electrochemical windows, spanning up to 6 V in some cases; low vapour pressures, which allow electrodeposition at temperatures well above 100° C., and numerous, only partly understood, cation/anion effects that make it possible to influence the morphology and crystal size of deposits. Electrodeposition is currently not practised for the recovery of metals from dilute heavy metal-containing IL waste streams.",
                "The process may preferably further comprise electrodeposition of the metal pollutant from the ionic liquid. The electrodeposition can be carried out by applying an appropriate current per unit electrode area from a transformer-rectifier, as used industrially for recovery of many metals from aqueous electrolyte solutions. Other suitable methods include chronoamperometry and chronopotentiometry. Electrodeposition allows the metal pollutant to be recovered as a solid metal or alloy. Recovery of metals by electrodeposition provides an added revenue stream which could provide $10 worth (assuming a price of $5,000 (tonne Cu)−1) of Cu0 per tonne of treated wood (containing 2000 ppm of CuII). The electrical energy costs required for the process are estimated as an order of magnitude lower than the value of the recovered copper. The process also eliminates the need to landfill metal containing ashes. In addition recycling of metals may contribute to a reduced reliance on foreign imports of metals (strengthen local resource resilience) and also reduce the environmental impact of mining.",
                "After the electrodeposition process, the ionic liquid can be recycled or re-used to process further treated cellulosic or lignocellulosic biomass in step (a) and/or step (ci).",
                "The ionic liquids of the present invention dissolve the lignin within the biomass but do not dissolve the cellulose. The majority of cellulose remains solid, preferably at least 90%, more preferably 95%. It can be easily removed from the liquid phase mechanically, for example by filtration. The separated solid residue or pulp can then be washed and used in the saccharification process. This removes the need for a separate precipitation step to obtain the cellulose once the biomass has been treated. Thus the method of the invention may preferably further comprise the step of separating the ionic liquid from the cellulose containing solid residue produced in step (a) from the ionic liquid.",
                "The cellulose containing solid residue may be washed with ionic liquid or an organic solvent miscible with the ionic liquid. The separation efficiency and the ionic liquid recovery can be enhanced by washing the cellulose containing solid residue with ionic liquid or an organic solvent that is miscible with the ionic liquid. Examples of suitable organic solvents include aliphatic alcohols such as methanol and ethanol. After washing, the organic solvent can be separated from the cellulose containing solid residue, and added to the ionic liquid from step (a). The organic solvent is removed before or potentially after the lignin is precipitated. The organic solvent can be removed from the ionic liquid using conventional methods known to the skilled person. For example the volatile organic solvents can be removed by distillation.",
                "It is possible to precipitate the lignin dissolved in the IL compositions. Therefore the method may further comprise\n\n\n- - (d) adding an anti-solvent to the ionic liquid which has been\n    separated from the cellulose containing solid residue produced in\n    step (a), to precipitate out the dissolved lignin and optionally\n    separating the precipitated solid from the anti-solvent/ionic\n    liquid.",
                "As used herein an “anti-solvent” or precipitate is a liquid which causes the lignin to precipitate out from the ionic liquid containing the solubilised lignin produced in step (a). The anti-solvent is preferably water or ethanol. The ionic liquid can be recovered by removing the anti-solvent, for example by evaporation. The resulting ionic liquid can then be recycled to be used again in the method. Thus the method may further comprise removing the anti-solvent from the ionic liquid obtained in (d).",
                "The ionic liquid may need to be dried to remove excess water. The water may be removed by conventional methods such as evaporation. The water may be removed after step (a) and/or after the lignin has been precipitated. As the presence of some water improves the yield less energy is required to dry the IL.",
                "The cellulose containing solid residue obtained from the method of the invention can undergo saccharification, for example by enzymatic hydrolysis, to obtain glucose. The glucose can then be used in a fermentation process to obtain biofuel. Therefore the process can further comprise saccharification of the cellulose containing solid residue to obtain glucose. The cellulose containing solid residue used in the saccharification step may be the cellulose containing solid residue obtained in the initial step, step (a), or the washed solid residue obtained in step (c). The invention also provides a cellulose containing solid residue obtained by a suitable method of the invention; for example as obtained by the process comprising any one or more of steps (a-c). In a further aspect the invention provides a process of preparing glucose from treated cellulosic or lignocellulosic biomass comprising subjecting a cellulose containing solid residue obtained by suitable methods of the invention to enzymatic hydrolysis. In a further aspect the invention provides glucose obtained by this hydrolysis.",
                "Suitable enzymes for use in the process include commercially available preparations of cellulases such as T. reseei cellulase and Novozyme 188 cellobiase that also contains hemicellulolytic activity. Other useful enzymes include esterases, either acetyl esterases or feruloyl esterases, which cleave substituents that are esterified to hemicellulose. The process is preferably carried out in an aqueous medium at a suitable pH for the enzymes. The conditions can be optimised in relation to pH, temperature and the medium used depending on the enzyme mixture required. Such methods are well known to the skilled person. The process is preferably carried out in accordance with “Enzymatic saccharification of lignocellulosic biomass” (NREL/TP-510-42629), issue date Mar. 21, 2008.",
                "In summary the process of the invention may comprise the following steps:\n\n\n- - (a) contacting the treated cellulosic or lignocellulosic biomass\n    with an ionic liquid, said ionic liquid comprising an anion and a\n    cation;\n  - (b) optionally separating the cellulose containing solid residue\n    obtained in step (a) from the ionic liquid;\n  - (c) optionally washing the cellulose containing solid residue at\n    least once with ionic liquid or an organic solvent miscible with the\n    ionic liquid; and separating the cellulose containing solid residue\n    from the ionic liquid or organic solvent and optionally adding the\n    ionic liquid or organic solvent to the ionic liquid obtained in (b);\n  - (d) optionally adding an anti-solvent to the ionic liquid obtained\n    in (b) to precipitate the lignin;\n  - (e) optionally removing water from the ionic liquid, after step (b)\n    and/or after step (d);\n  - (f) electrodeposition of the metal pollutant from the ionic liquid\n    obtained in steps (b), and/or (c) and/or (e);\n  - (g) optionally recycling the ionic liquid after step (f) to be used\n    in step (a) and/or step (c);  \n    and\n  - (h) optionally saccharification of the cellulose containing solid\n    residue obtained in any of steps (a), (b) and/or (c) to obtain\n    glucose.",
                "The invention further provides for the use of an ionic liquid as defined herein to extract metal from a treated cellulosic or lignocellulosic biomass source, preferably a wood source which has been treated with a preservative, in particular a metal based preservative. The ivention further provides the use of an ionic liquid as defined herein, ins a methodof extration metal from a treated cellulosic or lignocellulosic biomass source as described herein.",
                "The temperature and time period are not essential for the extraction of the copper (II), but they will have a major impact on the sugar yields achieved from enzymatic saccharification of the pulps."
            ],
            "subsections": [
                {
                    "title": "EXAMPLE 1. DECONSTRUCTION OF BIOMASS AND EXTRACTION OF METALS IN VARIOUS IONIC LIQUIDS",
                    "paragraphs": [
                        "A flow chart of the deconstruction and extraction process is summarized in FIG. 1. An ionic liquid/water mixture was prepared by adding the required amount of water to the dried ionic liquid. The water content was confirmed by Karl-Fischer titration in triplicate. Pre-treatments were run in triplicate. 10±0.05 g of ionic liquid/water master-mix was weighed into a glass pressure tube and the exact weight recorded. Copper azole treated softwood (1.0 g oven-dried basis) with particle sizes of 180-850 μm was added and the tube tightly closed and the contents mixed with a Vortex shaker until all of the biomass had been in contact with the ionic liquid. The vial was placed in a preheated convection oven at 170° C. for 30 min. After the incubation, the mixture was transferred into a 50 mL centrifuge tube. This was facilitated by diluting with 40 mL of ethanol. The contents were mixed using a vortex shaker and left at room temperature for one hour. The tube was then centrifuged and the solids and liquids decanted carefully into a round bottom flask. The solid was further washed by repeating the washing step 2-3 more times. The remaining solid (pulp) was then transferred into a cellulose thimble and further washed by Soxhlet extraction with refluxing ethanol (150 mL) for 22 hours. The pulp was left to dry in the thimble on the bench overnight. The ethanol used for the Soxhlet extraction was combined with the previous washes and evaporated under reduced pressure at 40° C., leaving the dried ionic liquid/lignin mixture. To the dried ionic liquid/lignin mixture, 30 mL of water was added in order to precipitate the lignin. The suspension was transferred into a 50 mL falcon tube, shaken for one minute and then left at room temperature for at least 1 hour. The tube was centrifuged and the supernatant decanted and collected in a round bottom flask. This washing step was repeated three more times and the washings combined.",
                        "The air-dried pulp yield was determined by weighing the recovered biomass from the cellulose thimbles. The oven-dried yield was determined as described below. The lid of the centrifuge tube containing the lignin was pierced and the tube put into a vacuum oven overnight for drying the lignin at 40° C. under vacuum. The dried lignin was weighed the next day to determine the lignin yield.",
                        "Saccharification",
                        "Enzymatic saccharification was performed in triplicate according to LAP “Enzymatic saccharification of lignocellulosic biomass” (NREL/TP-510-42629), issue date Mar. 21, 2008. The enzymes were Novozymes experimental enzyme mixture NS-22201. Glucose yields were calculated based on the glucose content of the untreated biomass. 50 μL of enzyme solution was used per 100 mg of sample.",
                        "Compositional Analysis",
                        "The glucan, hemicellulose and lignin content of copper treated timber was determined following the LAP procedures “Preparation of samples for compositional analysis” (NREL/TP-510-42620), issue date Aug. 6, 2008 and Determination of Structural Carbohydrates and Lignin in Biomass” (NREL/TP-510-42618 version Aug. 3, 2012). The extractives in untreated copper treated timber were removed and quantified according to the LAP “Determination of extractives in biomass” (NREL/TP-510-42619), issued Jul. 17, 2005. The oven-dry weight (ODW) of lignocellulosic biomass was determined according to the procedure described in the LAP “Determination of Total Solids in Biomass and Total Dissolved Solids in Liquid Process Samples” (NREL/TP-510-42621) issued Mar. 31, 2008.",
                        "Metal Content",
                        "Inductively coupled plasma optical emission spectrophotometry (ICP-OES) was used to analyse the ionic liquid liquor on its metal content and run in triplicate on a Perkin Elmer Optima 2000 DB instrument. A mixed metal standard for ICP analysis was obtained from Sigma Aldrich (TraceCERT grade) and diluted to the required concentrations with 5% nitric acid.",
                        "The water content of the ionic liquid liquors was determined by Karl-Fischer titration. The liquors were diluted to below 10 ppm of copper and a maximum of 1 wt % ionic liquid concentration with 5% nitric acid and then analysed by ICP-OES.",
                        "Approximately 100 mg of ground wood samples were weighed out and the exact weight recorded (±0.1 mg, Mettler Toledo NewClassic MS). The samples were digested in 1 mL 69% nitric acid in a closed PTFE vessel (MARSXpress vessels and microwave with power/time control by CEM with the following sequence: 300 W at 83% power for 5 min, 600 W at 66% power for 5 min and 1200 W at 58% power for 6 min). The obtained solution was cooled in a freezer for an hour before diluting to 10 mL with 5% nitric acid and filtration through a 0.4 μm PTFE syringe filter.",
                        "The measured wood's copper content was used to calculate the percentage of copper extracted into the ionic liquid.",
                        "Results and Discussion",
                        "Ionic Liquid Screening Experiments for the Extraction of Copper(II) from CA Treated Softwood",
                        "FIG. 2 displays the composition of the copper treated wood as analysed by compositional analysis.",
                        "The following ionic liquids were screened for their suitability to fractionate/pre-treat biomass and to extract copper from the biomass, where [TEA] stands for triethylammonium, [DMBA] for N,N-dimethyl-N-butylammonium, [DEA] for diethylammonium, [DEtOHA] for diethanolammonium, [HMIM] for 1-methylimidazolium and [EMIM] for 1-ethyl-3-methylimidazolium:",
                        "Table 3 displays the copper (II) extraction, saccharification yield as well as pulp and lignin yields after pre-treatment of the copper azole treated softwood with the tested ILs as a percentage of the total initial biomass.",
                        "The data shown here suggests that [HSO4]−, [Cl]− and [OAc]− ILs are capable of the extraction of 81-98% of the present copper (II) from treated softwood. The only IL studied here that extracted significantly lower amount of copper was [EMIM][OTf] which extracted 68% of the copper (II). A wider range of results was obtained for the saccharification of the recovered cellulose rich pulp; the highest glucose yields were obtained for enzymatic saccharification of [DMBA][HSO4] and [HMIM][Cl] pre-treated biomass (above 70% of theoretical). Lower yields but still significant improvements compared to untreated biomass were obtained with [TEA][HSO4], [EMIM][OAc] and [EMIM][Cl].",
                        "CCA Treated Wood",
                        "Pre-treatments of chromated copper arsenate (CCA) treated softwood with [HBIM][HSO4], where [HBIM] stands for 1-butylimidazolium, were conducted at 170° C. for 30 min. Saccharification yields obtained were 52.5% and the metal extraction is displayed in table 4. All three metals were extracted nearly quantitatively (≥98%).",
                        "Mixed Infeed and Processed Wood",
                        "Mixed unprocessed and processed wood waste obtained (unprocessed wood is chipped waste wood of various origin, processed wood is the same type of wood that had part of the metals, mainly iron, removed mechanically) were pre-treated at 170° C. for 30 min with two different ILs, [HC1im][Cl] and [HC1im][HSO4]. The original metal content as well as the amounts extracted for unprocessed and processed wood are displayed in Tables 5 and 6 respectively. Higher saccharification yields were obtained with [HC1im][Cl] and measured to be 53 and 60% for unprocessed and processed wood respectively.",
                        "The presented results suggest very high extraction efficiencies in the range of 80-99%, for zinc (II), lead (II), chromium (VI) and copper (II) are possible with [HC1im][Cl] in the absence of a chelating agent."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce deconstruction and extraction process",
                        "prepare ionic liquid/water mixture",
                        "add biomass to ionic liquid mixture",
                        "incubate mixture at 170° C.",
                        "transfer mixture to centrifuge tube",
                        "wash and centrifuge mixture",
                        "Soxhlet extract pulp with ethanol",
                        "evaporate ethanol and recover ionic liquid/lignin mixture",
                        "precipitate lignin with water",
                        "determine pulp and lignin yields",
                        "perform saccharification",
                        "determine glucose yields",
                        "analyse metal content by ICP-OES",
                        "discuss results and extraction efficiencies"
                    ],
                    "num_characters": 7454,
                    "outline_medium": [
                        "outline deconstruction and extraction process",
                        "describe ionic liquid preparation",
                        "detail biomass pre-treatment",
                        "explain saccharification procedure",
                        "describe compositional analysis",
                        "outline metal content analysis",
                        "present results and discussion"
                    ],
                    "outline_short": [
                        "describe deconstruction and extraction process",
                        "detail experimental procedures for saccharification and compositional analysis",
                        "present results of ionic liquid screening experiments for copper extraction"
                    ]
                },
                {
                    "title": "EXAMPLE 2 COPPER SOLUBILITY AND ELECTRODEPOSITION OF COPPER FROM VARIOUS IONIC LIQUIDS COPPER SOLUBILITY",
                    "paragraphs": [
                        "Solubility measurements were conducted in order to establish solubility limits in one of the investigated protic ionic liquids 1-methylimidazolium hydrogen sulfate ([HC1im][HSO4], shown below, top). For comparison, solubility was also tested in the more inexpensive triethylammonium hydrogen sulfate [TEA][HSO4] (shown below, bottom).",
                        "The solubilities were tested by dissolving copper oxide in the ionic liquid until no further dissolution was observed overnight. The remaining solids were filtered off and the obtained solutions subjected to ICP-OES. In order to investigate if excess base improved solubilities, 5 wt % excess amine/imidazole was used in a further test. The results are displayed in FIG. 3. The maximum copper(II) solubilities at 20 wt % water are also summarised in table 7.",
                        "FIG. 3 shows that the water content plays a deciding role in the copper dissolution capability of the ionic liquid. Solubility peaks at around 60 wt % and 80 wt % water in the case of [HC1im][HSO4] and [TEA][HSO4] respectively. Peak solubility is around 72,000 ppm or 7.2 wt % in the case of [HC1im][HSO4] and 33,000 ppm or 3.3 wt % in the case of [TEA][HSO4]. At higher base contents the dissolution capacity of [HC1im][HSO4] is improved to around 93,000 ppm or 9.3 wt % at 60 wt % water. Pre-treatments however cannot be conducted at water contents above around 30% which means that solubilities at around 20 wt % water are more important for the here conducted study. From table 7 we can see that at 20 wt % water the solubility in [HC1im][HSO4] was improved from 4752 ppm to 10845 ppm by the addition of 5% excess base while in the case of [TEA][HSO4]dissolution capability was improved from 2043 ppm to 13712 ppm. [HC1im][HSO4] and [TEA][HSO4] with 5 wt % excess base therefore reach a similar dissolution capacity within the measurement error.",
                        "While these tests were conducted by dissolving Cu(II) oxide, copper bound in the biomass is expected to be extracted in a similar manner.",
                        "Electrochemical Properties of [HC1im][HSO4]",
                        "For a successful deposition of copper from the ionic liquid, electrochemical stability of the IL needs to be guaranteed in order to make the process viable. FIG. 4 shows maximum currents obtained at −1 V vs. Ag in [HC1im][HSO4] with different water contents. The almost dry IL (2 wt % water) shows very small currents at very reducing potentials, suggesting that the ionic liquid is electrochemically stable under these conditions. The higher water content ILs exhibit higher current densities due to the occurrence of water reduction leading to hydrogen evolution. The current density reaches a maximum at 25 wt % water and then decreases again. The hydrogen evolution reaction can be linked to acidity of the medium. The data presented here suggest that acidity of the ionic liquid maximises at around 25 wt % water.",
                        "Copper Deposition",
                        "The deposition of copper out of an ionic liquid liquor was shown for [HC1im][HSO4] as well as for the less expensive triethylammonium hydrogen sulfate ([TEA][HSO4]) by means of cyclic voltammetry and chronoamperometry. In both cases, liquor from biomass pre-treatment was saturated with copper (II) ions by dissolution of CuO and filtering off undissolved solid. The liquors tested contained 20 wt % water in order to mimic the conditions of pre-treatment.",
                        "Preliminary results of solubility tests of CuO in the two protic ionic liquids show a higher solubility in the imidazolium salt than in the alkylammonium salt. Therefore the focus of further tests has been on the imidazolium salt. In order to establish the effect of biomass degradation products present in the liquor on the deposition behaviour of copper, a cyclic voltammogram (FIG. 5) of copper (II) saturated fresh ionic liquid was compared to that obtained from the copper (II) saturated recycled ionic liquid. The oxidation current peak due to Cu→CuII+2e− at ca. 0.1 V in the positive-going voltammetric scan of the recycled liquor was shifted slightly towards higher potentials compared to the fresh ionic liquid and exhibited a small side peak before the main peak. However, the potentials (ca. −0.15 V) of current onsets for the oxidation (Cu→CuII+2e−) and reduction (CuII+2e−→Cu) were almost identical. Integration of current-time data further confirmed that the copper deposition was not measurably affected by biomass degradation products, as charge efficiencies in both cases were around 94% under the tested conditions."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce copper solubility measurements",
                        "dissolve copper oxide in ionic liquid",
                        "filter and analyse solutions by ICP-OES",
                        "investigate effect of excess base on solubility",
                        "display solubility results in FIG. 3",
                        "discuss effect of water content on solubility",
                        "summarize maximum copper solubilities in table 7",
                        "discuss implications for biomass pre-treatment"
                    ],
                    "num_characters": 4461,
                    "outline_medium": [
                        "introduce copper solubility measurements",
                        "describe solubility testing procedure",
                        "present solubility results",
                        "discuss electrochemical properties of ionic liquids"
                    ],
                    "outline_short": [
                        "describe solubility measurements of copper oxide in ionic liquids",
                        "discuss electrochemical properties and copper deposition from ionic liquids"
                    ]
                }
            ],
            "outline_long": [
                "introduce metal pollutants in wood",
                "describe wood treatment with metal-based preservatives",
                "mention toxicity of copper, arsenic, and chromium",
                "describe limitations of wood disposal",
                "introduce controlled landfill method",
                "describe thermal treatment and disposal of metal-enriched ash",
                "introduce leaching and disposal of chemically precipitated metal ions",
                "describe acid leaching and metal recovery",
                "mention electrodeposition of Cu(II) from aqueous solution",
                "discuss techno-economic model for dilute acid-leaching",
                "estimate operating cost of metal extraction",
                "compare cost of virgin wood feedstock for biofuel production",
                "introduce use of contaminated waste wood as feedstock for biorefinery",
                "describe electrochemical recovery of metals",
                "introduce lignocellulosic biomass composition",
                "describe cellulose, hemicellulose, and lignin components",
                "explain cellulosic biofuel production process",
                "mention limitations of using preservative-treated biomass",
                "introduce ionic liquid fractionation of cellulose and lignin",
                "describe process of extracting metals from treated cellulosic biomass",
                "define \"extraction\" and \"cellulosic\" or \"lignocellulosic biomass\"",
                "describe metal pollutant removal efficiency",
                "introduce treated cellulosic biomass and metal-based preservatives",
                "define \"metal pollutant\" and its effects on downstream processes",
                "describe preferred metal pollutants and their sources",
                "introduce ionic liquid composition and properties",
                "describe preferred anions and cations for ionic liquid",
                "introduce protic cation ion and ammonium derivative",
                "describe aliphatic, alkyl, alkenyl, and carbocycle groups",
                "introduce lignin solubility in ionic liquid",
                "describe solid residue or pulp production",
                "mention hemicellulose solubility in ionic liquid",
                "describe metal pollutant retention in ionic liquid",
                "introduce heating and stirring conditions for reaction",
                "describe reaction time and temperature ranges",
                "define heteroaryl",
                "define aryl or carbocycle group",
                "define halogen atom",
                "describe alkylammonium cations",
                "describe trialkylammoniums",
                "describe dialkylammoniums",
                "describe monoalkylammoniums",
                "describe preferred alkylammonium cations",
                "describe nitrogen-containing heterocyclic moiety",
                "describe cation ring",
                "describe C2-6 alkoxy",
                "describe C2-6 alkoxyalkyl group",
                "describe preferred cations",
                "describe ionic liquid composition",
                "describe preparation of ionic liquids",
                "describe excess base in ionic liquid",
                "describe water in ionic liquid composition",
                "describe excess acid in ionic liquid composition",
                "describe contacting biomass with ionic liquid",
                "describe lubrication properties of ionic liquid",
                "describe metal extraction and lignin solubilization",
                "describe electrodeposition of metal pollutant",
                "describe recovery of metal pollutant",
                "describe recycling of ionic liquid",
                "describe separation of ionic liquid from cellulose",
                "describe washing of cellulose containing solid residue",
                "describe precipitation of lignin",
                "describe removal of anti-solvent",
                "describe drying of ionic liquid",
                "describe saccharification of cellulose containing solid residue",
                "describe enzymatic hydrolysis",
                "describe glucose obtained by hydrolysis",
                "summarize process of the invention"
            ],
            "num_characters": 34822,
            "outline_medium": [
                "introduce metal pollutants in wood",
                "describe wood treatment with metal-based preservatives",
                "discuss toxicity of preservatives",
                "mention limitations of wood disposal",
                "describe current methods of metal recovery",
                "discuss limitations of current methods",
                "introduce lignocellulosic biomass",
                "describe composition of lignocellulosic biomass",
                "discuss cellulosic biofuel production",
                "mention limitations of using preservative-treated biomass",
                "introduce ionic liquid fractionation",
                "describe process of extracting metals from treated biomass",
                "define extraction and metal pollutants",
                "describe preferred conditions for extraction",
                "define ionic liquid and its components",
                "describe preferred anions and cations",
                "summarize process of metal extraction and biomass treatment",
                "define heteroaryl",
                "define aryl and carbocycle groups",
                "define halogen atom",
                "describe alkylammonium cations",
                "describe nitrogen-containing heterocyclic moiety",
                "describe ionic liquid preparation",
                "describe ionic liquid composition",
                "describe effect of water on ionic liquid composition",
                "describe effect of acid on ionic liquid composition",
                "describe contacting biomass with ionic liquid",
                "describe electrodeposition of metal pollutant",
                "describe recycling of ionic liquid",
                "describe separation of cellulose from ionic liquid",
                "describe precipitation of lignin",
                "describe saccharification of cellulose",
                "summarize process of invention"
            ],
            "outline_short": [
                "introduce problem of metal pollutants in treated wood",
                "describe current uses and limitations of treated wood",
                "discuss environmental and health concerns of metal pollutants",
                "summarize current methods for metal recovery from treated wood",
                "highlight limitations and costs of current methods",
                "introduce potential of using contaminated waste wood as feedstock for biofuel production",
                "describe composition and structure of lignocellulosic biomass",
                "outline the present invention's process for extracting metal pollutants from treated cellulosic or lignocellulosic biomass",
                "define heteroaryl and aryl groups",
                "define halogen atom and alkylammonium cations",
                "describe ionic liquid composition and preparation",
                "describe preferred ionic liquids and their properties",
                "outline ionic liquid composition for saccharification and metal extraction",
                "describe electrodeposition of metal pollutant from ionic liquid",
                "outline separation and recycling of ionic liquid and cellulose",
                "summarize process of saccharification and glucose production"
            ]
        }
    ],
    "claims": [
        "1. A process for the extraction of metal pollutants from treated cellulosic biomass, the process comprising\n(a) contacting the treated cellulosic biomass with an ionic liquid, said ionic liquid comprising an anion and an organic cation.",
        "2. The process of claim 1 wherein the anion is selected from C1-20 alkyl sulfate [Alkyl SO4]−, Chloride [Cl]−, Bromide [Br]−, hydrogen sulfate [HSO4]−, hydrogen sulfite [HSO3]−, trifluoromethanesulfonate [OTf]− and acetate [OAc]−.",
        "3. The process of claim 1 wherein the cation is selected from\n(i) a cation of general formula:\n\n\nwherein\nX is N; and\nA1 to A4 are each independently selected from H, an aliphatic, C3-6 carbocycle, C6-10 aryl, alkylaryl, and heteroaryl; or\n(ii) contains a nitrogen-containing heterocyclic moiety.",
        "4. The process of claim 3 wherein at least one of A1 to A4 is H.",
        "5. The process of claim 1 wherein the cation is an alkylammonium, an alcoholammonium, or a mixture thereof.",
        "6. (canceled)",
        "7. The process of claim 3 wherein the cation containing a nitrogen-containing heterocyclic moiety is an imidazolium based cation or a mixture thereof.",
        "8. The process of claim 7 wherein the imidazolium based cation is selected from 1-ethyl-3-methylimidazolium ([EMIM]+), 1-butylimidazolium ([HBIM]+) and 1-methylimidazolium ([HMIM]+).",
        "9. The process of claim 1 wherein the ionic liquid is selected from [HBIM][HSO4], [HMIM][Cl], [HMIM][HSO4], or [TEA][HSO4], or mixtures thereof.",
        "10. The process of claim 1 wherein the ionic liquid comprises at least 5% molar excess of the base.",
        "11. The process of claim 1 wherein the ionic liquid comprises 10-40% v/v water.",
        "12. The process of claim 1 further comprising\n(b) separating the cellulose containing solid residue obtained from the ionic liquid.",
        "13. The process of claim 12 further comprising\n(c(i)) washing the solid residue at least once with the ionic liquid or an organic solvent miscible with the ionic liquid.",
        "14. The process of claim 13 further comprising\n(c(ii)) separating the solid residue from the ionic liquid or organic solvent and optionally adding the ionic liquid or organic solvent to the ionic liquid obtained in (b).",
        "15. The process of claim 12 further comprising\n(d) adding an anti-solvent to the ionic liquid obtained in (b) to precipitate the lignin.",
        "16. The process of claim 12 further comprising removing water from the ionic liquid, after step (b) and/or after step (d).",
        "17. The process of claim 1 further comprising electrodeposition of the metal pollutant from the ionic liquid.",
        "18. The process of claim 16 wherein after the electrodeposition, the ionic liquid is re-used in step (a) and/or step (c(i)).",
        "19. The process of claim 1 further comprising saccharification of the cellulose containing solid residue obtained in any of steps (a), (b) and/or (c(ii)) to obtain glucose.",
        "20. (canceled)",
        "21. A cellulose containing solid residue obtained by the process of claim 1.",
        "22. Glucose obtained by a process of claim 1.",
        "23-26. (canceled)"
    ]
}