{
    "id": "US20210095371",
    "authors": [
        "Rinu Maniyara",
        "Prantik Mazumder",
        "Valerio Pruneri"
    ],
    "title": "TRANSPARENT CONDUCTOR MATERIALS WITH ENHANCED NEAR INFRARED PROPERTIES AND METHODS OF FORMING THEREOF",
    "date": "2020-09-30 00:00:00",
    "abstract": "A method is provided for manufacturing an article comprising a transparent conductive material, wherein a transparent conductive material (e.g., indium tin oxide) is deposited onto a substrate (e.g., fused silica) by physical vapor deposition, then annealed at high temperature (i.e., at least 450° C.) in a nitrogen atmosphere. The resulting article comprises a transparent conductive material that reduces the trade-off between low resistivity (or sheet resistance) and high near infrared transmission. For example, the transparent conductive material thus obtained may possess a transmission of at least 80% at 1550 nm while having a resistivity of less than or equal to about 5×10−4 Ohm-cm and a Haacke figure of merit of at least about 40×10−4Ω−1. Also provided is a method for modulating the resistivity and/or the near infrared transmission of a transparent conductive material by annealing the transparent conductive material at a high temperature under nitrogen atmosphere.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This application claims the benefit of priority under 35 U.S.C. § 119 of U.S. Provisional Application Ser. No. 62/908,079, filed on Sep. 30, 2019, the content of which is relied upon and incorporated herein by reference in its entirety."
            ],
            "subsections": [
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "The present invention relates generally to the field of transparent conductive materials with high transmission in the near infrared (“NIR”) region and low resistivity and/or sheet resistance, and methods for forming the same."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 226,
                    "outline_medium": [
                        "define field of invention"
                    ],
                    "outline_short": [
                        "define field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Transparent conductors (TCs) are capable of conducting electricity while being optically transparent, and thus are essential elements in many optoelectronic and photonic devices such as solar cells, touch screens, liquid crystal displays (LCDs) and light emitting diodes (LEDs). In many applications, high optical transmission beyond the visible spectrum into the infrared (IR) wavelengths is crucial. Examples include high-efficiency solar cells (which convert IR and visible light into electricity), IR photodetectors and imaging cameras, IR light sources, and optical communications operating in the low loss window of optical fibers. Materials such as graphene, carbon nanotubes, ultra-thin metal films, metallic nanowires, conductive polymers, and wide band gap semiconductors have been widely studied as transparent conductors, but they typically have been investigated and optimized in the visible wavelength range (380-750 nm).",
                        "Despite the development of many alternative transparent conductors, indium tin oxide (ITO) is still considered a prototypical material due to its high transmission, electrical conductivity, excellent adhesion, etching properties, and stability in harsh environments. Considerable effort has been directed toward increasing the transparency and conductivity of ITO films with various doping mechanisms, thermal/chemical treatments and deposition methods. However, most of the work so far has focused on transparency in the visible spectrum. ITO transparent conductors for the near IR wavelength range (750-2400 nm) exhibit poor transmission performance, when compared to the visible range. And when high transmission has been achieved, it has been at the expense of the electrical conductivity.",
                        "Therefore, there exists a need for transparent conductor materials having high transmission in the near IR range and having low resistivity (i.e., high conductivity), and for methods of forming the same."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce transparent conductors",
                        "discuss limitations of existing materials",
                        "identify need for new materials"
                    ],
                    "num_characters": 1935,
                    "outline_medium": [
                        "motivate transparent conductors"
                    ],
                    "outline_short": [
                        "motivate transparent conductors"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "In some embodiments, a method for producing an article comprises (a) depositing a layer of a transparent conductive material on a substrate, wherein the layer of the transparent conductive material has a thickness between about 20 nm and 250 nm; and (b) annealing the transparent conductive material at a temperature of at least about 450° C. for at least about 2 min; wherein after the annealing, the layer of the transparent conductive material has a transmission of at least about 70% at 1550 nm or a Haacke figure of merit of at least about 40×10−4Ω−1.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the annealing takes place at a temperature of about 750° C.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the transparent conductive material comprises indium tin oxide.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the thickness of the layer of the transparent conductive material is between about 50 nm and about 150 nm.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the layer of the transparent conductive material has a resistivity of less than or equal to about 5×10−4 Ohm-cm after the annealing.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the depositing comprises physical vapor deposition. In another aspect, which is combinable with any of the other aspects or embodiments, the depositing comprises magnetron sputtering.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the annealing takes place in an atmosphere containing less than about 5% oxygen.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the layer of the transparent conductive material has a transmission in the visible range of at least 80% after the annealing.",
                        "In some embodiments, a method for modulating the resistivity and optical transmission of a transparent conductive material comprises annealing the transparent conductive material at a temperature of at least 450° C. for at least about 2 minutes, wherein after the annealing, the transparent conductive material has a transmission of at least about 70% at 1550 nm or a Haacke figure of merit of at least about 40×10−4Ω−1.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the transparent conductive material comprises indium tin oxide.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the transparent conductive material comprises a layer with a thickness of between about 20 nm and about 250 nm.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, after the annealing, the transparent conductive material has a transmission of at least about 80% at 1550 nm or a Haacke figure of merit of at least about 60×10−4Ω−1. In another aspect, which is combinable with any of the other aspects or embodiments, after the annealing, the transparent conductive material has a transmission of at least about 70% at 1550 nm and a resistivity of less than or equal to about 5×10−4 Ohm-cm.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the annealing takes place in an atmosphere containing less than about 5% oxygen.",
                        "In some embodiments, an article comprises a layer of a transparent conductive material, wherein the layer of the transparent conductive material has a thickness of between about 20 nm and about 250 nm, a transmission of at least 70% at 1550 nm or a Haacke figure of merit of at least 40×10−4Ω−1.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the transparent conductive material comprises indium tin oxide.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the thickness of the layer of the transparent conductive material is between about 50 nm and about 150 nm.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the layer of the transparent conductive material has a resistivity of less than or equal to about 5×10−4 Ohm-cm. In another aspect, which is combinable with any of the other aspects or embodiments the layer of the transparent conductive material has a transmission of at least about 80% at 1550 nm and a Haacke figure of merit of at least about 60×10−4Ω−1.",
                        "In one aspect, which is combinable with any of the other aspects or embodiments, the layer of the transparent conductive material has a transmission in the visible range of at least 80%."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for producing article",
                        "specify annealing conditions",
                        "specify material composition",
                        "specify layer thickness",
                        "specify resistivity",
                        "specify deposition method",
                        "specify annealing atmosphere",
                        "introduce method for modulating resistivity",
                        "introduce article with transparent conductive material"
                    ],
                    "num_characters": 4576,
                    "outline_medium": [
                        "introduce method for producing article",
                        "specify annealing conditions",
                        "describe properties of transparent conductive material",
                        "outline variations of method"
                    ],
                    "outline_short": [
                        "outline method for producing article",
                        "outline article with transparent conductive material"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "In some embodiments, the present disclosure relates to a method for producing an article comprising a layer of a transparent conductive material, the method comprising (a) depositing a layer comprising a transparent conductive material, and (b) annealing the transparent conductive material at a temperature of at least about 450° C.",
                        "In some embodiments, the transparent conductive material according to the present disclosure is indium tin oxide (ITO), zinc oxide (ZnO), antimony-doped zinc oxide (AZO) antimony-doped tin oxide (ATO), fluorine-doped tin oxide (FTO), gallium-doped zinc oxide (GZO), molybdenum-doped indium oxide (IMO), magnesium-doped zinc oxide (MZO), or other like materials, or combinations or mixtures thereof. In some embodiments, the transparent conductive material is ITO.",
                        "In some embodiments, the transparent conductive material may be formed on or deposited onto a substrate. The substrate of the present disclosure may be planar (e.g., a silicon wafer or fused silica substrate), or it may be of any other shape or dimension appropriate for forming an article. In some embodiments, the substrate may comprise microparticles or nanoparticles, which may take the form or shape of spheres, prisms, wires, rods cubes, or any other shape. Substrates according the present disclosure may include ceramics, glasses, metals, or semiconductors. In an embodiment, the substrate according to the present disclosure is fused silica.",
                        "In some embodiments, the thickness of the layer of the transparent conductive material may be selected to facilitate achieving either low resistivity (or low sheet resistance), high NIR transmission, or both. In some embodiments, the transparent conductive material has a thickness between about 10 nm and about 1000 nm, between about 15 nm and about 500 nm, between about 20 nm and about 250 nm, between about 50 nm and about 150 nm, or between about 75 nm and about 125 nm, or any range or value thereinbetween. In some embodiments, the transparent conductive material has a thickness of about 10 nm, about 15 nm, about 20 nm, about 30 nm, about 40 nm, about 50 nm, about 60 nm, about 70 nm, about 80 nm, about 90 nm, about 100 nm, about 110 nm, about 120 nm, about 130 nm, about 140 nm, about 150 nm, about 160 nm, about 170 nm, about 180 nm, about 190 nm, about 200 nm, about 250 nm, about 300 nm, about 350 nm, about 400 nm, about 450 nm, about 500 nm, about 550 nm, about 600 nm, about 650 nm, about 700 nm, about 750 nm, about 800 nm, about 850 nm, about 900 nm, about 950 nm, or about 1000 nm, or any value thereinbetween.",
                        "In some embodiments, the depositing comprises physical vapor deposition. In some embodiments, the physical vapor deposition comprises magnetron sputtering, pulsed laser deposition, cathodic arc deposition, evaporative deposition, closed-space sublimation, pulsed electron deposition, or electron beam physical vapor deposition, other equivalent methods, or any combination thereof. In an embodiment, the physical vapor deposition comprises sputter deposition (e.g., magnetron sputtering deposition).",
                        "In some embodiments of the method, the annealing is a high-temperature annealing (HTA). In some embodiments, the annealing takes place at a temperature of at least about 450° C., at least about 500° C., at least about 550° C., at least about 600° C., at least about 650° C., at least about 700° C., at least about 750° C., at least about 800° C., at least about 850° C., or at least about 900° C., any combination thereof, or any range or value therein. In some embodiments, the annealing takes place between about 400° C. and about 900° C., between about 450° C. and about 850° C., between about 500° C. and about 800° C., or between about 550° C. and about 750° C., or any range or value therein. In some embodiments, the annealing takes place at about 450° C., about 475° C., about 500° C., about 525° C., about 550° C., about 575° C., about 600° C., about 625° C., about 650° C., about 675° C., about 700° C., about 725° C., about 750° C., about 775° C., about 800° C., about 825° C., about 850° C., about 875° C., about 900° C., any combination thereof, or any value thereinbetween.",
                        "In some embodiments, the annealing takes place for at least about 1 min, at least about 2 min, at least about 3 min, at least about 4 min, at least about 5 min, at least about 10 min, at least about 15 min, at least about 20 min, at least about 30 min, at least about 45 min, at least about 1 hr, at least about 1.5 hr, at least about 2 hr, at least about 2.5 hr, at least about 3 hr, at least about 3.5 hr, at least about 4 hr, at least about 4.5 hr, at least about 5 hr, at least about 5.5 hr, at least about 6 hr, at least about 6.5 hr, at least about 7 hr, at least about 7.5 hr, at least about 8 hr, at least about 8.5 hr, at least about 9 hr, at least about 9.5 hr, at least about 10 hr, at least about 10.5 hr, at least about 11 hr, at least about 12 hr, at least about 13 hr, at least about 14 hr, at least about 15 hr, or at least about 16 hr, or longer, or any range therein.",
                        "In some embodiments, the annealing takes place for about 1 min, about 2 min, about 3 min, about 4 min, about 5 min, about 10 min, about 15 min, about 20 min, about 30 min, about 45 min, about 1 hr, about 1.5 hr, about 2 hr, about 2.5 hr, about 3 hr, about 3.5 hr, about 4 hr, about 4.5 hr, about 5 hr, about 5.5 hr, about 6 hr, about 6.5 hr, about 7 hr, about 7.5 hr, about 8 hr, about 8.5 hr, about 9 hr, about 9.5 hr, about 10 hr, about 10.5 hr, about 11 hr, about 12 hr, about 13 hr, about 14 hr, about 15 hr, or about 16 hr, or any value thereinbetween.",
                        "In some embodiments, the annealing takes place in an atmosphere that is substantially free of oxygen, such as N2, Ar, N2/H2, Ar/H2, or under vacuum. In some embodiments, the annealing takes place in an atmosphere that contains less than about 10% oxygen, less than about 9% oxygen, less than about 8% oxygen, less than about 7% oxygen, less than about 6% oxygen, less than about 5% oxygen, less than about 4% oxygen, less than about 3% oxygen, less than about 2% oxygen, less than about 1% oxygen, less than about 0.8% oxygen, less than about 0.6% oxygen, less than about 0.4% oxygen, less than about 0.2% oxygen, less than about 0.1% oxygen, less than about 0.05% oxygen, less than about 0.01% oxygen, less than about 0.005% oxygen, less than about 0.001% oxygen, less than about 0.0005% oxygen, or less than about 0.0001% oxygen.",
                        "In some embodiments, after the annealing, the transparent conductive material has a transmission at 1550 nm of at least about 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, and/or a resistivity of no greater than about 5×10−4 Ohm-cm, no greater than about 4.5×10−4 Ohm-cm, no greater than about 4×10−4 Ohm-cm, no greater than about 3.5×10−4 Ohm-cm, no greater than about 3×10−4 Ohm-cm, no greater than about 2.5×10−4 Ohm-cm, no greater than about 2×10−4 Ohm-cm, no greater than about 1.5×10−4 Ohm-cm, or no greater than about 1×10−4 Ohm-cm, or any range therein.",
                        "In some embodiments, after the annealing, the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a resistivity of about 1×10−4 Ohm-cm, about 1.2×10−4 Ohm-cm, about 1.4×10−4 Ohm-cm, about 1.6×10−4 Ohm-cm, about 1.8×10−4 Ohm-cm, about 2.0×10−4 Ohm-cm, about 2.2×10−4 Ohm-cm, about 2.4×10−4 Ohm-cm, about 2.6×10−4 Ohm-cm, about 2.8×10−4 Ohm-cm, about 3.0×10−4 Ohm-cm, about 3.5×10−4 Ohm-cm, about 4.0×10−4 Ohm-cm, about 4.5×10−4 Ohm-cm, or about 5.0×10−4 Ohm-cm, or any value thereinbetween.",
                        "In some embodiments, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a resistivity of about 1.2×10−4 Ohm-cm to about 2.2×10−4 Ohm-cm. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a resistivity of about 1.2×10−4 Ohm-cm. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a resistivity of about 2.2×10−4 Ohm-cm.",
                        "In some embodiments of the method, after the annealing, the transparent conductive material according to the present disclosure exhibits and improved trade-off between sheet resistance and near infrared (NIR) transmission (750-2400 nm). In some embodiments, after the annealing, the transparent conductive material has a transmission of at least about 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, and/or a sheet resistance of no greater than about 50 Ohm/sq., no greater than about 45 Ohm/sq., no greater than about 40 Ohm/sq., no greater than about 35 Ohm/sq., no greater than about 30 Ohm/sq., no greater than about 25 Ohm/sq., no greater than about 20 Ohm/sq., no greater than about 15 Ohm/sq., or no greater than about 10 Ohm/sq., or any range therein.",
                        "In some embodiments of the method, after the annealing, the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a sheet resistance of about 10 Ohm/sq., about 12 Ohm/sq., about 14 Ohm/sq., about 16 Ohm/sq., about 18 Ohm/sq., about 20 Ohm/sq., about 22 Ohm/sq., about 24 Ohm/sq., about 26 Ohm/sq., about 28 Ohm/sq., about 30 Ohm/sq., about 35 Ohm/sq., about 40 Ohm/sq., about 45 Ohm/sq., or about 50 Ohm/sq., or any value thereinbetween.",
                        "In some embodiments of the method, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a sheet resistance of about 12.2 Ohm/sq. to about 22 Ohm/sq., after the annealing. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a sheet resistance of about 12.2 Ohm/sq. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a sheet resistance of about 22 Ohm/sq.",
                        "In some embodiments of the method, after the annealing, the transparent conductive material also maintains a high transmission over the visible wavelength range (380-750 nm). In some embodiments, the transparent conductive material has a transmission in the visible range of at least 75%, at least 76%, at least 77%, at least 78%, at least 79%, at least 80%, at least 81%, at least 82%, at least 83%, at least 84%, or at least 85%, or any range or value thereinbetween. In an embodiment, the transparent conductive material has a transmission in the visible range of about 83.9%.",
                        "In some embodiments, the trade-off between resistivity and transmission in the NIR region may be characterized by the Haacke figure of merit (FoM). The Haacke FoM is given by the following equation:",
                        "\\(\\begin{matrix}\n{{{FoM}\\mspace{14mu} \\left( \\Omega^{- 1} \\right)} = \\frac{T^{10}}{R_{s}}} & \\left( {{Equation}\\mspace{14mu} 1} \\right)\n\\end{matrix}\\)",
                        "where T is the optical transmission (%) and Rs is the sheet resistance. (See Haacke, G., New figure of merit for transparent conductors, 47 J. A. P. 4086-89 (1976).)",
                        "In some embodiments of the method, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of at least about 5×10−4Ω−1, at least about 10×10−4Ω−1, at least about 15×10−4Ω−1, at least about 20×10−4Ω−1, at least about 25×10−4Ω−1, at least about 30×10−4Ω−1, at least about 35×10−4Ω−1, at least about 40×10−4Ω−2, at least about 45×10−4Ω−1, at least about 50×10−4Ω−1, at least about 55×10−4Ω−1, at least about 60×10−4Ω−1, at least about 65×10−4Ω−1, at least about 70×10−4Ω−1, at least about 75×10−4Ω−2, or at least about 80×10−4Ω−1, or any range therein.",
                        "In some embodiments of the method, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of about 5×10−4Ω−1, about 10×10−4Ω−1, about 15×10−4Ω−1, about 20×10−4Ω−1, about 25×10−4Ω−1, about 30×10−4Ω−1, about 35×10−4Ω−1, about 40×10−4Ω−1, about 45×10−4Ω−1, about 50×10−4Ω−1, about 55×10−4Ω−1, about 60×10−4Ω−1, about 65×10−4Ω−1, about 70×10−4Ω−1, about 75×10−4Ω−1, or about 80×10−4Ω−1, or any value thereinbetween.",
                        "In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a Haacke FoM of about 64.2×10−4Ω−1. In another embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a Haacke FoM of about 9.3×10−4Ω−1.",
                        "In some embodiments, the method for producing an article comprising a transparent conductive material further comprises (c) depositing an additional material on the transparent conductive material, either after the annealing (b), or between the depositing (a) and the annealing (b). In some embodiments, an additional material according to the present disclosure may comprise a self-assembled monolayer, a polymer layer, a metal layer, a ceramic layer, a semiconductor layer, or a glass layer.",
                        "In other embodiments, the present disclosure provides a method for modulating the resistivity and/or near IR transmission of a transparent conductive material. In some embodiments, the method comprises annealing the transparent conductive material at a temperature of at least 450° C. for at least 2 min.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, the annealing is a high-temperature annealing (HTA). In some embodiments the annealing takes place at a temperature of at least about 450° C., at least about 500° C., at least about 550° C., at least about 600° C., at least about 650° C., at least about 700° C., at least about 750° C., at least about 800° C., at least about 850° C., or at least about 900° C., any combination thereof, or any range or value therein. In some embodiments, the annealing takes place at between about 400° C. and about 900° C., between about 450° C. and about 850° C., between about 500° C. and about 800° C., or between about 550° C. and about 750° C., or any range or value therein. In some embodiments, the annealing takes place at about 450° C., about 475° C., about 500° C., about 525° C., about 550° C., about 575° C., about 600° C., about 625° C., about 650° C., about 675° C., about 700° C., about 725° C., about 750° C., about 775° C., about 800° C., about 825° C., about 850° C., about 875° C., about 900° C., any combination thereof, or any value thereinbetween.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, the annealing takes place for at least about 1 min, at least about 2 min, at least about 3 min, at least about 4 min, at least about 5 min, at least about 10 min, at least about 15 min, at least about 20 min, at least about 30 min, at least about 45 min, at least about 50 min, at least about 1 hr, at least about 1.5 hr, at least about 2 hr, at least about 2.5 hr, at least about 3 hr, at least about 3.5 hr, at least about 4 hr, at least about 4.5 hr, at least about 5 hr, at least about 5.5 hr, at least about 6 hr, at least about 6.5 hr, at least about 7 hr, at least about 7.5 hr, at least about 8 hr, at least about 8.5 hr, at least about 9 hr, at least about 9.5 hr, at least about 10 hr, at least about 10.5 hr, at least about 11 hr, at least about 12 hr, at least about 13 hr, at least about 14 hr, at least about 15 hr, or at least about 16 hr, or longer, or any range therein.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, the annealing takes place for about 1 min, about 2 min, about 3 min, about 4 min, about 5 min, about 10 min, about 15 min, about 20 min, about 30 min, about 45 min, about 1 hr, about 1.5 hr, about 2 hr, about 2.5 hr, about 3 hr, about 3.5 hr, about 4 hr, about 4.5 hr, about 5 hr, about 5.5 hr, about 6 hr, about 6.5 hr, about 7 hr, about 7.5 hr, about 8 hr, about 8.5 hr, about 9 hr, about 9.5 hr, about 10 hr, about 10.5 hr, about 11 hr, about 12 hr, about 13 hr, about 14 hr, about 15 hr, or about 16 hr, or any value thereinbetween.",
                        "In some embodiments, the annealing takes place in an atmosphere that is substantially free of oxygen, such as N, Ar, N/H2, Ar/H2, or under vacuum. In some embodiments, the annealing takes place in an atmosphere that contains less than about 10% oxygen, less than about 9% oxygen, less than about 8% oxygen, less than about 7% oxygen, less than about 6% oxygen, less than about 5% oxygen, less than about 4% oxygen, less than about 3% oxygen, less than about 2% oxygen, less than about 1% oxygen, less than about 0.8% oxygen, less than about 0.6% oxygen, less than about 0.4% oxygen, less than about 0.2% oxygen, less than about 0.1% oxygen, less than about 0.05% oxygen, less than about 0.01% oxygen, less than about 0.005% oxygen, less than about 0.001% oxygen, less than about 0.0005% oxygen, or less than about 0.0001% oxygen.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material has a transmission at 1550 nm of at least 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, and/or a resistivity of no greater than about 5×10−4 Ohm-cm, no greater than about 4.5×10−4 Ohm-cm, no greater than about 4×10−4 Ohm-cm, no greater than about 3.5×10−4 Ohm-cm, no greater than about 3×10−4 Ohm-cm, no greater than about 2.5×10−4 Ohm-cm, no greater than about 2×10−4 Ohm-cm, no greater than about 1.5×10−4 Ohm-cm, or no greater than about 1×10−4 Ohm-cm, or any range therein.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a resistivity of about 1×10−4 Ohm-cm, about 1.2×10−4 Ohm-cm, about 1.4×10−4 Ohm-cm, about 1.6×10−4 Ohm-cm, about 1.8×10−4 Ohm-cm, about 2.0×10−4 Ohm-cm, about 2.2×10−4 Ohm-cm, about 2.4×10−4 Ohm-cm, about 2.6×10−4 Ohm-cm, about 2.8×10−4 Ohm-cm, about 3.0×10−4 Ohm-cm, about 3.5×10−4 Ohm-cm, about 4.0×10−4 Ohm-cm, about 4.5×10−4 Ohm-cm, or about 5.0×10−4 Ohm-cm, or any value thereinbetween.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a resistivity of about 1.2×10−4 Ohm-cm to about 2.2×10−4 Ohm-cm. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a resistivity of about 1.2×10−4 Ohm-cm. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a resistivity of about 2.2×10−4 Ohm-cm.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material according to the present disclosure exhibits and improved trade-off between sheet resistance and near infrared (NIR) transmission (750-2400 nm). In some embodiments, after the annealing, the transparent conductive material has a transmission of at least about 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, and/or a sheet resistance of no greater than about 50 Ohm/sq., no greater than about 45 Ohm/sq., no greater than about 40 Ohm/sq., no greater than about 35 Ohm/sq., no greater than about 30 Ohm/sq., no greater than about 25 Ohm/sq., no greater than about 20 Ohm/sq., no greater than about 15 Ohm/sq., or no greater than about 10 Ohm/sq., or any range therein.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a sheet resistance of about 10 Ohm/sq., about 12 Ohm/sq., about 14 Ohm/sq., about 16 Ohm/sq., about 18 Ohm/sq., about 20 Ohm/sq., about 22 Ohm/sq., about 24 Ohm/sq., about 26 Ohm/sq., about 28 Ohm/sq., about 30 Ohm/sq., about 35 Ohm/sq., about 40 Ohm/sq., about 45 Ohm/sq., or about 50 Ohm/sq., or any value thereinbetween.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a sheet resistance of about 12.2 Ohm/sq. to about 22 Ohm/sq., after the annealing. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a sheet resistance of about 12.2 Ohm/sq. In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a sheet resistance of about 22 Ohm/sq.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of at least about 5×10−4Ω−1, at least about 10×10−4Ω−1, at least about 15×10−4Ω−1, at least about 20×10−4Ω−1, at least about 25×10−4Ω−1, at least about 30×10−4Ω−1, at least about 35×10−4Ω−1, at least about 40×10−4Ω−1, at least about 45×10−4Ω−1, at least about 50×10−4Ω−1, at least about 55×10−4Ω−1, at least about 60×10−4Ω−1, at least about 65×10−4Ω−1, at least about 70×10−4Ω−1, at least about 75×10−4Ω−2, or at least about 80×10−4Ω−1, or any range therein.",
                        "In some embodiments of the method for modulating resistivity and/or NIR transmission of a transparent conductive material, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of about 5×10−4Ω−1, about 10×10−4Ω−1, about 15×10−4Ω−1, about 20×10−4Ω−1, about 25×10−4Ω−1, about 30×10−4Ω−1, about 35×10−4Ω−1, about 40×10−4Ω−1, about 45×10−4Ω−1, about 50×10−4Ω−1, about 55×10−4Ω−1, about 60×10−4Ω−1, about 65×10−4Ω−1, about 70×10−4Ω−1, about 75×10−4Ω−1, or about 80×10−4Ω−1, or any value thereinbetween.",
                        "In an embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a Haacke FoM of about 64.2×10−4Ω−1. In another embodiment, after the annealing, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a Haacke FoM of about 9.3×10−4Ω−1.",
                        "In still other embodiments, the present disclosure relates to an article comprising a layer of a transparent conductive material, wherein the layer of the transparent conductive material exhibits an improved trade-off between resistivity and near infrared (NIR) transmission (750-2400 nm). In some embodiments, the layer of the transparent conductive material has a transmission of at least about 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, and/or a resistivity of no greater than about 5×104 Ohm-cm, no greater than about 4.5×10−4 Ohm-cm, no greater than about 4×10−4 Ohm-cm, no greater than about 3.5×10−4 Ohm-cm, no greater than about 3×10−4 Ohm-cm, no greater than about 2.5×10−4 Ohm-cm, no greater than about 2×10−4 Ohm-cm, no greater than about 1.5×10−4 Ohm-cm, or no greater than about 1×10−4 Ohm-cm, or any range therein.",
                        "In some embodiments, the layer of the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a resistivity of about 1×10−4 Ohm-cm, about 1.2×10−4 Ohm-cm, about 1.4×10−4 Ohm-cm, about 1.6×10−4 Ohm-cm, about 1.8×10−4 Ohm-cm, about 2.0×10−4 Ohm-cm, about 2.2×10−4 Ohm-cm, about 2.4×10−4 Ohm-cm, about 2.6×10−4 Ohm-cm, about 2.8×10−4 Ohm-cm, about 3.0×10−4 Ohm-cm, about 3.5×10−4 Ohm-cm, about 4.0×10−4 Ohm-cm, about 4.5×10−4 Ohm-cm, or about 5.0×10−4 Ohm-cm, or any value thereinbetween.",
                        "In some embodiments, the layer of the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a resistivity of about 1.2×10−4 Ohm-cm to about 2.2×10−4 Ohm-cm. In an embodiment, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a resistivity of about 1.2×10−4 Ohm-cm. In an embodiment, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a resistivity of about 2.2×10−4 Ohm-cm.",
                        "In some embodiments, the layer of the transparent conductive material according to the present disclosure exhibits and improved trade-off between sheet resistance and near infrared (NIR) transmission (750-2400 nm). In some embodiments, the transparent conductive material has a transmission of at least about 80%, at least about 75%, at least about 70%, at least about 65%, or at least about 60% at 1550 nm, or any range therein, and/or a sheet resistance of no greater than about 50 Ohm/sq., no greater than about 45 Ohm/sq., no greater than about 40 Ohm/sq., no greater than about 35 Ohm/sq., no greater than about 30 Ohm/sq., no greater than about 25 Ohm/sq., no greater than about 20 Ohm/sq., no greater than about 15 Ohm/sq., or no greater than about 10 Ohm/sq., or any range therein.",
                        "In some embodiments, the layer of the transparent conductive material has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a sheet resistance of about 10 Ohm/sq., about 12 Ohm/sq., about 14 Ohm/sq., about 16 Ohm/sq., about 18 Ohm/sq., about 20 Ohm/sq., about 22 Ohm/sq., about 24 Ohm/sq., about 26 Ohm/sq., about 28 Ohm/sq., about 30 Ohm/sq., about 35 Ohm/sq., about 40 Ohm/sq., about 45 Ohm/sq., or about 50 Ohm/sq., or any value thereinbetween.",
                        "In some embodiments, the layer of the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% to about 82.4% and a sheet resistance of about 12.2 Ohm/sq. to about 22 Ohm/sq. In an embodiment, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a sheet resistance of about 12.2 Ohm/sq. In an embodiment, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a sheet resistance of about 22 Ohm/sq.",
                        "In some embodiments of the method, the layer of the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of at least about 5×10−4Ω−1, at least about 10×10−4Ω−1, at least about 15×10−4Ω−1, at least about 20×10−4Ω−1, at least about 25×10−4Ω−1, at least about 30×10−4Ω−1, at least about 35×10−4Ω−1, at least about 40×10−4Ω−1, at least about 45×10−4Ω−1, at least about 50×10−4Ω−1, at least about 55×10−4Ω−1, at least about 60×10−4Ω−1, at least about 65×10−4Ω−1, at least about 70×10−4Ω−1, at least about 75×10−4Ω−2, or at least about 80×10−4Ω−1, or any range therein.",
                        "In some embodiments, the layer of the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 60%, about 61%, about 62%, about 63%, about 64%, about 65%, about 66%, about 67%, about 68%, about 69%, about 70%, about 71%, about 72%, about 73%, about 74%, about 75%, about 76%, about 77%, about 78%, about 79%, about 80%, about 81%, about 82%, about 83%, about 84%, or about 85%, or any value thereinbetween, and/or a Haacke FoM of about 5×10−4Ω−1, about 10×10−4Ω−1, about 15×10−4Ω−1, about 20×10−4Ω−1, about 25×10−4Ω−1, about 30×10−4Ω−1, about 35×10−4Ω−1, about 40×10−4Ω−1, about 45×10−4Ω−1, about 50×10−4Ω−1, about 55×10−4Ω−1, about 60×10−4Ω−1, about 65×10−4Ω−1, about 70×10−4Ω−1, about 75×10−4Ω−1, or about 80×10−4Ω−1, or any value thereinbetween.",
                        "In an embodiment, the layer of the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 82.4% and a Haacke FoM of about 64.2×10−4Ω−1. In another embodiment, the transparent conductive material according to the present disclosure has a transmission at 1550 nm of about 63.9% and a Haacke FoM of about 9.3×10−4Ω−1.",
                        "In some embodiments, the layer of the transparent conductive material also maintains a high transmission over the visible wavelength range (380-750 nm). In some embodiments, the transparent conductive material has a transmission in the visible range of at least 75%, at least 76%, at least 77%, at least 78%, at least 79%, at least 80%, at least 81%, at least 82%, at least 83%, at least 84%, or at least 85%, or any range or value thereinbetween. In an embodiment, the transparent conductive material has a transmission in the visible range of about 83.9%.",
                        "In some embodiments, the transparent conductive material according to the present disclosure is indium tin oxide (ITO), zinc oxide (ZnO), antimony-doped zinc oxide (AZO) antimony-doped tin oxide (ATO), fluorine-doped tin oxide (FTO), gallium-doped zinc oxide (GZO), molybdenum-doped indium oxide (IMO), or magnesium-doped zinc oxide (MZO), or other like materials, or combinations or mixtures thereof. In some embodiments, the transparent conductive material is ITO.",
                        "In some embodiments, the layer of the transparent conductive material may be formed on or deposited onto a substrate. The substrate of the present disclosure may be planar (e.g., a silicon wafer or fused silica substrate), or it may be of any other shape or dimension appropriate for forming an article. In some embodiments, the substrate may comprise microparticles or nanoparticles, which may take the form or shape of spheres, prisms, wires, rods cubes, or any other shape. Substrates according the present disclosure may include ceramics, glasses, metals, or semiconductors. In an embodiment, the substrate according to the present disclosure is fused silica.",
                        "In some embodiments, the thickness of the layer of the transparent conductive material may be selected to facilitate achieving either low resistivity (or low sheet resistance), high NIR transmission, or both. In some embodiments, the transparent conductive material has a thickness between about 10 nm and about 1000 nm, between about 15 nm and about 500 nm, between about 20 nm and about 250 nm, between about 50 nm and about 150 nm, or between about 75 nm and about 125 nm, or any range or value thereinbetween. In some embodiments, the transparent conductive material has a thickness of about 10 nm, about 15 nm, about 20 nm, about 30 nm, about 40 nm, about 50 nm, about 60 nm, about 70 nm, about 80 nm, about 90 nm, about 100 nm, about 110 nm, about 120 nm, about 130 nm, about 140 nm, about 150 nm, about 160 nm, about 170 nm, about 180 nm, about 190 nm, about 200 nm, about 250 nm, about 300 nm, about 350 nm, about 400 nm, about 450 nm, about 500 nm, about 550 nm, about 600 nm, about 650 nm, about 700 nm, about 750 nm, about 800 nm, about 850 nm, about 900 nm, about 950 nm, or about 1000 nm, or any value thereinbetween.",
                        "Embodiments according to the present disclosure will be described more fully hereinafter. Aspects of the disclosure may, however, be embodied in different forms and should not be construed as limited to the embodiments set forth herein. Rather, these embodiments are provided so that this disclosure will be thorough and complete, and will fully convey the scope of the technology to those skilled in the art.",
                        "Unless otherwise defined, all terms (including technical and scientific terms) used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this invention belongs. It will be further understood that terms, such as those defined in commonly used dictionaries, should be interpreted as having a meaning that is consistent with their meaning in the context of the present application and relevant art and should not be interpreted in an idealized or overly formal sense unless expressly so defined herein. While not explicitly defined below, such terms should be interpreted according to their common meaning.",
                        "In addition, where features or aspects of the disclosure are described in terms of Markush groups, those skilled in the art will recognize that the disclosure is also thereby described in terms of any individual member or subgroup of members of the Markush group.",
                        "As will be understood by one skilled in the art, for any and all purposes, particularly in terms of providing a written description, all ranges disclosed herein also encompass any and all possible subranges and combinations of subranges thereof. Any listed range can be easily recognized as sufficiently describing and enabling the same range being broken down into at least equal halves, thirds, quarters, fifths, tenths, etc. As a non-limiting example, each range discussed herein can be readily broken down into a lower third, middle third and upper third, etc. As will also be understood by one skilled in the art all language such as “up to,” “at least,” “greater than,” “less than,” and the like, include the number recited and refer to ranges which can be subsequently broken down into subranges as discussed above. Finally, as will be understood by one skilled in the art, a range includes each individual member. Thus, for example, a group having 1-3 layers refers to groups having 1, 2, or 3 layers. Similarly, a group having 1-5 layers refers to groups having 1, 2, 3, 4, or 5 layers, and so forth.",
                        "Unless the context indicates otherwise, it is specifically intended that the various features of the invention described herein can be used in any combination. Moreover, the disclosure also contemplates that in some embodiments, any feature or combination of features set forth herein can be excluded or omitted. To illustrate, if the specification states that a complex comprises components A, B and C, it is specifically intended that any of A, B or C, or a combination thereof, can be omitted and disclaimed singularly or in any combination.",
                        "Unless explicitly indicated otherwise, all specified embodiments, features, and terms intend to include both the recited embodiment, feature, or term and biological equivalents thereof.",
                        "All patents, patent applications, provisional applications, and publications referred to or cited herein are incorporated by reference in their entirety, including all figures and tables, to the extent they are not inconsistent with the explicit teachings of this specification.",
                        "The following examples are given for the purpose of illustrating various embodiments of the disclosure and are not meant to limit the present disclosure in any fashion. One skilled in the art will appreciate readily that the present disclosure is well adapted to carry out the objects and obtain the ends and advantages mentioned, as well as those objects, ends and advantages inherent herein. The present examples, along with the methods described herein are presently representative of embodiments and are exemplary, and are not intended as limitations on the scope of the disclosure. Changes therein and other uses which are encompassed within the spirit of the disclosure as defined by the scope of the claims will occur to those skilled in the art. It is to be understood that this present technology is not limited to particular methods, reagents, compounds compositions or biological systems, which can, of course, vary. The terminology used in the description herein is for the purpose of describing particular embodiments only and is not intended to be limiting."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for producing article",
                        "define transparent conductive material",
                        "specify substrate materials",
                        "describe substrate shapes",
                        "specify thickness of transparent conductive material",
                        "describe depositing methods",
                        "specify physical vapor deposition methods",
                        "describe annealing process",
                        "specify annealing temperatures",
                        "specify annealing times",
                        "describe annealing atmospheres",
                        "specify transmission at 1550 nm",
                        "specify resistivity",
                        "describe post-annealing properties",
                        "specify transmission at 1550 nm ranges",
                        "specify resistivity ranges",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "specify transmission at 1550 nm and sheet resistance",
                        "specify transmission at 1550 nm ranges",
                        "specify sheet resistance ranges",
                        "describe transparent conductive material",
                        "specify transmission and sheet resistance",
                        "describe visible wavelength range transmission",
                        "define Haacke figure of merit",
                        "specify transmission and Haacke FoM ranges",
                        "describe additional material deposition",
                        "introduce method for modulating resistivity and NIR transmission",
                        "specify high-temperature annealing conditions",
                        "specify annealing temperature ranges",
                        "specify annealing time ranges",
                        "describe annealing atmosphere",
                        "specify transmission and resistivity after annealing",
                        "provide example embodiments of transmission and Haacke FoM",
                        "provide example embodiments of transmission and sheet resistance",
                        "provide example embodiments of transmission and Haacke FoM",
                        "describe additional material deposition options",
                        "describe method for producing article with transparent conductive material",
                        "summarize method for modulating resistivity and NIR transmission",
                        "specify transmission and resistivity ranges",
                        "specify transmission and resistivity values",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "specify transmission and sheet resistance ranges",
                        "specify transmission and sheet resistance values",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "specify transmission and Haacke FoM ranges",
                        "specify transmission and Haacke FoM values",
                        "describe improved trade-off between resistivity and NIR transmission",
                        "specify transmission and resistivity ranges for article",
                        "specify transmission and resistivity values for article",
                        "describe improved trade-off between sheet resistance and NIR transmission for article",
                        "specify transmission and sheet resistance ranges for article",
                        "specify transmission and sheet resistance values for article",
                        "describe improved trade-off between sheet resistance and NIR transmission for article",
                        "specify transmission and Haacke FoM ranges for article",
                        "specify transmission and Haacke FoM values for article",
                        "describe improved trade-off between resistivity and NIR transmission for article",
                        "specify transmission and resistivity ranges for article",
                        "specify transmission and resistivity values for article",
                        "describe improved trade-off between sheet resistance and NIR transmission for article",
                        "define transparent conductive material",
                        "specify transmission at 1550 nm",
                        "specify Haacke FoM",
                        "provide embodiment with specific transmission and Haacke FoM",
                        "specify transmission in visible wavelength range",
                        "specify materials for transparent conductive material",
                        "describe formation of layer on substrate",
                        "specify substrate materials",
                        "specify thickness of transparent conductive material",
                        "provide disclaimer on embodiments",
                        "define terms used in application",
                        "interpret Markush groups",
                        "interpret ranges and subranges",
                        "interpret language such as \"up to\" and \"at least\"",
                        "specify that features can be used in any combination",
                        "specify that features can be excluded or omitted",
                        "incorporate patents and publications by reference",
                        "provide disclaimer on examples and scope of disclosure"
                    ],
                    "num_characters": 39697,
                    "outline_medium": [
                        "introduce transparent conductive material",
                        "specify material options",
                        "describe substrate options",
                        "specify layer thickness",
                        "describe depositing methods",
                        "describe annealing conditions",
                        "specify annealing time",
                        "describe annealing atmosphere",
                        "specify material properties after annealing",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "define transparent conductive material",
                        "specify transmission and sheet resistance",
                        "introduce Haacke figure of merit",
                        "provide transmission and Haacke FoM ranges",
                        "describe additional material deposition",
                        "outline method for modulating resistivity and NIR transmission",
                        "specify annealing temperature ranges",
                        "specify annealing time ranges",
                        "describe annealing atmosphere",
                        "specify transparent conductive material properties",
                        "describe resistivity and NIR transmission ranges",
                        "provide specific embodiments of resistivity and NIR transmission",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "specify sheet resistance and NIR transmission ranges",
                        "provide specific embodiments of sheet resistance and NIR transmission",
                        "describe Haacke FoM ranges",
                        "provide specific embodiments of Haacke FoM",
                        "describe article comprising transparent conductive material layer",
                        "specify properties of transparent conductive material layer",
                        "define transparent conductive material",
                        "specify transmission and Haacke FoM values",
                        "describe embodiments of transparent conductive material",
                        "specify materials for transparent conductive material",
                        "describe substrate for transparent conductive material",
                        "specify thickness of transparent conductive material",
                        "provide disclaimer for embodiments",
                        "define terms and interpretation",
                        "provide examples and disclaimer for scope of disclosure"
                    ],
                    "outline_short": [
                        "define transparent conductive material",
                        "describe deposition methods",
                        "specify annealing conditions",
                        "detail material properties after annealing",
                        "describe improved trade-off between sheet resistance and NIR transmission",
                        "define transparent conductive material",
                        "describe annealing process",
                        "specify transmission and resistivity ranges",
                        "outline additional material deposition and modulation methods",
                        "specify material properties",
                        "describe material performance",
                        "provide material embodiments",
                        "detail article composition",
                        "outline article properties",
                        "define transparent conductive material",
                        "describe embodiments of material",
                        "discuss substrate and thickness",
                        "provide general information and disclaimers"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1: Preparation and Characterization of ITO Films",
                            "paragraphs": [
                                "Deposition by RF Sputtering. ITO films of thickness 100 nm were deposited onto fused silica substrates via RF sputtering at room temperature. Double-sided, optically polished, ultraviolet-fused silica glass substrates, with a thickness of 1 mm and an area of 1-in2 were cleaned by ultrasonication in an acetone bath for 10 min, followed by ultrasonication in an ethanol bath for 10 min. The substrates were then rinsed in deionized water and dried with a stream of nitrogen gas.",
                                "The ITO was deposited by magnetron sputtering. The sputtering chamber was initially evacuated to a base pressure of approximately 10−7-10−8 Torr. To improve film adhesion to the substrate, low-power argon plasma cleaning was performed for 15 min. inside the sputtering chamber prior to deposition, using Ar gas (20 sccm) at a pressure of 8 mTorr and using a bias power of 40 W.",
                                "An ITO (99.99%) sputtering target (Kurt J. Lesker Co.) was used for depositing ITO films with DC power of 60 W and working pressure of 2 mTorr. The deposition was conducted under an Ar/O2 gas mixture (flux ratio of 20:1) at room temperature. The target-to-substrate distance was maintained at 30 cm, and the substrate holder was rotated during deposition at a speed of 60 rpm. The deposition rate was 0.694 Å s−1.",
                                "High-Temperature Annealing. The as-deposited ITO films (Example 1a) were removed from the sputtering chamber and were annealed in a RTP-150-HV rapid thermal process oven (UniTemp, GmBH) at 750° C. under a nitrogen gas ambient. The effective total annealing time was varied from 15 min to 10 hr (Examples 1c-1j). Although the samples in Examples 1c-1j were annealed at 750° C., the high temperature annealing (HTA) process may be carried out at temperatures from about 450° C. to about 850° C. and for annealing times of, for example 2 min to 10 hr, or longer.",
                                "Prior to annealing, the process chamber was iteratively purged (12-20 L min−1) with nitrogen gas and evacuated, which sequence was repeated 3 times to ensure oxygen-free conditions inside the process chamber. During annealing, the N2 flow was reduced to 2 L min−1. Upon completion of the annealing time, the N2 flow was increased to 10 L min−1 to expedite cooling of the process chamber. FIG. 1 shows a typical process flow diagram from a 2-hr high-temperature annealing process.",
                                "Low-Temperature Annealing. ITO films prepared according to the above magnetron sputtering procedure were also annealed at low temperature for comparison to HTA-ITO. In the LTA process, the bare ITO films are annealed on a hotplate at 200° C. for 1 hr, then allowed to cool, in room ambient atmosphere (Example 1b).",
                                "Film Characterization. The electrical properties of the ITO films were measured according to the four-point probe method using a Cascade Microtech 44/7 S 2749 probe station connected to a Keithley 2001 multimeter. Typically, Rs represents an average of six different measurements, each recorded at a different position on the film.",
                                "Film surface morphology was investigated by AFM (Bruker Dimension FastScan D3100) using a lateral resolution of <7 nm, and field-emission SEM (Zeiss 1550VP). A spectrophotometer (Perkin Elmer LAMBDA 950) was used for optical spectra measurements in the visible and near-infrared wavelength ranges."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "deposit ITO films by RF sputtering",
                                "clean substrates",
                                "perform low-power argon plasma cleaning",
                                "deposit ITO films with DC power",
                                "perform high-temperature annealing",
                                "characterize film properties"
                            ],
                            "num_characters": 3262,
                            "outline_medium": [
                                "deposit ITO films by RF sputtering",
                                "perform high-temperature annealing",
                                "characterize film properties"
                            ],
                            "outline_short": [
                                "deposit and anneal ITO films"
                            ]
                        },
                        {
                            "title": "Comparative Examples 1-9: Deposition Conditions for ITO Films",
                            "paragraphs": [
                                "Table 1 below summarizes conditions used to prepare Comparative Examples 1-9, which are all ITO materials produced by physical vapor deposition processes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize deposition conditions"
                            ],
                            "num_characters": 154,
                            "outline_medium": [
                                "summarize deposition conditions"
                            ],
                            "outline_short": [
                                "summarize deposition conditions"
                            ]
                        },
                        {
                            "title": "Example 2: Structural Analysis of RF-Sputtered ITO Films After High-Temperature Annealing",
                            "paragraphs": [
                                "As discussed above, Comparative Examples 1-2 and 4-9 are annealed in uncontrolled atmospheric conditions. To assess the effect of controlled atmospheric conditions and annealing temperature on ITO film morphology, magnetron-sputtered ITO films on fused silica, according to Example 1, were analyzed by SEM and AFM.",
                                "Referring now to FIGS. 2-3, SEM images show the differences in surface morphology between ITO films which are low-temperature annealed (LTA) in room ambient atmosphere at 200° C. for 1 hr (FIGS. 2A-B, Example 1b) and ITO films which are high-temperature annealed (HTA), at 750° C. for 1 hr. (FIGS. 3A-B, Example 1e). Top-down and cross-sectional images are shown in FIGS. 2A & 3A and FIGS. 2B & 3B, respectively. The images show that high-temperature annealing leads to thermal grooving.",
                                "Based on the SEM observation of thermal grooving in HTA-ITO films, the surface morphologies of the films and depth profiles of the cracks were further investigated using atomic force microscopy (AFM). Referring now to FIGS. 4-5, AFM images show that the as-deposited ITO films (Example 1a) are relatively smooth (FIG. 4A, RMS=0.515 nm) compared to the HTA-ITO films (Example 1e, FIG. 5A, RMS=3.43 nm), due to the thermal grooving in HTA-ITO. The depth profiles in FIGS. 4B and 5B show that the HTA annealing produces a nanostructured surface with large grooves with depths up to approximately 10-15 nm or greater (FIG. 5B), while the as-deposited ITO shows no such features (FIG. 4B).",
                                "Referring now to FIG. 6, without being bound to any particular theory, it is believed that the HTA annealing process results in thermal grooving, and that the observed changes in surface morphology for HTA-ITO increase the effective surface area of those films. These surface morphological evolutions may make ITO films advantageous for use in applications such as organic solar cells, where an increase in contact area between the hole transport layer and the ITO anode may eventually increase the hole extraction efficiency and thus permit higher power conversion efficiency."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze surface morphology by SEM",
                                "analyze surface morphology by AFM",
                                "show thermal grooving effect",
                                "discuss implications for organic solar cells"
                            ],
                            "num_characters": 2068,
                            "outline_medium": [
                                "analyze surface morphology by SEM and AFM",
                                "discuss thermal grooving and surface area increase"
                            ],
                            "outline_short": [
                                "analyze surface morphology"
                            ]
                        },
                        {
                            "title": "Example 3: Optical Properties of HTA-ITO Films",
                            "paragraphs": [
                                "To investigate the effect of annealing conditions on the optical properties of LTA and HTA-ITO films, 100-nm ITO films were deposited onto fused silica substrates by magnetron sputtering (Example 1). The films were then characterized by spectrophotometry to determine transmission, reflection, and absorption as a function of annealing time (Examples 1c-1j, from 15 min to 10 hr) at 750° C., as shown in FIGS. 7A, 7B, and 7C, respectively.",
                                "FIGS. 7A-C compare the optical spectra of HTA-ITO substrates compared with as-deposited (bare) ITO and LTA-ITO. Based on FIG. 7A, it is clear that the transmission in the near infrared region (750-2400 nm) increases with HTA annealing time. The observed increase in transmission is a function of reduction in reflection (FIG. 7B) and absorption (FIG. 7C) with increased HTA annealing time. Table 2 summarizes the optical characterization data along with sheet resistance data (Example 4).",
                                "As shown in Table 2, with HTA annealing of 10 hr (Example 1j), a maximum transmission of 82.35% is achieved at the wavelength 1550 nm, with corresponding sheet resistance of 22.3 Ohm/sq. Corresponding average transmissions of 77.81% and 83.85% are achieved in the near-TR (750-2400 nm) and visible (380-750 nm) spectra, respectively. In contrast, after only 15 minutes of HTA annealing (Example 1c), the films exhibited a lower sheet resistance of 12.24 Ohm/sq., a higher average visible transmission of 86.04%, and a lower NIR transmission of 63.71%. Thus, the data in Table 2 demonstrate that the sheet resistance and optical properties can be modulated by altering the HTA duration.",
                                "Furthermore, Table 2 compares the data for HTA-ITO with that obtained for LTA-ITO. As compared to the HTA-ITO data, the LTA process affords a higher sheet resistance of 15.74 Ohm/sq., with lower transmission of 86.89% and 56.3% in the visible and near-IR regions, respectively. This comparison underlines the substantial improvement in resistivity and transmission trade-offs that can be achieved with HTA annealing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "deposit ITO films by magnetron sputtering",
                                "characterize optical properties by spectrophotometry",
                                "show effect of annealing time on transmission",
                                "discuss implications for optical applications"
                            ],
                            "num_characters": 2034,
                            "outline_medium": [
                                "measure transmission, reflection, and absorption",
                                "discuss effect of annealing time on optical properties"
                            ],
                            "outline_short": [
                                "measure optical properties"
                            ]
                        },
                        {
                            "title": "Example 4: Comparison of Resistivity, Transmission, and Haacke FoM for HTA-ITO According to the Present Disclosure to Data for Comparative Examples 1-9",
                            "paragraphs": [
                                "Table 3 compares near IR transmission (1550 nm) and resistivity for Comparative Examples 1-9 to those measured for the HTA-ITO materials of the present disclosure. FIG. 8A plots the transmission data against resistivity. All the NIR transmission values include substrate contribution. However, transmission depends on ITO thickness (because of the thickness-related loss of absorption), so thinner ITO samples tend to exhibit higher transmission. Therefore, for another mode of comparison, FIG. 8B plots corresponding NIR transmission data (1550 nm) versus calculated sheet resistance (sheet resistance=resistivity divided by thickness).",
                                "Regardless of whether resistivity or sheet resistance is used as the basis for comparison HTA-ITO prepared according the present disclosure offers an improvement in transmission and resistivity (or sheet resistance) trade-offs. In other words, HTA-ITO according to the present disclosure offers a lower resistivity for a given transmission value, or a higher transmission for a given resistivity, as compared to the Comparative Examples. Even when sheet resistance is considered, although the HTA-ITO of the present disclosure appears to provide similar or only slightly better trade-offs than, e.g., Comparative Examples 6 and 7, the HTA-ITO of the present disclosure is much thinner. For example the presently disclosed HTA-ITO is 2.5 and 5 times thinner than for Comparative Examples 6 and 7, respectively. Additionally, the ITO materials of the present disclosure show an improved Haacke FoM over the Comparative Examples. For instance, Example 1j shows a transmission at 1550 nm of 82.4% and a Haacke FoM of 64.289×10−4Ω−1, compared to Comparative Example 6, which shows a transmission of approximately 80% but a Haacke FoM of only 41.027×10−4Ω−1.",
                                "The thin films of ITO deposited according to the present disclosure are advantageous for several reasons. While not being bound to any particular theory, it is hypothesized that using thin films on the order of 15 nm to 500 nm enables high optical transmission. Optical loss occurs primarily due to reflection at the glass-ITO interfaces and absorption by the ITO itself. By using ITO films on the order of between 15 nm to 500 nm thick (e.g., 100 nm thick), reflection does not change significantly, while absorption decreases. Thus, the transmission increases. Additionally, indium is a scarce and expensive material, so using thinner films decreases the material quantity and cost.",
                                "The trade-off between optical transparency in the NIR region (as shown by transmission spectra) and resistivity, as a function of annealing conditions, is shown in FIG. 9A. The chart shows data for as-deposited ITO (Example 1a), LTA-ITO annealed at 200° C. for 1 hr, in air (Example 1b), and HTA-ITO annealed at 750° C. for 15 min to 10 hr, under N2 (Examples 1c-1j). In particular, the data for HTA-ITO shows the transmission in the NIR range and at 1550 nm increase markedly as annealing time at 750° C. increases, while the average transmission in the visible range slightly decreases but stays above 80%, regardless of increases in resistivity. The data shows that as the transmission increases, the resistivity also increases but remains much lower than for as-deposited ITO. FIG. 9A also shows that the NIR transmission is much higher for HTA-ITO than for LTA-ITO, for the same resistivity.",
                                "Without being bound to any particular theory, the increase in transmission in the NIR region and the corresponding increase in resistivity is believed to be a function of carrier density. The relationships among carrier density, mobility, resistivity, and annealing conditions are summarized in FIG. 9B, which plots carrier density (▪) and carrier mobility (●) against resistivity for as-deposited ITO (Example 1a), LTA-ITO annealed at 200° C. for 1 hr, in air (Example 1b), and HTA-ITO annealed at 750° C. under N2 atmosphere for 15 min (Example 1c), 1 hr (Example 1e), 4 hr (Example 1g), and 10 hr (Example 1j). The data show that with increased annealing time, carrier density decreases. (This corresponds to the increase in NIR transmission, as shown in FIG. 9A). The reduction in carrier density may be due to reduction of defects (i.e., doping) with increased annealing time for HTA-ITO. Meanwhile, in comparison to as-deposited ITO and LTA-ITO, the HTA-ITO maintains higher mobility due to the improvement of crystallinity with higher-temperature annealing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "compare transmission and resistivity data",
                                "plot transmission vs resistivity",
                                "plot transmission vs sheet resistance",
                                "discuss advantages of HTA-ITO",
                                "discuss implications for material cost",
                                "show trade-off between transmission and resistivity",
                                "discuss relationships among carrier density, mobility, and resistivity",
                                "summarize implications for optical applications"
                            ],
                            "num_characters": 4441,
                            "outline_medium": [
                                "compare transmission and resistivity data",
                                "plot transmission vs. resistivity and sheet resistance",
                                "discuss advantages of HTA-ITO over Comparative Examples",
                                "discuss Haacke FoM and thin film advantages"
                            ],
                            "outline_short": [
                                "compare resistivity and transmission",
                                "compare Haacke FoM"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [
                "claim priority under 35 U.S.C. § 119"
            ],
            "num_characters": 236,
            "outline_medium": [
                "claim priority of provisional application"
            ],
            "outline_short": [
                "claim priority of provisional application"
            ]
        }
    ],
    "claims": [
        "1. A method for producing an article, comprising:\n(a) depositing a layer of a transparent conductive material on a substrate, wherein the layer of the transparent conductive material has a thickness between about 20 nm and 250 nm; and\n(b) annealing the transparent conductive material at a temperature of at least about 450° C. for at least about 2 min;\nwherein after the annealing, the transparent conductive material has a transmission of at least about 70% at 1550 nm or a Haacke figure of merit of at least about 40×10−4Ω−1.",
        "2. The method of claim 1, wherein the annealing takes place at a temperature of about 750° C.",
        "3. The method of claim 1, wherein the transparent conductive material comprises indium tin oxide.",
        "4. The method of claim 1, wherein the thickness of the layer of the transparent conductive material is between about 50 nm and about 150 nm.",
        "5. The method of claim 1, wherein the layer of the transparent conductive material has a resistivity of less than or equal to about 5×10−4 Ohm-cm after the annealing.",
        "6. The method of claim 1, wherein the depositing comprises physical vapor deposition.",
        "7. The method of claim 1, wherein the depositing comprises magnetron sputtering.",
        "8. The method of claim 1, wherein the annealing takes place in an atmosphere containing less than about 5% oxygen.",
        "9. The method of claim 1, wherein the layer of the transparent conductive material has a transmission in the visible range of at least 80% after the annealing.",
        "10. A method for modulating the resistivity and optical transmission of a transparent conductive material, comprising annealing the transparent conductive material at a temperature of at least 450° C. for at least about 2 minutes, wherein after the annealing, the transparent conductive material has a transmission of at least about 70% at 1550 nm or a Haacke figure of merit of at least about 40×10−4Ω−1.",
        "11. The method of claim 10, wherein the transparent conductive material comprises indium tin oxide.",
        "12. The method of claim 10, wherein the transparent conductive material comprises a layer with a thickness of between about 20 nm and about 250 nm.",
        "13. The method of claim 10, wherein after the annealing, the transparent conductive material has a transmission of at least about 80% at 1550 nm or a Haacke figure of merit of at least about 60×10−4Ω−1.",
        "14. The method of claim 10, wherein the transparent conductive material has a transmission of at least about 70% at 1550 nm and a resistivity of less than or equal to about 5×10−4 Ohm-cm after the annealing.",
        "15. The method of claim 10, wherein the annealing takes place in an atmosphere containing less than about 5% oxygen.",
        "16. An article, comprising a layer of a transparent conductive material, wherein the layer of the transparent conductive material has a thickness of between about 20 nm and about 250 nm, a transmission of at least 70% at 1550 nm, or a Haacke figure of merit of at least 40×10−4Ω−1.",
        "17. The article of claim 16, wherein the transparent conductive material comprises indium tin oxide.",
        "18. The article of claim 16, wherein the thickness of the layer of the transparent conductive material is between about 50 nm and about 150 nm.",
        "19. The article according to claim 16, wherein the layer of the transparent conductive material has a resistivity of less than or equal to about 5×10−4 Ohm-cm.",
        "20. The article of claim 16, wherein the layer of the transparent conductive material has a transmission of at least about 80% at 1550 nm and a Haacke figure of merit of at least about 60×10−4Ω−1.",
        "21. The article of claim 16, wherein the layer of the transparent conductive material has a transmission in the visible range of at least 80%."
    ]
}