{
    "id": "https://semopenalex.org/work/W3195132215",
    "authors": [
        "Micah J. Green",
        "Rohan A. Hule",
        "Sanjit Saha",
        "Xiaofei Zhao",
        "Matthew J. Mason",
        "Sergey Yakovlev",
        "Pritishma Lakhe",
        "Kailash Arole",
        "Sundararajan Uppili",
        "Bryan J. Coleman"
    ],
    "title": "Sustainable production of graphene from petroleum coke using electrochemical exfoliation",
    "date": "2021-08-23",
    "abstract": "Petroleum coke is a solid, carbonaceous by-product of oil refining and is normally used for heating or as an anode in aluminum and steel production. These applications contribute to carbon emissions, but here we show that petroleum coke has another potential avenue: as a precursor for graphene production. This path presents an environmentally and economically sustainable use for a low-value industrial stream. Electrochemical exfoliation is used to produce graphene nanosheets from petroleum coke, rather than graphite. The final product is separated from the unreacted material by a two-step centrifuging process. SEM and TEM images confirm that the final product contains few-layered nanosheets, and the Raman spectra confirm that the exfoliated coke product is indeed graphene. Post-annealing of this product substantially increases the electrical conductivity. This new finding holds potential for the petroleum industry to produce a value-added nanomaterial and enhance the economic impact of slurry oil and slurry oil-derived coke streams by orders of magnitude; this route also allows these streams to be directed away from high-emissions uses.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "With the continuing rise in concern over sustainable resource use, the petrochemical industry faces challenges in managing each of its product streams. Even by-products of oil refining, such as petroleum coke, are difficult to utilize sustainably; coke is produced by heating resids or slurry oils from refinery units such as Fluid Catalytic Crackers. Coke is used as a fuel for heating in several industries, and the combustion of coke produces more CO 2 per fuel mass than coal 1 . Coke is also used in the steel and aluminum industries as an anode for smelting, a process that also emits greenhouse gases 2 . These concerns highlight the global need to repurpose existing petroleum streams such as coke and its precursor oils toward sustainable end-uses (Fig. 1).",
                "Here, we demonstrate the use of petroleum coke as a feedstock for carbon nanomaterial production. Graphene, in particular, is an exciting target because of its ongoing deployment into a range of application fields including batteries, supercapacitors, structural materials, transparent electronics, and flexible wearable devices 3,4 . It is highly desirable to expand the suite of graphene precursors to include existing industrial by-products.",
                "The economics of possible coke-to-graphene processes are quite striking: needle coke, the highest quality grade of petroleum coke, can be used for electrodes in steel production and can be purchased for ~$1500-3000/ton. Bulk graphene powder can be purchased at the lab scale for as little as ~$8/gram, orders of magnitude more valuable than coke. This latter price will decrease with scaleup, but this is still an order-of-magnitude increase in economic value.",
                "In addition, petroleum coke provides an additional feedstock for graphene production. Natural graphite is a finite source; it is estimated that 800 million tons can be recovered worldwide 5 . Furthermore, much of it is difficult to use or unusable for graphene production because only 10-15% of natural graphite is actually graphitic carbon; most of it is amorphous and contains silicate minerals or metals 5 . In contrast, needle coke can be consistently produced with high graphitic content and low impurity concentrations. Global needle coke production was at 1.1 million tons per year as of 2020, and it is expected to increase to 1.5 million tons per year by 2026 6 . However, these numbers are based on the demand for needle coke for the steel and lithium-ion battery industries; needle coke production can be significantly increased to meet additional demand if needed. Although petroleum (and therefore petroleum coke) is also a finite resource, progress has been made toward producing needle coke from renewable feedstocks such as biomass 7 or plastic waste 8 . Not only can needle coke be a more permanent feedstock for graphene production, but this avenue also the petroleum portfolio away from high-emission end-uses.",
                "Graphite-derived graphene is well-documented [9][10][11] , but cokederived graphene has not been extensively explored. Prior work on the production of graphene from coke has largely focused on graphene oxide (GO) and explored the effect of crystallinity on the resulting lateral size 10,12,13 . Ball-milling coke with stearic acid has also been explored 14 , but questions remain about the distinction between the parent material and the final graphene-like product, particularly in their Raman signature. This is likely related to a lack of effective separation procedures in place.",
                "Our group recently demonstrated the potential for high-yield and scalable production of high-quality graphene nanosheets using an electrochemical exfoliation (ECE) method in a compressed expandable chamber 15,16 . The compressed reactor allows for expansion of the parent material as it is exfoliated while maintaining electrical contact throughout the mixture. (This is superior to conventional electrochemical methods that use graphite monoliths as a parent material; the exfoliation process breaks apart the graphite monolith, losing electrical contact and halting the reaction.) The resulting nanosheets are termed electrochemically exfoliated graphene (EEG). Simpler ECE procedures have been attempted on coke before, but the resulting material either formed small graphene quantum dots or required additional post-processing exfoliation 17,18 .",
                "In this work, different needle coke grades are evaluated as the parent material for the ECE process in a compressed chamber. The reactor product contained unreacted material, unwanted small particles, and a graphene-like product, termed Coke-EEG, which was isolated by a two-step centrifugation method. The morphology and composition of the final product confirm that this material is indeed a graphene-family material. This finding is at the core of a new industrial push toward the use of natural gas and petroleum streams to produce high-value nanomaterials [19][20][21][22][23] ."
            ],
            "subsections": [
                {
                    "title": "RESULTS AND DISCUSSION ECE of coke",
                    "paragraphs": [
                        "Here, we show that petroleum cokes can be electrochemically exfoliated into graphene-like structures. The ECE method depends on electrolyte intercalating between the layers of precursor material to achieve the best results. Thus, a more layered, crystalline coke precursor has more potential for graphene production. Needle coke is highly crystalline and has long needle-like structures. The high aromaticity and layered structure make needle coke the most promising coke candidate to act as a graphene precursor. The field emission scanning electron microscope (FE-SEM) images in Fig. 2 show the layered structure of CK-1, with layer thicknesses that can be <100 nm. (More images corresponding to this and other cokes are presented in Supplementary Figs. 123) Figure 3 represents the ECE process, in which the starting material is the parent coke, and the final product is then exfoliated and separated coke (CK-d). The ECE process contains four steps described in detail in Supplementary Fig. 4. Supplementary Fig. 4a describes the pre-treatment and washing process. The nitric acid pre-treatment allows for a more hydrophilic (and wettable) starting material, allowing for better exposure to the electrolyte solution during the ECE process. Supplementary Fig. 4b shows the pre-reaction separation process through centrifugation at 4000 rpm for 10 min. The separated parent material (sediment) was used as the starting material for the ECE process (Supplementary Fig. 4c), which was carried out at 12 V for 2 h. This voltage is unusually high relative to that used for graphite ECE. However, below this voltage, the yield of coke-EEG is quite low. Above 12 V, the membrane itself may be damaged. The CK-b samples are compacted inside a hollow cellulose membrane. To keep the working electrode (CK-b) compacted into an electrically Fig. 1 Schematic of Refinery Products. Simplified schematic of refinery operations and products: there is a need to push these petroleum streams toward products with low end-use emissions, such as carbon nanomaterials. Fig. 3 Schematic of the coke-graphene synthesis process. It contains four steps as described in the scheme as follows: pre-treatment, prereaction separation, electrochemical exfoliation process, post-reaction separation process.",
                        "conducting monolith, an external weight is placed on top of the membrane. Both the working and counter electrodes are submerged in the electrolyte. Under a positive bias at the working electrode, CK-b samples are then exfoliated to CK-c (EEG). After the reaction, the reaction mixture is washed and then suspended in an ethanol-water mixture. The ECE product contained nonexfoliated coke, smaller non-graphitic material, and the EEG product. To separate the graphene sheets (final product) from the undesired material, a two-step centrifuge process was followed as described in Supplementary Fig. 4d; the first centrifuge removes the unreacted parent material, and the second centrifuge removes the small, non-graphitic material."
                    ],
                    "subsections": []
                },
                {
                    "title": "Characterization of coke-derived graphene",
                    "paragraphs": [
                        "The FE-SEM images of CK-1b and CK-1c, the parent material and product of the ECE process, are shown in Supplementary Fig. 5a and Supplementary Fig. 5b, respectively. These images show that the ECE process breaks down some of the 40 μm-sized parent material particles into smaller sheet-like graphene platelets and some smaller non-graphitic particles.",
                        "More importantly, graphene-like nanosheets are clearly seen in FE-SEM images (Fig. 4a,b) of CK-1d (final product, reacted and then separated), confirming the major hypothesis of the paper. The lateral dimension of the coke-graphene sheets varies considerably, with the majority of lateral sizes in the 1-3 µm range. The presence of graphene sheets was further investigated by TEM imaging. Figure 4c,d show HR-TEM images of CK-1d where graphene-like sheets are clearly visible (additional TEM images can be found in Supplementary Figs. 6,7). Moreover, high-resolution imaging reveals a hexagonally packed crystalline lattice of sheets as seen in Fig. 4d. This lattice corresponds to a graphitic structure and is virtually identical to the structure observed on graphite-derived EEG shown in Supplementary Fig. 8. The sheets appear to be a single crystal, with no grain boundaries observed in the micrograph field of view. (However, sheets frequently contain folds that may potentially mask such features.) The coke-derived product has a smaller fraction of very large particles relative to graphite-derived EEG, likely owing to the thorough post-processing separation.",
                        "The yield of the coke-derived graphene product was ~1.6%, which is lower than typical EEG yields of 10% or more (depending on reaction conditions) reported in our prior work, indicating that coke is more difficult to exfoliate than graphite 15,16 . However, this value is far lower than the true yield because of the need for the centrifuge process post reaction to isolate EEG from both parent material and impurities. Our prior work indicates that significant graphene product remains in the unwanted material and can be recovered via multiple separation passes 24 . The remaining material may also be recycled back through the process as a parent material with no pre-treatment.",
                        "In contrast, the ECE products of CK-2 and CK-3 did not contain a significant amount of well-defined, graphene-like sheets. Supplementary Fig. 9a shows an FE-SEM image of CK-3d. Although a few large sheets are visible, most of the structures are not graphenelike but are more similar to large needle-like structures. In addition, Supplementary Fig. 9b shows an FE-SEM image of CK-2d; graphene-like sheets are not visible in this image either. The presence of large plate-like and needle-like structures suggests that graphene was not successfully prepared from CK-2 or CK-3 by the ECE process. TEM images of CK-3d (Supplementary Fig. 9c) and CK-2d (Supplementary Fig. 9d) also do not show any sheet-like structures. These ECE products (CK-2d, CK-3d) are quite different than the graphene-like structure in CK-1d. Potential reasons for this difference may relate to the parent material structure.",
                        "Petroleum cokes are produced in a variety of manners, many of which are proprietary. Although specific production details of each coke are unknown, optical microscopy was carried out on each parent material to distinguish their morphology. Note that CK-2 and CK-3 were received as relatively large pieces and required grinding prior to the ECE process. The CK-1 powder was very fine and has a significantly smaller particle size than CK-2 and CK-3. The CK-1 particle edges are more jagged, angular, and distorted, whereas the CK-2 and CK-3 particles have more rounded edges and no layers. These morphology differences may allow for differences in acid effects, electrolyte intercalation, and ease in layer exfoliation. Optical images of each parent material are included in Supplementary Figs. 10-12. Aside from these morphology factors, the three-parent needle cokes are quite similar, including in their Raman and TGA data (discussed below).",
                        "The electron diffraction pattern of CK-1d (Fig. 5a) shows a crystalline structure with a well-ordered hexagonal arrangement of atoms, confirming the formation of graphene-like nanosheets. This pattern observed on CK-1d is similar to patterns observed in graphite-derived EEG (Fig. 5b). In contrast, the electron diffraction pattern of the CK-1 coke parent material (Fig. 5c) shows broad (amorphous) rings. Similarly, CK-2d (Fig. 5d) shows similar features, indicating an amorphous final product. There is a signature of these same features in the pattern for CK-1d, suggesting higher amorphous content than graphite-derived EEG.",
                        "The oxidation content in the parent coke and EEG product can be assessed in multiple ways: in our prior work, we showed that thermogravimetric analysis (TGA) can be used as a rough measure of oxygen content. TGA analysis of the parent coke and EEG product is shown in Fig. 6a. At ~700 °C, half of CK-1d is removed 15 . At the same temperature (700 °C), only ~10% of the mass was removed for CK-1a, indicating that the degree of oxidation is higher for CK-1d than CK-1a; this indicates that some oxidation may occur during ECE. However, the degree of oxidation is lower than that seen in GO or even in graphite-derived EEG 15 . X-ray photoelectron spectroscopy (XPS) was used to determine the surface composition of the CK-1d sample shown in Supplementary Fig. S13. CK-1d material has oxygen to carbon atomic ratio (O:C) of 0.29 which remains relatively low; in addition, we did not observe much C-O bonding based on the C 1 s peak fittings. This suggests a product that is more similar to graphene than GO 25 . Nitrogen element was not observed for this sample, indicated by the XPS survey spectra (no peak shows ~399 eV where N 1 s peak should be).",
                        "Electron energy loss analysis was also performed to evaluate the level of oxidation. It was shown in prior work that GO has a sharp peak immediately after the π* excitation peak at ~279 eV in carbon k-edge 26 . The magnitude of this peak increases with an increase in oxygen content. At ~10-15% oxygen, the magnitude of this peak becomes equal to the magnitude of the π* peak. Figure 6b shows the spectra collected from CK-1a, graphite, and EEG derived from graphite and the coke. Neither coke nor graphite shows the peak corresponding to oxidation. Graphitederived EEG contains 10-15% of oxygen, which is consistent with prior findings, whereas the coke-derived EEG is considerably less.",
                        "Raman spectra provide valuable information about carbonaceous materials. Generally, Raman generates two distinct peaks at ~1350 and 1570 cm -1 called the D and G band, respectively. The G band is related to the graphitic structure (sp 2 ), whereas the D band indicates a distortion or defect (sp 3 ). In our data (Fig. 6c), the relative intensity of the G band is significantly higher for CK-1d than for the CK-1 parent or CK-1c. This indicates the isolation of an sp 2 structure. The Raman peak fitting results are displayed in Supplementary Fig. 14. In addition, more accurate values of the I D / I G ratios based on the intensities of the fitted D and G peaks are also included in Supplementary Fig. 14.",
                        "However, the most exciting finding was the appearance of a 2D peak in the CK-1d Raman spectra (Fig. 6c). The parent coke has no 2D peak; this suggests that the parent lacks sufficient graphitic content to show this classic graphite signature. A small 2D hump is present in CK-1c, which indicates that after the ECE process, a significant amount of graphene-like material is present. The 2D peak is even larger (with no shoulder in the peak) in CK-1d, confirming that the centrifugation process separates the graphene product from unwanted material. Note that the difference between these 2D peaks indicates that our process is isolating the exfoliated graphene-like material from the parent material, not converting it; the lack of a 2D peak in the parent coke indicates that the maximum possible graphene yield will be considerably lower than that of graphite.",
                        "In contrast, no significant difference was observed in the Raman spectra for CK-2 and CK-3 before and after exfoliation. Supplementary Fig. 15 shows the Raman spectra of CK-2a, CK-2c, and CK-2d. The I D /I G ratio of CK-2d was only slightly lower than CK-2a and CK-2c. However, this does suggest that the ECE process is still isolating primarily sp 2 structures even from less crystalline precursors. A similar scenario is found for the Raman spectra of CK-3a, CK-3c, and CK-3d (Supplementary Fig. 16). XRD of the parent cokes (Supplementary Fig. 17) shows that all the starting material has (002) peaks at 26°."
                    ],
                    "subsections": []
                },
                {
                    "title": "Electrical properties and annealing of coke-derived graphene",
                    "paragraphs": [
                        "Vacuum-filtered films were made from the dispersions of both coke and coke-derived graphene. The electrical conductivities of parent CK-1, CK-2, and CK-3 were measured as 0.07, 0.23, and 0.38 S/m, respectively (Supplementary Table 1). Electrical conductivity increased significantly after the exfoliation and separation process; the electrical conductivities of the three CK-d samples are summarized in Table 1. The electrical conductivity of CK-1d is high (~56.9 S/m), which can be attributed to its graphene-like structure. However, the other samples show relatively poor electrical conductivity. This is consistent with the microscopy results described earlier: CK-1d is graphene-like, whereas CK-2d and CK-3d do not show a graphene-like morphology.",
                        "The electrical conductivity of the coke-derived graphene was lower than graphene-produced from graphite, so thermal annealing (500 °C for 12 h in a tube furnace) was carried out on CK-1d to increase its electrical conductivity (Supplementary Table 2). This step significantly improved the electrical conductivities of both graphite-derived EEG and CK-1d (Supplementary Table 3) to 9735 and 250 S/m, respectively.",
                        "Additional thermal reduction and annealing were carried out at a range of temperatures and times for CK-1d to determine how both graphene structure and conductivity may be improved. These studies show that temperature has a much greater impact on electrical conductivity than time does (Table 2). When the annealing time was increased from 12 to 24 h, the conductivity increased only slightly from 250 to 258 S/m (at 500 °C). However, when the annealing temperature was increased from 500 to 900 °C, the electrical conductivity increased significantly from 250 to 345 S/m (for 12 h of annealing). Furthermore, for annealing at 1100 °C, the electrical conductivity is 474 S/m. For Li-ion battery applications, the required conductivity is between 10 and 1000 S/ m, so this is a suitable target for annealed CK-1d 27,28 .  Energy loss analysis of coke EEG annealed at various temperatures did not reveal any in electronic structure (Supplementary Fig. 18). One possible reason for the conductivity increase is the removal of covalently bound oxygen groups or adsorbed impurities. However, this should be achieved at 500 °C and 12 h. Beyond 500 °C, the conductivity further increases, possibly due to the removal of other impurities or molecular restructuring 29,30 . The relationship between temperature and conductivity is related to the restructuring process, but this process is not yet fully understood. Note that the improved conductivity may also result from improved graphenegraphene contacts in addition to the graphene structure changing during annealing. Considering the low initial content of oxygen in coke-derived EEG, we conclude that reduction is not the main reason for the conductivity increase. (Additional data on the TGA of these samples is found in Supporting Information, Supplementary Fig. 19)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "In this work, needle cokes were explored as an alternative feedstock to produce graphene. Both microscopy and Raman indicate that graphene was successfully prepared from needle coke fines via the ECE process, with Raman analysis confirming that CK-1d contains few-layer graphene sheets. In this process, the centrifugation before the ECE reaction is important for refining the reaction feedstock, and the centrifugation after the reaction is crucial for separating the graphene product from the unreacted parent material. The final graphene material can be modified through annealing to achieve excellent conductivities appropriate for energy storage devices. These results show there is a promising pathway through which industry can sustainably use a by-product stream to produce a valuable low-emissions material. This also means that slurry oil (the precursor to many cokes) can be re-routed to produce coke and coke-derived graphene rather than high-emissions fuels. The emissions associated with the actual ECE process will decrease per mass if the process is scaled up. Furthermore, this process is economically advantageous, converting a low-value stream into a high-value nanomaterial product. High-value carbonates are a substantial market, depending on conductivity and aspect ratio, with values in the range of $10,000/ton; production of coke-derived EEG feeds into both the composites and electronics sectors of this market."
            ],
            "subsections": [
                {
                    "title": "METHODS Materials",
                    "paragraphs": [
                        "In the coking process, the heaviest components of petroleum are pressurized with steam and water to form solid petroleum coke. This process takes place inside a large vessel called a \"coker unit\". The raw coke that comes directly out of a coker unit is termed \"green coke\" and has 10-20 wt% volatile hydrocarbons. Petroleum cokes are categorized based on their application, with three major grades: fuel coke, anode coke, and needle coke 31,32 . A coker unit could produce one of these three grades depending on the process temperature, duration of coking, and the quality of hydrocarbon feedstocks. Low-grade vacuum residues produce the lowest value fuel coke as a by-product which is high in impurities (heavy metals, sulfur, and nitrogen) and is used as fuel in electricity generation and cement kilns. Relatively higher-grade vacuum residues are used to make anode grade coke, which has moderate value and is used in the aluminum industry. The highest quality and value, needle coke, is produced by coking high-quality aromatic feeds like Fluid Catalytic Cracker decant oil and is used to produce high-grade graphite electrodes for the steel industry 29 . These three cokes differ greatly in their microscopic and macroscopic structures. Anode coke has a sponge or honeycomb-like morphology, and the least crystalline fuel coke is made of agglomerates of spherical \"shots\". All of these cokes have no long order in their structure. Needle coke, on the other hand, is highly crystalline and has long needlelike structures. The high aromaticity and the ordered structure make needle coke the most promising candidate to act as a graphene precursor. The long-range order and aromaticity of needle coke can be further enhanced by heat treatment 29 . Needle coke can also be graphitized by heating in an inert atmosphere at >2500 °C.",
                        "For this experimental work, dichloromethane and ammonium sulfate were purchased from Sigma-Aldrich. Ethanol was purchased from Fisher Chemical. Three different petroleum cokes (pet-cokes) were used as parent materials for the ECE process:",
                        "(i) Needle coke fines (CK-1), (ii) Needle coke large particles (CK-2), (iii) Needle coke medium size particles (CK-3)",
                        "The coke samples are modified as they go through the ECE process. To designate the material and stage of the process, a naming system is used as follows:",
                        "(a) Material that has been washed and pre-treated, (b) Material that has been separated (before reaction), (c) Material that has been electrochemically exfoliated (EEG), (d) Material (EEG) that has been centrifuged (after reaction) and separated from the other reaction products. For example, needle coke (CK-2) that is between the separation and reaction steps is designated CK-2b."
                    ],
                    "subsections": []
                },
                {
                    "title": "Experimental procedure",
                    "paragraphs": [
                        "Wash and pre-treatment process: the parent material was washed with dichloromethane and then deionized (DI) water via vacuum filtration to remove any impurities. The washed material was then pre-treated with 6 M nitric acid by mixing it with the material, using 1 mL of acid per gram of material. The mixture was kept in a stainless-steel autoclave container and placed inside an oven at 120 °C for 4 h. The pre-treated material was washed with DI water to neutralize the acid then dried overnight at 100 °C on a hotplate. The three washed and pre-treated cokes are designated as CK-1a, CK-2a, and CK-3a.",
                        "Pre-reaction separation process: the particles in each parent material varied greatly in size. Small particles, less fit for the reaction, were removed by centrifuging. The pre-treated material was mixed with water in a ratio of 5 mg/mL and centrifuged for 10 min at 4000 rpm. The supernatant containing the unwanted smaller particles was discarded, and the sediment was collected. The separated parent cokes are designated as CK-1b, CK-2b, and CK-3b. These CK-b materials were used as the starting material for the ECE process.",
                        "ECE setup and reaction process: the pre-treated and separated material was compacted in a dialysis bag (length ~16 cm and width ~2.5 cm) that was clipped on both ends. A platinum wire was inserted into the material as the working electrode and copper mesh was wrapped around the dialysis bag as the counter electrode. A known weight (~0.75 kg) was placed on top of the dialysis bag and copper mesh, and the apparatus was submerged in 2 L of 0.1 M ammonium sulfate ((NH4) 2 SO 4 ) solution. A potential of 12 V was applied across the platinum electrode and copper mesh to power the ECE process, and the reaction was run for 2 h. After reacting, the product was washed in DI water to remove the electrolyte. The ECE product contained unreacted materials, smaller non-graphitic material, and the EEG product. The unseparated reaction products are designated as CK-1c, CK-2c, and CK-3c.",
                        "Post-reaction centrifuging process: the post-reaction separation of the final product was carried out in a two-step centrifugation method. First, the The electrical conductivity values are also compared with reported graphite powder for Li-ion battery anode 34 .",
                        "unseparated material was centrifuged for 10 min at low speed (2000 rpm).",
                        "In this step, larger particles were sedimented and discarded, and the supernatant was collected. Second, the supernatant was centrifuged again for 20 min at high speed (5000 rpm). In this step, unreacted, nongraphitic smaller particles were removed in the supernatant. The sediment of the second step was collected as the final product; these separated coke-EEGs are designated as CK-1d, CK-2d, and CK-3d. Yield calculation process: the yield of the coke-derived graphene (CK-1d) was measured from UV-vis absorbance spectroscopy using an extinction coefficient of 1293 L/g/m 33 . The absorbance measurement at 666 nm was used to calculate the concentration of EEG in the product dispersion. An example spectrum is provided in Supplementary Fig. 20.",
                        "Annealing process: the annealing of CK-d powder was done in a tube furnace (Thermo Scientific Lindberg/Blue M) under an argon atmosphere. During annealing, the sample was heated at the rate of 10 °C/min. CK-1d was annealed at 500 °C for 12 h and 24 h and at 900 °C and 1100 °C for 12 h. The annealed samples were designated as CK-1d A1, CK-1d A2, CK-1d A3, and CK-1d A4, respectively. After cooling, the powder sample was collected and dispersed in water by bath sonication. Buckypaper of the annealed sample was prepared through a vacuum filtration process."
                    ],
                    "subsections": []
                },
                {
                    "title": "Characterization techniques",
                    "paragraphs": [
                        "Imaging of the parent coke materials was done on cold emission SEM Hitachi S-4300 at an accelerating voltage of 15 keV using a secondary electron detector. Pieces of coke were directly deposited on the SEM sample holder with adhesive carbon film. The coke was conductive enough that no beam charging was observed.",
                        "Raman spectra were measured using Horiba Jobin-Yvon LabRam HR with laser wavelength of 633 nm, laser power of 1.91 mW, exposure time of 10 s, and three accumulations. The \"Auto\" baseline correction method in LabSpec was used for baseline removal.",
                        "TGA and derivative thermogravimetric (DTG) traces were recorded using a TA instrument. For recording the TG/DTG traces, a heating rate of 10 °C/ min and a sample size of 3 ± 1 mg were used under an N 2 atmosphere (flow rate 60 mL/min).",
                        "Transmission electron microscopy was performed on a JEOL F200 cold emission transmission electron microscope. Coke was ground for imaging and suspended in alcohol. Exfoliated material was also suspended in alcohol. The suspensions were sonicated and a droplet of the solution was deposited on a TEM grid with lacey carbon support film. Imaging was done at room temperature using 200 keV acceleration voltage. TEM images and diffraction patterns were recorded with in situ One View camera (Gatan, Inc.). Both coke and exfoliated material appeared stable under irradiation even at high doses required for high-resolution imaging.",
                        "Energy loss spectroscopy was performed with a JEOL F200 cold emission transmission electron microscope operated in scanning transmission electron microscopy mode. An annular dark field detector was used to search the sample and identify the appropriate spot for data collection. The spectrum image was recorded from a uniformly flat part of the particle. Data collection was done with a combination of a Digiscan device (Gatan Inc), and a Quantum GIF (Gatan Inc) operated in spectroscopy mode. Later, individual spectra from the spectrum image were summed to reduce the noise associated with low dose data collection.",
                        "The surface chemistry of CK-1d was probed using an Omicron X-ray photoelectron spectrometer employing an Mg-sourced X-ray beam to irradiate the sample surface. The emitted photoelectrons from the sample surface were collected by a 180°hemispherical electron energy analyzer. A takeoff angle of 40°between the sample surface and the path to the photoelectron collector was used in all measurements. During all scanning, charge neutralization by a dual-beam charge neutralizer was performed to irradiate the low-energy electrons to eliminate the binding energy shifts in the recorded spectra. The sample was dried under vacuum for 24 h to prevent any outgassing. High-resolution spectra were recorded at pass energy (constant analyzer energy) of 30.0 eV with a step size of 0.05 eV. Component peak fitting and quantification of the spectra were carried out using CasaXPS curve fitting software (version 2.3.16).",
                        "Electrical conductivity was measured on buckypapers produced by vacuum filtration (Fisher Scientific MaximaDry) using a four-point resistivity probe powered by Keithley 2000, 6221, and two 6514."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ACKNOWLEDGEMENTS",
            "paragraphs": [
                "We acknowledge the TAMU Materials Characterization Facility for the use of SEM facilities. We appreciate Julie Oh and Huaixuan Cao of TAMU for help in characterization. Funding was provided by the ExxonMobil Chemical Company."
            ],
            "subsections": []
        },
        {
            "title": "DATA AVAILABILITY",
            "paragraphs": [
                "The data sets generated during and analyzed during the current study are available from the corresponding author upon reasonable request."
            ],
            "subsections": []
        },
        {
            "title": "AUTHOR CONTRIBUTIONS",
            "paragraphs": [
                "Experimental work: S.S., P.L., M.J.M., B.J.C., K.A., S.Y., X.Z. Experimental design and analysis: S.S., P.L., S.Y., S.U., M.J.G., R.A.H. Writing the paper: S.S., P.L., M.J.M., B.J.C., S.Y., S.U., M.J.G., R.A.H."
            ],
            "subsections": []
        },
        {
            "title": "COMPETING INTERESTS",
            "paragraphs": [
                "The findings described in this paper are closely related to intellectual property held by TAMU and ExxonMobil Chemical Company."
            ],
            "subsections": [
                {
                    "title": "ADDITIONAL INFORMATION Supplementary information",
                    "paragraphs": [
                        "The online version contains supplementary material available at https://doi.org/10.1038/s41699-021-00255-8.",
                        "Correspondence and requests for materials should be addressed to M.J.G. or R.A.H.",
                        "Reprints and permission information is available at http://www.nature.com/ reprints Publisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}