{
    "id": "US20200071722",
    "authors": [
        "David R. Liu",
        "David B. Thompson",
        "Jeffrey L. Bessen"
    ],
    "title": "EVOLUTION OF SITE-SPECIFIC RECOMBINASES",
    "date": "2019-07-24 00:00:00",
    "abstract": "Some aspects of the present disclosure provide methods for evolving recombinases to recognize target sequences that differ from the canonical recognition sequences. Some aspects of this disclosure provide evolved recombinases, e.g., recombinases that bind and recombine naturally-occurring target sequences, such as, e.g., target sequences within the human Rosa26 locus. Methods for using such recombinases for genetically engineering nucleic acid molecules in vitro and in vivo are also provided. Some aspects of this disclosure also provide libraries and screening methods for assessing the target site preferences of recombinases, as well as methods for selecting recombinases that bind and recombine a non-canonical target sequence with high specificity.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FEDERALLY SPONSORED RESEARCH",
                    "paragraphs": [
                        "This invention was made with government support under grant numbers HR0011-11-2-0003 and N66001-12-C-4207 awaded by the Department of Defense. The government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "disclose government funding"
                    ],
                    "num_characters": 194,
                    "outline_medium": [
                        "disclose government funding"
                    ],
                    "outline_short": [
                        "disclose government funding"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Targeted genetic engineering of cells and organisms holds great promise for research and therapy. While some tools for site-specific modifications of genomic sequences have been developed, such as, for example, site-specific nucleases or nickases that can introduce double-stranded or single-stranded cuts in a genomic target sequence, the targeted integration, deletion, or inversion of sequences within a genome relies on relatively ineffective technologies, such as homologous recombination and gene targeting. Methods and molecular tools for direct manipulation of a target sequence within a genome are therefore highly desirable."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce genetic engineering and limitations of current methods"
                    ],
                    "num_characters": 634,
                    "outline_medium": [
                        "introduce genetic engineering and limitations of current methods"
                    ],
                    "outline_short": [
                        "introduce genetic engineering and limitations of current methods"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The ability to precisely modify the genome of human cells has enormous potential as a novel therapy and a powerful research tool. Programmable nucleases, such as zinc finger nucleases (ZFNs), transcriptional activator-like effector nucleases (TALENs) or Cas9, can specifically cleave DNA at a target sequence, but they rely on stochastic host cells processes to effect gene insertion or other genome modifications. In contrast, site specific recombinases directly catalyze genomic recombination at a target sequence with high specificity and efficiency. Recombinases can be used, for example, to effect insertions, deletions, and inversions of nucleic acid sequences at a specific target sequence. In some embodiments, recombinases can also be used to exchange nucleic acid sequences, e.g., in the context of replacing a sequence associated with a disease or disorder with a sequence not associated with a disease or disorder.",
                        "A major limitation of using recombinases for effecting targeted genomic modifications is that recombinases, such as serine or tyrosine recombinases (e.g., Cre recombinase; λ phage integrase; FLP recombinase; phiC31 integrase; Dre recombinase; BxB 1; Hin; and prokaryotic β-recombinase), typically bind relatively complex DNA target sequences (e.g., LoxP sites in the case of Cre recombinase or FRT sites in the case of FLP recombinases) with high specificity. Target cells lacking the required recombinase target sequence within their genome can thus not be efficiently modified. For example, mouse and human cells typically lack recombinase target sequences within their genome and can thus not be easily modified using recombinases. While it is possible to introduce a native recombinase target sequence (e.g., a wild-type LoxP or FRT site) into a desired genetic locus within a cell's genome, and thus render the cell suitable for modification with a native recombinase, the introduction of such recombinase target sequences typically requires time- and labor-intensive gene targeting strategies.",
                        "Some aspects of this disclosure are based on the surprising discovery that recombinases can be evolved to recognize non-native DNA target sequences via directed evolution methods, e.g., by the phage-assisted continuous evolution (PACE) strategies and methods disclosed herein. For an overview of PACE technology, see, for example, International PCT Application, PCT/US2009/056194, filed Sep. 8, 2009, published as WO 2010/028347 on Mar. 11, 2010; International PCT Application, PCT/US2011/066747, filed Dec. 22, 2011, published as WO 2012/088381 on Jun. 28, 2012; and U.S. Application, U.S. Ser. No. 13/922,812, filed Jun. 20, 2013, the entire contents of each of which are incorporated herein by reference. Using the evolution strategies and methods provided herein, recombinases can be adapted to target virtually any desired sequence, e.g., any locus within the genome of a cell. This allows, for example, for the introduction of recombinant sequences into the genome of a desired target cell without the need for inserting a recombinase target sequence first. In addition, the evolved recombinases can also be used to remove, invert, or replace nucleic acid sequences from a target sequence, e.g., from a genomic sequence in a cell or subject.",
                        "Some aspects of this disclosure provide methods for evolving recombinases. In some embodiments, the methods comprise (a) contacting a population of host cells with a population of phage vectors comprising a gene encoding a recombinase and deficient in at least one gene for the generation of infectious phage particles, wherein (1) the host cells are amenable to transfer of the phage vector; (2) the vector allows for expression of the recombinase in a host cell, can be replicated by the host cell, and the replicated vector can transfer from host cell to host cell; (3) the host cells express a gene product encoded by the at least one gene for the generation of infectious phage particles of (a) in response to the recombination of a recombinase target sequence by the recombinase, and the level of gene product expression depends on the activity of the recombinase towards the target sequence; (b) incubating the population of host cells under conditions allowing for mutation of the gene encoding the recombinase and the transfer of the phage vectors from host cell to host cell, wherein host cells are removed from the host cell population, and the population of host cells is replenished with fresh host cells that do not harbor the phage vector; and (c) isolating a replicated phage vector from the host cell population in (b), wherein the replicated vector comprises a mutated version of the gene encoding the recombinase.",
                        "Some aspects of this disclosure provide evolved recombinases comprising an amino acid sequence that is at least 70%, at least 80%, at least 90%, at least 95%, or at least 97% identical to the sequence of a wild-type recombinase, wherein the amino acid sequence of the evolved recombinase comprises at least one mutation as compared to the sequence of the wild-type recombinase, and wherein the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by at least one nucleotide. In some embodiments, In some embodiments, the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, at least 15, at least 16, at least 17, at least 18, at least 19, at least 20 at least 25, or at least 30 nucleotides. In some embodiments, the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, or 30 nucleotides.",
                        "Some aspects of this disclosure provide methods for engineering a nucleic acid molecule, the method comprising contacting a first nucleic acid molecule comprising a first recombinase target sequence of the structure 5′-[left half-site]-[spacer]-[right half-site]-3′with a recombinase and a second nucleic acid molecule comprising a second recombinase target sequence under conditions suitable for the recombinase to bind and recombine the recombinase target sequences, wherein the first and the second recombinase target sequences differ from the canonical Cre recombinase target sequence 5′-ATAACTTCGTATA GCATACAT TATACGAAGTTAT-3′ (LoxP, SEQ ID NO: 2) in at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotides.",
                        "Some aspects of this disclosure provide methods for identifying a target site of a recombinase. In some embodiments, the comprises (a) providing a recombinase that binds and recombines a double-stranded nucleic acid target sequence of the structure 5′-[left half-site]-[spacer]-[right half-site]-3; (b) contacting the recombinase of (a) with a library of candidate nucleic acid molecules, wherein each candidate nucleic acid molecule comprises a nucleic acid strand comprising the structure 5′-[spacer]-[half-site]-[loop sequence]-[half-site]-[spacer]-3′, wherein the spacer and half-site sequences on the 5′ and 3′ end are complementary and hybridize to each other, thus forming a single-stranded loop structure and a double-stranded [half-site]-[spacer] structure, and wherein each candidate nucleic acid molecule comprises a PCR primer binding site within the loop sequence, under conditions suitable for the recombinase to bind a candidate nucleic acid molecule comprising a [spacer]-[half-site]-structure and recombine it with the [spacer]-[half-site] structure of a different candidate nucleic acid molecule, thus creating a recombined circular nucleic acid molecule comprising a [loop sequence]-[half-site]-[spacer]-[half-site]-[loop sequence] structure; and (c) identifying recombinase target sites bound and recombined by the recombinase in (b) by determining the sequence of the [half-site]-[spacer]-[half-site] structure of the recombined circular nucleic acid molecule in (b).",
                        "Some aspects of this disclosure provide libraries of nucleic acid molecules that are useful for assessing the target sites preferences of recombinases. In some embodiments the library comprises a plurality of nucleic acid molecules, wherein each nucleic acid molecule comprises a 5′-[spacer]-[half-site]-[loop sequence]-[half-site]-[spacer]-3′ structure, wherein the spacer and half-site sequences on the 5′ and 3′ end are complementary and hybridize to each other, thus forming a single-stranded loop structure and a double-stranded [half-site]-[spacer] structure, and wherein each candidate nucleic acid molecule comprises a PCR primer binding site within the loop sequence.",
                        "The summary above is meant to illustrate, in a non-limiting manner, some of the embodiments, advantages, features, and uses of the technology disclosed herein. Other embodiments, advantages, features, and uses of the technology disclosed herein will be apparent from the Detailed Description, Drawings, Examples, and Claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce genome modification and its potential",
                        "describe programmable nucleases and their limitations",
                        "introduce site-specific recombinases and their advantages",
                        "describe current limitations of recombinases",
                        "introduce evolution of recombinases to recognize non-native target sequences",
                        "describe PACE technology for evolving recombinases",
                        "introduce methods for evolving recombinases",
                        "describe evolved recombinases and their characteristics",
                        "introduce methods for engineering nucleic acid molecules",
                        "describe methods for identifying target sites of recombinases",
                        "introduce libraries of nucleic acid molecules for assessing target site preferences",
                        "describe evolved recombinases recognizing non-native target sequences",
                        "describe uses of evolved recombinases",
                        "introduce advantages of evolved recombinases",
                        "describe limitations of current recombinases",
                        "introduce need for evolved recombinases",
                        "describe potential applications of evolved recombinases",
                        "conclude summary"
                    ],
                    "num_characters": 9342,
                    "outline_medium": [
                        "motivate targeted genetic engineering",
                        "introduce programmable nucleases",
                        "introduce site-specific recombinases",
                        "describe limitations of recombinases",
                        "disclose evolution of recombinases",
                        "describe evolved recombinases",
                        "outline methods for evolving recombinases",
                        "outline methods for engineering nucleic acid molecules",
                        "outline methods for identifying target sites"
                    ],
                    "outline_short": [
                        "motivate targeted genome modification",
                        "introduce site-specific recombinases",
                        "describe limitations of recombinases",
                        "summarize evolved recombinases and their applications"
                    ]
                },
                {
                    "title": "DEFINITIONS",
                    "paragraphs": [
                        "The term “accessory plasmid,” as used herein, refers to a plasmid comprising a gene required for the generation of infectious viral particles under the control of a conditional promoter. In the context of continuous evolution of recombinases described herein, transcription from the conditional promoter of the accessory plasmid is typically activated by a function of the recombinase to be evolved. Accordingly, the accessory plasmid serves the function of conveying a competitive advantage to those viral vectors in a given population of viral vectors that carry a gene of interest able to activate the conditional promoter. Only viral vectors carrying an “activating” version of the recombinase of interest will be able to induce expression of the gene required to generate infectious viral particles in the host cell, and, thus, allow for packaging of infectious viral particles and propagation of the viral genome in the flow of host cells. Vectors carrying non-activating versions of the recombinase of interest, on the other hand, will not induce expression of the gene required to generate infectious viral vectors, and, thus, will not be packaged into viral particles that can infect fresh host cells.",
                        "The term “cellstat,” as used herein, refers to a culture vessel comprising host cells, in which the number of cells is substantially constant over time.",
                        "The term “continuous evolution,” as used herein, refers to an evolution process, in which a population of nucleic acids encoding a recombinase of interest is subjected to multiple rounds of (a) replication, (b) mutation, and (c) selection to produce a desired evolved recombinase that is different from the original recombinase of interest, for example, in that it binds and recombines a target site not recognized by the original recombinase, or in that it binds and recombines a target site with higher affinity or efficiency than the original recombinase. The multiple rounds can be performed without investigator intervention, and the steps (a)-(c) can be carried out simultaneously. Typically, the evolution procedure is carried out in vitro, for example, using cells in culture as host cells. In general, a continuous evolution process provided herein relies on a system in which a gene encoding a recombinase of interest is provided in a viral vector that undergoes a life-cycle including replication in a host cell and transfer to another host cell, wherein a critical component of the life-cycle, e.g., a gene essential for the generation of infectious viral particles, is deactivated and reactivation of the component is dependent upon an activity of the recombinase of interest that is a result of a mutation in the viral vector.",
                        "The term “flow”, as used herein in the context of host cells, refers to a stream of host cells, wherein fresh host cells not harboring the transfer vector (e.g., the viral vector encoding the recombinase of interest) are being introduced into a host cell population, for example, a host cell population in a lagoon, remain within the population for a limited time, and are then removed from the host cell population. In a simple form, a host cell flow may be a flow through a tube, or a channel, for example, at a controlled rate. In other embodiments, a flow of host cells is directed through a lagoon that holds a volume of cell culture media and comprises an inflow and an outflow. The introduction of fresh host cells may be continuous or intermittent and removal may be passive, e.g., by overflow, or active, e.g., by active siphoning or pumping. Removal further may be random, for example, if a stirred suspension culture of host cells is provided, removed liquid culture media will contain freshly introduced host cells as well as cells that have been a member of the host cell population within the lagoon for some time. Even though, in theory, a cell could escape removal from the lagoon indefinitely, the average host cell will remain only for a limited period of time within the lagoon, which is determined mainly by the flow rate of the culture media (and suspended cells) through the lagoon. Since the viral vectors replicate in a flow of host cells, in which fresh, uninfected host cells are provided while infected cells are removed, multiple consecutive viral life cycles can occur without investigator interaction, which allows for the accumulation of multiple advantageous mutations in a single evolution experiment.",
                        "The term “fresh,” as used herein in the context of host cells, and used interchangeably with the terms “non-infected” or “uninfected” in the context of host cells of viral vectors, refers to a host cell that does not harbor the vector or, in the context of viral vectors, has not been infected by the viral vector comprising a gene encoding a recombinase of interest as used in a continuous evolution process provided herein. A fresh host cell can, however, have been infected by a viral vector unrelated to the vector to be evolved or by a vector of the same or a similar type but not carrying the gene of interest.",
                        "The term “gene of interest” or “gene encoding a recombinase of interest,” as used herein, refers to a nucleic acid construct comprising a nucleotide sequence encoding a gene product, e.g., a recombinase, of interest to be evolved in a continuous evolution process as provided herein. The term includes any variations of a gene of interest that are the result of a continuous evolution process according to methods provided herein. For example, in some embodiments, a gene of interest is a nucleic acid construct comprising a nucleotide sequence encoding a recombinase to be evolved, cloned into a viral vector, for example, a phage genome, so that the expression of the encoding sequence is under the control of one or more promoters in the viral genome. In other embodiments, a gene of interest is a nucleic acid construct comprising a nucleotide sequence encoding a recombinase to be evolved and a promoter operably linked to the encoding sequence. When cloned into a viral vector, for example, a phage genome, the expression of the encoding sequence of such genes of interest is under the control of the heterologous promoter and, in some embodiments, may also be influenced by one or more promoters comprised in the viral genome.",
                        "The term “helper phage,” as used herein interchangeable with the terms “helper phagemid” and “helper plasmid,” refers to a nucleic acid construct comprising a phage gene required for the phage life cycle, or a plurality of such genes, but lacking a structural element required for genome packaging into a phage particle. For example, a helper phage may provide a wild-type phage genome lacking a phage origin of replication. In some embodiments, a helper phage is provided that comprises a gene required for the generation of phage particles, but lacks a gene required for the generation of infectious particles, for example, a full-length pIII gene. In some embodiments, the helper phage provides only some, but not all, genes for the generation of infectious phage particles. Helper phages are useful to allow modified phages that lack a gene for the generation of infectious phage particles to complete the phage life cycle in a host cell. Typically, a helper phage will comprise the genes for the generation of infectious phage particles that are lacking in the phage genome, thus complementing the phage genome. In the continuous evolution context, the helper phage typically complements the selection phage, but both lack a phage gene required for the production of infectious phage particles.",
                        "The terms “high copy number plasmid” and “low copy number plasmid” are art-recognized, and those of skill in the art will be able to ascertain whether a given plasmid is a high or low copy number plasmid. In some embodiments, a low copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 5 to about 100. In some embodiments, a very low copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 1 to about 10. In some embodiments, a very low copy number accessory plasmid is a single-copy per cell plasmid. In some embodiments, a high copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 100 to about 5000.",
                        "The term “host cell,” as used herein, refers to a cell that can host, replicate, and transfer a phage vector useful for a continuous evolution process as provided herein. In embodiments where the vector is a viral vector, a suitable host cell is a cell that can be infected by the viral vector, can replicate it, and can package it into viral particles that can infect fresh host cells. A cell can host a viral vector if it supports expression of genes of viral vector, replication of the viral genome, and/or the generation of viral particles. One criterion to determine whether a cell is a suitable host cell for a given viral vector is to determine whether the cell can support the viral life cycle of a wild-type viral genome that the viral vector is derived from. For example, if the viral vector is a modified M13 phage genome, as provided in some embodiments described herein, then a suitable host cell would be any cell that can support the wild-type M13 phage life cycle. Suitable host cells for viral vectors useful in continuous evolution processes are well known to those of skill in the art, and the disclosure is not limited in this respect.",
                        "The term “infectious viral particle,” as used herein, refers to a viral particle able to transport the viral genome it comprises into a suitable host cell. Not all viral particles are able to transfer the viral genome to a suitable host cell. Particles unable to accomplish this are referred to as non-infectious viral particles. In some embodiments, a viral particle comprises a plurality of different coat proteins, wherein one or some of the coat proteins can be omitted without compromising the structure of the viral particle. In some embodiments, a viral particle is provided in which at least one coat protein cannot be omitted without the loss of infectivity. If a viral particle lacks a protein that confers infectivity, the viral particle is not infectious. For example, an M13 phage particle that comprises a phage genome packaged in a coat of phage proteins (e.g., pVIII) but lacks pIII (protein III) is a non-infectious M13 phage particle because pIII is essential for the infectious properties of M13 phage particles.",
                        "The term “lagoon,” as used herein, refers to a culture vessel or bioreactor through which a flow of host cells is directed. When used for a continuous evolution process as provided herein, a lagoon typically holds a population of host cells and a population of viral vectors replicating within the host cell population, wherein the lagoon comprises an outflow through which host cells are removed from the lagoon and an inflow through which fresh host cells are introduced into the lagoon, thus replenishing the host cell population.",
                        "The term “mutagen,” as used herein, refers to an agent that induces mutations or increases the rate of mutation in a given biological system, for example, a host cell, to a level above the naturally occurring level of mutation in that system. Some exemplary mutagens useful for continuous evolution procedures are provided elsewhere herein, and other useful mutagens will be evident to those of skill in the art. Useful mutagens include, but are not limited to, ionizing radiation, ultraviolet radiation, base analogs, deaminating agents (e.g., nitrous acid), intercalating agents (e.g., ethidium bromide), alkylating agents (e.g., ethylnitrosourea), transposons, bromine, azide salts, psoralen, benzene,3-Chloro-4-(dichloromethyl)-5-hydroxy-2(5H)-furanone (MX) (CAS no. 77439-76-0), O,O-dimethyl-S-(phthalimidomethyl)phosphorodithioate (phos-met) (CAS no. 732-11-6), formaldehyde (CAS no. 50-00-0), 2-(2-furyl)-3-(5-nitro-2-furyl)acrylamide (AF-2) (CAS no. 3688-53-7), glyoxal (CAS no. 107-22-2), 6-mercaptopurine (CAS no. 50-44-2), N-(trichloromethylthio)-4-cyclohexane-1,2-dicarboximide (captan) (CAS no. 133-06-2), 2-aminopurine (CAS no. 452-06-2), methyl methane sulfonate (MMS) (CAS No. 66-27-3), 4-nitroquinoline 1-oxide (4-NQO) (CAS No. 56-57-5), N4-Aminocytidine (CAS no. 57294-74-3), sodium azide (CAS no. 26628-22-8), N-ethyl-N-nitrosourea (ENU) (CAS no. 759-73-9), N-methyl-N-nitrosourea (MNU) (CAS no. 820-60-0), 5-azacytidine (CAS no. 320-67-2), cumene hydroperoxide (CHP) (CAS no. 80-15-9), ethyl methanesulfonate (EMS) (CAS no. 62-50-0), N-ethyl-N -nitro-N-nitrosoguanidine (ENNG) (CAS no. 4245-77-6), N-methyl-N-nitro-N-nitrosoguanidine (MNNG) (CAS no. 70-25-7), 5-diazouracil (CAS no. 2435-76-9), and t-butyl hydroperoxide (BHP) (CAS no. 75-91-2). Additional mutagens can be used in continuous evolution procedures as provided herein, and the invention is not limited in this respect.",
                        "The term “mutagenesis plasmid,” as used herein, refers to a plasmid comprising a nucleic acid sequence encoding a gene product or a combination of gene products that act(s) as a mutagen. In some embodiments, a mutagenesis plasmid may encode a DNA polymerase lacking a proofreading capability. In some embodiments, the mutagenesis plasmid may encode a gene product involved in the bacterial SOS stress response, for example, a component of a bacterial translesion synthesis polymerase V. In some embodiments, the mutagenesis plasmid may encode a deoxyadenosine methylase. In some embodiments, the mutagenesis plasmid may encode a hemimethylated-GATC binding domain. In some non-limiting embodiments, the mutagenesis plasmid encodes UmuC (a component of E. coli translesion synthesis polymerase V), dam (deoxyadenosine methylase), and/or seqA (hemimethylated-GATC binding domain), or any combination thereof.",
                        "The term “nucleic acid,” as used herein, refers to a polymer of nucleotides. The polymer may include natural nucleosides (i.e., adenosine, thymidine, guanosine, cytidine, uridine, deoxyadenosine, deoxythymidine, deoxyguanosine, and deoxycytidine), nucleoside analogs (e.g., 2-aminoadenosine, 2-thiothymidine, inosine, pyrrolo-pyrimidine, 3-methyl adenosine, 5-methylcytidine, C5-bromouridine, C5-fluorouridine, C5-iodouridine, C5-propynyl-uridine, C5-propynyl-cytidine, C5-methylcytidine, 7-deazaadenosine, 7-deazaguanosine, 8-oxoadenosine, 8-oxoguanosine, O(6)-methylguanine, 4-acetylcytidine, 5-(carboxyhydroxymethyl)uridine, dihydrouridine, methylpseudouridine, 1-methyl adenosine, 1-methyl guanosine, N6-methyl adenosine, and 2-thiocytidine), chemically modified bases, biologically modified bases (e.g., methylated bases), intercalated bases, modified sugars (e.g., 2′-fluororibose, ribose, 2′-deoxyribose, 2′-O-methylcytidine, arabinose, and hexose), or modified phosphate groups (e.g., phosphorothioates and 5′-N-phosphoramidite linkages).",
                        "The term “phage,” as used herein interchangeably with the term “bacteriophage,” refers to a virus that infects bacterial cells. Typically, phages consist of an outer protein capsid enclosing genetic material. The genetic material can be ssRNA, dsRNA, ssDNA, or dsDNA, in either linear or circular form. Phages and phage vectors are well known to those of skill in the art and non-limiting examples of phages that are useful for carrying out the methods provided herein are λ (Lysogen), T2, T4, T7, T12, R17, M13, MS2, G4, P1, P2, P4, Phi X174, N4, Φ6, and Φ29. In certain embodiments, the phage utilized in the present invention is M13. Additional suitable phages and host cells will be apparent to those of skill in the art and the invention is not limited in this aspect. For an exemplary description of additional suitable phages and host cells, see Elizabeth Kutter and Alexander Sulakvelidze: Bacteriophages: Biology and Applications. CRC Press; 1st edition (December 2004), ISBN: 0849313368; Martha R. J. Clokie and Andrew M. Kropinski: Bacteriophages: Methods and Protocols, Volume 1: Isolation, Characterization, and Interactions (Methods in Molecular Biology) Humana Press; 1st edition (December, 2008), ISBN: 1588296822; Martha R. J. Clokie and Andrew M. Kropinski: Bacteriophages: Methods and Protocols, Volume 2: Molecular and Applied Aspects (Methods in Molecular Biology) Humana Press; 1st edition (December 2008), ISBN: 1603275649; all of which are incorporated herein in their entirety by reference for disclosure of suitable phages and host cells as well as methods and protocols for isolation, culture, and manipulation of such phages).",
                        "The term “phage-assisted continuous evolution (PACE),” as used herein, refers to continuous evolution that employs phage as viral vectors. PACE technology has been described previously, for example, in International PCT Application, PCT/US2009/056194, filed Sep. 8, 2009, published as WO 2010/028347 on Mar. 11, 2010; International PCT Application, PCT/US2011/066747, filed Dec. 22, 2011, published as WO 2012/088381 on Jun. 28, 2012; and U.S. Application, U.S. Ser. No. 13/922,812, filed Jun. 20, 2013, each of which is incorporated herein by reference.",
                        "The term “promoter” is art-recognized and refers to a nucleic acid molecule with a sequence recognized by the cellular transcription machinery and able to initiate transcription of a downstream gene. A promoter can be constitutively active, meaning that the promoter is always active in a given cellular context, or conditionally active, meaning that the promoter is only active in the presence of a specific condition. For example, a conditional promoter may only be active in the presence of a specific protein that connects a protein associated with a regulatory element in the promoter to the basic transcriptional machinery, or only in the absence of an inhibitory molecule. A subclass of conditionally active promoters are inducible promoters that require the presence of a small molecule “inducer” for activity. Examples of inducible promoters include, but are not limited to, arabinose-inducible promoters, Tet-on promoters, and tamoxifen-inducible promoters. A variety of constitutive, conditional, and inducible promoters are well known to the skilled artisan, and the skilled artisan will be able to ascertain a variety of such promoters useful in carrying out the instant invention, which is not limited in this respect.",
                        "The term “protein,” as used herein refers to a polymer of amino acid residues linked together by peptide bonds. The term, as used herein, refers to proteins, polypeptides, and peptide of any size, structure, or function. Typically, a protein will be at least three amino acids long. A protein may refer to an individual protein or a collection of proteins. Inventive proteins preferably contain only natural amino acids, although non-natural amino acids (i.e., compounds that do not occur in nature but that can be incorporated into a polypeptide chain; see, for example, cco.caltech.edu/˜dadgrp/Unnatstruct.gif, which displays structures of non-natural amino acids that have been successfully incorporated into functional ion channels) and/or amino acid analogs as are known in the art may alternatively be employed. Also, one or more of the amino acids in an inventive protein may be modified, for example, by the addition of a chemical entity such as a carbohydrate group, a hydroxyl group, a phosphate group, a farnesyl group, an isofarnesyl group, a fatty acid group, a linker for conjugation, functionalization, or other modification, etc. A protein may also be a single molecule or may be a multi-molecular complex. A protein may be just a fragment of a naturally occurring protein or peptide. A protein may be naturally occurring, recombinant, or synthetic, or any combination of these.",
                        "The term “replication product,” as used herein, refers to a nucleic acid that is the result of viral genome replication by a host cell. This includes any viral genomes synthesized by the host cell from a viral genome inserted into the host cell. The term includes non-mutated as well as mutated replication products.",
                        "The term “selection phage,” as used herein interchangeably with the term “selection plasmid,” refers to a modified phage that comprises a gene of interest to be evolved and lacks a full-length gene encoding a protein required for the generation of infectious phage particles. For example, some M13 selection phages provided herein comprise a nucleic acid sequence encoding a recombinase to be evolved, e.g., under the control of an M13 promoter, and lack all or part of a phage gene encoding a protein required for the generation of infectious phage particles, e.g., gI, gII, gIII, gIV, gV, gVI, gVII, gVIII, gIX, or gX, or any combination thereof. For example, some M13 selection phages provided herein comprise a nucleic acid sequence encoding a recombinase to be evolved, e.g., under the control of an M13 promoter, and lack all or part of a gene encoding a protein required for the generation of infective phage particles, e.g., the gIII gene encoding the pIII protein.",
                        "The terms “small molecule” and “organic compound” are used interchangeably herein and refer to molecules, whether naturally-occurring or artificially created (e.g., via chemical synthesis) that have a relatively low molecular weight. Typically, an organic compound contains carbon. An organic compound may contain multiple carbon-carbon bonds, stereocenters, and other functional groups (e.g., amines, hydroxyl, carbonyls, or heterocyclic rings). In some embodiments, organic compounds are monomeric and have a molecular weight of less than about 1500 g/mol. In certain embodiments, the molecular weight of the small molecule is less than about 1000 g/mol or less than about 500 g/mol. In certain embodiments, the small molecule is a therapeutic drug or drug candidate, for example, a drug or drug candidate that is in clinical or pre-clinical trials or that has already been deemed safe and effective for use in humans or animals by the appropriate governmental agency or regulatory body.",
                        "The term “turbidostat,” as used herein, refers to a culture vessel comprising host cells in suspension culture, in which the turbidity of the culture medium is substantially essentially constant over time. In some embodiments, the turbidity of a suspension culture, for example, of bacterial cells, is a measure for the cell density in the culture medium. In some embodiments, a turbidostat comprises an inflow of fresh media and an outflow, and a controller that regulates the flow into and/or out of the turbidostat based on the turbidity of the suspension culture in the turbidostat.",
                        "The term “vector,” as used herein, refers to a nucleic acid that can be modified to encode a recombinase of interest and that is able to enter into a host cell, mutate and replicate within the host cell, and then transfer a replicated form of the vector into another host cell. Exemplary suitable vectors include viral vectors, such as retroviral vectors or bacteriophages, and conjugative plasmids. Additional suitable vectors will be apparent to those of skill in the art based on the instant disclosure.",
                        "The term “viral life cycle,” as used herein, refers to the viral reproduction cycle comprising insertion of the viral genome into a host cell, replication of the viral genome in the host cell, and packaging of a replication product of the viral genome into a viral particle by the host cell.",
                        "The term “viral particle,” as used herein, refers to a viral genome, for example, a DNA or RNA genome, that is associated with a coat of a viral protein or proteins, and, in some cases, with an envelope of lipids. For example, a phage particle comprises a phage genome packaged into a protein encoded by the wild type phage genome.",
                        "The term “viral vector,” as used herein, refers to a nucleic acid comprising a viral genome that, when introduced into a suitable host cell, can be replicated and packaged into viral particles able to transfer the viral genome into another host cell. The term viral vector extends to vectors comprising truncated or partial viral genomes. For example, in some embodiments, a viral vector is provided that lacks a gene encoding a protein essential for the generation of infectious viral particles. In suitable host cells, for example, host cells comprising the lacking gene under the control of a conditional promoter, however, such truncated viral vectors can replicate and generate viral particles able to transfer the truncated viral genome into another host cell. In some embodiments, the viral vector is a phage, for example, a filamentous phage (e.g., an M13 phage). In some embodiments, a viral vector, for example, a phage vector, is provided that comprises a gene encoding the recombinase of interest to be evolved."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define accessory plasmid",
                        "describe function of accessory plasmid",
                        "define cellstat",
                        "describe continuous evolution process",
                        "outline steps of continuous evolution process",
                        "define flow of host cells",
                        "describe characteristics of flow",
                        "define fresh host cells",
                        "describe gene of interest",
                        "provide examples of genes of interest",
                        "define helper phage",
                        "describe function of helper phage",
                        "define high and low copy number plasmids",
                        "provide examples of high and low copy number plasmids",
                        "define host cell",
                        "describe characteristics of host cells",
                        "define infectious viral particle",
                        "describe characteristics of infectious viral particles",
                        "define lagoon",
                        "describe function of lagoon",
                        "define mutagen",
                        "provide examples of mutagens",
                        "describe function of mutagens",
                        "define mutagenesis plasmid",
                        "describe function of mutagenesis plasmid",
                        "provide examples of mutagenesis plasmids",
                        "summarize definitions",
                        "define nucleic acid",
                        "define phage",
                        "describe phage vectors",
                        "define phage-assisted continuous evolution (PACE)",
                        "describe PACE technology",
                        "define promoter",
                        "describe types of promoters",
                        "define protein",
                        "describe protein structure and function",
                        "define replication product",
                        "define selection phage",
                        "describe selection phage components",
                        "define small molecule",
                        "describe small molecule characteristics",
                        "define turbidostat",
                        "describe turbidostat operation",
                        "define vector",
                        "describe vector function",
                        "define viral life cycle",
                        "describe viral life cycle stages",
                        "define viral particle"
                    ],
                    "num_characters": 24905,
                    "outline_medium": [
                        "define accessory plasmid",
                        "define cellstat",
                        "define continuous evolution",
                        "define flow",
                        "define fresh",
                        "define gene of interest",
                        "define helper phage",
                        "define high/low copy number plasmid",
                        "define host cell",
                        "define infectious viral particle",
                        "define lagoon",
                        "define mutagen",
                        "define mutagenesis plasmid",
                        "define nucleic acid",
                        "define phage",
                        "define phage-assisted continuous evolution",
                        "define promoter",
                        "define protein",
                        "define replication product",
                        "define selection phage",
                        "define small molecule",
                        "define turbidostat",
                        "define vector"
                    ],
                    "outline_short": [
                        "define accessory plasmid",
                        "define cellstat",
                        "define continuous evolution",
                        "define flow",
                        "define fresh host cells",
                        "define other terms",
                        "define nucleic acid",
                        "define phage",
                        "define phage-assisted continuous evolution",
                        "define various biological terms",
                        "define turbidostat and viral-related terms"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Some aspects of this disclosure provide selection strategies that can be used in PACE experiments to evolve recombinases with regard to recombinase towards a non-canonical recombinase target sequence. This technology can be used, for example, to evolve recombinases that can bind and recombine non-canonical sequences that are naturally occurring, such as, for example, sequences within a “safe harbor” genomic locus in a mammalian genome, e.g., a genomic locus that is known to be tolerant to genetic modification without any undesired effects. Recombinases targeting such sequences allow, e.g., for the targeted insertion of nucleic acid constructs at a specific genomic location without the need for conventional time- and labor-intensive gene targeting procedures, e.g., via homologous recombination technology. In addition, the directed evolution strategies provided herein can be used to evolve recombinases with an altered activity profile, e.g., recombinases that favor integration of a nucleic acid sequence over excision of that sequence or vice versa.",
                        "Some aspects of this disclosure provide methods and reagents for assessing the specificity of recombinases, for example, of naturally occurring or evolved recombinases. Libraries of nucleic acid molecules comprising candidate recombinase target half-sites are provided as well as methods of using such libraries for target sequences that are bound and recombined by a recombinase.",
                        "The directed evolution strategies provided herein can be applied to any recombinase. Recombinases are well known to those of skill in the art, and suitable recombinases that can be evolved by the methods and strategies provided herein will be apparent to the skilled artisan based on the present disclosure and the knowledge of recombinases in the art. Suitable recombinases include, for example, and without limitation, tyrosine recombinases and serine recombinases. Some exemplary suitable recombinases that can be evolved by the methods and strategies provided herein include, for example, and without limitation, Cre recombinase from bacteriophage P1 (acting on LoxP sites); λ phage integrase (acting on att sites); FLP recombinases of fungal origin (acting on FTR sites); phiC31 integrase; Dre recombinase, BxB 1; and prokaryotic β-recombinase. Additional suitable recombinases will be apparent to those of skill in the art, and such suitable recombinases include, without limitation, those disclosed in Hirano et al., Site-specific recombinases as tools for heterologous gene integration. Appl Microbiol Biotechnol. 2011 October; 92(2):227-39; Fogg et al., New applications for phage integrases. J Mol Biol. 2014 Jul. 29; 426(15):2703; Brown et al., Serine recombinases as tools for genome engineering. Methods. 2011 April; 53(4):372-9; Smith et al., Site-specific recombination by phiC31 integrase and other large serine recombinases. Biochem Soc Trans. 2010 April; 38(2):388-94; Grindley et al., Mechanisms of site-specific recombination. Annu Rev Biochem. 2006;75:567-605; Smith et al., Diversity in the serine recombinases. Mol Microbiol. 2002 April; 44(2):299-307; Grainge et al., The integrase family of recombinase: organization and function of the active site. Mol Microbiol. 1999 August; 33(3):449-56; Gopaul et al., Structure and mechanism in site-specific recombination. Curr Opin Struct Biol. 1999 February; 9(1):14-20; Cox et al., Conditional gene expression in the mouse inner ear using Cre-loxP. J Assoc Res Otolaryngol. 2012 June; 13(3):295-322; Birling et al., Site-specific recombinases for manipulation of the mouse genome. Methods Mol Biol. 2009;561:245-63; and Mishina M, Sakimura K. Conditional gene targeting on the pure C57BL/6 genetic background. Neurosci Res. 2007 June; 58(2):105-12; the entire contents of each of which are incorporated herein by reference.",
                        "The evolved recombinases provided herein that exhibit altered target sequence preferences as compared to their wild type counterparts, can be used to target virtually any target sequence for recombinase activity. Accordingly, the presently described evolution methods and strategies and the evolved recombinases obtained via these strategies and methods can be used to modify, for example, any sequence within the genome of a cell or subject. Because recombinases can effect an insertion of a heterologous nucleic acid molecule into a target nucleic acid molecule, an excision of a nucleic acid sequence from a nucleic acid molecule, an inversion, or a replacement of nucleic acid sequences, the technology provided herein enables the efficient modification of genomic targets in a variety of ways (e.g., integration, deletion, inversion, exchange of nucleic acid sequences).",
                        "One application of the recombinase technology provided herein is the integration of a heterologous nucleic acid sequence into a safe harbor locus in the genome of a cell. A safe harbor locus is typically a genomic locus where transgenes can integrate and function in a predictable manner without perturbing endogenous gene activity. Some exemplary safe harbor loci in the human genome include, without limitation the Rosa26 locus, the AAVS1 locus, and the safe harbor loci listed in Sadelain et al., Safe harbours for the integration of new DNA in the human genome. Nat Rev Cancer. 2011 Dec. 1; 12(1):51-8, the entire contents of which are incorporated herein by reference. Safe harbor loci in other species are also well known, including in mammals (mouse, rat, hamster, other non-human primates) and in plants, such as cash crops that are currently made transgenic by other means.",
                        "Another application of the recombinase technology provided herein is the recombinase-mediated excision or deletion of a sequence from the genome of a cell or a subject that are associated with a disease or disorder, or the exchange of one nucleotide sequence for another.",
                        "Additional applications and uses of the recombinase technology provided herein will be apparent to the skilled artisan based on the present disclosure."
                    ],
                    "subsections": [
                        {
                            "title": "Phage-Assisted Continuous Evolution",
                            "paragraphs": [
                                "Phage-assisted continuous evolution (PACE), allows proteins and other gene products to undergo directed evolution at a rate ˜100-fold faster than conventional methods. FIG. 1 provides a schematic overview of an exemplary embodiment of PACE. During PACE, an evolving population of filamentous bacteriophages (“selection phage”, SP) is continuously diluted in a flow of host cells through a fixed-volume vessel (a “lagoon”). The flow rate of host cells through the lagoon results in an average time of hosts cells within the lagoon that is too short for host cell division, but longer than the average phage replication cycle, thus allowing only the phage to propagate and accumulate mutations.",
                                "Typically, each SP carries an evolving gene, for example, a gene encoding a recombinase, and lacks at least one phage gene that is essential for the generation of infectious phage particles, e.g., gene III in M13 phages. The host cells typically provide the phage gene lacking from the SP on an accessory plasmid (AP) that expresses the phage gene lacking from the SP in response to a desired activity of the evolving gene (e.g., a desired recombinase activity). As a result, only SP encoding variants of the evolving gene product having the desired activity are able to generate infectious progeny and propagate to other cells, while SP encoding inactive variants produce non-infectious progeny that cannot infect new host cells and are thus diluted out of the lagoon. PACE has been used to rapidly evolve RNA polymerases and proteases with tailor-made properties. It was tested whether the PACE system could be adapted to evolve DNA-binding domains with altered or improved DNA-binding specificity.",
                                "In some embodiments, the SP phage is a filamentous phage or phagemid. In some embodiments, the phage is an M13 phage. M13 phages are well known to those in the art and the biology of M13 phages has extensively been studied. Wild type M13 phage particles comprise a circular, single-stranded genome of approximately 6.4 kb. The wilt-type genome includes ten genes, gI-gX, which, in turn, encode the ten M13 proteins, pI-pX, respectively. gVIII encodes pVIII, also often referred to as the major structural protein of the phage particles, while gIII encodes pIII, also referred to as the minor coat protein, which is required for infectivity of M13 phage particles.",
                                "The M13 life cycle includes attachment of the phage to the sex pilus of a suitable bacterial host cell via the pIII protein and insertion of the phage genome into the host cell. The circular, single-stranded phage genome is then converted to a circular, double-stranded DNA, also termed the replicative form (RF), from which phage gene transcription is initiated. The wild type M13 genome comprises nine promoters and two transcriptional terminators as well as an origin of replication. This series of promoters provides a gradient of transcription such that the genes nearest the two transcriptional terminators (gVIII and IV) are transcribed at the highest levels. In wild-type M13 phage, transcription of all 10 genes proceeds in same direction. One of the phage-encode proteins, pII, initiates the generation of linear, single-stranded phage genomes in the host cells, which are subsequently circularized, and bound and stabilized by pV. The circularized, single-stranded M13 genomes are then bound by pVIII, while pV is stripped off the genome, which initiates the packaging process. At the end of the packaging process, multiple copies of pIII are attached to wild-type M13 particles, thus generating infectious phage ready to infect another host cell and concluding the life cycle.",
                                "The M13 phage genome can be manipulated, for example, by deleting one or more of the wild type genes, and/or inserting a heterologous nucleic acid construct into the genome. M13 does not have stringent genome size restrictions, and insertions of up to 42 kb have been reported. This allows M13 phage vectors to be used in continuous evolution experiments to evolve genes of interest without imposing a limitation on the length of the gene to be involved.",
                                "In some embodiments, the host cells comprise an accessory plasmid that drives expression of a gene essential for the generation of infectious viral particles from a conditional promoter. In some embodiments, the conditional promoter of the accessory plasmid is a promoter the transcriptional activity of which can be regulated over a wide range, for example, over 2, 3, 4, 5, 6, 7, 8, 9, or 10 orders of magnitude by the activating function, for example, function of a protein encoded by the gene of interest. In some embodiments, the level of transcriptional activity of the conditional promoter depends directly on the desired function of the gene of interest. This allows for starting a continuous evolution process with a viral vector population comprising versions of the gene of interest that only effect minimal activation of the conditional promoter. In the process of continuous evolution, any mutation in the gene of interest that increases activity of the conditional promoter directly translates into higher expression levels of the gene required for the generation of infectious viral particles, and, thus, into a competitive advantage over other viral vectors carrying minimally active or loss-of-function versions of the gene of interest.",
                                "The stringency of selective pressure imposed by the accessory plasmid in a continuous evolution procedure as provided herein can be modulated. In some embodiments, the use of low copy number accessory plasmids results in an elevated stringency of selection for versions of the gene of interest that activate the conditional promoter on the accessory plasmid, while the use of high copy number accessory plasmids results in a lower stringency of selection. The terms “high copy number plasmid” and “low copy number plasmid” are art-recognized and those of skill in the art will be able to ascertain whether a given plasmid is a high or low copy number plasmid. In some embodiments, a low copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 5 to about 100. In some embodiments, a very low copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 1 to about 10. In some embodiments, a very low copy number accessory plasmid is a single-copy per cell plasmid. In some embodiments, a high copy number accessory plasmid is a plasmid exhibiting an average copy number of plasmid per host cell in a host cell population of about 100 to about 5000. The copy number of an accessory plasmid will depend to a large part on the origin of replication employed. Those of skill in the art will be able to determine suitable origins of replication in order to achieve a desired copy number.",
                                "It should be understood that the function of the accessory plasmid, namely to provide a gene required for the generation of viral particles under the control of a conditional promoter the activity of which depends on a function of the gene of interest, can be conferred to a host cell in alternative ways. Such alternatives include, but are not limited to, permanent insertion of a gene construct comprising the conditional promoter and the respective gene into the genome of the host cell, or introducing it into the host cell using an different vector, for example, a phagemid, a cosmid, a phage, a virus, or an artificial chromosome. Additional ways to confer accessory plasmid function to host cells will be evident to those of skill in the art, and the invention is not limited in this respect.",
                                "In some embodiments, modified viral vectors are used in continuous evolution processes as provided herein. In some embodiments, such modified viral vectors lack a gene required for the generation of infectious viral particles. In some such embodiments, a suitable host cell is a cell comprising the gene required for the generation of infectious viral particles, for example, under the control of a constitutive or a conditional promoter (e.g., in the form of an accessory plasmid, as described herein). In some embodiments, the viral vector used lacks a plurality of viral genes. In some such embodiments, a suitable host cell is a cell that comprises a helper construct providing the viral genes required for the generation of viral particles. A cell is not required to actually support the life cycle of a viral vector used in the methods provided herein. For example, a cell comprising a gene required for the generation of infectious viral particles under the control of a conditional promoter may not support the life cycle of a viral vector that does not comprise a gene of interest able to activate the promoter, but it is still a suitable host cell for such a viral vector. In some embodiments, the viral vector is a phage and the host cell is a bacterial cell. In some embodiments, the host cell is an E. coli cell. Suitable E. coli host strains will be apparent to those of skill in the art, and include, but are not limited to, New England Biolabs (NEB) Turbo, Top10F′, DH12S, ER2738, ER2267, and XL1-Blue MRF′. These strain names are art recognized and the genotype of these strains has been well characterized. It should be understood that the above strains are exemplary only and that the invention is not limited in this respect.",
                                "In some embodiments, the host cell is an E. coli cell. In some PACE embodiments, for example, in embodiments employing an M13 selection phage, the host cells are E. coli cells expressing the Fertility factor, also commonly referred to as the F factor, sex factor, or F-plasmid. The F-factor is a bacterial DNA sequence that allows a bacterium to produce a sex pilus necessary for conjugation and is essential for the infection of E. coli cells with certain phage, for example, with M13 phage. For example, in some embodiments, the host cells for M13-PACE are of the genotype F′proA+B+Δ(lacIZY) zzf::Tn10(TetR)/endA1 recA1 galE15 galK16 nupG rpsL AlacIZYA araD139 A(ara,leu)7697 mcrA A(mrr-hsdRMS-mcrBC) proBA::pir116 λ−.",
                                "The general concept of PACE technology has been described, for example in International PCT Application, PCT/US2009/056194, filed Sep. 8, 2009, published as WO 2010/028347 on Mar. 11, 2010; International PCT Application, PCT/US2011/066747, filed Dec. 22, 2011, published as WO 2012/088381 on Jun. 28, 2012; and U.S. Application, U.S. Ser. No. 13/922,812, filed Jun. 20, 2013, each of which is incorporated herein by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce PACE technology",
                                "describe PACE process",
                                "describe M13 phage biology",
                                "describe M13 phage genome manipulation",
                                "describe accessory plasmid function",
                                "describe conditional promoter regulation",
                                "describe stringency of selective pressure",
                                "describe low and high copy number accessory plasmids",
                                "describe alternative ways to confer accessory plasmid function",
                                "describe modified viral vectors",
                                "describe host cell requirements",
                                "describe E. coli host strains",
                                "describe F factor in E. coli cells",
                                "describe genotype of E. coli host cells",
                                "provide references to prior art",
                                "describe modified viral vectors lacking genes",
                                "describe helper constructs providing viral genes",
                                "describe host cell requirements for viral vectors",
                                "describe E. coli host cells for M13-PACE",
                                "describe genotype of E. coli host cells for M13-PACE",
                                "provide references to prior art"
                            ],
                            "num_characters": 10598,
                            "outline_medium": [
                                "introduce PACE technology",
                                "describe M13 phage life cycle",
                                "outline manipulation of M13 phage genome",
                                "describe accessory plasmid function",
                                "discuss modulation of selective pressure",
                                "outline alternative ways to confer accessory plasmid function",
                                "describe modified viral vectors",
                                "outline suitable host cells",
                                "provide genotype of E. coli host strains",
                                "discuss general concept of PACE technology"
                            ],
                            "outline_short": [
                                "introduce PACE technology for directed evolution of proteins",
                                "describe M13 phage genome and its manipulation for continuous evolution",
                                "explain the role of accessory plasmid in PACE",
                                "describe modified viral vectors used in PACE",
                                "provide examples of host cells suitable for PACE"
                            ]
                        },
                        {
                            "title": "Methods for Evolving Recombinases",
                            "paragraphs": [
                                "Some aspects of this disclosure provide methods for evolving recombinases. In some embodiments, the methods comprise (a) contacting a population of host cells with a population of phage vectors comprising a gene encoding a recombinase and deficient in at least one gene for the generation of infectious phage particles, wherein (1) the host cells are amenable to transfer of the phage vector; (2) the vector allows for expression of the recombinase in a host cell, can be replicated by the host cell, and the replicated vector can transfer from host cell to host cell; (3) the host cells express a gene product encoded by the at least one gene for the generation of infectious phage particles of (a) in response to the recombination of a recombinase target sequence by the recombinase, and the level of gene product expression depends on the activity of the recombinase towards the target sequence; (b) incubating the population of host cells under conditions allowing for mutation of the gene encoding the recombinase and the transfer of the phage vectors from host cell to host cell, wherein host cells are removed from the host cell population, and the population of host cells is replenished with fresh host cells that do not harbor the phage vector; and (c) isolating a replicated phage vector from the host cell population in (b), wherein the replicated vector comprises a mutated version of the gene encoding the recombinase.",
                                "In some embodiments, the host cells harbor an expression construct comprising a nucleotide sequence encoding a gene product of the at least one gene for the generation of infectious phage particles of (a) under the control of a heterologous promoter and a transcriptional terminator flanked by two recombinase target sequences. In some embodiments, the recombinase target sequences are different from the target sequences recognized by the wild-type version of the recombinase. In some embodiments, recombination of the recombinase target sequences results in excision of the transcriptional terminator and expression of the at least one gene for the generation of infectious phage particles. In some embodiments, the recombinase is a Cre recombinase. In some embodiments, the replicated vector isolated in (c) encodes a mutated recombinase that cleaves the recombinase target sequence with higher efficiency than the version of the recombinase of (a). In some embodiments, the recombinase target sequence comprises a sequence occurring in the genome of a target cell. In some embodiments, the recombinase target sequence comprises a sequence occurring once in the genome of a target cell. In some embodiments, the recombinase target sequence comprises a sequence occurring in a ubiquitously expressed genomic locus. In some embodiments, the recombinase target sequence comprises a sequence occurring in the Rosa 26 locus of the target cell. In some embodiments, the recombinase target sequence comprises a mammalian genomic sequence. In some embodiments, the recombinase target sequence comprises a human genomic sequence. In some embodiments, the recombinase target sequence comprises a sequence within a mammalian genome and wherein the recombinase target sequence differs from any other sequence of the same length within the genome in at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, or at least 10 nucleotides. In some embodiments, the vector is a viral vector. In some embodiments, the viral vector is a phage. In some embodiments, the phage is a filamentous phage. In some embodiments, the phage is an M13 phage. In some embodiments, the at least one gene for the generation of infectious phage particles comprises a sequence encoding a pIII protein. In some embodiments, the at least one gene for the generation of infectious phage particles comprises a full-length gIII gene. In some embodiments, the host cells comprise all phage genes except for the at least one gene for the generation of infectious phage particles in the form of a helper phage. In some embodiments, the phage genes comprised on the helper phage comprise pI, pII, pIV, pV, pVI, pVII, pVIII, pIX, and/or pX. In some embodiments, one, some, or all phage genes except for the at least one gene for the generation of infectious phage particles are provided to the host cell by the phage vector of (a) or a mutated progeny vector of the phage vector of (a). In some embodiments, the host cells comprise an accessory plasmid and together, the phage vector of (a) and the accessory plasmid comprise all genes required for the generation of an infectious phage. In some embodiments, the host cells comprise an accessory plasmid, and wherein the accessory plasmid comprises an expression construct encoding the pIII protein under the control of a heterologous promoter and a transcriptional terminator flanked by two recombinase target sequences.",
                                "In some embodiments, the method further comprises a negative selection for undesired recombinase activity. In some embodiments, the host cells comprise an expression construct encoding a dominant-negative pIII protein (pIII-neg), and wherein the expression of the pIII-neg protein depends on the undesired recombinase activity. In some embodiments, expression of the pIII-neg protein is activated by recombination of undesired recombinase target sequences flanking a transcriptional terminator within the expression construct encoding the pIII-neg protein. In some embodiments, the undesired recombinase target sequences are off-target recombinase target sequences. In some embodiments, the undesired recombinase target sequences are sequences recognized by the wild-type version of the recombinase of (a).",
                                "In some embodiments, the host cells further comprise a mutagenesis plasmid.",
                                "In some embodiments, the host cells are E. coli cells. In some embodiments, the host cells are incubated in suspension culture. In some embodiments, the population of host cells is continuously replenished with fresh host cells that do not comprise the phage vector. In some embodiments, fresh cells are being replenished and cells are being removed from the cell population at a rate resulting in a substantially constant number of cells in the cell population. In some embodiments, fresh cells are being replenished and cells are being removed from the cell population at a rate resulting in a substantially constant phage vector population.",
                                "In some embodiments, the method comprises a phase of diversifying the population of phage vectors by mutagenesis, in which the cells are incubated under conditions suitable for mutagenesis of the gene encoding the recombinase in the absence of stringent selection for vectors having acquired a mutation in the gene encoding the recombinase. In some embodiments, the method comprises a phase of stringent selection for a mutated replication product of the phage vector encoding an evolved recombinase.",
                                "Some aspects of this disclosure provide evolved recombinases obtained by the phage-assisted continuous evolution methods provided herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce methods for evolving recombinases",
                                "describe contacting host cells with phage vectors",
                                "describe incubating host cells under conditions allowing mutation",
                                "describe isolating replicated phage vectors",
                                "describe expression construct in host cells",
                                "describe recombination of recombinase target sequences",
                                "describe excision of transcriptional terminator",
                                "describe expression of genes for infectious phage particles",
                                "describe mutated recombinase with higher efficiency",
                                "describe recombinase target sequences in target cells",
                                "describe negative selection for undesired recombinase activity",
                                "describe dominant-negative pIII protein",
                                "describe mutagenesis plasmid",
                                "describe continuous replenishment of host cells"
                            ],
                            "num_characters": 7082,
                            "outline_medium": [
                                "outline method for evolving recombinases",
                                "describe expression construct in host cells",
                                "discuss recombination of recombinase target sequences",
                                "outline isolation of replicated phage vector",
                                "describe negative selection for undesired recombinase activity",
                                "outline optional mutagenesis plasmid",
                                "discuss evolved recombinases obtained by PACE methods"
                            ],
                            "outline_short": [
                                "outline method for evolving recombinases using PACE",
                                "describe expression construct for conditional expression of gene required for infectious phage particles",
                                "provide variations of the method, including negative selection for undesired recombinase activity"
                            ]
                        },
                        {
                            "title": "Evolved Recombinases",
                            "paragraphs": [
                                "Some aspects of this disclosure provide evolved recombinases comprising an amino acid sequence that is at least 70%, at least 80%, at least 90%, at least 95%, or at least 97% identical to the sequence of a wild-type recombinase, wherein the amino acid sequence of the evolved recombinase comprises at least one mutation as compared to the sequence of the wild-type recombinase, and wherein the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by at least one nucleotide. In some embodiments, In some embodiments, the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, at least 15, at least 16, at least 17, at least 18, at least 19, at least 20 at least 25, or at least 30 nucleotides. In some embodiments, the evolved recombinase recognizes a DNA recombinase target sequence that differs from the canonical recombinase target sequence by 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, or 30 nucleotides.",
                                "In some embodiments, the recombinase target sequence is between 10-50 nucleotides long. In some embodiments, the recombinase is a Cre recombinase, a Hin recombinase, or a FLP recombinase. In some embodiments, the canonical recombinase target sequence is a LoxP site (5′-ATAACTTCGTATA GCATACAT TATACGAAGTTAT-3′, SEQ ID NO: 2). In some embodiments, the canonical recombinase target sequence is an FRT site (5′-5′-GAAGTTCCTATTCTCTAGAAA GTATAGGAACTTC -3′, SEQ ID NO: 3). In some embodiments, the amino acid sequence of the recombinase comprises at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 mutations as compared to the sequence of the wild-type recombinase. In some embodiments, the recombinase recognizes a DNA recombinase target sequence that comprises a left half-site, a spacer sequence, and a right half-site, and wherein the left half-site is not a palindrome of the right half-site.",
                                "In some embodiments, the recombinase recognizes a DNA recombinase target sequence that comprises a naturally occurring sequence. In some embodiments, the recombinase recognizes a DNA recombinase target sequence that is comprised in the genome of a mammal. In some embodiments, the recombinase recognizes a DNA recombinase target sequence comprised in the genome of a human. In some embodiments, the recombinase recognizes a DNA recombinase target sequence that occurs only once in the genome of a mammal. In some embodiments, the recombinase recognizes a DNA recombinase target sequence in the genome of a mammal that differs from any other site in the genome by at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotide(s). In some embodiments, the recombinase recognizes a DNA recombinase target sequence located in a safe harbor genomic locus. In some embodiments, the safe harbor genomic locus is a Rosa26 locus. In some embodiments, the recombinase recognizes a DNA recombinase target sequence located in a genomic locus associated with a disease or disorder.",
                                "Some aspects of this disclosure provide pharmaceutical compositions comprising a recombinase as provided herein and a pharmaceutically acceptable excipient. In some embodiments, the pharmaceutical composition is formulated for administration to a subject. In some embodiments, the pharmaceutical composition comprises an effective amount of the recombinase for recombining a recombinase target sequence in a cell of a subject in vivo, ex vivo, or in vitro. In some embodiments, the composition further comprises a nucleic acid molecule comprising at least one recombinase target sequence adjacent to a sequence to be inserted into a genetic locus within the genome of the subject. In some embodiments, the nucleic acid molecule is a circular DNA molecule comprising a single recombinase target sequence.",
                                "Some aspects of this disclosure provide Cre recombinases comprising an amino acid sequence that is at least 70%, at least 80%, at least 90%, at least 95%, or at least 97% identical to the sequence of SEQ ID NO: 1, wherein the amino acid sequence of the Cre recombinase comprises at least one mutation as compared to the sequence of SEQ ID NO: 1, and wherein the Cre recombinase recognizes a DNA recombinase target sequence that differs from the canonical LoxP site 5′-ATAACTTCGTATA GCATACAT TATACGAAGTTAT-3′ (SEQ ID NO: 2) in at least one nucleotide.",
                                "In some embodiments, the amino acid sequence of the Cre recombinase comprises at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 mutations as compared to the sequence of SEQ ID NO: 1. In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that differs from the canonical LoxP site in at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotides.",
                                "In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that comprises a left half-site, a spacer sequence, and a right half-site, wherein the left half-site is not a palindrome of the right half-site. In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that comprises a naturally occurring sequence. In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that is comprised in the genome of a mammal.",
                                "In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that is comprised in the genome of a human. In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence that is comprised only once in the genome of a mammal. In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence in the genome of a mammal that differs from any other site in the genome by at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotide(s).",
                                "In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence located in a safe harbor genomic locus. In some embodiments, the safe harbor genomic locus is a Rosa26 locus.",
                                "In some embodiments, the Cre recombinase recognizes a DNA recombinase target sequence located in a genomic locus associated with a disease or disorder.",
                                "Some aspects of this disclosure provide pharmaceutical compositions comprising a Cre recombinase as provided herein and a pharmaceutically acceptable excipient In some embodiments, the pharmaceutical composition is formulated for administration to a subject. In some embodiments, the pharmaceutical composition comprises an effective amount of the Cre recombinase for recombining a recombinase target sequence in a cell in the subject. In some embodiments, the composition further comprises a nucleic acid molecule comprising at least one recombinase target sequence adjacent to a sequence to be inserted into a genetic locus within the genome of the subject. In some embodiments, the nucleic acid molecule is a circular DNA molecule comprising a single recombinase target sequence."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define evolved recombinases",
                                "describe amino acid sequence",
                                "specify mutations",
                                "describe recombinase target sequence",
                                "specify differences from canonical sequence",
                                "describe length of target sequence",
                                "specify type of recombinase",
                                "describe canonical target sequence",
                                "specify mutations in amino acid sequence",
                                "describe recognition of target sequence",
                                "specify location of target sequence",
                                "describe safe harbor genomic locus",
                                "specify pharmaceutical composition",
                                "describe administration of composition",
                                "specify use of composition"
                            ],
                            "num_characters": 7770,
                            "outline_medium": [
                                "define evolved recombinases",
                                "describe recombinase target sequence",
                                "specify recombinase target sequence length",
                                "describe recombinase recognition of target sequence",
                                "provide pharmaceutical compositions",
                                "describe Cre recombinases",
                                "provide pharmaceutical compositions for Cre recombinases"
                            ],
                            "outline_short": [
                                "define evolved recombinases",
                                "describe recombinase target sequences",
                                "provide pharmaceutical compositions"
                            ]
                        },
                        {
                            "title": "Methods For Recombinase-Mediated Genetic Engineering",
                            "paragraphs": [
                                "Some aspects of this disclosure provide methods for engineering a nucleic acid molecule, the method comprising contacting a first nucleic acid molecule comprising a first recombinase target sequence of the structure 5′-[left half-site]-[spacer]-[right half-site]-3′ with a recombinase and a second nucleic acid molecule comprising a second recombinase target sequence under conditions suitable for the recombinase to bind and recombine the recombinase target sequences, wherein the first and the second recombinase target sequences differ from the canonical Cre recombinase target sequence 5′-ATAACTTCGTATA GCATACAT TATACGAAGTTAT-3′ (SEQ ID NO: 2) in at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotides.",
                                "In some embodiments, the left half-site of the recombinase target sequence is not a palindrome of the right half-site. In some embodiments, the recombinase target sequence comprises a naturally occurring sequence. In some embodiments, the recombinase target sequence is comprised in the genome of a mammal. In some embodiments, the recombinase target sequence is comprised in the genome of a human. In some embodiments, the recombinase target site is comprised only once in the genome of a mammal.",
                                "In some embodiments, the recombinase target sequence is comprised in the genome of a mammal and differs from any other site in the genome by at least 1, at least 2, at least 3, at least 4, at least 5, at least 6, at least 7, at least 8, at least 9, at least 10, at least 11, at least 12, at least 13, at least 14, or at least 15 nucleotide(s).",
                                "In some embodiments, the recombinase target sequence is located in a safe harbor genomic locus. In some embodiments, the safe harbor genomic locus is a Rosa26 locus. In some embodiments, the recombinase target sequence is located in a genomic locus associated with a disease or disorder.",
                                "In some embodiments, the first nucleic acid molecule is contacted with the recombinase in a cell. In some embodiments, the contacting is in vitro. In some embodiments, the contacting is in vivo. In some embodiments, the method comprises administering A composition comprising the recombinase and the second nucleic acid molecule to the subject in an amount sufficient for the recombinase to bind and recombine the first recombinase target sequence.",
                                "In some embodiments, a method is provided that comprises contacting the genome of a cell with an evolved recombinase provided herein, either in vivo, ex vivo, or in vitro, wherein the contacting results in the evolved recombinase binding and recombining a recombinase target sequence within the genome of the cell, thus altering the sequence of the genome. In some embodiments, the change in the genome comprises an excision of a sequence associated with a disease or disorder, such as, for example, a mutated version of a gene, or an integrated viral genome. In some embodiments, the contacting results in the integration of a heterologous nucleic acid sequence into the genome of the cell, e.g., at a safe harbor locus or in place of an undesired sequence."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe method for engineering nucleic acid molecule",
                                "specify contacting nucleic acid molecules with recombinase",
                                "describe recombination of target sequences",
                                "specify differences from canonical target sequence",
                                "describe administration of composition",
                                "specify use of method"
                            ],
                            "num_characters": 3194,
                            "outline_medium": [
                                "describe method for engineering nucleic acid molecule",
                                "specify conditions for recombinase binding and recombination",
                                "provide examples of recombinase target sequences"
                            ],
                            "outline_short": [
                                "describe methods for engineering nucleic acid molecules"
                            ]
                        },
                        {
                            "title": "Methods for Evaluating the Specificity of Recombinases",
                            "paragraphs": [
                                "Some aspects of this disclosure provide methods for identifying a target site of a recombinase. In some embodiments, the comprises (a) providing a recombinase that binds and recombines a double-stranded nucleic acid target sequence of the structure 5′-[left half-site]-[spacer]-[right half-site]-3; (b) contacting the recombinase of (a) with a library of candidate nucleic acid molecules, wherein each candidate nucleic acid molecule comprises a nucleic acid strand comprising the structure 5′-[spacer]-[half-site]-[loop sequence]-[half-site]-[spacer]-3′, wherein the spacer and half-site sequences on the 5′ and 3′ end are complementary and hybridize to each other, thus forming a single-stranded loop structure and a double-stranded [half-site]-[spacer] structure, and wherein each candidate nucleic acid molecule comprises a PCR primer binding site within the loop sequence, under conditions suitable for the recombinase to bind a candidate nucleic acid molecule comprising a [spacer]-[half-site]-structure and recombine it with the [spacer]-[half-site] structure of a different candidate nucleic acid molecule, thus creating a recombined circular nucleic acid molecule comprising a [loop sequence]-[half-site]-[spacer]-[half-site]-[loop sequence] structure; and (c) identifying recombinase target sites bound and recombined by the recombinase in (b) by determining the sequence of the [half-site]-[spacer]-[half-site] structure of the recombined circular nucleic acid molecule in (b).",
                                "In some embodiments, the determining of step (c) comprises amplifying a fragment comprising the [half-site]-[spacer]-[half-site] of the recombined nucleic acid molecule via a PCR reaction using a PCR primer that hybridizes with the primer binding site within the loop sequence. In some embodiments, the method further comprises enriching the amplified nucleic acid molecules for molecules comprising a [half-site]-[spacer]-[half-site] structure. In some embodiments, the enriching comprises a size fractionation. In some embodiments, the determining of step (c) comprises sequencing the [half-site]-[spacer]-[half-site] structure of a nucleic acid molecule that was recombined by the recombinase in step (b), or a copy thereof obtained via PCR. In some embodiments, the method further comprises contacting the library of candidate molecules with an exonuclease after completion of step (b). In some embodiments, the library of candidate nucleic acid molecules comprises at least 108, at least 109, at least 1010, at least 1011, or at least 1012 different half-site sequences.",
                                "In some embodiments, the loop sequence and/or the spacer sequence is identical amongst the candidate nucleic acid molecules of the library. In some embodiments, the recombinase binds and recombines a specific recombinase target sequence within a genome. In some embodiments, the left half-site of the recombinase target sequence is not a palindrome of the right half-site. In some embodiments, the recombinase target sequence comprises a naturally occurring sequence.",
                                "In some embodiments, the library comprises at least one copy of each possible half-site sequence occurring within a genome. In some embodiments, the library comprises at least two-fold, at least four-fold, at least five-fold, or at least ten-fold coverage of each possible half-site sequence occurring within a genome.",
                                "In some embodiments, the method further comprises determining a maximum concentration of the recombinase at which the recombinase binds and recombines a specific recombinase target sequence, and does not recombine more than 10, more than 5, more than 4, more than 3, more than 2, more than 1, or no additional recombinase target sequences. In some embodiments, the method further comprises determining all recombinase target sequences bound and recombined by the recombinase.",
                                "In some embodiments, the method further comprises generating a recombinase target sequence profile for the recombinase.",
                                "In some embodiments, the method comprises subjecting a plurality of recombinases that bind and recombine a consensus target sequence to steps (a)-(c), thus identifying any off-target sequences bound and recombined by each of the recombinases, and selecting a recombinase based on the off-target site(s) so identified. In some embodiments, the recombinase selected is the recombinase that binds and recombines the consensus target sequence with the highest specificity.",
                                "In some embodiments, the recombinase that binds and recombines the consensus target sequence with the highest specificity is the recombinase that binds and recombines the lowest number of off-target sequences. In some embodiments, the recombinase that binds and recombines the consensus target sequence with the highest specificity is the recombinase that binds and recombines the lowest number of off-target sequences that are different from the consensus site in the context of a target genome. In some embodiments, the recombinase selected is the recombinase that binds and recombines no sequence other than the consensus target sequence.",
                                "In some embodiments, the recombinase selected is the recombinase that binds and recombines the consensus target sequence but no sequence other than the consensus target sequence when contacted with all possible target sequences that occur within the genome of a subject."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe method for identifying target site",
                                "specify providing recombinase",
                                "describe contacting recombinase with library",
                                "specify structure of candidate nucleic acid molecules",
                                "describe recombination of target sequences",
                                "specify identifying recombinase target sites",
                                "describe determining sequence of recombined molecule",
                                "specify enriching amplified molecules",
                                "describe sequencing recombined molecule",
                                "specify evaluating specificity of recombinase"
                            ],
                            "num_characters": 5337,
                            "outline_medium": [
                                "describe method for identifying target site of recombinase",
                                "specify library of candidate nucleic acid molecules",
                                "describe PCR amplification and sequencing",
                                "provide examples of recombinase target sequences",
                                "describe method for determining specificity of recombinase"
                            ],
                            "outline_short": [
                                "describe methods for identifying target sites",
                                "provide methods for evaluating specificity"
                            ]
                        },
                        {
                            "title": "Libraries for Assessing Recombinase Target Site Preferences",
                            "paragraphs": [
                                "Some aspects of this disclosure provide libraries of nucleic acid molecules that are useful for assessing the target sites preferences of recombinases. In some embodiments the library comprises a plurality of nucleic acid molecules, wherein each nucleic acid molecule comprises a 5′-[spacer]-[half-site]-[loop sequence]-[half-site]-[spacer]-3′ structure, wherein the spacer and half-site sequences on the 5′ and 3′ end are complementary and hybridize to each other, thus forming a single-stranded loop structure and a double-stranded [half-site]-[spacer] structure, and wherein each candidate nucleic acid molecule comprises a PCR primer binding site within the loop sequence.",
                                "In some embodiments, the loop sequence is at least 15, at least 20, at least 25, at least 30, at least 35, at least 40, at least 45, at least 50, at least 55, at least 60, at least 65, at least 70, at least 75, at least 80, at least 90, at least 95, at least 100, at least 150, at least 200, at least 250, at least 300, at least 350, at least 400, at least 450, at least 500, at least 550, at least 600, at least 650, at least 700, at least 750, at least 800, at least 900, at least 950, or at least 1000 nucleotides long.",
                                "In some embodiments, the loop sequence is not more than 15, not more than 20, not more than 25, not more than 30, not more than 35, not more than 40, not more than 45, not more than 50, not more than 55, not more than 60, not more than 65, not more than 70, not more than 75, not more than 80, not more than 90, not more than 95, not more than 100, not more than 150, not more than 200, not more than 250, not more than 300, not more than 350, not more than 400, not more than 450, not more than 500, not more than 550, not more than 600, not more than 650, not more than 700, not more than 750, not more than 800, not more than 900, not more than 950, or not more than 1000 nucleotides long.",
                                "In some embodiments, the library comprises at least 105, at least 106, at least 107, at least 108, at least 109, at least 1010, at least 1011, or at least 1012 different candidate half-site sequences.",
                                "In some embodiments, the loop sequence and/or the spacer sequence is identical amongst nucleic acid molecules comprising different half-site sequences. In some embodiments, the library comprises candidate recombinase target half-sites that are variations of a known target half-site of a recombinase of interest. In some embodiments, the variations of the known recombinase target half-site comprise 10 or fewer, 9 or fewer, 8 or fewer, 7 or fewer, 6 or fewer, 5 or fewer, 4 or fewer, 3 or fewer, or 2 or fewer mutations as compared to the known recombinase target half-site."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe library of nucleic acid molecules",
                                "specify structure of candidate nucleic acid molecules",
                                "describe loop sequence",
                                "specify number of different half-site sequences",
                                "describe use of library"
                            ],
                            "num_characters": 2673,
                            "outline_medium": [
                                "describe library of nucleic acid molecules",
                                "specify characteristics of loop sequence and half-site sequences"
                            ],
                            "outline_short": [
                                "describe libraries for assessing target site preferences"
                            ]
                        },
                        {
                            "title": "Vectors and Reagents",
                            "paragraphs": [
                                "Some aspects of this disclosure provide vectors and reagents for carrying out the inventive continuous recombinase evolution processes.",
                                "In some embodiments, a selection phage is provided that comprises a phage genome deficient in at least one gene required for the generation of infectious phage particles and a gene encoding a recombinase of interest to be evolved.",
                                "For example, in some embodiments, a selection phage as described in in PCT Application PCT/US2009/056194, published as WO2010/028347 on Mar. 11, 2010; PCT Application PCT/US2011/066747, published as WO2012/088381 on Jun. 28, 2012; and U.S. Nonprovisional Application 13/922,812, filed on Jun. 20/2013, the entire contents of each of which are incorporated herein by reference, is provided, that comprises a multiple cloning site for insertion of a nucleic acid sequence encoding a recombinase of interest.",
                                "Such selection phage vectors typically comprise an M13 phage genome deficient in a gene required for the generation of infectious M13 phage particles, for example, a full-length gIII. In some embodiments, the selection phage comprises a phage genome providing all other phage functions required for the phage life cycle except the gene required for generation of infectious phage particles. In some such embodiments, an M13 selection phage is provided that comprises a gI, gII, gIV, gV, gVI, gVII, gVIII, gIX, and a gX gene, but not a full-length gIII. In some embodiments, the selection phage comprises a 3′-fragment of gIII, but no full-length gIII. The 3′-end of gIII comprises a promoter and retaining this promoter activity is beneficial, in some embodiments, for an increased expression of gVI, which is immediately downstream of the gIII 3′-promoter, or a more balanced (wild-type phage-like) ratio of expression levels of the phage genes in the host cell, which, in turn, can lead to more efficient phage production. In some embodiments, the 3′-fragment of gIII gene comprises the 3′-gIII promoter sequence. In some embodiments, the 3′-fragment of gIII comprises the last 180 bp, the last 150 bp, the last 125 bp, the last 100 bp, the last 50 bp, or the last 25 bp of gIII. In some embodiments, the 3′-fragment of gIII comprises the last 180 bp of gIII. In some embodiments, the multiple cloning site for insertion of the gene encoding the recombinase of interest is located downstream of the gVIII 3′-terminator and upstream of the gIII-3′-promoter.",
                                "In some embodiments, the selection phage is an M13 phage as described herein. For example, in some embodiments, the selection phage comprises an M13 genome including all genes required for the generation of phage particles, for example, gI, gII, gIV, gV, gVI, gVII, gVIII, gIX, and gX gene, but not a full-length gIII gene. In some embodiments, the selection phage genome comprises an F1 or an M13 origin of replication. In some embodiments, the selection phage genome comprises a 3′-fragment of gIII gene. In some embodiments, the selection phage comprises a multiple cloning site upstream of the gIII 3′-promoter and downstream of the gVIII 3′-terminator for insertion of a gene encoding a recombinase of interest.",
                                "The vector system may further comprise a helper phage, wherein the selection phage does not comprise all genes for the generation of infectious phage particles, and wherein the helper phage complements the genome of the selection phage, so that the helper phage genome and the selection phage genome together comprise at least one functional copy of all genes for the generation of phage particles, but are deficient in at least one gene required for the generation of infectious phage particles, which is provided by an accessory plasmid.",
                                "In some embodiments, the vector system further comprises a mutagenesis plasmid, for example, an arabinose-inducible mutagenesis plasmid as described herein. In some embodiments, the mutagenesis plasmid comprises a gene expression cassette encoding a component of E. coli translesion synthesis polymerase V, a deoxyadenosine methylase, and/or a hemimethylated-GATC binding domain, or any combination thereof. In some embodiments, the component of E. coli translesion synthesis polymerase V is umuC. In some embodiments, the deoxyadenosine methylase is dam. In some embodiments, the hemimethylated-GATC binding domain is seqA."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide selection phage with phage genome deficient in gene required for infectious phage particles",
                                "describe gene encoding recombinase of interest",
                                "detail multiple cloning site for insertion of nucleic acid sequence",
                                "describe M13 phage genome with genes required for phage life cycle",
                                "provide helper phage complementing selection phage genome",
                                "describe mutagenesis plasmid with gene expression cassette",
                                "detail components of E. coli translesion synthesis polymerase V",
                                "describe deoxyadenosine methylase and hemimethylated-GATC binding domain"
                            ],
                            "num_characters": 4319,
                            "outline_medium": [
                                "provide selection phage vectors",
                                "describe phage genome and gene requirements",
                                "outline helper phage and accessory plasmid functions",
                                "detail mutagenesis plasmid components"
                            ],
                            "outline_short": [
                                "provide selection phage vectors",
                                "describe helper phage and mutagenesis plasmid components"
                            ]
                        },
                        {
                            "title": "Expression Constructs",
                            "paragraphs": [
                                "Some aspects of this disclosure provide nucleic acids encoding any of the recombinases provided herein. In some embodiments, the nucleic acids encoding the recombinases are under the control of a heterologous promoter. In some embodiments, the encoding nucleic acids are included in an expression construct, e.g., a plasmid, a viral vector, or a linear expression construct. In some embodiments, the nucleic acid or expression construct is in a cell, tissue, or organism.",
                                "Nucleic acids encoding any of the proteins, described herein, may be in any number of nucleic acid “vectors” known in the art. As used herein, a “vector” means any nucleic acid or nucleic acid-bearing particle, cell, or organism capable of being used to transfer a nucleic acid into a host cell. The term “vector” includes both viral and nonviral products and means for introducing the nucleic acid into a cell. A “vector” can be used in vitro, ex vivo, or in vivo. Non-viral vectors include plasmids, cosmids, artificial chromosomes (e.g., bacterial artificial chromosomes or yeast artificial chromosomes) and can comprise liposomes, electrically charged lipids (cytofectins), DNA-protein complexes, and biopolymers, for example. Viral vectors include retroviruses, lentiviruses, adeno-associated virus, pox viruses, baculovirus, reoviruses, vaccinia viruses, herpes simplex viruses, Epstein-Barr viruses, and adenovirus vectors, for example. Vectors can also comprise the entire genome sequence or recombinant genome sequence of a virus. A vector can also comprise a portion of the genome that comprises the functional sequences for production of a virus capable of infecting, entering, or being introduced to a cell to deliver nucleic acid therein.",
                                "Expression of any of the recombinases described herein may be controlled by any regulatory sequence (e.g. a promoter sequence) known in the art. Regulatory sequences, as described herein, are nucleic acid sequences that regulate the expression of a nucleic acid sequence. A regulatory or control sequence may include sequences that are responsible for expressing a particular nucleic acid (e.g., a nucleic acid encoding a recombinases) or may include other sequences, such as heterologous, synthetic, or partially synthetic sequences. The sequences can be of eukaryotic, prokaryotic or viral origin that stimulate or repress transcription of a gene in a specific or non-specific manner and in an inducible or non-inducible manner. Regulatory or control regions may include origins of replication, RNA splice sites, introns, chimeric or hybrid introns, promoters, enhancers, transcriptional termination sequences, poly A sites, locus control regions, signal sequences that direct the polypeptide into the secretory pathways of the target cell, and introns. A heterologous regulatory region is not naturally associated with the expressed nucleic acid it is linked to. Included among the heterologous regulatory regions are regulatory regions from a different species, regulatory regions from a different gene, hybrid regulatory sequences, and regulatory sequences that do not occur in nature, but which are designed by one of ordinary skill in the art.",
                                "The term operably linked refers to an arrangement of sequences or regions wherein the components are configured so as to perform their usual or intended function. Thus, a regulatory or control sequence operably linked to a coding sequence is capable of affecting the expression of the coding sequence. The regulatory or control sequences need not be contiguous with the coding sequence, so long as they function to direct the proper expression or polypeptide production. Thus, for example, intervening untranslated but transcribed sequences can be present between a promoter sequence and the coding sequence and the promoter sequence can still be considered operably linked to the coding sequence. A promoter sequence, as described herein, is a DNA regulatory region a short distance from the 5′ end of a gene that acts as the binding site for RNA polymerase. The promoter sequence may bind RNA polymerase in a cell and/or initiate transcription of a downstream (3′ direction) coding sequence. The promoter sequence may be a promoter capable of initiating transcription in prokaryotes or eukaryotes. Some non-limiting examples of eukaryotic promoters include the cytomegalovirus (CMV) promoter, the chicken β-actin (CBA) promoter, and a hybrid form of the CBA promoter (CBh).",
                                "Some aspects of this disclosure provide cells expressing an evolved recombinase provided herein, e.g., by virtue of harboring an expression construct as described above. In some embodiments, cells contacted with a recombinase as provided herein are provided, e.g., cells contacted in vitro, in vivo, or ex vivo."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide nucleic acids encoding recombinases",
                                "describe heterologous promoter controlling expression",
                                "detail expression construct, e.g., plasmid, viral vector, or linear expression construct",
                                "describe nucleic acid or expression construct in cell, tissue, or organism",
                                "define vector and its uses",
                                "describe non-viral and viral vectors",
                                "detail regulatory sequences, e.g., promoters, enhancers, and transcriptional termination sequences",
                                "describe operably linked regulatory or control sequences",
                                "provide cells expressing evolved recombinase"
                            ],
                            "num_characters": 4766,
                            "outline_medium": [
                                "provide nucleic acids encoding recombinases",
                                "describe expression constructs and vectors",
                                "outline regulatory sequences and promoters",
                                "detail operably linked sequences and expression control"
                            ],
                            "outline_short": [
                                "describe nucleic acids encoding recombinases",
                                "outline expression constructs and regulatory sequences"
                            ]
                        },
                        {
                            "title": "Host Cells",
                            "paragraphs": [
                                "Some aspects of this invention relate to host cells for continuous evolution processes as described herein. In some embodiments provide host cells for phage-assisted continuous evolution processes, wherein the host cell comprises an accessory plasmid comprising a gene required for the generation of infectious phage particles, for example, M13 gIII, that is expressed only in the presence of a desired recombinase activity, as described herein. In some embodiments, the host cell further provides any phage functions that are not contained in the selection phage, e.g., in the form of a helper phage. In some embodiments, the host cell provided further comprises an expression construct comprising a gene encoding a mutagenesis-inducing protein, for example, a mutagenesis plasmid as provided herein.",
                                "In some embodiments, modified viral vectors are used in continuous evolution processes as provided herein. In some embodiments, such modified viral vectors lack a gene required for the generation of infectious viral particles. In some such embodiments, a suitable host cell is a cell comprising the gene required for the generation of infectious viral particles, for example, under the control of a constitutive or a conditional promoter (e.g., in the form of an accessory plasmid, as described herein). In some embodiments, the viral vector used lacks a plurality of viral genes. In some such embodiments, a suitable host cell is a cell that comprises a helper construct providing the viral genes required for the generation of infectious viral particles. A cell is not required to actually support the life cycle of a viral vector used in the methods provided herein. For example, a cell comprising a gene required for the generation of infectious viral particles under the control of a conditional promoter may not support the life cycle of a viral vector that does not comprise a recombinase of interest able to activate expression of the gene, but it is still a suitable host cell for such a viral vector.",
                                "In some embodiments, the host cell is a prokaryotic cell, for example, a bacterial cell. In some embodiments, the host cell is an E. coli cell. In some embodiments, the host cell is a eukaryotic cell, for example, a yeast cell, an insect cell, or a mammalian cell. The type of host cell, will, of course, depend on the viral vector employed, and suitable host cell/viral vector combinations will be readily apparent to those of skill in the art.",
                                "In some embodiments, the viral vector is a phage and the host cell is a bacterial cell. In some embodiments, the host cell is an E. coli cell. Suitable E. coli host strains will be apparent to those of skill in the art, and include, but are not limited to, New England Biolabs (NEB) Turbo, Top10F′, DH12S, ER2738, ER2267, and XL1-Blue MRF′. These strain names are art recognized and the genotype of these strains has been well characterized. It should be understood that the above strains are exemplary only and that the invention is not limited in this respect.",
                                "In some PACE embodiments, for example, in embodiments employing an M13 selection phage, the host cells are E. coli cells expressing the Fertility factor, also commonly referred to as the F factor, sex factor, or F-plasmid. The F-factor is a bacterial DNA sequence that allows a bacterium to produce a sex pilus necessary for conjugation and is essential for the infection of E. coli cells with certain phage, for example, with M13 phage. For example, in some embodiments, the host cells for M13-PACE are of the genotype F′proA+B+Δ(lacIZY) zzf::Tn10(TetR)/endA1 recA1 galE15 galK16 nupG rpsL ΔlacIZYA araD139 Δ(ara,leu)7697 mcrA Δ(mrr-hsdRMS-mcrBC) proBA::pir116 λ.",
                                "**Kits and Apparatuses**",
                                "Some aspects of this invention provide kits for continuous recombinase evolution as described herein. In some embodiments, the kit comprises (a) a vector encoding a phage backbone, for example, an M13 phage backbone, and a multiple cloning site for insertion of a nucleic acid sequence encoding a recombinase. In some embodiments, the vector or a replication product thereof can be packaged into infectious phage particles in the presence of other phage functions by suitable host cells. In some embodiments, the vector or a replication product thereof lacks at least one gene required for the generation of infectious particles.",
                                "In some embodiments, the kit comprises (b) an accessory plasmid comprising a nucleic acid sequence encoding the at least one gene required for the generation of infectious particles and a recombinase target site, wherein recombination of the recombinase target site by the recombinase to be evolved is required to activate expression of the at least one gene.",
                                "In some embodiments, the kit further comprises a helper phage providing all phage functions except for the at least one gene required for the generation of infectious phage particles provided by the accessory plasmid of (b). In some embodiments, the helper phage or a replication product thereof cannot be packaged into infectious phage particles.",
                                "In some embodiments, the kit comprises suitable host cells. In some embodiments, the host cells areE. coli host cells. In some embodiments, the kit further comprises a mutagenesis plasmid. In some embodiments, the mutagenesis plasmid comprising a gene expression cassette encoding umuC (a components of E. coli translesion synthesis polymerase V), dam (deoxyadenosine methylase), and/or seqA (a hemimethylated-GATC binding domain), or any combination thereof.",
                                "In some embodiments, a PACE apparatus is provided, comprising a lagoon that is connected to a turbidostat comprising a host cell as described herein. In some embodiments, the host cell is an E. coli host cell. In some embodiments, the host cell comprises an accessory plasmid as described herein, a helper plasmid as described herein, and/or a mutagenesis plasmid as described herein. In some embodiments, the lagoon further comprises a selection phage as described herein, for example, a selection phage encoding a recombinase of interest. In some embodiments, the lagoon is connected to a vessel comprising an inducer for a mutagenesis plasmid, for example, arabinose. In some embodiments, the host cells are E. coli cells comprising the F′ plasmid, for example, cells of the genotype F′proA+B+Δ(lacIZY) zzf::Tn10(TetR)/endA1 recA1 galE15 galK16 nupG rpsL ΔlacIZYA araD139 Δ(ara,leu)7697 mcrA Δ(mrr-hsdRMS-mcrBC) proBA::pir116 λ−.",
                                "For example, in some embodiments, a PACE apparatus is provided, comprising a lagoon of about 100 ml, or about 1 1 volume, wherein the lagoon is connected to a turbidostat of about 0.5 1, 1 1, or 3 1 volume, and to a vessel comprising an inducer for a mutagenesis plasmid, for example, arabinose, wherein the lagoon and the turbidostat comprise a suspension culture of E. coli cells at a concentration of about 5×108 cells/ml. In some embodiments, the flow of cells through the lagoon is regulated to about 3 lagoon volumes per hour. In some embodiments, cells are removed from the lagoon by continuous pumping, for example, by using a waste needle set at a height of the lagoon vessel that corresponds to a desired volume of fluid (e.g., about 100 ml, in the lagoon. In some embodiments, the host cells are E. coli cells comprising the F′ plasmid, for example, cells of the genotype F′proA+B+Δ(lacIZY) zzf::Tn10(TetR)/endA1 recA1 galE15 galK16 nupG rpsL ΔlacIZYA araD139 Δ(ara,leu)7697 mcrA A(mrr-hsdRMS-mcrBC) proBA::pir116 λ+.",
                                "Some of the embodiments, advantages, features, and uses of the technology disclosed herein will be more fully understood from the Examples below. The Examples are intended to illustrate some of the benefits of the present disclosure and to describe particular embodiments, but are not intended to exemplify the full scope of the disclosure and, accordingly, do not limit the scope of the disclosure."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide host cells for continuous evolution processes",
                                "describe host cells for phage-assisted continuous evolution processes",
                                "detail accessory plasmid with gene required for infectious phage particles",
                                "describe host cell providing phage functions",
                                "provide modified viral vectors lacking gene required for infectious viral particles",
                                "describe host cell comprising gene required for infectious viral particles",
                                "detail host cell comprising helper construct providing viral genes",
                                "describe prokaryotic host cell, e.g., bacterial cell",
                                "provide E. coli host cell",
                                "describe eukaryotic host cell, e.g., yeast cell, insect cell, or mammalian cell",
                                "detail viral vector and host cell combinations",
                                "describe phage and host cell combinations",
                                "provide E. coli host strains, e.g., NEB Turbo, Top10F′, DH12S, ER2738, ER2267",
                                "describe Fertility factor and its role in conjugation",
                                "provide host cells for M13-PACE, e.g., E. coli cells with F′ plasmid"
                            ],
                            "num_characters": 7883,
                            "outline_medium": [
                                "provide host cells for continuous evolution processes",
                                "describe accessory plasmid functions",
                                "outline helper phage functions",
                                "detail modified viral vectors and host cell requirements",
                                "specify prokaryotic and eukaryotic host cells",
                                "provide examples of E. coli host strains",
                                "describe F-factor and genotype requirements"
                            ],
                            "outline_short": [
                                "provide host cells for continuous evolution processes",
                                "describe host cells for phage-assisted continuous evolution",
                                "outline modified viral vectors and suitable host cells"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce recombinase technology",
                        "describe selection strategies for PACE experiments",
                        "provide methods for assessing specificity of recombinases",
                        "describe directed evolution strategies for recombinases",
                        "list suitable recombinases for evolution",
                        "describe application of evolved recombinases in genome modification",
                        "describe integration of heterologous nucleic acid sequences into safe harbor loci",
                        "describe recombinase-mediated excision or deletion of sequences",
                        "describe additional applications of recombinase technology",
                        "provide references to prior art",
                        "describe safe harbor loci in various species",
                        "describe additional uses of recombinase technology"
                    ],
                    "num_characters": 6024,
                    "outline_medium": [
                        "introduce recombinase technology",
                        "describe selection strategies for PACE experiments",
                        "provide methods for assessing specificity of recombinases",
                        "discuss applications of evolved recombinases",
                        "describe safe harbor loci in the human genome",
                        "outline additional applications of recombinase technology"
                    ],
                    "outline_short": [
                        "introduce recombinase technology for genome modification",
                        "describe selection strategies for evolving recombinases with altered target sequence preferences",
                        "provide methods and reagents for assessing specificity of recombinases"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "A Phage Assisted Continuous Evolution (PACE) selection for rapidly altering the DNA specificity of Cre recombinase towards a site present in a human genomic safe harbor locus, Rosa 26, was developed. The PACE experiments resulted in Cre variants capable of recombining a substrate with nearly 50% of the nucleotides altered compared to LoxP. We successfully used one of these variants to integrate exogenous DNA into the genome of unmodified human cells.",
                        "A Cre deletion-dependent Accessory Plasmid (AP) was generated (FIG. 2). Expression of the essential phage gene III (gIII) encoding the envelope protein III (pIII) is prevented by the strong transcriptional terminator rrnBT1, which is flanked by two Cre recombinase target sequences (LoxP sites). To lower background expression, the deletion cassette was placed internal to the gIII-encoding sequence. Recombination by Cre results in a deletion of the rrnBT1 terminator and thus to expression of gIII. Cells harboring the native AP do not express a functional gIII, and thus do not support the production of infectious phage particles. Upon Cre-mediated recombination, resulting in the deletion of the terminator, a functional gIII is reconstituted, thus enabling phage propagation.",
                        "In order to enable the evolution of recombinases based on the integration of two nucleic acid constructs comprising altered LoxP sites, a selection system was developed that comprises two cassettes, which, in their original state, do not confer expression of gIII to the host cells, but require integration via recombinase activity to reconstitute a functional expression construct encoding gIII (FIG. 2, lower panel). This selection strategy is useful for selecting recombinase activity based on the integration of two nucleic acid cassettes. The schematic in the lower panel of FIG. 2 shows two exemplary cassettes. Integration of these two constructs reconstitutes an intact gIII—identical to the gene product resulting from recombining the plasmid in the upper panel of FIG. 2. The selection stringency can be tuned by choosing high or low copy origins for either plasmids, as well as altering the promoter or ribosomal binding site strength on the upstream plasmid.",
                        "In order to validate the selection strategy, a PACE experiment was performed with host cells harboring a recombinase-deletion-dependent AP as outlined in the upper panel of FIG2 with native LoxP sites and a selection phagemid encoding Cre (positive control). FIG. 3 shows that the Cre-selection phagemid propagated within the host cell population and could be retrieved from the lagoon. A second PACE experiment was performed with a selection phagemid encoding T7 RNA polymerase (negative control). The T7RNAP selection phagemid did not propagate and could not be retrieved from the lagoon. In order to test whether the PACE setup with the Cre deletion-dependent AP was able to enrich selection phagemid encoding a recombinase having the desired activity from a pool of phagemids with an excess of inactive members, a mixture of (active) Cre-encoding selection phagemid and (inactive) T7RNAP phagemid at a ratio of 1:1×106 was used in a third PACE experiment. As shown in FIG. 3, the PACE set up was able to enrich for Cre-SP within 12 hours.",
                        "In order to test whether inactive Cre proteins could be evolved to recognize the native LoxP site, a PACE experiment starting with the catalytically inactive K201N Cre mutant was carried out. The experiment included an initial 24 hr period in which the host cells were incubated under mutagenic conditions and gIII was provided from an inducible promoter and thus the selective pressure for functional Cre was removed. This initial period allowed mutagenesis and drift of the phagemid population. After the initial 24 hour period, selective pressure for functional Cre molecules was imposed by removing expression of gIII from the inducible promoter, so that any gIII expression had to be driven off the Cre deletion-dependent AP. FIG. 4 demonstrates that drift and selection can isolate multiple active Cre mutants from a catalytically inactive starting point. The recombinase activity of evolved Cre versions from several phagemid clones retrieved from the lagoon after selection was tested in a luciferase assay and compared to wild-type Cre and K201N Cre. The results demonstrate that multiple active forms of Cre recombinase were retrieved from the lagoon, including four that exhibited a reversion of the K201N mutation back to the wild-type K residue, and two that contained an activating N201D mutation.",
                        "As an evolutionary goal, a site present in the human Rosa26 locus was chosen. The Rosa 26 locus is considered a ‘genomic safe harbor’ locus that does not encode a protein, and allows transgenes to be inserted non-disruptively. The Rosa 26 locus further allows ubiquitous expression of inserted transgenes. See, e.g., Seidler, B. et al. 2008. Proc. Nat. Acad. Sci. USA 105, 10137. A site with few deviations from the native LoxP site was chosen, especially minimizing changes to important protein-DNA contacts.",
                        "The Rosa26 locus was searched for 34-base pair sequences with the fewest changes relative to the wild-type LoxP sequence using sequencing software. For example, the RosaLoxP7 site, as disclosed in FIG. 5 has 15 mismatches compared to the wild-type LoxP site. An initial list of candidate LoxP-like sites was compiled, and from this list, sites having the fewest substitutions at positions within the LoxP site known to be most important for Cre binding (B. Thyagarajan, Gene 244, 47 (2000). For example, wild-type Cre has been reported to feature a relatively strict requirement that the central dinucleotide (positions 17 and 18 in the LoxP site) be TA, so LoxP-like sites without these two nucleotides in these positions were disregarded as candidates for the initial screen.",
                        "Recombinases natively target sequences that are symmetric except for the core sequence. The target sequence in the Rosa locus, termed RosaLox, was asymmetric, however. To evolve Cre towards the asymmetric RosaLox site, the retargeting evolution strategy was split into left and right arcs, and the required changes in target DNA sequence from wild-type loxP to RosaLox were introduced step by step, as outlined in FIG. 5. The left and right arcs were evolved independently. Left-arc clones were evolved on the 7L1, L2, L3, and L4 substrates, while right-arc clones were evolved on the 7R1, R2, R3, and R4 substrates. The core or spacer region was evolved in parallel in both arcs. For example, the core sequence mutations in 7L1 were mimicked in 7R1, etc. (see FIG. 5, lower panel).",
                        "FIG. 6 illustrates the evolution of recombinases recognizing the L1 intermediate target sequence. Selection was initially started with a wild-type LoxP AP, then with a mix of wild-type LoxP and L1 target sequence APs, and then exclusively with an AP comprising the L1 target sequence. Various evolved clones were identified and their recombinase activity on wild-type LoxP and on L1 target sequences was assessed and compared to wild-type Cre recombinase via a luciferase assay.",
                        "After four rounds of evolution on the left arc, thus reaching evolved clones that could recognize the LF intermediate, the mutant clones exhibited between 12-15 mutations, including 9 converged positions (shown at left in FIG. 7). The mutations were enriched at the site of protein-DNA contacts where the nucleotide had changed (see insert). Several mutations clustered around the catalytic tyrosine. Similar results were obtained from the right arc workflow after reaching the RF intermediate. However, only 3 converged mutations were required for the RF intermediate, indicating a lower barrier to recombining the RF site. It was observed that both LF- and RF-evolved clones retained significant activity on the wild type LoxP site.",
                        "Clones from the LF arc could propagate in PACE on host cells containing the RosaLox AP. Further evolved clones had several new converged mutations, as well as 3-5 commonly mutated positions.",
                        "Using a newly developed mammalian plasmid-based reporter system, it was possible to measure activity on the RosaLox site in transiently transfected HEK293 cells. Recombinase activity results in integration of both constructs to form a functional expression construct encoding YFP (FIG. 8). The bar graph in FIG. 9 shows data from the YFP integration reporter. Improved integration efficiency was observed with altered recombinase target sites, including the invRosa site, which comprises an inverted core.",
                        "A plasmid encoding RosaCre clone (36C6) was co-transfected with a plasmid carrying a RosaLox site and a neomycin resistance cassette. After two weeks of neomycin (G418) selection, only HEK293 cells that had been transfected with both plasmids survived .",
                        "In order to improve the specificity of the evolved recombinase clones, a negative PACE selection strategy was designed, linking unwanted recombinase activity (e.g., recognition of wild-type LoxP target sequences, to the production of the dominant negative pIIIneg (FIG. 10). The selection stringency can be adjusted by using different promoters, or by using an inducible promoter, such as the Tet-inducible promoter, and varying the dose of the inducer (e.g., anhydrotetracycline (ATc), tetracycline (Tc), or doxycycline (dox)). Results of an exemplary negative selection are illustrated in FIG. 11.",
                        "This negative selection system is useful to select against off-target activity and thus create more specific evolved Cre recombinases. In addition, such negative selection strategies can also be used to select against undesirable recombinase activity, e.g., against activity favoring the deletion of integrated genetic material. For example, recombination between the Rosa-Lox site and the invRosa site (having identical left and right half-sites as the Rosa-Lox site, but with an inverted core sequence) results in two non-identical sites, one of which is 7LF and one is 7RF. It is therefore possible, for example, to employ the selection strategies described herein to positively select for recombination between a Rosa-Lox and an invRosa-Lox site (simulating integration of a donor cassette into genomic DNA) and negatively select against recombining the RF and LF sites, simulating the possible reverse reaction (and thus deletion of inserted genomic material). The system could also be used to select for the opposite attributes (e.g., negative selection against integration and positive selection for deletion activity). The flexibility of the negative selection allows for screening out recombinase clones with unwanted activity on virtually any DNA substrate.",
                        "In order to assess the specificity of a recombinase, an in vitro method to measure the specificity of recombinases on randomized substrates in a library screening format was developed (FIG. 12). The PCR products resulting from recombined library members can be sequenced using high-throughput methodology in order to generate a recombinase specificity profile (FIG. 13).",
                        "Described here is one embodiment of a recombinase profiling workflow. Generally, the workflow involves three main steps: extension, recombinase treatment, and exonuclease treatment. The library oligos come in “left” and “right” versions (FIG. 12), and include a partially randomized (79% identity, 7% all other bases) recombinase target, as well as a 3′ hairpin structure. For the extension step, the left and right oligos are separately extended from the hairpin across the randomized portion using Klenow exo(−) DNA polymerase. This unique step allows replication of the randomized portion as a double-stranded oligo, with a hairpin on the left or right side.",
                        "Once the oligos are double stranded, they are valid substrates for a DNA recombinase. The purified recombinase protein (e.g., Cre) is mixed with equal amounts of the left and right library oligos and allowed to react for a given amount of time. Reaction progress can be optimized, for example to stop the recombinase reaction once 25%, 50% or 75% of the substrate has been consumed. The extent of the reaction can be determined using quantitative PCR (qPCR), amplifying with forward and reverse primers which each bind a separate oligo, and thus should only amplify across recombined substrates. The protein source can be commercially obtained or expressed in vitro (e.g., using the NEB PurExpress kit). The mixture is subsequently treated with exonucleases (e.g., T7 exonuclease, Exo 1, Exo 5, RecBCD, RecJ, ExoVIII, Lambda exo, etc.) to remove any unreacted oligos. In this sense, profiling methods described herein, in some embodiments, function as a selection modality for valid recombinase substrates. After exonuclease treatment, the material can be PCR amplified and prepared for high throughput sequencing (HTS) using standard procedures. FIGS. 14 and 15 depict PCR amplification of oligos selected in the presence and absence of Cre and BxB1 integrase, respectively.",
                        "This example describes 4 HTS experiments using Miseq v2 300 kits. Sequence logos were generated by comparing the post-selection abundance of DNA bases at each position in the lox site with the pre-selection (i.e., unreacted) abundance for each position. For example, in FIG. 16A, the canonical base at positions closest to the core are more enriched than the most distal 5 bases. This indicates that changes to the most distal bases are relatively unimportant when determining if a substrate is competent for recombination. Note the core sequence of LoxP site was held constant for these experiments, so no data is shown for the middle 8 bases. The overall specificity score is calculated by subtracting, from the enrichment factor of the correct base, the average of the enrichment of the three incorrect bases. The sequence logo depicted in FIG. 16A has an overall specificity score of 1.38. An alternative modality of presenting sequence logo data is provided in FIG. 23.",
                        "Collecting millions of sequencing reads allows the data to be searched for hidden trends. For example, FIGS. 16B-16J show sequence logos for a subset of sequences that have a mismatch at position 1 and position 34—the first position from the right side. For the first 5 positions (FIGS. 16B-16F), there appears to be very little impact on the specificity score when a mismatch is found. This suggests a similar physical binding mode for all 5 distal bases. Relaxed specificity for the 5 distal bases is taken advantage of in the LE/RE directional recombination scheme, as confirmed by this data. Mutations at positions 6,7, and 9 (FIGS. 16G, 16H, and 16J) seem to have more of an effect on the site, but mutations at position 8 (FIG. 16I) are extremely rare in valid recombinase substrates. This agrees with crystallographic evidence that several residues (FIG. 17) make specific contacts at position 8. Table 1 shows examples of evolved CRE from the literature (e.g., as disclosed in Sarkar, I., Hauber, I., Hauber, J. & Buchholz, F. 2007. Science 316, 1912-5; Karpinski, J. et al. 2016. Nat. Biotechnol., online pre-print; and Santoro, S. W. & Schultz, P. G. 2002. Proc. Natl. Acad. Sci. U. S. A. 99, 4185-90). When these mutants were evolved on substrates with changes at position 8, they all mutated the residues implicated in contacting that position (e.g., position 8).",
                        "Parallel profiling experiments using two evolved Cre mutants, EV36C6 and EV42C4 were performed (FIG. 18). As shown in FIGS. 19-20, the mutants are less specific than Cre for the LoxP oligos, but more specific for the RosaLox oligos than Cre. The profiling also reveals that these two mutants have lost the strong preference at position 8 (FIG. 19), allowing them to recombine RosaLox but also making them more promiscuous. The profiling reveals that, when the substrates of the two mutant Cre's that contain 1 global mismatch are plotted, the mutant Cre's have an exaggerated reliance on binding positions 12 and 13 (FIG. 21), suggesting a unique binding mode for those two bases that has been conserved through our evolutions. Data indicates the exact residues that enforce specificity at nucleotides 12 and 13 are less clear than at position 8.",
                        "The relationship between a DNA-binding protein and its nucleic acid substrate is also investigated using specificity profiling. For example, in some embodiments, the question of how Cre binds its DNA is investigated by systematically mutating all of the residues in Cre that contact the DNA to alanines, and profiling the specificity of each single mutant. In some embodiments, the figure of reported Cre-DNA contacts from crystal structures provided by Buchholz and colleagues (Chem. Rev 2016) is used; most of the mutant residues are changed to alanines and then sequence logos are generated for each. In some embodiments, profiling methods described by the disclosure are used to determine the specificity for relatives of Cre (e.g., Flp, Dre, Tre and Brecl), which have been minimally studied. GinBeta (Barbas NAR 2010), phiC31, and BxB1 of the serine-recombinases can also be studied using profiling methods described by the disclosure.",
                        "Several of the above-noted recombinases (e.g., BxB1, Dre, phiC31, Flp) have been inserted into an SP vector and have been shown to be capable of surviving in PACE (FIG. 22). The selections for each are analogous to that of Cre, with the cognate recombinase target swapped out for LoxP in the APs. The selections were carried out on the wt substrate for each recombinase. However, such recombinases could also be evolved on new substrates.",
                        "The wild-type Cre protein sequence used in the Examples section is provided below:",
                        "The protein comprises an N-terminal unstructured sequence (italicized), an N-terminal domain (bold), and a C-terminal domain (underlined). The catalytic tyrosine 324 (Y324) is boxed.",
                        "Exemplary Mutations for some of the evolved Rosa Cre clones are provided below: Clone ID Mutations EV36C6 M44V, A53E, F142L, G198S, R241G, A249V, R259C, E262A, I306L, I320M EV42C4 M44V, A53E, E69A, A112V, V182I, G198S, A231T, R241Q, A249V, R259C, E262A, I306L, N317T, 1320M",
                        "Other mutations commonly observed amongst evolved RosaCre clones included, without limitation, Y77A, T268A, E262G, R259C/Y/F, D277N, D278N, E266K/G, S152N, R24L, V23F, A285D, D29A, E129D/G.",
                        "The Sequence of the ROSALoxP-7 site is ATCTCATGGTTTA TGCTAAAC TATATGTTGACAT (SEQ ID NO: 4)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "develop PACE selection for altering DNA specificity of Cre recombinase",
                        "generate Cre deletion-dependent Accessory Plasmid (AP)",
                        "design selection system for selecting recombinase activity",
                        "perform PACE experiment with host cells harboring AP",
                        "validate selection strategy using Cre-selection phagemid",
                        "test enrichment of Cre-encoding selection phagemid",
                        "evolve inactive Cre proteins to recognize native LoxP site",
                        "select for recombinases recognizing Rosa26 locus",
                        "design retargeting evolution strategy",
                        "evolve Cre towards asymmetric RosaLox site",
                        "illustrate evolution of recombinases recognizing L1 intermediate target sequence",
                        "assess recombinase activity on wild-type LoxP and L1 target sequences",
                        "identify converged mutations in evolved clones",
                        "observe retention of activity on wild-type LoxP site",
                        "measure activity on RosaLox site in mammalian cells",
                        "design negative PACE selection strategy",
                        "link unwanted recombinase activity to production of dominant negative pIIIneg",
                        "adjust selection stringency using different promoters",
                        "illustrate results of negative selection",
                        "describe in vitro method to measure specificity of recombinases",
                        "develop recombinase profiling workflow",
                        "extend library oligos across randomized portion",
                        "treat with exonucleases to remove unreacted oligos",
                        "PCR amplify and prepare for high-throughput sequencing",
                        "generate sequence logos for post-selection abundance of DNA bases",
                        "calculate overall specificity score",
                        "analyze sequence logos for subset of sequences with mismatch",
                        "observe relaxed specificity for distal bases",
                        "identify residues making specific contacts at position 8",
                        "perform parallel profiling experiments using evolved Cre mutants",
                        "analyze specificity of mutants for LoxP and RosaLox oligos",
                        "observe loss of preference at position 8",
                        "identify unique binding mode for positions 12 and 13",
                        "investigate relationship between DNA-binding protein and nucleic acid substrate",
                        "profile specificity of single mutants of Cre residues contacting DNA",
                        "study specificity of relatives of Cre using profiling methods"
                    ],
                    "num_characters": 18403,
                    "outline_medium": [
                        "develop PACE selection for altering Cre recombinase DNA specificity",
                        "generate Cre deletion-dependent Accessory Plasmid (AP)",
                        "design selection system for recombinase activity based on integration of two nucleic acid cassettes",
                        "validate selection strategy using PACE experiment with host cells harboring AP",
                        "test enrichment of selection phagemid encoding Cre from a pool of phagemids",
                        "evolve inactive Cre proteins to recognize native LoxP site",
                        "choose Rosa26 locus as evolutionary goal",
                        "search for 34-base pair sequences with fewest changes relative to wild-type LoxP sequence",
                        "evolve Cre towards asymmetric RosaLox site using retargeting evolution strategy",
                        "assess recombinase activity on wild-type LoxP and L1 target sequences",
                        "measure activity on RosaLox site in transiently transfected HEK293 cells",
                        "design negative PACE selection strategy to select against off-target activity",
                        "develop in vitro method to measure specificity of recombinases on randomized substrates",
                        "describe recombinase profiling workflow",
                        "analyze sequence logos for a subset of sequences with a mismatch at position 1 and position 34",
                        "perform parallel profiling experiments using two evolved Cre mutants",
                        "investigate relationship between DNA-binding protein and its nucleic acid substrate",
                        "provide exemplary mutations for evolved Rosa Cre clones"
                    ],
                    "outline_short": [
                        "develop PACE selection for altering Cre recombinase DNA specificity",
                        "generate Cre deletion-dependent Accessory Plasmid (AP)",
                        "perform PACE experiments with host cells harboring AP",
                        "validate selection strategy using Cre and T7 RNA polymerase",
                        "evolve Cre towards asymmetric RosaLox site",
                        "develop negative PACE selection strategy to select against off-target activity",
                        "assess specificity of recombinase using in vitro method",
                        "profile recombinase specificity on randomized substrates",
                        "evolve Cre mutants on new substrates using PACE selection"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1.-108. (canceled)",
        "109. A method for evolving a recombinase, the method comprising\n(a) contacting a population of host cells with a population of phage vectors comprising a gene encoding a recombinase and deficient in at least one gene for the generation of infectious phage particles, wherein\n(1) the host cells are amenable to transfer of the phage vector;\n(2) the vector allows for expression of the recombinase in a host cell, can be replicated by the host cell, and the replicated vector can transfer from host cell to host cell;\n(3) the host cells express a gene product encoded by the at least one gene for the generation of infectious phage particles of (a) in response to the recombination of a recombinase target sequence by the recombinase, and the level of gene product expression depends on the activity of the recombinase towards the target sequence;\n\n(b) incubating the population of host cells under conditions allowing for mutation of the gene encoding the recombinase and the transfer of the phage vectors from host cell to host cell, wherein host cells are removed from the host cell population, and the population of host cells is replenished with fresh host cells that do not harbor the phage vector;\n(c) isolating a replicated phage vector from the host cell population in (b), wherein the replicated vector comprises a mutated version of the gene encoding the recombinase.",
        "110. The method of claim 109,wherein the host cells harbor an expression construct comprising a nucleotide sequence encoding a gene product of the at least one gene for the generation of infectious phage particles of (a) under the control of a heterologous promoter and a transcriptional terminator flanked by two recombinase target sequences.",
        "111. The method of claim 110, wherein the recombinase target sequences are different from the target sequences recognized by the wild-type version of the recombinase.",
        "112. The method of claim 110, wherein recombination of the recombinase target sequences results in excision of the transcriptional terminator and expression of the at least one gene for the generation of infectious phage particles.",
        "113. The method of claim 109, wherein the recombinase is a Cre recombinase.",
        "114. The method of claim 109, wherein the replicated vector isolated in (c) encodes a mutated recombinase that cleaves the recombinase target sequence with higher efficiency than the version of the recombinase of (a).",
        "115. The method of claim 109, wherein the recombinase target sequence comprises a sequence occurring in the Rosa 26 locus of the target cell.",
        "116. The method of claim 109, wherein the recombinase target sequence comprises a sequence occurring in a genomic locus that is expressed only in cells associated with a disease or disorder.",
        "117. The method of claim 109, wherein the phage vector is a filamentous phage.",
        "118. The method of claim 117, wherein the phage vector is an M13 phage, an fl phage, or an fd phage.",
        "119. The method of claim 109, wherein the at least one gene for the generation of infectious phage particles comprises a sequence encoding a pIII protein.",
        "120. The method of claim 109, wherein the host cells comprise an accessory plasmid, and together the phage vector of (a) and the accessory plasmid comprise all genes required for the generation of an infectious phage.",
        "121. The method of claim 109, wherein the method further comprises a negative selection for undesired recombinase activity.",
        "122. The method of claim 121, wherein the host cells comprise an expression construct encoding a dominant-negative pIII protein (pIII-neg), and wherein the expression of the pIII-neg protein depends on the undesired recombinase activity.",
        "123. The method of claim 122, wherein expression of the pIII-neg protein is activated by recombination of undesired recombinase target sequences flanking a transcriptional terminator within the expression construct encoding the pIII-neg protein.",
        "124. The method of claim 109, wherein the host cells further comprise a mutagenesis plasmid.",
        "125. A recombinase generated by the method of claim 109.",
        "126. The recombinase of claim 125, wherein the recombinase target sequences are different from the target sequences recognized by the wild-type version of the recombinase.",
        "127. The recombinase of claim 125, wherein recombination of the recombinase target sequences results in excision of the transcriptional terminator and expression of the at least one gene for the generation of infectious phage particles.",
        "128. The recombinase of claim 125, wherein the recombinase is a Cre recombinase."
    ]
}