{
    "id": "US20230273077",
    "authors": [
        "Ramathasan Thevamaran",
        "Jizhe Cai",
        "Tsampikos Kottos",
        "Fred Ellis",
        "Rodion Kononchuk"
    ],
    "title": "ELECTROMECHANICAL FORCE SENSOR BASED ON EXTREMA DEGENERACY POINT WITH NONLINEAR RESPONSE",
    "date": "2022-02-25 00:00:00",
    "abstract": "One or more computing devices, systems, and/or methods are provided. In an example, a method includes tuning a sensor comprising a first resonator having an effective gain, a second resonator having an effective loss, and a coupling circuit connected between the first resonator and the second resonator at an extrema degeneracy point with a nonlinear response to a force applied to the sensor. At least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of the force. The method comprises injecting an input signal into one of the first resonator or the second resonator, receiving an output signal from one of the first resonator or the second resonator, and determining a magnitude of a force based on a difference between a first frequency extrema point and a second frequency extrema point in the output signal.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This invention was made with government support under 1925530 and 1925543 awarded by the National Science Foundation and under N00014-19-1-2480 awarded by the NAVY/ONR. The government has certain rights in the invention."
            ],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Force sensors, such as accelerometers, inclinometers, vibrometers, gyroscopes, or other force sensors, are employed in various applications, such as avionics, automobiles, industrial machinery, electronic devices, or other situations. Increasing the sensitivity of a sensor may also increase the noise registered by the sensor."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce force sensors"
                    ],
                    "num_characters": 327,
                    "outline_medium": [
                        "introduce force sensors"
                    ],
                    "outline_short": [
                        "introduce force sensors"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key factors or essential features of the claimed subject matter, nor is it intended to be used to limit the scope of the claimed subject matter.",
                        "In an embodiment of the techniques presented herein, a sensor is provided. The sensor comprises a first resonator having an effective gain, a second resonator having an effective loss, a coupling circuit connected between the first resonator and the second resonator, and a processing unit. At least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of a force applied to the variable capacitor. The processing unit is configured to tune the first resonator and the second resonator at an extrema degeneracy point with a nonlinear response to the force, inject an input signal into the first resonator or the second resonator after tuning the first resonator and the second resonator at the extrema degeneracy point, receive an output signal from the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point, and determine a magnitude of the force based on a difference between the first frequency extrema point and the second frequency extrema point.",
                        "In an embodiment of the techniques presented herein, a method comprises tuning a sensor comprising a first resonator having an effective gain, a second resonator having an effective loss, and a coupling circuit connected between the first resonator and the second resonator at an extrema degeneracy point with a nonlinear response to a force applied to the sensor. At least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of the force. The method comprises injecting an input signal into one of the first resonator or the second resonator after tuning the sensor at the extrema degeneracy point, receiving an output signal from one of the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point, and determining a magnitude of a force based on a difference between the first frequency extrema point and the second frequency extrema point.",
                        "In an embodiment of the techniques presented herein, a non-transitory computer-readable medium stores operations that when executed by a processing unit cause the processing unit to tune a sensor comprising a first resonator, a second resonator, and a coupling circuit connected between the first resonator and the second resonator at an extrema degeneracy point with a nonlinear response to a force applied to the sensor. At least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of the force. The operations cause the processing unit to inject an input signal into one of the first resonator or the second resonator after tuning the sensor at the degeneracy point, receive an output signal from one of the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point, and determine a magnitude of the force based on a difference between the first frequency extrema point and the second extrema point.",
                        "To the accomplishment of the foregoing and related ends, the following description and annexed drawings set forth certain illustrative aspects and implementations. These are indicative of but a few of the various ways in which one or more aspects may be employed. Other aspects, advantages, and novel features of the disclosure will become apparent from the following detailed description when considered in conjunction with the annexed drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce sensor embodiment",
                        "describe sensor components",
                        "explain tuning and signal injection",
                        "describe output signal and force determination",
                        "introduce method embodiment",
                        "describe method steps",
                        "introduce non-transitory computer-readable medium embodiment",
                        "describe stored operations"
                    ],
                    "num_characters": 4015,
                    "outline_medium": [
                        "introduce sensor embodiment",
                        "describe sensor operation",
                        "introduce method embodiment",
                        "introduce computer-readable medium embodiment"
                    ],
                    "outline_short": [
                        "introduce sensor embodiment",
                        "introduce method and computer-readable medium embodiments"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The claimed subject matter is now described with reference to the drawings, wherein like reference numerals are used to refer to like elements throughout. In the following description, for purposes of explanation, numerous specific details are set forth in order to provide a thorough understanding of the claimed subject matter. It may be evident, however, that the claimed subject matter may be practiced without these specific details. In other instances, well-known structures and devices are shown in block diagram form in order to facilitate describing the claimed subject matter.",
                        "It is to be understood that the following description of embodiments is not to be taken in a limiting sense. The scope of the present disclosure is not intended to be limited by the embodiments described hereinafter or by the drawings, which are taken to be illustrative only. The drawings are to be regarded as being schematic representations and elements illustrated in the drawings are not necessarily shown to scale. Rather, the various elements are represented such that their function and general purpose become apparent to a person skilled in the art.",
                        "All numerical values within the detailed description and the claims herein are modified by “about” or “approximately” the indicated value, and take into account experimental error and variations that would be expected by a person having ordinary skill in the art.",
                        "FIG. 1 is a diagram illustrating a sensor 100, in accordance with some embodiments. The sensor 100 comprises a first resonator 102A coupled to a second resonator 102B by a coupling circuit 104. The coupling circuit 104 may comprise a capacitor (as shown in FIG. 1), an inductor, or a capacitor and an inductor. A first capacitor 106 is coupled to the first resonator 102A, and a capacitor 108 is coupled to the second resonator 102B. In some embodiments, the resonators 102A, 102B, the coupling circuit 104, and the capacitors 106, 108 define a transmission line 109. The first resonator 102A comprises an effective inductance 110A, an effective negative gain unit 112A, and an effective capacitance 114A. The second resonator 102B comprises an effective inductance 1108, an effective positive gain unit 1128, and an effective capacitance 1148. The effective devices 110A, 1108, 112A, 1128, 114A, 114B may comprise additional circuit elements that combine to create the values of the effective devices 110A, 1108, 112A, 1128, 114A, 114B within the resonators 102A, 102B. In some embodiments, the gain units 112A, 1128 are implemented using operational amplifiers.",
                        "In some embodiments, a processing unit 116 is coupled to the transmission line 109. The processing unit 116 injects an input signal into the transmission line 109 and measures an output signal resulting from the input signal. At least one of the resonators 102A, 102B, or the coupling circuit comprises a variable capacitor that is sensitive to a force 118 applied to the sensor 100. The processing unit 116 measures the applied force based on the output signal. In some embodiments, the output signal is a signal exiting the transmission line 109 from the opposite end that received the input signal. In some embodiments, the output signal is a reflectance signal that is measured on the same end of the transmission line 109 that received the input signal.",
                        "FIGS. 2 and 3 are diagrams of a uni-directional variable capacitor 200, in accordance with some embodiments. The variable capacitor 200 comprises stationary members 202, 204 mounted to a base 205 and connected to a body member 206 by one or more springs 208 that allow movement of the body member 206 in the direction of the applied force 118. A stationary member 210 is mounted to the base 205 adjacent the body member 206. A sensing unit 212 of the variable capacitor 200 comprises a first dielectric layer 214 over the body member 206 and a first conductive plate 216 over the first dielectric layer 214. A second dielectric layer 218 is over the stationary member 210 and a second conductive plate 220 is over the second dielectric layer 218. In some embodiments, the stationary members 202, 204, 210, and the body member 206 comprise copper, or some other conductive material. In some embodiments, the dielectric layers 214, 218 comprise glass or some other dielectric material. In some embodiments, the conductive plates 216, 220 comprise gold or some other conductive material. In some embodiments, the conductive plates 216, 220 are spaced apart, such as by an air gap. A flexible dielectric material may be provided between the conductive plates 216, 220 that allows relative movement between the conductive plates 216, 220. The spacing between the conductive plates 216, 220 affects the capacitance of the sensing unit 212. The force 118 applied to the variable capacitor 200 changes the spacing between the conductive plates 216, 220 due to movement of the body member 206 relative to the stationary members 202, 204, 210 as allowed by the springs 208. The springs 208 return the body member 206 to its initial state when the force 118 is no longer present. Other structures and configurations of the variable capacitor 200 and the sensing unit 212 are within the scope of the present disclosure.",
                        "FIG. 4 is a diagram of the processing unit 116 of the sensor, in accordance with some embodiments. In some embodiments, the processing unit 116 comprises a bus 402, a processor 404, a memory 406 that stores software instructions or operations, an input device 408, an output device 410, a communication interface 412, and a power source 414, such as a battery. The processing unit 116 may include fewer components, additional components, different components, and/or a different arrangement of components than those illustrated in FIG. 4.",
                        "According to some embodiments, the bus 402 includes a path that permits communication among the components of the processing unit 116. For example, the bus 402 may include a system bus, an address bus, a data bus, and/or a control bus. The bus 402 may also include bus drivers, bus arbiters, bus interfaces, clocks, and so forth. The processor 404 includes one or multiple processors, microprocessors, data processors, co-processors, application specific integrated circuits (ASICs), controllers, programmable logic devices, chipsets, field-programmable gate arrays (FPGAs), application specific instruction-set processors (ASIPs), system-on-chips (SoCs), central processing units (CPUs) (e.g., one or multiple cores), microcontrollers, and/or some other type of component that interprets and/or executes instructions and/or data. The processor 404 may be implemented as hardware (e.g., a microprocessor, etc.), a combination of hardware and software (e.g., a SoC, an ASIC, etc.), may include one or multiple memories (e.g., cache, etc.), etc.",
                        "In some embodiments, the processor 404 controls the overall operation or a portion of the operation(s) performed by the sensor 100. The processor 404 performs one or multiple operations based on an operating system and/or various applications or computer programs (e.g., software). The processor 404 accesses instructions from the memory 406, from other components of the processing unit 116, and/or from a source external to the sensor 100 (e.g., a network, another device, etc.). The processor 404 may perform an operation and/or a process based on various techniques including, for example, multithreading, parallel processing, pipelining, interleaving, etc.",
                        "In some embodiments, the memory 406 includes one or multiple memories and/or one or multiple other types of storage mediums. For example, the memory 406 may include one or multiple types of memories, such as, random access memory (RAM), dynamic random access memory (DRAM), cache, read only memory (ROM), a programmable read only memory (PROM), a static random access memory (SRAM), a single in-line memory module (SIMM), a dual in-line memory module (DIMM), a flash memory, and/or some other suitable type of memory. The memory 406 may include a hard disk, a magnetic disk, an optical disk, a magneto-optic disk, a solid state disk, a Micro-Electromechanical System (MEMS)-based storage medium, a nanotechnology-based storage medium, and/or some other suitable disk. The memory 406 may include drives for reading from and writing to the storage medium. The memory 406 may be external to and/or removable from sensor 100, such as, for example, a Universal Serial Bus (USB) memory stick, a dongle, a hard disk, mass storage, off-line storage, or some other type of storing medium (e.g., a compact disk (CD), a digital versatile disk (DVD), a Blu-Ray disk (BD), etc.). The memory 406 may store data, software, and/or instructions related to the operation of the sensor 100.",
                        "The communication interface 412 permits the sensor 100 to communicate with other devices, networks, systems, sensors, and/or the like on a network. The communication interface 412 may include one or multiple wireless interfaces and/or wired interfaces. For example, the communication interface 412 may include one or multiple transmitters and receivers, or transceivers. The communication interface 412 may operate according to a protocol stack and a communication standard. In some embodiments, the communication interface 412 includes an antenna. The communication interface 412 may include various processing logic or circuitry (e.g., multiplexing/de-multiplexing, filtering, amplifying, converting, error correction, etc.). In some embodiments, the communication interface 412 operates using a long range wireless protocol, such as a cellular protocol or a WiFi protocol, a short range protocol, such as BLUETOOTH™, or a wired protocol, such as Ethernet.",
                        "In some embodiments, the input device 408 permits an input into the sensor 100. For example, the input device 408 may comprise a keyboard, a mouse, a display, a touchscreen, a touchless screen, a button, a switch, an input port, speech recognition logic, and/or some other type of suitable visual, auditory, or tactile input component. The output device 410 permits an output from the sensor 100. For example, the output device 410 may include a speaker, a display, a touchscreen, a touchless screen, a projected display, a light, an output port, and/or some other type of suitable visual, auditory, or tactile output component.",
                        "In some embodiments, the processing unit 116 executes a tuning application 416 that allows automatic or user-guided tuning of the sensor 100, such as adjusting one or more of the effective values of the resonators 102A, 102B or the coupling circuit 104, and a sensing application 418 that facilitates sensor measurements. For example, the sensing application 418 may control the injecting of the input signal and the measuring of the force 118 based on the output signal.",
                        "The sensor 100 operates on the principle of an exceptional point. A exceptional point (EP) is a non-Hermitian spectral degeneracy where both eigenvalues and their corresponding eigenvectors coalesce. Operation near an EP increases the responsivity of the sensor 100 due to the abrupt resonant detuning occurring in the proximity to the EP. The sensor 100 implements an EP-based parity time () symmetric electromechanical sensor that suppresses enhanced technical noise by enhanced responsivity to applied accelerations. The fundamental noise is mitigated by exploiting the detuning from an extrema degeneracy point with a nonlinear response to the force. The extrema degeneracy point may be a transmission peak degeneracy (TPD) when the output signal is a transmission signal. The degeneracy point may be a reflectance peak degeneracy (RPD) or a reflectance deep degeneracy (RDD) when the output signal is a reflectance signal. For ease of illustration, the following example discusses a TPD. A TPD forms when the sensor 100 is weakly coupled to the transmission line 109 as a sensitivity measurant. The TPD occurs at a particular frequency and controlled parameters for which the bi-orthogonal eigenbasis is still complete and are distinct from the EP.",
                        "EPs are spectral degeneracies occurring in the parameter space of an open (non-Hermitian) system where two N=2 (or more) eigenfrequencies and their corresponding eigenvectors coalesce. An EP induces a sublinear detuning of the resonant frequencies from the EP degeneracy when the system interacts with a perturbing agent, such as an applied force. Specifically, in the proximity of an N-th order EP, the degenerate resonances abide to Puiseux generalized expansions leading to a resonance detuning Δf≡|f−fEP| that follows a nonlinear behavior, such as an N-th root behavior Δf˜ϵ1/N with respect to the perturbation strength ϵ imposed to the system by the presence of the perturbing agent, for example, the applied force. In the small perturbation limit, this sublinear response provides an enhanced sensing as compared to a linear response (Δf˜ϵ<<ϵ1/N) in a sensing scheme that relies on Hermitian degeneracies.",
                        "The sensor 100 operates based on the distinction between EP and the TPDs observed in the transmission spectrum observed after interrogation via a weakly coupled transmission line 109. The corresponding differential transmission peaks detuning Δf from the TPD follows a square-root behavior with respect to the applied force 118, a, and has a detune rate slightly larger than the rate appearing in the resonant modes detuning near EPs. While the TPD is a consequence of the underlying EP, it occurs at different parameter values of the sensor 100 where the eigenbasis is still complete; thus the performance of the sensor is not influenced by excess noise effects that are rooted to the eigenbasis collapse. However, at the proximity of the TPD, the Peterman Factor (PF) remains finite and smaller than a sensitivity enhancement factor (SEF) of the sensor measuring the responsivity of the sensor 100 to acceleration variations. It has been determined theoretically that the PF is directly proportional to the technical noise due to the coupling with the transmission line and the noise generated by the gain/loss elements used to create the EP-singularity. Corresponding noise enhancement factors describing the noise power enhancements remain finite in the proximity of the TPD and are surpassed by the SEF of the transmission peaks detuning near the TPD.",
                        "Referring to FIG. 1, the resonators 102A, 102B are capacitively coupled,  symmetric RLC resonators with a natural frequency,",
                        "\\(f_{0} = {{\\frac{1}{2\\pi}\\frac{1}{\\sqrt{LC}}} \\approx {2.68{MHz}}}\\)",
                        "and capacitive coupling Cc provided by the coupling circuit 104. The PT-symmetry condition is achieved when the gain of the negative gain unit 112A, −R, and the gain of the positive gain unit 1128, +R, are delicately balanced, and the reactive components provided by the effective inductors 110A, 1108 and the effective capacitors 114A, 1148 satisfy mirror symmetry, where the impedances of the active and passive circuit tanks, multiplied by i, are complex conjugates of each other at the frequency of interest.",
                        "When the capacitive coupling is above a critical value CcEP, the system is in so-called exact phase where the corresponding normal modes are also eigenvectors of the -symmetric operator. In the opposite limit (small coupling) the system is in the broken phase where the normal modes are no longer eigenmodes of the  symmetric operator. In the latter case, the eigenfrequencies appear as a complex conjugate pair, while in the former domain they are real-valued. The two phases are separated by an EP singularity of order=2. The resonators 102A, 102B are coupled to the transmission line 109 by the capacitors 106, 108 having capacitances, Ce.",
                        "FIG. 5 is a diagram illustrating a density plot of the measured normalized transmittance spectrum as a function of acceleration, a, in accordance with some embodiments. In the density plot shown in FIG. 5, the measured (normalized) transmittance spectrum, T(f; a), versus the applied differential in-plane acceleration, a, is shown. At a=0, the transmission spectrum demonstrates a transmission peak degeneracy (TPD) which reflects the nearby EP degeneracy of the eigenfrequencies of the isolated system (corresponding to Ce=0). The system is initially set at TPD conditions with the conductive plates 216, 220 of the sensing unit 212 being at a distance d≈20 μm from one another corresponding to CcTPD≈50 pF. As the applied differential in-plane acceleration, a, increases, the capacitive coupling detunes from its equilibrium value, CcTPD, due to a displacement of the body member 206 to a new equilibrium position. The working principle of the sensor 100 relies on detecting concomitant transmission peak shifts from the TPD due to the capacitive coupling detuning from CcTPD. The transmittance develops two equihight peaks which bifurcate from the TPD following a characteristic square-root behavior, as indicated by the line 502, evaluated using a coupled mode theory, expected from the Puiseux expansion of resonance frequencies around an EP represented by the line 504.",
                        "To tune the sensor 100 to operate along the line 502 the following set of conditions is satisfied:",
                        "\\(\\left\\{ {\\begin{matrix}\n{\\omega_{1} = {\\omega_{2} \\equiv \\omega_{0}}} \\\\\n{\\gamma_{e_{1}} = {\\gamma_{e2} \\equiv \\gamma_{e}}} \\\\\n{\\gamma_{1} = {\\gamma_{2} \\equiv \\gamma_{0}}} \\\\\n{\\gamma_{0} > \\gamma_{e}}\n\\end{matrix}.} \\right.\\)",
                        "where the resonant frequencies of the resonators 102A, 102B are:",
                        "\\({\\omega_{1} = {{\\sqrt{\\frac{1}{L_{1}C_{1}}}{and}\\omega_{2}} = \\sqrt{\\frac{1}{L_{2}C_{2}}}}},\\)",
                        "the gain of the first resonator 102A is:",
                        "\\({\\gamma_{1} = {\\frac{1}{R_{1}}\\sqrt{\\frac{L_{1}}{C_{1}}}a}},\\)",
                        "and\n\nthe loss of the second resonator 102B is:",
                        "\\(\\gamma_{2} = {\\frac{1}{R_{2}}{\\sqrt{\\frac{L_{2}}{C_{2}}}.}}\\)",
                        "Coupling strength parameters to the left and right portions of the transmission line 109 are:",
                        "\\({\\gamma_{e1} = {Z_{0}\\sqrt{\\frac{C_{1}}{L_{1}}}\\frac{C_{e}^{2}}{C_{1}^{2}}{and}}}{{\\gamma_{e2} = {Z_{0}\\sqrt{\\frac{C_{2}}{L_{2}}}\\frac{C_{e}^{2}}{C_{2}^{2}}}},}\\)",
                        "where Z0 is the impedance of the transmission line 109.",
                        "The above set conditions can be rewritten as:",
                        "\\(\\left\\{ {\\begin{matrix}\n{L_{2} = {L_{2} \\equiv L}} \\\\\n{C_{1} = {C_{2} \\equiv C}} \\\\\n{R_{1} = {R_{2} \\equiv R}} \\\\\n{C_{e1} = {C_{e2} \\equiv C_{e}}} \\\\\n{\\frac{1}{R} > \\frac{Z_{0}C_{e}^{2}}{LC}}\n\\end{matrix}.} \\right.\\)",
                        "Coalescence of the line 502 takes place when:",
                        "\\(\\frac{C_{c}}{C} = {\\sqrt{\\gamma_{0}^{2} + \\gamma_{e}^{2}} = {\\sqrt{{\\frac{1}{R^{2}}\\frac{L}{C}} + {Z_{0}^{2}\\frac{C_{e}^{4}}{{LC}^{3}}}}.}}\\)",
                        "FIGS. 6A and B are diagrams illustrating the response of the sensor 100 for a particular applied acceleration, in accordance with some embodiments. FIG. 6A is a curve 600 illustrating the response for a transmission peak degeneracy where the output signal is measured at the end of the transmission line 109 opposite the end that the input signal was applied. The difference between the frequency peaks 602A, 604A is related to the applied force. Note that a reflectance peak curve generated where the output signal is a reflectance signal is similar to the transmission peak curve of FIG. 6A. FIG. 6B is a curve 600B illustrating the response for a reflectance deep degeneracy where the output signal is measured at the same end of the transmission line 109 as the end that the input signal was applied. The difference between the frequency deeps 602B, 604B is related to the applied force.",
                        "The weak coupling with the transmission line 109, together with the active nature of the sensor 100, are reflected in the high intensity value of the transmittance peaks and in the narrow form of the linewidths (see confined dark area 506). These attributes enhance the readout and boost the sensing resolution, allowing identification of the trajectories of the transmission peaks. The area 508 indicates the displacement values of the conductive plates 216, 220 of the sensing unit 212 for which the transmission peaks acquire extremely large values triggering saturable nonlinearities.",
                        "The measurements are illustrated based on a theoretical analysis using the framework of coupled mode theory (CMT), which was appropriately mapped to describe the -symmetric circuit of the sensor 100. Specifically, the scattering matrix S that describes the open circuit, takes the form:",
                        "S=−I−iwG(f)WT;G(f)=(Heff−fI)−1",
                        "where, I is the two-dimensional identity matrix and G(f) is the Green's function. The effective Hamiltonian Heff that describes the PT-symmetric dimer coupled to the transmission lines is:",
                        "\\({H_{eff} = {H_{0} - {\\frac{i}{2}W^{T}W}}};{H_{0} = \\begin{pmatrix}\n{f_{0} - \\epsilon + {i\\gamma_{0}}} & {\\gamma_{0} + \\epsilon} \\\\\n{\\gamma_{0} + \\epsilon} & {f_{0} - \\epsilon - {i\\gamma_{0}}}\n\\end{pmatrix}};\\)",
                        "where the diagonal matrix Wnm=δnm√{square root over (2γe)} models the coupling of the dimer with the transmission lines and H0 is the Hamiltonian of the isolated dimer (corresponding to γe=0). For ϵ=ϵEP=0 the isolated system forms a second order (N=2) EP degeneracy at frequency f±(0)≡fEP=f0.",
                        "The transmittance is:",
                        "(f;a)=|S21|2.",
                        "By direct comparison with experimental data various parameters were determined for use in modeling the system. An estimate of the linewidth broadening of the resonances of the individual circuit tank, due to its coupling with the transmission line is",
                        "\\({\\gamma_{e} \\equiv {Z_{0}\\sqrt{\\frac{C}{L}}\\left( \\frac{C_{e}}{C} \\right)^{2}f_{0}}} = {0.0206{{MHz}.}}\\)",
                        "Similarly, the variations at the coupling strength between the two resonant modes of the dimer, due to the displacement of the conductive plates 216, 220 of the sensing unit 212, when an acceleration a is imposed on the system, can be modeled by the parameter ϵ(a)=ϵTPD+0.0082 [MHz/g]·a. The coupling strength in the absence of any acceleration is ϵTPD=0.0013 MHz—and is associated with the TPD. Finally, γ0=R−1√{square root over (L/C)}f0=0.16 MHz, is the gain/loss parameter describing the gain units 112A, 112B used in the -symmetric circuit.",
                        "The frequencies f±(ϵ) of the transmittance peaks, represented by the line 502 take the form:",
                        "\\({f_{\\pm}(\\epsilon)} = \\left\\{ \\begin{matrix}\n{{f_{0} - {\\epsilon \\pm \\sqrt{{2\\gamma_{0}\\epsilon} + \\epsilon^{2} - \\gamma_{e}^{2}}}},} & {{{for}\\epsilon} \\geq \\epsilon_{TPD}} \\\\\n{{f_{0} - \\epsilon},} & {{{for}\\epsilon} \\leq \\epsilon_{TPD}}\n\\end{matrix} \\right.\\)",
                        "where ϵTPD=−γ0+√{square root over (γ02+γe2)}≠ϵEP. It was observed that",
                        "\\({{\\epsilon_{TPD} \\approx \\frac{\\gamma_{e}^{2}}{2\\gamma_{0}}}\\underset{\\gamma_{e}\\rightarrow 0}{\\rightarrow}\\epsilon_{EP}} = 0\\)",
                        "as expected. Accordingly, the TPD frequency is",
                        "\\({f_{TPD} \\equiv {f\\left( {\\epsilon = \\epsilon_{TPD}} \\right)}} = {f_{-} = {f_{+} = {{{f_{0} - \\epsilon_{TPD}}\\underset{\\gamma_{e}\\rightarrow 0}{\\rightarrow}f_{EP}} = {f_{0}.}}}}\\)",
                        "Furthermore, at the vicinity of ϵTPD the transmission peaks scale as:",
                        "\\({f_{\\pm} \\propto {f_{TPD} \\pm {{\\sqrt{2}}^{4}\\sqrt{\\gamma_{0}^{2} + \\gamma_{e}^{2}}\\sqrt{\\delta\\epsilon}}}};{{provided}{that}\\delta\\epsilon{{2\\sqrt{\\gamma_{0}^{2} + \\gamma_{e}^{2}}}}}\\)",
                        "where δϵ≡ϵ−ϵTPD. The above square-root transmission peak splitting for small δϵ is a direct consequence of the presence of the EP degeneracies of the eigenfrequencies f±(0) of the isolated system (e.g. γe=0). The latter, can be evaluated by direct diagonalization of H0, see Eq. and their functional dependence on ϵ is given by Eqs. by substituting γe=0. It is interesting to point out that the presence of ye results in a slight enhancement of the detuning rate of f± as compared to the detuning rate of the resonant modes f±(0).",
                        "To provide stability for the sensor 100, the lasing condition of the open circuit was determined. The stability is associated with the real poles of the scattering matrix occurring at:",
                        "fL=f0−ϵL",
                        "where,",
                        "ϵL=−γ0+√{square root over (γ02−γe2)}<ϵEP=0<ϵTPD.",
                        "At the lasing point (ϵ→ϵL)→∞. The divergence is characterized by a (ϵ)∝(ϵ−ϵL)−2 [∝(ϵ−ϵL)−1] scaling, which applies in the range ϵ<ϵTPD [ϵ>ϵTPD.",
                        "An enhanced transmitted intensity improves readability of the output signal and the identification of the transmission resonances. The sensing resolution is also an important factor. The sensing resolution is proportional to the linewidth F of the transmission peaks. In the limit of very strong coupling ϵ>>γ0, the  nature of the sensor 100 can be ignored and the linewidth Γ will be dictated by the coupling of the dimer with the transmission line 109. The linewidth Γ is characterized by the coupling constant ye which, in the present example, takes the value γe≈0.02 MHz. At the other limiting case of ϵ→ϵL a narrowing of the linewidth is expected. Although Γ(ϵ) remains essentially constant Γ(ϵ)≈γe at the parameter range of the present example, a slight increase is identified in the proximity of ϵTPD. Specifically, for δϵ≡ϵ−ϵTPD≥0 the linewidth takes the form τ(δϵ→0)˜√{square root over (2)}γe−√{square root over (2)}(γe2γ02)1/4 √{square root over (δϵ)}. For δϵ=0, ϵ(δϵ=0)=√{square root over (2)}γe indicating that the coupling of the circuit with the leads dictates the minimum measured uncertainty. On the other side of ϵTPD i.e. δϵ<0 the linewidth behaves as",
                        "\\({\\Gamma(\\epsilon)} \\approx {\\frac{{\\sqrt{2}\\gamma_{e}} + \\sqrt{2\\left( {\\gamma_{e}^{2} + \\gamma_{0}^{2}} \\right)}}{\\gamma_{e}}\\delta{\\epsilon.}}\\)",
                        "This small δϵ expansion persists even for ϵ≈ϵEP where Γ(ϵ=ϵEP)≈0.7γe. From this analysis, it is apparent that the uncertainty in the frequency splitting measurements in the proximity of the TPD is only slightly enhanced due to the linewidth increase confined to small values when the system operates in the weak coupling regime.",
                        "An advantage obtained by measuring the frequency splitting, since it is intrinsically self-referenced, is that there is no need for an external reference to suppress or eliminate frequency drift associated with other sources. The transmittance peaks splitting in the proximity of the TPD also follows a sublinear square-root behavior with respect to the perturbation 8E. Specifically, Δf≡f+−f−∝√{square root over (δϵ)}, where δϵ is a measurant proportional (√{square root over (δϵ)}∝F) to the applied force, F, or acceleration, a. In case of weak coupling to the transmission line 109, the upper limit of the sublinear sensing is predominantly controlled by γ0. The extent of the sublinear domain in the sensor 100 is bounded by nonlinear capacitance effects occurring at small distances between the conductive plates 216, 220 of the sensing unit.",
                        "To determine the value of applied force or acceleration from the measured frequency splitting, the function:",
                        "Δf(F)=C√{square root over (F)}",
                        "is evaluated to determine the value of the constant C. The constant, C, may be determined performing a calibration procedure on the sensor 100, resulting in the strict correspondence:",
                        "\\({F\\left( {\\Delta f} \\right)} = {\\frac{\\left( {\\Delta f} \\right)^{2}}{C}.}\\)",
                        "The sensor 100 may be applied to a variety of force sensing applications, such as to implement as accelerometers, an inclinometer, a vibrometers, a gyroscope, or another type of force sensor.",
                        "FIG. 7 is a diagram 700 illustrating frequency splitting as a function of applied acceleration, a, in accordance with some embodiments. The curves 702A (linear plot) and 702B (logarithmic plot) show the nonlinear, or sublinear nature of the frequency splitting as a function of acceleration for the sensor 100, while the curves 704A (linear plot) and 704B (logarithmic plot) illustrate frequency splitting for a linear sensor. The sensor 100 demonstrates an order of magnitude enhancement of dynamic range, as compared to a linear sensors with the same upper bound of dynamical range, as represented by the arrow 706.",
                        "FIG. 8 is a diagram 800 illustrating sensitivity as a function of applied acceleration, a, in accordance with some embodiments. The sensitivity of the sensor 100 is given by:",
                        "\\({\\chi\\left( {\\Delta f} \\right)} = {\\frac{\\partial\\left( {\\Delta f/f_{0}} \\right)}{\\partial a}.}\\)",
                        "In FIG. 8, the curves 802A (linear plot) and 802B (logarithmic plot) show the sensitivity of the sensor 100 as a function of acceleration, while the curves 804A (linear plot) and 804B (logarithmic plot) illustrate sensitivity a linear sensor. The sensitivity of the sensor 100 demonstrates an χ˜1/√{square root over (a)} divergence in the proximity of the TPD. The sensor 100 demonstrates an order of magnitude enhancement of sensitivity, as compared to a linear sensors with the same upper bound of dynamical range, as represented by the arrow 806.",
                        "FIG. 9 is a diagram of a bi-directional variable capacitor 900, in accordance with some embodiments. The bi-directional variable capacitor 900 comprises a stationary member 902 adjacent the body member 206 and a second sensing unit 904. The sensing unit 904 comprises a third dielectric layer 906 over the body member 206 and a third conductive plate 908 over the third dielectric layer 906. A fourth dielectric layer 910 is over the stationary member 902 and a fourth conductive plate 912 is over the fourth dielectric layer 910. In some embodiments, the stationary member 902 comprises copper, or some other conductive material. In some embodiments, the dielectric layers 906, 910 comprise glass or some other dielectric material. In some embodiments, the conductive plates 908, 912 comprise gold or some other conductive material. In some embodiments, the conductive plates 908, 912 are spaced apart, such as by an air gap. A flexible dielectric material may be provided between the conductive plates 908, 912 that allows relative movement between the conductive plates 908, 912. The spacing between the conductive plates 908, 912 affects the capacitance of the sensing unit 904. A force 914 applied to the variable capacitor 900 changes the spacing between the conductive plates 216, 220 of the sensing unit 212 and the spacing between the conductive plates 908, 912 of the sensing unit 904 due to movement of the body member 206 relative to the stationary members 202, 204, 210, 902, as allowed by the springs 208. The springs 208 return the body member 206 to its initial state when the force 914 is no longer present. The sensing units 212, 904 facilitate the determination of the direction of the force 914 as well as its magnitude. Other structures and configurations of the variable capacitor 900 and the sensing units 212, 904 are within the scope of the present disclosure.",
                        "FIGS. 10A and 10B are diagrams illustrating a sensor response, in accordance with some embodiments. FIG. 10A is a curve 1000A illustrating the response for a transmission peak degeneracy with a positive force applied to the variable capacitor 900. The difference between the frequencies of the frequency peaks 1002A, 1004A is related to the applied force, and the difference between the amplitudes 1002A, 1004A is related to the direction of the applied force. FIG. 10B is a curve 1000B illustrating the response for a transmission peak degeneracy with a negative force applied to the variable capacitor 900. The difference between the frequencies of the frequency peaks 1002B, 1004B is related to the applied force, and the difference between the amplitudes 10028, 10048 is related to the direction of the applied force. Note that for a positive applied force, the peak 1002A has an amplitude greater than the peak 1004A, and for a negative applied force, the peak 10028 has an amplitude less than the peak 10048.",
                        "FIG. 11 is a diagram illustrating a method for sensing a force, in accordance with some embodiments. At 1102, a sensor comprising a first resonator having an effective gain, a second resonator having an effective loss, and a coupling circuit connected between the first resonator and the second resonator is tuned at an extrema degeneracy point with a non-linear response to the force. At least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor has a capacitance that varies as a function of a force applied to the variable capacitor. At 1104, an input signal is injected into one of the first resonator or the second resonator after the tuning. At 1106, an output signal is received from one of the first resonator or the second resonator. At 1108, a magnitude of the force is determined based on a difference between a first frequency extrema point and a second frequency extrema point of the output signal.",
                        "FIG. 12 illustrates an exemplary embodiment 1200 of a computer-readable medium 1202, in accordance with some embodiments. One or more embodiments involve a computer-readable medium comprising processor-executable instructions configured to implement one or more of the techniques presented herein. The embodiment 1200 comprises a non-transitory computer-readable medium 1202 (e.g., a CD-R, DVD-R, flash drive, a platter of a hard disk drive, etc.), on which is encoded computer-readable data 1204. This computer-readable data 1204 in turn comprises a set of processor-executable computer instructions 1206 that, when executed by a computing device 1208 including a reader 1210 for reading the processor-executable computer instructions 1206 and a processor 1212 for executing the processor-executable computer instructions 1206, are configured to facilitate operations according to one or more of the principles set forth herein. In some embodiments, the processor-executable computer instructions 1206, when executed, are configured to facilitate performance of a method 1214, such as at least some of the aforementioned method(s). In some embodiments, the processor-executable computer instructions 1206, when executed, are configured to facilitate implementation of a system, such as at least some of the one or more aforementioned system(s). Many such computer-readable media may be devised by those of ordinary skill in the art that are configured to operate in accordance with the techniques presented herein.",
                        "The term “computer readable media” may include communication media. Communication media typically embodies computer readable instructions or other data in a “modulated data signal” such as a carrier wafer or other transport mechanism and includes any information delivery media. The term “modulated data signal” may include a signal that has one or more of its characteristics set or changed in such a manner as to encode information in the signal.",
                        "Various operations of embodiments are provided herein. In one embodiment, one or more of the operations described may constitute computer readable instructions stored on one or more computer readable media, which if executed by a computing device, will cause the computing device to perform the operations described. The order in which some or all of the operations are described should not be construed as to imply that these operations are necessarily order dependent. Alternative ordering will be appreciated by one skilled in the art having the benefit of this description. Further, it will be understood that not all operations are necessarily present in each embodiment provided herein.",
                        "Any aspect or design described herein as an “example” is not necessarily to be construed as advantageous over other aspects or designs. Rather, use of the word “example” is intended to present one possible aspect and/or implementation that may pertain to the techniques presented herein. Such examples are not necessary for such techniques or intended to be limiting. Various embodiments of such techniques may include such an example, alone or in combination with other features, and/or may vary and/or omit the illustrated example.",
                        "As used in this application, the term “or” is intended to mean an inclusive “or” rather than an exclusive “or”. That is, unless specified otherwise, or clear from context, “X employs A or B” is intended to mean any of the natural inclusive permutations. That is, if X employs A; X employs B; or X employs both A and B, then “X employs A or B” is satisfied under any of the foregoing instances. In addition, the articles “a” and “an” as used in this application and the appended claims may generally be construed to mean “one or more” unless specified otherwise or clear from context to be directed to a singular form. Also, unless specified otherwise, “first,” “second,” or the like are not intended to imply a temporal aspect, a spatial aspect, an ordering, etc. Rather, such terms are merely used as identifiers, names, etc. for features, elements, items, etc. For example, a first element and a second element generally correspond to element A and element B or two different or two identical elements or the same element.",
                        "Also, although the disclosure has been shown and described with respect to one or more implementations, equivalent alterations and modifications will occur to others skilled in the art based upon a reading and understanding of this specification and the annexed drawings. The disclosure includes all such modifications and alterations and is limited only by the scope of the following claims. In particular regard to the various functions performed by the above described components (e.g., elements, resources, etc.), the terms used to describe such components are intended to correspond, unless otherwise indicated, to any component which performs the specified function of the described component (e.g., that is functionally equivalent), even though not structurally equivalent to the disclosed structure which performs the function in the herein illustrated example implementations of the disclosure. In addition, while a particular feature of the disclosure may have been disclosed with respect to only one of several implementations, such feature may be combined with one or more other features of the other implementations as may be desired and advantageous for any given or particular application. Furthermore, to the extent that the terms “includes”, “having”, “has”, “with”, or variants thereof are used in either the detailed description or the claims, such terms are intended to be inclusive in a manner similar to the term “comprising.”"
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce sensor 100",
                        "describe sensor components",
                        "illustrate sensor 100 diagram",
                        "define transmission line 109",
                        "describe resonators 102A, 102B",
                        "describe effective devices 110A, 1108, 112A, 1128, 114A, 114B",
                        "describe gain units 112A, 1128",
                        "describe processing unit 116",
                        "describe input signal injection",
                        "describe output signal measurement",
                        "illustrate variable capacitor 200 diagram",
                        "describe variable capacitor components",
                        "describe sensing unit 212",
                        "describe conductive plates 216, 220",
                        "describe dielectric layers 214, 218",
                        "describe springs 208",
                        "describe force 118 application",
                        "illustrate processing unit 116 diagram",
                        "describe bus 402",
                        "describe processor 404",
                        "describe memory 406",
                        "describe input device 408",
                        "describe output device 410",
                        "describe communication interface 412",
                        "describe power source 414",
                        "describe tuning application 416",
                        "describe sensing application 418",
                        "introduce exceptional point (EP)",
                        "describe EP-based parity time () symmetric electromechanical sensor",
                        "describe transmission peak degeneracy (TPD)",
                        "describe reflectance peak degeneracy (RPD) and reflectance deep degeneracy (RDD)",
                        "illustrate TPD diagram",
                        "describe resonant frequencies",
                        "describe PT-symmetry condition",
                        "describe capacitive coupling Cc",
                        "illustrate density plot of measured normalized transmittance spectrum",
                        "describe transmission peak shifts",
                        "describe tuning conditions",
                        "illustrate response of sensor 100 for particular applied acceleration",
                        "describe transmission peak degeneracy response",
                        "describe reflectance deep degeneracy response",
                        "define Hamiltonian of isolated dimer",
                        "introduce transmittance equation",
                        "estimate linewidth broadening of resonances",
                        "model variations in coupling strength",
                        "derive frequencies of transmittance peaks",
                        "discuss lasing condition of open circuit",
                        "analyze stability of sensor",
                        "discuss enhanced transmitted intensity",
                        "describe sensing resolution",
                        "analyze linewidth of transmission peaks",
                        "discuss narrowing of linewidth",
                        "derive frequency splitting equation",
                        "discuss advantage of measuring frequency splitting",
                        "describe application of sensor",
                        "illustrate frequency splitting as function of acceleration",
                        "illustrate sensitivity as function of acceleration",
                        "describe bi-directional variable capacitor",
                        "illustrate sensor response",
                        "describe method for sensing force",
                        "illustrate computer-readable medium",
                        "discuss computer-readable instructions",
                        "describe modulated data signal",
                        "discuss operations of embodiments",
                        "discuss example implementations",
                        "discuss inclusive \"or\"",
                        "discuss articles \"a\" and \"an\"",
                        "discuss first, second, etc.",
                        "discuss equivalent alterations and modifications",
                        "discuss functionally equivalent components",
                        "discuss combining features",
                        "discuss terms \"includes\", \"having\", \"has\", \"with\"",
                        "discuss transmittance peaks splitting",
                        "discuss sublinear sensing",
                        "discuss nonlinear capacitance effects"
                    ],
                    "num_characters": 38097,
                    "outline_medium": [
                        "introduce sensor 100 with resonators and coupling circuit",
                        "describe components of sensor 100, including capacitors and gain units",
                        "explain operation of sensor 100, including transmission line and processing unit",
                        "introduce variable capacitor with springs and conductive plates",
                        "describe structure of variable capacitor, including dielectric layers and conductive plates",
                        "explain operation of variable capacitor, including movement of body member and change in capacitance",
                        "introduce processing unit 116 with bus, processor, memory, and input/output devices",
                        "describe components of processing unit 116, including bus drivers and clocks",
                        "explain operation of processor 404, including execution of instructions and control of sensor 100",
                        "describe memory 406, including types of memories and storage mediums",
                        "introduce communication interface 412, including wireless and wired interfaces",
                        "describe input device 408, including keyboard, mouse, and touchscreen",
                        "describe output device 410, including speaker, display, and projected display",
                        "introduce tuning application 416 and sensing application 418",
                        "explain operation of sensor 100 based on exceptional point",
                        "describe transmission peak degeneracy and reflectance peak degeneracy",
                        "explain detuning of resonant frequencies from exceptional point",
                        "describe operation of sensor 100 near transmission peak degeneracy",
                        "introduce density plot of measured normalized transmittance spectrum",
                        "explain tuning of sensor 100 to operate along characteristic square-root behavior",
                        "define Hamiltonian of isolated dimer",
                        "derive transmittance equation",
                        "model linewidth broadening of resonances",
                        "model variations in coupling strength",
                        "derive frequencies of transmittance peaks",
                        "analyze lasing condition of open circuit",
                        "discuss enhanced transmitted intensity",
                        "analyze sensing resolution",
                        "derive linewidth in strong coupling limit",
                        "discuss frequency splitting measurement",
                        "illustrate frequency splitting as function of acceleration",
                        "illustrate sensitivity as function of acceleration",
                        "describe bi-directional variable capacitor",
                        "illustrate sensor response to force",
                        "describe method for sensing force",
                        "illustrate computer-readable medium",
                        "provide general statements on computer readable media"
                    ],
                    "outline_short": [
                        "describe sensor 100 with reference to drawings",
                        "introduce transmission line 109 and resonators 102A, 102B",
                        "detail variable capacitor 200 and sensing unit 212",
                        "describe processing unit 116 and its components",
                        "explain operation of processing unit 116",
                        "introduce tuning application 416 and sensing application 418",
                        "describe principle of exceptional point and operation of sensor 100",
                        "detail transmission peak degeneracy and reflectance peak degeneracy",
                        "illustrate density plot of measured normalized transmittance spectrum",
                        "describe response of sensor 100 for particular applied acceleration",
                        "define Hamiltonian of isolated dimer",
                        "derive transmittance and linewidth broadening",
                        "model variations in coupling strength and frequencies",
                        "determine lasing condition and stability",
                        "analyze transmitted intensity and sensing resolution",
                        "illustrate frequency splitting and sensitivity",
                        "describe bi-directional variable capacitor and sensing units",
                        "outline method for sensing force and computer-readable medium"
                    ]
                }
            ],
            "outline_long": [
                "acknowledge government support"
            ],
            "num_characters": 220,
            "outline_medium": [
                "acknowledge government support"
            ],
            "outline_short": [
                "acknowledge government support"
            ]
        }
    ],
    "claims": [
        "1. A sensor, comprising:\na first resonator having an effective gain;\na second resonator having an effective loss;\na coupling circuit connected between the first resonator and the second resonator; and\na processing unit, wherein:\nat least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of a force applied to the variable capacitor; and\nthe processing unit is configured to tune the first resonator and the second resonator at an extrema degeneracy point with a non-linear response to the force, inject an input signal into the first resonator or the second resonator after tuning the first resonator and the second resonator at the extrema degeneracy point, receive an output signal from the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point, and determine a magnitude of the force based on a difference between the first frequency extrema point and the second frequency extrema point.",
        "2. The sensor of claim 1, wherein:\nthe processing unit is configured to receive the output signal from the first resonator when the second resonator receives the input signal;\nthe processing unit is configured to receive the output signal from the second resonator when the first resonator receives the input signal; and\nthe first frequency extrema point comprises a transmission peak.",
        "3. The sensor of claim 1, wherein:\nthe processing unit is configured to receive the output signal from the first resonator when the first resonator receives the input signal;\nthe processing unit is configured to receive the output signal from the second resonator when the second resonator receives the input signal; and\nthe first frequency extrema point comprises one of a reflectance peak or a reflectance deep.",
        "4. The sensor of claim 1, wherein the degeneracy point comprises one of a transmission peak, a reflectance peak, or a reflectance deep.",
        "5. The sensor of claim 1, comprising:\na first capacitor coupled to the first resonator; and\na second capacitor coupled to the second resonator.",
        "6. The sensor of claim 1, wherein:\nthe coupling circuit comprises at least one of a coupling capacitor or a coupling inductor.",
        "7. The sensor of claim 1, wherein the variable capacitor comprises:\na first stationary member;\na body member;\na first spring connecting the body member to the first stationary member;\na first conductive plate mounted to a first edge of the body member;\na second stationary member; and\na second conductive plate mounted to the second stationary member and spaced apart from the first conductive plate.",
        "8. The sensor of claim 7, comprising:\na first dielectric layer between the body member and the first conductive plate; and\na second dielectric layer between the second stationary member and the second conductive plate.",
        "9. The sensor of claim 7, wherein:\nthe spring comprises a beam.",
        "10. The sensor of claim 7, wherein:\nthe variable capacitor comprises:\na third conductive plate mounted to a second edge of the body member opposite the first edge;\na third stationary member; and\na fourth conductive plate mounted to the third stationary member and spaced apart from the third conductive plate; and\n\nthe processing unit is configured to determine a direction of the force based on the first frequency extrema point and the second frequency extrema point.",
        "11. A method, comprising:\ntuning a sensor comprising a first resonator having an effective gain, a second resonator having an effective loss, and a coupling circuit connected between the first resonator and the second resonator at an extrema degeneracy point with a non-linear response to a force applied to the sensor, wherein at least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of the force;\ninjecting an input signal into one of the first resonator or the second resonator after tuning the sensor at the extrema degeneracy point;\nreceiving an output signal from one of the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point; and\ndetermining a magnitude of the force based on a difference between the first frequency extrema point and the second frequency extrema point.",
        "12. The method of claim 11, comprising:\nreceiving the output signal from the first resonator when the second resonator receives the input signal; and\nreceiving the output signal from the second resonator when the first resonator receives the input signal, wherein:\nthe first frequency extrema point comprises a transmission peak.",
        "13. The method of claim 11, comprising:\nreceiving the output signal from the first resonator when the first resonator receives the input signal; and\nreceiving the output signal from the second resonator when the second resonator receives the input signal, wherein:\nthe first frequency extrema point comprises one of a reflectance peak or a reflectance deep.",
        "14. The method of claim 11, wherein tuning the sensor at the degeneracy point comprises:\ntuning the sensor at one of a transmission peak, a reflectance peak, or a reflectance deep.",
        "15. The method of claim 11, wherein the variable capacitor comprises:\na first stationary member;\na body member;\na first spring connecting the body member to the first stationary member;\na first conductive plate mounted to a first edge of the body member;\na second stationary member; and\na second conductive plate mounted to the second stationary member and spaced apart from the first conductive plate.",
        "16. The method of claim 15, wherein:\nthe variable capacitor comprises:\na third conductive plate mounted to a second edge of the body member opposite the first edge;\na third stationary member; and\na fourth conductive plate mounted to the third stationary member and spaced apart from the third conductive plate; and\n\nthe method comprises:\ndetermining a direction of the force based on the first frequency extrema point and the second frequency extrema point.",
        "17. A non-transitory computer-readable medium, storing operations thereon that when executed by a processing unit cause the processing unit to:\ntune a sensor comprising a first resonator, a second resonator, and a coupling circuit connected between the first resonator and the second resonator at an extrema degeneracy point with a non-linear response to a force applied to the sensor, wherein at least one of the first resonator, the second resonator, or the coupling circuit comprises a variable capacitor having a capacitance that varies as a function of the force;\ninject an input signal into one of the first resonator or the second resonator after tuning the sensor at the extrema degeneracy point;\nreceive an output signal from one of the first resonator or the second resonator, the output signal having a first frequency extrema point and a second frequency extrema point; and\ndetermine a magnitude of the force based on a difference between the first frequency extrema point and the second frequency extrema point.",
        "18. The non-transitory computer-readable medium of claim 17, wherein the operations cause the processing unit to:\nreceive the output signal from the first resonator when the second resonator receives the input signal; and\nreceive the output signal from the second resonator when the first resonator receives the input signal, wherein:\nthe first frequency extrema point comprises a transmission peak.",
        "19. The non-transitory computer-readable medium of claim 17, wherein the operations cause the processing unit to:\nreceive the output signal from the first resonator when the first resonator receives the input signal; and\nreceive the output signal from the second resonator when the second resonator receives the input signal, wherein:\nthe first frequency extrema point comprises one of a reflectance peak or a reflectance deep.",
        "20. The non-transitory computer-readable medium of claim 17, wherein the operations for tuning the sensor at the degeneracy point comprise operations that:\ntune the sensor at one of a transmission peak, a reflectance peak, or a reflectance deep."
    ]
}