{
    "id": "US20180254335",
    "authors": [
        "Hesameddin Ilatikhameneh",
        "Tarek Ameen Beshari",
        "Bozidar Novakovic",
        "Gerhard Klimeck",
        "Rajib Rahman"
    ],
    "title": "TUNNEL FIELD EFFECT TRANSISTOR HAVING ANISOTROPIC EFFECTIVE MASS CHANNEL",
    "date": "2017-04-04 00:00:00",
    "abstract": "A tunnel field effect transistor (TFET) device is disclosed. The TFET includes a substrate, heavily doped source and drain regions disposed at opposite ends of the substrate separated by a channel region forming a PiN or NiP structure, the channel region including a first substantially parallelogram portion having a first length defined along a longitudinal axis extending from the source region to the drain region and a second substantially parallelogram portion having a second length defined along the longitudinal axis larger than the first length, the TFET device having an effective channel length defined along the longitudinal axis that is an average of the first and second lengths. The channel region includes a channel material with a first effective mass along a longitudinal axis extending from the source region to the drain region and a second effective mass along a lateral axis perpendicular to the longitudinal axis.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "STATEMENT REGARDING GOVERNMENT FUNDING",
                    "paragraphs": [
                        "This invention was made with government support under 2013-MA-2382 awarded by the Defense Advanced Research Projects Agency. The government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "acknowledge government funding"
                    ],
                    "num_characters": 176,
                    "outline_medium": [
                        "acknowledge government funding"
                    ],
                    "outline_short": [
                        "acknowledge government funding"
                    ]
                },
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present application relates to electronic switching devices, and more specifically, to a field effect transistor having a channel with anisotropic effective mass."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field"
                    ],
                    "num_characters": 166,
                    "outline_medium": [
                        "define technical field"
                    ],
                    "outline_short": [
                        "define technical field"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Electronic industry development has been faithful to Moore's law as devices are becoming smaller and the number of transistors larger. For example, in 1980, INTEL's 8086 had about 50,000 transistors; in 1990, 486 had about 1,000,000 transistors; in 2000, PENTIUM4 had about 50,000,000 transistors; and in 2010, SIX-CORE 17 had about 1,000,000,000 transistors. There are two significant challenges with this ever-increasing transistor count. First, a central challenge of the electronic industry is power consumption of integrated circuits which are now composed of billions of transistors. Second, as the channel length of transistors (e.g., metal oxide semiconductors field effect transistor, MOSFET) is becoming smaller and smaller in order to increase both the operation speed and the number of transistors per chip, a phenomenon referred to as a short channel effect (SCE) becomes prominent. SCE specifically becomes problematic when the channel length is of the same order of magnitude as the depletion-layer widths. SCE manifest itself in several ways including: a subthreshold voltage roll-off (Vt roll-off), a drain-induced barrier lowering (DIBL) and a source-drain punch through, thus increasing the inverse subthreshold slope of metal oxide semiconductor field effect transistor (MOSFET) and thereby significantly increasing off-state leakage current. Particularly, with off-state leakage as a measure of power performance, MOSFETs performance deteriorate progressively in submicron, deep submicron, and nano-scale channel lengths. Additionally, MOSFETs are fundamentally unable to have sharp ON-to-OFF transition, which implies that they need a relatively large operating voltage to supply the needed ON current to operate. Furthermore, the higher the desired operating speed (i.e. frequency of ON to OFF transitions), the higher the needed ON current and consequently the higher the supply voltage, hence the power consumption problem is further exasperated. Accordingly, it is essential to reduce the power consumption in chips with large numbers of transistors especially those operating at high frequencies. Therefore, a main challenge in miniaturizing MOSFETs is scaling down the supply voltage VDD, as needed to reduce power. A smaller VDD can be achieved in a switch with sharper ON to OFF transition. However, the steepness of conventional MOSFETs have a fundamental limit due to thermionic injection of carriers over the channel barrier (60 mV/decade at room temperature). The cause of this limit is also referred to as a hot carrier leakage.",
                        "Devices known as tunnel field effect transistors (TFETs) have been introduced in an attempt to address these issues. The hot carrier leakage problem does not exist in the tunnel FETs, which work based on injection of cold carriers. The doping profile of TFETs is P-i-N, unlike MOSFETs which typically use an N-i-N or P-i-P profile. Hence, the bandgap of a TFET filters out the hot carriers. TFETs are able to provide steep ON-to-OFF transitions allowing them to operate at lower voltages and significantly reduce the power consumption. However, one challenge of conventional TFETs is that the tunneling transmission probability is small, which results in small ON current levels and low speed. Moreover, scaling the channel length below 10 nm in conventional TFETs is shown to be exceedingly challenging as further length scaling significantly degrades OFF-state of conventional TFETs. Given these challenges, the Moore's law appears to be at a dead-end.",
                        "Therefore, there is an unmet need for a novel TFET design that improves upon conventional TFET current performance both in the ON- and OFF-states."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe industry development",
                        "highlight power consumption challenge",
                        "explain short channel effect",
                        "describe limitations of MOSFETs",
                        "introduce tunnel field effect transistors",
                        "highlight challenges of conventional TFETs",
                        "identify unmet need"
                    ],
                    "num_characters": 3667,
                    "outline_medium": [
                        "describe industry development",
                        "discuss power consumption challenges",
                        "motivate need for novel TFET design"
                    ],
                    "outline_short": [
                        "motivate need for new transistor design"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "A tunnel field effect transistor (TFET) device is disclosed. The TFET includes a substrate, and heavily doped source and drain regions disposed at opposite ends of the substrate separated by a channel region, where the channel region can be intrinsic or lightly doped with doping of less than 1018/cm3 and the source and drain regions doped with doping of between about 1018/cm3 to about 1021/cm3 forming a PiN or NiP structure. The TFET further includes a gate terminal separated from the channel region by a dielectric layer, and source and drain terminals coupled to the source and drain regions, respectively. The channel region includes a channel material with a first effective mass along a longitudinal axis extending from the source region to the drain region and a second effective mass along a lateral axis perpendicular to the longitudinal axis.",
                        "A tunnel field effect transistor (TFET) device is disclosed. The TFET includes a substrate and heavily doped source and drain regions disposed at opposite ends of the substrate separated by a channel region, where the channel region can be intrinsic or lightly doped with doping of less than 1018/cm3 and the source and drain regions doped with doping of between about 1018/cm3 to about 1021/cm3 forming a PiN or NiP structure. The TFET further include a source and drain terminal coupled to the source and drain regions, respectively. The channel region includes a first substantially parallelogram portion having a first length defined along a longitudinal axis extending from the source region to the drain region and a second substantially parallelogram portion connected to the first substantially parallelogram portion having a second length defined along the longitudinal axis and larger than the first length, the TFET device having an effective channel length defined along the longitudinal axis that is an average of the first and second lengths."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce TFET device",
                        "describe channel region",
                        "describe alternative embodiment"
                    ],
                    "num_characters": 1914,
                    "outline_medium": [
                        "summarize TFET device"
                    ],
                    "outline_short": [
                        "describe TFET device"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "In the following description, some aspects will be described in terms that would ordinarily be implemented as software programs. Those skilled in the art will readily recognize that the equivalent of such software can also be constructed in hardware, firmware, or micro-code. Because data-manipulation algorithms and systems are well known, the present description will be directed in particular to algorithms and systems forming part of, or cooperating more directly with, systems and methods described herein. Other aspects of such algorithms and systems, and hardware or software for producing and otherwise processing the signals involved therewith, not specifically shown or described herein, are selected from such systems, algorithms, components, and elements known in the art. Given the systems and methods as described herein, software not specifically shown, suggested, or described herein that is useful for implementation of any aspect is conventional and within the ordinary skill in such arts.",
                        "For the purposes of promoting an understanding of the principles of the present disclosure, reference will now be made to the embodiments illustrated in the drawings, and specific language will be used to describe the same. It will nevertheless be understood that no limitation of the scope of this disclosure is thereby intended.",
                        "In the present disclosure, the term “about” can allow for a degree of variability in a value or range, for example, within 10%, within 5%, or within 1% of a stated value or of a stated limit of a range.",
                        "In the present disclosure, the term “substantially” can allow for a degree of variability in a value or range, for example, within 90%-100%, within 95%-105%, or within 99%-101% of a stated value or of a stated limit of a range.",
                        "A novel TFET design that improves upon conventional TFET in both the ON- and OFF-states is presented. Referring to FIG. 1, a perspective exploded schematic view of a tunnel field effect transistors (TFET) 100, according to one embodiment of the present disclosure is provided. The TFET 100 includes one or optionally two L-shaped gates (shown as a top gate 106 and optionally a bottom gate 112), a channel 110 (a channel is also referred to as a channel region throughout the present disclosure) disposed below the top gate 106, and source and drain regions 102 and 104, respectively (source and drain regions are also referred to as source and drain, respectively, throughout the present disclosure) at opposing ends of the channel 110. The channel region 110 can be intrinsic or lightly doped with doping of less than 1018/cm3 and the source and drain regions doped with doping of between about 1018/cm3 to about 1021/cm3, collectively forming a structure wherein the structure is PiN or NiP, where “i” refers to intrinsic or lightly doped N or P. The top gate 106 is separated from the channel 110 by gate oxide 108. Similarly, if the TFET includes two gates (i.e., a bottom gate 112), then bottom gate 112 is separated from the channel 110 by gate oxide 114. Exemplary gate oxide materials include HfO2, SiO2, Al2O3, and other gate oxide known to a person having ordinary skill in the art. The gate typically comprises a conductive contact layer made from, e.g., Al, Cu, a transition metal such as nickel, a refractory metal such as tungsten, and metal silicides such as TiSi2, MoSi2, and WSi2, a material comprised of a combination of these layers, or other conductive material known to a person having ordinary skill in the art. The source and drain regions of the device may also include conductive contacts made from, e.g., Al, Cu, a transition metal such as nickel, a refractory metal such as tungsten, and metal silicides such as TiSi2, MoSi2, and WSi2, a material comprised of a combination of these layers, or other conductive material known to a person having ordinary skill in the art for attaching external circuitry to the TFET 100.",
                        "The channel 110 comprises a material having anisotropic effective mass. Referring to FIG. 2, a perspective schematic view of the TFET 100 of FIG. 1 is provided. As shown in FIG. 2, the channel 110 comprises a material that has a high effective mass (high m*) along a longitudinal axis 150a-150b of the device defined from the source 102 to the drain 104 (i.e., from left to right). Conversely, the material of the channel 110 in a lateral axis 152a-152b from right to left (or bottom to top in, e.g., FIG. 3 described more fully below which is a top view of a device according to the present disclosure), the channel material has a relatively lower effective mass (low m*). The ratio between high m* and low m* can be between 1 and 50. The boundary between the source 102 and the channel 110 of the illustrated L-shaped gate TFET 100 (also herein referred to as the L-gate TFET) has an elongated portion 120 which is generally perpendicular to the low effective mass axis 152a-152b and is labeled as having a length dL in FIG. 2. In one embodiment, the channel material comprises a two-layer (2L) phosphorene nanoribbon having a zigzag structure in the high m* direction (i.e., along the longitudinal axis 150a-150b) and an armchair structure in the low m* direction (i.e., along the lateral axis 152a-152b), although other materials having anisotropic effective mass characteristics may also be used (e.g., Silicon, Germanium, and 2D materials such as titanium trisulfide (TiS3)). While the zigzag and the armchair atomistic structures are formed inherently by using phosphorene as a channel material, other materials generating differing effective mass (i.e., high m* and low m*) can also be used in which case, the structure may not be the same as zigzag and armchair. The ratio of high m* to low m* according to the present disclosure is between 1-50. In general, the channel region 110 includes one or more layers of i) 2-dimensional inherently anisotropic material made from phosphorene, titanium trisulfide, or any combination thereof; ii) 2-dimensional inherently isotropic material made from transition metal dichalcogenide including molybdenum disulfide, tungsten disulfide, molybdenum diselenide, tungsten diselenide, molybdenum ditelluride, or any combination thereof; iii) 3-dimensional bulk material made from Si, germanium, gallium arsenide (GaAs), an alloy of silicon and germanium, indium phosphide, or any combination thereof, wherein the 2-dimensional inherently isotropic material and the 3-dimensional bulk material are formed to induce the first effective mass and the second effective mass by either being placed in a strained state, by structurally being formed in a manner that results in effective masses substantially different in the longitudinal and lateral axes, or by other methods known to a person having ordinary skill in the art.",
                        "Referring to FIG. 3, a top view of an exemplary TFET 200 is depicted. The TFET 200 includes an L-shaped gate 206 (top gate), a channel region 210 (below the top gate 206 and therefore shown as dashed lines) having an effective length 211, which is disposed below the top gate 206, and source and drain regions (202 and 204, respectively) at opposing ends of the channel 210. The channel region 210 includes a first substantially rectangular (or parallelogram) portion 212 having a first length 212a defined along the longitudinal axis 150a-150b extending from the source region 202 to the drain region 204 and a second substantially rectangular (or parallelogram) portion 213 having a second length 213a defined along the longitudinal axis 150a-150b which is larger than the first length 212a. The first and second substantially rectangular (or parallelogram) portions 212 and 213, respectively, are separated by an imaginary line 209. The TFET 200 defines an effective channel length 211 along the longitudinal axis 150a-150b that is an average of the first and second lengths 212a and 213a, respectively. The top gate 206 is separated from the channel 210 by a layer of gate oxide (not shown). Two section lines A-A and B-B are provided to show the structures of the TFET 200 across its layers in FIGS. 4 and 5, respectively.",
                        "While an L-shaped channel is depicted in the figures of the present disclosure, it should be appreciated the present disclosure is not limited to L-shaped structures. In general, the channel region includes a first substantially parallelogram portion (e.g., 212) with a first length (e.g., 212a) defined along the longitudinal axis (150a-150b) and a second substantially parallelogram portion (e.g., 213) connected to the first substantially parallelogram (e.g., 212) portion with a second length (e.g., 213a) defined along the longitudinal axis (150a-150b) and larger than the first length (e.g., 212a), where the TFET device has an effective channel length defined along the longitudinal axis that is an average of the first and second lengths. The structures can include L-shaped structures, V-shaped structures, and other geometrical structure combinations.",
                        "Referring to FIG. 4, a cross sectional view of a cross section about section line A-A of FIG. 3 is provided. Shown in FIG. 4 is also a gate oxide 208, insulating the gate 206 from the channel 210. The channel 210 has a width 210A which is smaller than the width 210B (see FIG. 5) by the amount dL 220 (shown in FIG. 3).",
                        "Referring to FIG. 5, a cross sectional view of a cross section about section line B-B of FIG. 3 is provided. Shown in FIG. 5 is also a gate oxide 208, insulating the gate 206 from the channel 210. The channel 210 has a width 210B which is larger than the width 210A (see FIG. 4) by the amount dL 220 (shown in FIG. 3).",
                        "Referring to FIG. 6, a top view of an exemplary double-gated TFET 300 is depicted. The TFET 300 includes an L-shaped gate 306 (top gate is shown in FIG. 6, and a bottom gate is also shown in FIGS. 7 and 8), a channel region 310 (below the top gate 306 and therefore shown as dashed lines) having an effective length 311, which is disposed below the top gate 306, and source and drain regions (302 and 304, respectively) at opposing ends of the channel region 310. The channel region 310 includes a first substantially rectangular (or parallelogram) portion 312 having a first length 312a defined along the longitudinal axis 150a-150b extending from the source region 302 to the drain region 304 and a second substantially rectangular (or parallelogram) portion 313 having a second length 313a defined along the longitudinal axis 150a-150b which is larger than the first length 312a. The first and second substantially rectangular (or parallelogram) portions 312 and 313, respectively, are separated by an imaginary line 309. The TFET 300 defines an effective channel length 311 along the longitudinal axis 150a-150b that is an average of the first and second lengths 312 and 313, respectively. The top gate 306 is separated from the channel 310 by a layer of gate oxide (not shown). Two section lines A-A and B-B are provided to show the structures of the TFET 300 across its layers in FIGS. 7 and 8, respectively.",
                        "Referring to FIG. 7, a cross sectional view about section line A-A of FIG. 6 is provided. Shown in FIG. 7 is also a gate oxide 308 disposed below the top gate 306, insulating the top gate 306 from the channel 310. Also, shown in FIG. 7 is a bottom gate 314 and a gate oxide 315 disposed above the bottom gate 314. The channel 310 has a width 310A which is smaller than the width 310B (see FIG. 5) by the amount dL 320 (shown in FIG. 3).",
                        "Referring to FIG. 8, a cross sectional view about section line B-B of FIG. 6 is provided. Shown in FIG. 8 is also a gate oxide 308 disposed below the top gate 306, insulating the top gate 306 from the channel 310. Also, shown in FIG. 8 is the bottom gate 314 and the gate oxide 315 disposed above the bottom gate 314. The channel 310 has a width 310B which is larger than the width 310A (see FIG. 7) by the amount dL 320 (shown in FIG. 3).",
                        "TFETs generally have reduced power consumption as compared to MOSFETs, however scaling TFET dimensions below 10 nm is more challenging than the MOSFET since the ON-state and OFF-state tunneling currents (ION and IOFF) of a TFET depend on the same device parameters. Thus, an effort to decrease IOFF would typically reduce ION. However, in the novel arrangement of the present disclosure, IOFF and ION are decomposed. Roughly, the ON/OFF ratio of a TFET according to the present disclosure depends on:",
                        "\\(\\begin{matrix}\n{{\\log \\left( \\frac{I_{ON}}{I_{OFF}} \\right)} \\propto {{L_{ch}\\sqrt{m_{r\\; 1}^{*}E_{g\\; 1}}} - {\\Lambda \\sqrt{m_{r\\; 2}^{*}E_{g\\; 2}}}}} & (1)\n\\end{matrix}\\)",
                        "where Λ and Lch are the tunneling distances in the ON-state (i.e., the tunneling distance defined by the valence band in the source region and the conduction band in the channel region) and OFF-state (i.e., the tunneling distance defined by the valence band of the source region and the conduction band in the drain region) respectively; and mr1* and Eg1 are the effective mass and the bandgap of the channel material along the weakest tunneling barrier in the OFF state which is the high m* direction. While mr2* and Eg2 are the effective mass and the bandgap along the weakest tunneling barrier in the ON state which is the low m* direction. In one embodiment, according to the present disclosure, Eg1 and Eg2 are equal. In another embodiment, according to the present disclosure Eg1 and Eg2 are different. For conventional TFETs (i.e., those not having anisotropic effective mass) the transports in both ON and OFF cases in general would experience the same effective mass. For a TFET with a homogenous material that is not made from a hetero-structure the energy gap is also the same in both directions. Therefore, for conventional TFETs, the first and 2nd terms of equation (1) under the square roots would be close and ION/IOFF ratio small. However, equation (1) is applicable for situations where the channel region as described below is to have different and selective effective masses (and bandgaps) along the two major axes for an L-shaped channel region or other geometrical choices.",
                        "The L-gate TFET of the present disclosure provides differing effective mass values for mr1* and mr2* (and therefore improved performance) as follows. Referring to FIG. 9, a top view schematic of the TFET 100 is shown again in the ON-state. In the ON-state, when a voltage is applied to the gate 106 the potential energy in the channel region is reduced such that the primary barrier of the cold carriers is the source 102 to channel junction. Because of the L-shape of the gate 106, additional carrier tunneling can occur in the low m* direction (along the lateral axis 152a-152b (see FIG. 2) of the TFET 100) as indicated by the vertical arrows shown in FIG. 9. This additional tunneling is much greater than tunneling which would otherwise be limited to that in the high m* direction (along the longitudinal axis 150a-150b (see FIG. 2) from source 102 to drain 104 of the TFET 100). In this way, ION is significantly increased.",
                        "Referring to FIG. 10, a top view schematic of the TFET 100 is shown again in the OFF-state. IOFF is also reduced, since in the OFF-state the main barrier of the carriers is the full channel region 110 itself (between the source 102 and drain 104), and the anisotropic channel material has a higher effective mass along the longitudinal axis 150a-150b (see FIG. 2) from source 102 to drain 104 of the TFET 100. This higher effective mass reduces tunneling in the OFF-state (as shown by the arrows in FIG. 10), and likewise reduces IOFF. In the OFF-state, there is some tunneling of carriers through the perpendicular portion of the source-channel barrier, but this is mostly irrelevant to IOFF since the full channel itself is the tunneling barrier and the dominating factor.",
                        "Referring back to FIG. 2, the atomic arrangement resulting in differing effective mass values mr1* and mr2*, described above, is based on two arrangements. In one arrangement in the “Low m*” direction (i.e., in the direction of lateral axis 152a-152 of the TFET 100) the atomic arrangement is shown as an armchair arrangement. Conversely, the second arrangement in the “High m*” direction (i.e., in the direction of longitudinal axis 150a-150b of the TFET 100) the atomic arrangement is shown as zigzag arrangement. Referring to FIG. 11, a graph of IDS (drain to source current: a measure of transistor's ON vs. OFF performance) is shown as a function of VGS (gate to source voltage) for various arrangements. These arrangements include inventors' own work for phosphorene without L-shaped channel showing 6 nm as too small of channel length as the ON-OFF current ratio for two experiments wherein the transport direction is first along the zigzag direction and second along the armchair direction each producing ION/IOFF ratio less than 104 which is a typical rule of thumb characteristic for an acceptable FET (9 nm was found to be the minimum channel length complaint with that rule of thumb). Further shown in FIG. 11 is the L-shaped channel according to the present disclosure with phosphorene as the channel material producing unexpected results where 6 nm channel length produced an ION/IOFF ratio of about 4×105 as more clearly shown in FIG. 14, described further below. As shown, the L-shaped channel has an Ion about that of the ION of a regular-shaped channel TFET device (i.e., no L-shaped channel) maximized for transport along the armchair direction (low m*), but also has an IOFF about that of the IOFF of the same regular-shaped channel device (i.e., no L-shaped channel) minimized to have transport along the armchair direction (low m*). Hence, the presently-disclosed L-gate TFET has the advantages of both low and high m* regular-shaped channel devices maximized for high ION and minimized for low IOFF, simultaneously. In FIG. 11, the dL of the channel is about 3 nm.",
                        "The performance of the L-gate TFET of the present disclosure is dependent on the differential length of the L-shaped channel (dL as shown in FIG. 3 or 6). Referring to FIG. 12, a graph of ION measured in μA/μm vs. dL measured in nm is provided. The performance of the L-gate TFET depends on the length dL which determines the width for the device ON-current (ION: the maximum current of the transistor) to flow through. In conventional prior-art TFETs, dL equals 0. FIG. 12 shows ION of one example of the presently disclosed L-gate TFET device as a function of dL for a fixed IOFF of 10−4 μA/μm. Increasing dL enhances ION significantly, however it reduces the source extension by dL/2. Accordingly, there is a limit on dL according to the footage requirements in the design. Nevertheless, in the illustrated example, a dL of about 2.5 nm can improve the performance of the TFET by approximately 2 orders of magnitude.",
                        "Referring to FIG. 13, a graph of ION measured in μA/μm vs. VGS measured in volts is provided for different channel lengths, showing examples of ultra-scaled L-gate TFETs with channel lengths from 9 nm down to 2.3 nm with a VDD of 0.2V. In ultra-scaled TFETs, VDD usually does not scale below VDD=0.2V since the maximum tunneling energy window is limited by VDD. The L-gate TFETs with Lch above 2 nm provide ION/IOFF>104 and satisfy the typical International Technology Roadmap for Semiconductors (ITRS) requirements for the ION/IOFF ratio.",
                        "Referring to FIG. 14, a graph of ION/IOFF ratio vs. channel length is provided showing ION/IOFF ratios of instant L-gate TFETs as a function of Lch. Ultra-scaled channel lengths put a limit on dL. Hence, dL shrinks down from 3.5 nm to 1 nm when the channel length is scaled down from 9 nm to 2.3 nm. Therefore, reduction of Lch, results in reduction of dL based on a Lch/dL of about 3. L-gate TFETs with channel lengths down to 2 nm provide an ION/IOFF ratio larger than 104 (required by the International Technology Roadmap for Semiconductors (ITRS) as a minimum amount of ION/IOFF ratio). Thus, the presently disclosed L-gate TFETs with a channel material with anisotropic m* enable successful scaling of TFETs down to channel lengths of only a few atoms. The square symbol and the “X” symbol represent the device described above in reference to FIG. 11 (i.e., the regular shaped non-L-shaped channel with Leh of 6 nm). As discussed above, these devices produced inferior ION/IOFF ratios of about 103. In FIG. 14, the IOFF was maintained at 10−4 μA/μm.",
                        "The process by which the TFET devices of the present disclosure are made are based on typical MOSFET fabrication processes, known to a person having ordinary skill in the art. When the channel material is a 2-D type material, an exemplary transfer process for these 2D material is found in U.S. Pat. App. Pub. No. 20120061728 for Javey, incorporated by reference in its entirety into the present disclosure. Where the channel material is a 3-D type material, typical growth or deposition processes (e.g., chemical vapor deposition, epitaxial growth, plasma enhanced chemical vapor deposition, etc.) known to a person having ordinary skill in the art can be employed.",
                        "The invention is inclusive of combinations of the aspects described herein. References to “a particular aspect” and the like refer to features that are present in at least one aspect of the invention. Separate references to “an aspect” (or “embodiment”) or “particular aspects” or the like do not necessarily refer to the same aspect or aspects; however, such aspects are not mutually exclusive, unless so indicated or as are readily apparent to one of skill in the art. The use of singular or plural in referring to “method” or “methods” and the like is not limiting. The word “or” is used in this disclosure in a non-exclusive sense, unless otherwise explicitly noted.",
                        "The invention has been described in detail with particular reference to certain preferred aspects thereof, but it will be understood that variations, combinations, and modifications can be effected by a person of ordinary skill in the art within the spirit and scope of the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce TFET design",
                        "describe conventional TFET limitations",
                        "present novel TFET design with anisotropic effective mass",
                        "define channel region with L-shaped gate",
                        "describe gate oxide materials",
                        "specify conductive contact materials",
                        "introduce channel material with high and low effective mass",
                        "describe zigzag and armchair atomistic structures",
                        "define effective channel length",
                        "describe L-shaped channel structure",
                        "introduce top view of TFET 200",
                        "describe channel region with first and second lengths",
                        "define effective channel length",
                        "describe gate oxide and channel width",
                        "introduce cross-sectional views of TFET 200",
                        "describe gate oxide and channel width",
                        "introduce top view of double-gated TFET 300",
                        "describe channel region with first and second lengths",
                        "define effective channel length",
                        "describe gate oxide and channel width",
                        "introduce cross-sectional views of TFET 300",
                        "describe gate oxide and channel width",
                        "discuss TFET power consumption",
                        "introduce ON/OFF ratio equation",
                        "describe tunneling distances and effective masses",
                        "discuss conventional TFET limitations",
                        "describe L-gate TFET performance",
                        "introduce top view of TFET 100 in ON-state",
                        "describe additional carrier tunneling",
                        "introduce top view of TFET 100 in OFF-state",
                        "describe reduced tunneling in OFF-state",
                        "discuss atomic arrangements and effective masses",
                        "introduce graph of IDS vs. VGS",
                        "compare L-shaped channel with regular-shaped channel",
                        "discuss ION/IOFF ratio",
                        "introduce graph of ION vs. dL",
                        "discuss performance dependence on dL",
                        "introduce graph of ION vs. VGS for ultra-scaled L-gate TFETs",
                        "discuss ION/IOFF ratio for ultra-scaled TFETs",
                        "introduce graph of ION/IOFF ratio vs. channel length",
                        "discuss channel length scaling",
                        "describe fabrication process",
                        "conclude invention description"
                    ],
                    "num_characters": 22043,
                    "outline_medium": [
                        "introduce TFET design",
                        "describe channel region",
                        "specify gate oxide materials",
                        "describe source and drain regions",
                        "introduce anisotropic effective mass",
                        "describe channel material properties",
                        "illustrate TFET 200 structure",
                        "describe effective channel length",
                        "illustrate cross-sectional views of TFET 200",
                        "introduce double-gated TFET 300",
                        "describe channel region of TFET 300",
                        "illustrate cross-sectional views of TFET 300",
                        "discuss TFET scaling challenges",
                        "introduce novel arrangement for IOFF and ION decomposition",
                        "describe ON-state and OFF-state tunneling currents",
                        "illustrate ON-state and OFF-state tunneling",
                        "discuss differing effective mass values",
                        "illustrate IDS vs. VGS for various arrangements",
                        "discuss performance dependence on differential length",
                        "illustrate ION vs. dL and ION vs. VGS",
                        "discuss ultra-scaled L-gate TFETs and ION/IOFF ratio"
                    ],
                    "outline_short": [
                        "introduce TFET design",
                        "describe channel material with anisotropic effective mass",
                        "detail L-shaped gate structure",
                        "illustrate top view of TFET with L-shaped gate",
                        "describe cross-sectional views of TFET",
                        "introduce double-gated TFET structure",
                        "explain ON/OFF ratio of TFET",
                        "illustrate ON-state and OFF-state tunneling currents",
                        "show graph of IDS vs. VGS for various arrangements",
                        "discuss performance of L-gate TFET and scaling limitations"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A tunnel field effect transistor (TFET) device, comprising:\na substrate;\nheavily doped source and drain regions disposed at opposite ends of the substrate separated by a channel region, where the channel region can be intrinsic or lightly doped with doping of less than 1018/cm3 and the source and drain regions doped with doping of between about 1018/cm3 to about 1021/cm3, collectively forming a structure wherein the structure is PiN or NiP;\na gate terminal separated from the channel region by a dielectric layer;\na source and drain terminal coupled to the source and drain regions, respectively,\nthe channel region comprising a channel material having a first effective mass along a longitudinal axis extending from the source region to the drain region and a second effective mass along a lateral axis perpendicular to the longitudinal axis, wherein a ratio of the two effective masses is between 1 and 50.",
        "2. The TFET device of claim 1, the channel region comprising one or more layers of i) 2-dimensional inherently anisotropic effective mass material made from phosphorene, titanium trisulfide, or any combination thereof; ii) 2-dimensional inherently isotropic effective mass material made from transition metal dichalcogenide including molybdenum disulfide, tungsten disulfide, molybdenum diselenide, tungsten diselenide, molybdenum ditelluride, or any combination thereof; or iii) 3-dimensional bulk material made from Si, germanium, gallium arsenide (GaAs), an alloy of silicon and germanium, indium phosphide, or any combination thereof, wherein the 2-dimensional inherently isotropic effective mass material and the 3-dimensional bulk material are formed to induce the first effective mass and the second effective mass.",
        "3. The TFET device of claim 1, the dielectric layer made from HfO2, SiO2, Al2O3, or any combination thereof.",
        "4. The TFET device of claim 1, the gate, source, and drain terminals made from Al, Cu, Ni, a heavily-doped silicon, tungsten, and metal silicides from the group consisting essentially of TiSi2, MoSi2, and WSi2, or any combination thereof.",
        "5. The TFET device of claim 1, the channel region comprising a first substantially parallelogram portion having a first length defined along the longitudinal axis and a second substantially parallelogram portion connected to the first substantially parallelogram portion having a second length defined along the longitudinal axis and larger than the first length, the TFET device having an effective channel length defined along the longitudinal axis that is an average of the first and second lengths.",
        "6. The TFET device of claim 5, wherein the channel region is L-shaped.",
        "7. The TFET device of claim 5, wherein the channel region is V-shaped.",
        "8. The TFET device of claim 5, the effective channel length having a value of about 2 nm to about 20 nm.",
        "9. The TFET device of claim 5, the difference between the second length and the first length (dL) having a value of about 1 nm to about 10 nm.",
        "10. The TFET device of claim 9, the TFET having a ratio of drain to source current (IDS) in an on state to IDS in an off state of between about 104 to about 107.",
        "11. The TFET device of claim 10, the TFET IDS current in the on state for a supply voltage applied to the drain region of about 0.2 V, and IDS in the off state of about 104 μA/μm, a dL of about 3 nm is between about 1 μA/μm to about 50 μA/μm.",
        "12. A tunnel field effect transistor (TFET) device, comprising:\na substrate;\nheavily doped source and drain regions disposed at opposite ends of the substrate separated by a channel region, where the channel region can be intrinsic or lightly doped with doping of less than 1018/cm3 and the source and drain regions doped with doping of between about 1018/cm3 to about 1021/cm3, collectively forming a structure wherein the structure is PiN or NiP; and\na source and drain terminal coupled to the source and drain regions, respectively,\nthe channel region comprising a first substantially parallelogram portion having a first length defined along a longitudinal axis extending from the source region to the drain region and a second substantially parallelogram portion connected to the first substantially parallelogram portion having a second length defined along the longitudinal axis and larger than the first length, the TFET device having an effective channel length defined along the longitudinal axis that is an average of the first and second lengths.",
        "13. The TFET device of claim 12, the channel region comprising a channel material having a first effective mass along the longitudinal axis and a second effective mass along a lateral axis perpendicular to the longitudinal axis, wherein a ratio of the two effective masses is between 1 and 50.",
        "14. The TFET device of claim 13, the channel region comprising one or more layers of i) 2-dimensional inherently anisotropic effective mass material made from phosphorene, titanium trisulfide, or any combination thereof; ii) 2-dimensional inherently isotropic effective mass material made from transition metal dichalcogenide including molybdenum disulfide, tungsten disulfide, molybdenum diselenide, tungsten diselenide, molybdenum ditelluride, or any combination thereof; or iii) 3-dimensional bulk material made from Si, germanium, gallium arsenide (GaAs), an alloy of silicon and germanium, indium phosphide, or any combination thereof, wherein the 2-dimensional inherently isotropic effective mass material and the 3-dimensional bulk material are formed to induce the first effective mass and the second effective mass.",
        "15. The TFET device of claim 12, wherein the channel region is L-shaped.",
        "16. The TFET device of claim 12, wherein the channel region is V-shaped.",
        "17. The TFET device of claim 12, the effective channel length having a value of about 2 nm to about 20 nm.",
        "18. The TFET device of claim 12, the difference between the second length and the first length (dL) having a value of about 1 nm to about 10 nm.",
        "19. The TFET device of claim 13, the TFET having a ratio of drain to source current (IDS) in an on state to IDS in an off state of between about 104 to about 107.for channel lengths from 2 nm to 8 nm.",
        "20. The TFET device of claim 19, the TFET IDS current in the on state for a supply voltage applied to the drain region of about 0.2 V, and IDS in the off state of about 10−04 μA/μm, a dL of about 3 nm is between about 1 μA/μm to about 50 μA/μm."
    ]
}