{
    "id": "https://semopenalex.org/work/W2558997250",
    "authors": [
        "Paul B. McCray",
        "Shyam Ramachandran",
        "Ashley M. Jacobi",
        "Mark A. Behlke",
        "Kalpaj R. Parekh",
        "Samantha R. Osterhaus"
    ],
    "title": "SYVN1, NEDD8, and FBXO2 Proteins Regulate ΔF508 Cystic Fibrosis Transmembrane Conductance Regulator (CFTR) Ubiquitin-mediated Proteasomal Degradation",
    "date": "2016-12-01",
    "abstract": "We previously reported that delivery of a microRNA-138 mimic or siRNA against SIN3A to cultured cystic fibrosis (ΔF508/ΔF508) airway epithelia partially restored ΔF508-cystic fibrosis transmembrane conductance regulator (CFTR)-mediated cAMP-stimulated Cl− conductance. We hypothesized that dissecting this microRNA-138/SIN3A-regulated gene network would identify individual proteins contributing to the rescue of ΔF508-CFTR function. Among the genes in the network, we rigorously validated candidates using functional CFTR maturation and electrolyte transport assays in polarized airway epithelia. We found that depletion of the ubiquitin ligase SYVN1, the ubiquitin/proteasome system regulator NEDD8, or the F-box protein FBXO2 partially restored ΔF508-CFTR-mediated Cl− transport in primary cultures of human cystic fibrosis airway epithelia. Moreover, knockdown of SYVN1, NEDD8, or FBXO2 in combination with corrector compound 18 further potentiated rescue of ΔF508-CFTR-mediated Cl− conductance. This study provides new knowledge of the CFTR biosynthetic pathway. It suggests that SYVN1 and FBXO2 represent two distinct multiprotein complexes that may degrade ΔF508-CFTR in airway epithelia and identifies a new role for NEDD8 in regulating ΔF508-CFTR ubiquitination.",
    "sections": [
        {
            "title": "Results",
            "paragraphs": [
                "MiR-138 and SIN3A Regulate Genes Influencing CFTR Biosynthesis-We previously reported that miR-138 overexpression or SIN3A knockdown improved ⌬F508-CFTR trafficking and function in airway epithelia and altered transcript levels of target genes (9). Global mRNA transcript profiling after miR-138 overexpression and SIN3A inhibition were performed in the human airway Calu-3 cell line, a respiratory epithelial model (9 -11). Using a p value cutoff of Ͻ0.01, we observed 80 genes up-regulated and 64 genes down-regulated in response to both interventions (Fig. 1A). We hypothesized that this miR-138/SIN3A-regulated gene network enhances CFTR biogenesis by influencing gene expression at multiple steps along its biosynthetic pathway.",
                "Here, we utilized three independent pathway and gene ontology analysis tools in parallel as an unbiased strategy to select genes from this list of 144 for further investigation. The Database for Annotation, Visualization, and Integrated Discovery (DAVID, version 6.7) (12) revealed a significant enrichment of 57 genes in pathways including chaperones (32 genes, 4.6-fold enrichment, p Ͻ 2.6EϪ09), unfolded protein response (25 genes, 5.8-fold enrichment, p Ͻ 1.1EϪ06), and ubiquitin proteasomal pathways (20 genes, 4.06-fold enrichment, p Ͻ 6.1EϪ04) (Fig. 1A). Classification of gene products using the tool Protein Analysis Through Evolutionary Relationships (PANTHER, version 10) (13) showed significant enrichment of the \"protein folding\" pathway (25 genes, 18.26-fold enrichment, p Ͻ 2.75EϪ14) (Fig. 1A). Finally, to account for physical and functional associations between gene products, we used the STRING database version 10 (14) to determine predicted protein/protein interactions within the 144 co-regulated genes. In all, 67 genes showed evidence of interactions (Fig. 1B).",
                "Because many of these gene products are involved in protein trafficking or ER quality control (ERQC), we hypothesized that they may participate in the rescue phenotype observed with miR-138 overexpression and SIN3A inhibition. To identify candidates for further study, we intersected data outputs from all three computational tools. Thirteen candidate genes emerged from the intersection of DAVID, PANTHER, and STRING analyses (Fig. 1C and supplemental Table S1).",
                "RNA Interference Screen of 13 Candidates Reveals Role for SYVN1 and NEDD8 in Rescuing ⌬F508-CFTR Biosynthesis-We used a loss of function screen and three assays to evaluate the effect of gene inhibition on ⌬F508-CFTR biogenesis: 1) surface display of ⌬F508-CFTR in HeLa cells stably expressing HA-tagged ⌬F508-CFTR (HeLa-⌬F508-CFTR-HA) (Fig. 2A); 2) maturation of ⌬F508-CFTR in cystic fibrosis bronchial epithelial (CFBE) cells, an immortalized cell line created from primary bronchial epithelia isolated from a patient with cystic fibrosis (15), as evidenced by fully glycosylated CFTR (band C) (Fig. 2B); and 3) functional rescue of ⌬F508-CFTR in polarized CFBE cells (polarized cells grown at the air-liquid interface to model in vivo physiology) measured as cAMP agonist-induced Cl Ϫ transport (Fig. 2C). All assays were performed in parallel with two experimentally validated Dicer substrate siRNAs (DsiRNAs) for each candidate (supplemental Table S2).",
                "High throughput screens have identified novel compounds, termed correctors, to rescue ⌬F508-CFTR protein trafficking and function in vitro (16 -22). The first of these to reach clinical trials is VX-809 (lumacaftor) (23), but it failed to be efficacious when administered alone (24). We used a VX-809 analog, the CFTR corrector corr-18 (C18) (20), as a positive control and a benchmark treatment. RNAi knockdown of several of the 13 candidate genes achieved significant improvement in one or more of the assays (Fig. 2, A-C). Two genes outperformed C18 on all three assays: SYVN1 and NEDD8. Inhibition of SYVN1 and NEDD8 expression rescued ⌬F508-CFTR trafficking and maturation to levels significantly higher than C18 (Fig. 2, A and B) and improved cAMP-mediated Cl Ϫ transport significantly more than C18 treatment alone (Fig. 2C).",
                "Loss of SYVN1 and NEDD8 Expression Alleviates ⌬F508-CFTR Polyubiquitination-SYVN1 is an E3 ubiquitin-protein ligase and a component of the ERQC system called ERAD, which is involved in ubiquitin-dependent degradation of misfolded ER proteins (25)(26)(27). NEDD8 is a ubiquitin-like protein that is covalently attached to its substrates. Cullins form the largest class of NEDD8 substrates, and attachment of NEDD8 to cullins activates their associated E3 ubiquitin ligase activity and thus promotes polyubiquitination and proteasomal degradation of target proteins (28). The identification of these two genes whose functions converge on the polyubiquitination and proteasomal degradation pathway led us to hypothesize that SYVN1 and NEDD8 promote ⌬F508-CFTR polyubiquitination and that depleting either protein would improve ⌬F508-CFTR maturation in CF cells. To test this hypothesis, we determined the impact of depleting SYVN1 and NEDD8 on ⌬F508-CFTR polyubiquitination. We transfected/treated HeLa-⌬F508-CFTR-HA cells with siSYVN1 and siNEDD8 to effect knockdown; 72 h later, we inhibited the proteasome with MG-132 (10 M) for an hour, harvested protein, immunoprecipitated CFTR with an anti-HA antibody, and blotted for ubiquitin using an anti-ubiquitin antibody. SYVN1 and NEDD8 knockdown each significantly reduced ⌬F508-CFTR ubiquitination compared with the scrambled oligonucleotide (siScr) control (Fig. 3A).",
                "SYVN1/NEDD8 Knockdown Enhances ⌬F508-CFTR Biosynthesis by Proteasome Inhibition-Reduced ⌬F508-CFTR ubiquitination in response to inhibiting SYVN1 or NEDD8 expression suggests either inactivation of the ⌬F508-CFTR ubiquitination machinery or disruption of chaperone complexes that target the misfolded protein for ubiquitination. Either of these scenarios could explain the observed partial restoration of ⌬F508-CFTR trafficking, maturation, and function. To elucidate the impact of SYVN1 and NEDD8 knockdown on CFTR, we measured the membrane stability of the rescued protein by pulse-chase live cell surface ELISA in HeLa-⌬F508-CFTR-HA cells. Twenty-four hours after transfecting cells with the noted reagents, we determined the residence time of ⌬F508-CFTR at the membrane for five time points after begin-ning the chase (chase performed at 37 °C). Although SYVN1 or NEDD8 knockdown increased ⌬F508-CFTR trafficking to the membrane (Fig. 3B), the treatments had little effect on ⌬F508-CFTR membrane stability compared with the negative control (low temperature, 27 °C, treatment) (Fig. 3, C andD).",
                "Because treatment with C18 and low temperature rescues ⌬F508-CFTR processing and function (8,29), we hypothesized that inhibiting SYVN1 or NEDD8 expression (for 72 h) in concert with C18 (6 M for 24 h) or low temperature (27 °C for 24 h) would enhance functional rescue of ⌬F508-CFTR. Combining SYVN1 or NEDD8 knockdown with C18 significantly increased ⌬F508-CFTR trafficking (Fig. 3B) and maturation as measured by band C formation (Fig. 3E) compared with either treatment alone. Of note, C18 has little impact on ⌬F508-CFTR maturation (29), and the absence of fully glycosylated CFTR (band C) is not an indication of drug inaction. A similar improvement in ⌬F508-CFTR trafficking and maturation was observed upon combining SYVN1 or NEDD8 knockdown with low temperature treatment (Fig. 3, B andE). Combining SYVN1 or NEDD8 knockdown with C18 provided no further reduction in ⌬F508-CFTR ubiquitination compared with either treatment alone (Fig. 3A) possibly because C18 treatment had little impact on ⌬F508-CFTR ubiquitination levels. In contrast, a greater reduction in ⌬F508-CFTR ubiquitination was observed upon combining low temperature treatment with either SYVN1 or NEDD8 knockdown (Fig. 3A). Of note, membrane residence of ⌬F508-CFTR significantly improved only upon combining SYVN1 or NEDD8 inhibition with C18 treatment (Fig. 3, C andD). Finally, significantly more ⌬F508-CFTR Cl Ϫ channel activity was observed in polarized CFBE cells upon combining C18 or low temperature with SYVN1 or NEDD8 knockdown compared with either treatment alone (Fig. 3F).",
                "We selected C18 and low temperature for combinatorial treatments because, first, C18 interacts specifically with CFTR and has little impact on the ERQC/ubiquitination pathway (29), and second, ⌬F508-CFTR processing is temperature-sensitive (8, 29 -31), and the effect of low temperature on chaperones/ co-chaperone expression in the ERQC/ubiquitination pathway is well characterized (19,32,33). The combination of SYVN1 and NEDD8 inhibition with either C18 or low temperature significantly enhanced rescue of ⌬F508-CFTR maturation and function. Furthermore, inhibition of either gene reduced ubiquitination independently of C18 or low temperature, and SYVN1 and NEDD8 inhibition had no impact on ⌬F508-CFTR membrane stability. Together, these findings suggest that both SYVN1 and NEDD8 modulate the ubiquitin proteasome pathway regulating ⌬F508-CFTR processing and ubiquitin-mediated degradation.",
                "Ubiquitin Ligase SYVN1 Regulates ⌬F508-CFTR Polyubiquitination by the Ring Finger Protein 5 (RNF5)/Autocrine Motility Factor Receptor (AMFR) Pathway-Ubiquitination is a prerequisite for ⌬F508-CFTR degradation by the ERAD pathway, which facilitates retrotranslocation and proteasomal targeting (27). Distinct E3 ubiquitin ligases have been identified that are involved in ⌬F508-CFTR ubiquitination (34,35). DNAJB12, HSPA8 (Hsc70), and RNF5 (RMA1) are involved in co-translational ubiquitination of ⌬F508-CFTR (36,37), whereas CHIP (STUB1) is involved with ubiquitination of full-length ⌬F508-CFTR (36,38). RNF5 (E3 ubiquitin-protein ligase) and AMFR (Gp78; E3 ubiquitin-protein ligase) are integral to the ⌬F508-CFTR ubiquitination machinery in the ER (34,37). AMFR complexes with RNF5 and specifically promotes polyubiquitination of ⌬F508-CFTR (35). However, overexpression of wild-type AMFR has no effect on the degradation of ⌬F508-CFTR, which suggests that an additional factor(s) is required for the degradation of polyubiquitinated ⌬F508-CFTR (35).",
                "We hypothesized that SYVN1 might be the missing factor that regulates ⌬F508-CFTR ubiquitination and degradation. We included AHSA1 in our studies as it stimulates Hsp90 ATPase activity, thereby regulating chaperone-mediated degradation of ⌬F508-CFTR (21), a mechanism independent of the ER-based ubiquitination machinery. We also included DERL1 because it interacts with the ERAD machinery associated with ⌬F508-CFTR degradation (39). We validated two different DsiRNAs against RNF5, AMFR, AHSA1, and DERL1 (supplemental Table S1) and demonstrated significant improvement in ⌬F508-CFTR maturation upon target gene knockdown in a dose-dependent manner (Fig. 4A). Knockdown of AMFR, RNF5, DERL1, or AHSA1 improved ⌬F508-CFTR trafficking (Fig. 4B), maturation (Fig. 4, A andC), and function in polarized cultures of CFBE cells (Fig. 4D) to varying degrees. These results suggest that multiple pathways may converge on and influence ubiquitin-mediated proteasomal degradation. Notably, SYVN1 knockdown achieved greater ⌬F508-CFTR rescue (Fig. 4, B-D), suggesting that SYVN1 may participate in more than one of the aforementioned pathways for ⌬F508-CFTR degradation. However, these results also raise the possibility that SYVN1 comprises an independent arm of the ERQC machinery that targets ⌬F508-CFTR for ubiquitination and proteasomal degradation.",
                "To investigate further how the ER membrane-associated SYVN1 influences ⌬F508-CFTR ubiquitination, we hypothesized that a combinatorial gene silencing approach would help identify the pathways by which SYVN1 influences ⌬F508-CFTR targeting to the proteasome. Using co-transfected DsiRNAs, we simultaneously reduced SYVN1 expression and either AMFR, RNF5, DERL1, or AHSA1. Although SYVN1 knockdown increased ⌬F508-CFTR trafficking in HeLa cells (Fig. 4B), maturation in CFBE cells (Fig. 4C), and function in polarized cultures of CFBE cells (Fig. 4D), significantly greater rescue was observed only with the combined knockdown of SYVN1 and AHSA1 (Fig. 4, B-D). SYVN1 knockdown reduced ⌬F508-CFTR ubiquitination (Fig. 4E), and only the dual inhibition of SYVN1 and AMFR yielded a greater reduction in ⌬F508-CFTR ubiquitination (Fig. 4E) perhaps because of the role AMFR has in polyubiquitinating ⌬F508-CFTR ubiquitin chains as an E4-like ligase (35) (Fig. 4E). These results suggest that SYVN1 augments the RNF5/AMFR ubiquitination machinery by acting either as a regulator or as a component in a larger complex.  (40). To under-stand the interaction network existing among AMFR, SYVN1, and ⌬F508-CFTR, we immunoprecipitated each of these proteins and blotted for all three proteins. AMFR physically interacts with both ⌬F508-CFTR and SYVN1, but no physical interaction was observed between SYVN1 and ⌬F508-CFTR (Fig. 5A). We next tested the impact of reducing SYVN1 levels on AMFR/⌬F508-CFTR interaction. We reduced SYVN1 levels using DsiRNAs in HeLa-⌬F508-CFTR-HA cells; 72 h later, we inhibited the proteasome with MG-132 (10 M) for an hour, harvested protein, immunoprecipitated CFTR with an anti-HA antibody, and blotted for AMFR. SYVN1 inhibition significantly reduced AMFR/⌬F508-CFTR interaction (Fig. 5B) compared with control treatments. This result could explain why loss of SYVN1 expression resulted in reduced ⌬F508-CFTR ubiquitination.",
                "To test whether the regulatory role exerted by SYVN1 on ⌬F508-CFTR ubiquitination is mediated by its catalytic activity, we exogenously expressed wild-type SYVN1 or a catalytically inactive dominant-negative SYVN1 by transfecting HeLa cells with the respective cDNAs. Exogenous expression of wild-type SYVN1 did not rescue ⌬F508-CFTR trafficking to the cell surface (Fig. 5C) or reduce ubiquitinated ⌬F508-CFTR levels (Fig. 5D). However, expression of the catalytically inactive dominant-negative SYVN1 improved ⌬F508-CFTR trafficking (Fig. 5C) and reduced ⌬F508-CFTR ubiquitination (Fig. 5D) to an extent similar to SYVN1 depletion by DsiRNAs. These results indicate that the rescue phenotype observed with SYVN1 knockdown is due to the loss of its catalytic activity.",
                "NEDD8 Regulates ⌬F508-CFTR Ubiquitination via the Skp, Cullin, F-box (SCF)-containing (SCF FBXO2 ) Complex-The SCF FBXO2 complex binds specifically to proteins with N-linked high mannose oligosaccharides and contributes to ubiquitination of N-glycosylated proteins (41). FBXO2 is an E3 ligase that directly interacts with ⌬F508-CFTR; others include CHIP, RMA1, NEDD4-2, and AMFR (also an E4-like ligase) (34). Yoshida et al. (41) reported that ⌬F508-CFTR is ubiquitinated by the SCF FBXO2 complex in HEK293T and COS7 cells and that loss of the F-box domain in FBXO2 significantly suppressed ⌬F508-CFTR degradation. Their results and our findings suggest a possible mechanism for how NEDD8 inhibition might reduce ⌬F508-CFTR degradation.",
                "We validated two different DsiRNAs against FBXO2 (supplemental Table S1) and demonstrated significant improvement in ⌬F508-CFTR maturation upon target gene knockdown in a dose-dependent manner (Fig. 6A). Inhibition of FBXO2 expression improved ⌬F508-CFTR trafficking in HeLa cells (Fig. 6B), maturation in CFBE cells (Fig. 6, A andC), and function in polarized cultures of CFBE cells (Fig. 6D) to levels similar to that achieved with NEDD8 inhibition. FBXO2 knockdown also significantly reduced ⌬F508-CFTR ubiquitination (Fig. 6E). As NEDD8 stimulates ubiquitination via the cullin-RING ubiquitin ligase (CRL) complexes, these results provide a direct link between NEDD8 and FBXO2-mediated ⌬F508-CFTR ubiquitination.",
                "We next used a combinatorial gene knockdown approach to assess the nature of interactions between NEDD8 and FBXO2 with respect to ⌬F508-CFTR ubiquitination and trafficking. We co-transfected DsiRNAs to reduce NEDD8 and FBXO2 expression either alone or in combination. Remarkably, NEDD8 knockdown, FBXO2 knockdown, or the combined inhibition all yielded similar improvements in ⌬F508-CFTR trafficking in HeLa cells (Fig. 6B), maturation in CFBE cells (Fig. 6, A and C), function in polarized cultures of CFBE cells (Fig. 6D), and reduction in ⌬F508-CFTR ubiquitination (Fig. 6E), supporting their interdependence within the SCF FBXO2 complex for ⌬F508-CFTR degradation. Interestingly, combining SYVN1 knockdown with either NEDD8 or FBXO2 inhibition further improved ⌬F508-CFTR biosynthesis. Trafficking, maturation, and functional rescue of the mutant protein were significantly greater with the combinations of SYVN1/NEDD8 and SYVN1/FBXO2 compared with each knockdown alone (Fig. 6, B-D). Similarly, ⌬F508-CFTR ubiquitination was maximally reduced by SYVN1 knockdown paired with either NEDD8 or FBXO2 inhibition (Fig. 6E). These results suggest that FBXO2 and NEDD8 act via the same pathway, which is distinct from the effects of SYVN1, and that the SCF FBXO2 complex is involved in ⌬F508-CFTR ubiquitination and degradation in airway epithelia.",
                "Of note, the SYVN1/NEDD8 combined knockdown gave consistently better results than the SYVN1/FBXO2 combination on all measures (Fig. 6, B-E), conferring the greatest overall improvement in ⌬F508-CFTR biosynthesis. Together, these results suggest that SYVN1 and NEDD8, although acting via different pathways, are complementary in directing mutant CFTR to the proteasome and may be suitable therapeutic targets for optimal ⌬F508-CFTR reconstitution.",
                "Inhibiting SYVN1 and NEDD8 Expression Rescues cAMP-dependent Anion Transport in Cultured Primary CF Airway Epithelia-Encouraged by these results, we next reduced SYVN1, NEDD8, and FBXO2 expression in primary cultures of CF airway epithelia homozygous for the ⌬F508 mutation. At 14 days post-transfection, we observed significantly improved cAMP-activated Cl Ϫ channel activity in cells from multiple human donors (Fig. 7A). Combining these individual treatments with C18 further improved CFTR-dependent Cl Ϫ transport (Fig. 7A).",
                "To evaluate the possibility that knockdown of either SYVN1 or NEDD8 was cytotoxic, we transfected primary airway epi- thelial cells from three non-CF donors and grew them at the air-liquid interface (ALI). We measured lactate dehydrogenase (LDH) release from the apical and basolateral compartments at 4-day intervals for 28 days (Fig. 7B) and performed hematoxylin and eosin staining on similar cultures at days 14 and 28 to assess changes in cell morphology (Fig. 7C). No differences were observed among untreated, siScr-, SYVN1 DsiRNA-, or NEDD8 DsiRNA-transfected cells. These results suggest that prolonged inhibition of SYVN1 or NEDD8 expression is well tolerated by airway epithelial cells."
            ],
            "subsections": [
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "Our previous study revealed a gene expression network associated with improved ⌬F508-CFTR biosynthesis and functional rescue (9). In the present study, we mined these data to identify individual gene targets with putative roles along the ERQC-ERAD pathways. Here, we show that inhibiting SYVN1, NEDD8, or FBXO2 expression restores intracellular transport and function of ⌬F508-CFTR in primary CF airway epithelial cells. This rescue phenotype is most likely mediated by impairing the ERAD/ubiquitination machinery that targets ⌬F508-CFTR for proteasomal degradation.",
                        "SYVN1 depletion decreased ⌬F508-CFTR ubiquitination. This result suggested that SYVN1, an E3 ubiquitin ligase, was involved in regulating ⌬F508-CFTR polyubiquitination. We also observed significantly less ubiquitinated ⌬F508-CFTR upon combining SYVN1 knockdown with low temperature. In contrast, combining SYVN1 knockdown with C18 treatment failed to decrease ubiquitinated ⌬F508-CFTR levels further. Upon measuring ⌬F508-CFTR channel function, both C18 and low temperature treatment enhanced the level of rescue observed with SYVN1 knockdown alone. The results with low temperature treatment are particularly interesting. Although C18 specifically interacts with ⌬F508-CFTR and modulates its folding (as observed with improved membrane residence times when combined with SYVN1 or NEDD8 knockdown), low temperature has a dramatic effect on chaperone and co-chaperone complexes that target ⌬F508-CFTR to the proteasome. The observed cooperativity in maturation and functional rescue between SYVN1 knockdown and low temperature suggests a shared group of genes or protein complexes involved in ⌬F508-CFTR ubiquitination and degradation. If such overlap exists it might provide insight into how, in the presence of low temperature or SYVN1 knockdown, ⌬F508-CFTR escapes the Hsc70-CHIP E3 complex that monitors the conformation of different regions of nascent CFTR (36,38).",
                        "Multiple pathways contribute to ⌬F508-CFTR ubiquitination and delivery to the proteasome, a feature we exploited in determining whether SYVN1 was part of the RNF5-AMFR net- work. In addition to its known role in ubiquitinating multiple substrates, AMFR (gp78) also functions as an E4-like ligase and extends ubiquitin chains on ⌬F508-CFTR (34,35). Morito et al. (35) demonstrated that RNF5 (RMA1) worked upstream of AMFR by monoubiquitinating ⌬F508-CFTR. AMFR recognizes the ubiquitin already conjugated to ⌬F508-CFTR via the coupling of ubiquitin to ER degradation domain and further catalyzes ubiquitin chain formation in a manner similar to that of a multiubiquitin chain assembly factor (E4-like) (35). We noticed that ⌬F508-CFTR rescue was further modestly increased when SYVN1 and AHSA1 knockdown were com-bined, whereas a similar combination of SYVN1 knockdown with depletion of RNF5 or AMFR failed to further enhance the rescue phenotype. This suggests that SYVN1 works together with RNF5-AMFR in the same pathway to mediate ubiquitination of ⌬F508-CFTR. Furthermore, the rescue phenotype likely requires loss of SYVN1 catalytic activity as the expression of a catalytically inactive SYVN1 recapitulated results observed with SYVN1 knockdown.",
                        "Recent studies suggest that SYVN1 and AMFR act in sequence to promote misfolded protein turnover; SYVN1 is involved in retrotranslocation and ubiquitination of ERAD sub- strates, whereas AMFR provides an accessory function downstream of SYVN1 probably through interaction with the cytosolic chaperone BAG6 (40). This suggests that AMFR primarily functions to maintain the solubility of retrotranslocated polypeptides (42). Furthermore, SYVN1 is essential for ubiquitination of both luminal and membrane ERAD substrates, whereas AMFR does not share a similar role in retrotranslocation as transmembrane domains of AMFR are dispensable for ERAD (40,43). These studies and others point to an increasingly important role for SYVN1 in ERAD and possibly an essential role in ⌬F508-CFTR degradation.",
                        "Our results regarding the effects of SYVN1 inhibition and CFTR function must be interpreted within the confines of the cell system used. We examined CFTR within cultured primary airway epithelial cells, a model with many similarities to respiratory epithelia in vivo. Here, several complementary experimental approaches show that SYVN1 plays a significant role in degrading ⌬508-CFTR. In other non-differentiated cell types and heterologous expression systems, the precise role of SYVN1 in ⌬F508-CFTR degradation is controversial and may reflect cell type differences that are not applicable to CFTR biogenesis in pulmonary epithelia (35,44). We also used experimentally validated, chemically modified DsiRNAs to inhibit gene expression, a method with high potency, reproducibility, and a low off-target profile (45). Moreover, AMFR is a highly unstable protein in contrast to the more stable SYVN1 (46,47), suggesting that our approach captured the dynamic interaction between AMFR and SYVN1 and their influence on CFTR. Our results corroborate findings of Okiyoneda et al. (48) who showed that SYVN1 inhibition improved ⌬F508-CFTR trafficking to the plasma membrane in HeLa cells. Additionally, Gnann et al. (49) demonstrated that SYVN1 knockdown in yeast stabilized ⌬F508-CFTR.",
                        "NEDD8 knockdown resulted in partial rescue of ⌬F508-CFTR processing and function and decreased ⌬F508-CFTR ubiquitination. NEDD8 stimulates ubiquitination via the CRL complexes upon covalent attachment to cullin. CRLs constitute the largest E3 ubiquitin ligase group, comprising Ͼ40% of all ubiquitin ligases (50). Our findings suggest a model wherein the positive effect of NEDD8 on ⌬F508-CFTR rescue relates to its influence on the activity of the Cul1-based E3 ligase complex, SCF FBXO2 . Therefore, the SCF FBXO2 complex may contribute significantly to the ubiquitination and degradation of ⌬F508-CFTR in airway epithelia. Directly inhibiting FBXO2 expression also partially restored ⌬F508-CFTR trafficking, maturation, and function while simultaneously reducing ⌬F508-CFTR ubiquitination. The failure of the combined knockdown of NEDD8 and FBXO2 to exhibit additive effects on ⌬F508-CFTR rescue supports the notion that FBXO2 acts downstream of NEDD8. Further studies are needed to understand whether the SCF FBXO2 complex is the only NEDD8-regulated complex ubiquitinating ⌬F508-CFTR. It is worth noting that, although we achieved potent target gene inhibition and minimized offtarget effects by using chemically modified DsiRNAs (45, 51), we did not assess whether restoration of ⌬F508-CFTR trafficking, maturation, and/or function was a consequence of inhibiting two complementary pathways or severely impairing a single pathway. Such conclusions are beyond the scope of this work. Further studies will be required to understand how these pathways might interact and influence CFTR biosynthesis.",
                        "Although the biological significance of these findings on CFTR biology is evident, an important question is: are these pathways therapeutic targets for CF? The ubiquitin-proteasome system and SCF biology have been an active area of drug discovery for many years (52)(53)(54), and more broad spectrum inhibitors of the 26S proteosome such as bortezomib are in clinical trials to treat malignancies (55). MLN4924 targets the NEDD8-activating enzyme, thereby preventing the neddylation (activation) of cullin-RING proteins. This prevents ubiquitination by SCF complexes, promoting apoptosis and autophagy in targeted cells (56,57). We tested MLN4924 for efficacy in rescuing ⌬F508-CFTR-mediated Cl Ϫ transport in CFBE cells at six different doses ranging from 1 nM to 100 M. Unfortunately, MLN4924 was toxic to epithelial cells and was only tolerated at doses that did not inhibit neddylation. 4 Most F-box proteins are poorly understood, and thus inhibitor development has been slow. Recently, manipulating proteostasis has received attention as a means to rescue ⌬F508-CFTR function (58 -60). As more selective compounds are developed, targeting specific proteins in the ubiquitin-proteasome system or SCF complexes in airway epithelia may become feasible.",
                        "In summary, inhibition of SYVN1 (Hrd1; E3 ubiquitin ligase), FBXO2 (Fbs1; E3 ubiquitin ligase), or NEDD8 (neddylation) partially rescued ⌬F508-CFTR protein maturation and significantly improved ⌬F508-CFTR-mediated Cl Ϫ transport. Importantly, these effects were further amplified by co-treatment with a CFTR corrector compound (C18). These results suggest that SYVN1 and FBXO2 represent two distinct multiprotein complexes that may degrade ⌬F508-CFTR in airway epithelia and identify a new role for NEDD8 in regulating ⌬F508-CFTR ubiquitination. Our results provide new insights into CFTR biogenesis and confirm the validity of this discovery strategy. The gene products identified using this strategy may represent new targets for CF therapies."
                    ],
                    "subsections": []
                },
                {
                    "title": "Experimental Procedures",
                    "paragraphs": [
                        "Primary Human Airway Epithelia-Airway epithelial cells from human trachea and primary bronchus were dissociated from native tissue by Pronase enzyme digestion. Permeable membrane inserts (0.6-cm 2 Millipore polycarbonate filter and 0.33-cm 2 Costar polyester) precoated with human placental collagen (type IV; Sigma) were seeded with freshly dissociated epithelia. Seeding culture medium used was DMEM/F-12 medium supplemented with 5% FBS, 50 units/ml penicillin, 50 g/ml streptomycin, 50 g/ml gentamicin, 2 g/ml fluconazole, and 1.25 g/ml amphotericin B. For epithelia from CF patients, the following additional antibiotics were used for the first 5 days: 77 g/ml ceftazidime, 12.5 g/ml imipenem and cilastatin, 80 g/ml tobramycin, and 25 g/ml piperacillin and tazobactam. After seeding, the cultures were maintained in DMEM/F-12 medium supplemented with 2% Ultroser G (Pall Biosepra) and the above listed antibiotics.",
                        "RNA Isolation-Total RNA from primary human airway epithelial cells, HeLa cells, and CFBE cells was isolated using the mirVana TM microRNA isolation kit, TRIzol reagent (Life Technologies) (61), or the SV96 Total RNA Isolation System (Promega, Madison, WI) according to the manufacturers' protocols. Total RNA was tested for quality on an Agilent Model 2100 Bioanalyzer (Agilent Technologies, Santa Clara, CA). Only samples with an RNA integrity number over 7.0 were selected for downstream processing.",
                        "Oligonucleotide Transfections-These protocols were described in detail previously (62). Briefly, freshly dissociated human airway epithelial cells, CFBE cells, or HeLa cells were transfected in precoated 96-well plates (Costar) or Transwell TM permeable supports (0.33-cm 2 0.4-m polyester membrane, Costar 3470). Lipofectamine TM RNAiMAX (Invitrogen) (manufacturer's recommended concentration) was used as a reverse transfection reagent. Precoated (with human placental collagen type IV) substrates were incubated with the transfection mixture comprising Opti-MEM (Invitrogen), oligonucleotide (Integrated DNA Technologies) and Lipofectamine RNAiMAX. 15-20 min later, 150,000 freshly dissociated cells suspended in DMEM/ F-12 were added to each well/insert. Between 4 and 6 h later, all medium from the apical surface was aspirated, and complete medium was added to the basolateral surface. Medium on the basolateral surface was changed every 3-4 days. For human primary epithelial cultures, Ultroser G medium described above was used. For cultures from immortalized cell lines HeLa and CFBE41oϪ (termed CFBE throughout ( 15)), complete medium specific to each cell line was used (for HeLa, modified Eagle's medium (Gibco) ϩ 10% FBS (Atlanta Biologicals) ϩ 1% penicillin-streptomycin Strep (Gibco); for CFBE, advanced DMEM (Gibco) ϩ 1% L-glutamine (Gibco) ϩ 10% FBS ϩ 1% penicillin-streptomycin).",
                        "Oligonucleotide Reagents-Ten DsiRNAs were designed and screened against each gene (data not shown), and the two best performing DsiRNAs were taken forward for additional studies (supplemental Table S2). The DsiRNAs were designed (64,65), synthesized, and validated (45,51) by Integrated DNA Technologies. All accompanying control sequences (Scr) were also generated by Integrated DNA Technologies.",
                        "Quantitative RT-PCR-First strand cDNA was synthesized using SuperScript II (Invitrogen) with oligo(dT) and random hexamer priming. Sequence-specific PrimeTime quantitative PCR assays were procured for the following human genes from Integrated DNA Technologies: SIN3A, DERL1, HSPA8, HSPA5, DNAJB12, BAG1, NHERF1, CAPNS1, HSPB1, HSPA1A, MARCH2, HSP90B1, RNF128, CANX, GRIP1, SYVN1, DAB2, RCN2, GOPC, HSPA9, MARCH3, PPP2R1B, RCN1, BAG2, STP6V1A, DNAJC3, CFTR, SIN3A, AMFR, RNF5, AHSA1, NEDD8, FBXO2, GAPDH, HPRT, and SFRS9. All reactions were set up using TaqMan Fast Universal PCR Master Mix (Applied Biosystems) and run on the Applied Biosystems 7900 HT Real-Time PCR system. All experiments were performed in quadruplicate.",
                        "Electrophysiology Studies-Transepithelial Cl Ϫ current measurements were made in Ussing chambers Ն2 weeks postseeding as reported (66). Briefly, primary air-liquid interface cultures of airway epithelia or polarized CFBE cultures were mounted in Ussing chambers (EasyMount P2300 chamber system, Physiologic Instruments, San Diego, CA), voltageclamped (model VCCMC8-4S, Physiologic Instruments SDS-PAGE and Immunoblotting-Cell lines were washed with PBS and lysed in freshly prepared lysis buffer (1% Triton, 25 mM Tris, pH 7.4, 150 mM NaCl, and protease inhibitors (cOmplete TM , mini, EDTA-free, Roche Applied Science)) for 30 min at 4 °C. The lysates were centrifuged at 14,000 rpm for 20 min at 4 °C, and the supernatant was quantified by BCA Protein Assay kit (Pierce). CFTR was denatured in 6ϫ sample SDS buffer (375 mM Tris-HCl, pH 6.8, 6% SDS, 48% glycerol, 9% 2-mercaptoethanol, and 0.03% bromphenol blue). 20 g (HeLa and CFBE) of protein/lane was separated by 7% SDS-PAGE for Western blotting analysis. Protein abundance was quantified by densitometry using an Alpha Innotech Fluorochem imager. For CFTR, bands B and C were quantified separately. Western blots were probed, stripped, and reprobed as follows. PVDF membranes were first probed with the antibody against the gene of interest. After imaging, the PVDF membrane was stripped with Restore Western Blot Stripping Buffer (Thermo Scientific) for 15 min, washed in Tris-buffered saline-Tween (TBS-T) and blocked in 5% bovine serum albumin (BSA; Pierce) for 1 h. The membrane was washed in TBS-T and incubated with the goat anti-mouse secondary antibody (1:10,000; Sigma) for 1 h and imaged. If signal was detected, the stripping procedure was repeated until no signal was observed. The membrane was washed in TBS-T, blocked for 1 h in 5% BSA, and reprobed with the antibody against tubulin. Antibodies used were sourced as follows: CFTR (R-769, Cystic Fibrosis Foundation Therapeutics, Inc.), hemagglutinin (HA.11 clone 16B12 monoclonal antibody, Covance), ␣-tubulin (clone DM1A, Sigma), SYVN1 (ab38456, Abcam), NEDD8 (ab38634, Abcam), FBXO2 (ab96391, Abcam), AMFR (ab101284, Abcam), RNF5 (ab128200, Abcam), AHSA1 (ab56721, Abcam), and ubiquitin (ab140601, Abcam).",
                        "CFTR Ubiquitination Measurements-Cells were treated with 10 M MG-132 in the last 1 h of incubation and then lysed in lysis buffer (1% Triton, 25 mM Tris, pH 7.4, 150 mM NaCl, protease inhibitors (cOmplete TM , mini, EDTA-free), 5 mM N-ethylmaleimide, and 20 M MG-132) for 30 min at 4 °C. The lysates were centrifuged at 14,000 rpm for 20 min at 4 °C, and the supernatant was quantified by BCA Protein Assay kit. CFTR was precipitated with the anti-HA antibody. The immunoprecipitates were analyzed by immunoblotting with anti-ubiquitin and anti-HA antibodies. CFTR ubiquitination level with molecular masses Ͼ180 kDa was measured by densitometry and normalized for the CFTR level in the precipitate.",
                        "Immunoprecipitation-Immunoprecipitation (IP) experiments were performed in HeLa cells stably expressing ⌬F508-CFTR-HA. For IP of ⌬F508-CFTR, cells were lysed (as described above), and supernatant (20 -50 g of protein) was incubated with either anti-HA (for IP of CFTR) or anti-AMFR for 1 h at 4 °C followed by incubation with protein G-agarose (Invitrogen) for 1 h at 4 °C. Immunoprecipitates were washed four times with lysis buffer and eluted in 6ϫ sample SDS buffer. Samples were analyzed by immunoblotting as described above.",
                        "Measuring Cell Surface Display of CFTR-HeLa cells stably expressing wild-type CFTR or CFTR-⌬F508 were kindly provided by Dr. G. Lukacs (31,63). Cell surface ELISA was performed on these cells (48) after noted treatments. HeLa cells were transfected/treated in 96-well plates (Costar). Briefly, the plate containing the cells was moved to a cold room (4 °C), and the medium used was ice-cold. Cells were washed with PBS and blocked for 30 min with PBS containing 5% BSA. Anti-HA primary antibody (Covance) was added in 5% BSA in PBS at a 1:1000 concentration for 1 h. Cells were washed with PBS, and anti-mouse secondary antibody (HRP-conjugated; Amersham Biosciences) was added to cells at 1:1000 concentration in 5% BSA in PBS for 1 h. Cells were washed thoroughly, and signal was developed using SureBlue Reserve TM 3,3Ј,5,5Ј-tetramethylbenzidine microwell substrate (Kirkegaard & Perry Laboratories, Inc.). The reaction was stopped and read on a VersaMax TM microplate reader (Molecular Devices) at 540 nm using the SoftMax Pro Software (Molecular Devices). For normalization, cells were lysed, and total protein was quantitated using the BCA Protein Assay kit. The experiment was performed in quadruplicate, and the data are presented as a mean Ϯ S.D. of individual data points.",
                        "Measuring Membrane Residence of ⌬F508-CFTR in HeLa Cells-The methods for measuring membrane residence time are similar to that of measuring cell surface display with slight modifications. 72 h post-treatment, cells were moved to 4 °C. The cells were incubated in primary anti-HA antibody for 1 h and washed in ice-cold PBS. The cells were then exposed to the secondary antibody for 1 h, washed with ice-cold PBS, and incubated at 37 °C for the chase. Surface ⌬F508-CFTR was detected using Amplex Ultra Red reagent. The readings were made at 37 °C at the following time points: 0, 30, 60, 90, 120, and 240 min."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Distinct",
            "paragraphs": [
                "LDH Cytotoxicity Assay-Primary airway epithelial cell cultures from three non-CF human donors were untreated or transfected with the following reagents: siScr, SYVN1 DsiRNA, and NEDD8 DsiRNA. The apical surface was washed, and the basolateral medium was collected on days 4, 8, 12, 16, 20, 24, and 28 post-transfection. An LDH cytotoxicity assay kit (Cayman Chemical) was used to measure the levels of lactate dehydrogenase in the washes and basolateral medium. Percentage of toxicity and viability were computed based on LDH levels. Data were normalized to untransfected cells.",
                "Histochemistry-Epithelial sheets on filters were fixed with zinc formalin, embedded in paraffin, sectioned at 5-m thickness, and stained with hematoxylin (Leica Biosystems) and eosin (Sigma) stain. Sections were visualized by light microscopy.",
                "Statistical Analysis-All statistical analysis was done using GraphPad Prism version 6.0h. Normality of data was tested using the D'Agostino and Pearson omnibus normality test. One-way ANOVA with Holm-Bonferroni multiple comparison test was used to determine significance. Statistics used in individual experiments along with the method of presenting data and error bars are described in the figure legends."
            ],
            "subsections": []
        }
    ]
}