{
    "id": "US20140327448",
    "authors": [
        "Il Dong Kim",
        "Jin Rak Lee"
    ],
    "title": "SYSTEM AND METHOD FOR MONITORING POWER FACILITY STATUS BY MESAURING ONLINE ELECTRIC CIRCUIT PARAMETER",
    "date": "2012-09-19 00:00:00",
    "abstract": "The present invention relates to a system and a method for monitoring a power facility by measuring from online a line parameter of the power facility that is in operation, and the system for monitoring the power facility, according to the present invention, sets a measurement time and selects a facility to be measured in accordance with external input, receives current and voltage data which are measured from the facility to be measured, extracts the current and voltage data that are simultaneously measured at the measurement time that is set, by referencing time information that is tagged on the current and voltage data that are inputted, removes zero-phase-sequence component from the current and voltage data, outputs the line parameter with respect to the facility to be measured that is selected by using the current and voltage data from which the zero-phase-sequence component is removed, determines the electrical status of the facility including malfunction and various connection statuses depending on whether the size or the increase/decrease rate of the line parameter that is outputted is beyond a predetermined standard value to output a status notification message or a trip signal, thereby monitoring/controlling the status of the facility to be measured.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a system and method for monitoring a state of a power facility by measuring electric circuit parameters on-line, which can correctly diagnose and monitor a state of an operating power facility by measuring and monitoring line parameters (resistance R, inductance L, capacitance C, and leakage conductance g) of the power facility on-line."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to power facility monitoring"
                    ],
                    "num_characters": 371,
                    "outline_medium": [
                        "relate to power facility monitoring"
                    ],
                    "outline_short": [
                        "introduce power facility monitoring"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "A change in a state of a power facility is expressed as changes in line parameters (resistance R, inductance L, capacitance C, and leakage conductance g). However, since there is no way for measuring the line parameters of an operating power facility until now, a state of the power facility is estimated and used by attaching a plurality of sensors to the power facility and sensing changes in temperature, pressure and vibration, a partial discharge phenomenon and the like, which are secondary physical phenomena generated from the changes in the line parameters of the facility.",
                        "In the case of a method using sensors, there may be an area in which an abnormal state cannot be measured depending on positions, quantities and distribution of installed sensors. For example, when the abnormal state is sensed by temperature, since the temperature is not measured from all parts of the facility, but only excessive heat or a change in temperature is detected at portions where temperature sensors are installed, there is an area in which an abnormal state cannot be sensed.",
                        "In addition, since there is a time delay until the secondary physical phenomena generated by the changes in the power facility itself are appeared, there is a limit to some extent in monitoring an abnormal state of the facility, and, particularly, in the case of a transmission line installed across a wide area, a plurality of sensors is installed, and thus it is impractical since there are a lot of difficulties in maintenance.",
                        "Furthermore, until now, there is no technique for monitoring on-line connections of circuit breakers, switches or the like connecting various connection parts of the power facility itself to various facilities, bad states of contacting parts, disconnections of wires in an old facility or the like, and measuring and monitoring on-line changes in leakage conductance and capacitance which show an insulation state of the facility. However, these phenomena can be measured at all times by the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "express power facility state",
                        "limitations of sensor-based methods",
                        "difficulties in maintenance",
                        "lack of on-line monitoring techniques"
                    ],
                    "num_characters": 2018,
                    "outline_medium": [
                        "limitations of sensor-based methods",
                        "need for on-line monitoring"
                    ],
                    "outline_short": [
                        "limitations of sensor-based methods"
                    ]
                },
                {
                    "title": "DISCLOSURE OF INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Technical Problem",
                            "paragraphs": [
                                "Therefore, the present invention has been made in view of the above problems, and it is an object of the present invention to provide a system and method for monitoring a state of a power facility by measuring electric circuit parameters on-line, which can measure line parameters (resistance R, inductance L, capacitance C, and leakage conductance g), which are unique physical quantities of its own, existing in the power facility while operating the power facility and monitor a state of the power facility (a connection state and an insulation state) based on the measured values."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "identify problems in power facility monitoring"
                            ],
                            "num_characters": 584,
                            "outline_medium": [
                                "define technical problem"
                            ],
                            "outline_short": [
                                "motivate on-line monitoring"
                            ]
                        },
                        {
                            "title": "Technical Solution",
                            "paragraphs": [
                                "To accomplish the above object, according to one aspect of the present invention, there is provided a system for monitoring a state of a power facility using line parameters, the system comprising: a measurement device including an analog-to-digital (A/D) converter for simultaneously sampling and converting current and voltage of the power facility measured through a current transformer (CT) and a potential transformer (PT) into digital signals by synchronizing the current and voltage to a time synchronization signal, a global positioning system (GPS) module for providing the A/D converter with the time synchronization signal, and a communication module for transmitting the current and voltage signals output from the A/D converter through Ethernet; a power facility state monitoring device including an input unit for inputting measurement data transmitted through the communication module, an operation unit for calculating line parameters of a monitored target power facility using the measurement data input through the input unit, a communication unit for transmitting the calculated line parameters according to a certain communication specification, and a monitor and control unit for monitoring and controlling the power facility by controlling operation of each of the constitutional components described above, determining existence of an abnormal state according to whether or not a magnitude or an increase or decrease rate of the calculated line parameters goes out of a predetermined reference value, and outputting an alarm, a state alarm message or a trip signal; and a human machine interface (HMI) for estimating a state of the power facility using the line parameters provided from the power facility state monitoring device.",
                                "According to another aspect of the present invention, there is provided a method of monitoring a state of a power facility by measuring line parameters, the method comprising the steps of setting a measurement time and selecting a measurement target facility according to an external input; inputting current and voltage data measured at the selected measurement target facility; extracting current and voltage data corresponding to the set measurement time with reference to time information tagged on the input current and voltage data; removing an zero-phase-sequence component from the extracted current and voltage data; calculating the line parameters of the selected measurement target facility using the current and voltage data from which the zero-phase-sequence component is removed; and determining existence of abnormality of the power facility according to whether or not an increase or decrease rate or magnitude of absolute values of the calculated line parameters goes out of a predetermined reference value, and outputting an alarm, a state alarm message or a trip signal."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide system for monitoring power facility",
                                "describe measurement device",
                                "describe power facility state monitoring device",
                                "describe human machine interface",
                                "describe method of monitoring power facility"
                            ],
                            "num_characters": 2844,
                            "outline_medium": [
                                "describe system for monitoring power facility",
                                "describe method for monitoring power facility"
                            ],
                            "outline_short": [
                                "describe system and method"
                            ]
                        },
                        {
                            "title": "Advantageous Effects",
                            "paragraphs": [
                                "Accordingly, since occurrence of an abnormal state in a power facility is a change in an electric circuit parameter (R, L, C or g) which is a primary physical phenomenon, the present invention may correctly monitor a state of the power facility by measuring and monitoring the parameters.",
                                "The present invention may diagnose a state of a power facility and grasp abnormality of the power facility by simultaneously measuring input and output voltage and current at both ends of the power facility, receiving the input and output data through a communication means or the like used for a smart grid, calculating electrical line parameters of the power facility and constantly monitoring the line parameters."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize benefits of invention"
                            ],
                            "num_characters": 706,
                            "outline_medium": [
                                "summarize benefits of invention"
                            ],
                            "outline_short": [
                                "summarize benefits"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "DESCRIPTION OF SYMBOLS",
                    "paragraphs": [
                        "- **1**: Current Transformer\n- **2**: Potential Transformer\n- **10**: Measurement device\n- **20**: Power facility state monitoring device\n- **30**: HMI"
                    ],
                    "subsections": [],
                    "outline_long": [
                        "list symbols used in patent application"
                    ],
                    "num_characters": 151,
                    "outline_medium": [
                        "list symbols used"
                    ],
                    "outline_short": [
                        "define symbols"
                    ]
                },
                {
                    "title": "BEST MODE FOR CARRYING OUT THE INVENTION",
                    "paragraphs": [
                        "A system for monitoring a state of a power facility by measuring line parameters (circuit parameters) on-line according to the present invention will be hereafter described in detail, with reference to the accompanying drawings.",
                        "FIG. 1 is a view showing the configuration of a system for monitoring a state of a power facility related to the present invention.",
                        "The system for monitoring a state of a power facility includes a measurement device 10 for simultaneously measuring three-phase current and voltage at both ends of a monitored area of a transmission line, a power facility state monitoring device 20 for calculating line parameters using measurement data measured through the measurement device 10, and a human machine interface (HMI) 30 for receiving the line parameters from the power facility state monitoring device 20, storing the line parameters in a database, and determining and monitoring a state of the power facility by monitoring the state by time and by season based on the received line parameters.",
                        "These devices use a communication program manufactured to meet the information communication (IT) specification of a digital substation to which the units are installed and applied. An information communication network of a substation is configured of a process bus, which is a communication medium between the measurement device 10 and the power facility state monitoring device 20, and a station bus, which is a communication medium between the power facility state monitoring device 20 and the HMI 30.",
                        "The measurement device 10 transmits measurement data input from a current transformer (CT) 1 and a potential transformer (PT) 2 installed in a plurality of points to the power facility state monitoring device 20 through an Ethernet network. The current transformer 1 and the potential transformer 2 are installed at both ends of a power facility to be monitored and measure current and voltage flowing through the power facility. In addition, a gas insulated switchgear (GIS) 3 configured of a circuit breaker, a disconnecting switch and the like exists at both ends of the power facility to be monitored.",
                        "The power facility state monitoring device 20 receives three-phase voltage and current as sample value signals from the measurement device 10, calculates line parameters of each facility through four-terminal line parameter calculation using data of the same measurement time among the three-phase voltage and current, and stores the line parameters in memory. In addition, the power facility state monitoring device 20 transmits the line parameters stored in the memory to the HMI 30 as sample value signals through a communication protocol of the substation.",
                        "The power facility state monitoring device 20 monitors and controls the power facility by determining abnormality based on whether or not an increase and decrease rate of the calculated line parameter is out of a predetermined reference value and outputting an alarm, a state notification message or a trip signal. The power facility state monitoring device 20 transmits state information of the power facility to the HMI 30. The state information of the power facility includes an open/close state of the circuit breaker.",
                        "FIG. 2 is a block diagram showing the measurement device 10 of FIG. 1.",
                        "Referring to FIG. 2, the measurement device 10 includes an analog-to-digital (A/D) conversion unit 11, a communication module 12 and a global positioning system (GPS) reception module 13.",
                        "The A/D conversion unit 11 converts the measurement data (a current value and a voltage value) output from the current transformer 1 measuring current of the power facility and the potential transformer 2 measuring voltage of the power facility into digital data by synchronizing the measurement data to a time synchronization signal.",
                        "The communication module 12 transmits the digital data output from the A/D conversion unit 11 to the power facility state monitoring device 20 as a sample value through the Ethernet.",
                        "The GPS reception module 13 receives international standard time information from a satellite through an antenna (ANT) and transmits the time information to the A/D conversion unit 11 in the form of a tag. The A/D conversion unit 11 uses the time information received from the GPS reception module 13 as the time synchronization signal and inserts the time information into the converted digital data as a tag when the measurement data is converted into the digital data.",
                        "FIG. 3 is a block diagram showing the power facility state monitoring device of FIG. 1.",
                        "The power facility state monitoring device 20 includes an input unit 21, a display unit 22, a handling unit 23, an operation unit 24, a power supply unit 25, an output unit 26, a communication unit 27, a storage unit 28 and a monitor and control unit 29.",
                        "The input unit 21 performs a function of receiving a data output from the measurement device 10 and may be configured of a photo coupler and an optic 100B-FX S (input of current and voltage data through LAN). Three-phase current and voltage values of the input and output terminals of the power facility and an open/close state of the circuit breaker are input.",
                        "The display unit 22 displays various kinds of information (set information, menus and the like) related to the operation of the power facility state monitoring device 20 and displays line parameters of a monitored area of the power facility. The display unit 22 may be implemented using a liquid crystal display (LCD), a light emitting diode (LED) or the like or implemented as a touch screen. When the display unit 22 is implemented as a touch screen, the display unit 22 may perform a function of an input device as well as a display device.",
                        "The handling unit 23 is configured of keys for selecting menus and setting data.",
                        "The operation unit 24 receives three-phase voltage and current values having the same time information from the measurement device 10 and calculates line parameters of a monitoring target facility through a line parameter calculation process. The line parameters include resistance R and inductance L, which are series impedance, and capacitance C and leakage conductance g, which are parallel admittance.",
                        "The operation unit 24 may be implemented in a digital signal processor. For example, the operation unit may be implemented in TMS320F28335.",
                        "The power supply unit 25 is implemented in an SMPS for supplying power to each of constitutional components configuring the power facility state monitoring device 20. For example, the power supply unit 25 receives DC 125V, which is a control power of a substation, as an input, converts DC 125V into DC 24V, which is an internal input power, and supplies the converted power as an internal power.",
                        "The output unit 26 is configured as an internal relay and outputs an alarm, a message and a trip signal.",
                        "The communication unit 27 is a Linux-based MCU of an ARM series which implements a communication protocol such as IEC61850 and IEC61970, receives a sample value including a time tag attached according to the implemented communication protocol, and outputs the line parameters calculated by the operation unit 24.",
                        "The storage unit 28 stores data values of the monitor and control unit 29, the operation unit 24 and the communication unit 27 and shares internal communication.",
                        "The monitor and control unit 29 monitors and controls operation of the constitutional components described above.",
                        "FIG. 4 is a flowchart illustrating a method of calculating line parameters of a power facility state monitoring device according to an embodiment of the present invention.",
                        "Referring to FIG. 4, the monitor and control unit 29 sets a measurement time (second, minute and hour) of three-phase voltage and current values according to handling of a user on the handling unit and selects a line parameter measurement target facility S11. Here, the measurement target facility includes a short distance facility, a middle distance facility and a long distance facility.",
                        "Next, the monitor and control unit 29 receives three-phase current and voltage values of both ends (input terminal and output terminal) of a plurality of points through a communication with the measurement device 10 and inputs the three-phase current and voltage values into the operation unit 24 S12. At this point, the monitor and control unit 29 confirms the time tag of the measurement data and accesses a measurement data corresponding to the set time tag.",
                        "The operation unit 24 removes zero-phase-sequence components from the measurement data under the control of the monitor and control unit S13. Here, the operation unit 24 calculates current and voltage of the zero-phase-sequence components from the measurement data and removes the current and voltage of the zero-phase-sequence components calculated from the measurement data.",
                        "When the measurement target facility is a short distance facility, the operation unit 24 calculates resistance and inductance (series impedance) among the line parameters using the measurement data S14.",
                        "On the other hand, when the measurement target facility is a middle distance facility, the operation unit 24 calculates four-terminal parameters S15 and calculates line parameters of the middle distance facility including resistance R, inductance L, capacitance C and leakage conductance g through the calculated four-terminal parameters S16.",
                        "On the other hand, when the measurement target facility is a long distance facility, the operation unit 24 converts the facility into a pi-equivalent circuit and calculates four-terminal parameters S17 and S18. Then, the operation unit 24 calculates an attenuation constant and a phase constant and calculates line parameters of the long distance facility S19 and S20.",
                        "The monitor and control unit 29 confirms whether or not the calculated line parameter values go out of a range set by the user S21.",
                        "If the calculated line parameter values go out of the range set by the user, the monitor and control unit 29 outputs an alarm and a state alarm message and controls operation of the circuit breaker by outputting a trip signal S22.",
                        "Hereinafter, a method of calculating the line parameters will be described in detail.",
                        "First, as shown in FIG. 5, the measurement device 10 measures voltage and current values of each phase at the input and output terminals of the power facility at the same time. The operation unit 24 of the power facility state monitoring device 20 calculates a complex number of each phase or a phasor value of another type from the voltage and current values measured by the measurement device 10 under the control of the monitor and control unit 29.",
                        "The voltages of the input and output terminals measured at each phase are expressed as shown in mathematical expression 1.",
                        "Esa=Esar+jEsai",
                        "Esb=Esbr+jEsbi",
                        "Esc=Escr+jEsci",
                        "Era=Erar+jErai",
                        "Erb=Erbr+jErbi",
                        "Erc=Ercr+jErci  [Mathematical expression 1]",
                        "Here, Esa, Esb and Esc are values calculated after measuring voltages of phase A, phase B and phase C at the input terminal, and Era, Erb and Erc are values calculated after measuring voltages of phase A, phase B and phase C at the output terminal. Here, superscript ‘r’ denotes a real part, and superscript ‘i’ denotes an imaginary part.",
                        "That is, the operation unit 24 calculates zero-phase-sequence voltage Eso, of a sending end, zero-phase-sequence current Iso, of the sending end, zero-phase-sequence voltage Ero of a receiving end and zero-phase-sequence current Iro of the receiving end using mathematical expression 2.",
                        "Eso=1/3[Esa+Esb+Esc]",
                        "Iso=1/3[Isa+Isb+Isc]",
                        "Ero=1/3[Era+Erb+Erc]",
                        "Iro=1/3[Ira+Irb+Irc]  [Mathematical expression 2]",
                        "If the current and voltage of the zero-phase-sequence component are calculated at each phase, the operation unit 24 performs a complex number subtraction by subtracting the zero-phase-sequence component obtained from mathematical expression 2 from the voltage and current of each phase calculated at the input and output terminals.",
                        "The phase voltages (Ésa, Ésb, Ésc) and the phase currents (Ísa, Ísb, Ísc) at the sending end and the phase voltages (Éra, Érb, Érc) and the phase currents (Íra, Írb, Írc) at the receiving end, from which the zero-phase-sequence components are removed, are expressed as shown in mathematical expression 3.",
                        "Ésa=Esa−Eso",
                        "Ésb=Esb−Eso",
                        "Ésc=Esc−Eso",
                        "Ísa=Isa−Iso",
                        "Ísb=Isb−Iso",
                        "Ísc=Isc−Iso",
                        "Éra=Era−Ero",
                        "Érb=Erb−Ero",
                        "Érc=Erc−Ero",
                        "Íra=Ira−Iro",
                        "Írb=Irb−Iro",
                        "Írc=Irc−Iro  [Mathematical expression 3]",
                        "Next, a method of calculating line parameters will be described in detail for each measurement target power facility (for each type of transmission line).",
                        "When the transmission line is a short distance line or a short distance in which capacitance or leakage current can be ignored, an equivalent circuit of the short distance facility is expressed as shown in FIG. 6 on the basis of a certain phase and a neutral point, and in this case, the operation unit 24 calculates impedance between both ends using mathematical expression 4.",
                        "\\(\\begin{matrix}\n{Z = {\\frac{E_{sa}^{\\prime} - E_{ra}^{\\prime}}{I_{eq}} = {R + {j\\; \\omega \\; L}}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 4} \\right\\rbrack\n\\end{matrix}\\)",
                        "Actually, resistance R and reactance ωL, which are impedance values of each phase, may be implemented as shown in mathematical expression 5.",
                        "\\(\\begin{matrix}\n{{Z_{a} = {\\frac{E_{sa}^{\\prime} - E_{ra}^{\\prime}}{I_{eq}} = {R_{a} + {j\\; \\omega \\; L_{a}}}}}{Z_{b} = {\\frac{E_{sb}^{\\prime} - E_{rb}^{\\prime}}{I_{eq}} = {R_{b} + {j\\; \\omega \\; L_{b}}}}}{Z_{c} = {\\frac{E_{sc}^{\\prime} - E_{rc}^{\\prime}}{I_{eq}} = {R_{c} + {j\\; \\omega \\; L_{c}}}}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 5} \\right\\rbrack\n\\end{matrix}\\)",
                        "In the case of a short distance facility, since leg is actually a case of I′s=I′r in mathematical expression 5, it can be calculated as Ieg=I′s or Ieq=I′r.",
                        "Next, in the case of a middle distance facility corresponding to an ultra-high voltage short distance line less than 150 Km and an extra-high voltage middle and long distance line (in the case where there is capacitance), an equivalent circuit is expressed as shown in FIG. 7 on the basis of a certain phase, and a four-terminal network is as shown in FIG. 8.",
                        "The operation unit 24 calculates four-terminal parameters in a procedure shown below.",
                        "A relation between voltage and current of an input terminal and voltage and current of an output terminal in the four-terminal network is expressed in the equations as shown in mathematical expression 6.",
                        "Es=AET+BIT",
                        "Is=CET+DIT  [Mathematical expression 6]",
                        "Here, A, B, C and D denote four-terminal line parameters, and A and D are simple proportional constants without a dimension, and B is resistance or impedance of a circuit, which is a constant having a unit of Ohm. In addition, C is admittance of a circuit, which is a constant having a unit of Mho.",
                        "Since mathematical expression 6 has four unknowns (A, B, C and D), at least four equations are required, and thus values of voltage and current Es, Er, Is, and Ir should be measures at least two or more times at different input and output terminals.",
                        "Accordingly, since four equations are established from two sets of voltage and current at the input and output terminals, the four unknowns (A, B, C and D) may be calculated.",
                        "However, if the measurement is repeated while the power facility in a similar driving state, a solution of the equation cannot be obtained since the equation established based on the measured values is similar to an existing one, and thus one of the two methods described below is selected and processed to automatically execute this process. In a first method, an equation is set up using the measured values, and a solution of the four-terminal line parameters A, B, C and D is obtained, and if the solution cannot be obtained since the former and latter equations are similar to each other, the monitor and control unit 29 displays a message saying that “A solution is not obtained” on a message display unit 12. Then, an equation is set up again using voltage and current measured next time, and this is repeated until a solution is obtained.",
                        "In a second method, the newly measured values of voltages and currents Es, Er, Is, and Ir of the input and output terminals are compared with previously measured and stored values, and then two sets of equations shown in FIG. 6 are set up, and a solution of the four-terminal line parameters A, B, C and D is obtained using the newly measured voltages and currents of the input and output terminals only when any one or more of the four values are changed more than a predetermined value (e.g., 20%).",
                        "The equations (set) established for phase A in such a manner are as shown in mathematical expression 7.",
                        "É′sa=AÉra+BÍra",
                        "Ísa=CÉra+DÍra",
                        "Ésa=AÉra+BÍra",
                        "Ísa=CÉra+DÍra  [Mathematical expression 7]",
                        "Here, the superscript ‘1’ denotes a previously measured value, and the superscript ‘2’ denotes a value measured later. All the voltages and currents Es, Er, Is, and Ir of each phase and the line parameters A, B, C and D used in mathematical expression 7 are complex numbers (real value+j imaginary value).",
                        "As described above, in the case of a middle distance line, B among the line parameters A, B, C and D analyzed in the equations is impedance, and C is admittance. Accordingly, line parameters R, L, g and C may be obtained by calculating as shown in mathematical expression 8.",
                        "B=Z=R+jωL",
                        "C=Y=g+jωC  [Mathematical expression 8]",
                        "Here, g denotes leakage conductance.",
                        "Finally, in the case of an ultra-high voltage line of 150 Km or longer and a long distance facility having high capacitance and distributed across the entire section, it can be converted into an equivalent circuit as shown in FIG. 9 and expressed as a distribution constant circuit on the basis of a certain phase.",
                        "At this point, four-terminal network equations are as shown in mathematical expression 9.",
                        "\\(\\begin{matrix}\n{{E_{s} = {{\\cosh \\; \\gamma \\; l\\; E_{r}} + {Z_{\\omega}\\sinh \\; \\gamma \\; l\\; I_{r}}}}{I_{s} = {{\\frac{1}{Z_{\\omega}}\\sinh \\; \\gamma \\; l\\; E_{r}} + {\\cosh \\; \\gamma \\; l\\; I_{r}}}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 9} \\right\\rbrack\n\\end{matrix}\\)",
                        "Here, Zω denotes characteristic impedance or wave impedance and is expressed as shown in mathematical expression 10.",
                        "\\(\\begin{matrix}\n{Z_{\\omega} = {\\sqrt{\\frac{z}{y}} = \\sqrt{\\frac{r + {j\\; x}}{g + {j\\; b}}}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 10} \\right\\rbrack\n\\end{matrix}\\)",
                        "Here, z denotes impedance per unit length, y denotes admittance per unit length, and r denotes a propagation constant. The propagation constant is expressed as shown in mathematical expression 11.",
                        "γ=√{square root over (zy)}=√{square root over ((r+jx)(g+jb))}{square root over ((r+jx)(g+jb))}[Mathematical expression 11]",
                        "Here, l denotes the length of a line.",
                        "In this case, a long distance line can be converted as a pi(π)-equivalent circuit as shown in FIG. 10. Although the pi-equivalent circuit is the same as an existing pi-equivalent circuit, it is different in that Z′ and Y′/2 are used instead of Z and Y.",
                        "A relation as shown in FIG. 12 can be used from the pi-equivalent circuit, and the relation can be applied in calculating an impedance value of a long distance transmission line.",
                        "\\(\\begin{matrix}\n{{E_{s} = {{\\cosh \\; \\gamma \\; l\\; E_{r}} + {Z^{\\prime}I_{r}}}}{I_{s} = {{{Y^{\\prime}\\left( {1 + \\frac{Z^{\\prime}Y^{\\prime}}{4}} \\right)}E_{r}} + {\\cosh \\; \\gamma \\; l\\; I_{r}}}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 12} \\right\\rbrack\n\\end{matrix}\\)",
                        "Here, since cos hγl is the same as A of the pi-equivalent circuit and parameter B is Z′ of the pi-equivalent circuit in mathematical expression 9,",
                        "\\(B = {Z^{\\prime} = {Z{\\frac{\\sinh \\; \\gamma \\; l}{\\gamma \\; l}.}}}\\)",
                        "A process of calculating Z is described.",
                        "Four-terminal line parameters A, B, C and D are calculated from two sets of equations shown in mathematical expression 12, and Z is obtained from B. Here, Z desired to be calculated is as shown in mathematical expression 13.",
                        "\\(\\begin{matrix}\n{Z = {B\\frac{\\gamma \\; l}{\\sinh \\; \\gamma \\; l}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 13} \\right\\rbrack\n\\end{matrix}\\)",
                        "Here, γl is α+jβ, and α denotes an attenuation constant, and β denotes a phase constant.",
                        "Since A of the four-terminal line parameters is the same as cos h γl=cos h(α+jβ), it is that cos h(α+jβ)=Ar+jAr as shown in mathematical expression 14.",
                        "Ar+jAi=1/2[εα cos β+ε−α cos β]+j1/2[εα sin β+ε−α sin β]  [Mathematical expression 14]",
                        "Here, since Ar=1/2[εα cos β+ε−α cos β], it can be expressed as",
                        "\\(\\varepsilon^{\\alpha} = {\\frac{2\\; A_{r}}{\\cos \\; \\beta} - \\varepsilon^{- \\alpha}}\\)",
                        "in terms of εα.",
                        "If",
                        "\\(\\varepsilon^{\\alpha} = {\\frac{2\\; A_{r}}{\\cos \\; \\beta} - \\varepsilon^{- \\alpha}}\\)",
                        "is put into Ai=1/2[εα sin β+ε−α sin β], it can be expressed as shown in mathematical expression 15.",
                        "\\(\\begin{matrix}\n{\\varepsilon^{- \\alpha} = {{\\frac{- A_{i}}{\\sin \\; \\beta} + \\frac{A_{r}}{\\cos \\; \\beta}} = \\frac{{A_{r}\\sin \\; \\beta} - {A_{i}\\cos \\; \\beta}}{\\sin \\; \\beta \\; \\cos \\; \\beta}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 15} \\right\\rbrack\n\\end{matrix}\\)",
                        "If Ar=1/2[εα cos β+ε−α cos β] of mathematical expression 15 is expressed in terms of εα, it can be expressed as shown in mathematical expression 16.",
                        "\\(\\begin{matrix}\n{\\varepsilon^{\\alpha} = \\frac{{A_{r}\\sin \\; \\beta} + {A_{i}\\cos \\; \\beta}}{\\sin \\; \\beta \\; \\cos \\; \\beta}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 16} \\right\\rbrack\n\\end{matrix}\\)",
                        "If mathematical expression 15 and mathematical expression 16 are multiplied, it is as shown in mathematical expression 17, and this can be developed as shown in mathematical expression 18.",
                        "\\(\\begin{matrix}\n{1 = {\\frac{A_{r}^{2}}{\\cos^{2}\\beta} - \\frac{A_{i}^{2}}{\\sin^{2}\\beta}}} & \\left\\lbrack {{Mathematical}\\mspace{14mu} {expression}\\mspace{14mu} 17} \\right\\rbrack\n\\end{matrix}\\)\n\nsin4 β+(Ar2+Ai2−1)sin2 β−Ai2=0  [Mathematical expression 18]",
                        "If it is assumed that X=sin2 β, mathematical expression 18 becomes a second order equation as shown in mathematical expression 19.",
                        "X2+(Ar2+Ai2−1)X−Ai2=0  [Mathematical expression 19]",
                        "This equation can be calculated in a general method, and β is obtained as shown in mathematical expression 20 from the obtained X.",
                        "β=sin−1 √{square root over (X)}  [Mathematical expression 20]",
                        "Here, although β may have two solutions of positive (+) and negative (−), since a negative value does not exist physically, only the positive value is adopted.",
                        "α is obtained by putting the obtained β value into mathematical expression 16, and subsequently, γl=α+jβ is obtained. Finally, line impedance Z is obtained by putting",
                        "\\({Z = {B\\frac{\\gamma \\; l}{\\sinh \\; \\gamma \\; l}}},\\)",
                        "and since Z=R+jωL, resistance R and inductance ω L of the circuit are obtained.",
                        "Next, since",
                        "\\(C = {Y^{\\prime}\\left( {1 + \\frac{Z^{\\prime}Y^{\\prime}}{4}} \\right)}\\)",
                        "in mathematical expression 12, Y({dot over (Y)}) is calculated using the calculated B and C values and the previously obtained Z value.",
                        "Finally, line admittance Y may be obtained by using",
                        "\\(Y = {\\frac{Y^{\\prime}}{2}{\\left( {Y^{\\prime} = \\frac{Y}{2}} \\right).}}\\)",
                        "Accordingly, leakage conductance g and capacitance ω C are obtained from Y=g+jω C.",
                        "Power facilities such as a transformer, a generator and the like, not a transmission line, will be described.",
                        "Line parameters are measured using mathematical expression 5 for a small capacity facility less than some tens of thousands of KVA, like a short distance transmission line, and in the case of a power facility of some hundreds of thousands of KVA, a measurement method using a four-terminal network circuit as shown in mathematical expression 6 can be used, like a middle distance transmission line.",
                        "In the case of a power facility higher than a million KVA class, the process after mathematical expression 9 can be applied, like a long distance transmission line.",
                        "Particularly, in the case of a superconducting power facility (a cable, a fault current limiter, a transformer, a generator or the like), a state monitoring and protecting function can be provided for a quenching phenomenon generated when a superconducting state cannot be maintained.",
                        "While the present invention has been described with reference to the particular illustrative embodiments, it is not to be restricted by the embodiments but only by the appended claims. It is to be appreciated that those skilled in the art can change or modify the embodiments without departing from the scope and spirit of the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe system for monitoring power facility",
                        "introduce measurement device",
                        "introduce power facility state monitoring device",
                        "introduce human machine interface (HMI)",
                        "describe communication program",
                        "describe information communication network",
                        "describe measurement data transmission",
                        "describe current transformer (CT) and potential transformer (PT)",
                        "describe gas insulated switchgear (GIS)",
                        "describe line parameter calculation",
                        "describe memory storage",
                        "describe alarm and state notification",
                        "describe FIG. 2: block diagram of measurement device",
                        "describe A/D conversion unit",
                        "describe communication module",
                        "describe GPS reception module",
                        "describe FIG. 3: block diagram of power facility state monitoring device",
                        "describe input unit",
                        "describe display unit",
                        "describe handling unit",
                        "describe operation unit",
                        "describe power supply unit",
                        "describe output unit",
                        "describe communication unit",
                        "describe storage unit",
                        "describe monitor and control unit",
                        "describe line parameter calculation method",
                        "express equivalent circuit for middle distance facility",
                        "calculate four-terminal parameters",
                        "establish relation between voltage and current",
                        "describe measurement method for obtaining line parameters",
                        "handle case where solution cannot be obtained",
                        "describe alternative method for obtaining line parameters",
                        "analyze line parameters for middle distance line",
                        "convert long distance line to equivalent circuit",
                        "express four-terminal network equations for long distance line",
                        "calculate characteristic impedance",
                        "calculate propagation constant",
                        "convert long distance line to pi-equivalent circuit",
                        "apply pi-equivalent circuit to calculate impedance value",
                        "calculate Z from B",
                        "express A in terms of attenuation constant and phase constant",
                        "express εα in terms of Ar and Ai",
                        "express εα in terms of Ar and Ai (alternative form)",
                        "develop equation for β",
                        "solve for β",
                        "calculate α and γl",
                        "calculate line impedance Z and admittance Y"
                    ],
                    "num_characters": 24948,
                    "outline_medium": [
                        "describe system configuration for monitoring power facility state",
                        "introduce measurement device for simultaneously measuring three-phase current and voltage",
                        "describe power facility state monitoring device for calculating line parameters",
                        "explain human machine interface for receiving and storing line parameters",
                        "detail communication program for information communication between devices",
                        "describe information communication network of substation",
                        "illustrate measurement device block diagram",
                        "illustrate power facility state monitoring device block diagram",
                        "describe method of calculating line parameters of power facility state monitoring device",
                        "explain calculation of line parameters for short distance facility",
                        "explain calculation of line parameters for middle distance facility",
                        "explain calculation of line parameters for long distance facility",
                        "describe method of monitoring and controlling power facility state",
                        "express equivalent circuit for middle distance facility",
                        "calculate four-terminal parameters",
                        "establish equations for four-terminal network",
                        "solve for line parameters A, B, C, and D",
                        "calculate line impedance and admittance for ultra-high voltage line",
                        "convert long distance line to pi-equivalent circuit",
                        "calculate impedance value of long distance transmission line",
                        "calculate attenuation constant and phase constant",
                        "apply process to power facilities of varying capacities",
                        "provide state monitoring and protecting function for superconducting power facility"
                    ],
                    "outline_short": [
                        "describe system configuration for monitoring power facility state",
                        "detail measurement device for simultaneously measuring three-phase current and voltage",
                        "explain power facility state monitoring device for calculating line parameters",
                        "illustrate communication network of substation",
                        "outline method of calculating line parameters for different types of transmission lines",
                        "provide mathematical expressions for calculating line parameters",
                        "derive four-terminal network equations",
                        "calculate line parameters from equations",
                        "convert long distance line to pi-equivalent circuit",
                        "calculate impedance and admittance values",
                        "apply to power facilities of various capacities"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A system for monitoring a state of a power facility using line parameters, the system comprising:\na measurement device including an analog-to-digital (A/D) converter for converting current and voltage of the power facility measured through a current transformer (CT) and a potential transformer (PT) into digital signals by synchronizing the current and voltage to a time synchronization signal, a global positioning system (GPS) module for providing the A/D converter with the time synchronization signal, and a communication module for transmitting the signals output from the A/D converter through Ethernet;\na power facility state monitoring device including an input unit for inputting measurement data transmitted through the communication module, an operation unit for calculating line parameters of a measurement target facility using the measurement data input through the input unit, a communication unit for transmitting the calculated line parameters according to a certain communication specification, and a monitor and control unit for monitoring and controlling the power facility by controlling operation of the input unit, the operation unit and the communication unit, determining whether or not the power facility is abnormal according to whether or not a magnitude or an increase or decrease rate of the calculated line parameters goes out of a predetermined reference value, and outputting an alarm, a state alarm message or a trip signal; and\na human machine interface (HMI) for estimating a state of the power facility using the line parameters provided from the power facility state monitoring device.",
        "2. The system according to claim 1, wherein the communication specification is a communication protocol such as IEC61850 and IEC61970 used at a digital substation.",
        "3. The system according to claim 1, wherein the line parameters include resistance, inductance, capacitance and leakage conductance.",
        "4. The system according to claim 1, wherein the operation unit calculates an zero-phase-sequence component of the measurement data and removes the zero-phase-sequence component by subtracting the calculated zero-phase-sequence component from the measurement data.",
        "5. A method of monitoring a state of a power facility on-line by measuring line parameters, the method comprising the steps of:\nsetting a measurement time and selecting a measurement target facility according to an external input;\ninputting current and voltage data measured at the selected measurement target facility;\nextracting current and voltage data corresponding to the set measurement time with reference to time information tagged on the input current and voltage data;\nremoving an zero-phase-sequence component from the extracted current and voltage data;\ncalculating the line parameters of the selected measurement target facility using the current and voltage data from which the zero-phase-sequence component is removed; and\ndetermining existence of a failure or abnormality according to whether or not a magnitude or an increase or decrease rate of the calculated line parameters goes out of a predetermined reference value, and outputting an alarm, a state alarm message or a trip signal.",
        "6. The method according to claim 5, wherein the measurement target facility includes a short distance facility, a middle distance facility and a long distance facility.",
        "7. The method according to claim 5, wherein the time information is received through GPS reception when the current and voltage data are measured.",
        "8. The method according to claim 5, wherein the line parameter calculation step calculates resistance and inductance among the line parameters when the measurement target facility is a short distance transmission line or a small and medium capacity power facility.",
        "9. The method according to claim 6, wherein the line parameter calculation step calculates resistance, inductance, capacitance and leakage conductance, which are the line parameters, through four-terminal line parameter calculation when the measurement target facility is a middle distance transmission line or a high capacity power facility.",
        "10. The method according to claim 6, wherein the line parameter calculation step calculates four-terminal parameters, an attenuation constant and a phase constant by converting the measurement target facility into a pi-equivalent circuit when the measurement target facility is a long distance transmission line or a ultra-high capacity power facility higher than a million KVA class and calculates line parameters of the long distance transmission line using the calculated four-terminal parameters, attenuation constant and phase constant."
    ]
}