{
    "id": "US20240108688",
    "authors": [
        "Wolfram Ruf",
        "Philip Wenzel"
    ],
    "title": "Inhibitors of the tissue factor-protease activated receptor 2 (TF-PAR2) signaling pathway for use in the treatment or prevention of heart failure (HF) and associated or resulting diseases",
    "date": "2021-11-19 00:00:00",
    "abstract": "Novel inhibitors of the Tissue Factor-Protease Activated Receptor 2 (TF-PAR2) signaling pathway for use in the treatment or prevention of heart failure (HF). In-vitro method for identifying a subject at risk for developing ischemic heart failure (IHF) or adverse remodeling following myocardial infarction (MI), comprise the steps of (i) determining the tissue factor (TF) cytoplasmic domain phosphorylation in myeloid cells and the levels of active TGF-β1 in a biological sample collected from said subject, and (ii) comparing the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in said biological sample with the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in a normal, healthy subject, wherein increased levels of phosphorylation of the TF cytoplasmic domain and active TGF-β1 are indicative for an increased risk of developing IHF or adverse remodeling following MI.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to inhibitors of the Tissue Factor-Protease Activated Receptor 2 (TF-PAR2) signaling pathway for use in the treatment or prevention of heart failure (HF), and associated or resulting diseases such as ischemic heart failure (IHF), myocardial infarction (MI), heart failure with reduced ejection fraction (HFrEF), or heart failure with preserved ejection fraction (HFpEF)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate invention to TF-PAR2 signaling pathway"
                    ],
                    "num_characters": 400,
                    "outline_medium": [
                        "relate invention to TF-PAR2 signaling pathway"
                    ],
                    "outline_short": [
                        "relate invention to TF-PAR2 signaling pathway"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "Proper wound healing depends on effective hemostasis, which allows regeneration and reconstitution of defected tissue function (1). Coronary thrombosis causing myocardial infarction (M1) (2) leads to irreversible tissue injury, and activation of the innate and adaptive immune system mediates aspects of both cardiac dysfunction and functional repair (3). Depending on the extent of ischemia and time to reperfusion, these immune responses induce wound repair and collagen deposition that may lead to restoration of cardiac function or inflammation-mediated adverse LV-remodelling resulting in ischemic heart failure (IHF) (4). Myocardial ischemia is driven by pro-coagulant activity on monocytes and macrophages that express tissue factor (TF) forming a complex with FVIIa for FXa generation (5) and that significantly contribute to multifaceted intravascular cell activation in immuno-thrombosis (6).",
                        "TF is also known as thromboplastin or CD142 relating to a glycosylated transmembrane protein consisting of a single polypeptide chain having a molecular weight of 45,000 (7). The extracellular part of TF is made up of two fibronectin type III domains, and membrane anchoring of TF has been demonstrated to be essential to support full proteolytic activity of FVIIa (8). Once bound to TF, FVII is rapidly converted to its activated form (FVIIa) via limited proteolysis (9, 10). Coagulation is tightly regulated by Tissue Factor Pathway Inhibitor (TFPI), which constitutes the endogenous inhibitor of the extrinsic coagulation pathway; TFPI is a potent inhibitor of the TF/FVIIa complex (11). It is known that FVIIa is the key initiator of the coagulation cascade in cardiovascular disease (12). Anticoagulation treatment is an established therapy to prevent major cardiovascular events (13, 14). Nematode anticoagulant protein C2 (NAPc2) blocks TF signaling and coagulation by stabilizing an inhibited TF-FVIIa-FX (a) complex (15). Phase 2 clinical trials have documented safety of this drug in percutaneous interventions for acute coronary heart disease (16). While inhibition of cardiomyocyte-specific TF or thrombin may attenuate myocardial injury and inflammation (17), it is unclear whether myeloid cell signaling functions of these coagulation proteases contribute to outcomes post MI independently of pro-thrombotic activity. Post MI, the temporal transition of inflammatory phase to fibrotic remodelling depends on the release of growth factors like transforming growth factor 61 (TGF-β1) (18) and activation of myofibroblasts (19). Coagulation proteases mediate clotting-independent protease activated receptor (PAR) activation to regulate not only hematopoiesis (20) and tumor development (21) but also cardiac fibrosis by modulating TGF-β1 signaling (22). Although targeting coagulation factors and their receptors may be beneficial (23) (22) in ameliorating severity due to thrombotic occlusion in MI, the potential of influencing cardiac remodelling by intervening in these pathways has not yet been explored.",
                        "US 2004/0102402 A1 describes inhibitors of TF and methods of treating an animal having a disease or condition associated with TF. In particular, nucleic acid compounds are described, consisting of 8 to 80 nucleobases in length targeted to a nucleic acid molecule encoding TF.",
                        "WO 97/20939 A describes a fusion protein that is capable of inhibiting or neutralizing TF from inducing blood coagulation through the extrinsic coagulation pathway.",
                        "U.S. Pat. No. 6,238,878 B1 describes chemical compounds and methods for treatment of a FVIIa/TF-related disease or disorder that also includes myocardial infarction. However, the outcome after a myocardial ischemia (in particular the development of heart failure and cardiac remodelling) independently of pro-thrombotic activity has not been described.",
                        "Further compounds that target TF and/or FVIIa are also described in WO 2018/170134 A1 and WO 2007/092607 A2. None of these references, however, investigate pro-fibrotic remodelling after MI. Furthermore, biomarkers other than Q-waves or T-wave inversion in electrocardiography or fall of cardiac troponins correlating with a subacute event are currently not well established to indicate sub-acute MI which has worse outcomes than acute MI despite timely revascularisation (24). Likewise, no such markers are established that would indicate patients with MI at risk to develop ischemic heart disease, irrespective of the time of presentation (e.g., acute or sub-acute MI)",
                        "EP 3 203 240 A1 describes a method for determining acute myocardial infarction, comprising the steps of obtaining a measured value of peroxiredoxin in a biological sample from a patient, and obtaining information on acute myocardial infarction, based on the obtained measured value of peroxiredoxin. It would therefore be desirable to have a highly specific marker that allows for identifying patients at risk for MI or IHF. This is because patients with sub-acute, prolonged MI have a two-fold higher risk of death and of developing heart failure compared to MI patients presenting early for interventional therapy (25)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce wound healing and hemostasis",
                        "describe coronary thrombosis and myocardial infarction",
                        "explain immune responses and cardiac dysfunction",
                        "discuss ischemic heart failure and collagen deposition",
                        "describe pro-coagulant activity on monocytes and macrophages",
                        "explain intravascular cell activation in immuno-thrombosis",
                        "define tissue factor and its structure",
                        "describe TF-FVIIa complex and coagulation regulation",
                        "discuss anticoagulation treatment and cardiovascular disease",
                        "summarize prior art and limitations"
                    ],
                    "num_characters": 5117,
                    "outline_medium": [
                        "introduce wound healing and hemostasis",
                        "describe TF-PAR2 signaling pathway",
                        "discuss limitations of current treatments",
                        "summarize prior art on TF and FVIIa inhibitors",
                        "highlight need for specific biomarkers"
                    ],
                    "outline_short": [
                        "discuss wound healing and cardiac dysfunction",
                        "summarize prior art on TF and FVIIa inhibitors"
                    ]
                },
                {
                    "title": "DISCLOSURE OF INVENTION",
                    "paragraphs": [
                        "Against this background, it is therefore the object of the present invention to provide compounds that are suitable in the treatment or prevention of heart failure (HF), and associated or synonymous diseases such as MI, IHF, IHF following MI, HFrEF or HFpEF. It is a further object of the present invention to provide a method for identifying a test subject at risk for developing ischemic heart failure (IHF) or adverse remodeling following myocardial infarction (MI). These objects are solved by the claimed invention. Preferred embodiments are claimed in the sub-claims.",
                        "The present invention is based on the unexpected discovery that an inhibition of myeloid cell TF-PAR2 dependent signaling is a putative target for therapeutic intervention as the TF-PAR2 signaling pathway is a crucial driver for TGF-β1 activation.",
                        "The inventors found that myocardial remodeling and myeloid cell recruitment in persistent MI were promoted by ERK activation and that cardiac remodeling can be inhibited by therapeutic intervention with the mitogen-activated protein kinase (MAPK)1/2 inhibitor trametinib.",
                        "PAR2 has been found to be an upstream signal for monocyte ERK1/2 activation. An up-regulation of PAR2 results in higher ERK1/2 phosphorylation and TGF-β1 activation.",
                        "As further shown by the present invention, TF-PAR2 signaling in infiltrating myeloid cells is responsible for ischemia-associated hyper-activation of the MAPK pathway, TGF-β1 activation, and pro-fibrotic remodeling after MI.",
                        "Targeting TF is associated with a markedly reduced ERK1/2 phosphorylation, decreased TGF-β1 activation (and reduced TGF-β1 signaling) compared to strain-matched wild-type (WT), and reduced cardiac or myelomonocytic cell NOX2 expression. The present invention identifies a central role for TF cytoplasmic tail-dependent pro-fibrotic activity of myeloid cells linking myeloid cell TF-PAR2 signaling to TGF-β1-dependent adverse remodeling after MI.",
                        "By targeting TF-FVIIa, cardiac function can be improved via prevention of TGF-β1 activation. By using an inhibitor of the TF-PAR2 signaling pathway according to the present invention, TF-signaling and coagulation can be blocked, e.g. by forming an inhibited TF-FVIIa-FX (a) complex. Inhibition of TF-PAR2 signaling is accompanied by decreased levels of NOX2 and active TGF-β1. As further shown by the present invention, inhibition of TF-PAR2 signaling by using an inhibitor of the invention significantly reduced cardiac fibrosis and improved cardiac function in chronic MI. The protection from cardiac damage resulted in an improved survival of the treated test subjects. Therefore, targeting of TF signaling in myeloid cells is beneficial for cardiac remodeling and for improving cardiac function post MI. This is because myeloid cell derived TF-PAR2 signaling is the driver for ERK1/2-TGF-β1 activation in chronic MI.",
                        "The inhibitor of TF-PAR2 signaling according to the present invention refers to any biological or chemical compound resulting in a blockage of TF signaling in human or animal cells. As such, the inhibitor can be any compound that modulates TF signaling leading to (i) a hyper-activation of mitogen-activated protein kinase 1 (MAPK1), (ii) an extracellular-signal-regulated kinase 1/2 (ERK1/2) phosphorylation, and (iii) TGF-β1 activation. The TF-PAR2 inhibitors are thus suitable as a therapeutic agent for use in the treatment of heart failure (HF) and associated or resulting diseases as the compounds both improve cardiac function and prevent fibrotic remodeling, which makes them beneficial in the therapeutic treatment of myocardial infarction (MI), ischemic heart failure (IHF), and cardiac fibrosis.",
                        "In a preferred embodiment, the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of the recruitment of NOX2-positive myeloid cells, preferably an inhibitor of NOX-2-positive monocytes as the recruitment of these cells is crucial for TGF-β1 activation. In a further preferred embodiment, the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of TGF-β1 activation. A preferred inhibitor of the TF-PAR2 signaling pathway that fulfills these requirements is nematode anticoagulant protein C2 (NAPc2).",
                        "Other preferred inhibitory compounds to be used in the context of the present invention include, but are not limited to inhibitory proteins, polypeptides, polyclonal or monoclonal antibodies, nanobodies that cause or result in reduced ERK1/2 phosphorylation, decreased TGF-β1 activation and reduced cardiac or myelomonocytic cell NOX2 expression. Preferred antibodies include, but are not limited to, single chain antibodies, or antibody mimetics such as adhirons, affibodies, affifins, affilins, anticalins, avimers, Armadillo repeat proteins, DARPins, fynomers, protease inhibitor Kunitz domains, monomers and peptide aptamers. Such mimetics are created, for example, by an in vitro selection or in silico prediction.",
                        "The invention also relates to inhibitory compounds that comprise fusion proteins, mutants, variants of fragments thereof that retain the capability for a reduced TGF-β1 activation and/or cardiac or myelomonocytic cell NOX2 expression and/or the recruitment of NOX2-positive myeloid cells, preferably NOX2-positive monocytes.",
                        "The invention further includes nucleic acid molecules, such as DNA, cDNA, RNA, that encode an inhibitor of TF-PAR2 signaling according to the present invention. In a preferred embodiment, the TF-PAR2 signaling inhibitor is selected from a protein, a peptide, an antibody, an antigen-binding fragment thereof, an enzyme, an enzyme inhibitor, an aptamer or a small molecule. Small molecules, as used in the context of the present invention, refer to low molecular weight molecules having a molecular weight<900 Da. The upper molecular weight limit allows a rapid crossing of said membranes so that the smaller molecule can reach its intracellular sites of action.",
                        "In alternative embodiments, the inhibitor of TF-PAR2 signaling according to the present invention relates to one or more oligonucleotide inhibitors, such as an antisense DNA or RNA oligonucleotide or nucleic acid aptamer that inhibits TGF-β1 activation and/or cardiac or myelomonocytic cell NOX2 expression and/or the recruitment of NOX2-positive myeloid cells, preferably NOX2-positive monocytes. The invention also relates to a pharmaceutical composition comprising such an antisense oligonucleotide or nucleic acid aptamer or other RNA therapeutic for use in the treatment of heart failure (HF), or the use of an antisense oligonucleotide or nucleic acid aptamer or other RNA therapeutic for inhibiting or reducing TGF-β1 activation and/or cardiac or myelomonocytic cell NOX2 expression and/or the recruitment of NOX2-positive myeloid cells, preferably NOX2-positive monocytes. The invention also relates to a pharmaceutical composition comprising such an antisense oligonucleotide or nucleic acid aptamer or other RNA therapeutic for the manufacturing of a drug for use in the treatment of heart failure (HF). The invention is also suitable to be used in a method for treating a subject having heart failure (HF) or an associated or resulting disease thereof, comprising administering a therapeutically effective amount of an antisense oligonucleotide or nucleic acid aptamer or other RNA therapeutic inhibiting or reducing TGF-β1 activation and/or cardiac or myelomonocytic cell NOX2 expression and/or the recruitment of NOX2-positive myeloid cells, preferably NOX2-positive monocytes. In one embodiment, the invention relates to a pharmaceutical composition comprising such an antisense oligonucleotide or nucleic acid aptamer or other RNA therapeutic. Examples of such antisense oligonucleotides that can be used as a therapeutic agent include, but are not limited to siRNA, shRNA, or antisense oligonucleotide targeting a mRNA, non-coding RNA (ncRNA), such as miRNA and long non-coding RNA (lncRNA). Nucleic acid aptamers include, but are not limited to single-stranded oligonucleotides, either DNA, RNA or synthetic nucleic acid analogues such as XNA (xeno nucleic acid); or small molecules.",
                        "Preferably, the inhibitor of the TF-PAR2 signaling pathway is a TF/FVIIa inhibitor.",
                        "The terms “Factor Vila/Tissue Factor” or “FVIIa/TF” or “FVIIa/TF” are synonymous and are commonly known to refer to a catalytically active complex of the serine protease coagulation factor VIIa (FVIIa) and the non-enzymatic protein Tissue Factor (TF), wherein the complex is assembled on the surface of a physiologically relevant phospholipid membrane of defined composition.",
                        "The term “FVIIa/TF inhibitor” as used in the context of the present invention is a compound having FVIIa/TF inhibitory activity towards the activation of TGF-β1, MAPK1, ERK1/2, and NOX2. The compound can be any naturally occurring or artificially produced compound, and may comprise an organic compound, an anorganic compound, a protein, a polypeptide, a nucleic acid molecule, or combinations thereof. The invention also relates to variants of such inhibitors that were modified by adding, removing or changing chemical or biological moieties.",
                        "In a preferred embodiment, the TF/FVIIa inhibitor is selected from the group consisting of anti-TF antibodies, small molecules, TF Pathway Inhibitor (TFPI), human recombinant FVIIa inhibitor (rFVIIai), chimeric protein XK1, and PAR2 antagonists. In a preferred embodiment, the anti-TF antibody is selected from the group consisting of AP-1, ALT836, tisotumab Vedotin, ICON-2.",
                        "A preferred inhibitor of the TF-PAR2 signaling pathway is the nematode anticoagulant protein C2 (NAPc2). NAPc2, as used herein, describes a single-chain, non-glycosylated 85 amino acid protein having a molecular weight of 9732 Da. NAPc2 exerts its effects by binding to FXa and has an inhibitory mechanism resembling that of TFPI. The antithrombotic effect of NAPc2 has been demonstrated in a dose-finding study on the prevention of venous thromboembolism in patients undergoing total knee replacement (27). As shown in the present invention, NAPc2 treatment improved cardiac function, attenuated cardiac infiltration of myeloid cells, and also diminished ERK1/2 phosphorylation, NOX2 expression, TGF-β1 activation and up-regulation of the downstream target α-SMA in the infarcted heart. A short term NAPc2 treatment up to 7 days post MI significantly reduced cardiac fibrosis and improved cardiac function in chronic MI.",
                        "The invention also comprises any variant of NAPc2, such as modified or recombinant NAPc2 (rNAPc2). In a preferred embodiment, rNAPc2 is used that has been altered to contain an additional proline residue at the C-terminal end of the amino acid sequence of NAPc2 (NAPc2/proline). rNAPc2 is understood to inhibit the TF-PAR2 signaling pathway according to the present invention.",
                        "Preferably, the NAPc2 and the NAPc2/proline variant comprise an amino acid sequence as shown in Table 1:",
                        "The invention also comprises variants, mutants or homologs of those proteins, such as NAPc2 variants exhibiting at least 80%, 85%, 90%, 95%, 96%, 97%, 98, or 99% sequence homology with any one of the amino acid sequences set forth in SEQ ID NO:1 or SEQ ID NO:2, wherein such a variant has the capability of inhibiting the TF-PAR2 signaling pathway.",
                        "The efficient dosages and the dosage regimens for the TF-PAR2 signaling pathway inhibitors of the invention depend on the severity of the heart failure to be treated and may be determined by the person skilled in the art, depending on the kind and severity of the disease, such as the severity of IHF or MI.",
                        "An example of a non-limiting range for a therapeutically effective dose of a TF-PAR2 signaling pathway inhibitor of the present invention is preferably between 0.1-100 μg/kg, more preferred between 0.5-20 μg/kg, preferably between 1 and 10 μg/kg. The invention also includes any range or single values within said ranges, such as an amount of about 5 μg/kg, about 7 μg/kg, or about 10 μg/kg. The administration of the inhibitor can be achieved in a single dose or in multiple doses per day, or given on alternating days or other dosing schemes. A physician or veterinarian having ordinary skill in the art may readily determine and prescribe the effective amount of the pharmaceutical composition required. In general, a suitable daily dose of a composition of the present invention will be that amount of the compound which is the lowest dose effective to produce a therapeutic effect. Such an effective dose will generally depend upon the mode of administrations such as intravenous, intramuscular, intraperitoneal, or subcutaneous administration. If desired, the effective daily dose of a pharmaceutical composition may be administered as two, three, four, five, six or more sub-doses administered separately at appropriate intervals throughout the day, optionally, in unit dosage forms.",
                        "NAPc2 or any of its variants, such as NAPc2/proline, is preferably provided at a dose of between about 5 μg/kg and 10 μg/kg, wherein all intermediate values and ranges are included within the scope of the present invention. Similar to other inhibitors comprised by the invention, the administration of NAPc2 or any of its variants, such as NAPc2/proline, can be achieved in a single dose or in multiple doses per day, or given on alternating days or other dosing schemes. In a preferred embodiment, NAPc2 or any of its variants, such as NAPc2/proline, is provided at a dose of about 5 μg/kg, preferably at a dose of about 7.5 μg/kg, or preferably at a dose of about μg/kg. In some embodiments, NAPc2 or any of its variants, such as NAPc2/proline, is provided at a dose of about 7.5 μg/kg on a first day, a dose of about 5 μg/kg on a third day, and a dose of about 5 μg/kg on a fifth day.",
                        "While it is possible for a compound of the present invention to be administered alone, it is preferable to administer the TF-PAR2 signaling pathway inhibitor as a pharmaceutical composition. The pharmaceutical composition may be formulated with any known pharmaceutically acceptable carrier or diluent as well as any other known adjuvants and excipients in accordance with conventional techniques. The pharmaceutically acceptable carriers, diluents, adjuvants and excipients should be suitable for the chosen TF-PAR2 signaling pathway inhibitor of the present invention and the chosen mode of administration. A pharmaceutical composition of the present invention may also include diluents, fillers, salts, buffers, detergents (e. g., a nonionic detergent), stabilizers (e. g., sugars or protein-free amino acids), preservatives, tissue fixatives, solubilizers, and/or other materials suitable for inclusion in a pharmaceutical composition.",
                        "The pharmaceutical compositions of the present invention can be formulated by methods known to those skilled in the art. For example, such pharmaceutical compositions can be used parenterally, as injections which are sterile solutions or suspensions including the compositions along with water or another pharmaceutically acceptable liquid. For example, such compositions may be formulated as unit doses that meet the requirements for the preparation of pharmaceuticals by appropriately combining the compositions with pharmaceutically acceptable carriers, diluents, adjuvants or excipients, specifically with sterile water, physiological saline, a vegetable oil, emulsifier, suspension, surfactant, stabilizer, flavoring agent, excipient, vehicle, preservative, binder or such. In such preparations, the amount of active ingredient is adjusted such that an appropriate dose that falls within a pre-determined range can be obtained.",
                        "The inventions also relates to a method for the treatment or prevention of heart failure (HF), and associated or resulting diseases such as ischemic heart failure (IHF), myocardial infarction (MI), heart failure with reduced ejection fraction (HFrEF), or heart failure with preserved ejection fraction (HFpEF) using a herein described inhibitor of the Tissue Factor-Protease Activated Receptor 2 (TF-PAR2) signaling pathway, or a pharmaceutical composition comprising such an inhibitor.",
                        "The present invention also concerns a method for identifying a subject at risk for developing ischemic heart failure (IHF) or adverse remodeling following myocardial infarction (MI), comprising the steps of determining the tissue factor (TF) cytoplasmic domain phosphorylation in myeloid cells and the levels of active TGF-β1 in a biological sample collected from said subject, and comparing the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in said biological sample with the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in a normal, healthy subject, wherein increased levels of phosphorylation of the TF cytoplasmic domain and active TGF-β1 are indicative for an increased risk of developing IHF or adverse remodeling following MI. In one embodiment, the method is carried out as an in-vitro or an ex-vivo method.",
                        "In preferred embodiments, the biological sample of the subject is obtained from a heart biopsy, liquid biopsy, blood, serum, or plasma.",
                        "In a preferred embodiment, the cytoplasmic domain phosphorylation of TF in myeloid cells, preferably monocytes, more preferably circulating monocytes, is used as a biomarker for identifying the risk for developing IHF post MI in said subject. The method preferably includes:\n\n\n- - 1. obtaining a test sample from a subject,\n  - 2. quantifying the amount of phosphorylation of TF, preferably of\n    the cytoplasmic domain of TF,\n  - 3. comparing the amount of phosphorylation of TF against a reference\n    that is obtained for the sample of a normal, healthy subject.",
                        "A normal, healthy subject is a subject, for example a human or an animal that has no condition of MI or HF. The determination of TF phosphorylation can be carried out qualitatively or quantitatively. A quantitative analysis can be carried out, for example, for flow cytometry analysis or confocal microscopy of monocytes isolated from the subjects. A qualitative analysis can be carried out, for example, by Western blot or enzyme linked immunosorbent assay (ELISA) analysis of monocytic protein expression for TF cytoplasmic domain phosphorylation (4G6) and TF (10H10). The method can also utilize a scoring method to determine if a patient is at risk of developing MI or HF. Preferably, a desired score is integrated for the biomarker. The total score is then quantified and compared with a predetermined total score. In a following step, it is determined whether the subject has a risk for developing MI or HF based on the total score determined above. Increased levels of phosphorylation of the TF cytoplasmic domain and active TGF-β1 will be indicative for an increased risk of developing IHF or adverse remodeling following MI.",
                        "As shown by the present invention, phosphorylation of TF and activation of TGF-β1 also coincide with an upregulation of IL6, CCL2 and/or CCR2 in the biological sample obtained from heart biopsies. In a preferred embodiment, the method of the present invention therefore further comprises determining whether there is an upregulation of IL6, CCL2 and/or CCR. These markers can also be integrated in the evaluation and scoring. Further markers that can be included are myeloid cell recruitment, increased TGF-β1 activation and/or downstream phosphorylation of SMAD2. In a further preferred embodiment, the method further comprises an analysis of the numbers of CD45+ cells within said biological sample, wherein an increased number of CD45+ cells as compared to the numbers in samples collected from normal, healthy test subjects are indicative for IHF.",
                        "PBMCs as used in the context of the present invention refer to a mixed population of myeloid and lymphoid cells. Myeloid cells include monocytes, dendritic cells and macrophages. Monocytes circulate through the blood to different tissues, thereby differentiating into tissue-resident macrophages and dendritic cells.",
                        "Finally, the invention also concerns the use of a hyper-phosphorylated TF as biomarker to identify a subject at risk for developing IHF or MI, in particular adversary modeling following MI and to identify drug therapies that prevent IHF or adverse remodeling.",
                        "The invention is further illustrated in the following examples. By no means shall the invention be restricted to these examples. It will be apparent that any combinations of features of the teachings are encompassed by the scope of the present invention, including combinations of embodiments described herein."
                    ],
                    "subsections": [
                        {
                            "title": "Conclusions",
                            "paragraphs": [
                                "The invention provides a more detailed insight into the pathophysiology of coagulation in IHF and uncovers a crucial function of coagulation-related signaling in adverse remodeling in the ischemic myocardium. Treatment of arterial thrombosis and vascular occlusion is central to the therapy of acute coronary syndromes. However, here the invention provides novel insights into a non-canonical mechanism of coagulation, TF-PAR2 signaling leading to TGF-β1 activation in the infarcted myocardium and the precise role of myeloid cells in this context.",
                                "Based on unbiased (phospho)proteomics in human IHF as well as genetic and pharmacologic interventions in mouse models, the inventors establish a link between hyper-activation of the MAPK pathway and TGF-β1 mediated cardiac remodeling driven by inflammatory pro-oxidant myeloid cells infiltrating the heart in permanent MI. The inventors localize ERK1/2 activation specific to myeloid cells infiltrating the ischemic heart and show that preclinical intervention with the MEK inhibitor trametinib significantly diminished the CCR2 dependent (29) Ly-6Chigh monocyte recruitment into the infarcted myocardium. Activation of TGF-β1 is essential for its biological functions (29), specifically for activating myofibroblasts and disease progression in MI (30). The inventors directly show with isolated cells in vitro that cytokine primed monocytes exposed to hypoxia activate latent TGF-β1 dependent on Nox2 and MEK1/2 signaling. Furthermore, experiments with isolated monocytes from NOX2−/− and PAR2−/− in combination with in vivo analysis of myeloid cell-specific PAR2 and TF deletion confirmed that myeloid cell derived TF-PAR2 signaling is the driver for ERK1/2-TGF-β1 activation in chronic MI.",
                                "Shear stress induced platelet derived TGF-β1 activation depends on reduced protein-disulfide isomerase (PDI) (31) which also plays a critical role in TF decryption (32, 33). Notably, TF decryption is favoured by complement activation (34, 35), which was a prominent feature of the ischemic myocardium identified by the inventor's proteomic screen. The TF-FVIIa complex furthermore interacts with integrin 61 independent of coagulation activation (36) and regulates ROS production by endosomal NOX2 trafficking which depends on the TF cytoplasmic tail (37). ROS can regulate fibroblast proliferation and collagen synthesis in MI (38), but major cellular sources of ROS and underlying mechanisms of how they mediate cardiac remodeling remained elusive. The inventor's present data show that myeloid cell TF-PAR2 linked through the TF cytoplasmic tail is required for increased phagocyte type NADPH oxidase derived ROS production and TGF-β1 activation to promote cardiac remodeling in chronic MI.",
                                "In the clinical setting of MI, patients with coronary no-reflow and/or delayed presentation after onset of symptoms (so called sub-acute MI) show signs of thrombo-inflammation and are marked by a worse clinical outcome (39-41). However, biomarkers other than Q-waves or T-wave inversion in electrocardiography (42) are currently not established to predict sub-acute MI or poor outcomes of MI. The inventor's data indicate that TF phosphorylation of circulating monocytes may serve as a marker for patients at increased risk of developing IHF and adverse remodeling following MI. In addition, the inventor's proof-of-principle experiments delineate potential highly specific avenues to target this pathway. The putative clinical benefit is exemplified by the TF inhibitor NAPc2 with dual antithrombotic action and signaling disruption, resulting in diminished fibrosis post experimental MI. The identified biomarker applicable to liquid biopsies of patients with MI may facilitate clinical development of strategies to specifically target coagulation TF-PAR2 signaling for myeloid cell reprogramming. This strategy has the potential to prevent TGF-β1 activation leading to excess cardiac damage and to avert the development of IHF after MI."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "invention provides insight into coagulation in IHF",
                                "non-canonical mechanism of coagulation",
                                "TF-PAR2 signaling leading to TGF-β1 activation",
                                "myeloid cells in adverse remodeling",
                                "link between MAPK pathway and TGF-β1 mediated cardiac remodeling",
                                "ERK1/2 activation specific to myeloid cells",
                                "TF-PAR2 signaling inhibitor as potential therapy"
                            ],
                            "num_characters": 3978,
                            "outline_medium": [
                                "pathophysiology of coagulation in IHF",
                                "non-canonical mechanism of coagulation",
                                "novel insights into TF-PAR2 signaling"
                            ],
                            "outline_short": [
                                "summarize invention's significance"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce heart failure treatment",
                        "object of the invention",
                        "unexpected discovery of TF-PAR2 signaling",
                        "ERK activation and myeloid cell recruitment",
                        "PAR2 as upstream signal for monocyte ERK1/2 activation",
                        "TF-PAR2 signaling in myeloid cells",
                        "targeting TF to improve cardiac function",
                        "inhibitor of TF-PAR2 signaling",
                        "define TF-PAR2 signaling inhibitor",
                        "examples of TF-PAR2 signaling inhibitors",
                        "nucleic acid molecules encoding TF-PAR2 signaling inhibitor",
                        "small molecules as TF-PAR2 signaling inhibitors",
                        "oligonucleotide inhibitors",
                        "pharmaceutical composition comprising TF-PAR2 signaling inhibitor",
                        "method for treating heart failure",
                        "method for identifying subject at risk for IHF",
                        "determining TF cytoplasmic domain phosphorylation",
                        "determining active TGF-β1 levels",
                        "comparing phosphorylation and TGF-β1 levels",
                        "increased phosphorylation and TGF-β1 indicative of IHF risk",
                        "biological sample from heart biopsy or liquid biopsy",
                        "TF cytoplasmic domain phosphorylation as biomarker",
                        "quantifying TF phosphorylation",
                        "comparing TF phosphorylation to reference",
                        "scoring method for biomarker",
                        "integrating IL6, CCL2, and/or CCR2 in evaluation",
                        "myeloid cell recruitment and TGF-β1 activation",
                        "CD45+ cells in biological sample",
                        "PBMCs as mixed population of myeloid and lymphoid cells",
                        "monocytes circulate and differentiate into macrophages",
                        "hyper-phosphorylated TF as biomarker",
                        "use of hyper-phosphorylated TF to identify IHF or MI risk",
                        "use of hyper-phosphorylated TF to identify drug therapies",
                        "TF-PAR2 signaling in adverse remodeling",
                        "myeloid cell derived TF-PAR2 signaling",
                        "ERK1/2-TGF-β1 activation in chronic MI",
                        "NOX2 and MEK1/2 signaling in TGF-β1 activation",
                        "TF decryption and complement activation",
                        "TF-FVIIa complex and integrin 61 interaction",
                        "ROS production by endosomal NOX2 trafficking",
                        "TF cytoplasmic tail required for ROS production and TGF-β1 activation"
                    ],
                    "num_characters": 20568,
                    "outline_medium": [
                        "introduce heart failure treatment",
                        "object of the invention",
                        "unexpected discovery of TF-PAR2 signaling",
                        "ERK activation and myeloid cell recruitment",
                        "PAR2 as upstream signal for monocyte ERK1/2 activation",
                        "TF-PAR2 signaling in myeloid cells",
                        "targeting TF to improve cardiac function",
                        "inhibitor of TF-PAR2 signaling",
                        "define TF-PAR2 signaling inhibitor",
                        "examples of TF-PAR2 signaling inhibitors",
                        "nucleic acid molecules encoding TF-PAR2 signaling inhibitor",
                        "small molecules as TF-PAR2 signaling inhibitors",
                        "oligonucleotide inhibitors",
                        "pharmaceutical composition comprising TF-PAR2 signaling inhibitor",
                        "method for treating heart failure",
                        "method for identifying subject at risk for IHF",
                        "biomarker for IHF",
                        "TF cytoplasmic domain phosphorylation",
                        "levels of active TGF-β1",
                        "scoring method for identifying risk of IHF"
                    ],
                    "outline_short": [
                        "introduce heart failure treatment",
                        "describe TF-PAR2 signaling pathway",
                        "motivate PAR2 as therapeutic target",
                        "summarize TF-PAR2 signaling in myeloid cells",
                        "describe TF-PAR2 inhibitors",
                        "introduce NAPc2 as TF-PAR2 inhibitor",
                        "describe NAPc2 variants and modifications",
                        "outline dosing and administration of TF-PAR2 inhibitors",
                        "describe pharmaceutical compositions",
                        "summarize method for treating heart failure"
                    ]
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS",
                    "paragraphs": [
                        "The invention is based on the surprising discovery that myeloid cell TF-PAR2—signaling is a crucial driver for TGF-β1 activation and the target for the treatment or prevention of IHF or MI.",
                        "The following examples are given by way of illustration only, and various changes and modifications that are within the spirit of the present invention will become apparent to the person in the art."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Results**",
                                "Activation of MAPK1 in Clinical and Preclinical Setting of MI and IHF.",
                                "To investigate the molecular pathophysiology of the failing myocardium in IHF, the inventors performed an unbiased label-free quantitative proteomics and phospho-proteomic profiling of cardiac tissue of explanted hearts obtained from five patients with IHF compared to five control donor hearts. High-resolution accuracy mass spectrometric analysis allowed for the quantification of 2,714 proteins and 10,601 phospho-peptides, of which 208 proteins and 685 phospho-peptides were significantly changed with fold changes>2 or <0.5 in at least 60% of all measurements in one group (FIG. 1A, FIGS. 9 to 14). Gene ontology analysis revealed a significant enrichment of pathways related to complement and coagulation cascades, innate immune system, platelet activation, and endocytosis in the IHF group relative to control (FIG. 1B). Based on these changes, the inventors performed a protein-protein interaction analysis by using Cytoscape STRING-DB app. Phosphorylation of mitogen-activated protein kinase 1 (MAPK1 or extracellular-signal-regulated kinase, ERK) at Thr185 and/or Tyr187 emerged as a central node in the integrated network kinase analysis (FIG. 1C). In addition, integrative inferred kinase activity (InKA) analysis revealed that MAPK1 is a (hyper)active kinase (average InKA Score of 49) in myocardial samples of IHF but not in controls (FIG. 1D).",
                                "Based on these clinical data, the inventors evaluated the contributions of the MAPK pathway to IHF by blocking the ERK1/2 activator mitogen-activated extracellular signal-regulated kinase (MEK) with the MEK ½ inhibitor trametinib in the preclinical mouse model of IHF induced by permanent ligation of the left anterior descending coronary artery (LAD, FIG. 2A). Long-term high-dose trametinib regimens in cancer therapy may have cardiotoxic side effects 17. In contrast, the inventors observed that treatment with trametinib (1 mg/kg/d) initiated 1 day and continued for 6 days after MI attenuated deterioration of cardiac function (FIG. 2B) and prevented activation of the ERK pathway in cardiac tissue (FIG. 2C). Trametinib therapy had no significant effects on cardiac function in sham-operated mice (FIG. 2B) and did not significantly interfere with pJNK/SAK or p38 MAPK pathways (FIG. 9A).",
                                "TGF-β1 has been implicated in adverse LV remodeling and development of heart failure after MI (4, 18). Trametinib significantly reduced activation of TGF-β1 (FIG. 2C) and the mRNA expression of COLO1A1 and COLO3A1 coding for collagen type I and III alpha 1 chain as well as Posn and ACTA2, encoding for the fibrosis markers periostin and a smooth muscle actin (FIG. 9B) in the infarcted myocardium. Infiltration of Ly6G+ neutrophils and Ly6Chigh monocytes 3 and subsequent expansion of Ly6Clow monocytes and macrophages (19) orchestrate the inflammatory reaction within the infarcted myocardium. Trametinib did not reduce mRNA expression of the inflammatory cytokines and chemokines interleukin-6 (II6), tumor necrosis factor alpha (Tnt) and C-C chemokine ligand 2 (Ccl2), implying that the local inflammatory response post MI was unaltered. Importantly, trametinib significantly reduced the mRNA expression of the CCL2 receptor and monocyte marker C-C chemokine receptor 2 (Ccr2, FIG. 2D). Consistently, recruitment of CD45+, CD45+/CD11 b+, CD45+/CD11 b+/Ly6Chigh and Ly6Clo myeloid cells into the infarcted heart was attenuated by trametinib (FIG. 2E). Taken together, these findings indicate that myocardial remodeling and myeloid cell recruitment in persistent MI were promoted by ERK activation and that cardiac remodeling can be inhibited by therapeutic intervention with the MEK1/2 inhibitor trametinib.",
                                "Myeloid Cell PAR Signaling is Upstream of a Pro-Fibrotic MEK1/2-TGF-β1 Pathway",
                                "Immunofluorescence staining supported a pivotal role of infiltrating CD45+ immune cells as the main source for increased ERK1/2 activation in the infarcted myocardium, compared to CD31+ endothelial cells, α-SMA+ myofibroblasts or cTNT+ cardiomyocytes (FIG. 3A). The inventors therefore investigated the role of the MAPK pathway in monocytes and asked whether ERK1/2 activation might be linked to a major driver of adverse remodeling, i.e. TGF-β1 activation. The inventors exposed isolated murine monocytes to both hypoxia and the inflammatory cytokines IL-6, TNF-α and of CCL2 which were detected in the ischemic heart (FIG. 2D). While latent TGF-β1 expression was not influenced by the different experimental conditions, monocytes exposed to both hypoxia and inflammatory cytokines significantly up-regulated ERK1/2 phosphorylation and showed increased TGF-β1 activation, which was blocked by trametinib (FIG. 3B).",
                                "The proteome analysis of human ischemic myocardium demonstrated marked changes in complement, innate immune response and coagulation pathways. Complement activation has a specific role in influencing function of monocytic TF (20) implicated in myocardial infarction (5), oxidative stress and thrombo-inflammation (21). TF in complex with its ligand FVIIa promotes sustained endosomal ERK1/2 signals by activating the protease activated receptor (PAR) 2 and trafficking in complex with integrin β1 heterodimers (24). Implicating PAR2 as an upstream signal for monocyte ERK1/2 activation, the inventors found that monocytes isolated from PAR2−/− mice had reduced ERK1/2 phosphorylation and TGF-β1 activation when exposed to hypoxia plus cytokines in vitro (FIG. 3C).",
                                "Based on these data, the inventors evaluated the role of monocyte-expressed PAR2 by subjecting PARfl/fl LysMcre mice to permanent LAD ligation for 7 days. Myeloid cell PAR2 deficient mice had reduced TGF-β1 activation and phosphorylation of small mothers against decapentaplegic homolog 2 (SMAD2, FIG. 3E) in the myocardium and were protected from cardiac dysfunction 7 d post MI (FIG. 3F). However, immune cell recruitment into the infarcted myocardium was not diminished in myeloid cell PAR2-deficient mice (FIG. 10). This indicates that a primary function of myeloid 135 cell PAR2 is to support local TGF-β1 and drive cardiac remodeling post MI.",
                                "Co-staining experiments of TF and CD45 in infarcted myocardium revealed a significant increase of CD45/TF double positive cells (FIG. 4A). In line with the PAR2 deletion, deletion of TF in myeloid cells with LysMcre showed reduced cardiac ERK1/2 activation (FIG. 4B), TGF-β1 activation and SMAD2 phosphorylation (FIG. 4C). Furthermore, these mice also displayed significantly reduced mRNA expression of 116 and Ccr2 (FIG. 4D), COLO1A1, COLO3A1 and ACTA2 (FIG. 4E) as well as improved cardiac function (FIG. 4F) compared to TFfl/fl littermate controls. Thus, TF-PAR2 signaling in infiltrating myeloid cells is responsible for ischemia-associated hyper-activation of the MAPK pathway, TGF-β1 activation, and potentially pro-fibrotic remodeling after MI.",
                                "Myeloid Cell TF Cytoplasmic Domain Signaling is Linked to NOX2/ERK-Dependent TGF-β1 Activation in Permanent MI.",
                                "The inventors next asked whether TF makes additional signaling contributions to pro-fibrotic TGF-μ1 activation. Ligation of TF by FVIIa activates rac and p38 dependent on the TF cytoplasmic domain (43). In the context of PAR signaling, the TF cytoplasmic tail binds the regulatory subunit of PI3 kinase and rac adaptor p85 (44) and recruits the NADPH oxidase for endosomal translocation and reactive oxygen species (ROS) production (37). The inventors found that TFfl/fl LysMcre mice with permanent LAD ligation had significantly reduced cardiac NOX2 expression compared to controls and that monocytes isolated from PAR2−/−mice had reduced NOX2 expression when exposed to hypoxia plus cytokines in vitro. Likewise, superoxide anion (O2 ⋅-) formation in the ischemic myocardium of PARfl/fl LysMcre mice was reduced in comparison to PARfl/fl littermate controls (FIGS. 11A-C).",
                                "In line with the results in TFfl/fl LysMcre and PARfl/fl LysMcre mice, cytoplasmic tail deficiency mice (TFΔCT mice) exposed to permanent MI had markedly reduced CD45+/NOX2+ immune cell infiltration (FIG. 5A) and O2 ⋅-formation (FIG. 5B) in the infarcted myocardium. In addition, circulating mononuclear cells isolated from TFΔCT mice after MI had significantly decreased expression of NOX2 and regulatory subunit p67phox (FIG. 11D) compared to WT mice 7 days after LAD ligation. TGF-β1 and reactive oxygen species (ROS) can act as a feed-forward mechanism for fibrosis (45) and the phagocyte type NADPH oxidase NOX2 significantly contributes to oxidative stress and cardiac remodeling after MI (46). Importantly, NOX2−/− monocytes exposed to cytokine mix and hypoxia were impaired in TGF-β1 activation and had significantly decreased ERK1/2 phosphorylation, indicating a central role for NADPH oxidase derived ROS (FIG. 5D). In line with the reduced ROS production, infarcted myocardium of TFΔCT mice showed markedly reduced ERK1/2 phosphorylation, decreased TGF-β1 activation, and reduced TGF-β1 signaling, evidenced by phosphorylation of SMAD2 and by pro-fibrotic α-SMA induction (FIG. 5C, FIG. 11E) compared to strain-matched wild-type (WT). Importantly, the phosphorylation of the alternative TF signaling target p38 MAPK 25 (FIG. 11F) were not altered in TFΔCT mice, underscoring the specificity for the ERK pathway.",
                                "Because early TGF-β1 signaling is required for late cardiac remodeling after infarction (47), the inventors examined TFΔCT mice 4 weeks after MI. Sirius red staining revealed increased collagen deposition and larger fibrotic areas in the hearts of LAD-ligated compared to sham operated mice, which was significantly reduced in TFΔCT mice (FIG. 5D). These morphological benefits were associated with protection from functional deterioration: Infarcted TFΔCT mice had significantly less dilated and better contracting left ventricles compared to infarcted controls (FIG. 5E) and improved survival in the first 30 days after MI (FIG. 5F).",
                                "Myeloid Cell TF Cytoplasmic Domain Phosphorylation in the Pre-Clinical and Clinical Setting of Permanent MI.",
                                "Since the inventor's findings suggested a central role for TF tail-dependent pro-fibrotic activity of myeloid cell, the inventors performed immunohistochemistry staining and revealed a relative abundance TGF-β1+Ly6C+ inflammatory cells compared to TGF-β1+CD31+ cells in the myocardium in both the sham and the permanent MI group. Importantly, TGF-β1+Ly6C+ cells were drastically increased in infarcted hearts of control mice, but significantly less in TFΔCT mice (FIG. 6A). To directly examine whether the role of myeloid cell TGF-β1 production depends on TF cytoplasmic tail signaling, the inventors generated bone marrow (BM) chimeras of TFΔCT mice. After 9-10 weeks of confirmed engraftment (FIGS. 12A-B), permanent MI was induced in chimeric mice for analysis 7 d later. Whereas CD45+CD11b+ myeloid cell recruitment to the infracted myocardium was indistinguishable between transplant groups (FIG. 12C), only chimeras with BM from TFΔCT mice (TFΔCT→WT) had reduced cardiac NOX2 expression, ERK1/2 phosphorylation and reduced active TGF-β1 (FIG. 6B) paralleled by attenuated SMAD2 activation 7 days post MI (FIG. 13A). 6 weeks after MI, only TFΔCT→WT mice showed improved cardiac function, thereby pheno-copying the TFΔCT animals (FIG. 13B). Thus, this preclinical evidence links myeloid cell TF-PAR2 signaling to TGF-β1-dependent adverse remodeling after MI.",
                                "Analysis of infarcted myocardium revealed that phosphorylation of the TF cytoplasmic domain was detectable specifically in CD45+ cells 7 days after experimental MI in WT but not in TFΔCT mice (FIG. 6C), suggesting that activation of the TF-dependent pro-fibrotic pathway can be identified by measuring this posttranslational modification. The inventors employed previously validated phosphorylation-specific antibodies to the TF cytoplasmic domain (48) to translate this finding to human IHF. The numbers 200 of CD45+ cells stained for phosphorylated TF were markedly increased in LV tissue samples obtained from IHF patients as compared to donor heart tissue (FIG. 6D-E, table 1). This increased TF phosphorylation was accompanied by up-regulation of IL6, CCL2 and CCR2 (FIG. 13C) and by myeloid cell recruitment as well as increased TGF-β1 activation and downstream phosphorylation of SMAD2 (FIG. 6F), indicating subsequent cardiac fibrotic remodeling.",
                                "The inventors next asked whether TF phosphorylation in liquid biopsies can be used for identifying patients at risk for IHF. Mice with permanent LAD ligation revealed a significant up-regulation of TF on circulating PBMCs (FIG. 7A-B). Patients with sub-acute, prolonged MI have a twofold higher risk of death and of developing heart failure compared to MI patients presenting early for interventional therapy (25). In a sample taken from the inventor's observational clinical MICAT study, the inventors focused on sub-acute MI compared to stable coronary artery disease (CAD) patients admitted for percutaneous coronary intervention (PCI, table 2). TF cytoplasmic domain phosphorylation in circulating monocytes and plasma levels of active TGF-β1 were significantly increased in sub-acute MI compared to stable CAD patients (FIG. 7C-E). These data indicate that myeloid cell TF phosphorylation may serve as a marker for patients at increased risk of developing IHF and adverse remodeling following MI.",
                                "Pharmacological Targeting of TF-FVIIa Improves Cardiac Function by Preventing TGF-β1 Activation.",
                                "The inventors next explored the feasibility to pharmacologically target TF signaling in cardiac remodeling after MI. Nematode anticoagulant protein C2 (NAPc2) blocks TF signaling and coagulation by forming an inhibited TF-FVIIa-FX (a) complex (15). Phase 2 clinical trials have documented safety of this drug in percutaneous interventions for coronary heart disease (16). Recapitulating the findings in mouse monocytes, isolated human monocytes exposed to inflammatory cytokines and hypoxia had increased NOX2 expression and TGF-β1 activation, which were suppressed in the presence of NAPc2, along with reduced ERK1/2 phosphorylation (FIG. 8A). In their preclinical model, the inventors showed that 7 d after permanent LAD ligation, circulating myeloid cells had increased levels of NOX2 and active TGF-β1 that were attenuated by NAPc2 treatment starting 1 day after acute MI (FIGS. 8B and C). In addition, NAPc2 improved cardiac function (FIG. 8D), attenuated cardiac infiltration of CD11 b+ myeloid cells (FIG. 14A) and diminished ERK1/2 phosphorylation, NOX2 expression, TGF-β1 activation and up-regulation of the downstream target α-SMA in the infarcted heart (FIG. 8E, FIG. 14B). Next, the inventors investigated the impact of acute blockade of TF signaling for late myocardial remodeling and the transition from acute MI to IHF. Compared to vehicle treated mice, short term NAPc2 treatment from 1 d until 7 d post MI significantly reduced cardiac fibrosis (FIG. 8F) and improved cardiac function in chronic MI (FIG. 8G). Importantly, this protection from cardiac damage resulted 232 in improved survival (FIG. 8H). Collectively, these results show that targeting of TF signaling function on myeloid cells results in beneficial cardiac remodeling and improves cardiac function post MI."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "investigate molecular pathophysiology of failing myocardium in IHF",
                                "perform unbiased label-free quantitative proteomics and phospho-proteomic profiling",
                                "analyze high-resolution accuracy mass spectrometric data",
                                "identify significantly changed proteins and phospho-peptides",
                                "perform gene ontology analysis",
                                "identify enriched pathways related to complement and coagulation cascades",
                                "perform protein-protein interaction analysis",
                                "identify phosphorylation of MAPK1 as a central node",
                                "evaluate contributions of MAPK pathway to IHF",
                                "block ERK1/2 activator MEK with trametinib in preclinical mouse model",
                                "assess effects of trametinib on cardiac function and ERK pathway",
                                "evaluate effects of trametinib on TGF-β1 activation and fibrosis markers",
                                "investigate role of MAPK pathway in monocytes",
                                "expose monocytes to hypoxia and inflammatory cytokines",
                                "assess ERK1/2 phosphorylation and TGF-β1 activation",
                                "implicate PAR2 as an upstream signal for monocyte ERK1/2 activation",
                                "evaluate role of monocyte-expressed PAR2 in cardiac remodeling",
                                "assess TGF-β1 activation and phosphorylation of SMAD2",
                                "evaluate effects of PAR2 deletion on cardiac function",
                                "investigate role of TF in myeloid cells",
                                "assess ERK1/2 activation and TGF-β1 activation",
                                "evaluate effects of TF deletion on cardiac function and fibrosis markers",
                                "investigate role of TF cytoplasmic domain signaling",
                                "assess NOX2 expression and ROS production",
                                "evaluate effects of TF cytoplasmic domain deficiency on cardiac function",
                                "investigate role of NOX2 in TGF-β1 activation and ERK1/2 phosphorylation",
                                "evaluate effects of TFΔCT mice on cardiac remodeling and function",
                                "investigate role of myeloid cell TF-PAR2 signaling in human IHF",
                                "assess phosphorylation of TF cytoplasmic domain in human IHF",
                                "evaluate potential of TF phosphorylation as a marker for patients at risk of IHF"
                            ],
                            "num_characters": 15290,
                            "outline_medium": [
                                "investigate molecular pathophysiology of failing myocardium in IHF",
                                "perform unbiased label-free quantitative proteomics and phospho-proteomic profiling",
                                "analyze gene ontology and protein-protein interaction",
                                "evaluate contributions of MAPK pathway to IHF",
                                "block ERK1/2 activator MEK with trametinib in preclinical mouse model",
                                "analyze effects of trametinib on cardiac function and ERK pathway",
                                "investigate role of MAPK pathway in monocytes and TGF-β1 activation",
                                "evaluate role of monocyte-expressed PAR2 in TGF-β1 activation",
                                "analyze effects of PAR2 deletion on cardiac dysfunction",
                                "investigate role of TF in myeloid cells and TGF-β1 activation",
                                "evaluate effects of TF deletion on cardiac ERK1/2 activation and TGF-β1 activation",
                                "analyze role of NOX2 in TGF-β1 activation and cardiac remodeling",
                                "evaluate effects of TF cytoplasmic domain deficiency on cardiac NOX2 expression and TGF-β1 activation",
                                "investigate role of myeloid cell TF-PAR2 signaling in TGF-β1-dependent adverse remodeling",
                                "analyze phosphorylation of TF cytoplasmic domain in human IHF"
                            ],
                            "outline_short": [
                                "investigate molecular pathophysiology of failing myocardium in IHF using proteomics and phospho-proteomic profiling",
                                "evaluate contributions of MAPK pathway to IHF by blocking ERK1/2 activator MEK with trametinib in preclinical mouse model",
                                "demonstrate role of myeloid cell PAR2 signaling in promoting TGF-β1 activation and cardiac remodeling post MI",
                                "show that TF-PAR2 signaling in infiltrating myeloid cells is responsible for ischemia-associated hyper-activation of MAPK pathway and TGF",
                                "investigate role of TF cytoplasmic domain signaling in pro-fibrotic TGF-β1 activation in permanent MI",
                                "demonstrate that myeloid cell TF cytoplasmic domain phosphorylation is linked to NOX2/ERK-dependent TGF-β1 activation",
                                "evaluate feasibility of pharmacological targeting of TF signaling in cardiac remodeling after MI using NAPc2"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce surprising discovery of myeloid cell TF-PAR2 signaling as a crucial driver for TGF-β1 activation and target for treatment or prevention"
                    ],
                    "num_characters": 389,
                    "outline_medium": [
                        "introduce surprising discovery of myeloid cell TF-PAR2 signaling as a crucial driver for TGF-β1 activation and target for treatment or prevention"
                    ],
                    "outline_short": [
                        "introduce surprising discovery of myeloid cell TF-PAR2 signaling as a crucial driver for TGF-β1 activation and target for treatment or prevention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE FIGURES",
                    "paragraphs": [
                        "FIG. 1: Activation of MAPK1 or ERK2 mediates myocardial ischemia in clinical setting of MI. Proteins isolated from heart biopsies from IHF (MI, n=5) and non-IHF donor hearts (controls, n=5) were analyzed by label-free quantitative proteomics. Samples were measured in quadruplicate (proteins) and triplicate (phosphopeptides) LC-MS/MS runs. A), Heat maps showing the quantity profile for 208 proteins and 685 phosphopeptides significantly differing (p<0.05, fold-change>2 or <0.5 and identified in more than 60% of all LC-MS/MS replicates in either control or infarct group), log 10 transformed and row-wise normalized using z-score and sorted by descending fold-change. B), Reactome pathway enrichment analysis of differentially abundant proteins. C), Differentially regulated (p<0.05) non phosphorylated and phosphorylated proteins were analyzed for their previously known protein-protein interactions between each other by Cytoscape STRING DB search and sorted by the number of interactions in a circular layout. Among the present kinases, MAPK1 shows the most interactions followed by mTOR, TTN CDK13, PI4KA and TAOK2. D), Volcano plot depicts results of the significantly differing integrative inferred kinase activity (InKA) scores between infarct versus control group.",
                        "FIG. 2: Inhibition of ERK1/2 activation attenuates myocardial remodeling and inflammation in preclinical setting of MI. A), Design of experimental mouse model. Wild type (WT) mice were subjected to permanent LAD ligation versus sham surgery and administered with vehicle or trametinib (1 mg/kg/d) or vehicle treatment once daily via oral gavage from day 1 through 7. B), High-frequency ultrasound echocardiography obtained in parasternal long axis (PLAX) with measurement of left ventricular ejection fraction (LVEF, %) and left ventricular end diastolic volume (LVEDV, μl) on day 7 after operation. C), Protein expression analysis of pERK1/2 (normalized to total ERK1/2) and activated TGF-β1 (normalized to GAPDH) in infarcted myocardium obtained from vehicle or trametinib treated mice. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=4-7 animals per group. D), Relative mRNA expression analysis of 116, Tnf, Ccl2 and Ccr2 from the infarcted myocardium. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=4-7 mice per group. E), Flow cytometry analysis of the infarcted myocardium obtained from vehicle or trametinib treated mice normalized to heart weight. Representative dot plots and quantification of CD45+ leukocytes, CD45+/CD90.2−/B220−/NK1.1−/CD11b+ myelomonocytic cells, CD45+/CD90.2−/B220−/NK1.1−/CD11b+/Ly-6G−/F4/80−/Ly-6Chigh monocytes and CD45+/CD90.2−/B220−/NK1.1−/CD11b+/Ly-6G−/F4/80−/Ly-6Cneg macrophages. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-6 animals per group.",
                        "FIG. 3: A pro-fibrotic MEK1/2-TGF-β1 pathway is linked to PAR-2 mediated ROS signaling in monocytes. A), Confocal microscopy of myocardial cryo-sections obtained from WT (C57BL/6J) mice at day 7. Representative images and quantification of pERK1/2+ cells co-stained for 781 CD31, CD45, αSMA and cTNT. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5 animals per group. B-C, Protein expression analysis of monocytes isolated from WT mice and pre-treated with trametinib (10 μM) for 1 h (B); and from PAR2−/− mice (C). Cells were stimulated with an inflammatory cytokine cocktail containing IL-6, TNF-α and CCL2 at a concentration of 20 ng/ml with and without hypoxia for 4 hrs. Western blotting of pERK1/2 (normalized to total ERK1/2), NOX2 (see FIG. 11E) and activated TGF-β1 (normalized to GAPDH). Ordinary one-way ANOVA, Sidak's multiple comparison test n=5 replicates per each group (2-3 mice were pooled for each sample). PAR2 fl/fl and PAR2 LysMCre littermates were subjected to permanent LAD ligation and investigated after 7 days. (D), Western blot analysis of activated TGF-β1 (normalized to GAPDH) and p-SMAD2 (normalized to total SMAD2) in the infarcted myocardium obtained from PAR2 LysMCre and PAR2 fl/fl littermates. Representative blots and quantification of biological replicates. (E), High-frequency ultrasound echocardiography obtained from PAR2 fl/fl LysMCre and PAR2 littermate control mice with measurement of LVEF (%) and LVEDV (p1). 794 Mann-Whitney test, n=5 animals per group.",
                        "FIG. 4: Myeloid cell derived TF-PAR2 complex is required for TGF-β1 activation. A), Confocal microscopy of myocardial cryo-sections obtained from WT (C57BL/6J) mice at day 7. Representative images and quantification of TF+ cells co-stained for CD45. Unpaired t test, n=5-6 animals per group. TF fl/fl LysMCre and TF fl/fl littermates were subjected to permanent LAD ligation versus sham surgery and investigated after 7 days. B), Protein expression analysis of pERK1/2 (normalized to total ERK1/2) in the infarcted myocardium obtained from TF fl/fl LysMCre and TF littermates. Ordinary one-way ANOVA, Sidaks multiple comparison test, n=5-6 animals per group. C), Western blot analysis of activated TGF-β1 (normalized to GAPDH) and p-SMAD2 (normalized to total SMAD2) in the infarcted myocardium obtained from TF fl/fl LysMCre and TF fl/fl littermates. Representative blots and quantification of biological replicates. D-E), Relative mRNA expression analysis of 116, CCr2 (D), COLOA1, COLO3A1 and Acta2 (E) in the infarcted myocardium obtained from TF fl/fl LysMCre and TF fl/fl littermates. Ordinary one-way ANOVA, Sidaks multiple comparison test, n=5-7 animals per group. F), High-frequency ultrasound echocardiography obtained from TF LysMCre and TF fl/fl 807 littermates. Ordinary one-way ANOVA, Sidaks multiple comparison test, n=5-7 animals per group.",
                        "FIG. 5: TF cytoplasmic tail deletion attenuates ROS production and ERK1/2-TGF-β1 signaling-dependent cardiac fibrosis and improves cardiac function. WT and TFΔCT mice were subjected to permanent LAD ligation versus sham surgery and investigated after 7 days and 4 weeks. A), Confocal microscopy of myocardial cryo-sections. Representative images and quantification of 812 mean fluorescence intensity (MFI) of CD45/gp91phox double positive cells. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-6 animals per group. B), Assessment of superoxide formation in infarcted myocardium by DHE-HPLC analysis. Representative chromatogram of 2-HE, the oxidation product of DHE, and quantification normalized to weight of the infarcted tissue. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-6 animals per group. C), Western blot analysis of activated TGF-β1 (normalized to GAPDH) and p-SMAD2 (normalized to total SMAD2) in infarcted myocardium obtained from WT or TFΔCT mice after 7 d of MI. Representative blots and quantification of biological replicates. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-8 animals per group. D), Protein expression analysis of monocytes isolated from NOX2−/− animals and stimulated with an inflammatory cytokine cocktail containing IL-6, TNF-α and CCL2 at a concentration of 20 ng/ml with and without hypoxia for 4 hrs. Western blotting of pERK1/2 (normalized to ERK1/2) and activated TGF-β1 (normalized to GAPDH). Ordinary one-way ANOVA, Sidak's multiple comparison test n=4 replicates per each group (2-3 mice were pooled for each sample). E), Sirius red staining and de-convoluted images of fibrotic area on paraffin embedded heart sections 4 weeks post MI versus sham surgery. Representative images and 827 quantification of fibrotic areas normalized to surface area. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-6 animals per group. F), Longitudinal echocardiographic studies over 4 weeks for LVEF (%), LVEDV (p1) in PLAX M-mode; two-way ANOVA, Bonferroni's multiple comparisons test, n=6-17 animals per each group. G), Kaplan-Meier survival analysis of LAD ligated versus sham operated C57BLJ6J and TFΔCT mice over 4 weeks. Log-rank (Mantel-Cox) test, n=15-20 animals per group.",
                        "FIG. 6: Myeloid cell TF cytoplasmic domain phosphorylation mediates ERK1/2-TGF-β1 dependent cardiac remodeling in pre-clinical and clinical setting of MI. A), Confocal microscopy of myocardial cryo-sections obtained from WT (C57BL/6J) and TFΔCT mice. Representative images and quantification of mean fluorescence intensity (MFI) of Ly6C/TGFβ-1 and CD31/TGF-β1 positive cells. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=animals per group. Bone marrow (BM) transplanted mice were subjected to permanent LAD ligation versus sham surgery and investigated 7 days later. B), Western blot analysis of NOX2 (normalized to GAPDH), pERK1/2 (normalized to total ERK1/2) and TGF-β1 (normalized to GAPDH) in infarcted myocardium obtained from chimeric mice. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-7 animals per group. C), Representative confocal images of phosphorylation status of TF in infarcted myocardium obtained from WT or TFΔCT mice after 7 d. Top: Representative images and quantification of biological replicates. Kruskal-Wallis test and Dunns-multiple comparison test, n=3-4 animals per group. D), Representative immunofluorescence confocal microscopy images of CD45 positive and CD45/pTF double positive cells 844 in human myocardium specimens obtained from n=5 non-ischemic (NI) donor hearts and n=7 IHF patients (MI). Quantification of biological replicates. Mann-Whitney test. E-F), Western blot analysis and quantification of human left ventricular tissue obtained from n=5 non-ischemic (NI) donor hearts and n=9 IHF (MI) patients for pTF (normalized to total TF), TF (E) and TGF-β1 (normalized to GAPDH) and pSMAD2 (normalized to total SMAD2) (F). Mann-Whitney test.",
                        "FIG. 7: Phosphorylation of TF cytoplasmic domain on circulating monocytes in pre-clinical and 851 clinical setting of MI. A), Western blot analysis of TF in circulating PBMCs isolated from WT (C57BL/6J) mice at day 7. Un-paired t-test, n=5-7 animals per group. B), Flow cytometry analysis of the PBMCs isolated from WT (C57BL/6J) mice at day 7. Representative counter plots and quantification of CD45+/TF+, CD45+/TF+/CD115+/Ly6Chi and TF+/CD115+ Ly6Clo cells. Kruskal-Wallis test, Dunns-multiple comparison test, n=4-5 animals per group. C), Confocal microscopy of monocytes isolated from the patients described in table 1 stained for p-TF (red), TF (red) and DAPI (blue). D), Western blot analysis of monocytic protein expression for TF cytoplasmic domain phosphorylation (4G6) and TF (10H10) E), Plasma levels of activated TGF (31 in samples obtained from the patients described in table 1. Mann-Whitney unpaired t-test; n=6 patients per group.",
                        "FIG. 8: Pharmacological targeting of TF-FVIIa improves cardiac function by preventing TGF-β1 activation. A), Protein expression analysis of pERK1/2 (normalized to total ERK1/2), NOX2 and TGF-β1 (normalized to GAPDH) on isolated human monocytes exposed to hypoxia in the presence of cytokine cocktail mix (20 ng/ml) with and without NAPc2 (200 ng/ml). Representative blots and quantification. B), Western blot analysis of NOX2 and TGF-β1 (normalized to GAPDH) obtained from PBMCs of the experimental animals 7 days after MI. Representative images and quantification of replicates. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-7 animals per group. C), Experimental design: Mice were injected with NAPc2 (1 mg/kg/d) once daily by i.p. injection from day 1 through day 7. D), High-frequency echocardiography obtained in parasternal long axis (PLAX) with measurement of LVEF, LVEDV on day 7 after LAD ligation. E), Representative blots for protein expression analysis of pERK1/2, NOX2, TGF-β1 and α-SMA in infarcted myocardium obtained from vehicle or NAPc2 treated mice. F-H, Mice were injected with NAPc2 (1 mg/kg/d) and/or vehicle (1 mg/kg/d) once daily by i.p. injection from day 1 through day 7 followed by longitudinal analysis. Representative images and quantification of fibrotic areas normalized to surface area. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-7 animals per group (F). Echocardiographic studies over 4 weeks from day 7 for LVEF (%), LVEDV (p1) in PLAX M-mode; two-way ANOVA, Bonferroni's multiple comparisons test, n=6-12 animals per each group (G). Kaplan-Meier survival analysis of LAD ligated versus sham operated NAPc2 876 and vehicle treated mice after 4 weeks. Log-rank (Mantel-Cox) test, n=7-15 animals per group (H).",
                        "FIG. 9: Protein expression analysis of pJNK/SAK (normalized to total JNK/SAK) and p38 (normalized to GAPDH) in infarcted myocardium obtained from vehicle or trametinib treated mice. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=4-6 animals per group. B), Relative mRNA expression analysis of COLOA1, COLO3A1, Acta2 and Posn from the infarcted myocardium obtained from vehicle or trametinib (1 mg/kg/d) treated animals once daily via oral gavage from day 1 through 7. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=4-6 animals per group.",
                        "FIG. 10: Flow cytometry analysis of the infarcted myocardium obtained from PAR2 fl/fl and PAR2 fl/fl LysMCre littermates at day 7. Representative dot plots and quantification of CD45+ leukocytes, CD45+/CD90.2−/NK1.1−/CD11b+ myelomonocytic cells. Mann-Whitney test, n=animals per group.",
                        "FIG. 11: Analysis of WT (C57BL/6J) and TFΔCT mice subjected to permanent 912 LAD ligation versus sham surgery after 7 days. A), Western blot analysis of gp91phox and p67phox (normalized to α-actinin) expressed in PBMCs of the experimental animals. Representative blots and quantification of biological replicates. Ordinary one-way ANOVA and Sidak's multiple comparison test, n=6-10 animals per group. B-C, Western blot analysis of pERK1/2 (normalized to total ERK1/2), α-SMA (normalized to GAPDH) (B) and Pp38 (normalized to total P38) (C) in the infarcted myocardium obtained from WT or TFΔCT mice after 7 d of MI. Representative blots and quantification of biological replicates. Ordinary one way ANOVA, Sidak's multiple comparison test, n=5-8 animals per group. D), Protein expression analysis NOX2 (normalized to GAPDH) in the infarcted myocardium obtained from TF fl/fl LysMCre and TF fl/fl littermates. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-7 animals per group. F), Assessment of superoxide formation in infarcted myocardium obtained from PAR2 fl/fl and PAR2 fl/fl LysMCre littermates at day 7 by DHE-HPLC. Representative chromatogram of 2-HE, the oxidation product of DHE, and quantification normalized to total protein counts. Ordinary one-way ANOVA, Sidak's multiple",
                        "925 comparison test, n=5-6 animals per group.",
                        "FIG. 12: Analysis of bone marrow (BM) transplanted mice subjected to permanent LAD ligation versus sham surgery after 7 days. A), Scheme of the BM transplantation experiment. B), Representative pie chart showing the percentage of peripheral blood CD45.1+ and CD45.2+ cells to quantify donor chimerism. C), Flow cytometry analysis of the infarcted myocardium obtained from BM transplanted mice. Representative dot plots and quantification of CD45+ leukocytes, CD45+/CD90.2-31/NK1.1−/CD11 b+ myelomonocytic cells. Kruskal-Wallis test and Dunns-multiple comparison test, n=3-6 animals per group.",
                        "FIG. 13: Analysis of bone marrow (BM) transplanted mice subjected to permanent LAD ligation versus sham surgery after 7 days. A, Western blot analysis of pSMAD2 (normalized to SMAD2) and α-SMA (normalized to GAPDH) in infarcted myocardium obtained from BM transplanted mice. Representative blots and quantification of biological replicates. Ordinary one-way ANOVA, Sidak's multiple comparison test, n=5-6 animals per group. B), LVEF (%) and LVEDV (pp in PLAX M-mode after 6 weeks post MI. Ordinary one-way ANOVA, Sidak's multiple comparison test n=6-10 animals per each group. C), mRNA expression analysis of IL6, CCL2 and CCR2 in human left ventricular tissue obtained from the n=5 non-infarct (NI) donor hearts and n=9 IHF (MI) patients. Mann-Whitney unpaired t-test.",
                        "FIG. 14: Flow cytometric analysis of infarcted myocardium and quantification analysis of pERK1/2 A), Flow cytometric analysis of infarcted myocardium obtained from NAPc2 treated animals (1 mg/kg/d) normalized to heart weight. Representative dot plots and quantification of CD45+ leukocytes and CD45+/CD90.2−/NK1.1−/CD11b+ leukocytes. Ordinary 944 one-way ANOVA, Sidak's multiple comparison test, n=5-7 animals per group. B), Quantification analysis of pERK1/2 (normalized to total ERK1/2), NOX2, TGF-β1 and α-SMA (normalized to GAPDH) of representative western blots shown in FIG. 8E.",
                        "FIG. 15: Deficiency of coagulation factor VII in CX3CR1 + myeloid cells attenuates the development of ischemic heart failure independent of affecting the number of infiltrated immune cells. FVIIfl/fl CX3CR1Cre and FVIIfl/fl littermates were subjected to permanent LAD ligation versus sham surgery and investigated after 7 days. A) High-frequency ultrasound echocardiography obtained from FVIIfl/fl CX3CR1Cre and FVIIfl/fl littermates. Mann-Whitney test, n=animals per group. B), Flow cytometry analysis of the infarcted myocardium obtained from FVIIfl/fl CX3CR1Cre and FVIIfl/fl littermates at day 7. Representative dot plots and quantification of CD45+ leukocytes, CD45+/CD90.2−/NK1.1−/CD11b+ myelomonocytic cells as well as CD45+/CD90.2−/NK1.1 −/CD11b+/Ly6G−/Ly6Chi and CD45+/CD90.2−/NK1.1−/CD11b+/Ly6G−/Ly6Clo inflammatory cells. Mann-Whitney test, n=5 animals per group.",
                        "FIG. 16: Deficiency of integrinβ1 in myeloid cells attenuates the infiltration of inflammatory cells and blocks cardiac pro-fibrotic protein expression in the development of ischemic heart failure. Integrinβfl/flLysMCre and integrinβ1fl/fl littermates were subjected to permanent LAD ligation versus sham surgery and investigated after 7 days. A) High-frequency ultrasound echocardiography obtained from integrin 131 fl/fl LysMCre and integrinβ1 fl/fl littermates. Mann-Whitney test, n=5 animals per group. B) Western blot analysis of activated TGF-β1 (normalized to GAPDH) and p-SMAD2 (normalized to total SMAD2) in the infarcted myocardium obtained from integrinβ1 fl/fl LysMCre and integrinβ1fl/fl littermates. Representative blots and quantification of biological replicates. Mann-Whitney test, n=5 animals per group. C), Flow cytometry analysis of the infarcted myocardium obtained from integrinβ1fl/flLysMCre and integrinβ1fl/fl at day 7. Representative dot plots and quantification of CD45+ leukocytes, CD45+/CD90.2−/NK1.1−/CD11b+ myelomonocytic cells as well as CD45+/CD90.2−/NK1.1−/CD11b+/Ly6G−/Ly6Chi and CD45+/CD90.2−/NK1.1−/CD11b+/Ly6G−/Ly6Clo inflammatory cells. Mann-Whitney test, n=5 animals per group. D), Flow cytometry analysis of splenic cells obtained from integrinβ1 fl/flLysMCre and integrinβ1fl/fl littermates at day 7. Representative dot plots and quantification of CD45+/CD90.2−/NK1.1−/CD11b+/Ly6G−/Ly6Clo inflammatory cells. Mann-Whitney test, n=5 animals per group."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe figure 1",
                        "analyze protein expression in figure 1A",
                        "perform reactome pathway enrichment analysis in figure 1B",
                        "analyze protein-protein interactions in figure 1C",
                        "depict volcano plot in figure 1D",
                        "describe experimental design in figure 2A",
                        "analyze echocardiography data in figure 2B",
                        "analyze protein expression in figure 2C",
                        "analyze mRNA expression in figure 2D",
                        "analyze flow cytometry data in figure 2E",
                        "describe confocal microscopy in figure 3A",
                        "analyze protein expression in figure 3B",
                        "analyze protein expression in figure 3C",
                        "analyze western blot data in figure 3D",
                        "analyze echocardiography data in figure 3E",
                        "describe confocal microscopy in figure 4A",
                        "analyze protein expression in figure 4B",
                        "analyze western blot data in figure 4C",
                        "analyze mRNA expression in figure 4D-E",
                        "analyze echocardiography data in figure 4F",
                        "describe confocal microscopy in figure 5A",
                        "analyze superoxide formation in figure 5B",
                        "analyze western blot data in figure 5C",
                        "analyze protein expression in figure 5D",
                        "analyze fibrotic area in figure 5E",
                        "analyze echocardiography data in figure 5F",
                        "analyze survival data in figure 5G",
                        "describe confocal microscopy in figure 6A",
                        "analyze western blot data in figure 6B",
                        "analyze phosphorylation status in figure 6C",
                        "analyze immunofluorescence data in figure 6D",
                        "analyze western blot data in figure 6E-F",
                        "analyze protein expression in figure 7A",
                        "analyze flow cytometry data in figure 7B",
                        "describe confocal microscopy in figure 7C",
                        "analyze western blot data in figure 7D-E",
                        "analyze plasma levels in figure 7F"
                    ],
                    "num_characters": 18903,
                    "outline_medium": [
                        "describe figure 1: activation of MAPK1 or ERK2",
                        "analyze protein expression in figure 1",
                        "describe figure 2: inhibition of ERK1/2 activation",
                        "analyze protein expression in figure 2",
                        "describe figure 3: pro-fibrotic MEK1/2-TGF-β1 pathway",
                        "analyze protein expression in figure 3",
                        "describe figure 4: myeloid cell derived TF-PAR2 complex",
                        "analyze protein expression in figure 4",
                        "describe figure 5: TF cytoplasmic tail deletion",
                        "analyze protein expression in figure 5",
                        "describe figure 6: myeloid cell TF cytoplasmic domain phosphorylation",
                        "analyze protein expression in figure 6",
                        "describe figure 7: phosphorylation of TF cytoplasmic domain",
                        "analyze protein expression in figure 7",
                        "describe figure 8: pharmacological targeting of TF-FVIIa",
                        "analyze protein expression in figure 8",
                        "describe figures 9-16: additional analysis of protein expression",
                        "describe figure 17: deficiency of integrinβ1 in myeloid cells"
                    ],
                    "outline_short": [
                        "describe experimental design of mouse model",
                        "analyze protein expression in heart biopsies",
                        "show inhibition of ERK1/2 activation in mouse model",
                        "investigate PAR-2 mediated ROS signaling in monocytes",
                        "analyze TF cytoplasmic tail deletion in mouse model",
                        "show myeloid cell TF cytoplasmic domain phosphorylation",
                        "analyze pharmacological targeting of TF-FVIIa",
                        "show protein expression analysis of various signaling pathways",
                        "analyze deficiency of coagulation factor VII and integrinβ1 in myeloid cells"
                    ]
                },
                {
                    "title": "Material and Methods:",
                    "paragraphs": [
                        "Clinical studies: Twelve Patients enrolled in the MICAT (Mainz Intracoronary Database, ClinicalTrials.gov Identifier: NCT02180178) study were examined. The study protocol was approved by the local ethics committee of the state of Rhineland-Palatinate, Germany. Patients with subacute MI were defined as follows: Elevated circulating cardiac troponin I compatible with myocardial injury according to the Fourth Universal Definition of MI (49); symptoms of acute coronary syndrome>24 hrs to <30 days prior to percutaneous coronary intervention; signs of subacute MI in the electrocardiogram. Written informed consent was obtained from every participant. Medical history was documented, body weight, height, and heart rate were obtained. Up to 30 ml of venous blood drawn from the cubital vein of the right arm was used for monocyte isolation. Peripheral blood cells from the whole blood were isolated by HistopaqueR (CAT #11191, 1077, Sigma-Aldrich, Germany) gradient cell separation. Peripheral blood collected from the patients was added to the 1:1 ratio of HistopaqueR-1119 and HistopaqueR-1077. After centrifugation at 700×g for 30 min at room temperature, collected mononuclear cell layer was washed with PBS for further platelets elimination. Monocytes were isolated from peripheral blood mononuclear cells (PBMCs) by negative selection using Monocytes Isolation Kit II (human: CAT #130-117-337, Miltenyi Biotech, Germany) according to the manufacturer's instructions. Enriched monocytes were homogenized in appropriate RIPA buffer for further western blot analysis. In addition to the protein expression analysis, cells were plated and fixed on the cover slip for further confocal imaging.",
                        "Human Heart Samples: Ischemic heart samples were obtained from the left ventricular wall of explanted hearts following cardiac transplantation or from heart tissue obtained during implantation of left ventricular assist device. Donor hearts were acquired from organ donors whose hearts were not used for transplantation. All subjects provided written informed consent for tissue donation and analyses with ethical approval by the Herz-und Diabeteszentrum NRW (HDZ-NRW), Erich & Hanna Klessmann-Institute. Acquired heart samples were divided into at least 3 pieces, snap frozen in liquid nitrogen, and stored at −80° C. by HDZ-NRW. Upon receipt, samples were used for analysis of protein by western blotting, RNA quantification and cryo-sectioning. Obtained samples were embedded in the O.C.T. to obtain transverse sections of the myocardial tissue.",
                        "Proteomic profiling of human hearts. Heart tissue biopsy samples from five healthy donors and five patients with ischemic heart failure (IHF) were prepared for whole proteome and phosphoproteome analysis. The tissues were lysed in buffer (7 M Urea/2 M Thiourea/1% Phosphatase Inhibitor Cocktail 3 (Sigma, Darmstadt, Germany)/100 mM NH4HCO3) by sonication for 15 min (30 s on/off cycles) at 4° C. with high power in a Bioruptor device (Diagenode, Liege, Belgium). After centrifugation (15 min/4° C./13 000 rpm) the protein concentration was determined using the Pierce 660 335 nm protein assay (Thermo Fisher Scientific, Waltham MA, USA) according to the manufacturer's protocol. For whole proteome analysis a protein amount of 20 μg was aliquoted for Filter Aided Sample Preparation (FASP) and 700 μg protein was aliquoted for in-solution digest followed by phosphopeptide enrichment. The 20 μg aliquot of proteins were transferred onto Nanosep molecular weight cutoff (MWCO) spin filter columns with 30 kDa MWCO (Pall, Port Washington NY, USA) and washed with 8 M urea following the previously published protocol (50, 51). DTT and IAA was used for reduction and alkylation, excess IAA was quenched with DTT and the membrane was washed with 50 mM Ammoniumbicarbonate (AMBIC). The proteins were digested overnight at 37° C. with trypsin (Trypsin Gold, Promega, Fitchburg WI, USA) using an enzyme-to-protein ratio of 1:50 (w/w). After digestion, peptides were eluted by centrifugation and two washes with 50 mM AMBIC. The pooled flow-throughs were acidified with trifluoroacetic acid (TFA) to a final concentration of 1% (v/v) TFA and lyophilized. Purified peptides were reconstituted in 0.1% (v/v) formic acid (FA) for LC-MS analysis. 200 ng tryptic peptides from FASP preparation were separated on a nanoAcquity LC (Waters Corporation, Milford MA, USA) at 300 nL/min by a reversed phase C18 column (HSS-T3 C18 1.8 μm, 75 μm×250 mm, Waters Corporation) at 55° C. using a 90 min linear gradient from 5% Eluent A (0.1% TFA/3% DMSO/Water) to 40% Eluent B (0.1% TFA/3% DMSO/ACN) (52). Eluting peptides were analyzed in positive mode ESI-MS by ion-mobility separation (IMS) enhanced data independent acquisition (DIA) UDMSE on a Synapt G2-S HDMS mass spectrometer (Waters Corporation) mode as described before [2,4]. Acquired MS data were post-acquisition lock mass corrected using [Glu1]-Fibrinopeptide B, which was sampled every 30 s into the mass spectrometer via the reference sprayer of the NanoLockSpray source at a concentration of 250 fmol/μL. LC—MS DIA raw data processing was performed with ProteinLynx Global SERVER (PLGS) (version 3.02 build 5, Waters Corporation). The human reference proteomes (entries: 20,365) obtained from UniProtKB/SwissProt containing common contaminants was used for peptide identification with allowed missed cleavages of two, carbamidomethylation as fixed modification as well as oxidation on methionine as variable modification. The false discovery rate (FDR) for peptide and protein identification was assessed searching a reversed decoy database and set to a 1% threshold for database search in PLGS. Label-free quantification analysis was performed using ISOQuant as described before (53). Distler U, et al. Drift time-specific collision energies enable deep-coverage data-independent acquisition proteomics. Nat. Methods. 2014; 11:167-364 170. doi: 10.1038/nmeth.2767 (54).",
                        "Phosphopeptide analysis: The 700 μg protein aliquot was digested in-solution by first diluting the lysis buffer 1:4.44 with 50 mM NH4HCO3. After reduction with 1 h incubation with 10 mM DTT at 32° C. and alkylation with 45 min incubation of 25 mM IAA at room temperature in the dark, 367 the proteins were digested over night with trypsin (TPCK-treated, Sigma-Aldrich) at 32° C. using an enzyme-to-protein ratio of 1:25 (w/w). After acidification by addition of 0.5% TFA the samples were desalted on 500 mg Sep-Pak tC18 columns (Waters Corporation) and lyophilized. Phosphopeptide enrichment was performed using preloaded TiO2 spin-tips (3 mg TiO2/200 μL tips, GL Sciences, Tokyo, Japan). The tips were conditioned by centrifugation (3000×g/2 min/room temperature (RT)) of 20 μL washing buffer (80% CAN/0.4% TFA) followed by centrifugation of 20 μL loading buffer with same settings. The peptides were resuspended in 150 μL loading buffer (57% ACN/0.3% TFA/40% lactic acid), loaded onto the spin-tips and centrifuged (1000×g/10 min/RT). The flow-through was re-applied and centrifuged with same settings. The bound phosphopeptides were washed with 20 μL loading buffer and centrifuged (3000×g/2 min/RT) followed by three times centrifugations with 20 μL washing buffer. The purified phosphopeptides were eluted by centrifugation (1000×g/10 min/RT) of first 50 μL of 1.5% NH3 and second 50 μL of 5% Pyrrolidine into one collection tube. After acidification by adding 100 μL 2.5% TFA, the phosphopeptides were desalted using Pierce graphite spin-columns (Thermo Scientific) following the manufacturers protocol. After elution and lyophilization, the phosphopeptides were reconstituted in 20 μL of 0.1% (v/v) formic acid (FA) for LC—MS analysis 2 μL of the reconstituted phosphopeptides were separated on an Ultimate 3000 nanoUPLC (Thermo Scientific) with 300 nL/min by a reversed phase C18 column (HSS-T3 C18 1.8 μm, 75 μm×250 mm, Waters Corporation) at 55° C. using a 90 min linear gradient from 5% Eluent A (0.1% TFA/3% DMSO/Water) to 35% Eluent B (0.1% TFA/3% DMSO/ACN) followed by ionization using a Nanospray Flex electrospray ionization source (Thermo Scientific).",
                        "All samples were measured in triplicates. Mass-to-charge analysis of the eluting peptides was performed using an Orbitrap Exploris 480 (Thermo Scientific) in data dependent acquisition (DDA) mode. Full scan MS1 spectra were collected over a range of 350-1600 m/z with a mass resolution of 60 000 @ 200 m/z using an automatic gain control (AGC) target of 300%, maximum injection time was set to “Auto” and RF lens to 40%. The Top20 most intense peaks above the signal threshold of 2×104, harboring a charge of 2-6, were selected within an isolation window of 1.4 Da as precursors for fragmentation using higher energy collisional dissociation (HCD) with normalized collision energy of 30. The resulting fragment ion m/z ratios were measured as MS2 spectra over a automatically selected m/z range with a mass resolution of 15 000 @ 200 m/z, AGC target was set to “Standard” and maximum injection time to “Auto”. The mass spectrometry proteomics data have been deposited to the ProteomeXchange Consortium via the PRIDE [6] partner repository with the dataset identifier PXD024727. Raw data processing for discovery phosphoproteomics analysis was performed in Proteome Discoverer V2.4 (Thermo Scientific) using Sequest HT Search Engine in the processing workflow. UniProtKB/SwissProt entries of the human reference proteomes (entries: 20,365) were used as database 400 for peptide and protein identification with maximum allowed missed cleavages of two, maximum precursor and fragment ion mass tolerance of 10 ppm and 0.02 Da respectively. Carbamidomethylation on cysteine (+57.021 Da) was set as only fixed modification. Oxidation on methionine (+15.995 Da) as well as phosphorylation on serine, threonine and tyrosine (+79.966 Da) were set as dynamic modifications while allowing up to 4 dynamic modifications per peptide. In addition, N-terminal acetylation of proteins was enabled as variable modification. Validation of the search results was performed using the Percolator algorithm by applying a concatenated Target/Decoy approach and filtering for 1% False Discovery Rate (FDR). The phosphosite localization probabilities were determined using IMP-ptmRS with PhosphoRS mode enabled. Features were detected with Minora Feature Detector. In the consensus workflow, Label-Free quantification (LFQ) was performed by Feature Mapping and subsequent Precursor Ions Quantifier using the top 3 intense unique and razor peptides. Raw data processing for Integrative Inferred Kinase Activity (InKA) analysis was performed in MaxQuant V1.6.14.0 (55) using the same search engine settings as in Proteome Discoverer including LFQ with “Match Between Runs” enabled. The results were then submitted for InKA analysis (55). The resulting quantitative information for proteins and phosphosites were analyzed using R including the packages tidyverse, pheatmap and imputeLCMD. Fold changes (FC) of acute myocardial infarction (AMI) group versus control group were calculated using median intensity values. Two-sided t-test assuming equal variances was performed for all samples that could be confidently identified with valid intensity values in at least 60%. All samples that were confidently appearing or disappearing in AMI condition (i.e. at least 60% identified intensities in one of the conditions and only NAs in the other condition) were assigned a FC of 100 and 0.01 as well as a p-value of 0.001. The resulting p-values were corrected for multiple testing using the Benjamini-Hochberg (FDR) method. The resulting proteins and phosphosites were then filtered for FCs>2 and <0.5 and an adjusted p-value of <0.05. After sorting for descending fold change, the protein and phosphopeptide abundances were log 10 transformed, normalized by z-score and plotted as heatmap. Protein-Protein-Interaction 425 (PPI) networks were generated using Cytoscape V3.7.2 including the stringAPP, NetworkAnalyzer plugins and ClueGO app (56, 57-59). Changes in InKA scores were identified by calculating FC and performing t-test applying the same settings as for proteome and phosphoproteome data. The log 2 of the FC and −log 10 of the adjusted p-value was calculated and displayed in a volcano plot.",
                        "Animals: 9 to 12 weeks old male mice lacking 21 amino acid of the cytoplasmic tail of TF (TFΔCT mice) on a C57BL/6J background and PAR2−/− mice on a C57BL/6N background were used along with strain matched controls (37). PAR2fl/fl mice were crossed to LysMCre mice to generate conditional knockout of PAR2 on myeloid cell compartment (PAR2fl/fl LysMCre+ mice) 13, as controls Cre negative PAR2fl/f 432 l littermates were used. Generation of TFfl/flLysMCre+/− mice has been previously described56. All animals were bred and housed in the Translational Animal Research Center (TARC) of the Johannes Gutenberg University, Mainz, Germany. All animal experiments were carried out in accordance with the “Guide for the care and use of Laboratory animals” and approved by the “Landesuntersuchungsamt Rheinland-Pfalz” and ethics committee of the University Medical Centre of Johannes Gutenberg University, Mainz.",
                        "Mouse model of experimental myocardial infarction (MI) and in vivo treatments: MI was induced by permanent ligation of the proximal left anterior descending artery (LAD) as described previously (60). Mice were anesthetized with medetomidin (500 μg/kg bw), fentanyl (50 μg/kg bw) and midazaolam (5 mg/kg bw). To antagonize the anesthesia, we injected atipamezol (2.5 mg/kg bw) and flumazenil (0.5 μg/kg bw). Sham surgery followed the same procedure except for ligation of the LAD. Mice received buprenorphine (0.075 mg/kg s.c.) twice daily for 2 d, starting on the day of surgery. A total number of 40 male C57BL/6J mice were divided in to the sham group (n=13) and the LAD ligated group (n=27) (M1). HF was defined in this study by a reduction of the LVEF below 35% and/or visual infarction of the LV. Animals which did not fulfil these criteria were excluded from the study. LAD ligated animals were further randomly divided into vehicle treated group (MI+vehicle) and MI+trametinib/MI+NAPC2 group. Trametenib (GSK1120212) was purchased from Selleck Chemicals and reconstituted in 200 μl vehicle (methocel/polysorbate buffer) and orally administrated to the mice (1 mg/kg/day) once a day starting from day 1 after MI throughout day 7. For NAPC2 treatment, mice were treated with intraperitoneal injections (1 mg/kg/d) of NAPc2 reconstituted in NaCl. Dosing was performed once a day staring from 1 day after MI until sacrifice at day 7.",
                        "Bone marrow transplantation: TFΔCT, C57Ly5.1 and C57BL/6J mice aged 8-11 weeks old were irradiated with a lethal dose of 9 Gy. Briefly, donor bone marrow (BM) was harvested in 2% PBS/FCS, filtered through a 70 μm cell strainer. Collected BM cells from the donor mice were washed in fresh 2% PBS/FCS and then re-suspended at final concentration of 4×108 cells/ml. At 24 h after irradiation, approximately 200 μl was injected into the recipient mice via the tail vein. Chimeric animals were allowed to recover for 9-10 weeks, followed by the LAD ligation. Donor vs. host composition in the infarcted myocardium was determined by the flow cytometry analysis in the infarcted myocardium after 7 days post MI.",
                        "Echocardiography: Transthoracic echocardiography was performed by using a VEVO-3100 and VEVO-770 (FUJIFILM VisualSonics Inc. Toronto, Canada) High-Frequency Ultrasound System (HFUS). Equipped with a 38 MHz (MZ400) linear array transducer, images were acquired at a frame rate consistently above 200 frames. Electrocardiogram (ECG) and breathing rate were monitored, body temperature was kept at 37° C. using a heating system within the handling platform. Depending on the experimental 464 protocol, mice were examined by longitudinal analysis (from 1 day up to 4 weeks post MI) to measure left ventricular (LV) end-diastolic volume (LVEDV), internal diameter in diastole and systole (LVID,d and LVID,s), posterior wall thickness in diastole (LVPW,d) and interventricular septum thickness in diastole (IVS,d) analyzed in the parasternal long axis (PLAX) by means of M-mode images, which are linked to 2D B-mode images. Post-acquisition analysis was performed with the VevoLab Software. LVID,d and LVID,s were applied to calculate LV end-diastolic volume (LVEDV) and LV ejection fraction (LVEF).",
                        "Flow cytometry analysis of immune cells isolated from heart: Infiltration of immune cells into the infarcted myocardium was analyzed by flow cytometry. Collected infarcted myocardium from the experimental animals was enzymatically digested by using collagenase II (1 mg/ml)/DNase I (50 μg/ml) for 30 min at 37° C. The lysates were passed through a 70 μm cell strainer and washed with 2% PBS/FCS. Cell staining: After washing, cells were pelleted by centrifugation for 5 min at 300×g at 4° C. and unspecific antibody binding was blocked by using FC blocking solution (anti-CD16/CD32). After blocking, single cells suspensions were stained with the following monoclonal antibodies: CD45 APC-eFluor 780 (eBioscience, clone 30-F11), CD45.1 APC-eFluor 780 (eBioscience, clone A20), CD45.2 FITC (eBioscience, clone 104), B220 FITC (eBioscience, clone RA3-6B2), CD11b FITC (BD Bioscience, clone M1/70) or PerCP-Cy5.5 (eBioscience, clone M1/70), CD90.2 SuperBright 645 (eBioscience, clone 53-2.1), NK1.1 PE-Cy7 (eBioscience, clone PH136), Ly6G PE (BD Bioscience, clone 1A8), Ly6C Pacific Blue (eBioscience, clone HK1.4), F4/80 APC (eBioscience, clone BM8), TF PE (R&D systems), Viability Dye efluor 506 (eBioscience). A maximum of one million events was acquired using the Attune™ NxT Flow Cytometer (Thermo Scientific, Germany). Living cells including CD45+/CD90.2−/CD220−/NK1.1−/CD11b+/Ly6G+ neutrophils, CD45+/CD90.2−/CD220−/NK1.1−/CD11b+/Ly6G−/F4/80−/Ly6Chigh inflammatory monocytes, CD45+/CD90.2−/CD220−/NK1.1−/CD11b+/Ly6G−/F4/80−/Ly6Cneg reparative monocytes and CD45+/CD90.2−/CD220−/NK1.1−/5 CD11b+/F4/80+ macrophages were analyzed by FlowJo software (FlowJo Version 10, BD, USA). To assess TF expression on the peripheral blood cells, circulating mononuclear cells were isolated from the whole blood and further analyzed for living CD45+/TF+ leukocytes and CD45+/TF+/CD11b+/CD115+/Ly6Chigh inflammatory monocytes after 7 d post MI.",
                        "DHE-HPLC: Mouse myocardial tissue collected from the experimental animals were cut into small pieces and incubated with 50 μmol/L of dihydroethidium (DHE) at 37° C. for 30 min. After incubation, hearts were dried from adhering DHE buffer and washed with PBS. Heart weights were determined and homogenized by using glass/glass homogenizer in 400 μl of PBS/acetonitrile (1:1) for extraction of DHE oxidation products. Samples were freed from denatured protein by centrifugation for 10 min at 20,000×rpm and supernatants were analyzed by high performance liquid chromatography (HPLC) 496 for superoxide (O2⋅-) specific oxidation product 2-hydroxyethidium. The system consisted of a control unit, two pumps, a mixer, detectors, a column oven, a degasser, an autosampler (AS-2057 plus) from Jasco (Gros-Umstadt, Germany), and a C18-Nucleosil 100-3 (125×4) column from Macherey & Nagel (Duren, Germany). A high pressure gradient was employed with acetonitrile/water (90/10 (v/v)/o) and 50 mM citrate buffer pH 2 as mobile phases with the following percentages of the organic solvent: 0 min, 41%; 7 min, 45%; 8-9 min, 100%; 10 min, 41%. The flow was 1 ml/min and DHE was detected by its absorption at 355 nm, whereas 2-hydroxyethidium and ethidium were detected by fluorescence (Ex. 480 nm/Em. 580 nm).",
                        "Monocytes isolation and in vitro culture: Bone marrow derived cell suspensions were isolated by flushing femurs and tibias of 8-12 weeks old mice. Cell aggregates were removed by gentle pipetting and the cell lysates were passed through a 70 μm nylon strainer to remove the cell debris. Furthermore, to enrich monocytes population, mouse monocyte isolation Kit (STEMCELL Technologies Inc., Vancouver, BC, Canada) was used according to standard protocols provided by the manufacturer. To mimic in vivo ischemic conditions, a protocol of oxygen-glucose-deprivation (OGD) is applied along with the cytokine cocktail mix (IL-6, TNF-α and MCP-1) at concentrations of 20 ng/ml for 4 hours followed by the protein expression analysis of pERK1/2, NOX2 and TGF-β1 on isolated monocytes. For experiments with ERK1/2 inhibition, primary mouse monocytes were briefly pretreated for one hour with trametinib (10 μM) followed by the OGD along with the cytokine cocktail mix. For blocking TF-FVIIa signaling on human monocytes, isolated monocytes from healthy individuals were treated with NAPc2 in the presence of OGD along with the cytokine cocktail mix followed by the protein expression analysis of pERK1/2, NOX2 and TGF-β1.",
                        "Confocal Microscopy: Cryo-sections of the myocardium (5-8 μm thickness) were fixed with 4% Paraformaldehyde (PFA) and permeabilized by 0.1-0.2% Triton X-100 for 10 mins. After blocking with 5% BSA, mouse myocardium was co-stained with the rabbit polyclonal antibody raised against a synthetic peptide containing phosphorylated Ser and Thr residues adjacent to the conserved Pro residue of cytoplasmic TF27, and anti-CD45 (ab10558, Abcam). To determine the pERK1/2+ cells, anti-pERK1/2 (#4370S, Cell signaling Technology) (14-9109-82, Thermo Fisher) co-stained for ant-CD31 (SC-18916, Santa Cruz), anti-CD45 (30-F11, BioLegend), anti-αSMA (A2547, Sigmaaldrich) and anti-cardiac troponin T (ab92546, Abcam) were used. In addition, anti-NOX2 (611414, BD Biosciences, Germany), anti-CD68 (ab955, Abcam) and TGF-β1, (NBP2-22114, Novus Biologicals) were used to monitor NOX2 and TGF-β1 localization. For monocytes isolated form the human peripheral blood, unspecific binding of antibodies was blocked with 1% BSA followed by primary antibody incubation with phospho-specific mouse anti-human TF antibody (4G6)27 and mouse anti-human TF antibody (10H10). 528 After overnight incubation, 529 sections were counterstained with the secondary antibodies donkey anti-rabbit IgG (ab150076, Abcam), goat anti-rat IgG (ab150160, Abcam) and goat anti-mouse IgG, (ab150116, Abcam) for 1 h and mounted in anti-fading mounting medium (P36962, Thermo Scientific) for confocal laser scanning. At least three individual images were acquired and fluorescence intensity of each sample was quantified by using FIJI/image J.",
                        "Western Blotting: Either isolated peripheral blood mononuclear cells (PBMCs), myocardium or monocytes were homogenized in lysis buffer (1% Triton X-100, 20 mM Tris pH 7.4-7.6, 150 mM NaCl, 50 mM NaF, 1 mM EDTA, 1 mM EGTA, 1 mM glycerolphosphatase, 1% SDS, 100 mM PMSF, and 0.1% protease phosphatase inhibitor cocktail) for 20 min on ice. Lysates were cleared by centrifuging at 11,000×g for 15 min at 4° C. Total protein concentration was estimated using Lowry Assay (DC Protein Assay, Biorad) and an equal protein amount in all samples was mixed in 6× Laemmli sample buffer, heated to 99° C. for 10 min, separated according to their molecular weight on a SDS PAGE gel (4-15%) and probed with respective primary antibodies, pERK1/2, (#4370S, Cell signaling Technology), ERK1/2 (#4695, Cell Signaling Technology), pP38 (#4511S, Cell Signaling Technology), p38 (#9219, Cell Signaling Technology), TGF-β1, (NBP2-22114, Novus Biologicals), pSMAD2, SMAD2, (#12747T, Cell Signaling Technology), p67phox (610912 BD Biosciences), NOX 2 (611414, BD Biosciences) and anti-alpha smooth muscle actin (ab7817, abcamR). For monocytes isolated from the patients enrolled in the MICAT study and human myocardial biopsies, phospho-specific mouse anti-human TF antibody (4G6) and mouse anti-human TF antibodies (10H10) were used. After overnight incubation with the primary antibodies, PVDF membranes were incubated with secondary antibodies for 2 h (goat anti-rabbit HRP (#7074, Cell Signaling Technology) and anti-mouse HRP (#7076, Cell signaling Technology) and developed using Fusion FX (PEQLAB Biotechnologie GmbH, Germany) ECL's Western blotting ECL (Thermo Scientific Technologies) chemiluminescent reagents. Relative densitometry was performed with appropriate software and the ratios were used for statistical analysis.",
                        "Quantitative RT-PCR: RNA from pulverized heart samples from the infarcted part of LAD-ligated mice or non-infarcted myocardium from SHAM-operated mice was extracted by guanidine isothiocyanate phenol chloroform extraction. Relative mRNA expression analysis of chemokines and cytokines were performed by quantitative real-time reverse-transcription polymerase chain reaction. 0.05 μg of total RNA was used for qRT-PCR examination with the QuantiTect™ Probe RT-PCR kit (Qiagen, Hilden, Germany). For cDNA synthesis, briefly 1 μg of RNA was used. The qPCR buffer in each well composed of 10 μl 2× master mix (Applied Biosystems, Foster city, CA, USA), 5 μl RNase, DNase, Protease-free purified water, 1 μl primer of the gene being investigated and 5 μl of the cDNA sample. TaqManR Gene Expression assays (Applied Biosystems, Foster City, CA, USA) for TATA-box binding protein (tbp; Mm00446973_m1), Ccr2 (Mm00438270_m1), 116 (Mm00446190_m1), Ccl2 (Mm00441242_m1), Tnf (Mm00443260 g1) were used. The relative mRNA expression level quantification was carried out according to the ΔΔCt method and normalized to the reference gene (TBP).",
                        "For human heart samples, IL-6, CCR2, and CCL2 specific primers were used. GAPDH was used for normalization of the data.",
                        "Statistical analysis: Statistical analysis was performed with GraphPadPrism software, version 8 (GraphPad Software Inc., La Jolla, CA., USA). The results are presented as mean±standard error of the mean (SEM). First, the Shapiro-Wilk and Kolmogorow-Smirnow normality tests were used to determine whether the data were normalized. In the case of a normal distribution, a t-test was used for the comparison of two experimental groups, and an ordinary one-way analysis of variance (ANOVA) followed by a Sidak's multiple comparison test was performed in more than two experimental groups. The two-way ANOVA with Bonferroni Post-Hoc-Test was used for more than two test groups and more than one measurement time. In the absence of a normal distribution, two test groups were evaluated by a Mann-Whitney test. For more than two experimental groups, a Kruskal-Wallis test was performed, followed by Dunn's test for multiple comparisons. Asterisks were used as follows: *, p<0.05; **, p<0.01; ***, p<0.001."
                    ],
                    "subsections": [
                        {
                            "title": "Non-Patent Literature",
                            "paragraphs": [
                                "- 1. Laurens N, Koolwijk P and de Maat M P. Fibrin structure and wound\n  healing. *J Thromb Haemost.* 588 2006; 4:932-9.\n- 2. Silvain J, Collet J-P, Nagaswami C, Beygui F, Edmondson K E,\n  Bellemain-Appaix A, Cayla G, Pena A, 590 Brugier D, Barthelemy O,\n  Montalescot G and Weisel J W. Composition of coronary thrombus in\n  acute myocardial infarction. *Journal of the American College of\n  Cardiology.* 2011; 57:1359-1367.\n- 3. Prabhu S D and Frangogiannis N G. The Biological Basis for Cardiac\n  Repair After Myocardial Infarction: From Inflammation to Fibrosis.\n  *Circ Res.* 2016; 119:91-112.\n- 4. Swirski F K and Nahrendorf M. Cardioimmunology: the immune system\n  in cardiac homeostasis and disease. *Nature Reviews Immunology.* 2018;\n  18:733-744.\n- 5. Ott I, Andrassy M, Zieglgänsberger D, Geith S, Schömig A and\n  Neumann F-J. Regulation of monocyte procoagulant activity in acute\n  myocardial infarction: role of tissue factor and tissue factor pathway\n  inhibitor-1*. Blood.* 2001; 97:3721-3726.\n- 6. Engelmann B and Massberg S. Thrombosis as an intravascular effector\n  of innate immunity. 600 *Nature Reviews Immunology.* 2013; 13:34-45.\n- 7. Broze Jr G J, Leykam J E, Schwartz B D, Miletich J P. Purification\n  of human brain tissue factor. J Biol Chem 1985; 260: 10917-20.\n- 8. Paborsky L R, Caras J W, Fisher K L, Gorman C M. Lipid association,\n  but not the transmembrane domain, is required for tissue factor\n  activity. Substitution of the transmembrane domain with a\n  phosphatidylinositol anchor. J Biol Chem 1991; 266: 21911-6.\n- 9. Nemerson V, Repke D. Tissue factor accelerates the activation of\n  coagulation factor VII: the role of a high functional coagulation\n  cofactor. Thromb Res 1985; 40: 351-8.\n- 10. Rao L V, Rapaport S I. Activation of factor VII bound to tissue\n  factor: a key early step in the tissue factor pathway of blood\n  coagulation. Proc Natl Acad Sci USA 1988; 85: 6687-91.\n- 11. Sandset P M, Abildgaard U. Extrinsic pathway inhibitor—the key to\n  feedback control of blood coagulation initiated by tissue\n  thromboplastin. Haemostasis 1991; 21: 219-39.\n- 12. Toschi V, Gallo R, Lettino M, et al. Tissue factor modulates the\n  thrombogenicity of human atherosclerotic plaques. Circulation 1997;\n  95: 594-9.\n- 13. Eikelboom J W, Connolly S J, Bosch J, Dagenais G R, Hart R G,\n  Shestakovska O, Diaz R, Alings M, Lonn E M, Anand S S, Widimsky P,\n  Hori M, Avezum A, Piegas L S, Branch KRH, Probstfield J, Bhatt D L,\n  Zhu J, Liang Y, Maggioni A P, Lopez-Jaramillo P, O'Donnell M, Kakkar A\n  K, Fox K A A, Parkhomenko A N, Ertl G, Stork S, Keltai M, Ryden L,\n  Pogosova N, Dans A L, Lanas F, Commerford P J, Torp-Pedersen C, Guzik\n  T J, Verhamme P B, Vinereanu D, Kim J-H, Tonkin A M, Lewis B S, Felix\n  C, Yusoff K, Steg P G, Metsarinne K P, Cook Bruns N, Misselwitz F,\n  Chen E, Leong D and Yusuf S. Rivaroxaban with or without Aspirin in\n  Stable Cardiovascular Disease. *New England Journal of Medicine.*\n  2017; 377:1319-1330.\n- 14. Husted S E, Ziegler B K and Kher A. Long-term anticoagulant\n  therapy in patients with coronary artery disease. *European Heart\n  Journal.* 2006; 27:913-919.\n- 15. Bergum P W, Cruikshank A, Maki S L, Kelly C R, Ruf W and Vlasuk\n  G P. Role of zymogen and activated factor X as scaffolds for the\n  inhibition of the blood coagulation factor Vila-tissue factor complex\n  by recombinant nematode anticoagulant protein c2*. J Biol Chem.* 2001;\n  276:10063-71.\n- 16. Giugliano R P, Wiviott S D, Stone P H, Simon D I, Schweiger M J,\n  Bouchard A, Leesar M A, Goulder M A, Deitcher S R, McCabe C H and\n  Braunwald E. Recombinant nematode anticoagulant protein c2 in patients\n  with non-S T-segment elevation acute coronary syndrome: the\n  ANTHEM-TIMI-32 trial. *J Am Coll Cardiol.* 2007; 49:2398-407.\n- 17. Erlich J H, Boyle E M, Labriola J, Kovacich J C, Santucci R A,\n  Fearns C, Morgan E N, Yun W, Luther T, Kojikawa O, Martin T R, Pohlman\n  T H, Verrier E D and Mackman N. Inhibition of the tissue\n  factor-thrombin pathway limits infarct size after myocardial\n  ischemia-reperfusion injury by reducing inflammation. *Am J Pathol.*\n  2000; 157:1849-62.\n- 18. Deten A, Holzl A, Leicht M, Barth W and Zimmer H G. Changes in\n  extracellular matrix and in transforming growth factor beta isoforms\n  after coronary artery ligation in rats. *J Mol Cell Cardiol.* 2001;\n  33:1191-207.\n- 19. Frangogiannis N G. The role of transforming growth factor (TGF)-β\n  in the infarcted myocardium. *J Thorac Dis.* 2017; 9:552-s63.\n- 20. Gur-Cohen S, ltkin T, Chakrabarty S, Graf C, Kollet O, Ludin A,\n  Golan K, Kalinkovich A, Ledergor G, Wong E, Niemeyer E, Porat Z, Erez\n  A, Sagi I, Esmon C T, Ruf W and Lapidot T. PAR1 signaling regulates\n  the retention and recruitment of EPCR-expressing bone marrow\n  hematopoietic stem cells. *Nat Med.* 2015; 21:1307-17.\n- 21. Graf C, Wilgenbus P, Pagel S, Pott J, Marini F, Reyda S, Kitano M,\n  Macher-Goppinger S, Weiler H and Ruf W. Myeloid cell-synthesized\n  coagulation factor X dampens antitumor immunity. *Sci Immunol.* 2019;\n  4.\n- 22. Friebel J, Weithauser A, Witkowski M, Rauch B H, Savvatis K,\n  Dorner A, Tabaraie T, Kasner M, Moos V, Bosel D, Gotthardt M, Radke M\n  H, Wegner M, Bobbert P, Lassner D, Tschope C, Schutheiss H-P, Felix S\n  B, Landmesser U and Rauch U. Protease-activated receptor 2 deficiency\n  mediates cardiac fibrosis and diastolic dysfunction. European *Heart\n  Journal.* 2019; 40:3318-3332.\n- 23. Kolpakov M A, Rafiq K, Guo X, Hooshdaran B, Wang T, Vlasenko L,\n  Bashkirova 633 Y V, Zhang X, Chen X, Iftikhar S, Libonati J R,\n  Kunapuli S P and Sabri A. Protease-activated receptor 4 deficiency\n  offers cardioprotection after acute ischemia reperfusion injury. *J\n  Mol Cell Cardiol.* 2016; 90:21-9.\n- 24. Koivula K, Nikus K, Viikila J, Lilleberg J, Huhtala H, Birnbaum Y\n  and Eskola M. Comparison of the prognostic role of Q waves and\n  inverted T waves in the presenting ECG of STEMI patients. *Ann\n  Noninvasive Electrocardiol.* 2019; 24:e12585.\n- 25. Cerrato E, Forno D, Ferro S and Chinaglia A. Characteristics,\n  in-hospital management and outcome of late acute S T-elevation\n  myocardial infarction presenters. *Journal of cardiovascular\n  medicine.* 2017; 18:567-571.\n- 26. Petersen L C, Sprecher C A, Foster D C, Blumberg H, Hamamoto T,\n  Kisiel W. Inhibitory properties of a novel human Kunitz-type protease\n  inhibitor homologous to tissue factor pathway inhibitor. Biochemistry\n  1996; 35: 266-72.\n- 27. Lee A, Agnelli G, Buller H, et al. Dose-response study of\n  recombinant factor VIIa/tissue factor inhibitor recombinant nematode\n  anticoagulant protein c2 in the prevention of post-operative venous\n  thromboembolism in patients undergoing total knee replacement.\n  Circulation 2000; 104: 74-78.\n- 28. Nahrendorf M, Pittet M J and Swirski F K. Monocytes: protagonists\n  of infarct inflammation and repair after myocardial infarction.\n  *Circulation.* 2010; 121:2437-45.\n- 29. Xu X, Zheng L, Yuan Q, Zhen G, Crane J L, Zhou X and Cao X.\n  Transforming growth factor-β in stem cells and tissue homeostasis.\n  *Bone Res.* 2018; 6:2.\n- 30. Bujak M and Frangogiannis N G. The role of TGF-beta signaling in\n  681 myocardial infarction and cardiac remodeling. *Cardiovascular\n  research.* 2007; 74:184-195.\n- 31. Brophy T M, Cotler B S and Ahamed J. Identification of the thiol\n  isomerase-binding peptide, mastoparan, as a novel inhibitor of\n  shear-induced transforming growth factor β1 (TGF-β1) activation. *J\n  Biol Chem.* 2013; 288:10628-39.\n- 32. Reinhardt C, von Bruhl M L, Manukyan D, Grahl L, Lorenz M, Altmann\n  B, Dlugai S, Hess S, Konrad I, Orschiedt L, Mackman N, Ruddock L,\n  Massberg S and Engelmann B. Protein disulfide isomerase acts as an\n  injury response signal that enhances fibrin generation via tissue\n  factor activation. *J Clin Invest.* 2008; 118:1110-22.\n- 33. Ahamed J, Versteeg H H, Kerver M, Chen V M, Mueller B M, Hogg P J\n  and Ruf W. Disulfide isomerization switches tissue factor from\n  coagulation to cell signaling. *Proc Natl Acad Sci USA.* 2006;\n  103:13932-7.\n- 34. Subramaniam S, Jurk K, Hobohm L, Jackel S, Saffarzadeh M,\n  Schwierczek K, Wenzel P, Langer F, Reinhardt C and Ruf W. Distinct\n  contributions of complement factors to platelet activation and fibrin\n  formation in venous thrombus development. *Blood.* 2017;\n  129:2291-2302.\n- 35. Langer F, Spath B, Fischer C, Stolz M, Ayuk F A, Kroger N,\n  Bokemeyer C and Ruf W. Rapid activation of monocyte tissue factor by\n  antithymocyte globulin is dependent on complement and protein\n  disulfide isomerase. Blood. 2013; 121:2324-35.\n- 36. Versteeg H H, Schaffner F, Kerver M, Petersen H H, Ahamed J,\n  Felding-Habermann B, Takada Y, Mueller B M and Ruf W. Inhibition of\n  tissue factor signaling suppresses tumor growth. *Blood.* 2008;\n  111:190-9.\n- 37. Muller-Calleja N, Hollerbach A, Ritter S, Pedrosa D G, Strand D,\n  Graf C, Reinhardt C, Strand S, Poncelet P, Griffin J H, Lackner K J\n  and Ruf W. Tissue factor pathway inhibitor primes monocytes for\n  antiphospholipid antibody-induced thrombosis. *Blood.* 2019;\n  134:1119-1131.\n- 38. Grieve D J, Byrne J A, Cave A C and Shah A M. Role of Oxidative\n  Stress in Cardiac Remodelling after Myocardial Infarction. *Heart,\n  Lung and Circulation.* 2004; 13:132-138.\n- 39. Cerrato E, Forno D, Ferro S and Chinaglia A. Characteristics,\n  in-hospital management and 705 outcome of late acute S T-elevation\n  myocardial infarction presenters. *J Cardiovasc Med* (Hagerstown).\n- 706 2017; 18:567-571.\n- 40. Freund A, Schock S, Stiermaier T, de Waha-Thiele S, Eitel I, Lurz\n  P, Thiele H and Desch S. Thrombus aspiration in patients with S\n  T-elevation myocardial infarction presenting late after symptom onset:\n  long-term clinical outcome of a randomized trial. Clin Res Cardiol.\n  2019; 108:1208-1214.\n- 41. Niccoli G, Burzotta F, Galiuto L and Crea F. Myocardial no-reflow\n  in humans. *J Am Coll Cardiol.* 2009; 54:281-92.\n- 42. Koivula K, Nikus K, Viikila J, Lilleberg J, Huhtala H, Birnbaum Y\n  and Eskola M. Comparison of the prognostic role of Q waves and\n  inverted T waves in the presenting ECG of STEMI patients. *Ann\n  Noninvasive Electrocardiol.* 2019; 24:e12585.\n- 43. Ott I, Weigand B, Michl R, Seitz I, Sabbari-Erfani N, Neumann F-J\n  and Schomig A. Tissue Factor Cytoplasmic Domain Stimulates Migration\n  by Activation of the GTPase Rac1 and the Mitogen-Activated Protein\n  Kinase p38*. Circulation.* 2005; 111:349-355.\n- 44. Rothmeier A S, Liu E, Chakrabarty S, Disse J, Mueller B M,\n  Ostergaard H and Ruf W. Identification of the integrin-binding site on\n  coagulation factor VIIa required for proangiogenic PAR2 signaling.\n  *Blood.* 2018; 131:674-685.\n- 45. Liu R-M and Desai L P. Reciprocal regulation of TGF-β and reactive\n  oxygen species: A perverse cycle for fibrosis. *Redox Biology.* 2015;\n  6:565-577.\n- 46. Looi Y H, Grieve D J, Siva A, Walker S J, Anilkumar N, Cave A C,\n  Marber M, Monaghan M J and Shah A M. Involvement of Nox2 NADPH oxidase\n  in adverse cardiac remodeling after myocardial infarction.\n  *Hypertension.* 2008; 51:319-25.\n- 47. Ikeuchi M, Tsutsui H, Shiomi T, Matsusaka H, Matsushima S, Wen J,\n  Kubota T and Takeshita A. Inhibition of TGF-β signaling exacerbates\n  early cardiac dysfunction but prevents late remodeling after\n  infarction. *Cardiovascular Research.* 2004; 64:526-535.\n- 48. Ryden L, Grabau D, Schaffner F, Jonsson P-E, Ruf W and Belting M.\n  Evidence for tissue factor phosphorylation and its correlation with\n  protease-activated receptor expression and the prognosis of primary\n  breast cancer. *Int J Cancer.* 2010; 126:2330-2340.\n- 49. Thygesen K, Alpert J S, Jaffe A S, Chaitman B R, Bax J J, Morrow D\n  A and White H D. Fourth universal definition of myocardial infarction\n  (2018). *Eur Heart J.* 2019; 40:237-269.\n- 50. Wiśniewski J R, Zougman A, Nagaraj N and Mann M. Universal sample\n  preparation method for proteome analysis. *Nature Methods.* 2009;\n  6:359-362.\n- 51. Distler U, Kuharev J, Navarro P and Tenzer S. Label-free\n  quantification in ion mobility-enhanced data-independent acquisition\n  proteomics. *Nat Protoc.* 2016; 11:795-812.\n- 52. Hahne H, Pachl F, Ruprecht B, Maier S K, Klaeger S, Helm D, Medard\n  G, Wilm M, Lemeer S and Kuster B. DMSO enhances electrospray response,\n  boosting sensitivity of proteomic experiments. *Nat Methods.* 2013;\n  10:989-91.\n- 53. Distler U, Kuharev J, Navarro P, Levin Y, Schild H and Tenzer S.\n  Drift time-specific collision energies enable deep-coverage\n  data-independent acquisition proteomics. *Nat Methods.* 2014;\n  11:167-70.\n- 54. Silva J C, Gorenstein M V, Li G Z, Vissers J P and Geromanos S J.\n  Absolute quantification of proteins by LCMSE: a virtue of parallel M S\n  acquisition. *Mol Cell Proteomics.* 2006; 5:144-56.\n- 50 55. Cox J, Neuhauser N, Michalski A, Scheltema R A, Olsen J V and\n  728 Mann M. *Andromeda*: A Peptide Search Engine Integrated into the\n  MaxQuant Environment. *Journal of Proteome Research.* 2011;\n  10:1794-1805.\n- 56. Shannon P, Markiel A, Ozier O, Baliga N S, Wang J T, Ramage D,\n  Amin N, Schwikowski B and Ideker T. Cytoscape: a software environment\n  for integrated models of biomolecular interaction networks. *Genome\n  Res.* 2003; 13:2498-504.\n- 57. Doncheva N T, Morris J H, Gorodkin J and Jensen L J. Cytoscape\n  StringApp: Network Analysis and Visualization of Proteomics Data. *J\n  Proteome Res.* 2019; 18:623-632.\n- 58. Assenov Y, Ramirez F, Schelhorn S E, Lengauer T and Albrecht M.\n  Computing topological parameters of biological networks.\n  *Bioinformatics.* 2008; 24:282-4.\n- 59. Bindea G, Mlecnik B, Hackl H, Charoentong P, Tosolini M,\n  Kirilovsky A, Fridman W H, Pages F, Trajanoski Z and Galon J. ClueGO:\n  a Cytoscape plug-in to decipher functionally grouped gene ontology and\n  pathway annotation networks. *Bioinformatics.* 2009; 25:1091-3.\n- 60. Finger S, Knorr M, Molitor M, Schuler R, Garlapati V, Waisman A,\n  Brandt M, Munzel T, Bopp T, Kossmann S, Karbach S and Wenzel P. A\n  sequential interferon gamma directed chemotactic cellular immune\n  response determines survival and cardiac function post-myocardial\n  infarction. *Cardiovascular Research.* 2019; 115:1907-1917."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce fibrin structure and wound healing",
                                "describe composition of coronary thrombus in acute myocardial infarction",
                                "discuss biological basis for cardiac repair after myocardial infarction",
                                "summarize cardioimmunology and immune system in cardiac homeostasis and disease",
                                "regulate monocyte procoagulant activity in acute myocardial infarction",
                                "describe thrombosis as an intravascular effector of innate immunity",
                                "purify human brain tissue factor",
                                "study lipid association and tissue factor activity",
                                "accelerate activation of coagulation factor VII",
                                "activate factor VII bound to tissue factor",
                                "introduce extrinsic pathway inhibitor",
                                "modulate thrombogenicity of human atherosclerotic plaques",
                                "study rivaroxaban with or without aspirin in stable cardiovascular disease",
                                "discuss long-term anticoagulant therapy in patients with coronary artery disease",
                                "inhibit blood coagulation factor VIIa-tissue factor complex",
                                "study recombinant nematode anticoagulant protein c2 in patients with non-ST-segment elevation acute coronary syndrome",
                                "limit infarct size after myocardial ischemia-reperfusion injury",
                                "study changes in extracellular matrix and transforming growth factor beta isoforms",
                                "discuss role of transforming growth factor beta in infarcted myocardium",
                                "regulate retention and recruitment of EPCR-expressing bone marrow hematopoietic stem cells",
                                "study myeloid cell-synthesized coagulation factor X",
                                "discuss protease-activated receptor 2 deficiency",
                                "study protease-activated receptor 4 deficiency",
                                "compare prognostic role of Q waves and inverted T waves in STEMI patients",
                                "study characteristics, in-hospital management, and outcome of late acute ST-elevation myocardial infarction presenters",
                                "study inhibitory properties of human Kunitz-type protease inhibitor",
                                "study dose-response of recombinant factor VIIa/tissue factor inhibitor",
                                "discuss monocytes as protagonists of infarct inflammation and repair after myocardial infarction"
                            ],
                            "num_characters": 14162,
                            "outline_medium": [
                                "list non-patent literature references",
                                "describe fibrin structure and wound healing",
                                "analyze composition of coronary thrombus in acute myocardial infarction",
                                "discuss biological basis for cardiac repair after myocardial infarction",
                                "review cardioimmunology and immune system in cardiac homeostasis and disease",
                                "regulate monocyte procoagulant activity in acute myocardial infarction",
                                "describe thrombosis as an intravascular effector of innate immunity",
                                "purify human brain tissue factor",
                                "analyze lipid association and transmembrane domain of tissue factor",
                                "describe activation of factor VII bound to tissue factor",
                                "discuss extrinsic pathway inhibitor and feedback control of blood coagulation",
                                "modulate thrombogenicity of human atherosclerotic plaques",
                                "review long-term anticoagulant therapy in patients with coronary artery disease",
                                "describe role of zymogen and activated factor X in inhibition of blood coagulation factor VIIa-tissue factor complex"
                            ],
                            "outline_short": [
                                "list non-patent literature references",
                                "describe fibrin structure and wound healing",
                                "discuss composition of coronary thrombus in acute myocardial infarction",
                                "summarize biological basis for cardiac repair after myocardial infarction",
                                "review cardioimmunology and immune system in cardiac homeostasis and disease",
                                "describe regulation of monocyte procoagulant activity in acute myocardial infarction",
                                "discuss various aspects of blood coagulation, thrombosis, and cardiac disease"
                            ]
                        }
                    ],
                    "outline_long": [
                        "enroll patients in MICAT study",
                        "define subacute MI patients",
                        "obtain written informed consent",
                        "document medical history",
                        "isolate monocytes from peripheral blood",
                        "homogenize monocytes for western blot analysis",
                        "plate and fix cells for confocal imaging",
                        "obtain human heart samples",
                        "divide heart samples into pieces",
                        "store heart samples at -80°C",
                        "analyze protein by western blotting",
                        "quantify RNA",
                        "perform cryo-sectioning",
                        "prepare heart tissue biopsy samples",
                        "lyse heart tissue for proteomic profiling",
                        "determine protein concentration",
                        "perform filter-aided sample preparation",
                        "perform in-solution digest",
                        "enrich phosphopeptides",
                        "analyze peptides by LC-MS",
                        "perform phosphopeptide analysis",
                        "desalt and lyophilize phosphopeptides",
                        "reconstitute phosphopeptides for LC-MS analysis",
                        "measure samples in triplicates",
                        "perform mass-to-charge analysis",
                        "analyze data using Proteome Discoverer",
                        "validate search results using Percolator algorithm",
                        "perform label-free quantification",
                        "analyze data using R and tidyverse package",
                        "generate protein-protein-interaction networks",
                        "describe echocardiography",
                        "detail electrocardiogram and breathing rate monitoring",
                        "explain body temperature control",
                        "outline longitudinal analysis of left ventricular parameters",
                        "describe post-acquisition analysis using VevoLab Software",
                        "detail flow cytometry analysis of immune cells",
                        "explain cell staining and blocking",
                        "describe antibody staining and flow cytometry analysis",
                        "detail DHE-HPLC analysis of superoxide oxidation products",
                        "describe monocyte isolation and in vitro culture",
                        "outline oxygen-glucose-deprivation protocol",
                        "explain protein expression analysis of pERK1/2, NOX2, and TGF-β1",
                        "describe confocal microscopy analysis of myocardium",
                        "detail antibody staining and confocal microscopy analysis",
                        "explain Western blotting analysis of protein expression",
                        "describe protein extraction and Western blotting protocol",
                        "outline primary and secondary antibody incubation",
                        "explain quantitative RT-PCR analysis of mRNA expression",
                        "detail RNA extraction and cDNA synthesis",
                        "describe qRT-PCR protocol and gene expression analysis",
                        "outline statistical analysis using GraphPadPrism software",
                        "explain data presentation and significance testing"
                    ],
                    "num_characters": 26555,
                    "outline_medium": [
                        "enroll patients in MICAT study",
                        "define subacute MI patients",
                        "obtain written informed consent",
                        "isolate monocytes from peripheral blood",
                        "prepare human heart samples",
                        "perform proteomic profiling of human hearts",
                        "prepare protein samples for MS analysis",
                        "perform phosphopeptide analysis",
                        "analyze MS data",
                        "perform label-free quantification analysis",
                        "describe animal models used",
                        "induce experimental myocardial infarction in mice",
                        "treat mice with trametinib or NAPC2",
                        "perform bone marrow transplantation",
                        "analyze donor vs. host composition in infarcted myocardium",
                        "describe echocardiography",
                        "describe flow cytometry analysis",
                        "describe DHE-HPLC",
                        "describe monocytes isolation and in vitro culture",
                        "describe confocal microscopy",
                        "describe western blotting",
                        "describe quantitative RT-PCR",
                        "describe statistical analysis",
                        "detail echocardiography protocol",
                        "detail flow cytometry protocol",
                        "detail western blotting protocol"
                    ],
                    "outline_short": [
                        "enroll patients in MICAT study",
                        "isolate monocytes from peripheral blood",
                        "prepare human heart samples for analysis",
                        "perform proteomic profiling of human hearts",
                        "analyze phosphopeptides",
                        "describe animal models and treatments",
                        "outline bone marrow transplantation procedure",
                        "describe echocardiography",
                        "describe flow cytometry analysis",
                        "describe DHE-HPLC",
                        "describe monocytes isolation and in vitro culture",
                        "describe confocal microscopy, western blotting, quantitative RT-PCR, and statistical analysis"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An inhibitor of the Tissue Factor-Protease Activated Receptor 2 (TF-PAR2) signaling pathway for use in the treatment or prevention of heart failure (HF).",
        "2. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the heart failure (HF) is associated with or synonymous with ischemic heart failure (IHF), myocardial infarction (MI), IHF resulting from acute and/or ongoing MI, heart failure with reduced ejection fraction (HFrEF), or heart failure with preserved ejection fraction (HFpEF).",
        "3. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the TF-PAR2 signaling pathway is characterized by (i) a hyper-activation of mitogen-activated protein kinase 1 (MAPK1), (ii) an extracellular-signal-regulated kinase 1/2 (ERK1/2) phosphorylation and (iii) TGF-β1 activation.",
        "4. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor of the TF-PAR2 signaling pathway is a chemical or biological compound that is associated with reduced ERK1/2 phosphorylation, decreased TGF-β1 activation and reduced cardiac or myelomonocytic cell NOX2 expression.",
        "5. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of the recruitment of NOX2-positive mycloid cells, preferably an inhibitor of NOX-2-positive monocytes.",
        "6. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of TGF-β1 activation.",
        "7. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor is a TF/FVIIa inhibitor.",
        "8. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 7, wherein the TF/FVIIa inhibitor is selected from the group consisting of anti-TF antibodies, small molecules, TF Pathway Inhibitor (TFPI), human recombinant FVIIa inhibitor (rFVIIai), chimeric protein XK1, PAR2 antagonists.",
        "9. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 8, wherein the antibody is selected from AP-1, ALT836, tisotumab, ICON-2.",
        "10. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor of the TF-PAR2signaling pathway is nematode anticoagulant protein c2 (NAPc2).",
        "11. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 10, wherein the NAPc2 is a modified NAPc2 or recombinant NAPc2 variant.",
        "12. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 11, wherein the NAPc2 variant is NAPc2/proline comprising the amino acid sequence of SEQ ID NO:2, or mutants or homologs thereof.",
        "13. The inhibitor of the TF-PAR2 signaling pathway for the use according to claim 1, wherein the inhibitor of the TF-PAR2 signaling pathway is an oligonucleotide inhibitor selected from antisense-oligonucleotide, siRNA, shRNA, antisense oligonucleotide targeting a mRNA, non-coding RNA (ncRNA), miRNA and long non-coding RNA (lncRNA); or a protein or nucleic acid aptamer.",
        "14. A pharmaceutical composition, comprising an inhibitor of the Tissue Factor-Protease Activated Receptor 2 (TF-PAR2) signaling pathway and a pharmaceutically acceptable carrier, diluent, adjuvant or excipient, for use in the treatment or prevention of heart failure (HF).",
        "15. The pharmaceutical composition according to claim 14, wherein the heart failure (HF) is associated with or synonymous with ischemic heart failure (IHF), myocardial infarction (MI), IHF resulting from acute and/or ongoing MI, heart failure with reduced ejection fraction (HFrEF), or heart failure with preserved ejection fraction (HFpEF).",
        "16. The pharmaceutical composition according to claim 14, wherein the TF-PAR2 signaling pathway is characterized by (i) a hyper-activation of mitogen-activated protein kinase 1 (MAPK1), (ii) an extracellular-signal-regulated kinase 1/2 (ERK1/2) phosphorylation and (iii) TGF-β1 activation.",
        "17. The pharmaceutical composition according to claim 14, wherein the inhibitor of the TF-PAR2 signaling pathway is a chemical or biological compound that is associated with reduced ERK1/2 phosphorylation, decreased TGF-β1 activation and reduced cardiac or myelomonocytic cell NOX2 expression.",
        "18. The pharmaceutical composition according to claim 14, wherein the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of the recruitment of NOX2-positive myeloid cells, preferably an inhibitor of NOX-2-positive monocytes.",
        "19. The pharmaceutical composition according to claim 14, wherein the inhibitor of the TF-PAR2 signaling pathway is an inhibitor of TGF-β activation.",
        "20. The pharmaceutical composition according to claim 14, wherein the inhibitor is a TF/FVIIa inhibitor.",
        "21. The pharmaceutical composition according to claim 20, wherein the TF/FVIIa inhibitor is selected from the group consisting of anti-TF antibodies, small molecules, TF Pathway Inhibitor (TFPI), human recombinant FVIIa inhibitor (rFVIIai), chimeric protein XK1, PAR2 antagonists.",
        "22. The pharmaceutical composition according to claim 21, wherein the antibody is selected from AP-1, ALT836, tisotumab, ICON-2.",
        "23. The pharmaceutical composition according to claim 14, wherein the inhibitor of the TF-PAR2 signaling pathway is nematode anticoagulant protein c2 (NAPc2).",
        "24. The pharmaceutical composition according to claim 14, wherein the NAPc2 is a modified NAPc2 or recombinant NAPc2 variant.",
        "25. The pharmaceutical composition according to claim 24, wherein the NAPc2 variant is NAPc2/proline comprising the amino acid sequence of SEQ ID NO:2, or mutants or homologs thereof.",
        "26. The pharmaceutical composition according to claim 14, wherein the inhibitor of the TF-PAR2 signaling pathway is an oligonucleotide inhibitor selected from antisense-oligonucleotide, siRNA, shRNA, antisense oligonucleotide targeting a mRNA, non-coding RNA (ncRNA), miRNA and long non-coding RNA (lncRNA); or a protein or nucleic acid aptamer.",
        "27. A method for identifying a subject at risk for developing ischemic heart failure (IHF) or adverse remodeling following myocardial infarction (MI), comprising the steps of\ni. determining the tissue factor (TF) cytoplasmic domain phosphorylation in myeloid cells and the levels of active TGF-β1 in a biological sample collected from said subject,\nii. comparing the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in said biological sample with the level of phosphorylation of the TF cytoplasmic domain and the level of active TGF-β1 in a normal, healthy subject,\n\nwherein increased levels of phosphorylation of the TF cytoplasmic domain and active TGF-β1 are indicative for an increased risk of developing IHF or adverse remodeling following MI.",
        "28. The method according to claim 27, wherein the method further comprises a Western blot or enzyme linked immunosorbent assay (ELISA) analysis of monocytic protein expression for TF cytoplasmic domain phosphorylation (406) and TF (10H10).",
        "29. The method according to claim 27, wherein the method further comprises determining within said biological sample whether\ni. there is an up-regulation of L6, CCL2 and/or CCR2, and/or\nii. a myeloid cell recruitment, and/or\niii. increased TGF-β1 activation, and/or\niv. downstream phosphorylation of SMAD2.",
        "30. The method according to claim 27, wherein the biological sample of the subject is obtained from a heart biopsy, liquid biopsy, blood, serum, or plasma.",
        "31. The method according to claim 27, wherein the method is carried out ex-vivo or in-vitro."
    ]
}