{
    "id": "https://semopenalex.org/work/W2058601364",
    "authors": [
        "P Czernichow",
        "Latif Rachdi",
        "Raphaël Scharfmann",
        "Matthias Lohmann",
        "Philippe Ravassard",
        "Fanny Guez",
        "Manon von Bülow",
        "Emilie Bricout-Neveu",
        "Séverine Pechberty",
        "Yasmine Hazhouz",
        "Maud Grenier-Godard"
    ],
    "title": "Development of a conditionally immortalized human pancreatic β cell line",
    "date": "2014-03-25",
    "abstract": "Diabetic patients exhibit a reduction in β cells, which secrete insulin to help regulate glucose homeostasis; however, little is known about the factors that regulate proliferation of these cells in human pancreas. Access to primary human β cells is limited and a challenge for both functional studies and drug discovery progress. We previously reported the generation of a human β cell line (EndoC-βH1) that was generated from human fetal pancreas by targeted oncogenesis followed by in vivo cell differentiation in mice. EndoC-βH1 cells display many functional properties of adult β cells, including expression of β cell markers and insulin secretion following glucose stimulation; however, unlike primary β cells, EndoC-βH1 cells continuously proliferate. Here, we devised a strategy to generate conditionally immortalized human β cell lines based on Cre-mediated excision of the immortalizing transgenes. The resulting cell line (EndoC-βH2) could be massively amplified in vitro. After expansion, transgenes were efficiently excised upon Cre expression, leading to an arrest of cell proliferation and pronounced enhancement of β cell–specific features such as insulin expression, content, and secretion. Our data indicate that excised EndoC-βH2 cells are highly representative of human β cells and should be a valuable tool for further analysis of human β cells.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Insulin-producing pancreatic β cells play a central role in glycemic regulation. Such β cells are destroyed in patients with type 1 diabetes, while in type 2 diabetes patients, functional β cell mass decreases and to a certain point fails to produce enough insulin to insure adequate blood glucose control. In this context, dissecting the mechanisms that control the size of the human β cell pool represents a major challenge.",
                "During the past years, significant progress appeared on mechanisms that regulate β cell mass in the adult pancreas. In adult mice, while β cells develop from rare adult pancreatic progenitors following partial pancreatic duct ligation, it is now accepted that during adulthood under normal or regenerative conditions, the majority of the newly formed β cells are generated by β cell duplication (1). The demonstration of the importance of rodent β cell proliferation as the main regulator of β cell mass (2) was paralleled by a large amount of data that dissected signals and pathways that control rodent β cell proliferation (3). In this context, betatrophin was recently characterized as a new hormone that efficiently controls mouse β cell proliferation (4). Thus, β cell proliferation represents an important parameter in β cell mass regulation in mice.",
                "In humans, little is known about control of β cell mass in the adult pancreas. However, human β cell proliferation is rare in the adult pancreas (5) and human β cell turnover is extremely low, as determined by in vivo thymidine analog incorporation, radiocarbon dating, and mathematical modeling of lipofuscin accumulation (6,7). Moreover, when compared with what occurs in mice, very few signals are described as activating human β cell proliferation (8). Finally, human β cells seem refractory to forced cell expansion, and this point remains unexplained (9). This lack of knowledge is at least in part due to limited access to purified human β cells in sufficient quantities.",
                "Recently, by targeted oncogenesis, we generated a human pancreatic β cell line, EndoC-βH1 (10,11). Human fetal pancreases were transduced with lentiviral vectors expressing the large T antigen of simian virus 40 (SV40 LT) and human telomerase reverse transcriptase (hTERT) and were transplanted into SCID mice to allow pancreatic differentiation (11). Importantly, the immortalizing transgenes were under the control of the rat insulin 2 promoter. Thus, the human β cells that developed in SCID mice during tissue differentiation expressed the transgenes leading to the development of insulinomas that were further amplified in culture to generate cell lines such as EndoC-βH1 (10). EndoC-βH1 cells expressed insulin and numerous β cell-specific markers and secreted insulin upon glucose and secretagogue stimulation. Collectively, the phenotype and function of EndoC-βH1 cells are close to that of primary adult human β cells with one major difference. Indeed, as described above, human adult β cells proliferate extremely poorly, while EndoC-βH1 cells are continuously expanding.",
                "Here, we generated a human β cell line, EndoC-βH2, by targeted oncogenesis with lentiviral vectors expressing excisable SV40 LT and hTERT. Following excision of immortalizing transgenes, cell proliferation sharply decreased, which was paralleled by a massive enhancement of β cell-specific features such as increased insulin gene expression and content. Such a cell line represents a major step forward toward the development of authentic human β cells. It also represents a unique tool for studying human β cell proliferation. mogranin-A (CHGA), as was the case for human adult pancreatic β cells. The insulinoma stained negative for glucagon, a marker of α cells, and for carboxypeptidase-A (CPA), a marker of acinar cells (Supplemental Figure 1B). Finally, very rare cells in the insulinoma coexpressed insulin and somatostatin (Supplemental Figure 1B).",
                "The remaining part of the insulinoma was dissociated and used to derive a human β cell line, EndoC-βH2 (Supplemental Figure 1C), using previously described culture conditions (10). PCR performed on genomic DNA indicated that EndoC-βH2 cells have integrated both SV40 LT and hTERT transgenes (Supplemental Figure 1D). EndoC-βH2 cells proliferated with a doubling time of 5 to 7 days. Immunocytochemistry indicated that EndoC-βH2 cells were positive for insulin, C-peptide, CHGA, PDX1, and NKX6-1 (Figure 1B). Cells were positive for SV40 LT and were proliferating as indicated by Ki67 staining (Figure 1B). Cells stained negative for glucagon, and only rare cells were observed that expressed somatostatin (Figure 1B). EndoC-βH2 cells stained negative for CPA and amylase, 2 acinar markers, and for SOX9, a ductal marker (Figure 1B).",
                "Cre-mediated excision of immortalizing transgenes sharply decreases EndoC-βH2 cell proliferation. We transduced EndoC-βH2 cells with increasing amounts of lentiviral vector (from 15 ng to 60 ng of p24 capside protein per 10 5 cells) expressing Cre under the control of a CMV ubiquitous promoter to titrate the amount of Cre-expressing lentiviral vector that yielded optimal transduction efficacy with a minimal amount of lentiviral vector (Supplemental Figure 2A). We used the appropriate lentiviral titer (15 ng of p24 capsid protein per 10 5 cells) to transduce EndoC-βH2 cells with a Cre-expressing lentiviral vector. As a control, 60 ng of p24 capside protein (highest"
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Generation of a human β cell line with excisable immortalizing transgenes.",
                    "paragraphs": [
                        "We previously developed a human β cell line, EndoC-βH1, by targeted oncogenesis mediated by lentiviral integration of 2 immortalizing transgenes, SV40 LT and hTERT, in human fetal pancreas (10). Here, we aimed at generating conditionally immortalized β cell lines in which immortalizing transgenes could be excised. For this purpose, lentiviral vectors were modified through the insertion of a loxP site within the U3 truncated region (Delta U3) of the 3′ LTR. In such a configuration, after integration in the genome of transduced cells, the Delta U3 loxP region is duplicated and 2 loxP sites flank the integrated sequences, allowing subsequent excision dependent on Cre recombinase expression (Figure 1A).",
                        "Excisable lentiviral vectors were constructed to express SV40 LT or hTERT under the control of a 405-nt fragment of the rat insulin-2 promoter. A 9-week-old human fetal pancreas was simultaneously transduced with both lentiviral vectors and transplanted under the kidney capsule of a recipient SCID mouse. At 6.5 months later, an insulinoma had developed from the transplanted tissue. The insulinoma was removed, dissociated, and further amplified in vivo by 3 successive rounds of transplantation (Supplemental Figure 1A; supplemental material available online with this article; doi:10.1172/JCI72674DS1). Part of the final insulinoma was analyzed by immunohistochemistry. Insulinoma cells stained positive for insulin and SV40 LT (Supplemental Figure 1B). They also stained positive for Ki67, which was not the case for human adult pancreatic β cells. The insulinoma cells stained positive for PDX1 and expressed the pan-endocrine marker chro- sion of the cyclin-dependent kinase inhibitor 1A (CDKN1A) that is negatively linked to cell cycle strongly increased following transgene deletion (Figure 3). Interestingly, in the nonexcised versus islet comparison, the same ingenuity categories were retrieved and displayed similarly highly significant P values (Table 1). This demonstrates that nonexcised cells are as distant from islets as they are from excised cells with respect to cell-cycle functions. More importantly, when excised cells were compared with islets, the previously observed differences failed to be significant (P > 0.05) for 11 out of 16 ingenuity function annotations. Although 5 ingenuity function annotations were still significantly different, their corresponding P values were always much less significant (i.e., interphase P values varied from 10 -14 to 10 -6 ) (Table 1). Finally, comparative analyses of cell-cycle-related genes performed by quantitative PCR (QPCR) and Western blot further demonstrated that the expression of CDK1, CCNE2, and CCNB2 decreased following excision to reach levels that resemble those found in islets (Supplemental Figure 3 and Supplemental Figure 4). Interestingly, CCND1 was found absent in EndoC-βH2 but expressed in islet cell preparations (Supplemental Figure 4).",
                        "Gene expression pattern in EndoC-βH2. Comparative transcriptomic analysis was next performed to determine the expression profile of EndoC-βH2 before and after transgene excision in comparison with human islet preparation and the human duct cell line SKPC (12). It revealed that nonexcised EndoC-βH2 cells were highly enriched in the expression of a large number of β cell-specific genes (Figure 4A). Similar comparisons indicated very low levels of expression of exocrine genes in nonexcised EndoC-βH2 cells (Figure 4B). Moreover, the expression of exocrine markers did not increase following excision, while the expression of β cell markers did not decrease following excision (Figure 4). In fact, as described below, the expression of a set of β cell-specific markers increased following excision. Collectively, both before and after transgene titer tested) of a GFP-expressing lentiviral vector was used. Cells were analyzed 21 days following transduction. At the RNA level, upon Cre transduction, SV40 LT levels decreased by 92% and exogenous hTERT expression was reduced by 96% (Figure 2A). Such a sharp decrease in SV40 LT levels was also observed by immunocytochemistry (Figure 2B). Moreover, upon Cre transduction, Ki67 mRNA levels decreased by 97%, an effect that was not observed when cells were transduced with a GFP-expressing lentiviral vector (Figure 2C). This major decrease in Ki67 expression was paralleled by a decrease in BrdU incorporation in Cre-expressing cells. Specifically, over a 1-hour pulse period, 14% of nontransduced cells incorporated BrdU whereas 0.9% of Cre-transduced cells incorporated BrdU (Figure 2D). Of note, EndoC-βH2 efficiently survived the virus-mediated excision procedure. Specifically, with 15 ng per 10 5 cells of Cre-expressing vector, cell number was decreased by 7% at day 7. This level of decrease was similar to that found when cells were transduced with a GFP-expressing vector. By days 14 and 21, as expected, β cell number increased in cells transduced with a GFP-expressing vector at 60 ng of p24 capside protein (the highest concentration tested), while cell number decreased very slowly in cells transduced with 15 ng of p24 capside protein per 10 5 cells of Cre-expressing vector (15.8% decrease at day 14 and 21% decrease at day 21) (Supplemental Figure 2B).",
                        "Ingenuity pathway analysis indicated significant differences between nonexcised and excised cells for 16 ingenuity function annotations linked to cell cycle with highly significant P values (between 2.66 × 10 -20 and 1.54 × 10 -3 ) (Table 1). Specifically, the expression of many genes positively linked to cell proliferation decreased upon transgenes deletion. This is for example the case for cell division cycle family members (CDCs), kinesin family members (KIF), cyclin-dependent kinases such as CDK1, cyclins (CCN), E2F transcription factors, and additional cell-cycle-related genes such as MKI67 and FOXM1 (Figure 3). Similarly, the expres- Ingenuity pathway analysis was performed using 3 different comparisons: EndoC-βH2 excised versus nonexcised cells; EndoC-βH2 nonexcised cells versus islets; and EndoC-βH2 excised cells versus islets. Regulated genes are mapped to functions with literature statements describing the effect of the gene in relation to the function. A statistical approach (z-score) determines whether a function has significantly more increased (z > 2) or decreased (z < -2) predictions.",
                        "The top decreased biological functions involved in cell cycles are listed. P values indicate significant differences in the 3 comparisons. NS indicates P > 0.05."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Figure 3",
            "paragraphs": [
                "Excision of immortalizing transgenes modulates the expression of cellcycle-related genes. Heat map comparisons of the expression of a set of cell-cycle-related genes in EndoC-βH2 nonexcised cells and excised cells versus human islets. The heat map shows the log intensities in 3 sample sets of EndoC-βH2 nonexcised or excised cells and human islets (42). For genes represented by several probe sets, the probe set with the highest fold change was used. Gene list is ordered from low to high expression relative to human islet sample. Gene lists have been generated using published transcriptomic data (43), literature data, and manual curation.",
                "Downloaded from http://www.jci.org on June 9, 2016. http://dx.doi.org/10.1172/JCI72674",
                "excision enhanced the intensity of insulin immunostaining when compared with nonexcised cells (Figure 5B). Interestingly, the rare cells that remained Ki67 positive were the ones that were low in terms of insulin immunostaining (Figure 5C). Insulin content increased by almost 20-fold 21 days after Cre transduction from an initial content of 62 ± 2.3 ng per million cells to 1.98 ± 0.048 μg per million cells (Figure 5D). Moreover, RT-QPCR analyses indicated that the expression of a number of genes linked to β cell function increased following Cre-mediated transgene deletion. This was the case for IAPP, SLC2A2, KCNJ11, ABCC8, and RAB3A (Figure 5E). This was also the case for a number of transcription factors such as MAFA, GLIS3, NKX2-2, NKX6-1, PDX1, MNX1, and MYT1 deletion, the gene expression pattern observed in EndoC-βH2 cells is consistent with human β cells. EndoC-βH2 cell function following transgene excision. Twenty-one days following transduction of EndoC-βH2 cells with a Creexpressing lentiviral vector, we observed a sharp increase in insulin mRNA levels (Figure 5A). Such an increase in insulin mRNA levels was not observed when cells were transduced with a GFPexpressing lentiviral vector (Figure 5A). When compared with the previously published EndoC-βH1 line, nonexcised EndoC-βH2 cells expressed 4.1-fold less insulin mRNA. However, upon excision, EndoC-βH2 cells expressed 2.9-fold more insulin mRNA than EndoC-βH1 (Figure 5A). At the protein level, Cre-mediated"
            ],
            "subsections": []
        },
        {
            "title": "Figure 4",
            "paragraphs": [
                "Heat map visualization of gene expression profiling in excised and unexcised EndoC-βH2 compared with human islets and exocrine cell line. (A) Expression of genes relevant for β cell function in heat map visualization. The heat map shows the log intensities in 3 sample sets of EndoC-βH2 nonexcised or excised cells, human islets (42), and pancreas exocrine cell line SKPC. For genes represented by several probe sets, the probe set with the highest fold change was used. Most genes are highly expressed in the human β cell line EndoC-βH2 and in islet samples, but not in exocrine cell line SKPC. (B) Expression of exocrine marker genes in heat map visualization. The heat map shows the log intensities in 3 sample sets of EndoC-βH2 nonexcised or excised cells, human islets (42), and pancreas exocrine cell line SKPC. Gene lists have been generated using published transcriptomics data (43), literature data, and manual curation. For genes represented by several probe sets, the probe set with the highest fold change was used. Most genes are not expressed in human β cell line EndoC-βH2 samples (excised or not), but in islet samples. and excised cells using the exact same number of seeded cells per well in the assay. Interestingly, at all glucose concentrations tested, the absolute values of secreted insulin per hour were much higher in excised cells compared with control nonexcised cells (Figure 7A). Nonexcised cells failed to respond to glucose stimulation in the absence of IBMX, a phosphodiesterase inhibitor that increases intracellular levels of cAMP, but responded to glucose in the presence of IBMX. In the presence of IBMX, the stimulation index of nonexcised cells, defined as the ratio of secreted insulin at 15 mM glucose compared with 0.5 mM glucose, was 2.0 (Figure 7B). In excised cells, glucose induced insulin secretion both in the absence and in the presence of IBMX, with stimulation indexes of 3.8 and 3.02, respectively (Figure 7C).",
                "(Figure 6). Interestingly, when compared with islets, the expression of both MAFA and GLIS3 was particularly low in nonexcised cells, while the other transcription factors were expressed at similar level as in islets. Following transgene excision in EndoC-βH2 cells, we observed an 8-fold increase of MAFA expression (same magnitude as insulin induction) and a 2.5-fold increase in GLIS3 expression (Figure 6). Taken together, such data suggest that the increased expression of MAFA and GLIS3 that is particularly low in nonexcised cells could explain the important increase in insulin mRNA level that takes place following Cre-mediated excision.",
                "Finally, we asked whether EndoC-βH2 cells remained glucose responsive following Cre-mediated transgene deletion. Static glucose-stimulated insulin secretion was performed in both control at passage 59) (Supplemental Table 1). In addition, in the presence of IBMX, glucose responsiveness was observed at all passages tested and fold induction of insulin secretion between 2.8 mM and 15 mM glucose ranged between 2.35 (passage 77) and 3.8 (passage 62) (Supplemental Table 1).",
                "Finally, independently of passage number, transduction with Creexpressing lentiviral vector always resulted in growth arrest. BrdU incorporation tested at passages 62, 105, and 120 was high before excision (between 14% and 16% of positive cells) and drastically decreased 21 days following excision (between 0.47% and 0.9% of positive cells). Furthermore, over the same passages, Ki67 mRNA expression measured by QPCR decreased following excision by 97%, 96%, and 98% respectively."
            ],
            "subsections": []
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "During the past 30 years, many studies aimed at generating functional human pancreatic β cell lines showed an extremely low success rate (13,14). Interestingly, in 2011, we and another independent laboratory generated human pancreatic β cell lines. The β cell lines developed by the Flatt's laboratory were generated by electrofusion of freshly isolated human pancreatic β cells and the immortal human PANC-1 epithelial cell line (15). They contained limited amounts of insulin, but insulin secretion was dependent on glucose levels. We developed human β cell lines using an approach based on targeted oncogenesis by transducing human fetal pancreases with lentiviral vectors that expressed SV40 LT and hTERT under the control of the insulin promoter. One cell line, EndoC-βH1, developed with this approach expressed fair amounts of insulin, and insulin secretion was regulated by glucose (10). EndoC-βH1 cells shared many similarities with primary human β cells. However, as a cell line, EndoC-βH1 cells are in essence proliferating cells, while primary human adult β cells proliferate extremely poorly. In order to move closer to a genuine human β cell, we developed in the present work a conditionally immortalized human pancreatic β cell line.",
                "As a first step, we developed new insulinomas using excisable lentiviral vectors, from which we derived a new human β cell line, EndoC-βH2, which was analyzed in detail. Currently, studies on human β cell biology are dependent on access to preparations of human islets derived from cadaveric donors. In addition to limited access to human islet preparations and to major variability from one donor to the other, β cells only represent a subfraction of cells present in islet preparations that contain other endocrine cell types, but also exocrine cells (16,17). This lack of β cell purity Collectively, our data demonstrate that upon Cre expression, SV40 LT and hTERT can be efficiently excised in the EndoC-βH2 cell line, leading to proliferation arrest and enhancement of β cell function.",
                "EndoC-βH2 cell stability. We analyzed the stability of EndoC-βH2 at different passages on 3 important features: (a) chromosomal stability; (b) insulin content and secretion; and (c) proliferation arrest upon excision of immortalizing transgenes.",
                "Comparative genomic hybridization (CGH array) profiles indicated that, as expected for SV40LT-transformed cells, the chromosomal structure of the cells was abnormal (Supplemental Figure 5). But most importantly, when CGH array analysis was performed at 2 different passages, namely p34 and p85, the exact same profile was observed, indicating that although chromosomal structure was abnormal, the structure is very stable over time (Supplemental Figure 5). Indeed, within a complete year in culture from p34 to p85, no changes were observed, suggesting that continuous SV40LT expression by EndoC-βH2 does not induce cumulative chromosomal modifications.",
                "Insulin content was measured at passages 46, 59, 62, and 77. It was stable before excision (minimal value 0.062 μg/million cells at passage 62; maximal value 0.090 μg/million cells at passage 59) and systematically increased following excision (minimal value 1.98 μg/million cells at passage 62; maximal value 2.75 μg/million cells excision via the Cre recombinase (20)(21)(22). Similar approaches were used to produce reversely immortalized human liver sinusoidal endothelial cells and β cells (23,24) and primate hepatic progenitor cell lines (25). However, the first β cell line developed with this approach rapidly lost insulin expression (23). The second line, NAKT-15, reported in 2005 (24), was not further studied or distributed despite its promising β cell-specific properties. In addition, upon Cre-mediated SV40 LT deletion in primate hepatic progenitor cell lines, cells exhibited picnotic or fragmented nuclei characteristics of apoptosis and died, which was suggested to be due to p53 accumulation (25). Here, we used excisable lentiviral vectors to generate a stable conditionally immortalized functional human β cell line. We found that immortalizing transgenes can be efficiently deleted in more than 90% of EndoC-βH2 cells, giving rise to cellular growth arrest. This demonstrated that proliferation was dependent upon transgene expression. In our present work, cell death following Cre expression was a minor phenomenon and cells survived efficiently for at least 3 weeks following excision. In fact, we performed the majority of the experiments 3 weeks following Cre transduction, and not only did excised cells survive, but the expression of a number of markers of differentiated β cells increased. This was the case for insulin and the islet amyloid polypeptide (IAPP), which is coexpressed and cosecreted with insulin by primary β cells (26). This is also the case for the glucose transporter SLC2A2, for ABCC8 and KCNJ11 and for RAB3A, which are all implicated in glucose-stimulated insulin secretion (27). Our data thus indicate that by deleting immortalizing transgenes and blocking cell proliferation, we increased the β cell differentiation status. β Cells are highly differentiated cells with more than 30% of mRNA that encodes insulin (28). Developing and maintaining such a differentiated status is an active process that requires energy (29). Energy is also necessary for cell proliferation. We thus hypothesize that the observed increase of β cell differentiation status following cell growth arrest reflects the classical but not yet fully explained balance between the processes of cell proliferation and differentiation. The above-described model will be useful in dissecting how this balance is regulated.",
                "In 2004, Dor and colleagues demonstrated the major role of β cell proliferation in β cell mass regulation in adult mice (2), and this seminal work was followed by a series of studies that analyzed β cell proliferation in humans. Since then, while major progress appeared on rodent β cell proliferation, information on human β cell proliferation remained extremely scarce (8). This is at least in part due to the difficult access to primary human islets. This is also due to the fact that β cells represent only a sub-fraction of such human islet cell preparations, which complicates the use of human islet preparations in large-scale screenings. Here, we demonstrate that excised EndoC-βH2 cells express very low levels of CDK1, CCNE2, and CCNB2, as is the case for human islets, while in such preparations represents a limitation in the interpretation of data derived from transcriptomic analysis. Here, comparative transcriptional analyses indicated that EndoC-βH2 cells expressed the set of β cell-specific genes also found in human islet cell preparations. Moreover, while the expression of many exocrine markers was detected in human islet cell preparations, this was not the case in EndoC-βH2 cells. Such a new cell line will thus be useful for experiments where large numbers of pure insulin-producing human pancreatic β cells are needed.",
                "In the past, a number of approaches were used to produce conditionally immortalized cell lines. A thermosensitive variant of SV40 LT and approaches based on tetracyclin-mediated regulation of SV40 LT expression have been used to respectively develop mouse striatal progenitor cell lines (18) and mouse β cell lines (19). Control of immortalizing transgene expression was also achieved in a more permanent way. Conditionally immortalized cell lines were produced following retroviral-mediated stable integration of immortalizing transgenes flanked by loxP sites, allowing their Insulin secretion by EndoC-βH2 cells following Cre-mediated excision. EndoC-βH2 cells were transduced with Cre-expressing lentiviral vectors and analyzed 21 days later. Control nonexcised and excised EndoC-βH2 cells were tested for static insulin secretion under various glucose concentrations in the presence or absence of IBMX. In A, results are expressed as ng of secreted insulin per hour. In B and C, insulin secretion is presented as percentage of insulin content. Results are presented as mean ± SEM of 3 independent wells per condition assayed by ELISA. The experiment was replicated 2 times.",
                "explants were cotransduced with pTRIP ΔU3 loxP.RIP405-SV40 LT and pTRIP ΔU3 loxP.RIP405-hTERT lentiviral vectors. They were next transplanted under the kidney capsule of SCID mice as previously described (10). At 6.5 months later, insulinoma was formed in the transplanted tissue. Three successive rounds of transplantation in SCID mice were used to amplify the insulinoma cells prior to establishment of the cell line. Subtransplantation and culture conditions are described elsewhere (10) Immunostaining of pancreatic explants and cell lines. Tissues were fixed in 3.7% formaldehyde prior to their embedding in paraffin. For immunohistochemistry, sections (4-μm thick) were prepared and processed, as described previously (10). For immunocytochemistry, EndoC-βH2 cells were cultured on 12-mm glass cover slips that were coated with Matrigel and fibronectin. After 5 days, the cells were then fixed for 1 hour in 4% paraformaldehyde. The following antibodies were used for immunostaining: guinea pig anti-insulin antibody (1/500; A0564, Dako-Cytomation); rat anti-human C-peptide (1/3,000; AB1921, Beta Cell Biology Consortium); mouse anti-glucagon (1/2000; G2654, Sigma-Aldrich) or rabbit anti-glucagon (1/1000; 20076-Immuno, Euromedex); rabbit antisomatostatin antibody (1/500; A0566, DakoCytomation); mouse antichromogranin A (1/50; M0869, DakoCytomation); rabbit anti-human PDX1 antibody (1/2,000) (39) rabbit anti-NKX6-1 antibody (1/500; AB1069, Beta Cell Biology Consortium); rabbit anti-SOX9 antibody (1/500; AB5535, Millipore); rabbit anti-amylase antibody (1/300; A8273, Sigma-Aldrich); mouse anti-SV40 LT (1/50; DP-02, Calbiochem Merck Biosciences); mouse anti-human Ki67 antigen (1/50; M7240, DakoCytomation); rabbit anti-carboxypeptidase A antibody (1/500; 1810-0006); rat anti-BrdU antibody (1/500; OBT0030, AbD Serotec); and mouse anti-Cre recombinase antibody (1/500, CRE-2D8-AS; Euromedex).",
                "The secondary antibodies were fluorescein anti-rabbit antibody (1/200; 711-096-152, Jackson Immunoresearch Laboratories, Beckman Coulter); fluorescein anti-mouse antibody (1/200; IM0819, Immunotech); Alexa Fluor 488 goat anti-rat antibody (1/500; A11006, Invitrogen); and Texas red anti-guinea pig antibody (1/200; 706-076-148, Jackson Immunoresearch Laboratories).",
                "Digital images of the pancreatic explants and cell lines were captured using a cooled 3-chip charge-coupled device camera (Hamamatsu C5810; Hamamatsu) that was attached to a fluorescent microscope (Leica; Leitz) or with an Olympus Fluoview FV1000 confocal microscope.",
                "Western blot analyses. Protein lysates were subjected to immunoblotting as previously described (40). The following antibodies were used: CDK1 (1/1,000; ab18, Abcam), CDK4 (1/1,000; ab6315, Abcam), CCND1 (1/1,000; RM-9104-S1, NeoMarkers), CCND3 (1/1000; #2936, Cell Signaling), CCNE2 (1/1000; ab40890, Abcam), CCNB2 (1/1,000; ab18250, Abcam), and β-actin (1/2,000; A5441, Sigma-Aldrich). Immunoblotting experiments were performed at least 3 times.",
                "PCR on genomic DNA. Genomic DNA was extracted from 5 × 10 5 EndoC-βH2 and HEK 293T cells (CRL-11268, mycoplasma negative, ATCC) using DNeasy Blood & Tissue Kit (QIAGEN). Integrated SV40 LT was PCR amplified with RIP2 (sense: GTCCAATGAGCACTTTCT) and SV40 LT (antisense: GCAGACACTCTATGCCTGTGTGG) primers generating 892-bp PCR products. Integrated hTERT was PCR amplified with hTERT (sense: TTCCTACGCTTCATGTGCC) and 3′ LTR (anti-sense: CAGCTGCCTTG-TAAGTC) primers, generating 1030-bp PCR products respectively.",
                "RNA isolation, reverse transcription, and RT-PCR. Total RNA was isolated from all different cell lines using the QIAGEN RNeasy Mini Kit (QIAGEN), as described previously (10). First-strand cDNA was prepared using Superscript reagents (Invitrogen), and RT-QPCR was done using either Assays-on-Demand kits (Applied Biosystems), LightCycler 480 SYBR Green 1 Master Mix (Roche), or LightCycler 1536 DNA Green Master Mix (Roche) and analyzed on an ABI Prism 7300 Sequence Detector (Applied Biosystems) or on a the expression of such cell-cycle-related factors is activated in proliferating EndoC-βH2 cells. CDK1, CCNE2, and CCNB2 should thus be used as readouts in screens aiming at defining new signals that activate human β cell proliferation. We also observed that, as expected, CCND3 is expressed both in human islet preparations and in EndoC-βH2 cells (30). On the other hand, we observed that CCND1 is absent from EndoC-βH2 cells (both nonexcised and excised), but detectable in islet preparations. Such data suggest that CCND1 is not a perfect readout for human β cell proliferation, taking into account that CCND1 cannot be detected by immunohistochemistry on sections of human adult pancreas (The Human Protein Atlas [http://www.proteinatlas.org] and our unpublished data).",
                "In the adult pancreas, human β cell proliferation is extremely low (5,31). It was found that human β cell replication could be activated not only upon glucose stimulation (32), but also by adenovirus-mediated overexpression of cell-cycle regulators (33). It is, however, important to keep in mind that in such studies, β cell replication was quantified following BrdU staining that indicates S-phase entry. Recent studies suggest that forced activation of cell-cycle entry could give rise to accumulation of DNA damage, resulting in a lack of final β cell expansion (9). In this context, it is of major importance to measure β cell mass and β cell numbers upon stimulation. However, it was recently indicated that no laboratory has developed techniques that provide unequivocal evidence of productive human β cell expansion in vitro or in vivo (34). The excisable human β cell line we created represents a unique tool not only for screening for signals that activate human β cell proliferation, but also for determining why human β cells proliferate so poorly."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [
                "DNA constructs and lentiviral vector productions. The lentiviral constructs pTRIP ΔU3.RIP405-SV40 LT and pTRIP ΔU3.RIP405-hTERT have been previously described (10,35). New lentiviral vectors, pTRIP ΔU3 loxP. RIP405-SV40 LT and pTRIP ΔU3 loxP.RIP405-hTERT, were constructed. The loxP 3′ LTR cassette was amplified by PCR from the SIN-loxP vector (provided by B. Thorens, Lausanne University, Lausanne Switzerland) with the Kpn primer 5′-CGGGGTACCTTTAAGACCAATGACTTACA-3′ and the PacI primer 5′-CGGTTAATTAAGAACTACTACTGCTAGA-3′. The 378-bp resulting PCR fragment was digested by KpnI and PacI restriction endonucleases and next inserted in the SV40 LT and hTERT lentiviral vectors to replace the ΔU3 3′ LTR by a loxP 3′ LTR. The pTRIP ΔU3 CMV-nlsCre and pTRIP ΔU3 CMV-eGFP vectors were described elsewhere (36,37).",
                "Lentiviral vector stocks were produced by transient transfection of HEK 293T cells using p8.9 encapsidation plasmid (ΔVprΔVifΔVpuΔNef), pHCMV-G plasmid, which encoded the VSV glycoprotein-G and the pTRIP ΔU3 recombinant vector, as previously described (38). The supernatants were treated with DNAse I (Roche Diagnostic) prior to their ultracentrifugation, and the resultant pellets were resuspended in PBS, aliquotted, and then frozen at -80°C until use. The amount of p24 capsid protein was quantified by the HIV-1 p24 antigen ELISA (Beckman Coulter). All transductions were normalized relative to p24 capsid protein quantification.",
                "Human tissues. Human fetal pancreases were extracted from tissue fragments that were obtained immediately after elective termination of pregnancy at from 7 to 11 weeks of gestation. Gestational ages were determined from the last menstrual period, the crown-rump length as measured by ultrasonography, and the hand and foot morphology. Human islets were prepared as previously described (10).",
                "Derivation of human β cell line EndoC-βH2. EndoC-βH2 was derived as previously described with slight modifications. Briefly, human fetal pancreatic nuity Systems), which predicts the qualitative effect of gene expression changes in a given data set on biological functions. The predicted activation state and activation z-score are based on the direction of fold change values for those genes in the input data set for which an experimentally observed causal relationship has been established.",
                "Access to raw data. All data are MIAME compliant, and the raw data have been deposited in a MIAME database (GEO GSE48101).",
                "Statistics. Formalization and statistical analysis for transcriptome studies were as follows: a software package (Array Studio, Omicsoft Corp.) was used for data normalization and examination of expression levels. Data were summarized and normalized using the robust multichip analysis (RMA). Two-tailed Limma's empirical Bayes moderated t test was used for the comparison of cell lines. For the comparison of excised versus nonexcised human β cell lines, significant differences were defined as a 2-fold or greater change in expression passing a multiple hypothesis testing correction by Benjamini-Hochberg (P ≤ 0.01). For QPCR experiments, statistical analysis was performed using 2-tailed Student's t test.",
                "Study approval. Human fetal tissue was collected in compliance with French bioethic legislation. Approval was obtained from the French competent authority, the Agence de Biomedecine (Paris), under approval number PFS08-005 along with maternal written consent. Experiments using animals were reviewed and approved by the Direction Départementale de la Protection des Populations (Paris) under agreement number A75-13-19 in compliance with French legislation."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "The authors would like to thank the Beta Cell Biology Consortium for providing antibodies against human C peptide and rat NKX6-1. We thank Mathias Gebauer (Sanofi-Aventis Deutschland, R&D) for support in RNA processing and Affymetrix analysis, Marine Giry from the Genotyping and Sequencing Platform of the Institut du Cerveau et de la Moelle (ICM) for technical assistance in"
            ],
            "subsections": []
        }
    ]
}