{
    "id": "https://semopenalex.org/work/W2050093196",
    "authors": [
        "Zhi Yang",
        "Bo Han",
        "Josephine Y. Fang",
        "ShihJye Tan",
        "Charisse Tayag"
    ],
    "title": "Tumor Bioengineering Using a Transglutaminase Crosslinked Hydrogel",
    "date": "2014-08-18",
    "abstract": "Development of a physiologically relevant 3D model system for cancer research and drug development is a current challenge. We have adopted a 3D culture system based on a transglutaminase-crosslinked gelatin gel (Col-Tgel) to mimic the tumor 3D microenvironment. The system has several unique advantages over other alternatives including presenting cell-matrix interaction sites from collagen-derived peptides, geometry-initiated multicellular tumor spheroids, and metabolic gradients in the tumor microenvironment. Also it provides a controllable wide spectrum of gel stiffness for mechanical signals, and technical compatibility with imaging based screening due to its transparent properties. In addition, the Col-Tgel provides a cure-in-situ delivery vehicle for tumor xenograft formation in animals enhancing tumor cell uptake rate. Overall, this distinctive 3D system could offer a platform to more accurately mimic in vivo situations to study tumor formation and progression both in vitro and in vivo.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Tumors are dynamic and complex structures. Their composition and environment are governed by biochemical and molecular signals exchanged between cells and their extracellular matrix (ECM) [1], [2]. Even though 2D tumor cell cultures have been used routinely for conducting biochemical and drug sensitivity tests in oncology, they seldom mimic the in vivo environment, and scarcely reflect integral biomimetic characteristics such as cell-cell and cell-matrix interactions and their corresponding spatiotemporal signaling, metabolic gradients, and mechanical restriction [3]–[5]. Thus, bioengineering tumors by using biological relevant 3D tumor cell culture models can bridge between in vitro cell based assay and the native microenvironment of living organisms [6]–[8]. In addition, 3D culture systems generated from human tissue could be a better tool for drug screening by implementing more accurate in vivo equivalent structures and organization and might produce more predictive response than non-human systems [9].",
                "Many 3D tumor cell culture models ranging from scaffold-dependent to scaffold-free, and consisting of single or multiple cell types have been developed. These models provide the opportunity to simulate important aspects of tumor masses including cancer cell aggregation and clustering, cell migration and proliferation, angiogenic factors release and hypoxia [10]. One of the most widely used models is the Multicellular Tumor Spheroids (MCTS) system, a scaffold-free tumor cell system that can facilitate cell-cell interactions through chemical linkers or gravitational enhancement [7]. Many extracellular matrices (ECM) such as Matrigel, type I collagen, fibrin, and hyaluronic acid have been used as tumor cell 3D scaffolds [11]–[13]. These biologically derived matrices provide both chemical and mechanical cues essential for modulation in gene expression while allowing for cellular adhesion and integrin engagement [14]–[18]. However, there are still some incomplete requirements for cancer research and drug development, such as unknown dose of growth factors and additives in the preparations, uncontrollable mechanical rigidity, batch to batch variations, low reproducibility, complex protocol setup, and physiological irrelevant matrices for cells.",
                "The ECM plays an important role in supporting or even inducing tumorigenesis [7], [8]. The most common extracellular matrix component presenting in the tumor microenvironment is collagen, which provides a scaffold for structural support. Meanwhile, collagen turnover in the tumor microenvironment was associated with tumor progression and metastasis [2]. In previous studies, we have developed an injectable gelatin-based transglutaminase-crosslinked gel system (Col-Tgel) for cell culture and drug delivery [19]–[21]. Here we focus on the development and validation of novel 3D culture system that simulate the tumor stromal environment by manipulating the Col-Tgel. We demonstrated that biocompatibility and 3D architecture of Col-Tgel were suitable for reproducing the solid tumor microenvironment and it may offer a toolbox to study key events associated with tumor formation, progression, and metastasis and have potential to serve as an antitumor drug testing platform [22]–[24]."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Cell Culture",
                    "paragraphs": [
                        "MDA-MB-231 (human breast carcinoma), Saos-2 (human osteosarcoma), and HCT116 (human colorectal carcinoma) cell lines were obtained from ATCC (Cat.HTB-26, HTB-85, CCL-247, American Type Culture Collection, Manassas, VA). The C4-2B human prostate cancer cell line was generously provided by Dr. M. Stallcup and SCC-71 human oral squamous carcinoma cell line was gifted from Dr. Uttam Sinha (Norris Cancer Center at USC) [25], [26]. MDA-MB-231, Saos-2, SCC-71 were first expanded in traditional 2D culture in DMEM, HCT116 in McCoy5a, and C4-2B in RPMI1640 (Mediatech, VA), all with 10% fetal bovine serum (Lonza, MD) supplement and 1% Penicillin/Streptomycin (Mediatech, VA). Rat bone marrow derived mesenchymal stem cells were prepared in our laboratory as described [27], [28]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Gel Preparation And Characterization",
                    "paragraphs": [
                        "Transglutaminase-crosslinked collagen hydrogels (Col-Tgel) were prepared as described previously [29]. Briefly, 12% gelatin (bovine skin type B 225 bloom, Sigma- Aldrich, MO) was prepared with 2× PBS and autoclaved for sterilization. 4°C stored stock gel was liquefied at 37°C and further diluted to 6% with dH2O. Diluted gel was handled at room temperature for all assays and cell embedding.",
                        "Light transmission of Col-Tgel, compared with type I collagen 3 mg/ml (BD Bioscience, CA) and Matrigel with phenol red free (BD Bioscience, CA) was measured in 1ml cuvette with wavelengths of 600 nm using a UV visible spectrophotometer (Hitch U-3000, Japan). The higher absorbance value represented the lower transparency of the gel.",
                        "Mechanical test were carried out with an indentation test. Gelatin gel with concentrations of 3, 4.5, 6, 7.5 and 9% was prepared and 3 ml of gel was loaded in a glass tube sample container. After gel polymerized, the gel surface was marked as initial height followed by gently applying a 5.8 g and 8 mm diameter stainless steel sphere. The sphere was placed at the centre of the sample and the weight of the sphere caused the gel deformation. The side-view image of the gel deformation was recorded by mounted camera with a reference ruler. However, the ratio of the gel height and the distance of indentation was not less than 10% and the ratio of the gel lateral dimension and contact radius was not higher than 12. Therefore, the half-space assumption and Hertz contact theory cannot apply in this circumstance [22]. The central deformation of the gel construct cannot be directly used to compute the Young's modulus, so we simplified demonstrate the displacement distance as an indicator of relative gel stiffness in this study."
                    ],
                    "subsections": []
                },
                {
                    "title": "3D Col-Tgel Culture",
                    "paragraphs": [
                        "Cells were trypsinized with 0.025% trypsin in HBSS (Mediatech, VA) washed with 1XPBS and counted. A calculated volume of gelatin solution was added into the cell pellet to make desired final seeding density (Fig. 1). Cells were suspended in the gelatin solution followed by addition of purified transglutaminase (Tg) crosslinker for final concentration of 50 µg/ml by gentle pipetting [30], [31]. Cell-seeded hydrogel was placed as a single droplet on the surface of a 48-well suspension cell culture plate or multiple droplets on 4 mm dishes (Greiner bio-one, NC) following by incubation at 37°C for 30 minutes. The volume of the gel-cell suspension was varied to fabricate the specific radius of Col-Tgel-cell dome. Cell type specific medium was added for prolonged culture."
                    ],
                    "subsections": []
                },
                {
                    "title": "3D Morphological Analysis",
                    "paragraphs": [
                        "Cells in 3D gel were directly observed daily under the light microscope (Leitz Wetzlar, Germany) and recorded with a digital camera (Nikon, Japan). The center-to-edge images were recorded using a light microscope by adjusting the focus plain on the z-stack.",
                        "For immunohistochemical analysis, cells in 3D gel were fixed with 10% neutral formalin for 10 minutes. After washing with PBS, cells were permeabilized with 0.5% Triton X-100/PBS, and blocked with 3% bovine serum albumin for 30 minutes at 37°C following by incubation with fluorescence protein conjugated primary antibody Rhodamine Phalloidin 33 nM (Cat.R415, Lifetech, CA) and DAPI dihydrochloride (dilution = 1∶100000, Cat.40011, Biotium Inc., CA) (nuclei staining) in the dark for 5 minutes. In addition, other polyclonal rabbit primary antibodies, such as E- cadherin (dilution = 1∶400, Cat.PA5-32178, Thermoscientific, IL), laminin 5 (dilution = 1∶400, Cat.ab14509, abcam, MA), β1 integrin (dilution = 1∶400, Cat.PA5–29606, Thermoscientific, IL) were incubated with 3D culture constructs overnight at 4°C and detected with FITC conjugated goat antibody (dilution = 1∶1000, Cat.65–111, Lifetech, CA). Imaging was taken by EVOS fluorescence microscope (Advanced Microscopy Group, WA) directly in culture wells.",
                        "For immunocytochemistry, the samples were proceed with the same procedure as above and incubated with polyclonal rabbit primary antibody Ki67 (dilution = 1∶100, Cat.PA1–21520, Thermoscientific, IL), anti-rabbit IgG-biotin antibody from goat as secondary antibody (dilution = 1∶600, Cat.B8895, Sigma-Aldrich, MO), streptavidin-peroxisase polymer as signal amplifier (dilution = 1∶800, Cat.S2438, Sigma-Aldrich, MO) and detected by Pierce Peroxidase Detection Kit (Cat.36000, Thermo scientific, IL). MSC and SCC-71 were labeled with Mitotracker green and red (Cat.M7512, Lifetech, CA) respectively before co-culture."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell Viability And Gel Permeability",
                    "paragraphs": [
                        "Cell viability for the encapsulated cells was quantified by Cell Counting Kit-8 (Cat.CK04–13, Dojindo Laboratories, Japan) and followed by manufacturer's protocol. Dehydrogenase activity from live cells reduces red tetrazolium component into a soluble yellow formazan in the medium, which is directly proportional to the number of living cells. Briefly, at predetermined time points, media was replaced with 200 µl of fresh media containing 5µl of stock CCkit8 reagent. After three hours of incubation, 100 µl of medium was transferred into a 96-well plate for 450 nm absorbance measurement by multiplate reader (Molecular Devices, CA). Reagent contained medium without cell incubation served as baseline control.",
                        "For viability assay and gel permeability tests, cells embedded in Col-Tgel were treated with 5 mg/ml of 3-(4, 5-Dimethylthiazol-2-yl)-2, 5-diphenyltetrazolium bromide (MTT) for 3 hours. The reaction was stopped by adding DMF/SDS (pH 4.7). The reduction of an MTT tetrazolium component into an insoluble dark purple formazan by viable cells was imaged by light microscope."
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Level Detection",
                    "paragraphs": [
                        "MDA-MB-231 cells were embedded in a 100µl Col-Tgel droplet at 1×106/ml and cultured in DMEM with 10% FBS and 1% PS at 37°C. Oxygen concentration was measured by OM-1 Oxygen meter (Microelectrodes Inc, NH) probed at the gel center and in the surrounding medium at day 0, 3 and 9."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cancer Drug Testing In A 3D Model",
                    "paragraphs": [
                        "Each 20 µl gel droplet with 4×104 cells was cultured in a 48-well-plate for 3 days before drug treatment. Paclitaxel (TEVA Pharmaceuticals Inc., USA) in final concentrations of 0, 2, 20, and 200 µM were added. For comparison, the same numbers of cells as used in monolayer cultures were treated with the same drug regime. After 72 hours, cell viability assay by CCkit-8 (Dojindo Laboratories, Japan) together with Live/Dead cell assay (Cat.L3224, Lifetech, NY) were performed. Briefly, 3D culture were incubated for 30 minutes in media containing 4 mM calcein AM (λem = 530 nm) to stain viable cells and 1.5 mM ethidium homodimer-1 (λem = 645 nm) to stain dead cells."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tumor Induction In Nude Mice",
                    "paragraphs": [
                        "The animal surgery procedures and housing conditions in the study was followed by the approved protocol from Institution of Animal Care and Use Committee (IACUC) at University of Southern California and permission number is 11732. All animals were handled under aseptic condition at all time during and after the surgery. Food and water were given ad libitum throughout the study. Total 36 of 6 week-old and ±22 g male athymic nude mice (Simonsen Laboratories) were used as xenograft hosts. Animals were divided into six groups for six type of cancer cell line induction. Briefly, 100 µl Col-Tgel containing 1×106 cells of each tumor cell type (MDA-MB-231, HCT116, CFPAC-1, and SaoS-2) was subcutaneously injected into both flanks of mouse after anesthetizing with Ketamine/Xylazine. Tumor sizes were measured every three days. Retrieved tumor specimens were processed for pathological assays."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistic Analysis",
                    "paragraphs": [
                        "Experiment results were analyzed with nonparametric ANOVA by SAS (SAS institute Inc.) due to the small amount sample size. Experiment data were converted to rank transformation and analyzed correlation and regression of each study group with rank transformation by PROC GLM. Since sample size were the same, we choose Tukey's test for pairwise comparison (p<0.05 for drug resistance test, p<0.001 for oxygen level test)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "The Collagen Derived 3D Gel For Engineering Tumors",
                    "paragraphs": [
                        "Col-Tgel containing native and denatured type I collagen peptides provides an extracellular environment for cell attachment and growth [23], [32] (Fig. 1A). Before crosslinking, gelatin maintains liquid phase at room temperature for homogenously mixing with cells (Fig. 1B). After adding of crosslinking enzyme, 3D gel could be formed in about 30 minutes at 37°C. This time window was allowed to transfer and modify gel-cell constructs either as a single drop or multi-gel droplets into each culture compartment (Fig. 1C). The dome height on the hydrophobic surface is correlated to the cast volume. After incubation, Col-Tgel transformed from liquid into irreversible hydrogel to encapsulate cells in situ. The cured Col-Tgel is transparent at all tested concentrations as compared to semi-opaque type I collagen gel and Matrigel, as shown by opaqueness comparison images (Fig. 1D) and light transmission measurement (Fig. 1E). This property enables to study live cell morphology change, cell-cell interaction, and migration simply under the optical microscope. Col-Tgel also exhibited variable mechanical stiffness property with the alteration of gelatin concentrations and crosslinking rate. In general, the stiffness increases as the concentration of gelatin increased, where 9% Col-Tgel presented the highest stiffness while 3% was the lowest as illustrated by indentation technique (Fig. 1F). This is an important property of the Col-Tgel, indicating gel restriction force would be directly manipulated by controlling the gel concentration to generate interstitial pressure applied on cells.",
                        "Matrix geometry is one of the critical factors in determining cell fate [33]. To further define the 3D culture system, we created two 3D culture models in the multi-well plate and tested the gel geometry effects on nutrient permeability: a dome model (Fig. 2A) and plug model (Fig. 2D). We generated one dome per well in 48-well plate. In plug model, a layer of gel was further casted on top of cured dome to ensure the initial cell number and their positions were the same. MTT was served as a sample molecule to study the gel shape effects. Diffused MTT was absorbed by cells, and reduced into insoluble purple formazan crystals. After three hours, all MDA-MB-231 cells in the dome model turned purple regardless of cell location (Fig. 2 B&C). However, color changes in the plug model were cell location dependent, purple on the top surface (Fig. 2E) while partially stained cells at the bottom (Fig. 2F). Due to the fact that dome shape ensures reproducible analysis and roughly identical radial diffusion barriers towards the centre of the dome, the dome model was selected for the succeed studies."
                    ],
                    "subsections": []
                },
                {
                    "title": "Formation Of Tumor Spheroids In 3D Gel",
                    "paragraphs": [
                        "Col-Tgel serves as an interstitial substrate to support the growth of different cell types including tumor and normal cells. The transparency of Col-Tgel enabled us to observe cell assembly in real time. Tumor cells adopted unique morphology when cultured in Col-Tgel 3D in comparison to 2D plastic surface. MDA-MB-231 cells developed self- assembly microspheroids inside Col-Tgel after 6 days of culture (Fig. 3A). Cells aggregated, formed tight cellular clusters ranging 30 to 200 µm in diameter, and shaped similar to in vivo tumors (3A, top, inside gel). In comparison, the same MDA-MB-231 cells growing on a plastic surface (3A, bottom half, on plastic) presented a completely different cellular morphology in the same culture well. Cells exhibited elongated morphology with pseudopodium protrusion. There was little cell-cell junction formation between neighboring cells.",
                        "The time course of spheroid formation is shown in (Fig. 3B–E). On initial seeding, cells were homogenously distributed throughout the gel with no aggregates or clusters formation (Fig. 3B). After 48 hours, 2- to 3-cell aggregates formed (Fig. 3C). Using a time-lapse camera, initial cell clusters were formed by both cell multiplication and assembly (data not shown). After four days in culture, cell clusters grew bigger with 10 to 20 cells in each cluster (Fig. 3D). By six days, a large number of spheroids aligned around the periphery of the gel dome. Spheroids contained ten to hundred cells and their shapes from round to oval with smooth surfaces (Fig. 3E). Other tumor cells such as prostate cancer cells (C4–2B), and colon cancer cells (HCT116) presented similar cell arrangements in 3D Col-Tgel (not shown). When stained with the cytoskeleton protein, F-actin, spheroids displayed distinctive cell morphology in different tumor cells (Figure 4F, prostate cancer C4–2B, colon cancer HCT116, and breast cancer MDA-MB-231) [34].",
                        "The surface expression of E-cadherin, laminin 5 and β1 integrin was comparatively analyzed in 2D monolayer cells and 3D spheroid in MDA-MB-231 cell line (Fig. 3G). When MDA-MB-231 cells growing in 3D Col-Tgel, cells spontaneously formed into spheroids and exhibit positive E-cadherin staining, which was resemble the morphology of xenograft derived from the same cell line and localized on the cell-cell contact surfaces within the clusters in the in vivo study. However, MDA-MB-231 cell expressed relatively less E-cadherin when cultured on the 2D monolayer even cells reached confluence. In addition, the cell-matrix adhesion molecule laminin was also expressed intensively by spheroid type of cells, and located on the outer layer of the spheroids. Again, laminin expression was reduced in the single cell and 2D culture. In contrast to E-cadherin and laminin, β1 integrin was expressed abundantly in the monolayer culture, but relatively less in the 3D culture. High level β1 integrin expression on cells revealed mesenchymal morphology but attenuated in the epithelia round shaped cells. These results suggested that cell morphology alteration in monolayer and 3D environment were dependent on extracellular matrix 3D microenvironment by accompanying with a loss or aberrant expression of adhesion molecules."
                    ],
                    "subsections": []
                },
                {
                    "title": "Heterogeneous Tumor Model Inducing Hypoxia",
                    "paragraphs": [
                        "After culture in the 3D gel for a few days, cancer cells on the periphery were seen to actively proliferate and developed spheroids while the innermost ones remained quiescent or necrotic (Fig. 4A and inserts). The sizes of tumor spheroids decreased from edge to center. When the distance is over 1000µm from edge, the cells were less proliferative as shown by active proliferation marker Ki67 staining (Fig. 4B). A large number of dead cells presented in a large void with no visible cell structures. To examine if this phenomenon resulted from decreasing nutrient diffusion and deprivation of oxygen at the dome center, we measured the oxygen concentrations using an oxygen probe. We found there was no difference in oxygen levels between gel and medium on the initial day. With increasing culture time, oxygen levels in Col-gel were lower than surrounding medium, and dropped significantly with the culture time (Fig. 4C). A hypoxic environment was observed around actively proliferating cells which voraciously consumed oxygen while forming a cellular barrier to prevent oxygen diffusion to the center. This feature was correlated with the avascular and hypoxic tumor microenvironment seen in in vivo."
                    ],
                    "subsections": []
                },
                {
                    "title": "Co-Culture Of Cancer Cells And Mesenchymal Cells To Mimic The Tumor Niche",
                    "paragraphs": [
                        "In vitro tumor models can be made more relevant by recruiting two or more cell types to study cell-cell interactions and cell-matrix interaction. A human squamous cell carcinoma line, SCC-71 and bone marrow derived mesenchymal stem cells were cultured separately or co-cultured together in the 3D Col-Tgel system (Fig. 5). SCC-71 cells formed spheroids in Col-Tgel after day 6. The multi-cell spheroids displayed borders in the gel without visible digestive rings. On the other hand, bone marrow derived mesenchymal stem cells exhibited another exclusive morphology in the gel. After 6 days of culture, cells presented stellate structure and seemed to dig tunnels appearing with light reflection in the gel. H&E staining of MSCs showed cells were separated from each other with elongated shape and degraded the surrounding gel environment leaving multiple clefts. When SCC-71 cells were co-cultured with MSC cells mixing homogenously at 1∶1 ratio on day 0, after 6 days, both cells maintained their distinctive morphologies. SCC-71 cells formed clusters with tight junctions while MSC cells kept as individual elongate shapes surround the tumor spheroids. When two types of cell were labeled with different colors of fluorescence (MSC green and SCC-71 red), chimera spheroids formation in orange color was observed. The exact dynamic and structure of chimera spheroids formation requires further characterization. Collectively, the Col-Tgel can create a tumor microenvironment to study cell-cell interaction between cancer cells and their associated cells in 3D model."
                    ],
                    "subsections": []
                },
                {
                    "title": "3D Model For Drug Test",
                    "paragraphs": [
                        "We further characterized the chemotherapy drug sensitivity in Col-Tgel 3D model. Taxol is a cytotoxic chemotherapeutic agent with proven clinical value in breast cancer. MDA-MB-231 cells cultured in 3D scaffolds demonstrated greater resistance than cells in 2D monolayer culture as shown by live/dead cell test (Fig. 6A) with IC50 = 1.897 µM for 2D and IC50 = 7.318 µM for 3D culture (Fig. 6B). Anti-mitotic drugs such as taxol were less effective in 3D culture at concentrations that were previously shown to cause apoptosis in monolayer culture."
                    ],
                    "subsections": []
                },
                {
                    "title": "Col-Tgel As A Carrier For Xenograft In Animal Model",
                    "paragraphs": [
                        "Xenograft tumors were induced using Col-Tgel as a carrier (Fig. 7A). Gel formed insoluble hydrogel subcutaneously at the injection site with tumor cells embedded. As shown in Fig. 7B, Gel structure was still clearly defined even after 7 days injection and blood vessels invasion was observed. Moreover, the size of tumors could be controlled by the injection volume of gel tumor (same cell density), where the osteosarcoma size by 200 µl of gel tumor was significantly larger than 100 µl after 28 days injection (Fig. 7 C–F). Two injection sides were close but tumor final mass did not fuse or intervene to each other. This observation suggested that the gel were capable to localized cell delivery. Importantly, early stage of tumor development and progression could be studies in the injected semi-enclosed gel environment. Histomicrograph of 7 day post-injection of breast cancer cell MDA-MB-231 clearly showed that tumor cells assembled into clusters ranging from 100 to 500 µm and disperse in the gel unevenly, where the center of gel had less clusters with smaller size while the peripheral region had larger and denser tumor cluster formation, similar to in vitro observations (Fig. 7 G–H). Interestingly, blood vessels clearly infiltrated into the gel at day 7 in response to tumor cells, providing nutrients together with host cells such as immune cells, inflammatory cells and mesenchymal stem cells to the tumor environment (Fig. 7 H, hollow arrow and blue arrow). Tumor development induced by Col-Tgel as a carrier was also tested for other tumor cells including breast cancer cell MDA-MB-231, colon cancer cell HCT116, and pancreatic cancer cell CFPAC-1. Representative tumor formation curves were shown in (Fig. 7I). Taken together, this gel carrier bioengineered tumor model may provide a tool box to study the orchestrated tumor formation and progression of events including types of cell participation, spatiotemporal signals molecules exchange between cells, and extracellular matrix protein deposition and degradation."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Col-Tgel is a tailorable collagen-based remodelable hydrogel system able to induce spheroid formation without the use of time and labor intensive protocols such as the hanging drop and linker-engineered method, sophisticated equipment like rotating wall vessel bioreactors, or special handling temperature to prevent self-assembly [35].",
                "In vitro 3D culture systems to induce spheroid tumor formation using synthetic, natural or hybrid materials have been extensively attempted [11], [12], [36]. Biocompatible materials such as agarose, methylcellulose, PMMA, PEG are structurally suitable to provide support for tumor spheroid formation, however, they lack cell adhesion and enzyme cleavage sites correlating in vivo tissue [5], [37], [38]. Previous studies reported that MDA-MB-231 cells failed to form spheroids and lacked E-cadherin expression when grown on semi-solid methylcellulose [7], [39]–[41], or in round bottom culture well coated with a poly-HEMA [42].These findings suggest that extracellular matrix, such as collagen fragments in Col-Tgel, are important for tumor spheroid formation. Invascu's work [43] demonstrated that type I collagen, but not fibronectin or type IV collagen, not only enhances, but also participates in MDA-MB-231 spheroid formation. Therefore, a biologically functional 3D scaffold is very crucial to simulate the tumor microenvironment. 3D scaffolds fabricated from ECM substrates such as Matrigel, type I collagen, laminin, and fibronectin are cell attachable and remodelable and are ideal materials to construct a tumor tissue scaffold. However, when used in their native purified form, they are unable to provide the wide spectrum of rigidity necessary to mimic normal and pathological conditions [44]. By using collagen peptides with an enzymatic crosslinking technique, Col-Tgel overcomes these limitations and appears suitable for in vitro and in vivo tumor engineering. Importantly, Col-Tgel offers handling flexibility through controlling the 3D construct size, shape, concentration, and crosslinking rate to achieve structural heterogeneity resemble in vivo tumor environment on many aspects, including nutrition diffusion and pH gradients, hypoxia environment, and mechanical restriction. By modulating these parameters according to the tumor progression state, it is possible to bioengineer 3D tumor in vitro to closely resemble cancer cells growing in the in vivo environment.",
                "Due to the transparent property of the Col-Tgel, we established imaging based assays to monitor cluster formation, cell morphology, delivery of chemotherapies, and cell migration and invasion across 3D constructs in real-time using optical or fluorescence microscopy. Our results suggested that spheroid tumors in the Col-Tgel closely resemble the avascular tumor nodular appearance, contained a necrotic core and proliferative rim in the outer layer, and mimicked the highly preoperative tumor cells located near nutrient rich capillaries in vivo [7]. Overall, Col-Tgel 3D architecture presents physiologically relevant characteristics of tumor cells and features simple and easy operation protocols to examine the multiple aspects of cancers.",
                "Col-Tgel is able to easily manipulate and implement a wide range of stiffness by altering the gel concentration and crosslinking units [45]–[49]. Recent studies indicates the powerful influence of biophysical properties, such as rigidity, porosity, density and geometry on cell fates [50]. Thus, physical stiffness of tumor environment may be simulated in an in vitro 3D setting to study cell proliferation, differentiation, apoptosis, senescence, and invasion behaviors by tailoring gel formulation [51]–[53]. To more accurately reproduce the tissue specific microenvironment, the matrix composition may be altered by adding different types of extracellular matrices into the Col-Tgel platform, such as various types of collagen (I-IV), adhesion molecules such as laminin, vetronectin, and fibronectin, and proteoglycans and glycoproteins [54]–[56]. For example, pancreatic tumor surrounds by dense fibrillar collagen while brain tumors generates a more amorphous matrix such as hyaluronic acid [57]–[62].",
                "The tumor stroma microenvironment comprises fibroblasts, adipocytes, inflammatory cells such as lymphocytes and macrophages and lymphatic and blood capillaries including pericytes and endothelial cells [63]. Therefore, cancer progression and metastasis depends on the crosstalk within the microenvironments [64]–[67]. However, tumor cells interactions with the extracellular matrix, other cell types, or the immune system is scant or completely absent in 2D monolayer culture. The 3D Col-Tgel system provides a platform for spatial organization of tissues and cell-cell interactions. In our study, we tested co-culture of tumor cells with bone marrow mesenchymal stem cells in a 3D gel. Regarding cell morphologies, the H&E staining demonstrated that both cell types preserve their phenotypic traits. Cancer cells maintained their epithelial morphology and formed spheroids, whereas MSC showed their typical spindle-shaped morphology. We also observed that the two types of cells formed chimera spheroids when labeled with different fluorescence probes, the exact cause and effect of such interactions still needs to be elucidated. Thus, it is possible to recreate some of the in vivo tumor niches under highly controlled and reproducible fashions to study tumor cell morphology, phenotype, metabolism and invasion in vitro by using co-cultures.",
                "Host cells infiltration into the 3D gel system was observed when delivering cancer cell for xenograft tumor induction. Col-Tgel forms a semi-enclosed system to prevent cancer cell diffusion, in the meanwhile, the cured gel acts as extracellular matrix to support surrounding cells infiltration and migration as they responding to the tumor cell signals. As a result, multicellular tumoroids are formed in situ followed by ECM remodeling at the injection site. We observed that angiogenesis occurred within 7 days, tumor nodular formation within 14 days and mature tumor development in 21–28 days. This new bioengineering tumor will provide us an opportunity to study early stage host cell response by characterizing spatial temporal events of host cell populations and signals exchange, to gain insight of cell-cell communication and their contribution to tumor progression.",
                "In conclusion, we developed a new bioengineering tumor model by using 3D ECM derived peptides in multiple well plates. It is easy to reproducible and cost-effective. The 3D model recapitulates key features of tumors in vivo including cell-cell interaction, cell-matrix interactions, and multicellualr architecture. This technology allows creating uniform and highly-reproducible bioengineering tumor for high-content screening of anticancer drugs."
            ],
            "subsections": []
        }
    ]
}