{
    "id": "US20180250377",
    "authors": [
        "George C. Stewart",
        "Brian Matthew Thompson"
    ],
    "title": "BACILLUS BASED DELIVERY SYSTEM AND METHODS OF USE",
    "date": "2018-04-27 00:00:00",
    "abstract": "Herein a Bacillus exosporium antigen delivery (BEAD) system that provides a means to introduce recombinant proteins or small molecules into the exosporium of members of the B. cereus family of bacteria, i.e. B. anthracis, B. cereus, and B. thuringiensis, is disclosed. The system results in the surface display of recombinant proteins or small molecules such that they can stimulate an immune response. In addition, methods of making and using the system are described.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a system suitable for the delivery of diagnostic, immunogenic, or therapeutic compositions to a host cell either in vivo or in vitro. The invention provides both compositions and methods of use relating to the system. The system utilizes sequences from Bacillus spp. glycoproteins to insert antigenic material or reporter proteins into the exosporium of a Bacilllus spore and carry the antigenic material or reporter protein to a target site as part of a delivery system."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Bacillus spore system"
                    ],
                    "num_characters": 504,
                    "outline_medium": [
                        "introduce Bacillus spore system"
                    ],
                    "outline_short": [
                        "introduce Bacillus spore delivery system"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Bacillus is a genus of rod-shaped bacteria. Ubiquitous in nature, Bacillus includes both free-living and pathogenic species. There are three important pathogenic members of Bacillus: B. cereus causes a foodborne illness similar to that of Staphylococcus; B. thuringiensis is an important insect pathogen, and is sometimes used to control insect pests; and B. anthracis causes anthrax in humans and animals. In humans, three types of anthrax occur: cutaneous, gastrointestinal, and pulmonary anthrax. Under stressful environmental conditions, these cells shift to an alternative developmental pathway, sporulation, and produce oval endospores that can stay dormant for extended periods. Bacillus anthracis is infectious in the endospore form.",
                        "Much of what is known of the sporulation process comes from genetic studies of the nonpathogenic Bacillus subtilis. Unlike the pathogenic Bacillus spp. above, B. subtilis does not have an exosporium layer on its exterior. This outermost layer of the endospore consists of a basal layer surrounded by an external nap of hair-like projections (see FIG. 1). Filaments of the hair-like nap are predominantly formed by the collagen-like glycoprotein BclA, while the basal layer is comprised of a number of different proteins.",
                        "Relatively little is known about the exosporium layer because of the difficulty in genetically manipulating the exosporium-containing species. Several proteins have been identified as being associated with the exosporium, or their loss is associated with defects in exosporium assembly. The components of the outer spore layers are thought to be produced in the mother cell and then assembled on the developing spore. Many of these components are expressed during the sporulation cycle by RNA polymerase bearing the σK sigma factor. Although the exosporium layer does not appear to be essential for virulence and does not confer the principal resistance properties to the spore, its location on the spore suggests that it plays a role in initial host-spore interactions. It is also an important source of spore antigens which may enhance the protective effect of current vaccines.",
                        "While spores of B. subtilis have been proposed as vaccine delivery vehicles using CotB and CotC fusion proteins, such a system is unlikely to function with the B. cereus family of bacteria, i.e. B. anthracis, B. cereus, and B. thuringiensis. These bacteria include the exosporium layer that is likely to prevent fusions to CotB or CotC from being exposed on the surface and available as delivery vehicles. Because anthrax, especially pulmonary anthrax, is an acute, fatal disease and may potentially be utilized as a bioterrorism weapon, a system to delivery immunogenic antigens or other therapeutic molecules effective against anthrax is desired. Herein, such a system is described."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe Bacillus genus",
                        "explain sporulation process",
                        "discuss exosporium layer",
                        "identify limitations of current vaccine delivery systems",
                        "motivate need for new delivery system"
                    ],
                    "num_characters": 2831,
                    "outline_medium": [
                        "describe Bacillus genus",
                        "discuss sporulation process"
                    ],
                    "outline_short": [
                        "describe Bacillus biology and limitations of current vaccine delivery systems"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The invention provides a Bacillus exosporium antigen delivery (BEAD) system suitable for delivering therapeutic, immunogenic, or diagnostic compositions to a subject. The system comprises a recombinant Bacillus cereus family member includes a fusion construct on the exterior of its exosporium. Fusion constructs comprise an immunogenic molecule and at least the first 24 amino acid residues of the N-terminal domain (NTD) of a Bacillus exosporium protein. A fusion construct is inserted into the exosporium such that the immunogenic molecule portion of the fusion construct is physically oriented to be able to stimulate an immune response.",
                        "A BEAD system of the invention may include a recombinant Bacillus cereus family member that has multiple fusion constructs on its exosporium. In such systems, one or more immunogenic molecules may be included such that a multivalent therapeutic effect may be achieved in a subject to whom the BEAD system is administered. Alternatively, a BEAD system may include multiple recombinant Bacillus cereus family members, each of which includes a single type of fusion construct on its respective exosporium. A combination of such multiple Bacillus cereus family members may be used in a BEAD system to achieve a multivalent therapeutic effect in a subject to whom the BEAD system is delivered.",
                        "Recombinant Bacillus cereus family members include strains of B. anthracis, B. cereus, B. thuringiensis, and combinations thereof. Strains of B. anthracis are preferred members. Inactivated strains are also preferred. Alternatively, nontoxic or genetically manipulated Bacillus cereus family members may be used. Preferably, recombinant B. cereus family member cultures are prepared separately then combined together after harvest. Alternatively, B. cereus family members may be prepared in combination with one another from the beginning.",
                        "Fusion constructs preferably include at least the first 35 amino acid residues of the N-terminal domain (NTD) of a Bacillus exosporium protein. Fusion constructs may even include complete Bacillus exosporium proteins. Preferred Bacillus exosporium proteins include Bacillus BclA, BclB, BAS3290 (BclE), and combinations thereof.",
                        "The invention also provides methods of making a BEAD system comprising constructing a fusion construct; cloning the fusion construct into a shuttle plasmid; and electroporating the shuttle plasmid containing the fusion construct into a Bacillus cereus family member such that the fusion construct is expressed on the family member's exosporium.",
                        "The invention further provides kits for a BEAD system comprising a recombinant Bacillus cereus family member expressing a fusion construct comprising an immunogenic molecule and at least the first 24 amino acid residues of the N-terminal domain (NTD) of a Bacillus exosporium protein, wherein the recombinant Bacillus cereus family member's exosporium expresses the fusion construct such that the immunogenic molecule is physically oriented to be able to stimulate an immune response. Preferred kits include an immunogenic molecule and at least the first 35 amino acid residues of the N-terminal domain (NTD) of a Bacillus exosporium protein.",
                        "Method of using a BEAD system are also provided. Such methods comprise administering to a subject a recombinant Bacillus cereus family member expressing a fusion construct, wherein the fusion construct comprises an immunogenic molecule and at least the first 24 amino acid residues of the N-terminal domain (NTD) of a Bacillus exosporium protein, in the recombinant Bacillus cereus family member's exosporium such that the immunogenic molecule of the fusion construct is physically oriented to be able to stimulate an immune response.",
                        "An “immunogenic molecule” means a recombinant protein, native protein, or artificial small molecule that stimulates an immune response in a subject. Preferably, an immunogenic molecule does not adversely effect a subject when administered.",
                        "Herein, a “subject” may be a human or animal. “Animal” refers to a fish, bird, or mammal. Preferably the animal is a mammal such as a cat, dog, ungulate (e.g. horse, zebra, donkey, cattle/bison, rhinoceros, camel, hippopotamus, goat, swine, sheep, giraffe, okapi, moose, deer, tapir, antelope, or gazelle), rodent (e.g. mice, rats, and other small, gnawing mammals), bat, bear, primate, or cetacean.",
                        "An “immune response” or “immunological response” means, but is not limited to, the development of a cellular and/or antibody-mediated immune response to the composition or vaccine of interest. Usually, an immune or immunological response includes, but is not limited to, one or more of the following effects: the production or activation of antibodies, B cells, helper T cells, suppressor T cells, and/or cytotoxic T cells, directed specifically to an antigen or antigens included in the composition or vaccine of interest. Preferably, the subject will display either a therapeutic or a protective immunological (memory) response such that resistance to new infection will be enhanced and/or the clinical severity of the disease reduced. Such protection will be demonstrated by either a reduction in number of symptoms, severity of symptoms, or the lack of one or more of the symptoms associated with the infection of a pathogen, and/or a delay in the of onset of symptoms.",
                        "Those of skill in the art will understand that the compositions disclosed herein may incorporate known injectable, physiologically acceptable sterile solutions. For preparing a ready-to-use solution for parenteral injection or infusion, aqueous isotonic solutions, e.g. saline or plasma protein solutions, are readily available. In addition, the compositions of the present invention can include diluents, isotonic agents, stabilizers, or adjuvants.",
                        "“Diluents”, as used herein, can include water, saline, dextrose, ethanol, glycerol, and the like. “Isotonic agents” can include sodium chloride, dextrose, mannitol, sorbitol, and lactose, among others. “Stabilizers” include albumin and alkali salts of ethylendiamintetracetic acid, among others.",
                        "Herein, an “adjuvant” or “adjuvants” can include aluminum hydroxide and aluminum phosphate, saponins e.g., Quil A, QS-21 (Cambridge Biotech Inc., Cambridge Mass.), GPI-0100 (Galenica Pharmaceuticals, Inc., Birmingham, Ala.), non-metabolizable oil, mineral and/or plant/vegetable and/or animal oils, polymers, carbomers, surfactants, natural organic compounds, plant extracts, carbohydrates, water-in-oil emulsion, oil-in-water emulsion, and water-in-oil-in-water emulsion. The emulsion can be based in particular on light liquid paraffin oil (European Pharmacopeia type); isoprenoid oil such as squalane or squalene; oil resulting from the oligomerization of alkenes, in particular of isobutene or decene; esters of acids or of alcohols containing a linear alkyl group, more particularly plant oils, ethyl oleate, propylene glycol di (caprylate/caprate), glyceryl tri-(caprylate/caprate) or propylene glycol dioleate; or esters of branched fatty acids or alcohols, in particular isostearic acid esters. The oil is used in combination with emulsifiers to form the emulsion. The emulsifiers are preferably nonionic surfactants, in particular esters of sorbitan, mannide (e.g. anhydromannitol oleate), glycol, polyglycerol, propylene glycol, and oleic, isostearic, ricinoleic or hydroxystearic acid, which are optionally ethoxylated, and polyoxypropylene-polyoxyethylene copolymer blocks, in particular the Pluronic products, especially L121. (See Hunter et al., The Theory and Practical Application of Adjuvants (Ed.Stewart-Tull, D. E. S.), JohnWiley and Sons, NY, pp51-94 (1995) and Todd et al., Vaccine 15:564-570 (1997).",
                        "Compositions of the invention also can include one or more pharmaceutical-acceptable earners. Herein, “pharmaceutical-acceptable carrier” or “veterinary-acceptable carrier” include any and all solvents, dispersion media, coatings, stabilizing agents, growth media, dispersion media, cell culture media and cell culture constituents, coatings, adjuvants, diluents, preservatives, antibacterial and antifungal agents, isotonic agents, adsorption delaying agents, and the like.",
                        "“Administering” or the “administration of” a composition of the invention means delivery of a composition of the invention to a subject by any accepted means in the art. Such appropriate means of administration include intravenous, intraarterial, intraperitoneal, intramuscular, subcutaneous, intrapleural, topical, or by inhalation. The appropriate means of administering a composition of the invention to a subject will be dependent upon the specific objective to be achieved (e.g. therapeutic, diagnostic, preventative) and the targeted cells, tissues, or organs.",
                        "Herein, “effective dose” means, but is not limited to, an amount of a composition of the invention that elicits, or is able to elicit, an immune response that yields a reduction of clinical symptoms in a subject to which the antigen is administered.",
                        "“Isolated” means altered “by the hand of man” from its natural state, i.e., if it occurs in nature, it has been changed or removed from its original environment, or both. For example, a polynucleotide or polypeptide naturally present in a living organism is not “isolated,” but the same polynucleotide or polypeptide separated from the coexisting materials of its natural state is “isolated”, as the term is employed herein.",
                        "Other objects, features and advantages of the present invention will become apparent from the following detailed description. It should be understood, however, that the detailed description and the specific examples, while indicating preferred embodiments of the invention, are given by way of illustration only, since various changes and modifications within the spirit and scope of the invention will become apparent to those skilled in the art from this detailed description."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce BEAD system",
                        "describe fusion construct",
                        "explain insertion of fusion construct",
                        "discuss multivalent therapeutic effect",
                        "describe recombinant Bacillus cereus family members",
                        "identify preferred strains",
                        "discuss inactivated strains",
                        "explain preparation of recombinant cultures",
                        "describe fusion construct components",
                        "identify preferred Bacillus exosporium proteins",
                        "explain method of making BEAD system",
                        "describe kits for BEAD system",
                        "explain method of using BEAD system",
                        "define immunogenic molecule",
                        "define subject",
                        "define immune response",
                        "discuss composition preparation",
                        "identify diluents, isotonic agents, and stabilizers",
                        "discuss adjuvants"
                    ],
                    "num_characters": 9916,
                    "outline_medium": [
                        "introduce BEAD system",
                        "describe fusion construct",
                        "outline recombinant Bacillus cereus family members",
                        "discuss multivalent therapeutic effect",
                        "describe methods of making BEAD system",
                        "outline kits for BEAD system",
                        "describe methods of using BEAD system",
                        "define immunogenic molecule",
                        "define subject and immune response"
                    ],
                    "outline_short": [
                        "introduce BEAD system for delivering therapeutic compositions",
                        "describe fusion construct and its insertion into exosporium",
                        "outline methods of making and using BEAD system",
                        "summarize kits and methods of using BEAD system"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The use of Bacillus endospores as a delivery vehicle has shown promise as a means of amplifying the magnitude and scope of the immune response to specific antigens. But, a procedure to efficiently localize foreign immunogenic proteins to the outer layers of exosporium-containing Bacillus spores has not been defined to date. Herein, are identified sequences of the BclA and BclB glycoproteins responsible for the insertion of these proteins into the exosporium layer of the spore. These sequences can be used as targeting domains to incorporate reporter proteins or antigens onto the spore surface. As such, herein is described a Bacillus exosporium antigen delivery (BEAD) system that provides a means to study the mechanisms of spore maturation in this important select agent pathogen. Furthermore, this novel delivery system can be exploited to incorporate foreign proteins into the exosporium of B. cereus family of bacteria, i.e. B. anthracis, B. cereus, and B. thuringiensis, resulting in the surface display of recombinant immunogens such as proteins or small molecules. In particular, the BEAD system described herein may be useful in combating exposure to pathogenic strains of B. anthracis by providing a means to deliver vaccines or other therapeutic compounds.",
                        "Identification of Domains Important in Protein Incorporation into the Exosporium",
                        "Two collagen-like glycoproteins, BclA and BclB, have been shown to be surface exposed on spores of B. anthracis. The BclA and BclB are found in the exosporium layer of B. anthracis spores. The protein BclA is the major constituent of the surface nap and has been shown to be attached to the exosporium with its N terminus positioned at the basal layer and its C-terminus extending outward from the spore. BclA extracted from spores has been shown to lack its N-terminal 19 amino acids, which suggests that a proteolytic event is involved in the incorporation of this protein into the exosporium. The mechanisms by which BclA and BclB are incorporated into the exosporium are unknown. Herein, sequences at the N-terminus of these Bcl proteins that are sufficient for the incorporation of the proteins into the exosporium have been identified. Additional proteins are encoded in the B. anthracis genome with collagen-like triplet amino acid repeats. These determinants possess sequences resembling σK promoter elements, and each is expressed during the sporulation phase of the B. anthracis life cycle. The N-termini of these proteins possess interesting sequence similarities (FIG. 2A).",
                        "The N-terminal domains of BclA and BclB allow for the targeting and incorporation of these proteins into the exosporium of B. anthracis. The BclA N-terminal domain comprises an 11 amino acid conserved motif, SEQ ID NO: 11, described herein and a 24 amino acid N-terminal region that contains a putative proteolytic cleavage site. A suggested role of the conserved motif is as a potential recognition site that leads to the positioning of the proteins to their appropriate target sites within the exosporium layer, but the attachment of proteins relies on more N-terminal sequences. Interestingly, addition of only 5 additional amino acids to the conserved motif (amino acids 20-24) allows for efficient localization and attachment of proteins, suggesting a role for those 5 amino acids in attachment of BclA to the exosporium. Removal of the conserved motif (but retention of the N-terminal amino acid sequence) leads to poor incorporation of the fusion proteins into the exosporium. The low level of incorporation observed may result from reduced positioning of the proteins at their sites of incorporation (limited fluorescence targeted to the exosporium of developing spores), but those proteins that are aligned properly get incorporated. The role of the proteolytic cleavage event has yet to be elucidated, but the data suggest that removal of the N-terminus prior to the putative cleavage site does not lead to a change in the level of protein incorporation into the exosporium. If a cleavage event is required for incorporation of BclA, the single methionine residue upstream of the cleavage site is sufficient for cleavage to occur. Alternatively, no cleavage event is required for exosporium incorporation and the cleavage event may be involved in release of the protein from the spore.",
                        "The process of assembly and attachment of BclA and BclB has not been described in detail to date. It is known that the BxpB (also called ExsFA) protein is involved directly or indirectly in the assembly of BclA on the surface of the exosporium, as bxpB mutant spores do not contain a BclA-coated nap. The N-terminal domains of BclA and BclB are responsible for the targeting and incorporation of these proteins into the exosporium of B. anthracis. FIGS. 10A-10E represent a model for the maturation and assembly of BclA into the exosporium. Production of BclA protein occurs early in sporulation, before the spore is visible within the mother cell by phase contrast microscopy (FIG. 10A). Soon thereafter, BclA localizes to the pole of the endospore facing the mother cell compartment (FIG. 10B). The BclA fusion protein begins to localize from the tip of the pole of the spore to encompass the newly formed exosporium basal layer around the spore (FIG. 10C). This localization is dependent on the presence of the conserved motif, amino acids 25-35 of BclA. Loss of this motif leads to greatly diminished BclA localization and subsequently poor incorporation. The pattern of initial exosporium development is consistent with previous studies, suggesting that exosporium assembly initiation is spatially regulated in the sporulating cell. This nap assembly pattern is presumably due to positioning of a protein or protein complex in the basal layer that recognizes the conserved motif in BclA. Fusions containing only the conserved motif localize to the mother cell center-facing pole of the spore. The motif only fusion localizes in a pattern following the newly formed basal layer across the spore, but this fusion is released at a time corresponding to the cleavage event. Because this fusion construct lacks the N-terminal cleavage site, it cannot be process and is not stably incorporated.",
                        "Maturation of the exosporium basal layer and the beginning of nap assembly occur at the same pole as that involved in the initiation of basal layer assembly. This initial localization of BclA is to an area smaller than the described ‘cap, suggesting that the cap in exsY mutant spores results from a stalling in the progression of the exosporium development, rather than a broader initial deposition of BclA. It is proposed herein that the conserved domain is a localization domain that is recognized by an exosporium protein or complex that positions BclA for subsequent cleavage and incorporation.",
                        "Subsequent to positioning of BclA around the spore, cleavage of the N-terminal domain after residue 19 occurs concomitantly with stable incorporation of the protein into the exosporium (FIG. 10D). This cleavage event follows the localization of BclA around the spore from one pole to the other (FIG. 10E). Fusion constructs that contain a ‘precleaved’ N-terminus both localize and attach efficiently to the exosporium. This may indicate that the cleavage event per se is not required for the actual incorporation, but may create the proper substrate for the incorporation event. Studies are underway to determine if the N-terminal methionine residue is removed during incorporation, which would suggest a requirement for the proteolytic event.",
                        "Correct localization of the proteins in the exosporium driven by the N-terminal domain (NTD) alone suggests that recognition of the N-terminal sequence is key in the nap assembly process. Glycosylation of the collagen-like repeat region of BclA and the trimerization of the BclA protein owing to the presence of these repeats do not appear to be necessary for recognition and incorporation of BclA into the exosporium.",
                        "BclB is produced in lower quantities in the mother cell in comparison with BclA. Expression of BclB under the more active bclA promoter allows for incorporation of BclB fusions into the exosporium. However, the pattern of incorporation differs from the uniform distribution observed with the BclA fusions. Differences in the N-terminal amino acid sequences may result in interactions with a different set of exosporium proteins, which may account for the different localization results."
                    ],
                    "subsections": [
                        {
                            "title": "Exploitation of the Targeting Domains as a Bacillus Exosporium Antigen Delivery (BEAD) System",
                            "paragraphs": [
                                "During the sporulation process in Bacillus, spores are assembled with the outermost spore layers deposited last. The BclA glycoprotein is the predominant protein on the exosporium nap layer. This exosporium surface protein is expected to be among the last of the spore proteins to be incorporated into the spore. Data herein show that the N-terminal domains of the BclA and BclB proteins are sufficient for localization to the exosporium surface and that efficient expression on the spore surface is also dependent on the timing or levels of expression during sporulation. Amino acid sequences distal to the first 35 amino acids of the BclA protein are not required for surface localization on spores and can be replaced with foreign protein sequences or other small molecules that can be incorporated into fusions of the types described herein.",
                                "Use of the Bacillus exosporium antigen delivery (BEAD) system is expected to allow for high expression of foreign proteins or other small molecules in the endospore of B. anthracis and other BclA-containing Bacillus species (e.g. B. cereus and B. thuringiensis). The amount of incorporation surpasses that of recombinant proteins expressed on B. subtilis spores using the CotB/C systems. Advantageously, the ability of B. anthracis spores to illicit an immune response has been well characterized, and combining this ability with the inherent stability of the spores, provides a promising platform for the delivery of recombinant antigens or other small molecules.",
                                "The BEAD system has implications for the development of potentially better and safer vaccines against anthrax and other biothreat agents. Important immunogens, such as B. anthracis protective antigen, could be expressed on the surface of an anthrax spore or a spore from another B. cereus family member using any of the methods detailed herein. Herein, the BEAD system is demonstrated using well-known reporter proteins and a well-characterized antigen of viral origin. It is expected that any suitable antigen or small molecule may be recombined using the methods herein. Suitable antigens or small molecules are those that are known or expected to illicit a desired immune response that is sufficient to yield a therapeutic or protective effect when expressed on the exterior of a Bacillus spore. Suitability in large part will be determined by the folding in the three-dimensional structure once the recombinant antigen is incorporated into the exosporium, i.e. the antigenic portion(s) of the recombinant molecule must be available for detection by the immune system.",
                                "Preferably, spores used in the system are inactivated such that they cannot germinate. Exposure to ultraviolet (UV) radiation is a preferred method of inactivating spores; however, any of the compatible, inactivation methods known in the art may be used. Alternatively, spores derived from nontoxigenic strains, or genetically or physically inactivated strains, could be developed as part of a delivery system against anthrax. This system would provide the important protective antigen immunogen without the problems associated with residual toxicity and would have the additional advantage of providing spore-associated antigens that have been shown to provide enhanced protection against anthrax in animal models of infection. Furthermore, use of a recombinant spore as a delivery platform for therapeutic compositions provides adjuvant effects leading to both Th1 and Th2 immune responses, a feature not achieved with the current AVA vaccine. Lastly, expression of additional proteins, especially recombinant proteins, on the spore surface, for example; surface proteins from other biothreat agents, bacteria, viruses, or other pathogens could lead to the development of multivalent vaccines or therapeutic compositions against a variety of pathogens. Such vaccines or therapeutic compositions may suitable for use in man or animal.",
                                "Unless defined otherwise, all technical and scientific terms used herein have the same meaning as is commonly understood by one of skill in the art to which this invention belongs at the time of filing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe use of BEAD system for high expression of foreign proteins",
                                "describe advantages of BEAD system over CotB/C systems",
                                "describe potential for development of better and safer vaccines",
                                "describe use of BEAD system for expression of protective antigen",
                                "describe suitability of antigens for use in BEAD system",
                                "describe inactivation of spores for use in BEAD system",
                                "describe potential for development of multivalent vaccines",
                                "describe adjuvant effects of BEAD system"
                            ],
                            "num_characters": 4125,
                            "outline_medium": [
                                "describe use of BEAD system for high expression of foreign proteins",
                                "discuss advantages of BEAD system over CotB/C systems",
                                "propose use of BEAD system for development of vaccines against anthrax and other biothreat agents",
                                "discuss suitability of antigens or small molecules for use in BEAD system"
                            ],
                            "outline_short": [
                                "describe use of BEAD system for high expression of foreign proteins",
                                "discuss implications of BEAD system for vaccine development"
                            ]
                        },
                        {
                            "title": "Examples",
                            "paragraphs": [
                                "The following examples are included to demonstrate preferred embodiments of the invention. It should be appreciated by those of skill in the art that the techniques disclosed in the examples which follow represent techniques discovered by the inventors to function well in the practice of the invention, and thus can be considered to constitute preferred modes for its practice. However, those of skill in the art should, in light of the present disclosure, appreciate that many changes can be made in the specific embodiments which are disclosed and still obtain a like or similar result without departing from the spirit and scope of the invention.",
                                "**Experimental Procedures**",
                                "**Growth Conditions**",
                                "Bacillus anthracis strain ASterne-1 was a gift from Dr. S. H. Leppla (National Institutes of Health, Bethesda, Md.). ASterne-1 is a strain derived from Sterne and lacks pXO1 and pXO2 (capsule- and toxin-negative). Sporulation was induced by growth on nutrient agar plates at 30° C. or in liquid culture using modified G Broth. Growth in liquid culture was monitored by absorbance at 600 nm. Sporulation was essentially complete (>95%) after 72 hours on nutrient agar plates. The degree of sporulation was assessed by phase contrast microscopy. Spores were harvested from 7-day old nutrient agar plates to ensure complete sporulation, washed 3 times in PBS, and stored at room temperature.",
                                "**Creation of Fusion Constructs**",
                                "Fusion constructs were created by polymerase chain reaction (PCR) amplification followed by splicing by overlapping extension as used in the art (see for example, Ho, et al., Gene 77: 51-59 (1989) and Horton, et al., Gene 77: 61-68 (1989)). Primers utilized in the PCR reactions are listed in Tables 1a and 1b. Correct fusions contained intact promoter regions including σK elements, as well as native RBS and start codons. Fusion constructs were then subcloned into the shuttle plasmid pMK4 (see Sullivan et al., 1984), followed by electroporation into the ASterne strain of Bacillus anthracis. Selection of electrotransformed cells was on tryptic soy agar plates containing chloramphenicol at 10 μg/ml. Verification of the correct identify of the plasmids in the transformed cells was accomplished by antibiotic selection, followed by DNA extraction and plasmid DNA sequencing from vegetative cells.",
                                "**Spore Analysis by Flow Cytometry**",
                                "Ten miligrams of spores were resuspended in 500 μl of 4% paraformaldehyde in PBS and incubated for 2 hours at room temperature. The spores were then washed four times with PBS and resuspended in StartingBlock (Pierce) and incubated with mixing at room temperature for 45 minutes. The spores were then pelleted and resuspended in StartingBlock. Rabbit polyclonal antiserum (1:250 dilution) against rBclA was then added and incubated with mixing at room temperature for 45 minutes. The spores were then washed three times in StartingBlock PBS and then incubated with mixing with FITC-Protein A conjugate (Sigma Chemical Co.) and incubated for 45 minutes at room temperature. The spores were then washed three times with StartingBlock, followed by two washes with PBS and then processed on a FACScan flow cytometer using a 488 nm argon laser (Beckton Dickinson Biosciences). Data were analyzed using Cell Quest analysis software (Beckton Dickinson).",
                                "**Micrograph Images**",
                                "Samples from sporulating cells on nutrient agar plates or in modified G broth were collected at indicated intervals and diluted in 10 μl of PBS containing DABCO (Diazabicyclooctane, Acros Organics) anti-fade reagent. All images were obtained using a Nikon E600 epi-fluorscence microscope using a 60× or 100× oil immersion objective.",
                                "**Transmission Electron Microscopy**",
                                "Immunogold labelling of embedded spores was performed after fixation of spores in a 2% glutaraldehyde and 2% formaldehyde PBS solution. Spores were embedded in 3% agar (EM Science, Gibbstown, N.J.). Dehydration involved sequential treatment with 25%, 50%, 75%, 95% and 100% acetone. Polymerization was carried out at 60° C. in Epon/araldite resin. Sections were cut at 85 nm thickness and put on 200-mesh carbon-coated copper grids; the cut grid sections were blocked in a 1% BSA solution for 30 min. The grids were washed three times in PBS, and the primary antibodies were added to the grids at a concentration of 1:25 in incubation buffer (Aurion). One hour later, the grids were washed six times in incubation buffer and incubated with 1:25 goat antirabbit secondary conjugated with 10 or 20 nm colloidal gold beads and allowed to bind for 2 hours. After a series of washes in PBS, the grids were post-fixed in 2% glutaraldehyde on 0.1 M PBS for 5 min and finished with washes in PBS and distilled water. Samples were examined with a JEOL 1200EX electron microscope.",
                                "**Example 1: The BclA Protein Contains an N-Terminal Exosporium Targeting Domain**",
                                "Given that the BclA protein associates with the exosporium via its N-terminus, this N-terminal conserved sequence, SEQ ID NO: 11 (see FIG. 2A), was investigated for the possible targeting of BclA and other collagen-like proteins to the exosporium.",
                                "To determine if the N-terminal domain of BclA is sufficient to target the native protein to the exosporium, two gene fusions were generated to the eGFP fluorescent reporter. PCR amplification of the upstream promoter/regulatory sequences of bclA and including the N-terminus coding sequence through the conserved motif or the entire bclA coding sequence was performed. These PCR products were then spliced with the eGFP reporter gene to produce in-frame fusions (FIG. 2B). The DNA constructs were subcloned into the pMK4 shuttle plasmid using known techniques (see Sullivan et al., 1984) and introduced into the plasmid-free ASterne strain of B. anthracis by electroporation. Transformants were either induced to sporulate in synchronized modified G Broth or grown in brain-heart infusion broth overnight and induced to sporulate by culturing on nutrient agar plates at 30° C. for 3 days. Expression of the reporters was examined by epi-fluorescence microscopy.",
                                "The transformed cells containing the BclA ORF fusion (pBT1742) or N-terminal domain (NTD) fusion (pBT1744) did not express the eGFP reporters during exponential growth (FIG. 3A), which is consistent with the known expression pattern shown by gene array analysis (see Bergman et al., 2006). As the cells expressing the fusions transitioned into stationary phase with the concomitant physiological shift to the sporulation process, fluorescence appeared throughout the mother cell cytoplasm (FIG. 3B). Two hours into stationary phase (T2), BclA is expressed and translated, before a visible spore is formed in the mother cell (FIGS. 3B and 3G). The developing spore surface does not appear to be initially enriched for this reporter fusion protein during the early phases of visible spore development, with the emergent spore evident as a darkened area in the sporulating cell and with no enhanced fluorescence around the spore periphery (FIG. 3B). Synthesis of the fusion protein thus appears to be temporally distinct from incorporation into the exosporium. One hour later (T3), a small amount of enhanced fluorescence became evident at one pole of the spore periphery (FIG. 3C). The initial polar localization of the BclA fusion was oriented towards the mother cell compartment, away from the pole of the mother cell, which is consistent with reports that the exosporium is initiated at this point (Ohye and Murrell, 1973; Steichen et al., 2007). As stationary phase progresses into the fourth hour (T4), this area of fusion protein incorporation at one pole expands around the pole (FIG. 3D). At T6, the exosporium is formed making its way around the spore (FIG. 3E), which was accompanied by a corresponding decrease in cytoplasmic fluorescence, presumably marking the incorporation of the fusion constructs into the exosporium (FIG. 3E). Shortly thereafter, at T7, the incorporation of the fusion into the exosporium was complete. The cytoplasm of the mother cell lost its fluorescence while the surface of the spore retained fluorescence (FIG. 3K). This loss of cytoplasmic fluorescence presumably resulted from deposition of the protein on the spore surface, leakage of the fusion protein from the cell, degredation of the fusion protein or a combination of these events. Examination of the spores at 10 hours into stationary phase (T10) revealed the presence of released, highly fluorescent spores (FIG. 3L). A representative growth curve is presented in FIG. 3O. T0 denotes the point of entry into stationary phase.",
                                "For comparison, the BclA N-terminal domain fusion (pBT1744) was compared with a second constructed fusion consisting of the entire bclA open reading frame fused to the eGFP reporter gene (pBT1742, FIG. 2B). This fusion encoded by pBT1742 localized and attached to the spore surface at identical time points and distribution as the BclA N-terminal fusion encoded by pBT1744 (FIGS. 4A-4J). This result suggests that the N-terminal domain alone is sufficient for localization and incorporation of the BclA protein onto the spore surface.",
                                "**Example 2: N-Terminal Amino Acids Required for Exosporium Incorporation**",
                                "BclA released from spores lack its N-terminal 19 amino acids (Sylvestre et al., 2002; Steichen et al., 2003). It is unknown whether the proteolytic event resulting in the loss of these N-terminal residues takes place during exosporium assembly and BclA incorporation, or occurs after BclA has been stably inserted into the exosporium layer. To determine whether these initial N-terminal amino acids are required for efficient incorporation into the exosporium, a third fusion (pBT1750) was constructed, containing the bclA promoter region, RBS, through the bclA initiation codon followed by the the coding sequence for amino acids 20-35 of BclA fused to the eGFP coding sequence (see FIG. 2B). This construct mimics the spore-extracted form of BclA (differing only by the presence of the N-terminal methionine residue), and allows for examination of the role of the truncated N-terminus in incorporation of BclA (FIG. 4K-4O). The pBT1750-expressing cells mirrored the pBT1742 and pBT1744 fusion cultures in their pattern of fluorescence incorporation and timing, suggesting that the initial 19 amino acids are not necessary for localization of BclA into the exosporium.",
                                "To quantify the relative fusion incorporation levels, a direct comparison of the fluorescence associated with each spore type was undertaken by flow cytometry. All three fusions, (spores containing pBT1744, pBT1742, and pBT1750 fusions) localized to the spore surface to similar degrees (FIG. 4P). Greater than 97% of the spores for all three fusions were positive for fluorescence (Table 2). The mean positive fluorescence (MPF) for the purified, paraformaldehyde-fixed spores was 767 for pBT1744, 817 for pBT1742, and 528 for pBT1750. These data suggest that the N-terminal domain of BclA is not only sufficient, but as efficient as the intact BclA protein in targeting the reporter protein to the spore surface and its stable incorporation of the protein onto the spore. The loss of the N-terminal 19 amino acids did not greatly affect the incorporation of BclA, as only a modest decrease in the amount of fluorescence was seen in the pBT1750-containing spores.",
                                "**Example 3: Cleavage of the N-Terminal Domain Associates with Incorporation of BclA into the Exosporium**",
                                "The attachment of the pBT1750-encoded fusion implied that the truncated BclA can be recognized and attached to the exosporium. To address the question of whether cleavage of the intact BclA N-terminal domain occurs during exosporium formation, a dual reporter fusion construct was made. The pBT1758-encoded fusion consists of the bclA promoter followed by the mCherry monomeric reporter gene (Shaner et al., 2005; Giepmans et al., 2006) fused in frame to the BclA N-terminal domain that was in turn fused in frame to the GFPuv reporter (FIG. 5A). This fusion allows for the analysis of cleavage in the N-terminal domain (NTD) by appearance of separation between the red fluorescence and green fluorescence of the reporter proteins.",
                                "Similar to the findings with the single-reporter fusions, the pBT1758 fusion appeared in the mother cell cytoplasm prior to the appearance of the emerging spore (FIGS. 5B and 5H). The orange fluorescence (rather than yellow) likely resulted from a more intense red fluorescence of the mCherry fusion relative to monomers of the green GFPuv reporter protein in this fusion (Shaner et al., 2005). Soon thereafter, the fusion localized to the spore periphery, as demonstrated by the orange rings, localizing around the pole of the emerging spore (FIGS. 5C and 5I). At subsequent time points, the developing orange fluorescence continued to envelop the spore, followed by the putative cleavage event. This cleavage event results in the release of bound mCherry and subsequent emergence of a green spore (FIGS. 5D, 5E, 5J and 5K). The reduction in the local concentration of mCherry, combined with the enrichment of GFPuv fluorescence at the spore periphery resulted in production of yellow fluorescence (FIGS. 5D, 5E, 5J and 5K). Progression of cleavage around the spore surface released increasing concentrations of the mCherry reporter with the NTD 19-amino-acid tail attached to its C-terminus into the mother cell cytoplasm. However, the GFPuv reporter, by virtue of its attachment to the C-terminus of BclA amino acids 20-35, became stably attached to the spore surface (FIGS. 5E and 5F). Completion of the cleavage events (yellow fluorescence reaching the distal pole of the spore) coincided with the definitive appearance of the spore in the bright field images (FIGS. 5E and 5K). The cleavage events trailed the positioning of BclA at the exosporium (as demonstrated in FIGS. 3A-3O) from the mid-mother cell-facing pole of the spore to its completion at the opposite pole (FIGS. 5E and 5K). Fluorescence of the released mCherry reporter quickly faded, as the cleaved mCherry fusion protein appeared either to be unstable inside the mother cell, or was rapidly lost from the cytoplasm during initial stages of mother cell lysis (FIGS. 5F and 5L). The released spores retained their incorporated green fluorescence (FIGS. 5G and 5M).",
                                "The systematic cleavage of the reporter fusions at the site of the exosporium assembly demonstrated the difference in timing between the positioning of the BclA protein at the exosporium and the cleavage event. No discernable red or orange fluorescence was observed in the released spores, demonstrating a correlation of the cleavage event with the final incorporation of BclA into the exosporium. Therefore, the loss of the N-terminal residues of BclA results from events related to exosporium synthesis and not subsequent release of BclA.",
                                "**Example 4: Reporter Oligomerization is not Required for Exosporium Incorporation**",
                                "The interwinding of the individual native BclA molecules to form a triple helix in wild-type spores is made possible by interactions among the C-terminal domains of the BclA monomers (Boydston et al., 2005). The ability of pBT1744 and pBT1750 fusions, lacking both the C-terminal domain of BclA and the collagen-like region (CLR) with its associated glycosylation sites (Daubenspeck et al., 2004), to localize to the exosporium suggests that neither oligomerization of proteins nor glycosylation of the CLR are essential for incorporation of proteins into the exosporium of B. anthracis. Although not essential, oligomerization of proteins may be beneficial in localization to the exosporium. Two additional constructs were made that contained the BclA protein sequence from pBT1744, but fused to the GFPuv reporter (pBT1693) or DsRed (pBT1694, FIG. 2B). The GFPuv reporter has a natural propensity to dimerize under physiological conditions, and the DsRed reporter protein obligately tetramerizes (Yang et al., 1996; Baird et al., 2000). The pBT1693 and pBT1694 constructs (FIGS. 6A-6J) displayed expression kinetics and fluorescent distribution profiles similar to the eGFP fusions (FIGS. 3A-3O and 4A-4P). In all cases, fluorescence appeared initially after sporulation had commenced followed by an increased concentration of the fluorescent reporter around the spore periphery (FIGS. 6A-6C, 6F-6H). The complete loss of cytoplasmic fluorescence in the pBT1694-containing sporulating cells prior to spore release may signify a more complete incorporation of the fusion proteins into the exosporium. A delay in the spore release of the pBT1694-encoded fusion cells was observed. The DsRed self-association of this tetramerizing protein (Baird et al., 2000) may form a tight shell around the spores and mask structures or interfere with natural processes that trigger spore release from the mother cells. After lysis of the mother cells, released spores retained surface-associated fluorescence (FIGS. 6D, 6E, 6I, and 6J).",
                                "To eliminate the possibility that the reporter proteins bind non-specifically to the exosporium, a control fusion was constructed. DsRed was expressed under the control of the bclA promoter and ribosome binding site (RBS) but without any of the bclA N-terminal coding sequence (pBT1729; FIG. 2B). Although containing identical promoter and RBS elements as the aforementioned constructs, the pBT1729-containing cells exhibited diminished fluorescence in the cytoplasm, suggesting that the DsRed protein without the N-terminal BclA sequence had a substantially shorter half-life in the sporulating cells. A similar observation was made with the mCherry reporter (a derivative of DsRed) of the pBT1758 fusion (FIGS. 5A-5M). However, the DsRed in the pBT1729-containing cells did not concentrate around the periphery of the spore (FIGS. 6K-6M) and the released spores were not fluorescent (FIGS. 6N and 6O). Thus, the labelling of the spores by the reporter fusions appeared not to be the result of non-specific binding of the reporter proteins to the spore surface.",
                                "**Example 5: Contributions of the Conserved Motif and N-Terminal Sequences to Exosporium Incorporation of Reporter Proteins**",
                                "To determine if the conserved motif sequence identified in FIG. 2A was required for attachment of the fusion proteins to the spore surface, fusion constructs were created that either contained the BclA N-terminal sequence lacking the conserved sequence (SEQ ID NO: 11; pBT1701), or contained only the conserved motif, SEQ ID NO: 11, fused to DsRed (pBT1720, FIG. 2B). The pBT1701-encoded fusion protein without the conserved motif exhibited a reduced concentration around the spore periphery, no polar localization, and maintained cytoplasmic fluorescence up to the time of spore release. Only modest levels of fluorescence were detected on released spores (FIGS. 6P-6T). Thus loss of the conserved N-terminal BclA sequence resulted in a diminished exosporium incorporation of the fusion protein.",
                                "The pBT1720-encoded fusion protein, consisting of the conserved motif alone fused to DsRed, but lacking the rest of the BclA initial N-terminal residues (residues 2-24, which includes the proteolytic cleavage site), concentrated around the spore periphery quickly after being expressed with a corresponding decrease in cytoplasmic fluorescence. However, released spores were devoid of fluorescence (FIGS. 6U-6Y). Thus the presence of only the conserved motif resulted in the fusion protein being targeted to the spore periphery, but was insufficient to allow attachment of the protein to the mature exosporium. It was observed that localization of the motif-only fusion followed the normal progression of NTD localization oberved with the pBT1744-encoded fusion (mother cell proximal pole to the mother cell distal pole), but stable incorporation failed to occur and the fusion was lost from the spores (FIGS. 6U-6W). The BclA N-terminal 24 amino acids missing in this fusion protein contain the site for the proteolytic cleavage event that may be involved in the attachment of BclA to the exosporium. Optimal localization and attachment of BclA to the maturing exosporium is dependent upon the conserved motif, whereas the ultimate attachment of BclA requires the N-terminal cleavage event.",
                                "To quantify the level of incorporation of each of the DsRed-containing fusion constructs into the released spores, flow cytometry was performed on purified, paraformaldehyde-fixed spores (FIG. 7 and Table 2). The DsRed fluorescence of the spores bearing the intact BclA Nterminal 35 amino acid sequence (pBT1694) was 6.2-fold greater than all other DsRed-containing fusion constructs (FIG. 7). The fusion lacking the conserved motif (pBT1701) was detectably fluorescent, with greater than 73.2% of the spores positive over background and with a mean positive fluorescence (MPF) of 15.2. But these values were substantially lower than those obtained with pBT1694-bearing spores (96.6%, MPF 94.6%). The pBT1720 conserved motif-only fusion gave little detectable fluorescence above that of the negative control spores (11.4% to 3.9%, MPF 6). Spores from cells expressing DsRed without BclA N-terminal residues (pBT1729) were not detectably fluorescent over background (3.8% vs. 3.9%).",
                                "**Example 6: Exosporium Incorporation Utilizing the BclB N-Terminal Domain**",
                                "After establishing that the BclA N-terminal domain was sufficient to localize proteins to the spore periphery, the ability of the corresponding BclB domain to target proteins to the exosporium was studied. The DsRed reporter was fused to the BclB N-terminus with the coding sequence up to and including the conserved region, with the natural bclB promoter and RBS (pBT1747; FIG. 2B). Previous reports have suggested that bclB and bclA are transcribed at an identical stage in sporulation, but with bclB transcribed at a −2-fold lower level (Bergman et al., 2006). However, the pBT1747-encoded fusion appeared earlier in the sporulation process than the BclA fusions and at a greatly reduced level, lower than the reported 2-fold difference in mRNA (Bergman et al., 2006). Released spores only contained barely detectable levels of the fusion protein (FIG. 8G).",
                                "To increase production of the BclB fusion proteins, the BclB N-terminal sequence fused to DsRed was positioned under the control of the more active bclA promoter and RBS elements (pBT1746; FIG. 2B). The pBT1746-encoded fusion protein was expressed at a level similar to that of the pBT1694 construct. The pBT1746-encoded BclA construct mimicked the pBT1694-encoded BclA construct, with both fluorescent fusions produced and localizing around the spore periphery before release of the fluorescent spores (FIGS. 8A-8F). There appeared to be a difference in the spore localization pattern on the pBT1746-encoded fusion, with the fluorescence spread across the spore in a slightly mottled fashion and ultimately encompassed only 75% of the spore, with one pole devoid of fluorescence (FIGS. 8E and 8F). The fusion did not exhibit the more uniform distribution seen with the pBT1693- and pBT1694-encoded fusions. Although incorporation was evident, the capacity of the BclB domain to target proteins to the spore surface was reduced when compared to that of the BclA N-terminal fusion (FIG. 8G). The pBT1746-encode BclB fusion spores were 72.5% positive compared with 96.6% for pBT1694-containing spores, with a MPF of 16.1 compared to 94.6. This result illustrates that the presence of the BclB N-terminus is sufficient to localize foreign proteins to the spore surface, but the degree of incorporation is dependent upon the production level of the protein and/or the differences in the sequences of the N-terminus or targeting domains of BclA and BclB.",
                                "**Example 7: Native BclA is Incorporated into Spores Expressing Reporter Proteins**",
                                "To determine if native BclA continued to be incorporated into the exosporium in cells expressing the Bcl-domain-containing fusions, fluorescent purified spores were incubated with rabbit anti-recombinant BclA polyclonal antibodies followed by FITC-Protein A conjugate (FIGS. 9A-9F). Spores from each of the DsRed fusion constructs retained the ability to bind anti-BclA antibodies, indicating that native BclA was incorporated into the spores. Spores from the promoter-only constructs (pBT1720 and pBT1729) produced spores with wild-type levels of BclA as expected (FIGS. 9D, 9E). Spores with the fusion protein incorporated into the exosporium demonstrated a pronounced heterogeneity in the amount of fusion protein on the spore surfaces relative to the native BclA levels in individual spores in the population (FIG. 9A-9F). This result was especially noticeable in the pBT1746-encoded (BclB NTD) fusion, suggesting that the incorporation of the fusion hinders native BclA incorporation or may effect the topology of the proteins, thus inhibiting binding or access of the anti-BclA polyclonal antibodies to the native BclA.",
                                "**Example 8: Incorporation of Fusion Proteins onto the Exosporium Surface**",
                                "Exosporium targeting was checked by immune-electron microscopy analysis of spores containing the pBT1744-encoded BclA N-terminal fusion to eGFP. Spores were analysed under TEM after treatment with either anti-rBclA rabbit polyclonal antibodies or anti-GFP rabbit polyclonal antibodies (lmgenex). These primary antibodies were followed with secondary gold-labelled anti-rabbit antibodies bearing 20 and 10 nm gold particles, respectively (FIGS. 9G and 9H). Both anti-GFP and anti-rBclA antibodies localized to the nap layer of the exosporium. The anti-GFP antibodies were found in closer proximity to the basal layer, which may be due to the eGFP protein lacking the filamentous structure associated with native BclA. There was no indication that the incorporation of the fusion proteins differed from the incorporation of natural BclA. The appearance of the exosporium was normal, despite the incorporation of the fusion proteins.",
                                "**Example 9: The BAS3290 Protein can be Used to Introduce Foreign Antigens**",
                                "The BAS3290 protein of B. anthracis is predicted to localize to the exosporium due to the high degree of identity of its N-terminal domain (SEQ ID NO: 8) to the N-terminal domain of the localization domain of the BclA protein (SEQ ID NO: 7; 13 of 14 amino acid residues identical). A fusion of the entire BAS3290 ORF to the EGFP reporter under the control of the native BAS3290 σK promoter was constructed. This fusion protein was produced late in the sporulation process, which was consistent with transcription under this promoter. This fusion protein was produced and localized immediately to the exosporium (FIGS. 11A and 11B). After localization to the exosporium, this fusion was affixed to the released spores demonstrating as fluorescent spores (FIGS. 11C and 11D). This result demonstrates that the BAS3290 protein acts mechanistically similar to the BclA protein, and could also be utilized for the creation of fusion for surface display of foreign antigens on the exosporium of B. anthracis.",
                                "**Example 10: Other Exosporium Containing-Bacillus Species**",
                                "To demonstrate the conserved nature of the localization machinery in the Bacillus cereus family, the pBT1744 construct (B. anthracis BclA N-terminal domain fused to EGFP; see Thompson et al. 2008) was utilized. This pBT1744 construct was electroporated into B. cereus strain 14579 and B. thuringiensis strain kurstaki. Proper antibiotic resistant clones were allowed to enter sporulation, and observed upon release of free spores. The B. anthracis BclA N-terminal domain localized and attached to the spores of both B. cereus (FIG. 12A) and B. thuringiensis (FIG. 12B). This result demonstrates that any of the Bacillus cereus family may be used to incorporate foreign antigens onto exosporia of the family.",
                                "**Example 11: Bacillus Exosporium Antigen Delivery (BEAD) Systems**",
                                "The ORF5 from the Porcine Respiratory and Reproductive Virus (PRRSV), which encodes a protective, neutralizing protein, was chosen to be an exemplary foreign antigen expressed using the BEAD system in different Bacillus cereus family members. Polymerase chain reaction (PCR) of the PRRSV ORF5 was accomplished using standard techniques. Fusion of the PRRSV ORF5 to the N-terminal domain of BclA or BclB was accomplished by splicing and overlapping extension techniques well-known in the art. Correct fusions were cloned into the shuttle plasmid pMK4, sequenced, and electroporated into B. anthracis strain ASterne and B. thuringiensis strain kurstaki. Correct transformants were selected, grown in Brain Heart Infusion broth and then allowed to sporulate by plating onto N agar plates at 30° C. Free spores were collected after 3 days, and washed with PBS to remove vegetative cell debris. Purified spores were then subjected to immunolabeling with sera from either preimmune pigs, or from pigs previously infected with PRRSV and to whom a known titer to PRRSV had been established. Exposure to sera was followed with protein A-FITC conjugate, which binds to all antibodies and lights up green. As shown in FIGS. 13A-13F, the B. anthracis spores expressing either the BclA or the BclB N-terminal domain (NTD) tagged PRRSV ORF5 labeled with immune sera (FIGS. 13B, 13C), while immune sera did not react with wildtype spores (FIG. 13A).",
                                "In B. thuringiensis, the BclA NTD tagged PRRSV ORF5 localized to the exosporium, but mostly preferentially to one pole (FIG. 14A). These spores did not react with the preimmune pig sera, suggesting the reactivity seen at the poles was specific to PRRSV (FIG. 14B). These results demonstrate that foreign antigens can be expressed on the surface of the exosporium of the B. cereus family members with this antigen expression system, and that reactivity to these proteins is demonstrated by immunofluorescence assays. This reactivity indicates that the foreign antigens have surface exposure and are available to stimulate an immune reaction.",
                                "Next, extraction of the spore layers from the B. thuringiensis spore expressing the PRRSV ORF5 protein fused to the BclA protein was undertaken. Separation of these extracted proteins by SDS-PAGE, followed by western blotting with immune and preimmune pig sera (FIG. 15) further demonstrates the specific reactivity of the immune sera to the PRRSV ORF5 (see Lane 4 on the gel). The high molecular weight material on the western is indicative of large molecular weight exosporium complexes which do not dissociate under SDS or urea buffer insult. Glycosylation of these complexes leads to the variable molecular weight smear seen on the blot (Lane 4). The lower molecular weight band (Lane 4) corresponds to the molecular weight of the fusion of PRRSV ORF5 fused to BclA NTD.",
                                "All of the compositions and methods disclosed and claimed herein can be made and executed without undue experimentation in light of the present disclosure. While the compositions and methods of this invention have been described in terms of preferred embodiments, it will be apparent to those of skill in the art that variations may be applied to the compositions and methods and in the steps or in the sequence of steps of the method described herein without departing from the concept, spirit and scope of the invention. More specifically, it will be apparent that certain agents which are both chemically and physiologically related may be substituted for the agents described herein while the same or similar results would be achieved. All such similar substitutes and modifications apparent to those skilled in the art are deemed to be within the spirit, scope and concept of the invention as defined by the following claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce examples of preferred embodiments",
                                "describe growth conditions for Bacillus anthracis",
                                "detail creation of fusion constructs",
                                "outline spore analysis by flow cytometry",
                                "describe micrograph images",
                                "detail transmission electron microscopy",
                                "introduce example 1: BclA protein contains N-terminal exosporium targeting domain",
                                "describe generation of gene fusions to eGFP reporter",
                                "detail subcloning into pMK4 shuttle plasmid",
                                "describe electroporation into ASterne strain of B. anthracis",
                                "outline expression of reporters by epi-fluorescence microscopy",
                                "describe fluorescence appearance during stationary phase",
                                "detail initial polar localization of BclA fusion",
                                "describe expansion of fusion protein incorporation",
                                "outline formation of exosporium",
                                "describe incorporation of fusion into exosporium",
                                "detail release of highly fluorescent spores",
                                "introduce example 2: N-terminal amino acids required for exosporium incorporation",
                                "describe construction of third fusion",
                                "detail comparison of fluorescence incorporation levels by flow cytometry",
                                "outline quantification of relative fusion incorporation levels",
                                "introduce example 3: cleavage of N-terminal domain associates with incorporation of BclA into exosporium",
                                "describe construction of dual reporter fusion construct",
                                "detail analysis of cleavage in N-terminal domain",
                                "describe localization of fusion to spore periphery",
                                "outline putative cleavage event",
                                "describe release of bound mCherry and emergence of green spore",
                                "detail completion of cleavage events",
                                "introduce reporter fusions",
                                "demonstrate cleavage event",
                                "correlate cleavage with BclA incorporation",
                                "introduce example 4",
                                "describe reporter oligomerization",
                                "test oligomerization requirement",
                                "analyze fluorescence distribution",
                                "eliminate non-specific binding",
                                "introduce example 5",
                                "test conserved motif requirement",
                                "analyze fusion protein localization",
                                "quantify incorporation levels",
                                "introduce example 6",
                                "test BclB N-terminal domain",
                                "analyze fusion protein expression",
                                "compare incorporation levels",
                                "introduce example 7",
                                "test native BclA incorporation",
                                "analyze anti-BclA antibody binding",
                                "introduce example 8",
                                "test exosporium targeting",
                                "analyze immune-electron microscopy",
                                "introduce example 9",
                                "test BAS3290 protein",
                                "analyze fusion protein localization",
                                "introduce example 10",
                                "test conserved localization machinery",
                                "analyze BclA N-terminal domain",
                                "introduce example 11",
                                "test BEAD system",
                                "analyze PRRSV ORF5 expression",
                                "test immune sera reactivity",
                                "analyze spore layer extraction",
                                "discuss invention scope"
                            ],
                            "num_characters": 31670,
                            "outline_medium": [
                                "introduce experimental procedures",
                                "describe growth conditions",
                                "create fusion constructs",
                                "analyze spores by flow cytometry",
                                "capture micrograph images",
                                "perform transmission electron microscopy",
                                "describe example 1: BclA protein contains N-terminal exosporium targeting domain",
                                "generate gene fusions to eGFP reporter",
                                "express reporters in B. anthracis",
                                "describe example 2: N-terminal amino acids required for exosporium incorporation",
                                "construct fusion mimicking spore-extracted form of BclA",
                                "quantify fusion incorporation levels by flow cytometry",
                                "describe example 3: cleavage of N-terminal domain associates with incorporation of BclA into exosporium",
                                "analyze dual reporter fusion construct",
                                "introduce reporter fusions",
                                "demonstrate cleavage event",
                                "show correlation with BclA incorporation",
                                "introduce example 4",
                                "describe reporter oligomerization",
                                "demonstrate localization to exosporium",
                                "show incorporation of fusion proteins",
                                "introduce example 5",
                                "describe conserved motif and N-terminal sequences",
                                "demonstrate exosporium incorporation",
                                "introduce example 6",
                                "describe BclB N-terminal domain",
                                "demonstrate localization and incorporation",
                                "introduce example 7",
                                "describe native BclA incorporation",
                                "introduce examples 8-11",
                                "describe BEAD systems and antigen delivery"
                            ],
                            "outline_short": [
                                "introduce experimental procedures",
                                "describe creation of fusion constructs",
                                "outline spore analysis by flow cytometry",
                                "present micrograph images",
                                "detail transmission electron microscopy",
                                "provide example 1: BclA protein contains N-terminal exosporium targeting domain",
                                "provide examples 2 and 3: N-terminal amino acids required for exosporium incorporation and cleavage of N-terminal domain associates with incorporation of",
                                "introduce reporter fusions",
                                "demonstrate exosporium incorporation",
                                "analyze reporter oligomerization",
                                "investigate conserved motif and N-terminal sequences",
                                "study BclB N-terminal domain",
                                "examine native BclA incorporation",
                                "analyze fusion protein incorporation",
                                "demonstrate BEAD system"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce Bacillus endospores as delivery vehicle",
                        "identify limitations of current methods",
                        "describe BEAD system for antigen delivery",
                        "identify BclA and BclB glycoproteins",
                        "describe protein incorporation into exosporium",
                        "identify N-terminal domains of BclA and BclB",
                        "describe role of conserved motif in protein targeting",
                        "describe proteolytic cleavage event",
                        "propose model for maturation and assembly of BclA",
                        "describe localization of BclA during sporulation",
                        "describe role of BxpB protein in BclA assembly",
                        "describe differences in BclB incorporation",
                        "introduce BEAD system for antigen delivery",
                        "describe advantages of BEAD system",
                        "describe potential applications of BEAD system",
                        "define technical and scientific terms"
                    ],
                    "num_characters": 8488,
                    "outline_medium": [
                        "introduce Bacillus endospores as delivery vehicle",
                        "identify sequences of BclA and BclB glycoproteins",
                        "describe BEAD system for incorporating foreign proteins into exosporium",
                        "identify domains important in protein incorporation into exosporium",
                        "describe N-terminal domains of BclA and BclB",
                        "propose model for maturation and assembly of BclA into exosporium",
                        "describe exploitation of targeting domains as BEAD system",
                        "discuss implications of BEAD system for vaccine development"
                    ],
                    "outline_short": [
                        "introduce Bacillus exosporium antigen delivery (BEAD) system",
                        "identify domains important in protein incorporation into exosporium",
                        "describe process of assembly and attachment of BclA and BclB",
                        "exploit targeting domains as BEAD system"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1-20. (canceled)",
        "21. A Bacillus exosporium molecule delivery (BEMD) system comprising a recombinant Bacillus cereus family member expressing a fusion construct, wherein the fusion construct is expressed under the control of a sporulation-phase specific promoter and wherein the fusion construct comprises at least one molecule of interest (MOI) and:\n(a) a targeting sequence comprising an amino acid sequence having at least 43% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 54%;\n(b) a targeting sequence comprising amino acids 1-35 of SEQ ID NO: 7;\n(c) a targeting sequence comprising amino acids 20-35 of SEQ ID NO: 7;\n(d) a targeting sequence comprising SEQ ID NO: 13;\n(e) a targeting sequence comprising SEQ ID NO: 7;\n(f) a targeting sequence comprising at least the first 35 amino acids of a Bacillus BclA protein;\n(g) a full-length Bacillus BclA protein;\n(h) a targeting sequence comprising amino acids 1-27 of SEQ ID NO: 8;\n(i) a targeting sequence comprising amino acids 12-27 of SEQ ID NO: 8;\n(j) a targeting sequence comprising SEQ ID NO: 8;\n(k) a targeting sequence comprising at least the first 31 amino acids of a Bacillus BAS3290 protein;\n(l) a full-length Bacillus BAS3290 protein;\n(m) a targeting sequence comprising an amino acid sequence having at least 43% identity with amino acids 12-27 of SEQ ID NO: 8, wherein the identity with amino acids 17-27 is at least 63%;\n(n) a targeting sequence comprising amino acids 1-38 of SEQ ID NO: 9;\n(o) a targeting sequence comprising amino acids 23-38 of SEQ ID NO: 9;\n(p) a targeting sequence comprising SEQ ID NO: 9;\n(q) a targeting sequence comprising at least the first 36 amino acids of a Bacillus BAS4623 protein;\n(r) a full-length Bacillus BAS4623 protein;\n(s) a targeting sequence comprising an amino acid sequence having at least 43% identity with amino acids 23-38 of SEQ ID NO: 9, wherein the identity with amino acids 28-38 is at least 54%;\n(t) a targeting sequence comprising amino acids 1-28 of SEQ ID NO: 10;\n(u) a targeting sequence comprising amino acids 13-28 of SEQ ID NO: 10;\n(v) a targeting sequence comprising SEQ ID NO: 10;\n(w) a targeting sequence comprising at least the first 32 amino acids of a Bacillus BclB protein;\n(x) a full-length Bacillus BclB protein; or\n(y) a targeting sequence comprising an amino acid sequence having at least 43% identity with amino acids 13-28 of SEQ ID NO: 10, wherein the identity with amino acids 18-28 is at least 54%.",
        "22. The BEMD system of claim 21, wherein the sporulation-phase specific promoter comprises at least one sigma-K element.",
        "23. The BEMD system of claim 21, wherein the recombinant Bacillus cereus family member is selected from the group consisting of B. anthracis, B. cereus, B. thuringiensis, and combinations thereof.",
        "24. The BEMD system of claim 23, wherein the recombinant Bacillus cereus family member comprises B. thuringiensis.",
        "25. The BEMD system of claim 21, wherein the MOI comprises an immunogenic molecule.",
        "26. The BEMD system of claim 25, wherein the immunogenic molecule of the fusion construct is physically oriented in the exosporium to be able to stimulate an immune response.",
        "27. The BEMD system of claim 21, wherein the Bacillus cereus family member is inactivated.",
        "28. The BEMD system of claim 21, wherein the fusion construct comprises:\n(a) a targeting sequence comprising an amino acid sequence having at least 50% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 72%;\n(b) a targeting sequence comprising an amino acid sequence having at least 50% identity with amino acids 12-27 of SEQ ID NO: 8, wherein the identity with amino acids 17-27 is at least 63%;\n(c) a targeting sequence comprising an amino acid sequence having at least 43% identity with amino acids 23-38 of SEQ ID NO: 9, wherein the identity with amino acids 28-38 is at least 63%; or\n(d) a targeting sequence comprising an amino acid sequence having at least 50% identity with amino acids 13-28 of SEQ ID NO: 10, wherein the identity with amino acids 18-28 is at least 63%.",
        "29. The BEMD system of claim 21, wherein the fusion construct comprises:\n(a) a targeting sequence comprising an amino acid sequence having at least 81% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 90%;\n(b) a targeting sequence comprising an amino acid sequence having at least 81% identity with amino acids 12-27 of SEQ ID NO: 8, wherein the identity with amino acids 17-27 is at least 90%; or\n(c) a targeting sequence comprising an amino acid sequence having at least 50% identity with amino acids 23-38 of SEQ ID NO: 9, wherein the identity with amino acids 28-38 is at least 72%.",
        "30. The BEMD system of claim 21, wherein the targeting sequence comprises SEQ ID NO: 13.",
        "31. A Bacillus exosporium molecule delivery (BEMD) system comprising a recombinant Bacillus cereus family member expressing a fusion construct, wherein the fusion construct comprises at least one molecule of interest (MOI) and a targeting sequence comprising a methionine residue directly covalently bound to a targeting sequence comprising an amino acid sequence comprising 16 amino acids having at least 43% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 54%.",
        "32. The BEMD system of claim 31, wherein the recombinant Bacillus cereus family member is selected from the group consisting of B. anthracis, B. cereus, B. thuringiensis, and combinations thereof.",
        "33. The BEMD system of claim 32, wherein the recombinant Bacillus cereus family member comprises B. thuringiensis.",
        "34. The BEMD system of claim 31, wherein the MOI comprises an immunogenic molecule.",
        "35. The BEMD system of claim 34, wherein the immunogenic molecule of the fusion construct is physically oriented in the exosporium to be able to stimulate an immune response.",
        "36. The BEMD system of claim 31, wherein the Bacillus cereus family member is inactivated.",
        "37. The BEMD system of claim 31, wherein the fusion construct comprises a targeting sequence comprising an amino acid sequence having at least 50% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 72%.",
        "38. The BEMD system of claim 31, wherein the fusion construct comprises a targeting sequence comprising an amino acid sequence having at least 81% identity with amino acids 20-35 of SEQ ID NO: 7, wherein the identity with amino acids 25-35 is at least 90%."
    ]
}