{
    "id": "https://semopenalex.org/work/W2802922533",
    "authors": [
        "Ronald J. Triolo",
        "Lisa M. Lombardo",
        "Musa L. Audu",
        "Kevin M. Foglyano",
        "Kiley Armstrong"
    ],
    "title": "Automatic application of neural stimulation during wheelchair propulsion after SCI enhances recovery of upright sitting from destabilizing events",
    "date": "2018-03-12",
    "abstract": "The leading cause of injury for manual wheelchair users are tips and falls caused by unexpected destabilizing events encountered during everyday activities. The purpose of this study was to determine the feasibility of automatically restoring seated stability to manual wheelchair users with spinal cord injury (SCI) via a threshold-based system to activate the hip and trunk muscles with electrical stimulation during potentially destabilizing events. We detected and classified potentially destabilizing sudden stops and turns with a wheelchair-mounted wireless inertial measurement unit (IMU), and then applied neural stimulation to activate the appropriate muscles to resist trunk movement and restore seated stability. After modeling and preliminary testing to determine the appropriate inertial signatures to discriminate between events and reliably trigger stimulation, the system was implemented and evaluated in real-time on manual wheelchair users with SCI. Three participants completed simulated collision events and four participants completed simulated rapid turns. Data were analyzed as a series of individual case studies with subjects acting as their own controls with and without the system active. The controller achieved 93% accuracy in detecting collisions and right turns, and 100% accuracy in left turn detection. Two of the three subjects who participated in collision testing with stimulation experienced significantly decreased maximum anterior-posterior trunk angles (p < 0.05). Similar results were obtained with implanted and surface stimulation systems. This study demonstrates the feasibility of a neural stimulation control system based on simple inertial measurements to improve trunk stability and overall safety of people with spinal cord injuries during manual wheelchair propulsion. Further studies are required to determine clinical utility in real world situations and generalizability to the broader SCI or other population of manual or powered wheelchair users. ClinicalTrials.gov Identifier NCT01474148 . Registered 11/08/2011 retrospectively registered.",
    "sections": [
        {
            "title": "Background",
            "paragraphs": [
                "There are approximately 285,000 people in the United States living with spinal cord injuries (SCI) [1], roughly two thirds of whom are dependent on scooters or wheelchairs for daily mobility [2]. According to a survey of individuals with SCI, trunk stability is among the top functions they desire to improve or restore [3]. People with SCI who have lost the ability to control their trunks experience more postural sway during sitting than able-bodied individuals [4]. Minor disturbances can destabilize upright sitting and cause a loss of erect sitting posture during wheelchair use, leading to injurious falls and thus limiting their mobility and independence. Tips and falls are the leading cause of injury for people in wheelchairs, accounting for two-thirds of the more than 100,000 wheelchair related injuries per year requiring treatment in emergency departments [5]. Wheelchair accidents can result in fractures, lacerations, contusions and abrasions, and even death [6]. Rehabilitation for a fracture in an individual with SCI requires four to eight weeks of hospital stay, resulting in reduced strength and increased risk of blood clots [6]. Additionally, cost of treatment due to wheelchair-related falls typically ranges from $25,000 to $75,000 [6]. The riding surface and environmental factors [7], wheelchair design (such as caster size and seat position) [8], and center of gravity location [9] can all affect wheelchair stability, and ultimately contribute to falls and tips experienced by manual wheelchair users. Common events that can contribute to destabilization include colliding with an obstacle (such as a low curb or wall), propelling through sharp turns, negotiating uneven or inclined surfaces, and maneuvering curb drops [7, 10].",
                "Current methods to maintain trunk stability for manual wheelchair users with SCI include seat belts to keep the trunk from falling forward, seat cushioning systems to decrease the exaggerated posterior pelvic tilt that results from paralysis of the hips and trunk, increased seat dump to take advantage of gravity in a backwards leaning posture, or supports to limit lateral motions of the trunk. These methods have many disadvantages, including reduced work volumes and impaired ability to reach and manipulate objects due to the external constraints, as well as pressure ulcers, skin tears, lowered self-esteem and even asphyxiation [11]. Non-compliance with such strategies is high since they also restrict desired motions and interfere with functional tasks while the wheelchair is not moving [12]. Power wheelchairs offer more options for specialized seating systems and can provide power tilting and reclining to allow users to independently change their postures in preparation for a task or anticipated disturbance. However, they impose the same restrictions on voluntary motion, and people are typically reluctant to switch from manual to powered wheelchairs for the additional stability as it may be viewed as an indication of greater disability [13].",
                "Functional neuromuscular stimulation (FNS) has been utilized to restore and maintain trunk stability by significantly increasing the trunk extension moment [14] and multidirectional trunk stiffness [15, 16]. When the trunk flexor and extensor muscles are activated with neural stimulation, people show physical and psychological improvements of strength and stability, particularly in response to unexpected, destabilizing forces [17, 18]. EMG of healthy individuals has shown significant activation of the erector spinae muscles in response to perturbations pulling the trunk anteriorly [19]. Continuous activation of the otherwise paralyzed hip and trunk muscles with FNS can maintain trunk stability during similar anteriorly-directed forces applied to the trunks of individuals with SCI [17, 20]. Furthermore, activating the hip and trunk muscles with neural stimulation can restore upright sitting from forward flexed or side-leaning positions automatically without use of the arms based on exceeding an angular threshold monitored by a tilt sensor attached to the sternum [21]. Similarly, a powered-wheelchair neuroprosthesis that activated trunk flexors and extensors with FNS on able-bodied participants experiencing perturbations in the anterior-posterior (AP) direction showed a decrease in trunk displacement and velocity with stimulation [18]. Additionally, continuous electrical stimulation of the trunk and hip extensors has been shown to improve the mechanics of manual wheelchair propulsion for people with SCI by decreasing the peak resultant pushrim forces and increasing propulsion efficiency [22]. These studies suggest that simple, automatic systems based on body position have the potential to improve mobility and voluntary function while sitting in a wheelchair, however automatically modulating stimulation at the onset of destabilizing events during manual wheelchair propulsion to minimize the effects of unanticipated perturbations or restore seated posture with neural stimulation has not yet been examined in person with SCI under simulated real-world conditions.",
                "To employ neural stimulation in response to potentially destabilizing events, a method of accurately predicting or detecting such situations must be identified. Inertial measurement units (IMUs) have been utilized to monitor trunk angle of people with SCI in a static environment [21], determine phases of the manual wheelchair stroke cycle [23], and classify physical activities of daily living [24]. Additionally, such classification of up to 90% of the activities of daily living of manual wheelchair users with SCI was found to be clinically useful [24–26]. Prior investigation of classifying instability of manual wheelchairs combined use of IMUs and machine learning to differentiate destabilizing conditions [27]. In contrast, our research utilizes a simple threshold-based method to detect and classify destabilizing events based on characteristics of the inertial signature of the wheelchair to automatically trigger activation of the appropriate muscles and determine its impact on seated posture.",
                "The static and dynamic tipping stability of the wheelchair-user system has been examined in modeling studies [28–31]. Li et al. [30] derived an equation to calculate the critical velocity at which unrecoverable forward tipping will occur due to a collision. The equation and parameters used for this paper are explained in the methods section below. Similarly, Bruno’s collision simulations [28] released a powered wheelchair from the top of a ramp to passively ride down into a barrier at the end, and found that the system is expected to fully tip forward when entering a collision at 1.74 m/s. Cooper et al. [31] developed the following equation to predict rollover during a destabilizing turn, based on the initial velocity and radius of the turn. This equation is also explained in the methods section below. Such wheelchair modeling studies inform the design of wheelchairs for safe operation and define their inherent mechanical limits of stability, but do not react to potentially destabilizing events or assist wheelchair users in maintaining and/or regaining stable seated postures when they occur.",
                "The purpose of this study was to determine the feasibility and preliminary performance of a threshold-based system that utilizes inertial measurements to detect destabilizing collisions and sharp turns in manual wheelchair users with SCI and provides an appropriate stimulated response of the hip and trunk muscles through implanted pulse generators (IPGs) or surface stimulation to enhance recovery of a stable seated posture, thereby potentially decreasing the risk of injurious loss of balance and falls. IPGs or surface stimulators electrically excite the motor nerves with adjustable pulse amplitudes and durations to activate the otherwise paralyzed hip and trunk muscles and generate the desired movements. It has been shown that FNS requires roughly 100 ms to generate torque in the muscles [32]. Therefore, this system must act in real time to detect or predict the onset of such events to allow for earliest possible application of stimulation before instability reaches an irreversible state. We hypothesize that applying FNS at the onset of a destabilizing event will increase trunk stability, maintain erect posture, and improve users’ perceptions of safety during daily activities in their wheelchairs. This study analyzed detection accuracy, detection delay, and restoration of trunk stability with and without neural stimulation delivered by a threshold-based system during destabilizing collisions and turns in manual wheelchair users with SCI."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Preliminary Simulations And Crash Dummy Testing",
                    "paragraphs": [
                        "To design an appropriate and safe experimental set-up for testing the impact of destabilizing crashes and sharp turns, mathematical models of the wheelchair-user system were utilized to simulate collision and turning events [29, 30]. The equation derived by Li et al. [30] to calculate the critical velocity at which unrecoverable forward tipping will occur due to a collision follows:\\[v_{\\textit{crit}} = \\sqrt{\\frac{2g\\left| d_{\\mathit{cm}} \\right|^{2}}{Mh^{2}}\\left( {I_{\\mathit{cm}} + M\\left| d_{\\mathit{cm}} \\right|^{2}} \\right)\\left( {1 - \\cos\\left( {\\theta_{\\textit{crit}} - \\theta} \\right)} \\right)\\ }\\]",
                        "In this equation, dcm is the displacement vector from the front caster to the center of gravity, M is the combined mass of the wheelchair-user system, h is the height of the center of gravity above the ground, Icm is the system moment of inertia, θcrit is the critical angle at which tipping the wheelchair to this degree will be recovered at in static conditions, and θ is the angle of the slope on which the wheelchair is placed. Table 1 outlines the parameters used to calculate the critical velocity from Eq. 1. These parameters were measured from the same wheelchair that was used by all the participants during laboratory testing and a user mass of 75 kg was assumed. From this calculation, the critical velocity for tipping of the wheelchair-user system was expected to occur at 1.6 m/s. To avoid tipping and ensure subject safety, a slightly lower velocity of 1.5 m/s was chosen for experimental sessions. This choice of velocity was confirmed in a computer simulation of the collision event in Simwise 4D (Design Simulation Technologies, Canton, MI) in which a model of a 75-kg person riding in a 15-kg wheelchair descended a ramp with a 5o incline. The wheelchair operator was represented by a simple multi-joint model consisting of revolute knee and hip joints, with nominal mass parameters of the thighs and lumped head, arms and trunk. Terminal speeds were varied by adjusting the starting position on the simulated ramp. Simulation results confirmed that an impact at 1.5 m/s generated peak deceleration on the order of 4 g, which was sufficient to passively lift the thighs from the seating surface and flex the trunk forward. Cooper et al. [31] developed the following equation to predict rollover during a destabilizing turn, based on the initial velocity and radius of the turn:\\[v_{\\textit{crit}} = \\sqrt{\\frac{\\mathit{rgD}}{x}}\\] Table 1Parameters for Critical Velocity CalculationsCollision (Eq. 1)Turns (Eq. 2)dcm0.81 mr0.635 mM90 kgD0.30 mh0.71 mx0.71 mIcm9.5 kg-m2θcrit31°θ5°",
                        "In this equation, r is the radius of the turn, D is half the width of the wheelchair, and x is the height of the center of gravity above the seat of the chair. Using the parameters outlined in Table 1 for Eq. 2, a system entering a turn of 25-in. (63.5 cm) radius at 1.5 m/s is expected to be destabilizing without causing the chair to roll over.",
                        "A 2-m ramp with 5o incline was constructed for the experimental set up. A guidance track was mounted on top of the ramp, which ended with a 90 degree turn of 25-in. (63.5-cm) radius. Roller bearings were installed beneath the frame of a standard wheelchair (GP Series, Sunrise Medical LLC, Fresno, CA) to guide descent and turning and achieve a consistent velocity at impact or time of turn. A bumper was also attached to the footplate of the wheelchair to protect the feet during all experiments. A barrier was erected 2 m after the turn to suddenly stop the wheelchair and rider and thus simulating a collision. The experimental set-up is shown in Fig. 1.Fig. 1Experimental Setup. Experimental set-up of the ramp with a guidance ramp for (a) collisions and (b) 90-degree turns",
                        "Collisions and rapid turns were performed with a 6′1″, 165-lb (1.85 m, 74.8-kg) Rescue Randy crash dummy (Dummies Unlimited Inc., Pomona, CA) seated in the manual wheelchair to develop the event detection algorithms and verify safety prior to human testing. The three-dimensional position coordinates of the wheelchair and crash dummy were tracked using a 16-camera motion capture system (VICON MX, Oxford Metrics, Oxford, UK), sampling at 100 Hz. Ten reflective markers were placed on the wheelchair-user system: two markers on the rear cross bar of the chair, one at each wheel center, one above each caster, one on each shoulder, and one on the sternum and C7 vertebra. A wireless IMU, containing a CMA3000-D01 accelerometer from Texas Instruments (Dallas, TX) and a LSM330DLC gyroscope from ST Microelectronics (Geneva, Switzerland), was placed on the center of the rear cross bar of the wheelchair. The IMU sampled the tri-axial acceleration and angular velocity of the wheelchair at 100 Hz. For each trial, the wheelchair with dummy rider was released from the top of the ramp, passively rode down the guidance track into a 90 degree turn at the lowest part of the incline and ended with a sudden stop to stimulate a collision. Twenty trials of collisions, right turns, and left turns were collected each. Mean peak AP acceleration and superior-inferior (SI) angular velocity were found to repeatedly and reliably represent collisions and turns, respectively, and were therefore utilized in subsequent experiments to detect the events. Simple threshold-based event detection algorithms illustrated in Fig. 2 were devised based on these preliminary tests. Calculation of thresholds for the algorithms used for participants with SCI is further explained in the following section.Fig. 2Detection Algorithms. a Collision detection algorithm b Turn detection algorithm"
                    ],
                    "subsections": []
                },
                {
                    "title": "Sci Testing",
                    "paragraphs": [
                        "A total of four participants (S1-S4) with low thoracic or high cervical spinal cord injuries participated in this study. To be eligible for participation, subjects must have been 21 years of age or older, sustained a mid-cervical or thoracic spinal cord injury (C4-T12), classified as A through C on the ASIA Impairment Scale, scored less than 4 on the Ashworth Scale for Spasticity and the Modified Ashworth Scale for hypertonia, and able to read and speak English. All subjects signed consent forms approved by the local institutional review board before any experiments were conducted. Table 2 summarizes the clinical characteristics of each participant. Each had received a surgically implanted neuromuscular stimulator to activate the knee, hip and trunk extensor muscles with implanted intramuscular or nerve cuff electrodes as part of participation in other projects in our laboratory [33–38]. Details of the implanted motor system neuroprostheses are described elsewhere [39–43], and consisted of 8, 12, or 16 channel IPGs that delivered asymmetrical charge-balanced current controlled stimulus waveforms with pulse amplitudes (0 to 20 mA) selectable for each channel and variable pulse durations (0 to 250 μsec) and frequencies (0 to 20 Hz) set on a pulse-by-pulse basis. Intramuscular electrodes [44] were inserted at the T12-L2 spinal nerves to activate the paraspinal muscles, and at the motor points of the gluteal and hamstring muscles. Spiral nerve cuff electrodes [45] were also installed on the femoral nerves were in all subjects to activate the quadriceps. In the ensuing experiments, subject S3 utilized surface stimulation rather than his implanted system because of technical difficulties that could not be resolved in time to complete the testing and to begin to examine the generalizability of the approach for the larger SCI population without implanted electrodes and pulse generators.Table 2Clinical summary of study participantsParticipantAgeGenderInjury LevelAIS GradDate of InjuryDate of ImplantS151MT3A10/11/20022/24/2015S241FT4A2/13/201211/20/2014S359MT4B3/9/20081/16/2012S444FC7B3/13/19988/26/2010",
                        "For each event, participants first went through 20 calibration trials to determine threshold values of AP acceleration and SI angular velocity indicative of collisions and turns. The same wheelchair was used by all subjects. Participants also wore helmets and loosely fitting seat belts to ensure safety. For collisions, a subject’s threshold was calculated as the mean peak of the absolute value of AP acceleration minus two standard deviations from his/her own 20 calibration trials. Turn thresholds were calculated in the same manner as the mean peak of the absolute value of the SI angular velocity minus two standard deviations. Right and left turn thresholds were equal in magnitude, but opposite in sign. A positive threshold detected a left turn, whereas a negative threshold classified a right turn.",
                        "The real-time decision algorithms for collisions and turns, shown in Fig. 2, were created in Simulink (The Mathworks Inc., Natick, MA), which received the IMU signals from the wheelchair, compared them to the subject-specific thresholds, and delivered stimulation to the muscle groups at the levels customized for each subject when the threshold was exceeded. The participants manually turn the stimulation off once they restored a stable, erect posture. The relative timings of stimulation to inertial measurements are depicted in Fig. 3. For forward collisions, maximal stimulation levels were generally delivered to the trunk (lumbar erector spinae) and hip (gluteus maximus, posterior adductor, and/or hamstrings) extensor muscles to resist forward flexion and assist return to upright sitting. For turns, the quadratus lumborum on the inside of the turn, and the hip extensor on the outside of the turn were activated to resist lateral displacement of trunk and pelvis. Table 3 summarizes the algorithm thresholds and muscles stimulated for each subject during each event.Fig. 3Stim Timings for S2. a AP acceleration of a collision event for S2, with stimulation activated during the shaded portion (b) SI angular velocity of a left turn event for S2, with stimulation activated during the shaded portion. Right turns are symmetrical to left turns over the x-axisTable 3Algorithm thresholds and muscles stimulated during collision and turn events for each participantCollisionsTurnsMean of the Peak AP AccelerationAlgorithm ThresholdMuscles StimulatedMean of the Peak SI Angular VelocityAlgorithm ThresholdRight Turn: Muscles StimulatedLeft Turn: Muscles StimulatedS13.93 ± 0.08 g3.76 gPA, GM, ES, QL126.23 ± 13.8 deg./s98.63 deg./sRight ES, Left GM, Right QL, Right/Left PALeft ES, Right GM, Left QL, Right PAS23.83 ± 0.22 g3.39 gPA, GM, ES, QL, IP105.5 ± 2.73 deg./s100.04 deg./sRight ES, Right/Left GM, Right QL, Right/Left PA, Right/Left IPLeft ES, Right/Left GM, Right/Left PA, Right/Left IPS33.87 ± 0.19 g3.48 gGM, ES, QL, HS109.77 ± 4.88 deg./s100.00 deg./ sLeft GM, Left HSLeft ES, Right GM, Right HSS4–––105.30 ± 4.08 deg./s97.10 deg./sRight ES, Right/Left GM, Right, QL, Right/left PALeft ES, Right/Left GM, Left QL, Right/Left PALabels: ES Erector Spinae, GM Gluteus Maximus, QL Quadratus Lumborum, PA Posterior Adductor, IP Iliopsoas, TF Tensor Fascia Latae, HS Hamstring",
                        "Once unique thresholds and patterns of stimulation were determined, participants went through five trials with event-based stimulation and five trials without the controller active. The accuracy of classification and detection delay, defined as the difference between event onset determined by the VICON motion capture system and detection of the event by the algorithm, were computed for each trial to define the efficacy of the classifier. Maximum trunk angle in the AP direction for collisions, medial-lateral (ML) direction for turns, and return time to erect posture were calculated to understand how event-triggered stimulation affected trunk stability. The statistical significance of changes to the trunk angle and return time was determined using repeated measures ANOVA test in Matlab (The Mathworks Inc., Natick, MA) with p < 0.05 denoting significance. The Usability Rating Scale (URS), a seven-point ordinal scale ranging from “very difficult” (− 3) to “very easy” (3), was applied to quantify users’ feeling of safety and stability after each trial [46]. For the purposes of this study, the wording of the URS was adjusted to rate events as “very unstable” (− 3) to “very stable” (3). The non-parametric Wilcoxon Signed Rank Test (Laerd Statistics) was used for statistical analysis of the URS data with p < 0.05 denoting significance. Collision data was only collected and analyzed for Subjects S1, S2, and S3. For turns, all four participants underwent testing with real-time event detection to determine classification accuracy.",
                        "This feasibility study took the form of a series of case studies with participants acting as their own concurrent controls. Primary comparisons were made between baseline (no stimulation) and experimental condition (with event detection and stimulation) for each individual subject without pooling data across participants for group comparisons. Q-Q plots confirmed normalcy of the repeated measures of the outcome variables for each subject, which were treated as independent observations as per standard single-subject research techniques [47–49]. The order of testing was randomized, subjects were blinded as to the condition (baseline or triggered stimulation) and long periods of rest were interspersed between successive trials."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Crash Dummy Testing",
                    "paragraphs": [
                        "At the instant of collision, the acceleration spiked, reaching ±4 g, similar to the peak shown in Fig. 3a. The magnitude of this peak provided a unique feature observed in this event only. Similarly, in data collected during right and left turns, the angular velocity in the SI direction reached magnitudes over 100 deg./s, which provided a distinct feature that was unique for this event, similar to that of Fig. 3b. Left and right turns could be distinguished by the sign of the peak: left turns exhibited a positive peak, while right turns exhibited a negative peak."
                    ],
                    "subsections": []
                },
                {
                    "title": "Sci Testing",
                    "paragraphs": [
                        "The efficacy of the classifier for each subject in terms of detection accuracy and delay for collisions, right turns, and left turns are outlined in Table 4. Across the three subjects who participated in the collision experiments, the classifier accurately detected 93% of the trials. For S3, one trial was a false negative, in which the classifier did not recognize a collision as the maximum AP acceleration did not exceed the detection threshold of 3.48 g. The false negative is likely due to a faulty accelerometer signal. Across all three subjects, the average detection delay was 88 ms ± 48 ms. During right turn trials, the classifier accurately classified 93% of the trials. For S2, one trial was a false negative, in which the classifier did not recognize a right turn as the SI angular velocity did not exceed the detection threshold of 100 deg./s. For left turns, the classifier accurately detected 100% of the trials. The average detection delay across all four subjects during right and left turns was 342 ± 73 ms.Table 4Event detection systemParticipantCollisionRight TurnLeft TurnDetection AccuracyDetection Delay (ms)Detection AccuracyDetection Delay (ms)Detection AccuracyDetection Delay (ms)S15/5110 ± 805/5146 ± 455/5190 ± 100S25/540 ± 204/5365 ± 435/5420 ± 30S34/5118 ± 145/5260 ± 105/5370 ± 50S4––5/5320 ± 205/5343 ± 88",
                        "The effects of FNS on trunk stability for S1, S2, and S3 in terms of maximum AP trunk angle, return time, and URS median are summarized for collisions in Table 5. Figure 4 shows a decrease in the maximum AP trunk angle across the subjects when stimulation was applied. The average maximum AP trunk angle decreased for S1 from 24.78° ± 2.62° without FNS to 18.88° ± 3.23° with FNS and for S2 from 16.10° ± 1.76° without FNS to 9.92° ± 2.24° with FNS, which were both statistically significant differences (p < 0.05). Figure 5a and b display the differences in maximum AP trunk angles and return time to erect posture, respectively, with and without FNS for each subject. Figure 6 shows collision trials with and without stimulation for a participant. In general, the URS scores for S1 and S2 for trials with FNS were higher than trials without FNS. However, none of these results showed a significant difference based on the Wilcoxon Signed Rank Test.Table 5Collision results S1S2S3With FNSWithout FNSP-valueWith FNSWithout FNSP-valueWith FNSWithout FNSP-valueAverage Max AP Trunk Angle (°)18.88 ± 3.2324.78 ± 2.620.03*9.92 ± 2.2416.1 ± 1.760.005*16.23 ± 2.5221.60 ± 3.210.08Average Return Time to Erect (s)0.45 ± 0.070.65 ± 0.130.050.20 ± 0.051.18 ± 1.070.180.73 ± 0.373.94 ± 1.230.007*URS Median100.1320.1111*denotes statistical significance with p < 0.05Fig. 4SCI AP Trunk Angles during Collision. The AP trunk angle during a collision trial with FNS (red lines) and without FNS (blue lines) for S1, S2, and S3. Zero seconds marks the start of the collision eventFig. 5Comparison of Maximum Trunk Angles and Return Time to Erect Posture with and without FNS. a Average maximum AP trunk angles during collision trials with FNS versus without FNS (b) Average return time to an erect seated posture during collision trial with and without FNS (c) Average maximum ML trunk angles during right turns with FNS and without FNS (d) Average maximum ML trunk angles during left turns with FNS and without FNS (* denotes statistical significance with p < 0.05)Fig. 6Collision Event. Collision trial without stimulation (top row) and with stimulation (bottom row). The images include: (1) Initial impact: wheelchair contacts obstacle and rear wheels lift off the ground (2) Maximum AP trunk angle (3) Return to erect posture, which requires manual re-adjustment in the trial without stimulation",
                        "Table 6 summarizes the effects of FNS on trunk stability during right and left turns for all four subjects. On average, S2 experienced increased maximum ML trunk angles with stimulation during right and left turns, as did S3 during right turns. This increase was significant for S2 during left turns, with an average trunk angle of 3.63° ± 0.46° with FNS and 1.84° ± 1.01° without FNS (p = 0.02). Figure 5c and d display the differences in maximum ML trunk angles with and without FNS for each subject. Figure 7 shows left turns with and without stimulation for a participant. The URS scores for S4 were significantly increased with FNS during right turns (Z = − 2.121, p = 0.03). The participants said the FNS triggered too late within the turn for the stimulation to be effective, which resulted in the URS scores for trials with FNS and without FNS to be similar.Table 6Right and left turn results  S1S2S3S4With FNSWithout FNSP-valueWith FNSWithout FNSP-valueWith FNSWithout FNSP-valueWith FNSWithout FNSP-valueRight TurnsMax ML Trunk Angle (°)6.24 ± 0.716.48 ± 1.590.813.72 ± 0.973.11 ± 0.450.3610.46 ± 1.189.55 ± 1.200.42.15 ± 1.655.11 ± 1.490.06URS Median-100.1−3−312211−10.03*Left TurnsMax ML Trunk Angle (°)4.66 ± 0.934.52 ± 0.740.843.63 ± 0.461.84 ± 1.010.02*3.15 ± 0.866.91 ± 2.770.093.80 ± 1.516.51 ± 0.580.06URS Median000.5000.082210−10.06*denotes statistical significance with p < 0.05Fig. 7Turn Event. Left turn trial without stimulation (top row) and with stimulation (bottom row). The images include: (1) Initial turn: wheelchair enters turn and detection is triggered (2) Maximum ML trunk angle: without stim, the trunk leans out of the turn due to inertia, whereas with stim, the trunk leans into the turn (3) Return to erect posture, which requires manual re-adjustment in the trial without stimulation"
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "A threshold-based system for maintaining trunk stability for manual wheelchair users was designed and tested in four subjects with SCI. The system designed and implemented in this study classified destabilizing collisions with an accuracy greater than 90%, which aligns with previous clinical applications of event detection devices [24]. For S1 and S2, the stimulation significantly decreased the maximum AP trunk angle upon the collisions. Because of technical difficulties generating stimulation at the back extensor muscles in S3, FNS during these trials was limited to hip extensors. This limitation may have negatively affected the efficacy of the system to restore trunk stability for this subject. Despite attempts to control the speed at impact with the ramp and barrier set-up, the subject did not always achieve the required velocity of 1.5 m/s prior to collision to produce the desired deceleration profile which would have exceeded threshold and successfully triggered stimulation. A lower threshold or more precise control of the velocity at impact may have improved classification performance above the 93% accuracy observed.",
                "During turns, the classifier also achieved detection accuracy greater than 90%. On average, delay in detection of right and left was 342 ± 73 ms, causing significant delay for stimulation to be activated. With an additional time delay of 100 ms for FNS to generate maximum torque [32], the recruited muscles would not be activated fast enough to be provide the desired response in this application. The participants noticed this delay, stating their trunks felt more stable once stimulation was applied, but the stimulation became effective too late into the turn. One false negative was experienced for S3 during right turns. The thresholds for turns could be less conservative, allowing higher detection accuracy and possibly decreasing the delay of detection. The maximum ML trunk angle was not significantly decreased for any of the participants, and in some cases, increased when stimulation was applied. This may be a result of participants preparing for the sharp turns by using head and shoulder movements to lean into the turn and prevent falling out during trials with and without stimulation applied. To overcome the delay, future studies should consider monitoring the angular acceleration, rather than the angular velocity. Upon post-processing of the data across all four subjects, turn detection using angular acceleration achieved detection within 17.17 ± 11.40 ms. Alternatively, it may be necessary to activate stimulation before the event to effectively restore trunk stability. Investigation in other sensor modalities, such as ladar [50–53] and vision-based methods [53, 54], or sonar readings [55] used to classify terrain in autonomous vehicle and robotic navigation applications, would be necessary to predict destabilizing events before they occur.",
                "During a false negative classification, the controller does not apply FNS during a destabilizing event. In this case, if no secondary methods to maintain stability are in place, the user can fall out of the wheelchair and sustain injuries. Alternatively, a false positive classification would activate FNS during a period of stability. This activation of FNS may surprise the user, but will not produce any injurious consequences. Thus, in the event of a misclassification of this event detection controller, we would prefer false positive classifications.",
                "It should be noted that because these trials were conducted in a laboratory setting and the events were controlled, some subjects assumed safety regardless of whether FNS came on or not as they understood the experiment would be designed to avoid potential injury. This assumption was reflected in participants’ URS scores, particularly S3, who rated all trials with and without FNS as moderately or very stable. Also, in this setting, we only tested the collision and turning events in the ways we designed them, which may not reflect how they occur in real life situations. For example, if an oblique collision happened, deceleration of this event would be detected in both the ML and AP directions, and may not be recognized as a collision using the algorithm discussed in this paper. The accelerometers utilized in this experiment were limited to a range of ±4 g. With this restriction, the mean and standard deviations used to define thresholds may be saturated as the AP acceleration often reached these limits during collision testing, though it is expected for 4 g to sufficiently define a destabilizing collision.",
                "Previous work by Audu et al. [17] has shown success using feedback controlled neuroprostheses for restoring an erect posture in people with SCI in response to external perturbations. Additionally, Patel et al. [18] showed that a powered-wheelchair neuroprosthesis which activated FNS of trunk muscles of able-bodied participants in response to perturbations in the AP direction decreased trunk displacement and velocity. The work presented in this paper shows promise for an event detection system that could decrease wheelchair-related injuries, while increasing users’ independence without the need for restrictive straps or seatbelts. To our knowledge, this is the first study that applies neural stimulation in response to potentially destabilizing wheelchair events detected by wheelchair-mounted IMUs in individuals with SCI during simulated crashes and sharp turns. This system was tested with both implanted and surface stimulation, suggesting its potential applicability for a wider population beyond implant recipients. Larger scale studies with significantly mores subjects are necessary to determine the generalizability of the results and transcend the single-subject feasibility research design.",
                "Future tests will be conducted utilizing accelerometers with higher ranges to fully understand the nature of the signals during collisions. This controller will also be tested outside of the laboratory setting for use in the community and during activities of daily living to understand the clinical significance of this device. Additionally, future tests will examine both a turn and collision simultaneously to ensure the controller responds appropriately to restore trunk stability during the combination of events. Lastly, algorithms will be developed for other potentially destabilizing events, such as rough terrain, bumps, and ramps. With increased trunk stability, manual wheelchair users may feel more confident traversing through unfamiliar environments and care should be exercised to capture such subjective perceptions of safety in addition to biomechanical measures."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "A new threshold-based system that accurately detected potentially destabilizing events and triggered activation of the paraspinal and hip muscles to improve stability and compensate for the disturbances was designed and tested with manual wheelchair users paralyzed by spinal cord injuries. This controller, which monitored the AP acceleration of the wheelchair to detect collisions and SI angular velocity to detect turns, achieved accuracy greater than 90%. Two of the three subjects who received stimulation to the hip and trunk extensor muscles during the collision events experienced increased trunk stability manifested by decreased forward lean and more rapid restoration of erect posture from a flexed position. Larger delays in detection for turns based on angular velocity negatively affected the ability of the controller to return the trunk to erect from a lateral bend, but further investigation with less conservative thresholds and other sensor modalities may fix this issue. The success of the event detection and the ability to apply stimulation to restore trunk posture with neural stimulation in response to destabilizing events shows promise for a device which increases safety and stability of manual wheelchair users during everyday activities."
            ],
            "subsections": []
        }
    ]
}