{
    "id": "https://semopenalex.org/work/W3178537220",
    "authors": [
        "Patrick J. McNally",
        "Niall MacGearailt",
        "Scott David Kelly",
        "Cezar Gaman",
        "Rajani K. Vijayaraghavan",
        "David Coates"
    ],
    "title": "Uses of radio emission spectroscopy for non-contact and in situ diagnostics of low pressure radio frequency plasma processing",
    "date": "2021-07-09",
    "abstract": "We demonstrate that a passive non-contact diagnostic technique, radio emission spectroscopy (RES), provides a sensitive monitor of currents in a low pressure radio frequency (RF) plasma. A near field magnetic loop antenna was used to capture RF emissions from the plasma without perturbing it. The analysis was implemented for a capacitively coupled RF plasma with an RF supply at a frequency of 13.56 MHz. Real-time measurements are captured in scenarios relevant to contemporary challenges faced during semiconductor fabrication (e.g. window coating and wall disturbance). Exploration of the technique for key equipment parameters including applied RF power, chamber pressure, RF bias frequencies and chamber wall cleanliness shows sensitive and repeatable function. In particular, the induced RES signal was found to vary sensitively to pressure changes and we were able to detect pressure and power variations as low as ~2.5 %/mtorr and ~3.5 %/watt, respectively, during the plasma processing during a trial generic plasma process. Finally, we explored the ability of RES to monitor the operation of a multiple frequency low-pressure RF plasma system (f1 = 2 MHz, f2 = 162 MHz) and intermixing products which suggests strongly that the plasma sheaths are the primary source of this non-linear diode mixing effect.",
    "sections": [
        {
            "title": "Results and discussion",
            "paragraphs": [
                "The aim in this paper is to demonstrate to the reader the capability of RES in a number of situations which will be relevant to semiconductor device manufacturing. The intention is not to delve into each measured phenomenon in extreme detail, as each one itself would be worthy of further research papers -and indeed this work is in progress -but rather to identify manufacturing conditions which could be usefully monitored in real time, or near real time, for plasma chamber qualification or process monitoring."
            ],
            "subsections": []
        },
        {
            "title": "Influence of clouding of viewport on the RES monitoring process",
            "paragraphs": [
                "Reduced transparency of chamber viewports due to material coating is a constant challenge for real-time optical monitoring techniques widely used in semiconductor plasma processing 10 . The influence of 'clouding of the viewport', which is typically due to the deposition of contaminants and particulates from the plasma chamber, the substrate being processed, etc. on our RES signal has therefore been studied by monitoring and comparing RF signal capture with optically transparent and opaque viewports. An oxygen plasma was run at 400W applied RF power (13.56 MHz) and 20 mTorr pressure. The RES radio frequency signal data at the 13.56 MHz fundamental frequency were collected continuously for ~7 min at a data analysis rate of 133 kHz (i.e. 10400 Fast Fourier Transform pts in 78 ms). During the run, the optically transparent window was blocked by a completely opaque black tape/cloth (after around 3.5 min), this being used as a proxy for a completely clouded window condition. As shown in figure 1(a), there is no noticeable variation between the intensities of the RES data collected through the transparent and opaque viewports confirming that the RES monitoring technique is not affected by window coatings. This is in contrast to optical signals employed in OES and optical plasma monitoring techniques which were completely blocked by the opaque insert. "
            ],
            "subsections": []
        },
        {
            "title": "Real-time monitoring of power variations in the process chamber using RES",
            "paragraphs": [
                "The voltage induced in the loop antenna placed near the viewport has previously been shown to be proportional to the plasma currents within the bulk of the discharge 12 . Kelly et al. 12 utilised a combined variable consisting of the summation of the fundamental and first four harmonics. This was found to contain the signal power with the vast majority of the induced signal present in the fundamental. In this report we have therefore focused on the signal variation at 13.56 MHz (fundamental) as a monitor for current variations within the plasma. Signal capture is performed over a wide range of operating parameters in order to explore the responsiveness of this technique. Figure 2(a) shows the variation of RES signal amplitude recorded by the near B-field loop at a distance of 1 mm from the plasma viewport as a function of the applied electrode RF power. The chamber was operated by feeding oxygen gas at a 50 sccm flow rate and at a pressure of 100 mTorr. RES signals at the fundamental frequency of 13.56 MHz were collected by varying electrode power from 50W to 500W. The variation in RES signal amplitude is found to range ~10 dB here, which on a linear scale, represents a ten-fold change in signal amplitude (i.e., 10 (10/10) =10). In the inset of figure 2(a) we observe the RES response on an equivalent linear scale for power variations from 50-150 W in 5 W steps. On close examination, we conclude (conservatively) that the technique is sensitive enough to detect a power change as low as 5W with an error of < 0.4%. This demonstrates that RES as a uniquely non-contact, sensitive and in situ monitor of plasma power. Indeed, this impressive sensitivity is further confirmed by the observation that, within the 50-150 W power range where a logarithmic signal change of ~5.5 dB is recorded, we have a corresponding linear change in signal intensity (fig 2(a) inset) of 350 % (i.e., 10 (5.5/10) = 3.5). This allows for a sensitivity estimate of ~3.5 %/W, demonstrating RES as a quite receptive monitor for in situ variations in plasma power. The data presented is the average of 20 scans, and given that the typical data analysis rate can be as large as 19 kHz (i.e., 801 FFT points in 41 ms), this furthermore confirms the potential deployability of RES for continual process monitoring.",
                "Figure 2(b) indicates real-time monitoring of a plasma process (O2 plasma, 400 W, 50 mTorr) with the step changes indicating variations in the RF power. It is very clear that the contactfree RES technique is capable of monitoring RF power changes in real-time during the processing.",
                "The RES loop antenna is placed at a viewport located at a position halfway between the electrodes and is therefore in situ relative to the bulk plasma region. The active current (i.e., I.cosΦ 13,14 ) measured using a V-I probe (further discussion on this below) is found to strongly correlate to the IRES signal at the fundamental frequency (i.e., 13.56 MHz) corroborating that RES is a monitor of the conduction current at this emission line. The conduction current in the bulk is responsible for ohmic heating, the key avenue for power dissipation via electrons which is typically expressed in terms of the electron density (𝑛 𝑒 ) and electron drift velocity (𝜈 𝑑 ) as",
                "where Jc is the conduction current density, d is the gap width between the electrodes which is 4.5 cm or 0.045 m for this reactor [14][15] , and e is the electron charge. This can be also formulated in terms of the electron-neutral collision frequency ( 𝜈 𝑚 (𝑇 𝑒 )) and plasma frequency (𝜔 𝑝 (𝑛 𝑒 )) as 16",
                "where Eb is the (relatively small) bulk plasma electric field, 𝜔 𝑟𝑓 the applied RF frequency and 𝜖 0 the vacuum permittivity. The electron temperature Te [K] is a related via the collision frequency (more discussion below). We can simplify equation (1 b) by further assuming 𝜈 𝑚 ≫ 𝜔 𝑟𝑓 which leads to",
                "We see here that the conduction current is therefore a relatively compounded variable with regard to fundamental plasma variables such as the electron density, electron temperature and electron collision frequency. Note here that the plasma frequency is often expressed using a short hand formulation as 𝜔 𝑝 ~ 5.6 𝑒 4 √(𝑛 𝑒 ) 17 . Given that the bulk electric field is typically small, the proportionality to the plasma frequency (a sole function of electron density) and the collision frequency (a function of the electron energy/temperature and also the details of the collision cross section) can be emphasised here from equation (1 c) as: 𝐽 𝑐 ∝ 𝜔 𝑝 2 /𝜈 𝑚 or 𝐽 𝑐 ∝ 𝑛 𝑒 /𝜈 𝑚 .",
                "In order to understand the variations of fundamental plasma parameters with power we now discuss the variation of key plasma parameters, namely the electron density, electron temperature and electron collision frequency over the power range presented in figure 2 above. Measurements of fundamental plasma parameters for capacitively coupled discharges in O2 for this reactor have previously been reported 12,18 . Kechkar et al. 18 reported ne values at 100 mTorr ranging from ~7 × 10 15 m -3 at 50 W to ~6 × 10 16 m -3 at 500 W applied power with corresponding electron plasma frequencies (ωp) 13 ranging from 0.8 to 2.38 GHz. The electron temperature (Te) values (at 100 mTorr) ranged from 2.3 eV at 50 W to 0.8 eV at 500 W. Substituting into equation (1) above using an O2 mass of 2.6×10 -26 kg for mion, we find the conduction current ranges from 0.214 A at 50 W to 1.1 A at 500 W. To corroborate we compare our calculation with an inline spatially averaged probe measurement measured using a V-I probe (figure 2c 13,18 ). The calculated conduction current ranges are found to be in good agreement with the real part of the spatially averaged current (I.cosΦ), both of them indicating an increasing trend in the current as a function of applied RF power. The RES signal (IRES) also shows an increasing trend as a function of power, similar to I.cosΦ, which again confirms the hypothesis that, for these measurements, the RES probe is a current sensor (conduction current) which measures localized current in the plasma chamber in the vicinity of the loop antenna.",
                "Another important fundamental variable is the electron-neutral collision frequency. To calculate this, first, we employed the Boltzmann equation solver BOLSIG+ 19 with cross section data for electron-O2 elastic collisions from the LXCat database 20 to calculate the rate of electron-O2 collision (i.e. υm) here using this reported range 18 . Rate values (K(Te)) of ~6.3 × 10 -14 [m 3 /s] (for Te=2.25 eV) and ~4.29 × 10 -14 [m 3 /s] (for Te=0.8 eV) were calculated. Next, taking a pressure of 100 mTorr we calculate nO2 [m -3 ] = 2.4× 10 21 [m -3 ] for a temperature of 400 K. The collision frequency is then given by",
                "Values for υm were calculated as ranging from 157 MHz to 104 MHz for powers 50-500W at 100 mTorr shown in figure 2a. This represents a ~50 % change in υm which is relatively narrow compared to ~10 times electron density changes over the same power range. As shown in equation (1 c) above the responsiveness of RES to variation in power (based on monitoring the 13.56 MHz emission line) is therefore primarily a response to changes in the electron density when the power is varied (with fixed pressure) in this context. In the following section we will discover conditions which lead to greater variation in the collision frequency, that is, plasma ignition under changing pressure (for fixed power)."
            ],
            "subsections": []
        },
        {
            "title": "Real-time monitoring of pressure variations in the process chamber using RES",
            "paragraphs": [
                "It is important to investigate the pressure sensitivity of the RES technique in order to verify its usefulness in monitoring small pressure variations during typical semiconductor processing conditions. Again, using the Oxford Instruments Plasmalab 100 tool, an oxygen plasma was operated in the chamber for 15 min at a power and pressure of 200 W and 100 mTorr, respectively, before starting the RES measurements in order to make sure there is a stable plasma condition. The oxygen gas flow was kept constant at 50 sccm and RES data were collected by varying pressure from 10 mTorr to 250 mTorr.   Thus we confirm that the RES probe was sensitive enough to detect a process pressure variation as low as 1 mTorr with an error of <0.1%. Within the 10-25 mTorr pressure range where a logarithmic signal change of ~4 dB is recorded, we have a corresponding linear change in signal intensity of 250 % (i.e., 10 (4/10) = 2.5). This allows for a sensitivity estimate of ~2.5 %/mTorr.",
                "In order to understand and correlate the variation of RES signal with the fundamental plasma parameters, we use an approach similar to that used earlier for interpreting power variations.",
                "For the system used in our measurements, Kechkar et al. 18 have already reported on the fundamental plasma parameters such as ne and Te electron plasma density values for various pressure ranges at 200 W, from which Ic can be calculated using equation (1).",
                "The value of ne at 200 W ranging from ~2.75 × 10 15 m -3 at 10 mTorr to ~2.5 × 10 16 m -3 at 200 mTorr pressure with corresponding electron plasma frequencies (ωp) 13,16 ranging from 0.47 to 1.74 GHz. The electron temperature (Te) values (at 100 mTorr) ranged from 4.5 eV at 10 mTorr to 0.8 eV at 200 mTorr. Substituting these values in equation ( 1) using an O2 mass of 2.6×10 -26 kg for mion, we find the conduction current ranges from 0.1 A at 10 mTorr to 0.59 A at 200 mTorr. These calculated conduction current ranges (values) are in good agreement with I.cosΦ values measured using the V-I probe (figure 3c). Both Ic and I.cosΦ increase as a function of chamber pressure similar to IRES, which again confirms that RES is a current sensing technique which predominantly measures the conduction current in the plasma.",
                "As previously described, in order to calculate the relevant υm, we first extracted rate values using BOLSIG+ 19   Again, this confirms the potential application of this technique in contact-free real-time low pressure plasma process monitoring for, e.g. the semiconductor industry."
            ],
            "subsections": []
        },
        {
            "title": "Real-time monitoring of chamber wall cleanliness using RES",
            "paragraphs": [
                "Cleanliness of the process chamber walls is a very important parameter in plasma-based manufacturing environments. This key variable significantly effects wafer-to-wafer repeatability in IC manufacturing and remains one of the biggest challenges to process reproducibility during semiconductor etch processes [21][22] . We have therefore investigated the capability of RES to monitor chamber wall contamination. In order to simulate a contamination situation, the wall of the single frequency capacitively coupled Oxford Instruments Plasmalab 100 etch chamber was deliberately contaminated by applying positive photoresist (Microposit S1818 TM G2) to a section of aluminium foil (approx. 8 cm × 3 cm), which itself was placed on the wall of the process chamber. In the example shown below, an oxygen plasma was ignited at 500 W applied power and at a pressure of 50 mTorr, by keeping the oxygen flow rate at 50 sccm. RES signals were continuously measured before and after applying photoresist to the aluminium foil. Figure 4 illustrates the variation of RES signal amplitude at the 13.56 MHz fundamental frequency, which was collected continuously and at a data analysis rate of 133 kHz for an interval of 4.3 hours. There is a clear and measurable difference between the amplitudes of the RES signals collected before and after the contamination of the chamber wall with photoresist. The RES signal amplitude from the contaminated wall slowly approaches that of the clean wall as the photoresist is removed during cleaning by the oxygen plasma. The percentage coverage of the contaminated area was ~ 1.5%. Essentially, as the contamination on the wall is removed the intensity of the RES signal increases asymptotically towards the \"clean wall\" condition. A qualitative model of this situation is described in Figure 5. In this simplistic model there is a single RF power supply connected to one plate in the chamber, a grounded plate, two sheaths close to each electrode, each represented by a sheath capacitance CS, together with effective capacitances that couple to the chamber walls (Ceff).The relative dimensions of the powered electrodes, and the topology of the grounded electrode (e.g. whether it includes the chamber walls or not) is not included in this model.",
                "Furthermore, we shall focus our attention on just a single chamber wall. Therefore, the effective plasma-to-chamber wall capacitance, which will be present regardless of dielectric coating (in this case the photoresist) will be designated Ceff = Cw. Any extra capacitance due to the dielectric coating of the wall would be included in an additional term, Cf. Therefore, normalizing the area A of the wall, i.e. A =1, one obtains for this photoresist/dielectric capacitance",
                "where tf is the film/dielectric coating thickness and  is the film dielectric permittivity.",
                "The overall effective capacitive coupling from the plasma to the wall must include the extra capacitive term due to the film coating on the wall. Thus,",
                "for a given RF frequency, . Since to first order CW is constant, the overall effect of impedance, Zeff, decreases as the film thickness decreases. When tf  0, the effective impedance simply returns to the value associated with capacitive coupling to the chamber wall itself (Zeff  1/jCW).",
                "It is fair to say that at this stage the model is qualitative and subject to the many caveats: (i) we assume that the ion current densities are constant and do not participate; (ii) we assume the principle of current balance and that any transient effects shall be ignored and therefore the external currents will be effectively zero and must equate to the sum of the conduction and current densities; (iii) therefore, very simplistically, the displacement and conduction current behaviours mirror each other; (iv) the impact of the molecular components of the photoresist appearing in the plasma bulk is neglected as the precise impact of these on currents in the plasma bulk requires further study. As we shall see further, when examining multiple power supplies connected to the plasma, the sheath displacement currents actually appear to play a major role in RES, so the overall picture is quite complicated. Again, since the displacement current IDisp 1/Zeff, one would expect the amplitude of the recorded RES signal, via conduction current balance, to increase as the contaminant film thickness is progressively reduced to 0. This is indeed what is observed in Figure 4. "
            ],
            "subsections": []
        },
        {
            "title": "Use of RES to monitor plasmas in a multiple frequency chamber",
            "paragraphs": [
                "Multiple frequency RF plasma configurations are attracting enormous interest due to their ability to independently control bulk and sheath properties in processing plasmas with advantages in tailoring ion energy and angular distributions, ion flux and sheath potentials impacting wafer surfaces [23][24][25] . Hence, it is very important to develop non-invasive probes to monitor and ultimately control plasma processes in these multiple frequency chambers. Here we present results on RES measurements performed on a Lam EXELAN multiple frequency chamber, which consists of combination of driving frequencies at 2 MHz, 27 MHz and 162 MHz. In figure 6 we see the captured RES spectrum collected from an Ar/O2 plasma which was operated using a combination of 162 MHz and 2 MHz frequencies with applied powers of 250 W and 50 W, respectively. The majority of the captured RES signal is found within an approximately 30 MHz frequency span of the main drive frequency at 162 MHz. Frequency mixing components of the 162 MHz signal with the lower 2 MHz frequency are clearly seen in the captured RES data, an example of which is shown in figure 5. The frequency heterodyning phenomenon is observable via the appearance of frequency sidebands appearing on both sides of the main drive frequency of 162 MHz. Beat frequencies with a regular frequency shift (Δf) of 2 MHz are clearly observed, indicating that the nonlinear plasma medium facilitates these effects. A straightforward toy model is given below to explain this behaviour qualitatively. Again, the aim here is to use the simplest possible model in order to explain the origin of the recorded data. The development of a more sophisticated model is underway, and this will be reported later.",
                "In order to do this, the simplest possible circuit model capable of reproducing heterodyning/intermixing products is that of a diode mixer. Therefore we shall remove all circuit components with the exception of the two power supplies, connected via a diplexer to a diode, which models the non-linear sheath response. Note also that only a single diode, representing a single sheath is modelled. Later models will certainly need to be more sophisticated, e.g. incorporating other circuit elements, two sheaths, RF power supply matching units, stray impedances, and a more complete model of the plasma itself. We shall apply an electronic engineering small-signal modelling approach and the usual notational convention will be used for upper and lower case lettering 26 . This simple model is shown below in Figure 7. In this situation (5)   where 1 in this instance is the lower of the two frequencies, 1 = 2(2x10 9 .t), and 2 is the higher of the two frequencies, 2 = 2(162x10 9 .t), and V1, V2 are the amplitudes of the two signals, respectively.",
                "Since the current (𝐼 𝐷 ) -voltage (𝑉 𝐷 ) dependence of the diode can be straightforwardly represented as",
                "where IS is the reverse saturation current, VD is the voltage applied to the diode, Te is the electron temperature in the plasma and represented by Vt herein, and the approximation to a simple exponential dependence is made based on the assumption that VD > V t . Since Vt is equivalent to the electron Temperature in eV then this assumption seems safe above a few",
                "Please note that we use the conventional current through the diode is represented by ID which should not be confused with the displacement current terms defined earlier in the plasma analysis (IDisp). Considering that the amplitudes of the generated harmonics are relatively small, then we can approximate the situation using conventional small signal analysis. The full details of this is given in Appendix A. Therefore, for given DC bias currents and voltages of ID and VD0, respectively,",
                "For v t operating around V and V t V v t",
                "For this analysis we are only interested in the small signal components and DC (bias) components terms can be ignored. The differential transconductance component 0 (8",
                "is interesting in that the presence of each successive derivative of this term introduces 1/Vt term into the expression for the small signal current variations, iD(t). The ideality factor,  is introduced to capture deviations from ideality in the diode-based modelling. The measured magnetic fields, B (t), measured by the near-field antennae will, to first order under the Biot-Savart Law, be related to the small signal current variations, iD(t). For the purposes of this early-stage analysis, its exact value is not relevant. Two principal factors emerge: (i) one can observe that multiple heterodyning (sideband) components are generated as captured by the multiple powers of v n (t), n = 1, 2, 3,… and therefore the sheaths themselves act as effective \"diode mixers\" for the multiple applied power supplies ; (ii) the Vt term also appears in this equation in the form V -n (t) , n=0, 1, 2,…; since this Vt term is directly proportional to the electron temperature (Te) it is feasible that the measurement of the intensities of these sidebands can ultimately be correlated to electron temperature(s) in the plasma chamber. Similar comments will also apply to electron density, ne, as it is the IS component in the large signal diode model described in eq. ( 6) and therefore will contain terms related to ne. For the purposes of this analysis, which is qualitative, it has been ignored. However, this is work for future study which is currently ongoing.",
                "It is clear that the introduction of multiple power supplies produces heterodyned sidebands around the principal RF supply source, those sidebands being related to the frequency of the lower frequency \"ion control\" power supply. We again emphasize that this analysis is very much qualitative and major caveats apply, but, in this limited capacity it can offer insight into the emergence of sidebands found in the RES signal for this multi-frequency powered reactor. A full model will need an appropriate mapping of the diode current equations into a more complete circuit model which includes lumped components (R, L, C) which capture the full operation of the plasma system from the RF power supply, matching units, stray impedances, typically two plasma sheaths, and the plasma bulk itself."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "The sensitivity of a contact-free, non-invasive method ('radio emission spectroscopy' (RES)) is investigated for the real-time monitoring of low pressure plasma processing of necessity in semiconductor fabrication scenarios. We demonstrate that the RES technique is sensitive enough to detect pressure and power variations as low as ~2.5 %/mTorr and ~3.5 %/W, respectively, during the plasma processing. A key advantage of the RES technique is demonstrated, namely, its independence on the degree of viewport transparency in comparison to contact-free optical monitoring techniques widely employed in the industry. Qualitative models were used to describe the use of RES to monitor chamber cleaning and to describe how nonlinearities within a plasma system driven by two power supplies can lead to intermixing products, via plasma sheath non-linear diode mixing effects."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [
                "We have recently reported on the demonstration of a novel approach for the remote sensing of a low pressure plasma in the radio near field 12 . A schematic of the apparatus is given in Figure 1 therein. RES measurements were performed during plasma processing using two commercial plasma chambers, an Oxford Instruments Plasmalab 100 capacitively coupled 13.56 MHz driven system and a modified Lam EXELAN 2300 multiple frequency chamber 18,27 . The chambers were pre-cleaned by running an oxygen/Ar plasma to clean the process chamber walls and to obtain a stable plasma. The radio frequency RES signals were collected using a near B-field loop antenna (diameter = 21.6 mm), located at a distance of 1 mm from the plasma viewport, with the plane of the loop oriented perpendicular to the viewport of the plasma chamber 12 . In the case of Oxford Instruments Plasmalab 100 capacitively coupled reactor the intercepted RES signal is found to consist of a primary emission at the driving frequency (13.56 MHz) plus numerous emissions at harmonics of the driving frequency 12 . In the dual frequency source (Lam EXELAN 2300) intermodulation (beating) effects between the driving frequencies and their harmonics is observed. For v t operating around V and V t V v t",
                "For this analysis we are only interested in the small signal components and DC (bias) components terms can be ignored.",
                "Note the that the differential transconductance component is",
                "Access, the author has applied a CC BY public copyright licence to any Author Accepted Manuscript version arising from this submission.       "
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "This publication was supported in part by Science Foundation Ireland (SFI) through the I-Form Advanced Manufacturing Research Centre, (Grant Number 16/RC/3872). This work is funded by Enterprise Ireland's Commercialisation Fund Project Support Scheme (Project # CF2014-4300), and the European Union's European Regional Development Fund (ERDF). CG and RKV would like to thank staff at the Plasma Research Laboratory at NCPST, DCU, for providing the research facilities. RKV & PMN would like to thank Mr. Conor Murphy for technical support. This publication has emanated from research supported in part by a grant from Science Foundation Ireland under Grant number 16/RC/3872. For the purpose of Open"
            ],
            "subsections": []
        },
        {
            "title": "Data availability",
            "paragraphs": [
                "Datasets generated during and/or analysed during the current study are available from the corresponding author on reasonable request."
            ],
            "subsections": []
        },
        {
            "title": "Appendix A",
            "paragraphs": [
                "For the small-signal analysis of the toy model for a dual-frequency driven plasma we perform the analysis for given DC bias currents and voltages of ID and VD0, respectively,",
                "Author contributions R.K.V, S.K., D.C., C.G. and N.M.G. performed the experiments. S.K. and P.M.N. designed and fabricated the original RES monitor, which was subsequently improved by D.C. and N. M.G. R.K.V. processed the data for modelling. S.K. and P.M.N. implemented the data analysis and modelling. All authors contributed to the writing of the manuscript. P.M.N. the conceptions and supervised the experiments and revised/amended the original manuscript."
            ],
            "subsections": []
        },
        {
            "title": "Competing interests",
            "paragraphs": [
                "The authors declare no competing interests."
            ],
            "subsections": []
        },
        {
            "title": "Additional information",
            "paragraphs": [
                "Correspondence and requests for materials should be addressed to P.M.N."
            ],
            "subsections": []
        }
    ]
}