{
    "id": "https://semopenalex.org/work/W3135289593",
    "authors": [
        "Michael Romalis",
        "T. W. Kornack",
        "Mark Limes",
        "W. Lee",
        "Vito Giovanni Lucivero",
        "E. L. Foley"
    ],
    "title": "Heading errors in all-optical alkali-metal-vapor magnetometers in geomagnetic fields",
    "date": "2021-06-04",
    "abstract": "Alkali-metal atomic magnetometers suffer from heading errors in geomagnetic fields as the measured magnetic field depends on the orientation of the sensor with respect to the field. In addition to the nonlinear Zeeman splitting, the difference between Zeeman resonances in the two hyperfine ground states can also generate heading errors depending on initial spin polarization. We examine heading errors in an all-optical scalar magnetometer that uses free precession of polarized $^{87}text{Rb}$ atoms by varying the direction and magnitude of the magnetic field at different spin polarization regimes. In the high polarization limit where the lower hyperfine ground state $F = 1$ is almost depopulated, we show that heading errors can be corrected with an analytical expression, reducing the errors by two orders of magnitude in Earth's field. We also verify the linearity of the measured Zeeman precession frequency with the magnetic field. With lower spin polarization, we find that the splitting of the Zeeman resonances for the two hyperfine states causes beating in the precession signals and nonlinearity of the measured precession frequency with the magnetic field. We correct for the frequency shifts by using the unique probe geometry where two orthogonal probe beams measure opposite relative phases between the two hyperfine states during the spin precession.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "Total-field atomic magnetometers measure the magnitude of the magnetic field by directly measuring the Larmor precession frequency of the electron spins of alkalimetal atoms in the presence of the field. They can operate in geomagnetic fields (10 -100 µT) and have a wide range of applications, including space magnetometry [1][2][3][4][5][6], fundamental physics experiments [7][8][9][10], biomedical imaging [11][12][13][14], archaeological mapping [15,16], mineral exploration [17][18][19][20], searches for unexploded ordnance [21][22][23][24], and magnetic navigation [25][26][27][28][29]. The highest sensitivity for scalar magnetometers has been achieved in a pulsed pump-probe arrangement with a sensitivity of 0.54 fT/ √ Hz in a field of 7.3 µT [30]. However, practical magnetometers need to operate in geomagnetic field around 50 µT. Recently an all-optical pulsed gradiometer has reached a magnetometer sensitivity of 14 fT/ √ Hz over a broad range including Earth's field [31]. One major and practical challenge of Earth's field magnetometers is the control of heading errors which otherwise significantly limit their accuracy. They cause the measured field values to depend on the orientation of the sensor with respect to the field, especially presenting problems for the magnetometry-based navigation [32][33][34][35].",
                "All alkali-metal magnetometers suffer from heading errors because alkali-metal isotopes have nonzero nuclear spin of I > 1/2. There are mainly two physical sources of heading errors: the nonlinear Zeeman splitting due to mixing of ground Zeeman states |F, m and the difference in Larmor frequencies for the two hyperfine manifolds due to the nuclear magnetic moment. The non-linear splitting corresponds to a difference of 2.6 nT between neighboring Zeeman states for 87 Rb in a 50 µT field. At this field, the linear difference between Zeeman resonance frequencies in F = 1 and F = 2 states is 200 nT. These splittings of the Zeeman resonance lines produce broadening and asymmetries in the lineshape depending on the orientation of the sensor with respect to the field. For 87 Rb in a 50 µT field, the orientation-dependent shifts are on the order of 15 nT. Previous approaches of reducing the heading errors in other alkali vapor systems have focused on suppressing the nonlinear Zeeman splitting, including double-modulated synchronous optical pumping [36], light polarization modulation [32,33], measurements of high-order polarization moments [37][38][39][40], use of tensor light-shift to cancel quadratic Zeeman splitting [41], and spin-locking with an additional radio-frequency (RF) field [42]. However, most of them have some practical drawbacks such as complexity in implementation or requiring use of RF fields. These methods also do not cancel frequency shifts associated with the difference of Zeeman resonances for F = 1 and F = 2 states. In magnetometers operated with continuous optical pumping, the optimal sensitivity is achieved for spin polarization generally near 50%. As a result, there is usually a significant population in F = 1 state which changes depending on the orientation of the magnetometer relative to the magnetic field.",
                "In this paper, we study heading errors as a function of both the direction and magnitude of magnetic field at a wide range of initial spin polarization and implement several methods of their correction. With the all-optical, free-precession 87 Rb magnetometer, we use short-pulse pumping technique to achieve very high initial spin polarization near 95% regardless of the field orientation such that the initial spin state is well-defined. The population of F = 1 state becomes negligible, and Zeeman coherences decay much faster in F = 1 state than in F = 2 state due to spin-exchange collisions between alkali-metal atoms. In this high polarization limit, we can minimize the polarization-dependent heading errors. We also find that the average Larmor frequency is given by a simple analytical expression that depends on the angle between the pump laser and the magnetic field. We show this angle can be determined directly from the spin precession signals. Thus one can calculate a correction for the heading error in real time. We verify the accuracy of the magnetometer as a function of both the magnitude and direction of the magnetic field with an accuracy of about 0.1 nT, suppressing heading errors by two orders of magnitude in a 50 µT field.",
                "At lower spin polarization we observe interesting effects due to non-negligible contribution from the F = 1 state. The difference in Zeeman frequencies of F = 1 and F = 2 states generate beating which is observable in the measurement of spin precession signals. Moreover, the measured spin precession frequency is no longer linear with the magnetic field, even though the splitting itself is linear with the field. Here we use two probe beams to further correct for these heading errors: one is collinear to the pump beam, and the other is perpendicular to the pump. These orthogonal probe beams measure opposite relative phases of the two hyperfine ground states during their precession, allowing one to cancel any effects from the splitting in their Larmor frequency by averaging the two probe measurements. This is due to the fact that Zeeman coherences precess around the magnetic field in opposite directions for F = 1 and F = 2 states. As a result, we cancel the additional frequency shifts by averaging the measurements of the two orthogonal probes. Furthermore, we compare our experimental results with a density matrix simulation to easily separate signals from F = 1 and F = 2 states and investigate frequency shifts due to the nuclear magnetic moment."
            ],
            "subsections": []
        },
        {
            "title": "II. ANALYTICAL CORRECTION OF HEADING ERRORS",
            "paragraphs": [
                "For 87 Rb atoms in ground states with electronic spin S = 1/2, the energy of the Zeeman sublevel |m with total atomic angular momentum F is given by the Breit-Rabi formula [43]:",
                "(1) where x = (g s + g I )µ B B/ ω hf , g s and g I = µ I /(µ B I) are the electronic and nuclear Landé factors respectively, µ B is the Bohr magneton, B is the magnetic field strength, ω hf is the hyperfine splitting, I is the nuclear spin, and the ± refers to the F = I ±1/2 hyperfine components. In the Earth-field range, the m → m -1 Zeeman transition frequency is given by [36]:",
                "where µ eff = (g s µ B + g I µ B )/(2I + 1), ω L = (±µ effg I µ B )B/ is the Larmor frequency, and ω rev = µ 2 eff B 2 / 2 ω hf is the quantum-beat revival frequency which is nonlinear to the field magnitude. The Larmor frequencies for the two hyperfine states are approximately opposite, but not exactly equal because of the g I µ B term. The difference of absolute frequencies is proportional to the magnetic field and equal to 1.4 kHz at 50 µT, where the Larmor frequency is equal to 350 kHz for 87 Rb atoms. The nonlinear Zeeman effect in Earth's field causes a splitting of 18 Hz between neighboring Zeeman transitions, which is non-negligible for magnetometer operation.",
                "The measured transverse spin component can be written in terms of the 87 Rb ground state density matrix as a weighted sum of coherences oscillating at different Zeeman frequencies, given by",
                "where ρ F m,m is the off-diagonal element of density matrix for an ensemble of 87 Rb atoms in coupled basis |F m , and A F m,m is its amplitude. We leave a detailed discussion of the density matrix analysis to Sec. B of the Appendix. The measured spin precession frequency is therefore a combination of different Zeeman transition frequencies. Any variation in sensor's orientation with respect to the field can change the relative strength between the coherences, shifting the measured precession frequency. In the high spin polarization limit we derive in Sec. C of the Appendix the heading error correction:",
                "where ν = ω/2π is the measured precession frequency, ν hf is the hyperfine splitting frequency, P is degree of initial spin polarization, and θ is the angular deviation of the pump beam from the nominal magnetometer orientation where the pump laser is perpendicular to the magnetic field (see Sec. III for more details). We assume the relative distribution of atoms in F = 2 state is given by spin-temperature distribution. The spin temperature distribution is realized when the rate of spin-exchange collisions is higher than other relaxation rates [44]. It is also realized during optical pumping on a pressure broadened optical resonance with fast J-damping in the excited state [45]. These conditions are reasonably well-satisfied in our experiment. In a 50 µT Earth's field, the maximum size of the correction given by Eq. 4 is on the order of 15 nT with full polarization (P = 1). Fig. 1 shows the comparison between heading error correction calculated with Eq. 4 and numerical simulation of the density matrix evolution. The density matrix model, described in more detail in Sec. D of the Appendix, includes optical pumping, free spin precession evolution, and signal fitting as done in the experiment. They agree well in high polarization limit. Thus, if we experimentally find the initial polarization and extract the angle θ, we can use Eq. 4 to find the heading-error free magnetic field. At low polarization more complex behavior is expected due to the incomplete depopulation of F = 1 state."
            ],
            "subsections": []
        },
        {
            "title": "III. A PULSED-PUMP DOUBLE-PROBE 87 RB MAGNETOMETER",
            "paragraphs": [
                "We use a compact integrated magnetometer with schematic shown in Fig. 2. It consists of a 87 Rb vapor cell, electric heaters, a pump laser, two probe lasers, and two polarimeters. The cell has height and width of 5 mm, and length of 10 mm. It contains internal mirrors that allows pump and probe beams to reflect back and forth many times inside the cell. The probe beams exit the cell after 11 passes. The sensor is placed inside a magnetic shielding on a rotational stage that allows rotation of the whole assembly relative to the magnetic field. The multipass cell is filled with enriched 87 Rb vapor and 700 Torr N 2 buffer gas. It is typically heated to 100 • C giving a 87 Rb number density of 4 × 10 12 /cm 3 as estimated based on measured transverse spin relaxation rate which is further described in Sec. B of the Appendix.",
                "The pump laser is directed in x direction in Fig. 2, circularly polarized and tuned to the 87 Rb D1 line. It is operated in a pulsed mode with several watts instantaneous power per microsecond pulse. It has an adjustable repetition rate, number, and width of pulses. The usual pumping cycle consists of 190 pulses with a 70 ns single pulse width that is much shorter than the Larmor period τ = 2π/γB z . For a resonant build-up of the spin polarization, the pulse repetition rate is synchronous with the Larmor frequency. The magnetic field is created by a concentric set of cylindrical coils inside two layers of µ-metal magnetic shields. The spin free precession is detected by two off-resonant vertical-cavity surface-emitting laser (VCSEL) probe beams which are linearly polarized. One is in x direction, along the pump propagation (\"horizontal probe\"), and the other is in y direction, orthogonal to the pump (\"vertical probe\"). Each balanced polarimeter consists of a half-wave plate, a polarizing beamsplitter, and two photodiodes with differential amplification. The two differential signals",
                "are recorded by a digital oscilloscope and have the general form of a sine wave with exponential decay plus an offset:",
                "where V 0 is the initial amplitude, ν is the precession frequency, d is the phase delay, T 2 is the transverse spin relaxation time, and V DC is the offset. The lower panel of Fig. 2 shows the experimentally measured signals at 50 µT. The vertical probe shows a smaller signal than the horizontal probe as it has a smaller interaction volume from a smaller overlap region with the pump beam. An external frequency counter (HP53310A) measures the fre-FIG. 3. Pump-probe geometry of a 87 Rb magnetometer. Initially the pump and the horizontal probe beams are in x; the vertical probe beam is in y; the magnetic field is in z. If the sensor gets tilted, we apply two successive rotations: rotation by φ about x to x y z system and rotation by θ about y to x y z system. In the final configuration, the pump and the horizontal probe beams are in x , and the vertical probe beam is in y .",
                "quency of the signal by detecting its zero-crossings during the free precession measurement time T m = 3 ms, which is comparable to T 2 . We add external high-pass filters with f c = 20 kHz to cancel DC offsets in the signals going to the frequency counter. We continuously measure the frequency and read the center frequency of its histogram distribution with a standard deviation of about 1 mHz. Fig. 3 describes the pump-probe geometry after a change in sensor orientation. The horizontal probe is always collinear to the pump, and the vertical probe is always orthogonal to the pump. In the initial configuration (θ = 0 • ), the pump and horizontal probe are in x, and the vertical probe is in y. After a sensor rotation, the pump beam and horizontal probe are in x direction and tilted by θ from the initial magnetometer orientation x where the field B z is perpendicular to the spin. The vertical probe is in y direction at a small angle φ = 11 • from y. With the tilt of the sensor, the rotation matrix transforming x, y, z to x , y , z coordinates is",
                "In the final configuration, the pump and the horizontal probe are therefore in x = cosθ x + sinθ ẑ, and the vertical probe is in ŷ = -sinθ sinφ x + cosφ ŷ + cosθ sinφ ẑ. "
            ],
            "subsections": []
        },
        {
            "title": "IV. MEASUREMENT OF HEADING ERRORS",
            "paragraphs": [
                "The pulsed pump laser can achieve very high initial spin polarization near 95%. This minimizes the polarization-dependent heading errors. In Fig. 4(a) we plot the simulated signals for each hyperfine state separately, showing how much each hyperfine state contributes to S x for initial atomic spin polarization P = 0.95. The F = 1 signal has a very small initial amplitude compared to the F = 2 signal and decays faster during the precession. To maximize the polarization experimentally, we adjust the width and number of pump pulses until the initial signal amplitude saturates.",
                "In order to apply Eq. 4 to correct for the heading error one must know the tilt angle θ of the magnetometer as shown in Fig. 3. In the absence of other information about the field direction one can find the angle θ from the signal itself by considering the DC component of the spin precession signal. Fig. 4(b) and 4(c) show the measured signals at θ = 45 • which have nonzero time-varying DC offsets compared to Fig. 2. The DC offset measures the spin component parallel to the magnetic field. As shown in Fig. 3, the sensor has a small tilt about x by φ such that the vertical probe is not perfectly transverse to the field B z . As a result, the vertical probe signal also gains a small DC offset.",
                "From Eq. 6, the initial optically pumped spin is S = S x = Scosθ x + Ssinθ ẑ. Ignoring the spin relaxation for simplicity, the precessing spin at angular velocity ω is then S = Scosθ cosωt x + Scosθ sinωt ŷ + Ssinθ ẑ. The horizontal probe detects the spin component",
                "The first term is the projection of S x component which oscillates. The second term is the projection of S z component, resulting in the DC offset. Therefore, the ratio of the initial DC offset to maximum AC amplitude is S DC /S AC = tan 2 θ. We show in Fig. 5 good agreement between this equation and our measurements, allowing us to estimate the magnitude of θ.",
                "We can also determine the magnitude of φ based on the vertical probe signal. The vertical probe detects the spin component",
                "The ratio of the initial DC offset to maximum AC amplitude is then S DC /S AC = sin θ sin φ/ 1 -cos 2 θ sin 2 φ. The lower panel of Fig. 5 shows the measurement of the S DC /S AC ratio of the vertical probe signal, which gives an estimation of φ = 11.2 • . We cannot find the sign of θ and φ independently since they are coupled as shown in the expression of S DC /S AC .",
                "To measure the heading errors we tilt the sensor with respect to the field in the range -65 • < θ < +65 • and measure the spin precession frequency with the frequency counter. It is important to separate heading errors due to spin interactions from heading errors associated with remnant magnetization of magnetometer components. Rotation of the sensor relative to the field changes the projection of the remnant magnetic fields onto the leading field, resulting in frequency shifts that are hard to distinguish from atomic heading errors. The sensor was constructed with a minimal number of magnetic components. However, there are small amounts of polarizable ferrous materials present in the laser mounts and other electronic components. We have degaussed these components and turned off heater electric currents during the measurement. Nevertheless, small offsets on the order of a few nT due to remnant magnetization of the sensor remained. To account for these offsets, we periodically reversed the polarization of the pump laser with a half-wave plate and took measurements with both polarizations. This method is often used to cancel heading errors by averaging the signals from the two pump DC/AC = tan θ. For the vertical probe, it is fit to: DC/AC = sin θ sin φ/ 1 -cos 2 θ sin 2 φ + a, where φ = 11.2 • is the tilt angle of the vertical probe (see Fig. 3) and a = -0.018 is the offset when θ = 0 • . polarizations [32,33,46]. In this case we took the difference of the signals to separate the heading errors due to the spin interaction and those due to magnetization of the components in the sensor head."
            ],
            "subsections": []
        },
        {
            "title": "V. HEADING ERRORS AS A FUNCTION OF THE SENSOR ORIENTATION",
            "paragraphs": [
                "Fig. 6 reports the measurement of heading errors in 10 µT and 50 µT fields as a function of the sensor's tilt angle θ. If we take a difference between the two measurements at opposite pump polarizations, the field values at θ = 0 • are canceled to the order of 0.01 nT. The angle θ is determined from spin precession signals with an uncertainty of about 1 • . Fitting to Eq. 4 gives an estimation of the initial polarization, about P = 0.9 for the parallel probe signal and P = 0.7 for the vertical probe signal. As described previously, the vertical probe has a smaller overlap with the pump beam than the horizontal probe and measures optical rotation from atoms that are less polarized. In a 10 µT field, the heading errors are expected to be only 4% of those in 50 µT. The inset of Fig. 6 shows that the residual errors are comparable and in fact slightly smaller for the case of B = 50 µT. This in- Based on fitting to Eq. 4 (dashed lines), the initial polarizations of the horizontal and vertical probe signals are estimated to be P = 0.90 and P = 0.68 respectively. The heading error estimation at full polarization P = 1 is also shown (blue continuous lines). Inset: The residuals of fitting of the heading errors. In B = 10 µT the vertical (black circles) and horizontal (red circles) probe measurements have residuals with standard deviation of 0.15 nT and 0.098 nT respectively. In B = 50 µT the vertical (black diamonds) and horizontal (red diamonds) probe measurements have residuals with standard deviation of 0.12 nT and 0.07 nT respectively.",
                "dicates that the residuals are likely due to imperfection in the cancellation of remnant magnetization of sensor components. Even so, we show that the heading errors due to atomic physics effects are reduced by about two orders of magnitude by the correction given by Eq. 4.",
                "When the initial spin polarization is less than unity, there is some contribution from F = 1 state. This manifests itself as an oscillation in the instantaneous spin precession frequency as illustrated in Fig. 7. The simulated spin precession signals are fit to Eq. 5 in individual time segments of 0.05 ms to show the time dependence of the spin precession frequency. We find that it oscillates at 1.4 kHz, which is equal to the difference between Zeeman frequencies for F = 1 and F = 2 states at 50 µT. We confirmed that at other magnetic fields the beating frequency is proportional to the magnetic field. As expected, the amplitude of the oscillations becomes larger for smaller spin polarization. The decay rate of the oscillations depends on the T 2 of the F = 1 coherences. This beating effect is not sensitive to the orientation of the sensor, so the oscillations at θ = 0 and θ = 45 • are similar. However, for θ = 45 • one can observe a small additional slow drift of the spin precession frequency. This drift is due to differences in the relaxation rate of F = 2 coherences, as discussed in more detail in section VI.",
                "We find that the oscillations in the instanteneous spin precession frequency have opposite sign for the horizontal and vertical probe beams, as illustrated in the bot- tom panel of Fig. 7. As the two hyperfine states have opposite spin precession directions, the horizontal probe detects maximum signal when S x F =2 and S x F =1 are out of phase while the vertical probe detects maximum signal when they are in phase. We can therefore cancel the frequency oscillation by averaging the two probe measurements, which reduces the amplitude of frequency oscillations by more than two orders of magnitude. This was experimentally verified as shown in the inset of the lower Fig. 7, which is based on fitting the experimental signal to Eq. 5. The two probe measurements show opposite sign of frequency oscillation. The oscillations are larger for the vertical probe beam because it detects a lower average spin polarization. The amplitudes of the experimentally observed oscillations in the instantaneous spin precession frequency appear larger than those predicted by the simulation. This could be due to spatial non-uniformity of the polarization in the cell which is not taken into account in the simulation. "
            ],
            "subsections": []
        },
        {
            "title": "VI. HEADING ERRORS AS A FUNCTION OF THE ABSOLUTE MAGNETIC FIELD",
            "paragraphs": [
                "In addition to investigating heading errors as a function of the angular orientation of the sensor, we also study them as a function of the absolute magnetic field. We measure the spin precession frequencies as a function of magnetic fields at high (P = 0.85) and low (P = 0.2) polarizations with the vertical probe. For these measurements it is necessary to create a well-controlled linear magnetic field ramp. The measurements are performed inside magnetic shields which generate a significant hysteresis of the magnetic field [47]. To create a reproducible magnetic field we apply a stair-case ramp as illustrated in Fig. 8. The magnetic field scan is repeated several times without interruptions. The current through the magnetic field coil is monitored using a precision shunt resistor while the repetition rate of the optical pumping pulses is continuously adjusted under computer control to match the Larmor frequency. After several up and down sweeps, we average both the field and frequency measurements during the same time period to suppress any field fluctuations. Fig. 9 shows the measured precession frequency as a function of fields with P = 0.85 at θ = 0 • . With a quadratic fitting function, the frequency for upward and downward field sweeps show high curvature with opposite signs. This is due to the magnetic shield hysteresis, and averaging the two measurements reduces the curvature and residuals of linear fitting by two orders of magnitude. Fig. 10 shows results of averaging the upward and downward field sweep measurements at two different polarizations P = 0.2 and 0.85. Even though the first order heading error correction at θ = 0 • is zero from Eq. 4, the low polarization result (P = 0.2) shows a curvature of -16 × 10 -4 Hz/µT 2 , much higher than the curvature for high spin polarization (P=0.85) of 2 × 10 -4 Hz/µT 2 . Fig. 11 shows the simulated curvature as a function of polarization. The curvature is negligible in high polarization limit but starts to increase at P < 0.7. The curvature C = -16.52 × 10 -4 Hz/µT 2 at P = 0.2 with the ver- tical probe agrees well with experimental measurement. This nonlinear frequency shift is due to the increase in population of F = 1 state. The horizontal and vertical probe beams have opposite curvature signs. So averaging of the two signals can cancel the non-linearity of the frequency, similar to the cancellation of the instantaneous frequency oscillations described previously.",
                "To understand the origin of the non-linearity we simulate the evolution of individual coherences. When θ = 0 • the F = 2 state has two distinct coherences and F = 1 state has one distinct coherence. Their initial amplitudes and relaxation are shown in Fig. 12 for P = 0.85 and P = 0.2. The relative strength of F = 1 coherence is much higher at P = 0.2 than at P = 0.85. As the nuclear spin causes splitting of Zeeman frequencies between two hyperfine states, their interference can generate the observed frequency shift at low polarization. To check the origin of the non-linearity we nulled the nuclear magnetic moment in the simulation by setting g I = 0. The curvature at P = 0.2 then reduced to C = 0.2 × 10 -4 Hz/µT 2 . This suggests that the nonlinear frequency shift at low polarization is interestingly caused by the linear Zeeman interaction of the nuclear magnetic moment."
            ],
            "subsections": []
        },
        {
            "title": "VII. CONCLUSION",
            "paragraphs": [
                "In this paper we have studied heading errors in 87 Rb magnetometer as a function of both the direction and magnitude of magnetic field at different initial spin polarizations. The novel double-probe sensor has shown high sensitivity and significant heading error suppression.",
                "In the high spin polarization limit, we can correct for heading errors by using analytical expression which is derived based on the density matrix formalism. With the correction, the measured field accuracy is about 0.1 nT in a 50 µT Earth's field, suppressing heading errors by two orders of magnitude. We verify linearity of the measured Zeeman frequency with respect to the field up to Earth's field with a deviation of less than 0.05 nT. At lower polarization, we observe additional heading errors due to the difference in Larmor frequency of the F = 1 and F = 2 states. This generates beating in the measured frequency, and it is no longer linear with the magnetic field. Numerical simulation shows that this nonlinearity is interestingly caused by the linear Zeeman interaction of the nuclear magnetic moment. To cancel these frequency shifts, we average measurements from two orthogonal probe beams that measure opposite relative phases between the two hyperfine coherences.",
                "These results are useful in reducing systematics of alkali-metal-vapor atomic magnetometers operating at geomagnetic fields, especially those in navigation systems [25][26][27][28][29]. We suggest methods of cancelling heading errors with wide range of spin polarizations, and the pumpprobe geometry presented in this paper can give a realtime correction of heading errors. Furthermore, the use of a small sensor and VCSEL lasers makes it suitable for development of compact and miniaturized sensors [48]. state, which is described in Eq. 1. This can be further simplified in Earth's field using x",
                "1 as [36] E(F, m) = -",
                "The Landé factors for m → m -1 Zeeman-transitions from Eq. 1 are shown in Fig. 13. For 87 Rb atoms in geomagnetic-strength fields the difference between Zeeman resonances for F = 1 and F = 2 states dominates over nonlinear splitting within each hyperfine state."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX B: THE DENSITY MATRIX FORMALISM",
            "paragraphs": [
                "Instead of a single wave function, we use a density matrix to describe an ensemble of atoms in a mixed state. For N -number of atoms, the density operator is",
                "where |ψ is the single wave function. The evolution of the ground density matrix of 87 Rb atoms is given by [45] ",
                "The first term corresponds to the evolution from the ground state free-atom Hamiltonian of Eq. A1. It includes the hyperfine coupling and the Zeeman interaction of the electron and nuclear spin with the external magnetic field. In addition, there is spin relaxation due to several collisional mechanism. The second term describes the spin-exchange collisions between 87 Rb atoms where R SE is the spin-exchange rate, S is the expectation value of spin, and S is the spin operator. This process preserves total spins but redistributes populations in the hyperfine states such that it destroys the spin coherence. This is because the two hyperfine states precess in opposite directions. The third term characterizes the spin-destruction collisions of 87 Rb atoms with other 87 Rb atoms and buffer gas N 2 molecules where R SD is the spindestruction rate. The spin-destruction collisions destroy the total spin of colliding atoms. The general collisional rate is given by",
                "where n is the atomic number density, σ is the effective collisional cross-section, and v = 8k B T /πM is the relative thermal velocity between the colliding atoms. Here T is the temperature, k B is the Boltzmann constant, and M is the reduced mass of the atoms. We operate with 87 Rb density on the order of 10 12 /cm 3 , where the spin exchange rate between alkali-metal atoms dominates over other relaxation rates. This allows us to measure the 87 Rb density from the transverse spin relaxation time T 2 = 8/R SE in the low polarization regime with the spinexchange cross-section σ SE = 1.9 × 10 -14 cm 2 [30]. The fourth term describes the optical pumping effect where R OP is the optical pumping rate. Here s = ie × e * is the mean photon spin vector where e = E/|E| is the polarization unit vector. The fifth term characterizes diffusion of 87 Rb atoms to the cell walls in the presence of buffer gas molecules where D is the diffusion constant.",
                "The density matrix of an alkali atom can be decomposed into a purely nuclear part which is",
                "The collisions and optical pumping are sudden with respect to the nuclear polarization such that they only destroy the electron polarization and preserve the nuclear part as shown in Eq. B2.",
                "The transverse spin component is a combination of coherences oscillating at different frequencies. Its expectation value is",
                "For ∆m = ±1 Zeeman transitions, F = 2 state has four coherences while F = 1 has two coherences.",
                "If the probe laser is far-detuned from the D1 line of 87 Rb atoms such that the detuning is much larger than the ground state hyperfine splitting, its optical rotation angle is proportional to S x as [30] ",
                "where r e = 2.82 × 10 -13 cm is the classical electron radius, f osc = 0.34 is the oscillator strength of the D1 transition of 87 Rb atoms, n is the vapor density, l is the path length of the probe beam, and (ν -ν α ) is the probe detuning."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX C: DERIVATION OF AN ANALYTICAL EXPRESSION OF THE HEADING ERROR CORRECTION",
            "paragraphs": [
                "Due to the nontrivial energy structure of 87 Rb atoms, the measured spin precession frequency is a weighted sum of different Zeeman transition frequencies. Let us assume that the spin is initially fully polarized (P = 1). The system is in a pure state as all spins are along the magnetic field B z , which is ρ 0 = |2 2 2 2|. We then rotate the spin about +y by angle θ relative to the field. This is equivalent to applying the rotation operator D y = e -iθ Fy which is represented by the Wigner D-matrix as d where A 2 m,m-1 is derived from Eq. B5. Here θ = 90 • -θ is the angle between the spin orientation and the nominal magnetometer orientation where the field is perpendicular to the spin as shown in Fig. 3. The pulsed 87 Rb magnetometer can achieve a high initial spin polarization, about P = 0.9 where F = 1 state is almost depopulated. In this condition the atom is in a mixed state of F = 2 sublevels which approximately follows the spin-temperature distribution [44]. For high optical pumping rate for a pressure broadened optical line, one also reaches spin-exchange equilibrium [45]. This is analogous to the thermal equilibrium, and the relative population in each Zeeman sublevel is described by the spin-temperature distribution:",
                "where Z = where ν = ω/2π is the measured Larmor precession frequency. To simplify this equation we set g I to zero in the second term."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX D: NUMERICAL SIMULATION METHOD",
            "paragraphs": [
                "We simulate the optical rotation signal by solving the density matrix equation of Eq. B2 with parameters matching the experimental condition and calculate S x with Eq. B5. The spin-exchange rate is R SE = n Rb σ SE vRbRb = 3.6 × 10 3 1/s where n Rb = 4.4 × 10 12 /cm 3 , σ SE = 1.9 × 10 -14 cm 2 , and vRbRb = 430 m/s. The relative thermal velocity is calculated at cell temperature T = 100 • C. The spin-destruction rate is R SD = n Rb σ RbRb vRbRb + n N2 σ N2Rb vRbN2 = 110 1/s where σ RbRb = 9 × 10 -18 cm 2 , σ RbN2 = 1 × 10 -22 cm 2 [50], vRbN2 = 620 m/s, and n N2 = 1.7 × 10 19 /cm 3 . We fit the simulated signal to Eq. 5 for T m = 3 ms to estimate the spin precession frequency. The simulated signal has a slightly longer T 2 than the measured signal by 0.5 ms. This can be due to field gradients or diffusion broadening [51]."
            ],
            "subsections": []
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "paragraphs": [
                "This work was supported by the DARPA AMBIIENT program."
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX A: 87 RB GROUND ENERGY LEVELS",
            "paragraphs": [
                "The ground state Hamiltonian of 87 Rb atoms in the presence of external magnetic field is [49] ",
                "where A hf is the hyperfine constant, I is the nuclear spin, S is the electron spin, B is the field vector, and g S and g I = µ I /(µ B I) are respectively the electron and nuclear g-factors. The first term corresponds to the hyperfine interaction, and the later terms represent the Zeeman interaction of electron and nuclear spin respectively. If we define F = I + S as the total atomic angular momentum, each hyperfine state contains 2F + 1 magnetic sublevels. The eigenvalue of the Hamiltonian gives the energy of the"
            ],
            "subsections": []
        }
    ]
}