{
    "id": "https://semopenalex.org/work/W3009559016",
    "authors": [
        "Vassilios I. Sikavitsas",
        "Robert L. Shambaugh",
        "Aaron D. Simmons",
        "Michael L. Felder"
    ],
    "title": "Effects of Flow Rate on Mesenchymal Stem Cell Oxygen Consumption Rates in 3D Bone-Tissue-Engineered Constructs Cultured in Perfusion Bioreactor Systems",
    "date": "2020-03-08",
    "abstract": "Bone grafts represent a multibillion-dollar industry, with over a million grafts occurring each year. Common graft types are associated with issues such as donor site morbidity in autologous grafts and immunological response in allogenic grafts. Bone-tissue-engineered constructs are a logical approach to combat the issues commonly encountered with these bone grafting techniques. When creating bone-tissue-engineered constructs, monitoring systems are required to determine construct characteristics, such as cellularity and cell type. This study aims to expand on the current predictive metrics for these characteristics, specifically analyzing the effects of media flow rate on oxygen uptake rates (OURs) of mesenchymal stem cells seeded on poly(L-lactic acid) (PLLA) scaffolds cultured in a flow perfusion bioreactor. To do this, oxygen consumption rates were measured for cell/scaffold constructs at varying flow rates ranging from 150 to 750 microliters per minute. Residence time analyses were performed for this bioreactor at these flow rates. Average observed oxygen uptake rates of stem cells in perfusion bioreactors were shown to increase with increased oxygen availability at higher flow rates. The residence time analysis helped identify potential pitfalls in current bioreactor designs, such as the presence of channeling. Furthermore, this analysis shows that oxygen uptake rates have a strong linear correlation with residence times of media in the bioreactor setup, where cells were seen to exhibit a maximum oxygen uptake rate of 3 picomoles O2/hr/cell.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Current challenges in tissue engineering include finding reproducible means to create tissue-engineered constructs that are viable for transplants into humans. Existing methodologies require the destruction of constructs to determine their characteristics, such as cellularity and the development of extracellular matrices and cell phenotypes. The absence of appropriate predictive models has delayed the progress of tissue-engineered products from benchtop to market. While many solutions exist to determine characteristics in 2D systems, 3D systems lack predictive models that can accurately and consistently describe the important factors that will ultimately bring tissue-engineered bone constructs to a large-scale production. For perfusion bioreactor systems, several indicators of metabolic activity have shown predictive power, such as glucose consumption and oxygen consumption [1].",
                "Fluids 2020, 5, 30 2 of 14 Oxygen monitoring as an indicator of metabolic activity, cell proliferation, and culture progression is a promising method for the on-line measurement of tissue-engineered construct characteristics. Many 3D perfusion systems use a fluorescent material to monitor oxygen entering and exiting the construct [1][2][3][4][5][6]. Flow perfusion systems that measure oxygen uptake have successfully measured metabolic activity and cell proliferation in a 3D construct, allowing for the non-destructive monitoring of cells in vitro [3,5,7]. As cells differentiate, they have been shown to change metabolic pathways, often resulting in altered oxygen uptake rates (OURs). Oxygen monitoring in conjunction with other on-line monitoring systems can account for these changes and predict the onset and/or progression of differentiation [1]. However, it is important to first characterize additional factors that could alter oxygen uptake rate, such as flow rate and scaffold geometry.",
                "In the broadest sense, oxygen uptake rates by cells depends on oxygen availability. For 2D systems, where oxygen availability is mediated by linear diffusion through media, stem cell oxygen uptake rates have been shown to exhibit Michaelis-Menten kinetics with respect to oxygen concentrations [8]. In 3D static systems, oxygen availability is limited by diffusion alone, causing significant gradients for any system where cells are distributed throughout a 3D scaffold [9,10]. Three-dimensional flow perfusion bioreactors are associated with increased oxygen mass transfer rates (compared to static cultures) and mechanical stimulation due to the presence of shear forces. In these bioreactor designs, the media flows directly through the interconnected pores of a scaffold, mitigating most mass transport limitations [11][12][13]. The regulation of this mass transport phenomenon, alone, was found to improve control over cell behavior in larger tissue-engineered constructs [14,15]. Mechanical stimulation in the form of shear stress has been shown to have a positive effect on the differentiation of mesenchymal stem cells into osteoblasts in systems where flow is present [11,14,16,17]. This combination of factors has led to flow perfusion bioreactors becoming the primary choice for bone-tissue-engineering applications.",
                "The indirect contribution of flow rate to oxygen uptake rate is often neglected when determining cell-specific models. Flow rate has the potential to change flow characteristics in the construct, thereby altering oxygen availability to the cells. Predictive models can be developed to determine the average observed cell oxygen uptake rate with respect to flow rate. Residence time of media in the construct is flow rate specific, and can potentially be used as a tool for cellularity and differentiation models to be expanded in order to address a variety of bioreactor and scaffold types. Since the residence time distribution analysis corresponds to the specific scaffold architecture and bioreactor design used, this study can serve as a methodology that can be adopted when alternative architectures are explored.",
                "We hypothesize that increasing the flow rate will yield an increase in the average observed cell-specific oxygen uptake rate due to the increased oxygen availability and diminished gradients in the direction of flow in the construct. Furthermore, changes in flow characteristics will likely alter the oxygen distribution in the construct, which will subsequently affect the average observed cell-specific oxygen uptake rate. Lastly, we hypothesize that we can associate the experimentally determined residence times found in this analysis to standard models found in literature. We can then use this comparable model as a means to efficiently determine the average observed cell-specific oxygen uptake rate for a particular flow rate without the need for additional studies to be conducted."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Cell Culture",
                    "paragraphs": [
                        "Rat mesenchymal stem cells (rMSC) were extracted from six-week-old male Wistar rats weighing approximately 175-200 g (Envigo; Hsd:Wi) using methods approved by the University of Oklahoma Institutional Animal Care and Use Committee (IACUC). To isolate rMSCs, bone marrow from the femurs and tibias of rear legs were first extracted and suspended in α-Minimum Essential Media (αMEM; Sigma Aldrich) supplemented with 10% Fetal Bovine Serum (FBS; Atlanta Biologicals) and distributed into T75 cell culture flasks, where they were allowed to incubate (37 • C, 95% humidity, 5% CO 2 ) for four days. Cultures were then gently rinsed with phosphate-buffered saline (PBS;",
                        "Fluids 2020, 5, 30 3 of 14 Sigma-Aldrich) to remove non-adherent cells. Remaining cells were considered passage zero rMSCs, and were either passaged for immediate use or placed into cryogenic storage.",
                        "All cell cultures and bioreactors used αMEM supplemented with 10% FBS and 1% antibiotic/antimycotic (Life Technologies). Cells were incubated at 37 • C, 95% humidity, and 5% CO 2 until they reached 80% confluency, at which time they were lifted using trypsin (Sigma-Aldrich), centrifuged at 1100 RCF for 5 min to create a cell pellet, resuspended in αMEM, and distributed into T75 cell culture flasks at a concentration of approximately 500,000 cells per flask. During expansion of cells, media were replaced every other day. All studies were completed with cells at passage two."
                    ],
                    "subsections": []
                },
                {
                    "title": "Scaffold Production and Preparation",
                    "paragraphs": [
                        "Spunbonded fiber scaffolds were utilized due to their high seeding efficiencies and reproducibility, and were made in accordance with previously published procedures [18]. These scaffolds were composed of randomly aligned poly(L-lactic acid) (PLLA) sheets that were stacked and compressed to form a mat of 20-µm diameter fibers with approximately 85% porosity. PLLA (NatureWorks LLC; grade 6251D; 1.4% D enantiomer; MW = 108,500 kDa) pellets were used to produce the fibers. Scaffold disks approximately 1.25 mm in height and 8 mm in diameter were cut from sheets of spunbonded fibers for use in bioreactor systems. Four individual scaffold disks were stacked within a cassette, creating a single scaffold approximately 5 mm in height and 8 mm in diameter.",
                        "Following ethylene oxide sterilization (AnPro 74i), scaffold disks were placed into 95% ethanol under vacuum to purge air from the interior of the scaffolds. Once all air had been removed from the scaffold disks, they were submerged in sterile PBS to leach out remaining ethanol. Scaffold disks were then placed in αMEM supplemented with 50% FBS, and placed into the incubator for two hours prior to seeding, to facilitate cell attachment."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bioreactor Setup and Seeding",
                    "paragraphs": [
                        "Bioreactor bodies were assembled prior to cell seeding. Assembly involved placing the cassette into the bioreactor body and connecting tubing to the reservoir system. Cassettes used were cylindrical containers that held scaffolds in the bioreactor body. Furthermore, the cassettes had rubber seals at the top and bottom to ensure flow passes through the scaffolds rather than around the periphery of the cassette. Figure 1 shows a diagram of the bioreactor body, cassette, and scaffold setup. The system was purged of air in the biological hood by flowing media through the system. It was then allowed 4 h to reach an equilibrium temperature of 37 • C in the incubator.",
                        "A tapered-bottom cassette was secured into the bioreactor body to ensure the consistent positioning of scaffolds. Four scaffold disks were stacked for each construct. Arrows in Figure 1 indicate the flow of media through the scaffolds, and all dimensions are to scale.",
                        "Cells were lifted using trypsin, then suspended in αMEM at a concentration of two million cells per 150 µL. To complete the seeding, two individual scaffold disks were placed into the cassette, 75 µL of the cell suspension was pipetted onto the scaffolds, another single scaffold disk was placed into the cassette, 75 µL of the cell suspension was pipetted onto the scaffold disk, and finally the last scaffold disk was placed into the cassette. Immediately following cell introduction, the bioreactors were subjected to an oscillatory seeding regiment. The flow of media through the construct was first allowed to flow in the forward direction at 150 µL/min for 1 min, then was reversed and allowed to flow in the backward direction at 150 µL/min for 1 min. This was done for 30 min, and the procedure finished in the reverse direction. Following the oscillatory seeding procedure, the cells were allotted 2 h to adhere under static conditions. The entire volume of media in the bioreactor and reservoir systems was then replaced to remove un-adhered cells from the system. A tapered-bottom cassette was secured into the bioreactor body to ensure the consistent positioning of scaffolds. Four scaffold disks were stacked for each construct. Arrows in Figure 1 indicate the flow of media through the scaffolds, and all dimensions are to scale.",
                        "Cells were lifted using trypsin, then suspended in MEM at a concentration of two million cells per 150 L. To complete the seeding, two individual scaffold disks were placed into the cassette, 75 L of the cell suspension was pipetted onto the scaffolds, another single scaffold disk was placed into the cassette, 75 L of the cell suspension was pipetted onto the scaffold disk, and finally the last scaffold disk was placed into the cassette. Immediately following cell introduction, the bioreactors were subjected to an oscillatory seeding regiment. The flow of media through the construct was first allowed to flow in the forward direction at 150 L/min for 1 min, then was reversed and allowed to flow in the backward direction at 150 L/min for 1 min. This was done for 30 min, and the procedure finished in the reverse direction. Following the oscillatory seeding procedure, the cells were allotted 2 h to adhere under static conditions. The entire volume of media in the bioreactor and reservoir systems was then replaced to remove un-adhered cells from the system."
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Data Collection",
                    "paragraphs": [
                        "The method by which oxygen concentrations were collected revolved around the use of RedEye oxygen sensing patches (Ocean Optics). These patches were contained within an oxygen sensing module (OxyMod), originally developed by Simmons et al. [1]. Oxygen concentrations were measured at the exit of the bioreactor body to determine the total oxygen consumed by the cells. Each of the OxyMod sensors was calibrated to 0.173 and 0 mmol O2/L concentrations in deionized water prior to each setup. The sensors contained a material integrated into the sensor matrix. This material contained two fluorescent molecules: ruthenium and Pt-porphyrin complexes [19]. The fluorescence of this material was correlated with the oxygen concentrations in the media [19]. A fiber optic probe emitting blue light at 450 nm excited the material, and the resulting fluorescence was captured using "
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Data Collection",
                    "paragraphs": [
                        "The method by which oxygen concentrations were collected revolved around the use of RedEye oxygen sensing patches (Ocean Optics). These patches were contained within an oxygen sensing module (OxyMod), originally developed by Simmons et al. [1]. Oxygen concentrations were measured at the exit of the bioreactor body to determine the total oxygen consumed by the cells. Each of the OxyMod sensors was calibrated to 0.173 and 0 mmol O 2 /L concentrations in deionized water prior to each setup. The sensors contained a material integrated into the sensor matrix. This material contained two fluorescent molecules: ruthenium and Pt-porphyrin complexes [19]. The fluorescence of this material was correlated with the oxygen concentrations in the media [19]. A fiber optic probe emitting blue light at 450 nm excited the material, and the resulting fluorescence was captured using the same probe. The data were then transferred to the NeoFox Viewing System, and fluorescence data were related to the oxygen concentration in the media using the Stern-Volmer equation [19].",
                        "Oxygen data were collected once, two days after initial seeding. Prior to data collection, all bioreactors were run at 150 µL/min. To complete data collection, the desired flowrate was adjusted and allowed to reach equilibrium for 45 min. Immediately following the 45-min time period, oxygen data were collected at the exiting stream of each construct. The oxygen concentration in media entering the bioreactor body was found to be fully saturated with oxygen (0.173 mmol O 2 /L). The flow was then changed to the next flow rate, and another 45 min was allotted before the next data collection period. The flow rates tested were 150 to 750 µL/min, increasing by 150 µL/min during each trial. All testing was completed within 3 h, so the effects of cell proliferation were assumed to be negligible. Half of the samples were collected for flow rates incrementally increasing from 150 to 750 µL/min and the other half for flow rates incrementally decreasing from 750 to 150 µL/min. Readings taken from the NeoFox Viewing System were oxygen saturation values ranging from 0% to 100%, where 100% was the maximum oxygen saturation for media calculated using Henry's Law. The percent saturation values for the exiting stream were used to find the concentration of oxygen in the exiting stream, and this value with the flowrate was used to determine the observed oxygen uptake rate (OUR) for the construct (Equation ( 1)). The bioreactor body used was impermeable to oxygen, so it was assumed that the oxygen drop was solely due to oxygen consumption by cells within the construct.",
                        "where",
                        "The observed OUR of the construct was then used to find the observed OUR on a per-cell basis. Zero order kinetics were assumed to find an average observed OUR value, in accordance with Equation (2).",
                        "where N cell = Number of cells"
                    ],
                    "subsections": []
                },
                {
                    "title": "Cellularity Quantification",
                    "paragraphs": [
                        "Immediately following all oxygen data collection, scaffolds were removed from each cassette, gently rinsed with sterile PBS, and placed into individual microcentrifuge tubes containing 1 mL nanopure water. Each scaffold was subjected to three freeze/thaw cycles utilizing a freezer at -20 • C. Freeze/thaw cycles were completed over two days. Samples were frozen for 12 h then thawed, the scaffold was shredded, the solution was vortexed for 10 s, and the samples were refrozen. The resulting mixture constituted the cell lysate for each sample taken. The cell lysate was used to determine the total number of cells adhered to the scaffold of each cassette. A double stranded (ds) DNA assay with standards (Quant-iT PicoGreen dsDNA Assay; Life Technologies) was completed to determine the total amount of DNA within each scaffold. First, 43 µL was pipetted into a 96 well plate, and standard solutions were made at concentrations ranging from 0.1 to 3 µg DNA per mL. Then, 257 µL of a buffer and PicoGreen solution (10 mM Tris-HCl, 1 mM EDTA, pH 7.5, 0.75 µL PicoGreen Dye) was pipetted into each well, and the plate was incubated at room temperature in the dark for 5 min. The fluorescence was then read at an excitation wavelength of 495 nm and an emission wavelength of 520 nm. The standards were used to determine the amount of DNA in each sample. This amount of DNA was then associated with a particular cellularity, on the basis of knowing the DNA content of each individual cell. For undifferentiated rMSCs, a value of 4.5 picograms of DNA per cell was used, with this value remaining constant for the duration of the experiment [20]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Residence Time Analysis",
                    "paragraphs": [
                        "A residence time distribution function was derived from experimental data and subsequently integrated to determine the residence time for each flow rate tested in the bioreactor setup. The experimental design was adapted from work completed by Simmons [20]. A step-input system was utilized for all tests completed, whereby deionized water initially filled the system. A dye solution containing Trypan Blue (0.4% in Solution; Sigma) was then pumped through the bioreactor system, and the exiting stream was analyzed for dye concentration (c(t)). The dye reservoir was placed on Fluids 2020, 5, 30 6 of 14 a stir plate for the duration of experiments to ensure it was well mixed. Entry and exit effects were neglected in this analysis, and the total volume depicted in Figure 1 was used in the residence time analysis. To do this, absorbance measurements at 590 nm were taken of the elute and compared to an absorbance measurement of 100% dye solution prior to passing through the system (c 0 ). Breakthrough time (t bt ), the time at which dye was first detected in the elute, was recorded. Samples were then collected every 30 s, and data collection stopped after the elute reached 99% of the initial concentration of dye, with the final reading constituting the final time point (t f ). The data points were then fit to Equation (3) [20]. Equation (3) has previously been shown to closely fit the concentration profiles produced by the residence time distribution analysis.",
                        "where",
                        "A least squares regression was conducted to fit experimental data to Equation (3). The resulting formula was then utilized to determine the cumulative distribution function, F(t), and the residence time distribution function, E(t), shown by Equations ( 4) and (5).",
                        "The residence time could be calculated by taking the following integral:",
                        "A numerical integration was completed to determine the average residence time, and the resulting values for each flow rate were used for oxygen uptake rate analysis. Analysis was run three times per flow rate.",
                        "Experimental data were also used to determine the theoretical residence time for different reactor types that could potentially serve as a model for our bioreactor setup. For plug flow reactors, the residence time was determined using Equation (7).",
                        "where The residence time for a tubular laminar flow reactor was also calculated after determining if the flow in the bioreactor system was laminar using the Reynolds number. The Reynolds number was calculated using Equation (8)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Reynold s Number",
            "paragraphs": [
                "where",
                "Once the Reynolds number was determined, any value less than 1 was considered laminar flow for a packed bed reactor [21].",
                "To determine the theoretical residence time for the laminar tubular reactor, the residence time distribution function was approximated using Equation ( 9) [22].",
                "where τ = 2 × Breakthrough Time (t bt ) t = Time (seconds)",
                "The average residence time was then calculated using a numerical integration as shown in Equation (6).",
                "Following residence time analysis, a visual study was completed to determine the flow patterns within the construct. Trypan Blue (MW=872.88 g/mol) dye solution was pumped through the scaffold until dye was initially seen in the effluent. Once dye was detected in the effluent, the flow was stopped and scaffold disk layers were removed from the cassette. Four stacked scaffold disks were used for all bioreactors and the analysis run, and these disks were taken out so that each layer could be analyzed for the presence of dye. This was completed to visually confirm flow profiles within the scaffold."
            ],
            "subsections": [
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "Following data collection and analysis, a one-way ANOVA followed by a Tukey's HSD test was conducted to determine statistical significance (p-value < 0.05)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results and Discussion",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Oxygen Concentration Drop",
                    "paragraphs": [
                        "The concentration of oxygen entering and exiting the construct was used to determine the observed oxygen uptake rate by the constructs, and ultimately normalized on a per-cell basis. Prior to determining these values, the drop in media oxygen concentration across the construct was measured.",
                        "The total concentration drop in oxygen across the construct is shown in comparison to the flow rate in Figure 2. As the flow rate was increased, a linear decrease in oxygen concentration drop across the construct can be seen. A linear regression was performed and an R 2 value of 0.98 was found. Dashed lines in the figure show the 95% confidence interval for the linear regression analysis, and error bars represent mean ± SEM. A sample size of n = 8 was used for analysis.",
                        "As the flow rate of media through the construct increased, a linear decrease in oxygen drop was observed. Figure 2 shows this decreasing trend. As the flow rate increased, the amount of time that oxygenated media were exposed to cells decreased, with the bulk oxygen concentration remaining high. It was expected that the concentration of oxygen in media leaving the construct would increase, Fluids 2020, 5, 30 8 of 14 thereby yielding a lower net change in oxygen concentration. These values of oxygen concentration were then used to determine the rate of oxygen consumed by the entire construct, which was then used to find the average oxygen uptake rate per cell. conducted to determine statistical significance (p-value < 0.05)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results and Discussion",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Oxygen Concentration Drop",
                    "paragraphs": [
                        "The concentration of oxygen entering and exiting the construct was used to determine the observed oxygen uptake rate by the constructs, and ultimately normalized on a per-cell basis. Prior to determining these values, the drop in media oxygen concentration across the construct was measured. As the flow rate of media through the construct increased, a linear decrease in oxygen drop was observed. Figure 2 shows this decreasing trend. As the flow rate increased, the amount of time that oxygenated media were exposed to cells decreased, with the bulk oxygen concentration remaining high. It was expected that the concentration of oxygen in media leaving the construct would increase, "
                    ],
                    "subsections": []
                },
                {
                    "title": "Cellularity Quantification",
                    "paragraphs": [
                        "Construct analysis yielded cellularity values for use in oxygen uptake rate analysis. A single bioreactor setup was used for all ensuing experiments. All constructs were analyzed for DNA quantity, and this DNA concentration was used to determine the cellularity of the construct by dividing the total DNA by 4.5 picograms DNA per cell for non-differentiating MSCs. An average cellularity of 224,000 ± 18,000 cells was found for all constructs, which is consistent with other comparable studies [1]. Cell distribution throughout the scaffold was assumed to be uniform, which is consistent with a previous work that utilized oscillatory seeding [5]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Uptake Rate (OUR)",
                    "paragraphs": [
                        "In Figure 3, the average oxygen uptake rate on a per-cell basis is shown in comparison to the flow rates tested. As flow rate increased, a linear increase in average oxygen uptake rate on a per-cell basis was observed. Error bars in the figure represent mean ± SEM. A sample size of n = 8 was used for analysis. ANOVA with a post-hoc Tukey's test was completed to calculate significance \"*\" (p < 0.05).",
                        "The average observed oxygen uptake rates on a per-cell basis initially showed a linear increase, followed by a plateau at approximately 3 picomoles O 2 /hr/cell. These values for the oxygen uptake rate are consistent with the values obtained by Simmons et al. in 3D perfusion bioreactor systems, but are still an order of magnitude greater than other literature values [1,8]. In 3D systems, oxygen uptake rates for undifferentiated cells have been recorded at approximately 1.5 picomoles O 2 /hr/cell at flow rates of 150 µL/min [20]. However, in 2D systems, the maximum oxygen uptake rate recorded was approximately 0.1 picomoles O 2 /hr/cell [8]. These differences could possibly be caused by the variation in cell confluency. Maximum oxygen uptake rates have been measured approaching 100% confluency in 2D cultured cells, whereas those in 3D cultured systems have been at a lower confluency [5,8]. This difference could also be caused by the increased convection present in flow perfusion systems where oxygen delivery does not rely on diffusion, and there are lower external mass transport limitations [22,23]. The plateau reached at 450 µL/min may indicate that non-differentiating mesenchymal stem cells will reach a maximum value of oxygen consumption of 3 picomoles O 2 /hr/cell. flow rates tested. As flow rate increased, a linear increase in average oxygen uptake rate on a per-cell basis was observed. Error bars in the figure represent mean  SEM. A sample size of n = 8 was used for analysis. ANOVA with a post-hoc Tukey's test completed to calculate significance \"*\" (p < 0.05). The average observed oxygen uptake rates on a per-cell basis initially showed a linear increase, followed by a plateau at approximately 3 picomoles O2/hr/cell. These values for the oxygen uptake rate are consistent with the values obtained by Simmons et al. in 3D perfusion bioreactor systems, but are still an order of magnitude greater than other literature values [1,8]. In 3D systems, oxygen uptake rates for undifferentiated cells have been recorded at approximately 1.5 picomoles O2 /hr/cell at flow rates of 150 L/min [20]. However, in 2D systems, the maximum oxygen uptake rate recorded was approximately 0.1 picomoles O2/hr/cell [8]. These differences could possibly be caused by the variation in cell confluency. Maximum oxygen uptake rates have been measured approaching 100% confluency in 2D cultured cells, whereas those in 3D cultured systems have been at a lower confluency [5,8]. This difference could also be caused by the increased convection present in flow perfusion systems where oxygen delivery does not rely on diffusion, and there are lower external "
                    ],
                    "subsections": []
                },
                {
                    "title": "Residence Time Distribution Analysis",
                    "paragraphs": [
                        "The residence time was analyzed by evaluating effluent leaving the bioreactor system. These residence times decreased with an increasing flow rate. Additional analysis was done, whereby experimentally obtained values for the breakthrough time and time at which effluent concentration reached 99% of original concentration were used to determine the theoretical mean residence time for laminar tubular flow reactors with a fully developed flow. Experimentally obtained values were also compared to theoretical values of residence time for plug flow reactors. These comparisons are seen in Figure 4. Studies were completed in the absence of cells.",
                        "Fluids 2020, 5, x 10 of 14 mass transport limitations [22,23]. The plateau reached at 450 L/min may indicate that nondifferentiating mesenchymal stem cells will reach a maximum value of oxygen consumption of 3 picomoles O2/hr/cell."
                    ],
                    "subsections": []
                },
                {
                    "title": "Residence Time Distribution Analysis",
                    "paragraphs": [
                        "The residence time was analyzed by evaluating effluent leaving the bioreactor system. These residence times decreased with an increasing flow rate. Additional analysis was done, whereby experimentally obtained values for the breakthrough time and time at which effluent concentration reached 99% of original concentration were used to determine the theoretical mean residence time for laminar tubular flow reactors with a fully developed flow. Experimentally obtained values were also compared to theoretical values of residence time for plug flow reactors. These comparisons are seen in Figure 4. Studies were completed in the absence of cells.",
                        "Prior to calculating the theoretical time for laminar tubular flow reactors, it was important to verify that the flow within the bioreactor system was laminar for all flow rates. Reynolds numbers were calculated for each flow rate, under the assumption that the media solution had approximately the same viscosity and density values as water. The cutoff for laminar flow could be approximated in packed bed reactors. Reynolds numbers were calculated, ranging from 0.6 at 150 L/min to 3.0 at 750 L/min. Due to the high porosity of the scaffold, the cutoffs were likely lower than those for a typical packed bed reactor.",
                        "The residence time values for laminar flow, plug flow, and experimentally obtained values are shown in Figure 4, where experimental values can be compared directly to what would be expected for each of these reactor types operating under the designated flow conditions. Experimental values were nearly identical to those found for laminar tubular flow reactors for all flow rates. Similar results could be seen for plug flow reactors when compared to experimental data at lower flow rates. However, values began to differ at higher flowrates above 600 L/min, potentially indicating a transition to a new flow type.  Prior to calculating the theoretical time for laminar tubular flow reactors, it was important to verify that the flow within the bioreactor system was laminar for all flow rates. Reynolds numbers were calculated for each flow rate, under the assumption that the media solution had approximately the same viscosity and density values as water. The cutoff for laminar flow could be approximated Fluids 2020, 5, 30 10 of 14 in packed bed reactors. Reynolds numbers were calculated, ranging from 0.6 at 150 µL/min to 3.0 at 750 µL/min. Due to the high porosity of the scaffold, the cutoffs were likely lower than those for a typical packed bed reactor.",
                        "The residence time values for laminar flow, plug flow, and experimentally obtained values are shown in Figure 4, where experimental values can be compared directly to what would be expected for each of these reactor types operating under the designated flow conditions. Experimental values were nearly identical to those found for laminar tubular flow reactors for all flow rates. Similar results could be seen for plug flow reactors when compared to experimental data at lower flow rates. However, values began to differ at higher flowrates above 600 µL/min, potentially indicating a transition to a new flow type.",
                        "Theoretical values for residence time were computed for laminar tubular reactors and plug flow reactors, then compared with experimental values. Error bars in Figure 4 represent mean ± SEM. A sample size of n = 3 was used for analysis."
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Uptake Rate Relative to Residence Time",
                    "paragraphs": [
                        "The average oxygen uptake rate on a basis is shown in Figure 5 as compared with the residence times experienced at the associated flow rate. A linear regression was performed. Dashed lines in the figure show the 95% confidence interval for the linear regression analysis, and error bars represent mean ± SEM. A sample size of n = 8 was used for analysis for the OUR cell. A sample size of n = 3 was used for the analysis of residence time.",
                        "Fluids 2020, 5, x 11 of 14"
                    ],
                    "subsections": []
                },
                {
                    "title": "Oxygen Uptake Rate Relative to Residence Time",
                    "paragraphs": [
                        "The average oxygen uptake rate on a per-cell basis is shown in Figure 5 as compared with the residence times experienced at the associated flow rate. A linear regression was performed. Dashed lines in the figure show the 95% confidence interval for the linear regression analysis, and error bars represent mean  SEM. A sample size of n = 8 was used for analysis for the OUR cell. A sample size of n = 3 was used for the analysis of residence time.",
                        "In place of flow rate, residence time was graphed against the oxygen uptake rate on a per-cell basis. In Figure 5, a linear relationship between the two variables can be seen, demonstrating a relationship between the residence time of media in the bioreactor system and the uptake rate of oxygen by cells. A linear regression was performed and a slope of -0.0109 (picomol O2/hr/cell/sec), a y-intercept of 3.899 (picomol O2/hr/cell), and a R 2 value of 0.96 were found. Figure 5 also shows the potential for a maximum oxygen uptake rate for mesenchymal stem cells in a reactor as the residence time approaches zero, which is given as the y-intercept of the model. However, it is important to fully understand the flow patterns in the bioreactor prior to extrapolating the data. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Analysis of Flow Profile in the Bioreactor System",
                    "paragraphs": [
                        "Previous experiments have shown that this bioreactor system is comparable to a plug flow with significant dispersion effects [20]. However, comparisons to theoretical values indicate that this bioreactor system has residence times that are much closer to the times seen in a fully developed laminar flow with little to no dispersion [20]. It is important to note that these theoretical values are calculated for reactors with no porous medium, which differs slightly from the current setup (which contained an 85% porous scaffold). A visual analysis of flow in the bioreactor system was also used to gain insight into the flow profile in the scaffold.",
                        "Moving from left to right, scaffold disks were placed from the top of the cassette near the entrance towards the exit of the cassette. Disks were tested at 750 L/min.",
                        "Figure 6 shows the presence of dye in each layer of the scaffold immediately following the flow of dye into the system up until the breakthrough time. Scaffold disks were stacked in the bioreactor, consistent with Figure 1, and subsequently removed from the cassette and laid side by side, where the leftmost scaffold constituted the top scaffold in the cassette. Figure 6 could indicate the presence In place of flow rate, residence time was graphed against the oxygen uptake rate on a per-cell basis. In Figure 5, a linear relationship between the two variables can be seen, demonstrating a relationship between the residence time of media in the bioreactor system and the uptake rate of oxygen by cells. A linear regression was performed and a slope of -0.0109 (picomol O 2 /hr/cell/sec), a y-intercept of 3.899 (picomol O 2 /hr/cell), and a R 2 value of 0.96 were found. Figure 5 also shows the potential for a maximum oxygen uptake rate for mesenchymal stem cells in a reactor as the residence time approaches zero, which is given as the y-intercept of the model. However, it is important to fully understand the flow patterns in the bioreactor prior to extrapolating the data.",
                        "Fluids 2020, 5, 30 11 of 14"
                    ],
                    "subsections": []
                },
                {
                    "title": "Analysis of Flow Profile in the Bioreactor System",
                    "paragraphs": [
                        "Previous experiments have shown that this bioreactor system is comparable to a plug flow with significant dispersion effects [20]. However, comparisons to theoretical values indicate that this bioreactor system has residence times that are much closer to the times seen in a fully developed laminar flow with little to no dispersion [20]. It is important to note that these theoretical values are calculated for reactors with no porous medium, which differs slightly from the current setup (which contained an 85% porous scaffold). A visual analysis of flow in the bioreactor system was also used to gain insight into the flow profile in the scaffold.",
                        "Moving from left to right, scaffold disks were placed from the top of the cassette near the entrance towards the exit of the cassette. Disks were tested at 750 µL/min.",
                        "Figure 6 shows the presence of dye in each layer of the scaffold immediately following the flow of dye into the system up until the breakthrough time. Scaffold disks were stacked in the bioreactor, consistent with Figure 1, and subsequently removed from the cassette and laid side by side, where the leftmost scaffold constituted the top scaffold in the cassette. Figure 6 could indicate the presence of channeling in the scaffold, where asymmetrical flow patterns are seen. Theoretically, the mean residence time collected and displaced in Figure 4 should be identical to the hold-up time (plug flow approximation). At lower flow rates, experimental values and plug flow values overlapped in a range consistent with the experimental error. However, at flow rates higher than 600 L/min, the errors spanned from 30% to 40%. Such a large deviation from the theoretical value is indicative of some other phenomena occurring. According to Fogler et al., the presence of channeling is one possible cause of the experimental mean residence time being larger than the theoretical value [22]. The uneven flow profile and variation of tracer concentration in the individual scaffold layers presented in Figure 6 are consistent with what is expected for channeling effects in the reactor system. These findings necessitate further work to determine the extent to which channeling is present, and how to reduce these effects."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "Analysis of flow effects within the 3D flow perfusion bioreactor system used for production of bone-tissue-engineered constructs yielded results that showed the importance of flow characterization within bioreactor systems, in addition to displaying the effects of these flow characteristics on the behavior of mesenchymal stem cells. Previous work completed by Simmons predicted the flow within the bioreactor system to be well approximated by a plug flow with dispersion effects [20]. However, this study shows that the flow within the reactor could better be described as fully developed laminar flow. It also highlighted the presence of gradients in the scaffold, whether due to channeling or the presence of a fully developed flow. Potential side effects of these large gradients could appear in the upregulation of certain genes in mesenchymal stem cells, such as Hypoxia Inducible Factor 1- (HIF1), which has been shown to be a key regulation in cell activity [24]. HIF1 has been shown to be a key player in proliferation, indicating that gradients could have drastic effects on construct viability [24]. Proliferation and differentiation are two factors that need to be studied further, where long term cultures with different flow rates are conducted and analyzed for the up or down regulation of these markers. Then, it may be possible to develop predictive measures that correlate both proliferation and differentiation with flow rate and oxygen Theoretically, the mean residence time collected and displaced in Figure 4 should be identical to the hold-up time (plug flow approximation). At lower flow rates, experimental values and plug flow values overlapped in a range consistent with the experimental error. However, at flow rates higher than 600 µL/min, the errors spanned from 30% to 40%. Such a large deviation from the theoretical value is indicative of some other phenomena occurring. According to Fogler et al., the presence of channeling is one possible cause of the experimental mean residence time being larger than the theoretical value [22]. The uneven flow profile and variation of tracer concentration in the individual scaffold layers presented in Figure 6 are consistent with what is expected for channeling effects in the reactor system. These findings necessitate further work to determine the extent to which channeling is present, and how to reduce these effects."
            ],
            "subsections": []
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "Analysis of flow effects within the 3D flow perfusion bioreactor system used for production of bone-tissue-engineered constructs yielded results that showed the importance of flow characterization within bioreactor systems, in addition to displaying the effects of these flow characteristics on the behavior of mesenchymal stem cells. Previous work completed by Simmons predicted the flow within the bioreactor system to be well approximated by a plug flow with dispersion effects [20]. However, this study shows that the flow within the reactor could better be described as fully developed laminar flow. It also highlighted the presence of gradients in the scaffold, whether due to channeling or the presence of a fully developed flow. Potential side effects of these large gradients could appear in the upregulation of certain genes in mesenchymal stem cells, such as Hypoxia Inducible Factor 1-α (HIF1α), which has been shown to be a key regulation in cell activity [24]. HIF1α has been shown to be a key player in proliferation, indicating that gradients could have drastic effects on construct viability [24]. Proliferation and differentiation are two factors that need to be studied further, where long term cultures with different flow rates are conducted and analyzed for the up or down regulation of these markers. Then, it may be possible to develop predictive measures that correlate both proliferation and differentiation with flow rate and oxygen availability. It is important to note that these results were found for spunbonded PLLA fibers at high porosities, allowing for the possibility of flow characteristics to change when other scaffold types are used. The presence of channeling in the scaffold at higher flow rates is potentially a factor in inducing these gradients, as well. To better understand what is occurring in the bioreactor system, it would be beneficial to look at the effects of individual components on flow characteristics to gain a more thorough understanding of what cells in the scaffold are experiencing.",
                "The average observed oxygen uptake rates for cells found in this experiment were an order of magnitude larger than those found in the literature. This could potentially be due to a multitude of factors. First, nearly all literature values obtained have been found in 2D systems, with maximum uptake rates of approximately 0.1 picomoles oxygen/cell/hour, compared to our findings of 3.02 ± 0.07 picomoles oxygen/cell/hour [8,25]. However, the effects of dynamic versus static culturing systems have been shown to have a significant effect on the metabolic properties of mesenchymal stem cells in terms of glucose consumption [26]. These findings could be extrapolated to oxygen consumption, as well, since glucose and oxygen are the two primary indicators of metabolic rate. Additionally, cells could potentially have varying metabolic rates in high confluency environments in 2D systems, where many of these oxygen uptake rate values were observed. Our system had comparatively low confluency, potentially yielding higher net oxygen uptake rates.",
                "The overarching objective of this investigation was to determine a relationship between flow characteristics and the oxygen uptake rate of cells. Our results found a linear relationship between residence time and cell-specific oxygen uptake rates, and these results were consistent with findings of laminar flow characteristics in our system, where higher convective mass transfers of oxygen, associated with lower residence times, caused higher oxygen uptake rates. The theoretical values of mean residence time for fully developed laminar flow were consistently within the error for the experimental values found. Therefore, using the well described laminar flow model could be an option for those working with varying flow rates in this bioreactor type. Additionally, these correlations could be extrapolated using our model to determine a maximum oxygen uptake rate in conditions where there are no mass transport limitations, giving a potential maximum cell-specific oxygen uptake rate of approximately 4 picomoles/cell/hour. While these results may only be applicable in cases where no oxygen gradients are present, they provide insight to guide new bioreactor designs in terms of nutrient delivery to cells within a tissue-engineered construct. The predictive model could also serve as a corrective factor for other systems relying on on-line oxygen measurements to determine cellularity."
            ],
            "subsections": []
        },
        {
            "title": "Conflicts of Interest:",
            "paragraphs": [
                "The authors declare no conflict of interest."
            ],
            "subsections": []
        }
    ]
}