{
    "id": "https://semopenalex.org/work/W2018236302",
    "authors": [
        "Janine Wechsler",
        "Darrel Drachenberg",
        "Sabine Mai",
        "Yvon E. Cayre",
        "Naoual Benali-Furet",
        "Mark Xu",
        "Julius Adebayo Awe",
        "Jeff Saranchuk"
    ],
    "title": "Three-Dimensional Telomeric Analysis of Isolated Circulating Tumor Cells (CTCs) Defines CTC Subpopulations",
    "date": "2013-02-01",
    "abstract": "Circulating tumor cells (CTCs) have been identified with the potential to serve as suitable biomarkers for tumor stage and progression, but the availability of effective isolation technique(s) coupled with detailed molecular characterization have been the challenges encountered in making CTCs clinically relevant. For the first time, we combined isolation of CTCs using the ScreenCell filtration technique with quantitative analysis of CTC telomeres by TeloView. This resulted in the identification and molecular characterization of different subpopulations of CTCs in the same patient. Three-dimensional (3D) telomeric analysis was carried out on isolated CTCs of 19 patients that consisted of four different tumor types, namely, prostate, colon, breast, melanoma, and one lung cancer cell line. With telomeric analysis of the filter-isolated CTCs, the level of chromosomal instability (CIN) of the CTCs can be determined. Our study shows that subpopulations of CTCs can be identified on the basis of their 3D telomeric properties.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Circulating tumor cells (CTCs) are cells dispersed into the bloodstream by both primary and metastatic cancers [1,2]. While some CTCs die in circulation, others are able to proliferate and invade, thereby forming metastatic deposits at distant organ sites [3]. The spread of CTCs to distant sites such as bone, brain, lung, and liver has made cancer management difficult despite improved early diagnosis [4]. Evidence exists that CTCs are detectable even in the earliest stages of cancer [3]; thus, this potentially permits the use of CTC detection and analysis in the early diagnosis of cancer. The combination of an efficient isolation technique and a suitable biomarker, that is uniformly present in all tumor cell types, to characterize CTCs will permit advances in both cancer research and the development of personalized medicine for cancer patients.",
                "The very low number of CTCs in the bloodstream, which can be as low as one CTC in 1 to 10 million peripheral blood mononuclear cells-or one in a billion blood cells (including erythrocytes), has made the task of efficiently isolating and quantifying CTCs in the circulation quite challenging [5,6]. CTCs found in the peripheral circulation may be distinct representations of the different phenotypes of cancer cells seen in the primary tumors from which they originated. This can be explained due to the fact that a biopsy of the primary tumor cannot identify each and every phenotypic variant present in the primary tumor irrespective of the number of biopsy cores taken.",
                "It is believed that only a small percentage of cancer cells in the primary tumor develop the ability to disseminate and exhibit metastatic behavior and also CTCs can evolve further while in circulation. For example, some of these CTCs may lack tumor initiating capabilities, whereas other cells have undergone epithelial-to-mesenchymal transition [7]. Despite their heterogeneity and rarity in circulation, CTCs have been shown to have the potential to enhance cancer staging, prognosis determination, and eventually personalized management of cancer [8]. Thus, the need for a highly efficient isolation technique and a suitable biomarker, which analyzes CTCs irrespective of their surface antigen expression which may not be conserved, has to be met.",
                "Telomeres, found at the terminal ends of eukaryotic chromosomes, serve to protect chromosomes and preserve their integrity. In vertebrates, telomeres consist of tandem repeated DNA sequences, (TTAGGG)n, with an average length of 5 to 15 kbp in humans [9,10]. Telomere dysfunction has been shown to promote numerical and structural chromosomal instability (CIN), which is a common feature in cancer [11]. In normal cells, telomeres are arranged in a specific nonoverlapping manner in the three-dimensional (3D) space of the nucleus [12,13]. At interphase, the nuclei of cancer cells exhibit telomeric aggregates (TAs), aberrant telomeric clusters that are associated with an altered 3D telomeric organization in the nuclear space of cancer cells [14,15]; such clusters of telomeres are independent of telomerase activity and telomere size [15]. These changes in nuclear architecture of tumor cells have been associated with CIN and a measure of the degree of these alterations depicts the advancement and aggressiveness of the tumor at that particular time [16,17]. Previous work done by our group showed that alterations in the 3D organization of telomeres occur in different cancer types, thus making altered 3D nuclear telomeric profiles a common feature for assessment of many cancer types [17]. Cancer cell nuclei sometimes also feature elongated telomeres with the presence of different subpopulations of telomere lengths in the same nucleus [17,18].",
                "On the basis of the above findings, we postulated that investigating the 3D nuclear telomere organization of CTCs may be key to efficiently characterizing the associated cancer into different stages of aggressiveness, therefore providing better monitoring of disease progression, prognosis determination, and even post-therapy followup for possible relapse in the future. Previous studies of telomeres have shown significant differences between normal and tumor cells, premalignant and malignant cells, and tumor cell subpopulations in different cancer types like plasmacytoma [15], cervical cancer [17,19], Burkitt lymphoma [12], head and neck cancer [12], Hodgkin's lymphoma [20], glioblastoma [21], and myelodysplastic syndromes/acute myeloid leukemias [22].",
                "In this study, we have, for the first time, combined a filtrationbased CTC isolation technology from ScreenCell, which isolates tumor cells from a simple phlebotomy blood sample by capturing the CTCs that cannot pass through its pores (7.5 ± 0.36 μm in diameter) [6], and our 3D telomere profiling technology that uses quantitative imaging and software (TeloView) to determine the 3D nuclear profiles of normal versus tumor cells [22]. The 3D telomeric organization of lymphoid and nonlymphoid cancers has been examined in the past by our laboratory and significant differences were found between normal, preneoplastic, and tumor cells and between tumor stages [23,24]. In the present study, we have isolated by filtration CTCs from patients with colon cancer, prostate cancer, breast cancer, and melanoma and also examined one cultured lung cancer cell line followed by 3D quantitative analysis of their telomeric signatures using the TeloView [15]. This combined approach resulted in the identification of CTCs and detection of CTC subpopulations for each tumor type.",
                "In conclusion, we have, for the first time, characterized CTC subpopulations in different tumors based on their 3D nuclear telomeric profiles, thereby encouraging studies in larger patient cohorts to determine if the 3D telomeric profiles of CTCs can serve as surrogate biomarkers."
            ],
            "subsections": []
        },
        {
            "title": "Patients",
            "paragraphs": [
                "This research was approved by the Research Ethics Board on human studies at University of Manitoba (Ethics Reference No. H2011:336) and in Paris, France [Committees for the Protection of Persons (CPP) Registration No. ID-RCB 2010-A01148-31]. Ten filtered patient samples and one lung cancer cell line were received from France. Additional nine prostate cancer samples were obtained from the Prostate Cancer Centre of CancerCare Manitoba. Patients' consents were obtained before enrollment in the study. The patient population consists of nine prostate cancer, one colon cancer, three breast cancer, and six melanoma cases and one lung cancer cell line (Table 1).",
                "There was no prior knowledge of the clinical data of the patients involved to enable an unbiased analysis of the samples. The classification of patients into stages of cancer was done blindly on the basis of the 3D profiles of telomeres observed in their CTCs and was confirmed with clinical parameters in post hoc fashion."
            ],
            "subsections": []
        },
        {
            "title": "CTC Isolation by Filtration",
            "paragraphs": [
                "Unlike most isolation techniques, the ScreenCell filtration device isolates the total CTC population, and not subpopulations, from 3 ml of patients' blood [6]. This isolation is done by size with the aid of a microporous membrane filter; therefore, expression levels and/or absence of cell surface antigens play no role in the separation. The 19-cm-long device consists of a filtration tank, a filter, and a detachable nozzle attached to it. This nozzle guides the insertion of a collection EDTA tube to it to gently vacuum suction the blood through the filter membrane leaving the CTCs on the membrane [6]. The 18-μm-thick polycarbonate membrane has circular pores (7.5 ± 0.36 μm) that are randomly distributed throughout the filter (1 × 10 5 pores/cm 2 ) [6]. The filtration process is quick (2-3 minutes), and it preserves both the CTC morphology and microclusters/ microemboli (Figure 1, B-E ). The filtration method was validated with spiked tumor cells; when two and five spiked cells per 1 ml of blood were used, the average number of cells recovered were 1.48 (SD, 0.71) and 4.56 (SD, 0.71), respectively [6]."
            ],
            "subsections": []
        },
        {
            "title": "Three-dimensional Quantitative Fluorescence In Situ Hybridization",
            "paragraphs": [
                "Quantitative fluorescence in situ hybridization was carried out on the nuclei of the CTCs captured by the filters according to the protocol earlier described by our laboratory group [12,15,20,21]. In brief, the cells on the filters are incubated in 3.7% formaldehyde/ 1× phosphate-buffered saline for 10 minutes followed by a 10-minute treatment with 50 μg/ml pepsin in 0.01 N HCl. The CTCs are postfixed to the filters with 3.7% formaldehyde/1× phosphate-buffered saline for 10 minutes before 8 μl of Cyanine 3 (Cy3)-labeled peptide nucleic acid probe purchased from DAKO (Glostrup, Denmark) is applied to them. The coverslipped and rubber cement-sealed filters on slides then undergo a 3-minute denaturation at 80°C followed by a 2-hour hybridization at 30°C. The CTCs containing filters are washed twice 15 minutes each in 70% formamide/10 mM Tris (pH 7.4), subjected to a 5-minute wash in 0.1× SSC at 55°C, then washed twice 5 minutes each in 2× SSC/0.05% Tween 20. Finally, the nuclei are stained with 50 μl of 0.1 μg/ml 4′,6-diamindino-2 phenylindole (DAPI), dehydrated in graded concentrations of ethanol, and coverslipped with Vectashield (Vector Laboratories, Burlington, Ontario) reagent ready for imaging."
            ],
            "subsections": []
        },
        {
            "title": "Three-Dimensional Image Acquisition",
            "paragraphs": [
                "Images are acquired using a Zeiss AxioImager Z2 microscope (Carl Zeiss, Toronto, Ontario), equipped with AxioCam HR B&W camera and 63×/1.4 oil objective. The microscope is equipped with a Cy3 filter for detection of peptide nucleic acid probe-hybridized telomeres and a DAPI filter for nuclear DNA detection with AXIOVISION 4.8 software (Carl Zeiss). The Zeiss AxioImager Z2 was programmed to take 80 stacks of images at x and y = 102 nm and z = 200 nm to capture the different planes of the CTCs that are observed beside the pores or slightly in the pores. The same acquisition time was used to acquire Cy3 images of telomeres from each tumor type for quantitative comparison and analysis. The acquisition times used in milliseconds were given as follows: melanoma, 1290; colon cancer, 212; breast cancer, 212; prostate cancer, 546; lung cancer cell line, 173.6. Thirty interphase nuclei were imaged for analysis; deconvolution of the images was performed with a constrained iterative algorithm [25]. The reconstructed 3D images were then exported as .tiff files into our TeloView program for analysis [25]."
            ],
            "subsections": []
        },
        {
            "title": "TeloView Enabled 3D Image Analyses and Statistical Considerations",
            "paragraphs": [
                "TeloView quantifies the telomere numbers, signal intensity, sizes, distribution, TAs, and nuclear volume for each sample. A graph of telomere numbers (y-axis) against signal intensity (x-axis) is plotted for each sample giving a first overview of the CTC 3D telomere profiles and of the presence/absence of subpopulations (Figure 3, A-E ). In addition, aggregate numbers and nuclear volumes are calculated and included in the analysis.",
                "Statistical parameters considered for characterizing the CTCs in each patient sample into subpopulations are given as follows: 1) percentage of cells with aggregates (PCA), 2) average number of telomeres per cell (ANTC), 3) average number of aggregates per cell (ANAC), and 4) average nuclear volume (ANV).",
                "Nested factorial analysis of variance was used to analyze the parameters above."
            ],
            "subsections": [
                {
                    "title": "Results",
                    "paragraphs": [
                        "This study was designed to adequately characterize CTCs and potential subpopulations of CTCs in different cancer types using aberrations in the 3D architecture of telomeres due to telomere dysfunction as a common biomarker of CIN and a potential surrogate of tumor aggressiveness. CTCs of prostate, colon, breast, melanoma, and nuclei of a cultured lung cancer cell line were analyzed and at least two distinguishable subpopulation patterns were seen in each patient sample in all of the tumor types (Figures 2 and3). The telomeres of five different tumor types were analyzed using TeloView, which measures the number and size of telomeres and also identifies the presence of TAs [23,24]. Table 2 shows the different parameters computed by the TeloView program such as PCA, ANTC, ANAC, and ANV. With these data, the degree of telomere dysfunction can be assessed, thus giving insight into the level of CIN for each patient. The measurements offer the chance for earlier tumor detection and better cancer classification. Table 2 shows CTC nuclei of patient samples MB0189PR, MB0216PR, MB0222PR, COLON GUI3F, and BR MERT10AA5083PR and nuclei of H2030 lung cancer cell line with percentage of cells with TAs greater than 80%, patients MB0213PR, MB0217PR, COLON GUI5F, BR MIC10AA3956, BR WUR10AA2499, and BR MIC10AA3934 between 60% and 80%, and the remaining MB0211PR, MB0181PR, MB0182PR, COLON GUI2F, Mela GOD10AA4991, Mela CAR10AA2213, Mela SAU 10AA2408, Mela ROB10AA2521, Mela GAU10AA3836, and Mela CHAN10AA4280 less than 60%. Other important parameters that vary among the samples are the ANTC and the ANAC. Both the ANTC and ANAC have corresponding variations among the samples (Table 2). These data obtained from TeloView can be used to predict the complexity of genomic instability of the tumors. The TeloView analysis of CTCs of these five cancer types was done without prior knowledge of the patients' clinical data. The deductions and classifications resulting from the TeloView analysis was then compared with the clinical data obtained (Table 1)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Morphology of the Filter Captured CTC Nuclei",
            "paragraphs": [
                "The distinct 3D nuclear architecture of the CTCs was visualized through the DAPI filter before image acquisition. The captured CTCs were found either as solitary or clustered cells scattered around and sometimes slightly within the pores (Figure 1). In animals, the importance of CTC clusters and tumor-lymphocyte mixed clusters as prognostic factors in metastasis process has been mentioned [26,27]. The CTCs are often irregularly shaped (Figures 1 and2) and larger than other blood cells enabling their isolation due to their inability to pass through the filters' pores (7.5 ± 0.36 μm) [6]; for example, the prostate cancer cell size ranges between 15 and 25 μm [28]. Figure 1A shows hematoxylin and eosin (H&E)-stained prostate cancer CTCs (pointed out by arrows) captured by the filter device. These CTCs are clearly two and three times larger than the pores. The identities of the cells were confirmed by pathologic examination. CTCs sometimes display chromatin condensation, unlike most of the lymphocytes. Solitary lymphocytes mostly pass through the pores of the filter except in some instances where they are found in between pores. Lymphocytes sometimes also form lymphocytelymphocyte clusters or lymphocyte-CTC clusters that cannot go through the pores.",
                "At ×40 microscope magnification, the density of the CTCs present can be appreciated in each sample with the presence of varying number of clusters noted. Both the density of the CTCs captured from 3 ml of each sample and the frequency of the clusters observed can give a preliminary insight to the status of the disease at the point when the sample was collected [29]. Figure 1, B-E, shows the isolation and preservation of CTC clusters in the filtered patients' blood. At ×60 oil magnification, the varying sizes of the CTCs were observed with associated different chromatin condensation seen. Further analysis using TeloView measures the nuclear volume and this distinguishes CTCs from captured clumped lymphocytes that are smaller in size individually (Table 2). A switch to the Cy3 filter shows the hybridized telomere signals with varying signal intensity and numbers that give the first suggestion of different subpopulations within CTCs of the same patient's filtered blood."
            ],
            "subsections": []
        },
        {
            "title": "Telomere Numbers and TAs in CTCs",
            "paragraphs": [
                "Cancer cells commonly exhibit an altered telomere number per cell nucleus with the telomeres often being shorter than those in normal cells. These alterations from the normal cell telomeres have been attributed to aneuploidy and genomic instability [18].",
                "In this study, Cy3-stained telomeres were analyzed and their signal intensities evaluated by TeloView. The telomere signal intensity of a CTC nucleus is dependent on the number of TAs present in that CTC. This can be projected for the whole sample by calculating the PCA and the ANAC (Table 2). The program also calculates the ANTC in each nucleus. The variation in ANTC in the same sample may be an indication of the presence of CTC subpopulation and level of tumor aggressiveness [17,21,22]. In Figures 2 to 3, different subpopulations of CTCs in the same patient are shown. The subpopulations of CTCs are identified on the basis of the differences in their telomere intensities, which can be due to varying number of telomeres, size of telomeres, or presence/absence of TAs. TAs are commonly seen in tumor cells [14,17] (Figure 2, Af, and Cf-Ef show prominent TAs) and their analyses has been shown to be useful in tumor characterization [12,17].",
                "Figure 2 shows representative 2D and 3D images of isolated CTCs. The figure represents different subpopulations of CTCs present in the same prostate cancer patient (MB0181PR). In Figure 2, the nuclear DNA is stained with DAPI (blue) and telomeres (red), which are within the nuclei, are Cy3 stained. Images in Figure 2, Aa and Ab, are of a cell that represents the subpopulation with low telomere intensity in this prostate cancer patient evident by the scanty number of signals observed. The two other CTC subpopulations represented in the same prostate cancer patient are the medium (Figure 2, Ac and Ad ) and high (Figure 2, Ae and Af ) telomere intensity CTCs. A similar classification is shown in the colon cancer patient GUI3F (Figure 2B) with increasing numbers of telomeres seen along the classes of CTCs but a higher than normal number of telomeres observed in CTCs that belong to the high intensity subpopulation (Figure 2, Be and Bf ). This irregularly high number of telomeres seen is one of the features of cancer cells that result from CIN [17]. Figure 2C shows 2D and 3D images of cells representing subpopulations in a breast cancer patient: BR MIC10AA3934, with low (Figure 2, Ca and Cb), medium (Figure 2, Cc and Cd ), and high (Figure 2, Ce and Cf ) intensity telomere signals. Figure 2D shows subpopulations in a melanoma patient: Melanoma CAR10AA2213, which is similar to subpopulations in breast cancer patient (BR MIC10AA3934) (Figure 2C ) except for the presence of more TAs (Figure 2Df ) in the melanoma patient. The lung cancer subpopulations in cell line H2030 are shown in Figure 2E. It was noted that this lung cancer cell line generally has high telomere numbers, but their telomere sizes vary. The telomere size was used to group the CTCs into subpopulations (Figure 2E ).",
                "From the results shown in Figure 2, it is clear that different subpopulations of CTCs are present in the same cancer patients and that these subpopulations can be identified by TeloView analysis. In the same tumor type, the variations in telomere intensities in addition to the presence and frequency of TAs may, in the future and with larger patient cohorts, permit the classification of cancer into stages of progression and aggressiveness with the prospects of improving cancer management."
            ],
            "subsections": []
        },
        {
            "title": "Telomere Numbers versus Telomere Intensity Measured in CTCs",
            "paragraphs": [
                "Our analysis tool, the TeloView program [23,24], plots a graph of telomere length (signal intensity) on the x-axis against the number of telomeres on the y-axis. The signals with the same intensity fall on the same spot on the graph and this gives a picture of the distribution of CTC subpopulations within each patient's filtered blood. For normal cells, this plot usually has a single peak, which ranges between 40 and 60 telomeres per nucleus on the y-axis [13]. A direct comparison of prostate cancer CTCs and lymphocytes from the same patient (MB0239PR) is shown in Figure W1. Not only are the numbers of telomeres detected different between CTCs and lymphocytes of the same patient but also did we measure a size difference between the two cell types with average sizes of CTC nuclei being more than three-fold larger than those of the lymphocytes of the same patient, captured on the same filter (Figure W1).",
                "CTCs of all patients give 3D telomeric profiles with either a very high number or very low number of telomeres (Figure 3, A-E ). Figure 3 shows plots of the different representative CTCs' telomere numbers against their intensities. Many deviations from the 3D telomere profiles of normal cells [12,13,23] (Figure W1) were observed; the striking regular finding in the graphs from these CTCs is the presence of multiple peaks, which represent different subpopulations in the samples. The plots revealed the different subpopulations of CTCs in the same patient shown by the red line demarcations in the graphs. The subpopulations can be identified according to their signal intensities, i.e., low, medium, and high intensities (Figure 3, A-E ). Figure 3A is a plot of a prostate patient's signal intensity against number of telomeres, the telomere numbers peak at 18 (below the normal range [12,13,23]), and there are three populations identified by red line demarcations on the plot, i.e., low, medium, and high intensity groups (Figure 3, A-E ). The plot for GUI3F (Colon CA) in Figure 3B is a sharp contrast to Figure 3A with telomere numbers having a peak at 110 (Figure 3B ). This disparity in different cancer types should be studied further with larger cohorts of the same cancer type. Although the plot for BR MIC10AA3934 (Figure 3C ) has a telomere number peak of 45, it has multiple peaks that signify the different subpopulations present in the same patient (Figure 3C ). The zigzag nature of the plot for melanoma gives it a peculiar pattern (Figure 3D); it also has its highest telomere number peak at 19 (below the normal range). Three distinct subpopulations of telomere intensities can be identified in this plot (Figure 3D). The plot for lung cancer cell line depicts its high telomere number with a peak of telomere numbers at 290, most of which are short telomeres as earlier shown in 3D images (Figure 2D, images b and d )."
            ],
            "subsections": []
        },
        {
            "title": "Uniqueness of Telomere Structural Changes in Cancer Types",
            "paragraphs": [
                "When analyzing five different cancer types, it was observed that there might be a characteristic feature in the 3D telomere architectural changes seen in each of these cancer types. Although they all exhibit the presence of subpopulations of CTCs in the same patient sample, the telomeres of these cancer cells may tend to have similar features in each tumor type. The prostate, melanoma, and breast cancer CTCs may tend to form high numbers of TAs (Figure 2, Af, Df, and Cf ). The colon cancer CTCs and lung cancer cell line may tend to have significantly increased numbers of telomeres (Figure 2, Bf and Ef ). The peculiarities seen in telomeres of different tumor types are also exhibited in the plots of their telomere numbers against telomere intensities (Figure 3, A-E ). The architectural alterations seen in the telomeres seem to be specific to each cancer type."
            ],
            "subsections": []
        },
        {
            "title": "Frequencies of CTC Subpopulations",
            "paragraphs": [
                "Three milliliters of blood per patient captures CTCs present in this volume of blood and allows for the detection of those CTCs that are present in that sample. Duplicate and triplicate samples taken at the same time and from the same patient will result in the isolation of varying numbers of CTCs due to their rare presence per milliliter blood. This will also impact on the frequencies of individual subpopulations detected. We can therefore only conclude that CTC subpopulations are present, but the frequency of each population may vary in small sample volumes. Two examples are provided here to illustrate this point. Patient GUI with colon cancer had three 3-ml blood samples examined (2F, 3F, and 5F) and their 3D nuclear architecture analyzed. 2F, 3F, and 5F have telomeres with low intensity at 58.16%, 54.34%, and 64.42%, respectively; medium intensity telomeres were found at 38.27%, 36.82%, and 33.85%, respectively, and high intensity telomeres had frequencies of 3.57%, 6.99%, and 1.73%, respectively (Table 2). This is a fairly consistent representation of the telomere intensity subpopulations in three different samples of the patient GUI.",
                "A different example is represented by the breast cancer patient MIC. Two different samples (10AA3956 and 10AA3934) were obtained at the same time from the patient, and the 3D nuclear analysis of the CTCs revealed the presence of three different telomere subpopulations. 10AA3956 and 10AA3934 had percentages of telomeres with low intensity of 77. 36 and 35.38, medium intensity of 20.22 and 62.01, and then high intensity of 2.42 and 2.61, respectively (Table 2). The frequency of each population is more variable (except in the high telomere intensity group) than it was in patient GUI. Therefore, the average of multiple samples obtained at the same time will only provide confirmation of the presence of distinct CTC subpopulations in a patient but will not give an absolute distribution frequency."
            ],
            "subsections": [
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "Our study showed that CTCs isolated from patients with different cancers including breast, prostate, melanoma, and colon exhibit unique 3D telomeric profiles. We observe distinct subpopulation in each CTC/tumor type, based on quantitative analysis of 3D nuclear telomeric images using TeloView [23]. Our study is a proof-of-principle analysis that illustrates the feasibility of 3D quantitative fluorescence in situ hybridization analysis of CTCs isolated using a filtration device and the subsequent quantitative analysis of 3D telomeric profiles of CTCs leading to the identification of unique subgroups of CTCs. This analysis gives a snapshot of the molecular makeup of a patient's tumor cells at a specific point of assessment. It is known that cancer evolves [30]; therefore, profiling of CTCs using their telomeres as a potential future biomarker may permit the assessment of CIN at specific time points of their evolution and natural history [22]. The 3D profiles of the CTCs of each type of cancer appear tumor type-specific. To validate the accuracy of telomeric classification of cancer progression, a larger cohort of patients with the same cancer type of varying clinical stages and pathologic grades will need to be analyzed and validated according to clinical parameters and treatment outcome.",
                        "As previously shown, the 3D telomeric organization is altered within the nucleus of cancer cells. 3D nuclear architecture of telomeres has been used to assess and profile many cancer types, including our recent work in the profiling of myelodysplastic syndromes and acute myeloid leukemias into subgroups using their 3D telomeric architecture [22]. Other tumors that display alterations in their 3D telomeric architecture have been studied, including plasmacytoma [15], cervical cancer [17,19], Burkitt lymphoma [12], head and neck cancer [12], Hodgkin's lymphoma [20], and glioblastoma [21]. The use of telomeric profiling technique on CTCs of cancer patients over time may help the understanding of cancer evolution/progression and eventually lead to improvements in cancer management.",
                        "The importance of CTCs as possible biomarkers for the analysis of tumors has been acknowledged, and this explains the many methods that have been attempted to isolate CTCs in the past. One recent technique is an assay using an anti-epithelial cell adhesion molecule (anti-EpCAM) antibody to capture CTCs expressing this antigen on their surfaces with the CellSearch System [31]. The CTCs must have >2000 EpCAM molecules on their surfaces for them to be captured [31]. This method lacks efficiency because of tumor cell heterogeneity, low EpCAM expression levels on some CTCs, or EpCAMdeficient CTCs like melanoma CTCs. In addition, because the EpCAM expression levels may change as cells become CTCs, many CTCs will not be captured because they do not express the \"adequate\" amount of EpCAM [31,32].",
                        "Because of the extremely low number of CTCs [33], reverse transcription-polymerase chain reaction-based assays have been previously used to isolate CTCs. The major pitfalls of this method of CTC isolation were the destruction of the cells' integrity during RNA extraction and also the ineffectiveness of reverse transcriptionpolymerasechain reaction to distinguish between circulating tumor and nontumor cells [34,35].",
                        "The ScreenCell device we used here makes the analysis of the entire population of CTCs in a patient's blood sample possible by its non-antigen-specific filter isolation technique [6]. With an isolation of the entire population of CTCs dispersed from a solid tumor, we are equipped with a better representation of the tumor than biopsy or dissection can offer. The combination of isolation of CTCs by the ScreenCell device and analysis of 3D architecture of telomeres by Telo-View permits the identification and characterization of the different constituent subpopulations of CTCs in the same patient. This combination of techniques has the potential of providing a suitable surrogate biomarker for efficient assessment of different types of tumors as demonstrated with the hope that this will, in the future, translate into improved prognostication abilities and therapeutic planning for different tumor types.",
                        "In addition, the presence and frequency of circulating tumor microemboli in circulation as shown in Figure 1, B-E, H&E-stained filtered melanoma blood, can be estimated using the combination of CTC isolation by filtration and 3D analysis of CTCs. These circulating tumor microemboli can lead to clogging of small blood vessels, thus causing anemia in the region supplied by the affected vessels [36]. This can result in increased morbidity and could be included as a prognosticator that could enhance the classification and management of cancer patients.",
                        "Filtration and 3D analysis of CTCs from cancer patients may lead to early detection of abnormal cells in circulation and this detection will be followed by extensive diagnostic tests to achieve a possible lifesaving early diagnosis. Furthermore, response to cancer management may be monitored using changes in 3D telomeric profiles of CTCs and drugs can be designed to target-specific subpopulation(s) of CTCs that may have been identified to be resistant to an earlier therapy regimen. In conclusion, our study demonstrates that it is feasible to isolate and characterize different subpopulations of CTCs in cancer patients by analyzing their 3D telomeric architectures after ScreenCell filter isolation. Comparison of 3D nuclear telomere profiles of CTCs isolated from prostate cancer patient MB0239PR with lymphocytes from the same patient captured on the same filter. Green, 3D nuclear telomere profile of CTCs from the patient. Red, 3D nuclear profile of lymphocytes from the same patient. The average 3D volume of lymphocytes is 211.47 μm 3 and the nuclear diameter is 7.39 μm. The ANV of CTCs of this patient is 665.99 μm 3 and the average nuclear diameter is 10.78 μm. The ANV of lymphocytes is 3.15 times smaller than that of average CTC in this same patient. Note that due to filtration, 10% less telomeric signals are detectable in 3D nuclei in normal lymphocytes than have been reported by us and others [12,13,23]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Acknowledgments",
                    "paragraphs": [
                        "The authors thank the patients who contributed blood samples to this study. Samples from France were provided by Marie-Françoise Avril and Françoise Boitier (Service de Dermatologie, Hôpital Cochin, Université-Paris 5, Paris, France) and Alain Pigné and Patrice Langlois (Unité Chirurgicale, Clinique Geoffroy Saint-Hilaire, Paris, France)."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}