{
    "id": "https://semopenalex.org/work/W4283207527",
    "authors": [
        "M. Partridge",
        "Mohamed Hassanein",
        "Susan C. Irvin",
        "Albert Torri",
        "Terra Potocky",
        "Amanda D’Orvilliers",
        "Aynur Hermann",
        "Manoj Rajadhyaksha",
        "Jurriaan Brouwer‐Visser",
        "Erica Ullman",
        "Jason Pennucci",
        "Nicolin Bloch",
        "Kayla Boccio"
    ],
    "title": "Interference in a Neutralizing Antibody Assay for Odronextamab, a CD20xCD3 Bispecific mAb, from Prior Rituximab Therapy and Possible Mitigation Strategy",
    "date": "2022-06-21",
    "abstract": "A cell-based assay was developed to detect neutralizing anti-drug antibodies (NAbs) against odronextamab, a CD20xCD3 bispecific monoclonal antibody (mAb) under investigation for treatment of CD20+ B cell malignancies. In this assay, odronextamab bridges between two cell types, CD20-expressing HEK293 cells and CD3-expressing Jurkat T cells that generate a luciferase signal upon CD3 clustering. Patient samples containing NAbs directed to either arm of the bispecific drug block the odronextamab bridge formation between the cell lines thus preventing the generation of the luciferase signal. We determined that other anti-CD20 therapeutics also block bridge formation, resulting in false-positive results. In patient samples from odronextamab clinical trials, approximately 30% of baseline samples had a strong false-positive NAb signal that correlated with the presence of prior rituximab (anti-CD20) therapy. We determined that rituximab interference can be minimized by the addition of anti-rituximab antibodies in the NAb assay. Understanding and mitigating the impact of prior biologic exposure is increasingly important for implementing a successful bioanalytical strategy to support clinical drug development, especially in the immuno-oncology field. Graphical Abstract Odronextamab neutralizing antibody assay, interference, and mitigation. A Design of the odronextamab neutralizing antibody (NAb) assay where anti-CD20xCD3 drug bridges between CD20-expressing HEK293 cells and Jurkat T cells expressing an NFAT response element and luciferase reporter. True NAb prevents odronextamab from bridging between target and effector cells, thus preventing the expression of luciferase. B Interference with odronextamab from other anti-CD20 therapeutic antibodies (e.g., rituximab) from prior disease treatment generates a false-positive NAb result. Assay interference can be mitigated with an anti-idiotypic antibody against the interfering therapy.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "The protein therapeutics portion of the pharmaceuticals market continues to grow; biologics were almost 40% of all new therapeutic drugs over the past 3 years and almost 60% of sales in 2021 (1). However, unlike small molecule drugs, biologics can induce an unwanted immune response that results in the development of anti-drug antibodies (ADAs). In clinical trials, participants are monitored for the presence of ADA to ensure safety for the patients and efficacy of the drug. NAbs are a subset of ADA that prevent the biological activity of the drug. By definition, they reduce the pharmacological effect of the therapeutic, potentially reducing clinical response (2). Furthermore, when the drug is a biological mimic of an endogenous protein, ADAs can cross-react with the endogenous analog and in the case of ADAs with neutralizing capacity (NAbs), may result in serious adverse events (3). Thus, it is critically important to accurately monitor the formation of NAb during clinical drug development.",
                "Odronextamab (REGN1979) is a hinge stabilized human IgG4 bispecific antibody with one binding site specific to CD20 and the other binding site specific to CD3 (4,5). The drug is designed to bridge between CD20-expressing tumor cells and CD3-expressing cytotoxic T cells to activate T cellmediated killing of CD20-positive target cells (5).",
                "To support continued clinical advancement of odronextamab, a cell-based NAb method was developed that detects antibodies against either arm of the bispecific mAb in a single assay. In the assay, drug binds to HEK293 cells engineered to express CD20 and to CD3-expressing Jurkat T cells which were engineered to generate luciferase upon CD3 clustering and downstream nuclear factor of activated T cells (NFAT) signaling. In the presence of NAb, odronextamab bridge formation between target and effector cells is inhibited, thus preventing the induction of the reporter signal. Importantly, this functional bioassay format recapitulates the mechanism of action of the drug in vivo, where odronextamab redirects T cells to a tumor associated antigen on target cells. Furthermore, the ability of the assay to detect NAb to either arm of the bispecific drug presents an advantage over a ligand-based format which would require two separate assays: one assay for each target.",
                "Therapy for patients with advanced stage lymphomas can include treatment with an anti-CD20 antibody (e.g., rituximab or obinutuzumab) in combination with multi-agent chemotherapy (6,7). Consequently, odronextamab clinical trials include patients with B cell malignancies which may express CD20, who were previously treated with a CD20-directed biologic therapy and have relapsed or are refractory, and thus have a continued unmet medical need (Table I). However, if still present systemically, the prior anti-CD20 therapeutic could potentially bind to CD20 on engineered HEK293 cells in the NAb assay, preventing odronextamab-CD20 binding and bridging of target and reporter cells. This would inhibit the downstream luciferase signal, thus generating a false-positive NAb signal. Therefore, residual rituximab or other CD20-specific mAbs in serum samples have the potential to present a major challenge during development of the odronextamab NAb assay.",
                "This manuscript describes the development and characterization of the cell-based odronextamab NAb assay that detects either anti-CD20-or anti-CD3-specific NAb in the same method. In addition, interference from anti-CD20 mAbs in clinical study samples was demonstrated to be a source of false-positive results. As such, a strategy to mitigate the false-positive NAb signal was developed by sample pretreatment with blocking antibodies specific for the CD20directed therapies."
            ],
            "subsections": []
        },
        {
            "title": "MATERIALS AND METHODS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Cell-Based NAb Assay",
                    "paragraphs": [
                        "HEK293 cells (ATCC) were stably transfected with a human CD20 expression vector, generating the HEK293/hCD20 target cell line. Jurkat T cells (ATCC) were transduced with a vector in which luciferase expression is under the control of an NFAT response element, generating the Jurkat/NFAT-Luc reporter cell line. In the NAb assay, HEK293/hCD20 cells and Jurkat/NFAT-Luc cells were each plated at a concentration of 1.25 × 10 5 cells per well in 96-well plates. The minimum required dilution of the assay is 1:10.",
                        "HEK293/hCD20 cells were maintained in high glucose DMEM (Gibco), geneticin (Gibco), non-essential amino acids, NEAA (Fisher Scientific), and fetal bovine serum (Fisher Scientific). Jurkat/NFAT-Luc cells were maintained in RPMI 1640 (Gibco), puromycin (Gibco), and fetal bovine serum (Fisher Scientific). Normal pooled serum was used as a negative control (BioIVT).",
                        "In the NAb assay, samples and controls were co-incubated with odronextamab for 30 to 90 min prior to addition to cells. For blocking experiments, samples were incubated with anti-rituximab antibodies for 30 min with gentle shaking at room temperature prior to addition to the NAb assay. Five hours post incubation with reporter cells, luciferase activity was measured using ONE-Glo Luciferase Assay System (Promega)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Antibodies",
                    "paragraphs": [
                        "Odronextamab (REGN1979), anti-idiotype antibodies specific for CD20-or CD3-binding arms of the bispecific drug, and isotype controls were produced by Regeneron Pharmaceuticals, Inc (Tarrytown, New York). Rituxan® (rituximab) is manufactured by Genentech (San Francisco, CA). Anti-rituximab blocking antibodies HCA061, HCA186, and MCA2260 were purchased from Bio-Rad (Hercules, California)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Clinical Sample Collection",
                    "paragraphs": [
                        "Clinical trial serum samples were obtained from two Phase I oncology studies: Clinical Trials. gov identifiers NCT02290951 and NCT02651662. The serum samples were collected from patients prior to dosing of study drug at baseline."
                    ],
                    "subsections": []
                },
                {
                    "title": "Rituximab Concentration Assay",
                    "paragraphs": [
                        "Rituximab concentrations were determined using the commercially available ELISA from IBL (Minneapolis, MN), catalog number TM09016 per manufacturer instructions."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "The linear regression analysis was performed in GraphPad Prism 9 (GraphPad Software LLC)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "NAb Assay Development",
                    "paragraphs": [
                        "To support registrational and late stage odronextamab clinical studies, a cell-based functional bioassay was developed to detect NAbs. The format of the NAb assay recapitulates the in vivo mechanism of action of the bispecific drug by drug control∕sample = drug control mean RLUs∕sample mean RLUs bridging between CD3 on T cells and target cells expressing CD20, a tumor associated antigen. The addition of odronextamab bridges the aforementioned cell types, leads to CD3 clustering on the surface of the reporter cells stimulating a downstream signaling cascade, which induces the expression of the reporter and a dose-dependent luciferase signal (Fig. 1a, first two panels; Fig. 1b). The assay was designed so that anti-odronextamab NAb will block this binding, resulting in a lower RLU signal (Fig. 1a, third panel).",
                        "As a proof of concept, anti-idiotypic antibodies directed against either the anti-CD20 or the anti-CD3 paratope of the drug were added in conjunction with odronextamab in the NAb assay. As expected, these antibodies inhibited the bridging of odronextamab between the target and reporter cells, demonstrated by concentration-dependent inhibition of the luciferase signal (Fig. 2). In contrast, the addition of mouse IgG isotype control mAbs did not inhibit the luciferase signal, indicating the assay specifically detected NAb against odronextamab (Fig. 2). Sensitivity of the NAb assay was determined to be 158 ng/mL for the positive control against the anti-CD3 binding site and 1067 ng/mL for the positive control against the anti-CD20 binding site of odronextamab. The drug tolerance of the NAb assay was determined as 125 ng/mL with the anti-CD3 arm positive control at 500 ng/mL.",
                        "For analysis of clinical trial samples, the cell-based NAb method must tolerate the presence of human serum. To assess this, a serial dilution of odronextamab was tested in the assay in the presence of 5% or 10% normal human serum to mimic conditions of clinical samples (data not shown). We found that serum did not significantly interfere with the luciferase signal generated in the presence of drug in mock samples. Interference of matrix was also evaluated in the NAb assay. Hemolyzed samples generated false-positive results; however, this finding was not surprising as hemolysis is a known interferent in luciferase-based assays (8). In contrast, lipemic samples did not interfere in this assay (data not shown)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Odronextamab Competitors",
                    "paragraphs": [
                        "As controls in initial proof of concept experiments, odronextamab mono-specific parental bivalent antibodies, one-arm anti-CD20 antibodies, or anti-CD3 Fab fragments were used in the NAb assay to compete with the bispecific for bridge formation. In these experiments, both the bivalent anti-CD20 or anti-CD3 mAbs, as well as anti-CD3 Fab fragments, reduced assay signal in a concentration-dependent manner (Fig. 3A andB). In addition to the parental antibodies, competition with odronextamab for the target cells' CD20 was also observed with another anti-CD20 monoclonal antibody, rituximab (Fig. 3A). Importantly, in all of these scenarios, increasing concentrations of the competing mono-specific anti-CD20 or anti-CD3 antibody reduced the luciferase signal and were indistinguishable from true NAb-positive responses."
                    ],
                    "subsections": [
                        {
                            "title": "False-Positive NAb Response in Baseline Clinical Samples",
                            "paragraphs": [
                                "To establish a preliminary study-specific cut point as part of the development experiments, a panel of 60 baseline patient samples from odronextamab clinical studies were analyzed in the NAb assay to determine a floating cut point factor based on the observed 99th percentile of the data (for a 1% false-positive rate) per agency guidance (9). However, approximately one-third of these samples had a strong falsepositive NAb signal despite being naïve to odronextamab (Fig. 4A). The false-positive NAb response for most of these samples was substantially higher than observed with positive control samples which were added at a concentration up to 2 μg/mL (data not shown). Based on this data, baseline patient study samples with strong NAb positive results in the assay were excluded from the cut point statistical analysis.",
                                "Inclusion criteria for these odronextamab clinical studies permitted prior anti-CD20 antibody therapy. Therefore, the concentration of a widely used anti-CD20 mAb therapeutic, was evaluated in a subset of the baseline samples using a commercially available ELISA. Similar to the in vitro experiment testing rituximab competition with odronextamab, in this subset of 29 clinical samples, the 8 patient samples with the lowest concentrations of rituximab "
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Mitigation of Rituximab Interference",
                    "paragraphs": [
                        "Data with in vitro spiked samples indicated that anti-CD20 biotherapeutics, including rituximab, generated false-positive NAb signals when spiked at concentrations greater than approximately 2.5 μg/mL in neat serum (Fig. 5A, control conditions). We hypothesized that incubating samples with a blocking anti-rituximab antibody may mitigate interference from rituximab in the NAb assay. To test this, three commercially available anti-idiotypic antibodies specific for rituximab were incubated in rituximab-spiked serum samples. When analyzed in the NAb assay, all three blocking mAbs minimized the false-positive NAb signal (Fig. 5A).",
                        "To confirm that the interference observed in baseline clinical samples was also due to rituximab, the same experiment was performed with two baseline study samples from Fig. 4B that had strong false-positive NAb signals; these samples had 46.1 μg/mL and 62.4 μg/mL of rituximab, respectively. Consistent with the in vitro-spiked samples, the false-positive NAb result in clinical samples was reduced to assay background levels indicating that residual rituximab in the patients was generating the false-positive assay signal (Fig. 5B). The rituximab blocking antibodies at 15 μg/mL had no impact on assay signal in a NAb-negative serum sample (Fig. 5B). However, at a higher concentration of rituximab blocking antibodies (750 μg/mL), false-positive NAb signals were observed (data not shown), possibly due to non-specific interference in the assay."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "We developed a cell-based assay for detection of neutralizing antibodies against odronextamab, an anti-CD20xCD3 bispecific monoclonal antibody. The assay platform is designed to mimic the in vivo ability of odronextamab to redirect T cells (expressing CD3) against cells expressing a tumorassociated antigen (CD20). Neutralizing anti-odronextamab antibodies are detected in the assay by functionally blocking the biological effect of the drug.",
                "As a proof of concept, monoclonal antibodies specific to either binding site of the bispecific drug generated a positive NAb signal in the method in a concentration-dependent manner. The cell-based assay format was also able to detect NAb directed to either binding site of odronextamab, providing an advantage compared to a ligand-binding assay (LBA) design which would require two independent assays. The cell-based NAb assay had sensitivity values of 158 ng/mL and 1067 ng/mL for the anti-CD3-arm and anti-CD20-arm positive controls, respectively. The assay cut point was calculated by excluding baseline patient study samples with strong NAb positive results (i.e., false-positive NAb results above the assay positive control); this conservative approach Fig. 2 Anti-odronextamab Abs prevent odronextamab-induced luciferase signal. A titration of monoclonal antibodies specific to either the CD20-binding site (anti-drug antibodies 1, 2, and 3) or the CD3-binding site of odronextamab (anti-drug antibodies 4 through 7) were co-incubated with 30 ng/mL odronextamab in the NAb assay. The NFAT activity was determined by luciferase signal and is expressed relative to control wells without the addition of competing mAbs. The 7 drugspecific antibodies all resulted in a concentration-dependent NAb-positive assay signal, while the two isotype control antibodies did not for the statistical analysis was used to minimize false-negative NAb results.",
                "Sensitivity values are based on the monoclonal antibody positive control. The values for these positive control reagents, particularly the anti-CD20 mAb, are higher than the 100 ng/mL recommended for ADA assay sensitivity (9). However, neutralizing responses are a subset of ADA and it is expected that NAb assays will be less sensitive because the methods detect a secondary readout rather than a direct binding event. In addition, NAb assays also suffer from limitations in drug tolerance (10): the drug-tolerance level in this assay is less than the trough concentration of drug. Importantly, it is increasingly becoming clear that supersensitive and drug tolerant immunogenicity assays do not improve detection of clinically impactful immunogenicity (10)(11)(12).",
                "Consistent with the differences in sensitivity values in this antibodies raised against the anti-CD20 arm in nonclinical species overall had lower affinity than antibodies raised against the anti-CD3 arm, and generally lower affinity responses have also been observed against antibodies targeting other B-cell associated antigens (not shown). Interestingly, a majority (75%) of precursor B cells in humans are thought to be self-reactive and are consequently edited during development to avoid autoimmunity (13,14). A similar biological process in non-clinical species may account for the generally poorer anti-CD20 arm responses versus anti-CD3 arm responses. Finally, immunogenicity observed in non-clinical species is not predictive of human responses; this is especially true in hyper-immunized animals used to raise positive control antibodies which typically generate a robust immunogenic response. Importantly, the incidence of treatment-emergent ADA to odronextamab in humans is low (15).",
                "In addition to true NAb, antibodies that compete with odronextamab for the CD20 or CD3 targets could also reduce assay signal, resulting in a false-positive NAb response. These included the bivalent, monospecific parental mAbs as well as commercially available anti-CD20 mAbs that compete for binding such as rituximab, ofatumumab, and obinutuzumab. Other approved or investigational anti-CD20 mAbs may also generate false-positive response in the NAb assay. We determined there was a statistically significant correlation between the concentration of residual rituximab with NAb signal.",
                "Mitigating interference from remaining systemic anti-CD20 therapies was critically important for assessing NAb responses in clinical study samples. In the odronextamab clinical trial patient population, pre-dose samples from approximately one-third of patients that were examined, generated a false-positive NAb signal, indicating rituximab (or other anti-CD20 therapeutic) concentrations were greater than 2.5 μg/mL in these patient samples.",
                "Importantly, the interference in the NAb assay due to rituximab was successfully blocked with the addition of antirituximab antibodies. This mitigation strategy was initially demonstrated as a proof-of-concept using rituximab-spiked samples. Notably, the approach also successfully inhibited false-positive NAb signals in baseline clinical study samples, verifying that systemic rituximab was the interfering agent in these patient samples, and the false-positive NAb signal was not due to rituximab ADA cross-reacting with odronextamab (16,17). However, the use of blocking antibodies comes with limitations of use: high concentrations of interfering drug may not be overcome with infinitely high concentrations of blocking mAbs as it was determined, there is a threshold of blocking mAb that can be used successfully in the assay. Alternative mitigation approaches such as immunodepletion would be more complicated in practice than simply incubating with blocking mAbs, as additional procedural steps would be required (e.g., depletion and washing) that could potentially impact other assay parameters such as sensitivity and precision.  18), these patients may be unable to wait for complete drug washout before beginning a new therapy, such as odronextamab. Therefore, a bioanalytical strategy must account for potential interference from prior biologic therapies."
            ],
            "subsections": []
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "The use of protein therapeutics for the treatment of patients with a variety of indications to grow (1). This is especially true in oncology, where mAbs such as rituximab, cetuximab, bevacizumab, and trastuzumab have been prescribed for decades. In recent years, a new class of immunecheckpoint inhibitors specific for targets including CTLA4 and PD-1/PD-L1 are revolutionizing the field for a range of solid tumor types. Other approved mAbs such as daratumumab, specific for CD38, as well as approved and investigational molecules specific for BCMA and other targets promise to transform treatment of hematological malignancies such as multiple myeloma (19).",
                "The treatment paradigm for the most serious cancer types requires successive lines of therapy. Often, the patient is unable to wait for the prior medication to be cleared from circulation before starting a new line of treatment, and consequently, the prior drug remains present systemically. Within the crowded oncology space, the innovator therapy may be used in a new combination with or have overlapping specificity to an approved drug. In addition, some oncology patients may have comorbidities which may be treated with a therapeutic that binds a common target, as in the case with rituximab use in rheumatoid arthritis (20).",
                "The strategy for mitigating bioanalytical assay interference described in this manuscript requires blocking antibodies specific for the prior therapy. This means that for use in the odronextamab NAb assay, samples from patients with recent experience of anti-CD20 therapeutics require antirituximab, anti-ofatumumab, or anti-obinutuzumab blocking antibodies, to prevent generation of a false-positive NAb signal. However, the prior medication history of each patient may be unknown, and a blocking strategy for each approved (or investigational) anti-CD20 therapy may not be feasible in practice. In the absence of a mitigation strategy, samples may only be evaluable for a true neutralizing antibody response after the interfering biotherapeutic is sufficiently Interference from concomitant medications is commonly assessed during bioanalytical method development. Due to the highly specific reagents used in LBAs, there is rarely any impact from other biologics or small molecule drugs (21). However, the overlapping target specificity of prior biotherapeutic medications, especially in the immuno-oncology field, is a new challenge. For example, we recently identified cross-reactivity in a PK assay from anti-PD-1 mAb therapeutics in patient samples using a target-capture LBA (22). Assay interference has also been described in the multiple myeloma area, where therapeutic mAbs interfere with the clinical response assessment of monoclonal M-protein (23). The odronextamab case study described here involving interference in a cell-based NAb assay is another example of the bioanalytical hurdles that must be overcome. Interference in bioanalytical methods will present an ongoing and increasingly frequent challenge, especially when using target-capture immunoassays or similar analytical techniques."
            ],
            "subsections": [
                {
                    "title": "Declarations",
                    "paragraphs": [
                        "Conflict of Interest SCI, AD, NB, JB, EU, MR, MH, TP, AT, AH, and MAP are current or former employees of Regeneron Pharmaceuticals, Inc. and may hold stock, stock options, and/or patent applications in the company. This work has been described in one or more pending provisional patent applications including US patent application 63/041,768. Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http:// creat iveco mmons. org/ licen ses/ by/4. 0/."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}