{
    "id": "US20230055832",
    "authors": [
        "Jia Guo",
        "Joshua LaBaer",
        "Christopher Nazaroff",
        "Thai Pham"
    ],
    "title": "METHODS AND SYSTEMS FOR SENSITIVE AND MULTIPLEXED ANALYSIS OF BIOLOGICAL SAMPLES USING CLEAVABLE FLUORESCENT TYRAMIDE AND PROBE STRIPPING",
    "date": "2022-07-28 00:00:00",
    "abstract": "Provided herein are methods for multiplexed in situ analysis of biomolecules in a tissue. In particular, provided herein are methods for multiplexed single-cell in situ protein and nucleic acid profiling in fixed or fresh tissues, and also allows the investigation of the different cell compositions and their spatial organizations in intact tissues through consecutive cycles of probe hybridization, fluorescence imaging, and signal removal.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The ability to comprehensively profile proteins, nucleic acids, and other biomolecules in intact tissue in situ is crucial to understand the molecular mechanisms underlying cancer, neuroscience, and stem cell biology. The differences between individual cells in complex biological systems may have significant consequences in the function and health of the entire systems. The precise location of multiple, varied biomolecules in a tissue or cell is critical for understanding the spatial organization, gene expression regulation, and interactions of diverse cell types in complex multicellular organisms. However, most of the existing methods for in situ analysis of proteins, nucleic acids, and other biomolecules can only quantify a small number of different molecules in a biological sample. Conventional protein imaging methodologies such as immunohistochemistry (IHC) and immunofluorescence (IF) only allow a handful of proteins to be detected in one tissue sample, and the methods may miss transcripts present at low copy numbers. Accordingly, there remains a need in the art for highly sensitive and multiplexed approaches to in situ protein and nucleic acids analysis."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate in situ analysis",
                        "limitations of existing methods"
                    ],
                    "num_characters": 1177,
                    "outline_medium": [
                        "motivate in situ molecular profiling"
                    ],
                    "outline_short": [
                        "motivate in situ molecular profiling"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The present disclosure overcomes the aforementioned drawbacks by providing low-cost, high-throughput, comprehensive, and highly sensitive and high-quality methods for in situ molecular profiling capable of in situ analysis of target biomolecules (e.g., proteins, nucleic acids) in intact tissues with single-molecule sensitivity.",
                        "In some embodiments, there is provided herein a cleavable detectably-labeled tyramide (CLT) comprising the compound of Formula (I), wherein R is a detectable marker.",
                        "Exemplary detectable makers include, without limitation, fluorophores, luminescent agents (e.g., chemiluminescent agents), fluorescent proteins, and radioisotopes. By way of example, detectable markers include Cy5, sulfonated cy5, TAMRA (labeled with tetramethylrhodamine or “TMR”), ALEXA FLUOR™ 594, and ATTO 647N and ATTO 700 fluorophores (ATTO-TEC, Germany). Other fluorophores appropriate for use according to the compositions and methods provided herein include, without limitation, quantum dots, ALEXA FLUOR™ 350, ALEXA FLUOR™ 532, ALEXA FLUOR′ 546, ALEXA FLUOR™ 568, ALEXA FLUOR™ 647, BODIPY 493/503, BODIPY FL, BODIPY R6G, BODIPY 530/550, BODIPY TMR, BODIPY 558/568, BODIPY 558/568, BODIPY 564/570, BODIPY 576/589, BODIPY 581/591, BODIPY 630/650, BODIPY 650/665, Cascade Blue, Cascade Yellow, Dansyl, lissamine rhodamine B, Marina Blue, Oregon Green 488, Oregon Green 514, Pacific Blue, rhodamine 6G, rhodamine green, rhodamine red, tetramethyl rhodamine, DYLIGHT™ DYES (e.g., DYLIGHT™ 405, DYLIGHT™ 488, DYLIGHT™ 549, DYLIGHT™ 594, DYLIGHT™ 633, DYLIGHT™ 649, DYLIGHT™ 680, DYLIGHT™ 750, DYLIGHT™ 800 and the like), Texas Red, and Cy2, Cy3.5, Cy5.5, and Cy7, and sulfonated Cy2, Cy3.5, Cy5, Cy5.5, and Cy7. In some embodiments, the detectable marker is a sulfonated Cy 5, and in some embodiments, there is provided a cleavable detectably-labeled tyramide (CLT) comprising the compound of Formula (II):",
                        "In some embodiments, provided herein is a method of multiplexed in situ analysis of biomolecules in a tissue. In some embodiments, the methods comprise, consist, or consist essentially of the following steps: (a) contacting the tissue with a plurality of horseradish peroxidase (HRP)-conjugated targeting agents that are configured to specifically bind or hybridize to the target biomolecule in the contacted tissue, wherein the second contacting step occurs under conditions that promote binding or hybridization of the targeting agents to the target biomolecule; (b) contacting the tissue with the cleavable detectably-labeled tyramide (CLT) compound of Formula I, under conditions that promote conjugation of the cleavable labeled tyramide to the target biomolecule; (c) imaging the tissue thereby detecting the detectable marker; (d) contacting the tissue sample with a composition comprising 1,3,5-Triaza-7-phosphaadamantane (PTA) and tris(2-carboxyethyl)phosphine (TCEP), e.g., at about 40° C. for about 30 minutes; and (e) repeating steps (a)-(d); wherein a second plurality of HRP-conjugated targeting agents is used to bind to or hybridize to a second target biomolecule, wherein the first and the second target biomolecules are different. In some embodiments, the HRP-conjugated targeting agent is stripped from the sample. In some embodiments, stripping comprises the use of one or more of a buffer, denaturing agent, detergent, temperature condition, pH condition, osmolarity agent.",
                        "In some embodiments, the method further comprise repeating steps (a)-(d) N times, wherein the Nth plurality of HRP-conjugated targeting agents is used to bind to or hybridize to the Nth target biomolecule, wherein the first through the Nth target biomolecules are different.",
                        "The plurality of biomolecules can comprise proteins, RNA, or DNA, or a combination thereof.",
                        "In some embodiments, the CLT comprises the compound of Formula II.",
                        "In some embodiments, provided herein is a kit for detecting target biomolecules in a cell sample. The kit can comprise, consist, or consist essentially of a cleavable detectably-labeled tyramide comprising the compound of Formula I or Formula II, and a written insert component comprising instructions for performing multiplexed in situ analysis of target biomolecules according to methods of this disclosure. In some embodiments, the kit can further comprise a plurality of HRP-conjugated targeting agents configured to bind or hybridize to a target biomolecule. The plurality of HRP-conjugated targeting agents can comprise HRP-conjugated synthetic DNA oligonucleotide probes. The plurality of HRP-conjugated targeting agents can comprise HRP-conjugated polyclonal or monoclonal antibodies, or antigen-binding fragments thereof. The kit can further comprise tris(2-carboxyethyl)phosphine (TCEP), and 1,3,5-Triaza-7-phosphaadamantane (PTA), either as separate components or as a composition, and the written instruction component can further comprise instructions for removing the detectable label from the detectably-labeled tyramide using the TCEP and the PTA.",
                        "The foregoing and other advantages of the invention will appear from the following description. In the description, reference is made to the accompanying drawings which form a part hereof, and in which there is shown by way of illustration a preferred embodiment of the invention. Such embodiment does not necessarily represent the full scope of the invention, however, and reference is made therefore to the claims and herein for interpreting the scope of the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce cleavable detectably-labeled tyramide",
                        "define detectable markers",
                        "describe method of multiplexed in situ analysis",
                        "outline steps of method",
                        "describe stripping of HRP-conjugated targeting agents",
                        "repeat steps for multiple target biomolecules",
                        "specify types of biomolecules",
                        "introduce kit for detecting target biomolecules",
                        "describe components of kit",
                        "outline instructions for kit"
                    ],
                    "num_characters": 5479,
                    "outline_medium": [
                        "introduce cleavable detectably-labeled tyramide",
                        "describe method of multiplexed in situ analysis",
                        "outline steps of method",
                        "describe kit for detecting target biomolecules",
                        "mention written instruction component"
                    ],
                    "outline_short": [
                        "introduce cleavable detectably-labeled tyramide",
                        "outline method for multiplexed in situ analysis"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The methods and compositions provided herein are based at least in part on the inventors' development of a highly sensitive and multiplexed in situ protein analysis approach that uses a cleavable labeled tyramide (CLT) comprising Formula I, and which has the potential to quantify numerous different proteins and/or nucleic acids in individual cells of intact tissues at the optical resolution. As described herein, this development provides for in situ analysis of proteins, nucleic acids, and other biomolecules in intact tissues with single-molecule sensitivity.",
                        "Accordingly, in a first aspect, provided herein is a cleavable detectably-labeled tyramide. In certain embodiments, a detectable label such as a fluorophore is tethered to tyramide via a cleavable linker. Preferably, the cleavable linker is a chemically cleavable linker. As described herein, to enable signal removal (e.g., fluorescent signal) after protein staining the cleavable detectably labeled tyramide preferably comprises a fluorophore tethered to tyramide through a chemically cleavable linker. An important aspect of the technology of this disclosure is efficient cleavage of the detectable label in a cellular environment while maintaining protein antigenicity. Additionally, it is preferred that the linker is small enough to permit recognition of CLT by horseradish peroxidase (HRP) and to avoid compromised diffusion of a short-lived tyramide radical. In some embodiments, the cleavable linker comprises the structure of Formula III, wherein R comprises a detectable marker and T comprises tyramide:",
                        "Other cleavable linkers appropriate for use in a CFT of this disclosure include, structures cleaved by enzymes, nucleophiles, electrophiles, reducing reagents, oxidizing reagents, photo-irradiation, metal catalysis, and the like. Further examples of suitable linkers and cleavage mechanisms are described by Milton et al. (U.S. Pat. No. 7,414,116) and by Leriche et al. (Bioorg. Med. Chem., 2012, 20:571-582), which are incorporated herein by reference in their entirety. The linker may be cleavable using a variety of approaches including the addition of a chemical agent, irradiation with one or more wavelengths of light, enzymatic reaction and the like.",
                        "In some embodiments, a cleavable detectably-labeled tyramide is tyramide-N3—, having the following chemical structure, Formula (I):",
                        "wherein R is a detectable marker.",
                        "In some embodiments, the cleavable detectably-labeled tyramide is tyramide-N3-Cy5 of Formula II:",
                        "The tyramide-N3-Cy5 of Formula II was designed and synthesized (FIG. 1B) by tethering fluorophore Cy5 to tyramide through an azide-based cleavable linker. The synthesis and characterization of tyramide-N3-Cy5 is described in Example 1.",
                        "Any appropriate detectable label can be used to produce a cleavable detectably-labeled tyramide. In some embodiments, the detectable label of the cleavable detectably-labeled tyramide is a fluorophore. In such cases, the cleavable detectably-labeled tyramide is cleavable fluorescent tyramide (CFT). Fluorophores useful in the methods of this disclosure include, without limitation, Cy5, TAMRA (labeled with tetramethylrhodamine or “TMR”), ALEXA FLUOR™ 594, and ATTO 647N and ATTO 700 fluorophores (ATTO-TEC, Germany). Other fluorophores appropriate for use according to the methods provided herein include, without limitation, quantum dots, ALEXA FLUOR™ 350, ALEXA FLUOR™ 532, ALEXA FLUO® 546, ALEXA FLUOR™ 568, ALEXA FLUOR™ 647, BODIPY 493/503, BODIPY FL, BODIPY R6G, BODIPY 530/550, BODIPY TMR, BODIPY 558/568, BODIPY 558/568, BODIPY 564/570, BODIPY 576/589, BODIPY 581/591, BODIPY 630/650, BODIPY 650/665, Cascade Blue, Cascade Yellow, Dansyl, lissamine rhodamine B, Marina Blue, Oregon Green 488, Oregon Green 514, Pacific Blue, rhodamine 6G, rhodamine green, rhodamine red, tetramethyl rhodamine, DYLIGHT™ DYES (e.g., DYLIGHT™ 405, DYLIGHT™ 488, DYLIGHT™ 549, DYLIGHT™ 594, DYLIGHT™ 633, DYLIGHT™ 649, DYLIGHT™ 680, DYLIGHT™ 750, DYLIGHT™ 800 and the like), Texas Red, and Cy2, Cy3.5, Cy5.5, and Cy7, and sulfonated Cy2, Cy3.5, Cy5, Cy5.5, and Cy7. In addition to the use of fluorophores as a detectable moiety, other labels such as luminescent agents (e.g., chemiluminescent agents), fluorescent proteins, and radioisotopes can also be used as detection tags.",
                        "In another aspect, provided herein is a method for multiplexed in situ analysis of biomolecules in a tissue. As used herein, the term “multiplexed” refers to the detection of multiple signals (e.g., two or more signals), such as, for example, analytes, fluorescent signals, analog or digital signals, that are combined into one signal over a shared medium. The term encompasses the detection of multiple signals simultaneously in a single sample or single reaction vessel, as well as the combining of images of multiple signals to obtain one image that reflects the combination.",
                        "Referring to FIG. 1A, the method comprises three steps in each analysis cycle. First, for analysis of a protein in a tissue, the tissue is contacted with a horseradish peroxidase (HRP)-conjugated antibody configured to bind specifically to the protein target. For analysis of nucleic acids in a tissue, the tissue is contacted with a HRP-conjugated oligonucleotide probe configured to hybridize to the nucleic acid target. In some embodiments, the HRP-conjugated targeting agent is configured to bind directly to the target biomolecule of interest. In some embodiments, the HRP-conjugated targeting agent binds to an intermediate, e.g., binds to a primary antibody or a primary oligonucleotide that binds directly to or hybridizes directly to the target biomolecule.",
                        "The tissue is also contacted with a detectably-labeled, cleavable tyramide. HRP catalyzes the coupling reaction between the cleavable tyramide and tyrosine residues on an endogenous protein target in close proximity. In the second step, fluorescence images are captured to generate quantitative protein expression profiles. Finally, detectable labels attached to the cleavable tyramide are chemically cleaved in step that simultaneously deactivates HRP, which allows for initiation of the next analysis cycle. Through reiterative cycles of target staining, fluorescence imaging, fluorophore cleavage, and HRP deactivation, a large number of different target biomolecules with a wide range of expression levels can be quantified in single cells of intact tissues in situ.",
                        "In exemplary embodiments, the method comprises (a) contacting the tissue with a plurality of horseradish peroxidase (HRP)-conjugated targeting agents that are configured to specifically bind or hybridize to the target biomolecule in the contacted tissue, wherein the second contacting step occurs under conditions that promote binding or hybridization of the targeting agents to the target biomolecule; (b) contacting the tissue with the cleavable detectably-labeled tyramide (CLT) compound of Formula I, under conditions that promote conjugation of the cleavable labeled tyramide to the target biomolecule; (c) imaging the tissue thereby detecting the detectable marker; (d) contacting the tissue sample with a composition comprising 1,3,5-Triaza-7-phosphaadamantane (PTA) and tris(2-carboxyethyl)phosphine (TCEP) at about 40° C. for about 30 minutes; and (e) repeating steps (a)-(d), as necessary, depending on the number of biomarkers to be detected.",
                        "The targeting agent will vary depending on the type of target biomolecule. In some cases, the target biomolecule is a protein or peptide. In such cases, the targeting agent will be an antibody that specifically binds to the target protein or peptide. For example, if the target biomolecule is protein Histone deacetylase 2 (HDAC2), the target agents comprise anti-HDAC2 antibodies conjugated to HRP. Antibodies suitable for the methods include, without limitation, polyclonal antibodies, monoclonal antibodies, and antigen-binding fragments thereof. HRP-conjugated antibodies can be used to detect other target biomolecules such as lipids and metabolites.",
                        "In other cases, the target biomolecule is a nucleic acid (e.g., DNA, RNA). In such cases, the targeting agent will be a HRP-conjugated oligonucleotide having sequence complementary to the target nucleic acid sequence. Under appropriate conditions, the HRP-oligonucleotide will hybridize to the target nucleic acid sequence. In some cases, multiple cycles of the method are performed to detect multiple target biomolecules using targeting agents that are HRP-conjugated antibodies, HRP-conjugated oligonucleotides, or a combination thereof.",
                        "In some cases, the target biomolecule is a carbohydrate. In such cases, the targeting agent can be a HRP-conjugated lectin that is capable of binding carbohydrate. As used herein, the term “lectin” refers to a protein or glycoprotein that binds to specific carbohydrate structures to form a lectin-carbohydrate complex. The term encompasses lectins derived from animal and plant sources, and which bind carbohydrates by affinity. The term “lectin” as used herein also encompasses glycoproteins and proteins not normally termed lectins but which immunologically bind carbohydrates, such as antibodies, e.g., monoclonal antibodies. Since lectins bind selectively to some but not all carbohydrates (e.g., monosaccharides, such as mannose, GleNAc, gelatose, a-fructose or sialic acid) to different degrees, it will be understood that the type of lectin conjugated to HRP will vary depending on the target carbohydrate of interest.",
                        "Any appropriate method of preparing antibody-horseradish peroxidase conjugates can be used. Exemplary protocols for preparation of an HRP antibody conjugate are known in the art. By way of non-limiting example, HRP can be activated for conjugation by treatment with a 100-fold molar excess of a bifunctional PEG linker having a maleimide group and an active ester group. Antibodies to a protein of interest can be prepared for conjugation by introducing thiols using, for example, DTT. A thiolated antibody can be contacted to a molar excess of HRP comprising a bifunctional PEG linker for conjugation.",
                        "Likewise, methods of preparing an oligonucleotide probe conjugated to HRP are well known in the art and can be commercially obtained.",
                        "In some cases, the HRP-conjugated detection agent (e.g., antibody, oligonucleotide) and cleavable detectably labeled tyramide are contacted in the presence of a tyramide signal amplification buffer. In some cases, the amplification buffer comprises an aqueous phosphate-buffered, borate-buffered, or other buffered solution to which low concentrations of hydrogen peroxide are added. In some cases, the amplification buffer comprises 0.0015% H2O2 and 0.1% triton X-100 in 0.1 M boric acid, pH=8.5. Commercial tyramide signal amplification buffers are available from several manufacturers including, for example, PerkinElmer, ThermoFisher, and Biotium.",
                        "In some embodiments, the signal from the detectable marker is removed in a “removing step.” In some embodiments, the removing step comprises chemically cleaving the detectable label. Any appropriate means of removing a detectable signal or detectable label (e.g., a fluorophore) can be used according to the methods provided herein. Methods of removal can include without limitation one or more of photobleaching, chemical deactivation, chemical cleavage of the fluorophores (see the Examples below), enzymatic cleavage of the fluorophores, DNA/RNA strand displacement, chemical or heat denaturing of an intermediate fluorescent oligonucleotide, and the like. Since photobleaching can be a time-consuming step, in some cases the methods provided herein comprise efficiently removing fluorescence signals by chemical deactivation or chemical or enzymatic cleavage of detectable labels.",
                        "In some cases, the methods provided herein comprise chemical inactivation of fluorophores. For example, fluorophores can be inactivated by oxidation. Protocols for oxidation of dyes with hydrogen peroxide, which can be catalyzed using either acidic or basic conditions, or reactive oxygen species (ROS) are known to those practitioners in the art for changing the fluorescent properties of dyes and fluorescent proteins.",
                        "In some embodiments, the detectable marker is removed by chemical cleavage of the linker joining the tyramide and the detectable marker. In some embodiments, the linker is cleaved by contacting the sample with tris(2-carboxyethyl)phosphine (TCEP), and 1,3,5-Triaza phosphaadamantane (PTA), either as separate components or as a composition. In some embodiments, the contacted sample is incubated at a temperature of about 30° C., 31° C., 32° C., 33° C., 34° C., 35° C., 36° C., 37° C., 38° C., 39° C., 40° C., 41° C., 42° C., 43° C., 44° C., 45° C., 46° C., 47° C., 48° C., 49° C. or about 50° C. The time of incubation is about 10 to about 120 minutes, 20 to about 90 minutes, 30 to about 60 minutes, or about 30 minutes. In some embodiments, the sample is washed prior to the next cycle.",
                        "When fluorescently labeled tyramide is used, fluorescence photomicroscopy can be used to detect and record the results of consecutive in situ analysis using routine methods known in the art. Alternatively, digital (computer implemented) fluorescence microscopy with image-processing capability may be used. Two well-known systems for imaging FISH of chromosomes having multiple colored labels bound thereto include multiplex-FISH (M-FISH) and spectral karyotyping (SKY). See Schrock et al. (1996) Science 273:494; Roberts et al. (1999) Genes Chrom. Cancer 25:241; Fransz et al. (2002) Proc. Natl. Acad. Sci. USA 99:14584; Bayani et al. (2004) Curr. Protocol. Cell Biol. 22.5.1-22.5.25; Danilova et al. (2008) Chromosoma 117:345; U.S. Pat. No. 6,066,459; and FISH TAG™ DNA Multicolor Kit instructions (Molecular probes) for a review of methods for painting chromosomes and detecting painted chromosomes.",
                        "To minimize issues of autofluorescence or background signal, oligonucleotide targeting agents can be designed to hybridize to a target nucleic acid at multiple places on the target nucleic acid sequence. Thus, an increased number of oligonucleotides will hybridize to each target nucleic acid sequence (e.g., transcript) to enhance signal to noise ratio. As used herein, the terms “binding,” “to bind,” “binds,” “bound,” or any derivation thereof refers to any stable, rather than transient, chemical bond between two or more molecules, including, but not limited to, covalent bonding, ionic bonding, and hydrogen bonding. The term “binding” encompasses interactions between polypeptides, for example, an antibody and its epitope on a target protein. The term also encompasses interactions between a nucleic acid molecule and another entity such as a nucleic acid or probe element. Specifically, binding, in certain embodiments, includes the hybridization of nucleic acids. In some cases, the methods further comprise a blocking step to reduce background signal. The term “blocking” as used herein refers to treatment of a sample with a composition that prevents the non-specific binding of the target substance to the sample. Typically a blocking composition comprises a protein, such as casein or albumin, and may additionally comprise surfactants. The function of the blocking protein is to bind to the sample to prevent the non-specific binding of assay reagents.",
                        "In some cases, the method further comprises a washing step. For example, the method can further comprise washing to remove unhybridized targeting agents and non-specifically hybridized targeting agents prior to the addition of CLT to the sample (e.g., prior to the tyramide-HRP reaction), and prior to visualization. In some embodiments, the methods comprises a washing step after cleaving the detectable label and prior to the next cycle including the addition of a next targeting agent.",
                        "In some embodiments, the methods comprise a stripping step. As used herein, the term “stripping” refers to the process of interfering with the non-covalent binding between a target biomolecule in a sample and a horseradish peroxidase (HRP)-conjugated targeting agent such that significant amounts of targeting agent is eluted or “stripped” away from the in situ sample. The term “stripping” encompasses using heat, a buffer, denaturing agent, detergent, temperature condition, pH condition, osmolarity agent, or any combination thereof. Non-limiting examples of stripping include boiling a sample or subjecting a sample to a boiling solution, subjecting a sample to a very low pH (e.g. pH 2) or high pH (e.g. pH 10), and/or subjecting a sample to a denaturing agent or detergent, such as, e.g., subjecting a sample to SDS, a glycine buffer, glycine SDS, and/or boiling a sample in citrate buffer. Heat-induced stripping may optionally be accomplished by microwaving a sample or subjecting a sample to solution which has recently been microwaved or otherwise brought to its boiling point. For example, heat-induced stripping encompasses subjecting a sample to a 100° C. condition for at least about 1 minute, 5 minutes, 10 minutes, 20 minutes, or greater. Stripping may optionally be accomplished using a combination of heat-induced stripping and another agent or condition, such as, e.g., a buffer, pH condition, osmolarity agent, detergent, denaturing agent, or any combination thereof. (See Appendix).",
                        "The methods of this disclosure can be performed using a tissue sample obtained from any biological entity. The term “biological entity” as used herein means any independent organism or thing, alive or dead, containing genetic material (e.g., nucleic acid) that is capable of replicating either alone or with the assistance of another organism or cell. Sources for nucleic acid-containing biological entities include, without limitation, an organism or organisms including a cell or cells, bacteria, yeast, fungi, algae, viruses, or a sample thereof. Specifically, an organism of the current disclosure includes bacteria, algae, viruses, fungi, and mammals (e.g., humans, non-human mammals). The methods and compositions described herein can be performed using a variety of biological or clinical samples comprising cells that are in any (or all) stage(s) of the cell cycle (e.g., mitosis, meiosis, interphase, G0, G1, S and/or G2). As used herein, the term “sample” include all types of cell culture, animal or plant tissue, peripheral blood lymphocytes, buccal smears, touch preparations prepared from uncultured primary tumors, cancer cells, bone marrow, cells obtained from biopsy or cells in bodily fluids (e.g., blood, urine, sputum and the like), cells from amniotic fluid, cells from maternal blood (e.g., fetal cells), cells from testis and ovary, and the like. In some cases, samples are obtained by swabbing, washing, or otherwise collecting biological material from a non-biological object such as a medical device, medical instrument, handrail, door knob, etc. Samples are prepared for assays of this disclosure using conventional techniques, which typically depend on the source from which a sample or specimen is taken. These examples are not to be construed as limiting the sample types applicable to the methods and/or compositions described herein.",
                        "In some cases, the methods provided herein comprise a cell or tissue fixation step. For example, the cells of a biological sample (e.g., tissue sample) can be fixed (e.g., using formalin, formaldehyde, or paraformaldehyde fixation techniques known to one of ordinary skill in the art). In some cases, the tissue is formalin-fixed and paraffin-embedded (FFPE). Any fixative that does not affect antibody binding or nucleic acid hybridization can be utilized in according to the methods provided herein. In other cases, the methods are performed on unfixed (“fresh”) tissue samples.",
                        "As described herein, the methods of the present invention provide for multiplexed in situ analysis of biomolecules in a tissue. Through consecutive cycles of targeting agent binding/hybridization, fluorescence imaging, and signal removal, different biomolecule species can be identified as fluorescent spots with unique color sequences. In some embodiments, the CTL's of different cycles, which are used in conjunction with different targeting agents, comprise different labels. For example, in a first cycle, a first targeting agent is hybridized to a first target biomolecule, and a first CTL comprising a first detectable label is used. In a subsequent cycle, an second targeting agent is hybridized to a second target biomolecule, and a second CTL comprising a second detectable label is used.",
                        "As used herein, the term “biomolecule” or “biological molecule” refers to any molecule that is substantially of biological origin and encompasses proteins, peptides, and nucleic acids. Such molecules may include non-naturally occurring components that mimic a naturally occurring component, e.g., a non-naturally occurring amino acid. The terms “polypeptide,” “peptide” and “protein” are used interchangeably herein to refer to a polymer of amino acid residues. The terms apply to amino acid polymers in which one or more amino acid residue is an artificial chemical mimetic of a corresponding naturally occurring amino acid, as well as to naturally occurring amino acid polymers, those containing modified residues, and non-naturally occurring amino acid polymer. As used herein, the terms “nucleic acid” or “oligonucleotide” refer to and encompass any physical string or collection of monomer units (e.g., nucleotides) that can connect to form a string of nucleotides, including a polymer of nucleotides (e.g., a typical DNA or RNA polymer), peptide nucleic acids (PNAs), modified oligonucleotides (e.g., oligonucleotides comprising nucleotides that are not typical to biological RNA or DNA, such as 2′-O-methylated oligonucleotides), and the like. The nucleotides of the nucleic acid can be deoxyribonucleotides, ribonucleotides or nucleotide analogs, and can be natural or non-natural, and can be unsubstituted, unmodified, substituted or modified. The nucleotides can be linked by phosphodiester bonds, or by phosphorothioate linkages, methylphosphonate linkages, boranophosphate linkages, or the like. The nucleic acid can additionally comprise non-nucleotide elements such as labels, quenchers, blocking groups, or the like. The nucleic acid can be single-stranded or double-stranded.",
                        "As used herein, the terms “nucleic acid of interest,” and “target nucleic acid” include a nucleic acid originating from one or more biological entities within a sample. The target nucleic acid of interest to be detected in a sample can be a sequence or a subsequence from DNA, such as nuclear or mitochondrial DNA, or cDNA that is reverse transcribed from RNA in the sample. The sequence of interest can also be from RNA, such as mRNA, rRNA, tRNA, miRNA, siRNAs, antisense RNAs, or long noncoding RNAs. More generally, the sequences of interest can be selected from any combination of sequences or subsequences in the genome or transcriptome of a species or an environment. In some cases, a defined set of targeting agents are oligonucleotide probes that are designed to hybridize to the plurality of sequences that would be expected in a sample, for example a genome or transcriptome, or a smaller set when the sequences are known and well-characterized, such as from an artificial source.",
                        "Oligonucleotide probes useful for the methods provided herein are of any length sufficient to permit probe penetration and to optimize hybridization of probes for in situ analysis according to the methods of this disclosure. Preferably, probe length is about 20 bases to about 500 bases. As probe length increases, so increases the number of binding sites that can be incorporated into a given probe for hybridization to the probe of the following cycle as well as the signal to noise ratio. However, longer than 500 bases, the probes may not efficiently penetrate the cellular membrane. Preferably, the oligonucleotide probes have a probe length between 20 and 500 nucleotides, 20 and 250, 50 and 250, 150 and 250 nucleotides, 20 and 150, or 50 and 150 nucleotides, inclusive.",
                        "The terms “hybridize” and “hybridization” as used herein refer to the association of two nucleic acids to form a stable duplex. Nucleic acids hybridize due to a variety of well characterized physico-chemical forces, such as hydrogen bonding, solvent exclusion, base stacking and the like. An extensive guide to the hybridization of nucleic acids is found in Tijssen (1993) Laboratory Techniques in Biochemistry and Molecular Biology-Hybridization with Nucleic Acid Probes, part I chapter 2, “Overview of principles of hybridization and the strategy of nucleic acid probe assays” (Elsevier, N.Y.). One of skill in the art will understand that “hybridization” as used herein does not require a precise base-for-base complementarity. That is, a duplex can form, between two nucleic acids that contained mismatched base pairs. The conditions under which nucleic acids that are perfectly complementary or that contain mismatched base pairs will hybridize to form a duplex are well known in the art and are described, for example, in MOLECULAR CLONING: A LABORATORY MANUAL, 3rd ed., Sambrook et al., eds., Cold Spring Harbor Press, Cold Spring Harbor (2001) at Chapter 10, which is herein incorporated by reference. As used herein, the term “complementary” refers to a nucleic acid that forms a stable duplex with its “complement”. For example, nucleotide sequences that are complementary to each other have mismatches at less than 20% of the bases, at less than about 10% of the bases, preferably at less than about 5% of the bases, and more preferably have no mismatches.",
                        "Kits",
                        "In another aspect, provided herein is a kit comprising reagents for performing multiplexed in situ analysis of biomolecules in a tissue. Preferably, the kit comprises a cleavable detectably-labeled tyramide of Formula I or Formula II, and a written insert component comprising instructions for performing multiplexed in situ analysis of target biomolecules according to the methods provided herein. In some embodiments, the kit further comprises a one or more HRP-conjugated targeting agents configured to bind or hybridize to a target biomolecule. As described herein, the targeting agents can be synthetic DNA oligonucleotide probes, polyclonal antibodies, monoclonal antibodies, antigen-binding fragments of an antibody, or some combination thereof. In some embodiments, the plurality of HRP-conjugated targeting agents comprises HRP-conjugated synthetic DNA oligonucleotide probes. In some embodiments, the plurality of HRP-conjugated targeting agents comprises HRP-conjugated polyclonal or monoclonal antibodies, or antigen-binding fragments thereof. In some embodiments, the kit further comprises an amplification reaction buffer, a blocking reagent, and/or a hydrogen peroxide additive.",
                        "In some embodiments, the detectable maker includes, without limitation, fluorophores, luminescent agents (e.g., chemiluminescent agents), fluorescent proteins, and radioisotopes. By way of example, detectable markers include Cy5, sulfonated cy5, TAMRA (labeled with tetramethylrhodamine or “TMR”), ALEXA FLUOR™ 594, and ATTO 647N and ATTO 700 fluorophores (ATTO-TEC, Germany). Other fluorophores appropriate for use according to the compositions and methods provided herein include, without limitation, quantum dots, ALEXA FLUOR™ 350, ALEXA FLUOR™ 532, ALEXA FLUOR™ 546, ALEXA FLUOR™ 568, ALEXA FLUOR™ 647, BODIPY 493/503, BODIPY FL, BODIPY R6G, BODIPY 530/550, BODIPY TMR, BODIPY 558/568, BODIPY 558/568, BODIPY 564/570, BODIPY 576/589, BODIPY 581/591, BODIPY 630/650, BODIPY 650/665, Cascade Blue, Cascade Yellow, Dansyl, lissamine rhodamine B, Marina Blue, Oregon Green 488, Oregon Green 514, Pacific Blue, rhodamine 6G, rhodamine green, rhodamine red, tetramethyl rhodamine, DYLIGHT™ DYES (e.g., DYLIGHT™ 405, DYLIGHT™ 488, DYLIGHT™ 549, DYLIGHT™ 594, DYLIGHT™ 633, DYLIGHT™ 649, DYLIGHT™ 680, DYLIGHT™ 750, DYLIGHT™ 800 and the like), Texas Red, and Cy2, Cy3.5, Cy5.5, and Cy7, and sulfonated Cy2, Cy3.5, Cy5, Cy5.5, and Cy7. In some embodiments, the detectable marker is a sulfonated Cy 5, and in some embodiments, there is provided a cleavable detectably-labeled tyramide (CLT) comprising the compound of Formula (II)",
                        "In some embodiments, the kit includes instructions for employing the kit components as well the use of any other reagent not included in the kit. Instructions may include variations that can be implemented. In some embodiments, the kit further comprises tris(2-carboxyethyl)phosphine (TCEP) and 1,3,5-Triaza-7-phosphaadamantane (PTA) either as separate components or as a composition. In such cases, the written instruction component further comprises instructions for removing the detectable label from the detectably-labeled tyramide using the TCEP/PTA.",
                        "Unless defined otherwise, all technical and scientific terms used herein have the same meanings as commonly understood by one of ordinary skill in the art to which this invention belongs. Although any methods and materials similar or equivalent to those described herein can be used in the practice or testing of the present invention, the preferred methods and materials are now described. All publications mentioned herein are incorporated herein by reference for the purpose of describing and disclosing the chemicals, cell lines, vectors, animals, instruments, statistical analysis and methodologies which are reported in the publications which might be used in connection with the invention. Nothing herein is to be construed as an admission that the invention is not entitled to antedate such disclosure by virtue of prior invention.",
                        "As used herein and in the appended claims, the singular forms “a”, “an” and “the” include plural reference, unless the context clearly dictates otherwise. Thus, for example, reference to “a cell” includes a plurality of such cells and equivalents thereof known to those skilled in the art, and so forth. As well, the terms “a” (or “an”), “one or more” and “at least one” can be used interchangeably herein. In addition, the terms “comprising”, “including” and “having” can be used interchangeably.",
                        "As used herein, “about” means within 5% of a stated concentration range or within 5% of a stated time frame.",
                        "Various embodiments and aspects of the present invention as delineated hereinabove and as claimed in the claims section below find experimental support in the following examples which, together with the above descriptions, illustrate some embodiments of the invention in a non-limiting fashion."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Example 1: Multiplexed In Situ Protein Profiling with High-Performance Cleavable Fluorescent Tyramide**",
                                "Abstract: Understanding the composition, function and regulation of complex cellular systems require tools that quantify the expression of multiple proteins at their native cellular context. Here, we report a highly sensitive and accurate protein in situ profiling approach using off-the-shelf antibodies and cleavable fluorescent tyramide (CFT). In each cycle of this method, protein targets are stained with horseradish peroxidase (HRP) conjugated antibodies and CFT. Subsequently, the fluorophores are efficiently cleaved by mild chemical reagents, which simultaneously deactivate HRP. Through reiterative cycles of protein staining, fluorescence imaging, fluorophore cleavage, and HRP deactivation, multiplexed protein quantification in single cells in situ can be achieved. We designed and synthesized the high-performance CFT, and demonstrated that over 95% of the staining signals can be erased by mild chemical reagents while preserving the integrity of the epitopes on protein targets. Applying this method, we explored the protein expression heterogeneity and correlation in a group of genetically identical cells. With the high signal removal efficiency, this approach also enables us to accurately profile proteins in formalin-fixed paraffin-embedded (FFPE) tissues in the order of low to high and also high to low expression levels.",
                                "Introduction: Highly multiplexed protein profiling in their native spatial contexts holds great promise to reveal the composition, regulation and interaction of the various cell types in complex cellular systems [1,2]. Protein microarray [3] and mass spectrometry [4] are well-established methods for proteomic analysis. However, as these approaches do not quantify proteins in their original cellular environment, the location information of the proteins are lost during analysis. Immunofluorescence is a powerful tool for in situ protein quantification. Nonetheless, due to the spectral overlap of the common fluorophores, immunofluorescence only allows a small number of varied proteins to be profiled on each specimen [5].",
                                "To allow multiplexed in situ protein analysis, several techniques [6-14] have been explored. In these approaches, the fluorophores or metal isotopes directly conjugated antibodies are applied as detections tags. Without further signal amplification, these approaches suffer from low detection sensitivity, which limits their applications for analysis of low expression proteins or studying highly autofluorescent specimen, such as formalin fixed, paraffin embedded (FFPE) tissues [7]. Recently, some signal amplification methods have been developed for multiplexed protein imaging [15,16]. However, these approaches require a chemical or oligonucleotide tag to be conjugated to primary antibodies. To prepare those tag conjugated primary antibodies can be time-consuming and expensive. More importantly, the bulky chemical or oligonucleotide tag can interfere with the binding affinity and specificity of the primary antibodies.",
                                "To enable highly sensitive and multiplexed protein imaging with off-the-shelf antibodies, our group developed a reiterative protein staining approach using cleavable fluorescent tyramide (CFT) [17]. We demonstrated its sensitivity is improved by about two orders of magnitude compared with other existing methods. As a result, its imaging time is dramatically reduced, and the sample throughput is significantly enhanced. However, some non-ideal factors still exist. For example, the carbamate group in the first-generation CFT could potentially react with the nucleophiles in the cellular environment or during storage, which may lead to side reactions or short shelf life. Additionally, with tris(2-carboxyethyl)phosphine (TCEP) as the signal removal reagent, the first-generation CFT requires 65° C. to remove ˜95% of the staining signals. Nevertheless, this relatively high reaction temperature could damage the integrity of the epitopes [17].",
                                "Here, we report a highly sensitive and multiplexed in situ protein analysis method using high-performance CFT. In this approach, protein targets are recognized by antibodies conjugated with horseradish peroxidase (HRP) and then stained with CFT. Without the carbamate group in this newly designed CFT, it avoids the potential side reactions with the cellular nucleophiles. Additionally, over 95% the staining signals can be efficiently removed using 1,3,5-Triaza-7-phosphaadamantane (PTA) and TCEP at 40° C. And simultaneously, HRP is also effectively deactivated under this mild condition. Through reiterative cycles of target staining, fluorescence imaging, signal erasing and HRP quenching, we demonstrated at least 10 reiterative immunofluorescence cycles can be successfully carried out in cultured cells. With the generated multiplexed single-cell in situ protein profiling data, we explored the protein expression heterogeneity and correlation in a population of genetically identical cells. We also showed the significantly improved signal removal efficiency of our approach enables the accurate quantification of multiple proteins in the order of low to high and also high to low expression levels in FFPE tissues.",
                                "1. Materials and Methods",
                                "1.1 General Information",
                                "Chemicals and solvents were purchased from Sigma-Aldrich, and were used directly without further purification. Bioreagents were purchased from Invitrogen, unless otherwise noted.",
                                "1.2 Synthesis of tyramide-N3-Cy5",
                                "Cy5-N3 acid (8.3 μmol), prepared according to the literature [18], N,N,N′,N′-Tetramethyl-O—(N-succinimidyl)uronium tetrafluoroborate (TSTU) (12.5 mg, 41.5 μmol) and N,N-diisopropylethylamine (DIPEA) (7.3 μL, 41.5 μmol) was mixed in anhydrous DMF (300 μL) and stirred at room temperature. The complete transformation of Cy5-N3 acid into Cy5-N3 NHS ester was observed via TLC (DCM:Methanol=5:1) after 30 minutes. Then, tyramine hydrochloride (6.23 mg, 41.5 μmol) and DIPEA (14.6 μL, 83.0 μmol) were added into the reaction mixture and stirred for 2 hours. The solvent was evaporated, and the solid residue was purified by preparative TLC (DCM:Methanol=5:1) to obtain the product as dark blue solid. tyramide-N3-Cy5 was further purified by semi preparative reversed phase HPLC [HPLC gradient: A, 100% 0.1 M TEAA; B 100% MeCN; 0-2 min, 5% B (flow 2-5 ml/min); 2-10 min, 5-22% B (flow 5 ml/min); 10-15 min, 22-30% B (flow 5 ml/min); 15-20 min, 30-40% B (flow 5 ml/min); 20-25 min, 40-50% B (flow 5 ml/min); 25-30 min, 50-60% B (flow 5 ml/min); 30-32 min, 60-70% B (flow 5 ml/min); 32-35 min, 70-95% B (flow 5 ml/min); 35-37 min, 95% B (flow 5 ml/min); 37-39 min, 95-5% B, (flow 5 ml/min); 39-42 min, 5% B (flow 5-2 ml/min)]. The fraction with retention time of 26.4 minutes was collected. After evaporating all the solvents, the residue was co-evaporated with methanol twice to obtain pure tyramide-N3-Cy5 as blue solid (3.53 mg, 3.10 μmol). 1H NMR [500 MHz MeOD]: 8.25 (2H, 503H, t, J=16.5 Hz), 7.90 (4H, Ar—H, m), 7.35-7.10 (5H, Ar—H, m), 6.95 (1H, Ar—H, m), 6.9 (2H, Ar—H, d, J=10.5 Hz), 6.62-6.52 (3H, 2×Ar-H and CH═, m), 6.27-6.14 (2H, CH═, dd, J=17 Hz, J=8.0 Hz), 4.7 (1H, CH—N3, t, J=8.0 Hz), 4.10-3.96 (4H, 2×CH2N, m), 3.90 (2H, OCH2, t, J=9.0 Hz), 3.84-3.77 (3H, OCH2, Hb and CH2C(O), m), 3.65-3.60 (1H, OCH2, Ha, m), 3.53 (2H, CH2N, t, J=7.5 Hz), 3.37 (2H, CH2N, t, J=5.0 Hz), 3.29 (2H, CH2O, t, J=5.0 Hz), 2.57 (2H, CH2N, t, J=9.0 Hz), 2.13-2.01 (4H, CH2 and CH2C(O), m), 1.65-1.52 (15H, 4×CH3 and CH3, m), 1.33-1.24 (6H, 3×CH2, m). HRMS (ESI−, m/z) calculated for C57H71N8O13S2 [(M−2H)−]: 1137.4529, found: 1137.4327.",
                                "1.3 Deparaffinization and Antigen Retrieval of FFPE Tonsil Tissue.",
                                "An FFPE Tonsil tissue was heated at 60° C. for 1 h before being deparaffinized in xylene 5 times, each for 4 minutes. Afterwards, the slide was immersed in 100% ethanol for 4 minutes twice, 95% ethanol for 4 minutes, 75% ethanol for 4 minutes then rinsed with DI water. Heat induced antigen retrieval (HIAR) was performed on the slide by using the microwave. The slide was immersed in antigen retrieval buffer (diluted 100 times from Abcam 100× Citrate Buffer pH 6.0 with DI water) and heated in the microwave for 2 minutes and 40 seconds at level 10 setting and then for 14 minutes at level 2 setting. After cooling down for 20 minutes, the slide was rinsed with DI water.",
                                "1.4 Protein Staining in FFPE Tonsil Tissue",
                                "To deactivate the endogenous peroxidase, the slide was incubated with 3% H2O2 for 10 minutes at room temperature, followed by 3 times washes using 1×PBT in PBS. Next, the slide was incubated with 1×blocking buffer for 30 min at room temperature. Then, the slide was incubated with 5 μg/mL rabbit anti hnRNP K, HRP (Abcam; ab204456) in antibody blocking buffer for 1 h, and washed 3 times with 1×PBT, each for 5 min. The slide was stained with tyramide-N3-Cy5 at the concentration of 10 nmol/mL in amplification buffer for 7 minutes at room temperature, then washed 3 times with 1×PBT, each for 5 minutes. The stained tissue was incubated with GLOX buffer (10 mM Tris HCl and 0.4% glucose in 2× saline-sodium citrate (SSC) buffer (30 mM trisodium citrate, 300 mM sodium chloride, pH=7.0)) at room temperature for 1 min, and subsequently imaged in GLOX solution (1% catalase and 0.37 mg/mL glucose oxidase in GLOX buffer).",
                                "1.5 Fluorophore Cleavage and HRP Deactivation.",
                                "The stained tissue was incubated with 100 mM 1,3,5-Triaza-7-phosphaadamantane (PTA) and 100 mM tris(2-carboxyethyl)phosphine (TCEP) sequentially at 40° C., each for 30 minutes. After 5 min wash with PBT and 1×PBS, each for 3 times, the tissue was imaged in GLOX solution.",
                                "1.6 Effect of Cleavage by PTA",
                                "After deparaffined and antigen retrieved, an FFPE tonsil tissue was incubated with 100 mM PTA overnight at 40° C. Then, the slide was washed 3 times with 1×PBT, each for 5 min. Subsequently, the slide was incubated with 5 μg/mL rabbit anti ILF3, HRP (Abcam; ab206250) and stained with tyramide-N3-Cy5. In the control experiment, without PTA treatment in advance, another FFPE tonsil tissue was directly stained with rabbit anti ILF3, HRP (Abcam; ab206250) and tyramide-N3-Cy5.",
                                "1.7 Cell Culture",
                                "HeLa CCL-2 cells (ATCC) were maintained in a humidified atmosphere with 5% CO2 at 37° C. in Dulbelcco's modified Eagle's Medium (DMEM), which was supplemented with 100 U/mL penicillin, 100 g/mL streptomycin and 10% fetal bovine serum. Cells plated on chambered coverglass (200 μL medium/chamber) (Thermo Fisher Scientific) were allowed to reach ˜60% confluency in 1 to 2 days.",
                                "1.8 Cell Fixation and Permeabilization",
                                "Cultured HeLa cells were fixed with 4% formaldehyde (Polysciences) in 1× phosphate buffered saline (PBS) (pH=7.4) for 15 min at 37° C. Subsequently, the cells were washed with 1×PBS three times, each for 5 min. After permeabilized with PBT (0.1% Triton-X 100 in 1×PBS) at room temperature for 10 min, cells were washed with 1×PBS three times, each for 5 min.",
                                "1.9 Immunofluorescence with CFT",
                                "To block endogenous peroxidase, fixed and permeabilized HeLa cells were incubated with 0.15% H2O2 in PBT for 10 min, and subsequently washed three times with 1×PBS, each for 5 min. Then, the cells were blocked with 1× blocking buffer (0.1% (vol/vol) Triton X-100, 1% (wt/vol) bovine serum albumin and 10% (vol/vol) normal goat serum) for 1 h at room temperature. Subsequently, the cells were incubated with 5 μg/mL HRP conjugated primary antibodies in 1× blocking buffer for 1 h, followed by 3 times wash with PBT, each for 5 min. Then, the cells were incubated with tyramide-N3-Cy5 at the concentration of 10 nmol/mL in amplification buffer (0.1 M Boric acid, pH=8.5) for 7 min. Afterwards, the cells were washed quickly with PBT twice, and then washed with PBT again for 3 times, each for 5 min. The stained cells were incubated with GLOX buffer (10 mM Tris HCl and 0.4% glucose in 2× saline-sodium citrate (SSC) buffer (30 mM trisodium citrate, 300 mM sodium chloride, pH=7.0)) at room temperature for 1 min, and subsequently imaged in GLOX solution (1% catalase and 0.37 mg/mL glucose oxidase in GLOX buffer). The primary antibodies used in this work include rabbit anti-HMGB1, HRP (Thermo Fisher Scientific; PAS-22722), rabbit anti-HDAC2, HRP (Abcam; ab195851), rabbit anti-TDP43, HRP (Abcam; ab193850), rabbit anti-PABPN1, HRP (Abcam; ab207515), rabbit anti-hnRNP A1, HRP (Abcam; ab198535), mouse anti-Nucleolin, HRP (Abcam; ab198492), rabbit anti-Histone H4 (acetyl K16), HRP (Abcam; ab200859), mouse anti-hnRNP K, HRP (Abcam; ab204456), rabbit anti-ILF3, HRP (Abcam; ab206250) and mouse anti-Nucleophosmin, HRP (Abcam; ab202579).",
                                "1.10 Multiplexed Protein Imaging in Cells.",
                                "Fixed and blocked HeLa cells were incubated with HRP conjugated antibodies at the concentration of 5 μg/mL for 1 h at room temperature, and subsequently stained with tyramide-N3-Cy5. Afterwards, the stained cells were imaged and then incubated with 100 mM PTA and 100 mM TCEP sequentially at 40° C., each for 30 minutes. The cells were imaged again, followed by the next cycle of immunofluorescence. The sequentially applied antibodies include rabbit anti-HMGB1, HRP (Thermo Fisher Scientific; PAS-22722), rabbit anti-HDAC2, HRP (Abcam; ab195851), rabbit anti-TDP43, HRP (Abcam; ab193850), rabbit anti-PABPN1, HRP (Abcam; ab207515), rabbit anti-hnRNP A1, HRP (Abcam; ab198535), mouse anti-Nucleolin, HRP (Abcam; ab198492), rabbit anti-Histone H4, HRP (acetyl K16) (Abcam; ab200859), mouse anti-hnRNP K, HRP (Abcam; ab204456), rabbit anti-ILF3, HRP (Abcam; ab206250) and mouse anti-Nucleophosmin, HRP (Abcam; ab202579). In control experiments, fixed and blocked HeLa cells were incubated with HRP conjugated primary antibodies at the concentration of 5 μg/mL for 1 h at room temperature, and subsequently stained with Cy5-tyramide (PerkinElmer).",
                                "1.11 Multiplexed Protein Imaging in FFPE Tonsil Tissue.",
                                "After deparaffinization and antigen retrieval, the endogenous peroxidase in FFPE tonsil tissues were blocked by 3% H2O2. Subsequently, the slide was incubated with HRP conjugated antibodies at the concentration of 5 μg/mL for 1 h at room temperature, and then stained with tyramide-N3-Cy5. Afterwards, the stained tissues were imaged and then incubated with 100 mM PTA and 100 mM TCEP sequentially at 40° C., each for 30 minutes. The tissues were imaged again, followed by the next cycle of immunofluorescence. The antibodies, rabbit anti-ILF3, HRP (Abcam; ab206250), mouse anti-Nucleophosmin, HRP (Abcam; ab202579) and mouse anti-hnRNP K, HRP (Abcam; ab204456), were applied in the forward and reverse orders on two different slides.",
                                "1.12 Imaging and Data Analysis",
                                "The HeLa cells and FFPE tonsil tissues were imaged using a Nikon Ti-E epifluorescence microscope with a 20× objective, Chroma filter 49009 and a CoolSNAP HQ2 camera. Image analysis was performed with NIS-Elements Imaging software.",
                                "2. Results",
                                "2.1 Platform Design",
                                "In this multiplexed protein imaging approach, each staining cycle is composed of three major steps (FIG. 1A). First, the protein of interest is recognized by over-the-shelf antibodies labeled with HRP, which catalyzes the coupling reaction between the tyramide in CFT and the tyrosine residues on the proteins proximal to the antibodies. Second, the specimen is imaged under a fluorescence microscope to generate quantitative single-cell in situ protein expression profiles. In the last step, the fluorophores tethered to tyramide are efficiently removed by chemical cleavage, and HRP is simultaneously deactivated. With continuous cycles of staining, imaging, cleavage and HRP deactivation, highly multiplexed and sensitive protein profiling can be achieved in single cells in situ.",
                                "2.2. Design and Synthesis of High Performance CFT",
                                "To eliminate the potential side reactions with the cellular nucleophiles and also improve the shelf life, the high-performance CFT should avoid the carbamate group. Additionally, the linker tethering the fluorophore and tyramide must be cleaved efficiently under a mild condition by a bioorthogonal reaction. Our group recently has developed cleavable fluorescent oligonucleotide for comprehensive RNA and DNA in situ profiling [18]. The azide-based linker used in that method satisfies the two requirements for successful CFT. Therefore, that linker is applied to couple the fluorophore to tyramide in high performance CFT. Most tissues exhibit stronger autofluorescence in the green and yellow emission channels than in the red channel [19]. Thus, to minimize the impact of autofluorescence on the accurate protein analysis, we applied Cy5 as the fluorophore in CFT under the current study.",
                                "To synthesize the designed tyramide-N3-Cy5 (FIG. 1B), Cy5 NHS ester was first coupled the azide-based linker, as previously reported in the literature. The generated product was subsequently converted into the NHS ester and conjugated with tyramine. The prepared CFT was purified by high performance liquid chromatography (HPLC) and characterized by nuclear magnetic resonance (NMR) spectroscopy and mass spectrometry.",
                                "2.3. Efficient Fluorophore Cleavage while Preserving Epitope Integrity",
                                "One consideration for the success of the multiplexed protein imaging approach is to efficiently remove the staining signals without loss of protein antigeneity. In this way, the signal leftover generated in the previous cycles can be minimized, and other protein targets can still be successfully recognized by antibodies in the following immunofluorescence cycles. To assess the fluorophore cleavage efficiency of the high-performance CFT, we stained protein ILF3 in a human tonsil FFPE tissue (FIG. 2A). To facilitate the efficient signal removal in different microenvironment, we applied the positively charged phosphine PTA in combination with the negatively charged phosphine TCEP to perform fluorophore cleavage. After incubating with PTA and TCEP at 40° C. for 30 min, over 95% of the signals were removed (FIG. 2B, C). Compared with the first-generation CFT, the reaction temperature of 65° C. is required to achieve the similar cleavage efficiency. However, that high cleavage temperature leads to the partial loss of protein antigenicity. The results here suggest that the fluorophore in the high-performance CFT can be very efficiently removed under a relatively low cleavage temperature.",
                                "We next investigated whether the epitope integrity is preserved under this cleavage condition. Previously, we have shown that the TCEP treatment at this relatively low temperature does not result in loss of protein antigenicity [8]. Thus, here we evaluated the effects of the PTA incubation on the epitope integrity (FIG. 3). After the PTA treatment overnight, protein ILF3 was stained in a human tonsil FFPE tissue. The generated staining patterns (FIG. 3A, B) and signal intensities (FIG. 3C) are consistent with the ones obtained without the PTA treatment. These results indicate that the antibody antigenicity is maintained under our mild fluorophore cleavage condition.",
                                "2.4. Simultaneous HRP Deactivation and Fluorophore Cleavage",
                                "To enable accurate protein expression analysis by this reiterative imaging approach, it also requires the HRP on antibodies to be deactivated after the staining images have been captured in each analysis cycle. In this way, the HRP applied in the previous cycles will not produce false positive signals in the following cycles. To evaluate whether PTA and TCEP can cleavage the fluorophore and deactivate HRP simultaneously, we stained HMGB1, HDAC2, TAP43, PABPN1, hnRNP A1, Nucleolin, H4K16ac, hnRNP K, ILF3 and Nucleophosmin with HRP labeled antibodies and the high-performance tyramide-N3-Cy5 in HeLa cells (FIG. 4). All the antibodies used in this study are well validated and documented in the literature [20-29]. With the PTA and TCEP treatment, over 95% of the staining signals were erased, leading to the on/off ratio of about 20:1. After signal removal, we stained the cells again with tyramide-N3-Cy5. No signal increases were observed for all the 10 proteins. These results confirm that PTA and TCEP can efficiently cleave the fluorophores in the high-performance CFT, and also suggest that HRP are almost completely deactivated simultaneously.",
                                "2.5. Multiplexed Protein Imaging in Cultured Cells",
                                "To explore whether the high-performance CFT can be applied for multiplexed protein imaging, we stained the 10 different proteins through reiterative immunofluorescence cycles in the same set of HeLa cells (FIG. 5A). As controls, we also stained each of those 10 target proteins using the conventional tyramide signal amplification (TSA) approach (FIG. 5B). The protein distribution patterns generated by the two approaches, together with the ones obtained with antibodies from varied clones [30,31], closely resemble each other. Additionally, the mean protein expression levels per cell obtained using our and TSA methods are also consistent (FIG. 6A). Comparison of the results measured by the two approaches generates an R2=0.99 with a slope of 1.09 (FIG. 6B). These results suggest that our method enables the accurate and multiplexed protein analysis in single cells in situ.",
                                "2.6. Single-Cell Protein Expression Heterogeneity and Correlation",
                                "As reported previously, a group of genetically identical cells can have varied gene expression patterns at the single cell level [32-38]. To study such protein expression heterogeneity in individual HeLa cells, we quantified the distribution of the protein abundances in single cells (FIG. 7A). The expression levels of all the 10 analyzed proteins are distributed widely, which leads to the relatively large expression standard deviations in FIG. 6. And the square of those expression standard deviations is significantly higher than the average expression levels for each measured protein. These results suggest that the protein expression in individual HeLa cells is highly heterogeneous, which may be attributed to the synthesis of those proteins in bursts [39].",
                                "To explore which proteins are coregulated in a regulatory pathway, one can perform protein expression covariation analysis. Such studies carried out in populations of cells usually require external stimuli to induce different protein expression levels in varied cell groups. With the gene expression heterogeneity naturally generated in individual cells, single-cell protein expression covariation analysis can advance our understanding of regulatory pathways and predict the potential function of unannotated proteins [40]. To perform such studies, we calculated the pairwise expression correlation coefficient of the 10 analyzed proteins. Some protein pairs exhibit high expression correlation with the correlation efficient of ˜0.8, including HDAC2 and PABPN together with PABPN and hnRNP A1. To elucidate the regulatory network among the 10 analyzed proteins, a hierarchical clustering method [41] was used and identified a group of 8 proteins with substantial expression correlation (FIG. 7B). As reported in the literature [42-49], those 8 proteins are indeed involved in the transcription processing and regulation pathways.",
                                "2.7. Multiplexed In Situ Protein Profiling in FFPE Tissues",
                                "To demonstrate the feasibility of applying the high performance CFT for multiplexed protein analysis in FFPE tissues, we stained protein ILF3, Nucleophosmin, and hnRNP K through reiterative immunofluorescence cycles on a human FFPE tonsil tissue (FIG. 8A). We also stained these three proteins by the conventional TSA method (FIG. 8B). The staining patterns and signal intensities obtained by the two approaches are consistent with each other (FIG. 8D). These results indicate that multiplexed in situ protein profiling can be achieved in FFPE tissues using the high-performance CFT.",
                                "The existing reiterative protein staining approaches [7-12] require the proteins to be profiled in the order of increasing abundances, so that the leftover signals produced in the previous cycles may not interfere with the protein quantification in the following cycles. However, sometimes the amount of the precious clinical and biological samples is limited, and thus it can be impossible to have the knowledge of the relative protein expression levels in advance. Additionally, the order of the protein abundances in the varied cell types and states in the same specimen can be different. As a result, it might not be feasible to have an ideal protein analysis sequence that works for all the distinct cell types in the same specimen. Due to its high signal removal efficiency, our CFT approach may partially address those issues by eliminating the requirement of knowing the relative protein abundances in advance. To assess whether proteins can be profiled in the order of decreasing expression levels, we stained protein hnRNP K, Nucleophosmin and ILF3 sequentially on a human FFPE tonsil tissue (FIG. 8C). The generated staining patterns and signal intensities of all the three proteins closely resemble the ones obtained by the conventional TSA approach (FIG. 8D). These results suggest that the high signal removal efficiency of our approach enables it to partially eliminate the requirement of the prior knowledge of protein abundances and potentially allow accurate protein quantification regardless of the protein profiling order.",
                                "3. Discussion",
                                "In summary, we have design and synthesized the high performance CFT, and demonstrated it can be applied for multiplexed in situ protein profiling in culture cells and FFPE tissues. Compared the existing multiplexed protein imaging technologies, our approach has the following advantages. First, with the signal amplification by HRP, our approach has dramatically improved detection sensitivity. As a result, it enables the precise quantification of low-expression proteins in highly autofluorescent specimen, and also significantly enhance the sample throughput by reducing the imaging time. Second, as the commercially available and well validated antibodies are directly used in our approach, the time-consuming and expensive antibody-tag conjugation process is avoided. Third, by eliminating the carbamate group in the chemical structure of the high-performance CFT, the potential side reactions during CFT storage and protein staining are minimized. Finally, with the enhanced signal removal efficiency under a mild condition, our approach could allow multiple proteins to be precisely quantified regardless of the protein analysis order.",
                                "The multiplexing capacity of our approach depends on the number of reiterative analysis cycles and the number of proteins profiled in each cycle. We have shown that the protein antigeneity is preserved after the PTA overnight incubation, and we also documented previously that the integrity of the epitopes is maintained following the TCEP treatment for 24 hours [8]. As each signal removal reaction only requires 30 minutes of the PTA and TCEP incubation, we envision that at least 20 to 30 reiterative cycles can be performed on the same sample. In each analysis cycle, after staining the different protein targets using CFT with varied fluorophores, the HRP can be deactivated [50] or the antibodies can be stripped [51] using the established methods. In this way, four or five different proteins can be quantified in each cycle. As a result, we anticipate that our approach has the potential to enable ˜100 proteins to be profiled in the same specimen.",
                                "The high-performance CFT developed here can also be applied for in situ analysis of nucleic acids [52] and metabolics [53]. By integrating these applications with protein analysis, the combined DNA, RNA, protein and metabolic analysis can be achieved in single cells in their natural spatial contexts. This highly multiplexed in situ molecular profiling platform will bring new insights into systems biology, biomedical research and precision medicine.",
                                "**REFERENCES**",
                                "- 1. Steininger, R. J.; Rajaram, S.; Girard, L.; Minna, J. D.; Wu, L.\n  F.; Altschuler, S. J. On comparing heterogeneity across biomarkers.\n  *Cytom. Part A* 2015, 87, 558-567, doi:10.1002/cyto.a.22599.\n- 2. Junker, J. P.; Van Oudenaarden, A. Every cell is special:\n  Genome-wide studies add a new dimension to single-cell biology. *Cell*\n  2014, 157, 8-11, doi:10.1016/j.cell.2014.02.010.\n- 3. LaBaer, J.; Ramachandran, N. Protein microarrays as tools for\n  functional proteomics. *Curr. Opin. Chem. Biol.* 2005, 9, 14-19. doi:\n  10.1016/j.cbpa.2004.12.006.\n- 4. Altelaar, a F. M.; Munoz, J.; Heck, A. J. R. Next-generation\n  proteomics: towards an integrative view of proteome dynamics. *Nat.\n  Rev. Genet.* 2012, 14, 35-48, doi:10.1038/nrg3356.\n- 5. Guo, J.; Wang, S.; Dai, N.; Teo, Y. N.; Kool, E. T. Multispectral\n  labeling of antibodies with polyfluorophores on a DNA backbone and\n  application in cellular imaging. *Proc. Natl. Acad. Sci.* 2011, 108,\n  3493-3498, doi:10.1073/pnas.1017349108.\n- 6. Angelo, M.; Bendall, S. C.; Finck, R.; Hale, M. B.; Hitzman, C.;\n  Borowsky, A. D.; Levenson, R. M.; Lowe, J. B.; Liu, S. D.; Zhao, S.;\n  et al. Multiplexed ion beam imaging of human breast tumors. *Nat.\n  Med.* 2014, 20, 436-442, doi:10.1038/nm.3488.\n- 7. Robertson, D.; Savage, K.; Reis-Filho, J. S.; Isacke, C. M.\n  Multiple immunofluorescence labeling of formalin-fixed\n  paraffin-embedded tissue. *BMC Mol. Biol.* 2008, 9, 1-10,\n  doi:10.1007/978-1-61779-055-3_4.\n- 8. Mondal, M.; Liao, R.; Xiao, L.; Eno, T.; Guo, J. Highly Multiplexed\n  Single-Cell In Situ Protein Analysis with Cleavable Fluorescent\n  Antibodies. *Angew. Chemie Int. Ed.* 2017, 56, 2636-2639,\n  doi:10.1002/anie.201611641.\n- 9. Schweller, R. M.; Zimak, J.; Duose, D. Y.; Qutub, A. a;\n  Hittelman, W. N.; Diehl, M. R. Multiplexed in situ immunofluorescence\n  using dynamic DNA complexes. *Angew. Chem. Int. Ed. Engl.* 2012, 51,\n  9292-9296, doi:10.1002/anie.201204304.\n- 10. Duose, D. Y.; Schweller, R. M.; Zimak, J.; Rogers, A. R.;\n  Hittelman, W. N.; Diehl, M. R. Configuring robust DNA strand\n  displacement reactions for in situ molecular analyses. *Nucleic Acids\n  Res.* 2012, 40, 3289-3298, doi:10.1093/nar/gkr1209.\n- 11. Zrazhevskiy, P.; Gao, X. Quantum dot imaging platform for\n  single-cell molecular profiling. *Nat. Commun.* 2013, 4, 1619,\n  doi:10.1038/ncomms2635.\n- 12. Lin, J. R.; Fallahi-Sichani, M.; Sorger, P. K. Highly multiplexed\n  imaging of single cells using a high-throughput cyclic\n  immunofluorescence method. *Nat. Commun.* 2015, 6, 1-7,\n  doi:10.1038/ncomms9390.\n- 13. Goltsev, Y.; Samusik, N.; Kennedy-Darling, J.; Bhate, S.; Hale,\n  M.; Vazquez, G.; Black, S.; Nolan, G. P. Deep Profiling of Mouse\n  Splenic Architecture with CODEX Multiplexed Imaging. *Cell* 2018, 174,\n  968-981.e15, doi:10.1016/j.ce11.2018.07.010.\n- 14. Giesen, C.; Wang, H. a O.; Schapiro, D.; Zivanovic, N.; Jacobs,\n  A.; Hattendorf, B.; Schüffler, P. J.; Grolimund, D.; Buhmann, J. M.;\n  Brandt, S.; et al. Highly multiplexed imaging of tumor tissues with\n  subcellular resolution by mass cytometry. *Nat. Methods* 2014, 11,\n  417-422, doi:10.1038/nmeth.2869.\n- 15. Liao, R.; Pham, T.; Mastroeni, D.; Coleman, P. D.; Labaer, J.;\n  Guo, J. Highly Sensitive and Multiplexed In-Situ Protein Profiling\n  with Cleavable Fluorescent Streptavidin. *Cells* 2020, 9, 852,\n  doi:10.3390/cells9040852.\n- 16. Saka, S. K.; Wang, Y.; Kishi, J. Y.; Zhu, A.; Zeng, Y.; Xie, W.;\n  Kirli, K.; Yapp, C.; Cicconet, M.; Beliveau, B. J.; et al.\n  Immuno-SABER enables highly multiplexed and amplified protein imaging\n  in tissues. *Nat. Biotechnol.* 2019, 37, 1080-1090,\n  doi:10.1038/s41587-019-0207-y.\n- 17. Liao, R.; Mondal, M.; Nazaroff, C. D.; Mastroeni, D.; Coleman, P.\n  D.; Labaer, J.; Guo, J. Highly Sensitive and Multiplexed Protein\n  Imaging With Cleavable Fluorescent Tyramide Reveals Human Neuronal\n  Heterogeneity. *Front. Cell Dev. Biol.* 2021, 8, 1-15,\n  doi:10.3389/fce11.2020.614624.\n- 18. Mondal, M.; Liao, R.; Nazaroff, C. D.; Samuel, A. D.; Guo, J.\n  Highly multiplexed single-cell in situ RNA and DNA analysis with\n  bioorthogonal cleavable fluorescent oligonucleotides. *Chem. Sci.*\n  2018, 9, 2909-2917, doi:10.1039/C7SC05089E.\n- 19. Jun, Y. W.; Kim, H. R.; Reo, Y. J.; Dai, M.; Ahn, K. H. Addressing\n  the autofluorescence issue in deep tissue imaging by two-photon\n  microscopy: The significance of far-red emitting dyes. *Chem. Sci.*\n  2017, 8, 7696-7704, doi:10.1039/c7sc03362a.\n- 20. Lin, Y. H.; Yao, M. C.; Wu, H. Y.; Dong, J.; Ni, H. Y.; Kou, X.\n  L.; Chang, L.; Luo, C. X.; Zhu, D. Y. HDAC2 (Histone deacetylase 2): A\n  critical factor in environmental enrichment-mediated stroke recovery.\n  *J. Neurochem.* 2020, 155, 679-696. doi:10.1111/jnc.15043.\n- 21. Zhao, L.; Ke, H.; Xu, H.; Wang, G. D.; Zhang, H.; Zou, L.; Xiang,\n  S.; Li, M.; Peng, L.; Zhou, M.; et al. TDP-43 facilitates milk lipid\n  secretion by post-transcriptional regulation of Btnlal and Xdh. *Nat.\n  Commun.* 2020, 11, 341. doi:10.1038/s41467-019-14183-1.\n- 22. Harish, P.; Forrest, L.; Herath, S.; Dickson, G.; Malerba, A.;\n  Popplewell, L. Inhibition of Myostatin Reduces Collagen Deposition in\n  a Mouse Model of Oculopharyngeal Muscular Dystrophy (OPMD) With\n  Established Disease. *Front. Physiol.* 2020, 11, 184.\n  doi:10.3389/fphys.2020.00184.\n- 23. Jia, Q.; Nie, H.; Yu, P.; Xie, B.; Wang, C.; Yang, F.; Wei, G.;\n  Ni, T. HNRNPA1-mediated 3′ UTR length changes of HN1 contributes to\n  cancer- and senescence-associated phenotypes. *Aging* (Albany. N. Y.).\n  2019, 11, 4407-4437, doi:10.18632/aging.102060.\n- 24. Dubois, M. L.; Meller, A.; Samandi, S.; Brunelle, M.; Frion, J.;\n  Brunet, M. A.; Toupin, A.; Beaudoin, M. C.; Jacques, J. F.; Lévesque,\n  D.; et al. UBB pseudogene 4 encodes functional ubiquitin variants.\n  *Nat. Commun.* 2020, 11, 1306. doi:10.1038/s41467-020-15090-6.\n- 25. Li, L.; Ghorbani, M.; Weisz-Hubshman, M.; Rousseau, J.; Thiffault,\n  I.; Schnur, R. E.; Breen, C.; Oegema, R.; Weiss, M. M. M.; Waisfisz,\n  Q.; et al. Lysine acetyltransferase 8 is involved in cerebral\n  development and syndromic intellectual disability. *J. Clin. Invest.*\n  2020, 130, 1431-1445, doi:10.1172/JCI131145.\n- 26. Pellegrini, L.; Hauser, D. N.; Li, Y.; Mamais, A.; Beilina, A.;\n  Kumaran, R.; Wetzel, A.; Nixon-Abell, J.; Heaton, G.; Rudenko, I.; et\n  al. Proteomic analysis reveals co-ordinated alterations in protein\n  synthesis and degradation pathways in LRRK2 knockout mice. *Hum. Mol.\n  Genet.* 2018, 27, 3257-3271, doi:10.1093/hmg/ddy232.\n- 27. Watson, S. F.; Bellora, N.; MacIas, S. ILF3 contributes to the\n  establishment of the antiviral type i interferon program. *Nucleic\n  Acids Res.* 2020, 48, 116-129, doi:10.1093/nar/gkz1060.\n- 28. Chen, Q.; Xi, X.; Zeng, Y.; He, Z.; Zhao, J.; Li, Y. Acteoside\n  inhibits autophagic apoptosis of retinal ganglion cells to rescue\n  glaucoma-induced optic atrophy. *J. Cell. Biochem.* 2019, 120,\n  13133-13140, doi:10.1002/jcb.28586.\n- 29. Maugeri, N.; Campana, L.; Gavina, M.; Covino, C.; De Metrio, M.;\n  Panciroli, C.; Maiuri, L.; Maseri, A.; D'Angelo, A.; Bianchi, M. E.;\n  et al. Activated platelets present high mobility group box 1 to\n  neutrophils, inducing autophagy and promoting the extrusion of\n  neutrophil extracellular traps. *J. Thromb. Haemost.* 2014, 12,\n  2074-2088, doi:10.1111/jth.12710.\n- 30. Uhlén, M.; Fagerberg, L.; Hallstrom, B. M.; Lindskog, C.; Oksvold,\n  P.; Mardinoglu, A.; Sivertsson, Å.; Kampf, C.; Sjöstedt, E.; Asplund,\n  A.; et al. Tissue-based map of the human proteome. *Science* 2015,\n  347, 1260419, doi:10.1126/science.1260419.\n- 31. Thul, P. J.; Akesson, L.; Wiking, M.; Mandessian, D.; Geladaki,\n  A.; Ait Blal, H.; Alm, T.; Asplund, A.; Bjork, L.; Breckels, L. M.; et\n  al. A subcellular map of the human proteome. *Science.* 2017, 356,\n  doi:10.1126/science.aa13321.\n- 32. Becskei, A.; Kaufmann, B. B.; van Oudenaarden, A. Contributions of\n  low molecule number and chromosomal positioning to stochastic gene\n  expression. *Nat. Genet.* 2005, 37, 937-944, doi:10.1038/ng1616.\n- 33. Blake, W. J.; KAErn, M.; Cantor, C. R.; Collins, J. J. Noise in\n  eukaryotic gene expression. *Nature* 2003, 422, 633-637,\n  doi:10.1038/nature01546.\n- 34. Elowitz, M. B.; Levine, A. J.; Siggia, E. D.; Swain, P. S.\n  Stochastic gene expression in a single cell. *Science* 2002, 297,\n  1183-1186, doi:10.1126/science.1070919.\n- 35. Golding, I.; Paulsson, J.; Zawilski, S. M.; Cox, E. C. Real-time\n  kinetics of gene activity in individual bacteria. *Cell* 2005, 123,\n  1025-1036, doi:10.1016/j.ce11.2005.09.031.\n- 36. Ozbudak, E. M.; Thattai, M.; Kurtser, I.; Grossman, A. D.; van\n  Oudenaarden, A. Regulation of noise in the expression of a single\n  gene. *Nat. Genet.* 2002, 31, 69-73, doi:10.1038/ng869.\n- 37. Raser, J. M.; O'Shea, E. K. Control of stochasticity in eukaryotic\n  gene expression. *Science* 2004, 304, 1811-1814,\n  doi:10.1126/science.1098641.\n- 38. Rosenfeld, N.; Young, J. W.; Alon, U.; Swain, P. S.;\n  Elowitz, M. B. Gene Regulation at the Single-Cell Level. *Science*\n  2005, 307, 1962-1965.\n- 39. Raj, A.; Peskin, C. S.; Tranchina, D.; Vargas, D. Y.; Tyagi, S.\n  Stochastic mRNA synthesis in mammalian cells. *PLoS Biol.* 2006, 4,\n  1707-1719, doi:10.1371/journal.pbio.0040309.\n- 40. Munsky, B.; Neuert, G.; van Oudenaarden, a. Using Gene Expression\n  Noise to Understand Gene Regulation. *Science.* 2012, 336, 183-187,\n  doi:10.1126/science.1216379.\n- 41. Eisen, Michael B., Spellman, Paul T., Brown, Patrick O.,\n  Botstein, D. Cluster analysis and display of genome-wide expression\n  patterns. *Proc. Natl. Acad. Sci. USA* 1998, 95, 14863-14868.\n- 42. Jahan, S.; Sun, J.-M.; He, S.; Davie, J. R.\n  Transcription-dependent association of HDAC2 with active chromatin.\n  *J. Cell. Physiol.* 2018, 233, 1650-1657, doi:10.1002/jcp.26078.\n- 43. Lalmansingh, A. S.; Urekar, C. J.; Reddi, P. P. TDP-43 is a\n  transcriptional repressor: the testis-specific mouse acrv1 gene is a\n  TDP-43 target in vivo. *J. Biol. Chem.* 2011, 286, 10970-10982,\n  doi:10.1074/jbc.M110.166587.\n- 44. Jean-Philippe, J.; Paz, S.; Caputi, M. hnRNP A1: the Swiss army\n  knife of gene expression. *Int. J. Mol. Sci.* 2013, 14, 18999-19024,\n  doi:10.3390/ijms140918999.\n- 45. Abdelmohsen, K.; Gorospe, M. RNA-binding protein nucleolin in\n  disease. *RNA Biol.* 2012, 9, 799-808, doi:10.4161/rna.19718.\n- 46. Box, J. K.; Paquet, N.; Adams, M. N.; Boucher, D.; Bolderson, E.;\n  O'Byrne, K. J.; Richard, D. J. Nucleophosmin: from structure and\n  function to disease development. *BMC Mol. Biol.* 2016, 17, 19,\n  doi:10.1186/s12867-016-0073-9.\n- 47. Banerjee, A.; Apponi, L. H.; Pavlath, G. K.; Corbett, A. H.\n  PABPN1: molecular function and muscle disease. *FEBS J.* 2013, 280,\n  4230-4250, doi:10.1111/febs.12294.\n- 48. Castella, S.; Bernard, R.; Corno, M.; Fradin, A.; Larcher, J.-C.\n  Ilf3 and NF90 functions in RNA biology. *Wiley Interdiscip. Rev. RNA*\n  2015, 6, 243-256, doi:10.1002/wrna.1270.\n- 49. Lu, J.; Gao, F.-H. Role and molecular mechanism of heterogeneous\n  nuclear ribonucleoprotein K in tumor development and progression.\n  *Biomed. reports* 2016, 4, 657-663, doi:10.3892/br.2016.642.\n- 50. Liu, G.; Amin, S.; Okuhama, N. N.; Liao, G.; Mingle, L. A. A\n  quantitative evaluation of peroxidase inhibitors for tyramide signal\n  amplification mediated cytochemistry and histochemistry. *Histochem.\n  Cell Biol.* 2006, 126, 283-291, doi:10.1007/s00418-006-0161-x.\n- 51. Stack, E. C.; Wang, C.; Roman, K. A.; Hoyt, C. C. Multiplexed\n  immunohistochemistry, imaging, and quantitation: A review, with an\n  assessment of Tyramide signal amplification, multispectral imaging and\n  multiplex analysis. *Methods* 2014, 70, 46-58,\n  doi:10.1016/j.ymeth.2014.08.016.\n- 52. van de Corput, M. P.; Dirks, R. W.; van Gijlswijk, R. P.; van de\n  Rijke, F. M.; Raap, A. K. Fluorescence in situ hybridization using\n  horseradish peroxidase-labeled oligodeoxynucleotides and tyramide\n  signal amplification for sensitive DNA and mRNA detection. *Histochem.\n  Cell Biol.* 1998, 110, 431-437.\n- 53. Xue, M.; Wei, W.; Su, Y.; Kim, J.; Shin, Y. S.; Mai, W. X.;\n  Nathanson, D. a.; Heath, J. R. Chemical methods for the simultaneous\n  quantitation of metabolites and proteins from single cells. *J. Am.\n  Chem. Soc.* 2015, 137, 4066-4069, doi:10.1021/jacs.5b00944.",
                                "**Example 2: Ultrasensitive and Multiplexed Protein Imaging with Cleavable Fluorescent Tyramide and Antibody Stripping**",
                                "In the current technology, the inventors disclose a technique for ultrasensitive and multiplexed in situ protein identification and quantification procedure using off the shelf antibodies and cleavable fluorescent tyramide (CFT). This technology achieves the detection of large number of varied proteins including low expressing proteins and quantifying them in their native state through continuous cycles of target staining, fluorescence imaging, signal removal and antibody staining. This scores over other protein detection/quantitation tools where isolation of protein is required leading to loss of information about its localization.",
                                "Illustrative features and advantages of embodiments of the present technology include, without limitation:\n\n\n- - Multiplexed and ultrasensitive technique for quantifying and\n    detecting single cell protein in their native state.\n  - Ability to use off the shelf commercial antibodies.\n  - Involves repeated cycles of protein target stain using HRP\n    conjugated antibodies and CFT. After image capture, the staining is\n    erased using fluorophore cleavage and simultaneous\n  - HRP inactivation.\n  - After all the targets are stained in the first cycle, the proteins\n    are stripped to be used for second round of staining.\n  - Potentially up to 10 protein targets can be quantified in one\n    analysis cycle.\n    - Four or Five CFT consisting of distinct fluorophores applied in\n      each cycle.\n    - Together with repeated protein staining and fluorophore cleavage.\n  - This multiplex protein detection technology involving continuous\n    cycles of staining, imaging, fluorophore cleavage and antibody\n    stripping can be used for 20 times while retaining integrity of the\n    protein.\n  - This technique has high sensitivity due to enzymatic amplification\n    and eliminates the use of conjugating primary antibody and can be\n    used for identifying cell types and subtypes for better patient\n    stratification and disease diagnosis.\n  - In some embodiments, the analysis cycle can be divided into six\n    steps.\n    - First, the different proteins of interest are recognized by\n      primary antibodies from distinct species or of varied\n      immunoglobulin classes.\n    - Second, one of protein targets is stained with primary or\n      secondary antibodies conjugated with HRP, which catalyzes the\n      coupling reactions between the tyramide moiety in CFT and the\n      tyrosine residues on the proteins proximal to the target.\n    - Third, images of the specimen are captured under a fluorescence\n      microscope to generate quantitative single-cell protein expression\n      profiles. To facilitate the alignment of different protein\n      staining images, the nucleus stained with DAPI are imaged together\n      with the protein target.\n    - Fourth, the fluorophores are cleaved by a chemical reaction, and\n      HRP is deactivated simultaneously.\n    - Fifth, steps two to four are repeated until every protein target\n      in the first analysis cycle is quantified.\n    - Sixth, all the antibodies are stripped to initiate the next cycle.",
                                "Multiplexed single-cell protein analysis in their native cellular contexts holds great promise to reveal the composition, interaction and function of the distinct cell types in complex biological systems. However, the existing multiplexed protein imaging technologies are limited by their detection sensitivity or technically demanding. To address these issues, here we develop an ultra-sensitive and multiplexed in situ protein profiling approach by reiterative staining with off-the-shelf antibodies and cleavable fluorescent tyramide (CFT). In each cycle of this approach, the protein targets are recognized by antibodies labeled with horseradish peroxidase, which catalyze the covalent deposition of CFT on or close to the protein targets. After imaging, the fluorophores are chemically cleaved and the antibodies are stripped. Through continuous cycles of staining, imaging, fluorophore cleavage and antibody stripping, a large number of proteins can be quantified in individual cells in situ. Applying this method, we analyzed 20 different proteins in each of ˜67,000 cells in a human formalin fixed paraffin-embedded (FFPE) tonsil tissue. Based on their unique protein expression profiles and microenvironment, these individual cells are partitioned into different cell clusters. We also explored the cell-cell interactions in the tissue by examining which specific cell clusters are selectively associating or avoiding each other.",
                                "Understanding the composition, interaction and regulations of complex biological systems require tools that quantify the abundances of multiple proteins in single cells in their native cellular context [1-3]. Mass spectrometry [4] and protein microarray [5] are powerful technologies for comprehensive protein analysis. Nonetheless, these approaches require proteins to be purified and isolated from other cellular components as sample preparation prior to its analysis. Consequently, the protein location information in the biological system is lost. Immunofluorescence is a well-established method for profiling proteins in situ. However, as a result of the spectral overlap of the common fluorophores [6], only a handful of different proteins can be visualized by immunofluorescence in one specimen.",
                                "To enable multiplexed protein imaging, a number of methods have been developed recently. In these techniques [7-16], fluorophores or metal isotopes conjugated primary antibodies are applied to stain the protein targets. Without signal amplification, the low detection sensitivity of these methods limits their applications to study low-expression proteins or to examine specimens with high autofluorescence, such as formalin-fixed paraffin-embedded (FFPE) tissues [17]. To tackle these issues, several laboratories including ours have developed several sensitive and multiplexed protein imaging technologies by signal amplifications with biotin-streptavidin interaction [18], oligonucleotide hybridization [19], and horseradish peroxidase (HRP) [20,21]. However, these methods require a chemical, oligonucleotide or HRP labeled primary antibodies to recognize the protein targets. Such conjugated primary antibodies are usually not commercially available, and to prepare those primary antibodies labeled with the desired tag can be technically demanding, time consuming and costly. Additionally, these bulky tags on the primary antibodies can interfere with their binding specificity and affinity, leading to false negative and positive staining signals.",
                                "Here, we report a highly sensitive and multiplexed in situ protein profiling approach using cleavable fluorescent tyramide (CFT) and off-the-shelf antibodies. In this approach, protein targets are stained with HRP conjugated antibodies and CFT. Following image capture, the staining signals are erased by fluorophore cleavage. And simultaneously, HRP are deactivated. After all the targets are stained in the first cycle, the antibodies are stripped to initiate the second cycle. Through reiterative cycles of target staining, fluorescence imaging, signal removal and antibody stripping, a large of varied proteins can be quantified in their native spatial contexts at the optical resolution. To demonstrate the feasibility of this approach, we show that the microwaving-mediated stripping can efficiently remove the antibodies, and maintain the epitope integrity for at least 20 analysis cycles. Applying this approach, we quantified 20 different proteins in ˜67,000 individual cells in a human FFPE tonsil tissue. Based on their unique protein expression profiles and their neighbor cells, these single cells are partitioned into varied cell clusters. By mapping the cell clusters back to their original tissue locations, we observe that different subregions of the tissue are composed of cells from different clusters. We also studied the cell-cell interactions in the tonsil tissue by identifying the association and avoidance among the specific cell clusters.",
                                "Multiplexed single-cell protein analysis in their native cellular contexts holds great promise to reveal the composition, interaction and function of the distinct cell types in complex biological systems. However, the existing multiplexed protein imaging technologies are limited by their detection sensitivity or technically demanding. To address these issues, here we develop an ultra-sensitive and multiplexed in situ protein profiling approach by reiterative staining with off-the-shelf antibodies and cleavable fluorescent tyramide (CFT). In each cycle of this approach, the protein targets are recognized by antibodies labeled with horseradish peroxidase, which catalyze the covalent deposition of CFT on or close to the protein targets. After imaging, the fluorophores are chemically cleaved and the antibodies are stripped. Through continuous cycles of staining, imaging, fluorophore cleavage and antibody stripping, a large number of proteins can be quantified in individual cells in situ.",
                                "This approach allows the classification of cell types and subtypes based on their protein expression profiles and neighbor cells. These identified cell types and subtypes will bring new insights into cell heterogeneity studies, disease diagnosis, and patient stratification.",
                                "By applying antibody stripping and CFT, our approach enables the large number of the commercially available unconjugated primary antibodies to be directly applied in the assay. Thus, our approach can be easily adopted by the research laboratories and in clinical settings. In comparison with the current multiplexed protein imaging technologies, our approach has ultrahigh detection sensitivity by the enzymatic signal amplification. As a result, low expression proteins or the targets in highly autofluorescent tissues can be accurately quantified.",
                                "In addition, by eliminating the requirement of the sophisticated chemical conjugation of the primary antibodies, the binding specificity and affinity of the anti-bodies are maintained. And by enabling the large number of the commercially available unconjugated primary antibodies to be directly applied in the assay, our approach can be easily adopted by the research laboratories and in clinical settings.",
                                "The present invention has been described in terms of one or more preferred embodiments, and it should be appreciated that many equivalents, alternatives, variations, and modifications, aside from those expressly stated, are possible and within the scope of the invention.",
                                "**Platform Design**",
                                "As shown in FIG. 9A, this multiplexed in situ protein profiling technology has six major steps in each analysis cycle. First, the different proteins of interest are recognized by primary antibodies from distinct species or of varied immunoglobulin classes. Second, one of protein targets is stained with primary or secondary antibodies conjugated with HRP, which catalyzes the coupling reactions between the tyramide moiety in CFT and the tyrosine residues on the proteins proximal to the target. Third, images of the specimen are captured under a fluorescence microscope to generate quantitative single-cell protein expression profiles. To facilitate the alignment of different protein staining images, the nucleus stained with DAPI are imaged together with the protein target. Fourth, the fluorophores are cleaved by a chemical reaction, and HRP is deactivated simultaneously. Fifth, steps two to four are repeated until every protein target in the first analysis cycle is quantified. Finally, all the antibodies are stripped to initiate the next cycle. Through reiterative cycles of protein staining, fluorescence imaging, fluorophore cleavage, HRP deactivation and antibody stripping, highly sensitive and multiplexed in situ protein profiling can be achieved in single cells of intact tissues.",
                                "Efficient Antibody Stripping while Preserving Epitope Integrity",
                                "One aspect to consider for the success of this method is to efficiently strip the antibodies, so that the antibodies applied in the previous cycles will not result in false positive signals in the following cycles. To assess the antibody stripping efficiency, we stained 20 different proteins in human FFPE tonsil tissues with HRP conjugated antibodies and CFT (FIG. 10). Subsequently, the fluorophores were cleaved using a mild chemical reaction with 1,3,5-Triaza phosphaadamantane (PTA) and tris(2-carboxyethyl)phosphine (TCEP). Following signal removal, almost all the staining signals are erased, confirming the high cleavage efficiency of the CFT as we reported before. We also documented that this chemical reaction does not damage the epitope integrity, which allows other proteins to be accurately profiled in the later cycles. Following fluorophore cleavage, the antibodies were removed by microwave-mediated stripping. Afterwards, the tissues were re-incubated with HRP conjugated antibodies and CFT. However, no signal increase was observed. These results indicate that the antibodies applied for protein staining can be efficiently removed by microwave-mediated stripping.",
                                "Another aspect to consider for this approach to succeed is that the epitope integrity must be maintained under this antibody stripping condition. In this way, the stripping process applied in the prior cycles will not interfere with the precise protein profiling in the later cycles. To evaluate the effects of antibody stripping on epitope integrity, we stained proteins hnRNP K, Nucleophosmin and Bcl2 in the same human FFPE tonsil tissue, after 10, 15 and 20 cycles of antibody stripping, respectively (FIG. 11A). As positive controls, we also stained the same three proteins in three FFPE tonsil tissues using the conventional tyramide signal amplification approach. The staining patterns and signal intensities (FIG. 11B) obtained by the two methods are consistent with each other. These results suggest that the epitope integrity is preserved after at least 20 cycles of antibody stripping.",
                                "**Multiplexed In Situ Protein Profiling in FFPE Tissues**",
                                "To demonstrate the feasibility of applying this approach for multiplexed in situ proteinprofiling in FFPE tissues, we stained 20 different proteins using off-the-shelf HRP conjugated antibodies and CFT in the same FFPE human tonsil tissue (FIG. 12). All the 20 proteins were successfully stained and unambiguously detected with the subcellular resolution. The obtained protein staining patterns are consistent with the ones generated by staining each protein in different tissues (FIG. 10). Due to its high detection sensitivity resulting from the HRP signal amplification, our approach allows the imaging time to be dramatically reduced while maintaining the analysis accuracy. By automatic whole slide scanning with the fluorescence microscope, to image this tissue (˜2 mm×4 mm) only takes less than 10 min. In comparison, the current mass spectrometry imaging methods require ˜64 h to image the tissue with the similar sizes. These results indicate that our approach enables highly sensitive and multiplexed in situ protein profiling in FFPE tissues with short assay time and high sample throughput.",
                                "Different Cell Types and their Spatial Distribution in the Human Tonsil Tissue",
                                "The generated single-cell in situ protein expression profiles also allow us to study cell heterogeneity and the spatial distribution of the various cell types in human tonsil tissues. To achieve that, we calculated the expression levels of the 20 examined proteins in each of ˜67,000 cells identified in the tissue. Based on their unique protein expression patterns (FIG. 13A and FIG. 15), those individual cells were partitioned into 10 different cell clusters (FIG. 13B) using the software viSNE. We then mapped these 10 cell clusters back to their natural tissue locations (FIG. 13C and FIG. 16), and observed that the varied subregions of tonsil tissue are composed of cells from distinct clusters. For instance, cluster 7 is the major cell type in epithelium. The germinal centers mainly consist of clusters 8 and 10, while the lymph nodules are dominated by clusters 5, 6 and 9. And clusters 1 and 4 only appear in connective tissues. These results indicate that our approach enables the study of cell type classification and their spatial distribution in FFPE tissues.",
                                "**Cell-Cell Interactions in the Human Tonsil Tissue**",
                                "With the proteins profiled at their native spatial contexts, our approach also allows the investigation of cell-cell contacts between different cell clusters (FIG. 14A). To achieve that, we defined the cell neighborhood as all the cells within the 20 μm distance of a central cell. For the ˜67,000 individual central cells in the human tonsil tissue, we counted the cell number from varied clusters in each of the cell neighborhoods. We then calculated the correlation coefficient of those cell numbers between each pair of the different cell clusters. When displayed in the heatmap, the metric revealed that some cell clusters are selectively associated with or avoiding each other. For example, a significant association was observed between cell clusters 2 and 3, 5 and 9, together with 8 and 10; while an avoidance of contact was revealed between cell clusters 1 and 3, 1 and 8, along with 1 and 10. Interestingly, we observed a consistently strong association between the cells from same cell cluster (FIG. 14A, diagonal), indicating that homotypic cell adhesion may play an important role to form the architecture of the human tonsil tissue.",
                                "Based on the cell number from the distinct clusters in their neighborhoods (FIG. 14B and FIG. 17), the single cells in the same cluster can be partitioned into subclusters (FIG. 14C and FIG. 17). By mapping these newly identified cell subclusters back to their native tissue locations, we observed the different subclusters from the same cell cluster are located at the varied subregions of the tonsil tissue (FIG. 17). For example, subcluster 10a mainly appears in the germinal centers; the majority of subcluster 10b is observed at the lymph nodules; while almost all the subcluster 10c is located in connective tissues (FIG. 14D). These results suggest that our approach allows the investigation of cell-cell contact and the cell type classification based on their microenvironment.",
                                "**Discussion**",
                                "In this study, we have demonstrated that ultrasensitive and multiplexed in situ protein profiling can be successfully achieved in single cells of FFPE tissues using CFT and antibody stripping. In comparison with the current multiplexed protein imaging technologies, our approach has ultrahigh detection sensitivity by the enzymatic signal amplification. As a result, low expression proteins or the targets in highly autofluorescent tissues can be accurately quantified. In addition, by eliminating the requirement of the sophisticated chemical conjugation of the primary antibodies, the binding specificity and affinity of the antibodies are maintained. And by enabling the large number of the commercially available unconjugated primary antibodies to be directly applied in the assay, our approach can be easily adopted by the research laboratories and in clinical settings.",
                                "Applying this method, we have shown that the individual cells in the human tonsil tissue can be classified into different cell clusters based on their unique multiplexed protein expression profiles. And the varied subregions of the tonsil tissue consist of cells from different clusters. We also explored which cell clusters are associating or avoiding each other. Depending on the distinct cell clusters of their neighbor cells, the single cells in each cluster are further partitioned into varied subclusters. These results suggest that our approach allows the classification of cell types and subtypes based on their protein expression profiles and neighbor cells. These identified cell types and subtypes will bring new insights into cell heterogeneity studies, disease diagnosis, and patient stratification.",
                                "The multiplexing capacity of this protein imaging technology depends on the cycling number and the number of proteins interrogated in each analysis cycle. Here we demonstrated that the integrity of the protein epitopes is maintained after at least 20 times of protein stripping. Recently, we also reported that the PTA and TCEP treatment does not damage the epitopes. These results suggest more than 20 analysis cycles can be performed on one tissue sample. In each cycle, the protein targets can be stained with primary antibodies from different species or of varied immunoglobulin classes, hapten or HRP conjugated primary antibodies. With four or five CFT consisting of distinct fluorophores applied in each cycle, together with repeated protein staining and fluorophore cleavage, potentially up to 10 protein targets can be quantified in one analysis cycle. As a result, we envision that this multiplexed protein imaging method has the potential to profile hundreds of varied protein targets in the same specimen.",
                                "This in situ protein analysis method can also be combined with the nucleic acids and metabolic imaging technologies, to enable the integrated DNA, RNA, protein and metabolic profiling in single cells of intact tissues. Moreover, a program-controlled microfluidic system together with a standard fluorescence microscope can easily make an automatic tissue imaging platform. This highly multiplexed molecular imaging system will have wide applications in systems biology and biomedical studies."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce protein in situ profiling approach",
                                "motivate multiplexed protein analysis",
                                "describe limitations of existing methods",
                                "introduce cleavable fluorescent tyramide (CFT) approach",
                                "describe advantages of CFT approach",
                                "introduce high-performance CFT",
                                "describe synthesis of tyramide-N3-Cy5",
                                "describe characterization of tyramide-N3-Cy5",
                                "describe deparaffinization and antigen retrieval of FFPE tissue",
                                "describe protein staining in FFPE tissue",
                                "describe fluorophore cleavage and HRP deactivation",
                                "describe effect of cleavage by PTA",
                                "describe cell culture",
                                "describe cell fixation and permeabilization",
                                "describe immunofluorescence with CFT",
                                "describe multiplexed protein imaging in cells",
                                "describe multiplexed protein imaging in FFPE tissue",
                                "describe imaging and data analysis",
                                "introduce platform design",
                                "describe design and synthesis of high-performance CFT",
                                "motivate use of Cy5 as fluorophore",
                                "describe synthesis of tyramide-N3-Cy5",
                                "describe characterization of tyramide-N3-Cy5",
                                "describe efficient fluorophore cleavage",
                                "describe preservation of epitope integrity",
                                "describe simultaneous HRP deactivation and fluorophore cleavage",
                                "describe staining of multiple proteins in HeLa cells",
                                "describe signal removal efficiency",
                                "describe HRP deactivation efficiency",
                                "describe application of high-performance CFT",
                                "describe advantages of high-performance CFT",
                                "describe limitations of first-generation CFT",
                                "describe improved signal removal efficiency",
                                "describe improved HRP deactivation efficiency",
                                "describe preservation of epitope integrity",
                                "describe application of high-performance CFT in FFPE tissue",
                                "describe advantages of high-performance CFT in FFPE tissue",
                                "describe limitations of existing methods in FFPE tissue",
                                "describe improved protein profiling in FFPE tissue",
                                "summarize high-performance CFT approach",
                                "introduce multiplexed protein imaging",
                                "compare CFT with TSA approach",
                                "analyze protein expression heterogeneity",
                                "study protein expression correlation",
                                "identify regulatory network",
                                "demonstrate multiplexed in situ protein profiling",
                                "compare CFT with conventional TSA method",
                                "discuss limitations of existing reiterative protein staining approaches",
                                "evaluate high signal removal efficiency of CFT",
                                "summarize advantages of CFT approach",
                                "highlight improved detection sensitivity",
                                "emphasize benefits of using commercially available antibodies",
                                "introduce protein analysis",
                                "limitations of current methods",
                                "motivation for new approach",
                                "describe protein antigeneity preservation",
                                "describe epitope integrity maintenance",
                                "envision multiplexing capacity",
                                "describe application to in situ analysis",
                                "describe potential for combined DNA, RNA, protein, and metabolic analysis",
                                "list reference 1",
                                "list reference 2",
                                "list reference 3",
                                "list reference 4",
                                "list reference 5",
                                "list reference 6",
                                "list reference 7",
                                "list reference 8",
                                "list reference 9",
                                "list reference 10",
                                "list reference 11",
                                "list reference 12",
                                "list reference 13",
                                "list reference 14",
                                "list reference 15",
                                "list reference 16",
                                "list reference 17",
                                "list reference 18",
                                "list reference 49",
                                "introduce protein detection technology",
                                "motivate limitations of existing tools",
                                "summarize advantages of present technology",
                                "describe multiplexed protein detection process",
                                "outline six steps of analysis cycle",
                                "highlight importance of multiplexed single-cell protein analysis",
                                "motivate need for ultra-sensitive and multiplexed in situ protein profiling",
                                "describe existing multiplexed protein imaging technologies",
                                "highlight limitations of existing multiplexed protein imaging technologies",
                                "introduce approach using cleavable fluorescent tyramide and off-the-shelf antibodies",
                                "describe protein profiling approach",
                                "demonstrate feasibility of approach",
                                "apply approach to quantify 20 proteins in human FFPE tonsil tissue",
                                "partition individual cells into cell clusters based on protein expression profiles",
                                "study cell-cell interactions in tonsil tissue",
                                "conclude approach enables multiplexed protein imaging",
                                "introduce multiplexed single-cell protein analysis",
                                "motivate limitations of existing technologies",
                                "describe ultra-sensitive and multiplexed in situ protein profiling approach",
                                "explain application of approach in cell heterogeneity studies",
                                "describe advantages of approach over existing technologies",
                                "outline platform design",
                                "describe antibody stripping and epitope integrity",
                                "explain efficient antibody stripping",
                                "demonstrate epitope integrity after antibody stripping",
                                "describe multiplexed in situ protein profiling in FFPE tissues",
                                "demonstrate feasibility of approach in FFPE tissues",
                                "describe cell heterogeneity and spatial distribution in human tonsil tissue",
                                "analyze single-cell in situ protein expression profiles",
                                "identify cell clusters and their spatial distribution",
                                "investigate cell-cell interactions in human tonsil tissue",
                                "analyze cell-cell contacts between different cell clusters",
                                "identify subclusters based on cell-cell contacts",
                                "map subclusters to native tissue locations",
                                "discuss advantages of approach over existing technologies",
                                "discuss application of approach in cell heterogeneity studies",
                                "discuss potential of approach for profiling hundreds of protein targets",
                                "describe potential integration with nucleic acids and metabolic imaging technologies",
                                "outline potential for automatic tissue imaging platform",
                                "discuss potential applications in systems biology and biomedical studies",
                                "summarize approach and its advantages",
                                "conclude discussion"
                            ],
                            "num_characters": 61947,
                            "outline_medium": [
                                "introduce protein in situ profiling approach",
                                "motivate multiplexed protein analysis",
                                "describe limitations of existing methods",
                                "introduce cleavable fluorescent tyramide (CFT) approach",
                                "describe first-generation CFT limitations",
                                "introduce high-performance CFT",
                                "describe synthesis of tyramide-N3-Cy5",
                                "describe materials and methods",
                                "describe deparaffinization and antigen retrieval of FFPE tissue",
                                "describe protein staining in FFPE tissue",
                                "describe fluorophore cleavage and HRP deactivation",
                                "describe effect of cleavage by PTA",
                                "describe cell culture and fixation",
                                "describe immunofluorescence with CFT",
                                "describe multiplexed protein imaging in cells",
                                "describe multiplexed protein imaging in FFPE tissue",
                                "describe imaging and data analysis",
                                "introduce platform design",
                                "describe design and synthesis of high-performance CFT",
                                "describe results of efficient fluorophore cleavage and HRP deactivation",
                                "demonstrate multiplexed protein imaging",
                                "analyze single-cell protein expression heterogeneity",
                                "perform protein expression covariation analysis",
                                "demonstrate multiplexed in situ protein profiling",
                                "discuss limitations of existing approaches",
                                "summarize advantages of high-performance CFT",
                                "introduce protein profiling",
                                "motivate high-performance CFT",
                                "describe protein antigeneity preservation",
                                "describe epitope integrity maintenance",
                                "envision multiplexing capacity",
                                "describe application to in situ analysis",
                                "describe potential for combined DNA, RNA, protein, and metabolic analysis",
                                "list references",
                                "introduce example 2",
                                "describe ultrasensitive and multiplexed protein imaging",
                                "describe cleavable fluorescent tyramide",
                                "describe antibody stripping",
                                "conclude example 2",
                                "introduce protein detection technology",
                                "motivate limitations of existing tools",
                                "summarize advantages of present technology",
                                "describe multiplexed protein detection process",
                                "motivate need for multiplexed protein analysis",
                                "discuss limitations of existing multiplexed protein imaging technologies",
                                "introduce present approach using cleavable fluorescent tyramide and off-the-shelf antibodies",
                                "describe application of present approach to quantify proteins in human FFPE tonsil tissue",
                                "motivate multiplexed single-cell protein analysis",
                                "introduce ultra-sensitive and multiplexed in situ protein profiling approach",
                                "describe application of approach in cell heterogeneity studies, disease diagnosis, and patient stratification",
                                "outline platform design of multiplexed in situ protein profiling technology",
                                "describe efficient antibody stripping while preserving epitope integrity",
                                "demonstrate multiplexed in situ protein profiling in FFPE tissues",
                                "analyze cell heterogeneity and spatial distribution of cell types in human tonsil tissue",
                                "investigate cell-cell interactions in human tonsil tissue",
                                "discuss advantages of approach over current multiplexed protein imaging technologies",
                                "summarize cell type classification and subtypes based on protein expression profiles and neighbor cells",
                                "discuss multiplexing capacity of protein imaging technology",
                                "envision integrated DNA, RNA, protein, and metabolic profiling in single cells of intact tissues",
                                "propose automatic tissue imaging platform for systems biology and biomedical studies"
                            ],
                            "outline_short": [
                                "introduce protein in situ profiling approach",
                                "motivate multiplexed protein analysis",
                                "describe limitations of existing methods",
                                "introduce cleavable fluorescent tyramide (CFT) approach",
                                "describe synthesis of tyramide-N3-Cy5",
                                "describe protein staining in FFPE tonsil tissue",
                                "describe fluorophore cleavage and HRP deactivation",
                                "describe cell culture and fixation",
                                "describe multiplexed protein imaging in cells and FFPE tissue",
                                "describe imaging and data analysis",
                                "demonstrate multiplexed protein imaging",
                                "analyze single-cell protein expression heterogeneity",
                                "discuss advantages of high-performance CFT",
                                "introduce protein profiling",
                                "describe multiplexing capacity",
                                "envision applications",
                                "list references",
                                "describe example 2",
                                "conclude with protein imaging",
                                "motivate multiplexed protein detection",
                                "describe technique for ultrasensitive and multiplexed in situ protein identification and quantification",
                                "discuss limitations of existing protein detection/quantitation tools",
                                "introduce approach for multiplexed single-cell protein analysis",
                                "motivate multiplexed single-cell protein analysis",
                                "describe approach using reiterative staining with off-the-shelf antibodies and cleavable fluorescent tyramide",
                                "outline platform design with six major steps in each analysis cycle",
                                "demonstrate multiplexed in situ protein profiling in FFPE tissues",
                                "analyze cell-cell interactions and spatial distribution of cell types in human tonsil tissue",
                                "discuss advantages and potential applications of the approach"
                            ]
                        },
                        {
                            "title": "Materials and Methods",
                            "paragraphs": [
                                "**General Information**",
                                "Chemicals and solvents were purchased from Sigma-Aldrich or TCI America, and were used directly without further purification. Bioreagents were purchased from Abcam, Invitrogen, or Novus Biology, unless otherwise noted.",
                                "**Deparaffinization and Antigen Retrieval of FFPE Tonsil Tissue.**",
                                "After heated at 60° C. for 1 h, Tonsil FFPE tissue slides were deparaffinized in xylene three times, each for 10 minutes. The slide was then immersed successively in 50/50 xylene/ethanol for 2 minutes, 100% ethanol for 2 minutes, 95% ethanol for 2 minutes, and 70% ethanol for 2 minutes. The slides were rinsed with deionized water. Thereafter, heat induced antigen retrieval (HIAR) was performed using a microwave. The slide was immersed in antigen retrieval citrate buffer (Abcam ab64236) and heated in the microwave for 2 minutes and 45 seconds at high power (level 10) and 14 minutes at low power (level 2). After cooling to room temperature for 20 minutes, the slide was incubated with 3% H2O2 in PBT (0.1% Triton-X 100 in 1× phosphate buffer saline (PBS)) to deactivate endogenous horse radish peroxidase (HRP) for 10 minutes. Subsequently, the slide was washed with PBT for 5 minutes twice before proceeding to Immunofluorescence with CFT.",
                                "**Protein Staining in FFPE Tonsil Tissue**",
                                "The slides were incubated with antibody blocking buffer (0.1% (vol/vol) Triton X-100, 1% (wt/vol) bovine serum albumin and 10% (vol/vol) normal goat serum) at room temperature for 30 min. Subsequently, the slides were incubated with 5 μg/mL of primary antibody (Table 1) in antibody blocking buffer for 1 h, followed by 3 times of 5 min washes with PBT. Then, the slides were incubated with 10 μg/mL of goat anti-rabbit, HRP or goat anti-mouse, HRP (Table 1) in antibody blocking buffer for 1 h, and then washed 3 times with PBT, each for 5 min. Afterwards, the slide were stained with tyramide-N3-Cy5 at the concentration of 10 nmol/mL in amplification buffer (0.003% H2O2, 0.1% Tween-20, in 100 mM borate, pH=8.5) for 10 minutes at room temperature, and then washed twice with PBT, each for 5 min. The tissues were stained with DAPI and mounted with Prolong Diamond Antifade Mountant before proceeding to imaging.",
                                "**Fluorophore Cleavage and HRP Deactivation**",
                                "The stained tissues were incubated with 100 mM 1,3,5-Triaza-7-phosphaadamantane (PTA) and 100 mM tris(2-carboxyethyl)phosphine (TCEP) for 30 minutes sequentially at 40° C. Subsequently, the slides were washed 3 times with PBT and 1×PBS, each for 5 min.",
                                "**Antibody Stripping**",
                                "The slides were immersed in antigen retrieval citrate buffer (Abcam ab64236) and heated in the microwave for 2 min and 45 seconds at high power (700 Watt, level 10) and 14 min at low power (140 Watt, level 2). Then, the tissues were cooled down to room temperature for 20 min.",
                                "**Imaging and Data Analysis**",
                                "FFPE Tonsil tissues were imaged under a Nikon Ti-E epifluorescence microscope equipped with a 20× objective. Images were captured using a CoolSNAP HQ2 camera and C-FL DAPI HC HISN together with Chroma 49009 filters. Image data was processed with NIS-Elements Imaging software. The DAPI images in every cycle were used as coordination reference for aligning the images from different cycles. For the single-cell protein expression profiles, cells were segmented based on nuclear staining by DAPI using NIS-Elements Imaging software. The DAPI signals were expanded by 10 pixels for every cell to determine the regions of interest (ROIs). The signal intensity values within the ROIs of each cell were calculated using CellProfiler, and the resulting single-cell signal intensity profiles were converted into comma separated value (CSV) files. Then, these files were used for unsupervised clustering by CYT to generate ViSNE plots (https://www.c2b2.columbia.edu/danapeerlab/html/cyt.html). All pseudo-color images were generated with ImageJ. Cell neighborhoods were calculated by detecting and classifying the surrounding cells within 20 μm or less of each individual cell in the sample. The number of cells from the different clusters in each cell neighborhood were used for clustering by CYT to generate subcluster ViSNE plots."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list chemicals and solvents",
                                "deparaffinize and retrieve antigens",
                                "deactivate endogenous HRP",
                                "stain proteins in FFPE tonsil tissue",
                                "cleave fluorophores and deactivate HRP",
                                "strip antibodies",
                                "image FFPE tonsil tissues",
                                "analyze image data"
                            ],
                            "num_characters": 4181,
                            "outline_medium": [
                                "list chemicals and solvents",
                                "describe deparaffinization and antigen retrieval",
                                "outline protein staining and fluorophore cleavage",
                                "explain imaging and data analysis"
                            ],
                            "outline_short": [
                                "outline experimental protocols",
                                "describe image processing and analysis"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce in situ protein analysis approach",
                        "describe cleavable labeled tyramide (CLT) composition",
                        "motivate cleavable linker",
                        "describe cleavable linker structure",
                        "provide examples of suitable linkers",
                        "describe tyramide-N3— chemical structure",
                        "describe tyramide-N3-Cy5 chemical structure",
                        "summarize synthesis of tyramide-N3-Cy5",
                        "list fluorophores for use in cleavable detectably-labeled tyramide",
                        "define multiplexed in situ analysis",
                        "outline method for multiplexed in situ analysis",
                        "describe contacting tissue with HRP-conjugated antibody",
                        "describe contacting tissue with cleavable detectably-labeled tyramide",
                        "describe imaging step",
                        "describe cleavage step",
                        "outline reiterative cycles of analysis",
                        "describe targeting agents for protein detection",
                        "describe targeting agents for nucleic acid detection",
                        "describe targeting agents for carbohydrate detection",
                        "describe preparation of antibody-HRP conjugates",
                        "describe preparation of oligonucleotide-HRP conjugates",
                        "describe use of tyramide signal amplification buffer",
                        "describe removing step",
                        "list methods of removing detectable signal",
                        "introduce detectable marker removal",
                        "describe chemical cleavage of linker",
                        "specify temperature and time of incubation",
                        "mention washing step prior to next cycle",
                        "describe fluorescence photomicroscopy detection",
                        "introduce digital fluorescence microscopy",
                        "cite references for M-FISH and SKY",
                        "describe oligonucleotide targeting agent design",
                        "define binding and hybridization",
                        "describe blocking step to reduce background signal",
                        "specify washing step after cleaving detectable label",
                        "introduce stripping step",
                        "describe heat-induced stripping",
                        "describe combination of heat and other agents for stripping",
                        "specify sources of biological entities",
                        "describe cell or tissue fixation step",
                        "define biomolecule and biological molecule",
                        "define polypeptide, peptide, and protein",
                        "define nucleic acid and oligonucleotide",
                        "describe nucleic acid of interest and target nucleic acid",
                        "specify length of oligonucleotide probes",
                        "define hybridize and hybridization",
                        "describe kit components",
                        "specify detectable markers",
                        "describe written insert component",
                        "specify amplification reaction buffer and blocking reagent",
                        "describe hydrogen peroxide additive",
                        "specify TCEP and PTA for removing detectable label",
                        "describe use of kit components",
                        "define technical and scientific terms",
                        "describe publications incorporated by reference",
                        "define singular and plural forms",
                        "define \"about\"",
                        "describe various embodiments and aspects",
                        "cite experimental support",
                        "conclude description of patent application"
                    ],
                    "num_characters": 30682,
                    "outline_medium": [
                        "introduce in situ protein analysis approach",
                        "describe cleavable labeled tyramide (CLT) composition",
                        "motivate cleavable linker design",
                        "describe cleavable linker structures and mechanisms",
                        "provide examples of suitable linkers and cleavage mechanisms",
                        "describe synthesis and characterization of tyramide-N3-Cy5",
                        "introduce method for multiplexed in situ analysis of biomolecules",
                        "outline steps of analysis cycle",
                        "describe targeting agents for protein, nucleic acid, and carbohydrate detection",
                        "discuss preparation of antibody-horseradish peroxidase conjugates",
                        "describe tyramide signal amplification buffer composition",
                        "outline methods for removing detectable signals",
                        "describe detectable marker removal",
                        "introduce chemical cleavage of linker",
                        "specify incubation temperature and time",
                        "describe fluorescence photomicroscopy",
                        "introduce digital fluorescence microscopy",
                        "describe limitations of autofluorescence",
                        "introduce oligonucleotide targeting agents",
                        "define binding and hybridization",
                        "describe blocking step",
                        "introduce washing step",
                        "describe stripping step",
                        "specify sample preparation",
                        "describe cell or tissue fixation",
                        "introduce multiplexed in situ analysis",
                        "describe CTL's of different cycles",
                        "define biomolecule and biological molecule",
                        "describe nucleic acid and oligonucleotide",
                        "introduce kit for multiplexed in situ analysis"
                    ],
                    "outline_short": [
                        "introduce cleavable labeled tyramide",
                        "describe cleavable linker structures",
                        "provide examples of cleavable detectably-labeled tyramides",
                        "outline method for multiplexed in situ analysis of biomolecules",
                        "describe targeting agents for protein, nucleic acid, and carbohydrate detection",
                        "discuss signal removal methods",
                        "describe detectable marker removal",
                        "motivate fluorescently labeled tyramide",
                        "summarize fluorescence microscopy methods",
                        "define binding and hybridization",
                        "describe washing and stripping steps",
                        "motivate biological entity and sample types",
                        "describe cell or tissue fixation step",
                        "motivate biomolecule and nucleic acid definitions",
                        "describe kit components and instructions"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A compound having formula (I):\n\nwherein R comprises a detectable marker.",
        "2. The compound of claim 1 wherein the detectable marker is selected from the group consisting of Cy5, TAMRA (labeled with tetramethylrhodamine or “TMR”), ALEXA FLUOR™ 594, and ATTO 647N and ATTO 700 fluorophores (ATTO-TEC, Germany), quantum dots, ALEXA FLUOR™ 350, ALEXA FLUOR™ 532, ALEXA FLUO® 546, ALEXA FLUOR™ 568, ALEXA FLUOR™ 647, BODIPY 493/503, BODIPY FL, BODIPY R6G, BODIPY 530/550, BODIPY TMR, BODIPY 558/568, BODIPY 558/568, BODIPY 564/570, BODIPY 576/589, BODIPY 581/591, BODIPY 630/650, BODIPY 650/665, Cascade Blue, Cascade Yellow, Dansyl, lissamine rhodamine B, Marina Blue, Oregon Green 488, Oregon Green 514, Pacific Blue, rhodamine 6G, rhodamine green, rhodamine red, tetramethyl rhodamine, DYLIGHT™ DYES (e.g., DYLIGHT™ 405, DYLIGHT™ 488, DYLIGHT™ 549, DYLIGHT™ 594, DYLIGHT™ 633, DYLIGHT™ 649, DYLIGHT™ 680, DYLIGHT™ 750, DYLIGHT™ 800 and the like), Texas Red, and Cy2, Cy3.5, Cy5.5, Cy7, sulfonated Cy2, Cy3.5, Cy 5, Cy5.5, and Cy7, fluorescent proteins, and radioisotopes.",
        "3. The compound of claim 1, wherein the detectable marker comprises a fluorophore.",
        "4. The compound of claim 3, wherein the fluorophore is selected from the group consisting of Cy5, TAMRA, ALEXA FLUOR™ 594, ATTO 647N, and ATTO 700.",
        "5. The compound of claim 1, wherein the compound is formula (II):",
        "6. A method of multiplex in situ analysis of biomolecules in a tissue sample, the method comprising:\n(a) contacting a tissue sample with a first plurality of horseradish peroxidase (HRP)-conjugated targeting agents that are configured to specifically bind to or hybridize to a first target biomolecule in the tissue sample under conditions that promote binding or hybridization of the targeting agents to the target biomolecule;\n(b) contacting the tissue sample with the compound of claim 1 under conditions that promote conjugation of the compound to the target biomolecule;\n(c) imaging the tissue sample thereby detecting the detectable marker;\n(d) contacting the tissue sample with a composition comprising 1,3,5-Triaza-7-phosphaadamantane (PTA) and tris(2-carboxyethyl)phosphine (TCEP);\n(e) repeating steps (a)-(d); wherein a second plurality of HRP-conjugated targeting agents is used to bind to or hybridize to a second target biomolecule, wherein the first and the second target biomolecules are different.",
        "7. The method of claim 6, further comprising:\n(f) repeating steps (a)-(d) N times, wherein the Nth plurality of HRP-conjugated targeting agents is used to bind to or hybridize to the Nth target biomolecule, wherein the first through the Nth target biomolecules are different.",
        "8. The method of claim 6, wherein the first plurality of targeting agents comprises HRP-conjugated synthetic DNA oligonucleotide probes.",
        "9. The method of claim 6, wherein the first plurality of targeting agents comprises HRP-conjugated polyclonal antibodies, HRP-conjugated monoclonal antibodies, or HRP-conjugated antigen-binding fragments thereof.",
        "10. The method of claim 6, wherein the first target biomolecules are less abundant in the sample tissue than the second target biomolecules.",
        "11. The method of claim 6, wherein step (d) comprises incubating the contacted sample at about 40° C. for about 30 minutes.",
        "12. A kit comprising:\n(a) a composition comprising the compound of Formula I or Formula II;\n(b) a composition comprising 1,3,5-Triaza-7-phosphaadamantane (PTA); and\n(c) a composition comprising tris(2-carboxyethyl)phosphine (TCEP).",
        "13. The kit of claim 12, further comprising:\n(d) horseradish peroxidase (HRP)-conjugated targeting agents.",
        "14. The method of claim 6, comprising, after step d) and before step e), stripping the tissue sample of the HRP-conjugated targeting agent.",
        "15. The method of claim 6, comprising, after step (e),\n(f) stripping the tissue sample by subjecting the sample to a boiling solution; and\n(g) repeating steps (a)-(e).",
        "16. The method of claim 7, comprising:\n(h) repeating steps (a)-(d) N times, wherein the Nth plurality of HRP-conjugated targeting agents is used to bind to or hybridize to the Nth target biomolecule, wherein the first through the Nth target biomolecules are different.",
        "17. The method of claim 14, further comprising:\n(i) repeating steps (a)-(h) N times, wherein the Nth plurality of HRP-conjugated targeting agents is used to bind to or hybridize to the Nth target biomolecule, wherein the first through the Nth target biomolecules are different.",
        "18. The method of claim 6, wherein the first plurality of targeting agents comprises HRP-conjugated synthetic nucleic acids capable of binding or hybridizing to the first target biomolecule.",
        "19. The method of claim 6, wherein the detectable marker comprises a dye, fluorophore, or radioisotope.",
        "20. The kit of claim 13, wherein the horseradish peroxidase (HRP)-conjugated targeting agents comprise: HRP-conjugated synthetic nucleic acid, HRP-conjugated synthetic aptamer, HRP-conjugated synthetic DNA oligonucleotide probe, HRP-conjugated polyclonal antibody, HRP-conjugated monoclonal antibody, or HRP-conjugated antigen-binding fragments of an antibody."
    ]
}