{
    "id": "US20200376283",
    "authors": [
        "Markus Enderle",
        "Ulrich Biber",
        "Ovidiu Jurjut"
    ],
    "title": "Method and Device for Quantification of Neuromuscular Stimulations due to RF-currents",
    "date": "2020-05-26 00:00:00",
    "abstract": "A two-part NMS-test bench is provided with which instruments, generator voltages, and surgery modes can be evaluated with regard to neuromuscular stimulations. By separating the NMS-test bench in a first part for application of the instrument and in the second part for evaluation of the physiological effect on nerves, a measurement free of artifacts is possible. The spatial and timely separation of the RF-application from the recording of the compound action potentials makes RF-disturbances ineffective. The electrical signals gained in the instrument test chamber can be pre-processed. The recorded electrical signals emitted from the instrument can be evaluated at the nerve model an arbitrary number of times. The variance involved with the recording of compound action potentials during direct use of the instrument can thus be minimized. The separated test of the signals at the nerve model avoids thermal damage of a prepared nerve and falsification of measurement results.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The invention refers to a method for quantification of neuromuscular stimulations external of a living organism as well as a device for carrying out this method."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field of neuromuscular stimulations"
                    ],
                    "num_characters": 161,
                    "outline_medium": [
                        "introduce neuromuscular stimulations"
                    ],
                    "outline_short": [
                        "introduce neuromuscular stimulations"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "It is known that neuromuscular stimulations can originate from electrosurgical instruments. Indeed electrosurgical instruments are typically applied with a radio frequency voltage, the frequency of which is above the stimulation threshold for nerves, however, neuromuscular stimulations cannot be reliably excluded. Amongst others such neuromuscular stimulations can occur during the transurethral electro-resection of the urinary bladder as well as during the transurethral electro-resection of the bladder or the prostate in the urology or during the hysteroscopic transcervical resection in gynecology. For example, potential intraoperative complications can occur, amongst others hemorrhages or even bladder perforations during a resection of a tumor of urinary tracts. Typically this is the consequence of a stimulation of the obturator nerve along with a sudden and vehement leg adductors contraction. Such a bladder wall perforation is in any case an incident to be avoided. Known possibilities for avoidance consist of the pharmacological blocking the ability to stimulate the obturator nerve, a deep relaxation of the skeletal muscles of the patient or the operation of the instrument with very low energy input. Each of these measures is correlated with specific disadvantages such that they cannot be recommended as general remedy for avoidance of neuromuscular stimulations. Thus, influence parameters of neuromuscular stimulations shall be investigated in order to consider these during a conception of instruments, generators and surgery regulations.",
                        "For this it is the object of the invention to provide a reproducible determination of neuromuscular stimulations in selected instruments, surgery methods, generator adjustments and surgery techniques."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe neuromuscular stimulations from electrosurgical instruments",
                        "describe potential complications",
                        "motivate need for quantification of neuromuscular stimulations"
                    ],
                    "num_characters": 1766,
                    "outline_medium": [
                        "motivate neuromuscular stimulations"
                    ],
                    "outline_short": [
                        "motivate neuromuscular stimulations"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "This object is solved with a method and a test device as described herein.",
                        "The inventive method using an instrument test chamber for reproducible testing of an instrument and for recording of electric signals that can be detected in the instrument test chamber when the instrument is activated. The method further uses a nerve test chamber in which signals for stimulation of a nerve model that have been gained by means of the instrument test chamber and that are potentially standardized with reference to their amplitude and/or filtered with reference to their frequency content or otherwise processed and in which the compound action potentials derived therefrom can be measured. The nerve model can be a mathematical model, a model realized by a computer program, a digital or analog model realized by hardware or a prepared nerve. The invention allows the quantification of neuromuscular reactions during use of electrosurgical systems. Such an electrosurgical system is considered to be the entirety consisting of the instrument provided for surgery, the desired voltage form of the RF-voltage and RF-power supplied from the generator to the instrument, as well as the type of the electrosurgical use, e.g. the incision. Due to the inventive method for quantification of neuromuscular stimulations external from a living organism, the risk of neuromuscular stimulations by an electrosurgical system can be quantified already prior to the use with animals or human beings. Thus, a platform is provided that basically adjusts the risk of neuromuscular stimulations in a new electrosurgical system on a clinically acceptable level without the need to execute animal experiments. This allows the acceleration of the development of electrosurgical instruments with concurrently improved safety.",
                        "The invention is based on the separation of the evaluation of the electrosurgical system from the evaluation of the effect on a prepared nerve or a nerve model. The instrument test chamber is part of the evaluation of the electrosurgical system in which the instrument is located that has to be evaluated and is applied with an RF-voltage of a predefined curve characteristic (wave form) and is positioned in a predefined manner. The positioning of the instrument can comprise the arrangement thereof at a predefined location in the instrument test chamber. The positioning can also comprise the movement of the activated instrument, i.e. the instrument to which the RF-voltage is applied, along a predefined path.",
                        "In the instrument test chamber at least one electrical signal is recorded from which a stimulation signal is determined. The stimulation signal is provided to the nerve model that is stimulated with the stimulation signal in this way and can accordingly output compound action potentials. The latter are detected and used for evaluation of the neuromuscular stimulation. For this it can be, e.g. stored in a database together with the other test conditions (instrument type, RF-voltage form, stimulation voltage or power, surgery paths).",
                        "The nerve model can be a technical model (electrical analog or digital circuit or computer program), as already mentioned. Alternatively, the nerve model can be formed by a nerve test chamber that comprises at least a stimulation electrode pair and at least a diverting electrode pair, wherein prepared functional nerve is placed in the nerve test chamber such that it is in contact with the stimulation electrode pair as well as the diverting electrode pair in order to measure the compound action potentials. The electrical signal recorded in the instrument test chamber can be first stored or also directly processed for determination of the stimulation signal. If necessary, additionally or alternatively the determined stimulation signal can be stored. The processing of the electrical signal for determination of the stimulation signal can comprise a filtering, particularly a low pass filtering and/or a temporal scaling and/or an amplitude scaling. The stimulation signal can be standardized for amplitude scaling in that it is referenced with a reference stimulation voltage. For this a standard signal, e.g. a square wave pulse with 7 V stimulation amplitude and a duration of 100 μs can be supplied to the nerve model as stimulation signal and therefrom the compound action potential with maximum response amplitude can be determined. In a next step the stimulation potential can be determined that is sufficient to obtain a compound action potential that can only just be measured. In doing so, the responsivity of the nerve can be checked based on empirical limit values. In a further step the stimulation signal obtained during the experiment by use of a real instrument in the measuring chamber can be amplified or attenuated until it corresponds to the compound action potential gained by the test impulse or with a defined fraction thereof. In doing so, the stimulation signal is preferably adjusted to an amplitude that yields to a compound action potential that is smaller than the maximum compound action potential, however, larger than the minimum compound action potential that can be measured at a nerve model. The inventive method can also comprise that the compound action potential provided by the nerve model is further processed before it is used for the evaluation of a surgical system. For this a non-functional nerve that can be for example removed from an animal, can be arranged in the nerve test chamber that is applied with the same stimulation signal as the functional nerve. The signal provided by the non-functional nerve can be subtracted from the compound action potential of the functional nerve in order to calculate a signal transmission of the stimulation signal from the compound action potentials that does not stem from the function of the nerve.",
                        "The non-functional nerve can be a prepared nerve with a bruise location that is placed between the stimulation electrode pair and the diverting electrode pair.",
                        "The device for quantification of neuromuscular stimulations external from a living organism that also belongs to the invention is suitable and configured for carrying out the inventive method. For this the device comprises particularly an instrument test chamber comprising a first compartment and a second compartment that are separated from each other by a wall and that are at least partly filled with the same or different liquids respectively. The liquid is preferably an electrolyte, preferably saline solution at least in one of the compartments, preferably in the second. While the instrument is arranged in the first compartment and is potentially moved, the diverting electrodes are positioned in the second compartment. The wall for separation of the compartments can be formed by tissue explanted from an organism, e.g. a bladder wall. It is, however, also possible to configure the wall from another natural material or plastic material in order to provide reproducible results.",
                        "A processing unit is also part of the device to which the signals output from the diverting electrodes are supplied. These signals can be directly supplied from the diverting electrodes to the processing unit or can be buffered before. In the latter case a storage device is arranged between the diverting electrodes and the processing unit.",
                        "The processing unit can serve for scaling, standardizing and/or filtering of the electrical signals delivered from the diverting electrodes in order to form stimulation signals for the nerve model therefrom.",
                        "With the presented methods and the presented device it is possible to test surgery systems under reproducible conditions and to examine the effect of modifications with reference to instrument configuration and/or RF-voltage form and/or energy input and/or movement of the instrument. In doing so, it is possible to contrast different surgery systems and compare them, for example, with regard to the used instruments and their electrode shapes, the used RF-voltage and the wave form thereof as well as with reference to the incision path."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for quantification of neuromuscular stimulations",
                        "describe instrument test chamber",
                        "describe nerve test chamber",
                        "describe stimulation signal",
                        "describe compound action potential",
                        "describe processing of electrical signal",
                        "describe standardization of stimulation signal",
                        "describe measurement of compound action potential",
                        "describe subtraction of signal from non-functional nerve",
                        "describe selection of diverting electrodes",
                        "describe application of standard signal",
                        "describe measurement of compound action potential",
                        "describe selection of diverting electrodes",
                        "describe advantages of method",
                        "describe acceleration of development of electrosurgical instruments",
                        "describe improved safety"
                    ],
                    "num_characters": 8094,
                    "outline_medium": [
                        "solve object with method and test device",
                        "describe method using instrument test chamber",
                        "describe nerve test chamber",
                        "quantify neuromuscular reactions",
                        "separate evaluation of electrosurgical system",
                        "describe instrument test chamber",
                        "describe nerve model",
                        "summarize advantages"
                    ],
                    "outline_short": [
                        "describe method for quantification of neuromuscular stimulations",
                        "describe test device for quantification of neuromuscular stimulations",
                        "describe separation of evaluation of electrosurgical system and effect on nerve model",
                        "describe acceleration of development of electrosurgical instruments"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "FIG. 1 shows a part of a device 10 for quantification of neuromuscular stimulations external from a living organism that is subsequently referenced as NMS-test bench. A second part 11 of the NMS-test bench is illustrated in FIG. 2.",
                        "An instrument test chamber 12 is part of the NMS-test bench 10 according to FIG. 1 that comprises two compartments 13, 14 that are separated from each other by a wall 15, preferably a semi-permeable wall 15. The wall 15 can consist particularly from an explanted biological material, such as e.g. a pig bladder or another biological tissue. Alternatively, the wall 15 can also be made from a fine porous plastic material, a felt or the like, as long as it is guaranteed that the electrical voltage transmission between the two compartments 13, 14 is equal or similar to the voltage transmission of a pig bladder or another biological material to be examined.",
                        "Both compartments 13, 14 are filled with liquid. A compartment 13 is preferably filled with an electrolyte, particularly saline solution, e.g. a physiological saline solution. The compartment 14 is filled with a fluid that shall be used during a real surgery, e.g. also a physiological saline solution or also another electrolytic conducting or non-conducting fluid.",
                        "In the compartment 14 a surgical instrument 16 is arranged that is preferably configured as bipolar instrument and as such comprises an electrode 17 as well as a neutral electrode 18. However, also other instruments can be used that contain only the electrode 19, but not the neutral electrode 18. In such a case, the neutral electrode is arranged at another location in the instrument test chamber 12, e.g. in the compartment 13 or in the compartment 14.",
                        "The instrument 16 is connected with a generator 20 via a cable 19 that can contain, e.g. two conductors connected with the electrode 17 and the neutral electrode 18, wherein the generator 20 can supply an electrical radio frequency voltage to the instrument 16. Preferably the generator 20 is configured to supply different radio frequency voltage forms that are also possible during use on a patient and the physiological effect of which shall be compared in view of neuromuscular stimulations.",
                        "A signal differential amplifier 21 is also part of the NMS-test bench 10 according to FIG. 1 that comprises a number of inputs that are connected with diverting electrodes 22, 23, 24, 25 that are arranged in the compartment 13 at the side of the wall 15 that faces away from the instrument 16. The diverting electrodes 22, 23, 24, 25 are preferably arranged along a path or in the proximity of a path along which the obturator nerve extends in a mammal or human being. In addition, the signal differential amplifier 21 can be connected with a reference electrode 26 that is arranged in some distance, preferably at the side of the compartment 13 away from the wall 15. The signal differential amplifier 21 can be connected to a storage device 27, e.g. in form of a storage oscilloscope in order to record and if desired also to display electrical signals diverted from the electrodes 22-25. In case of an activation of the instrument 16, i.e. application of a current to the electrode 17, the voltages that occur at the electrodes 22-25 are detected and recorded.",
                        "A switch 28 can be part of the NMS-test bench according to FIG. 1 that is connected with generator 20 as well as the storage 27 in order to activate the instrument 16 in case of actuation and concurrently initiate the recording of the potentials occurring at the electrodes 22-25. In addition, a non-illustrated device can be provided in order to position the instrument 16 in a predefined manner, i.e. to keep it immovably at a specific position in the compartment 14. In a further embodiment the device can also be configured to move the instrument along a predefined path, e.g. toward the wall 15 and away therefrom or along the wall 15. The positioning and movement of the instrument 16 can also be controlled by switch 28. The storage 27 comprises an output 29 at which the signals obtained from the electrodes 22-25 and amplified by the signal differential amplifier 21, stored in the storage 27 are provided or can be provided for transfer to other parts of the test bench.",
                        "The part of the NMS-test bench 10 according to FIG. 1 described thus far operates as follows:",
                        "For reproducibly detecting electrical voltages that can occur during use of the instrument 16 on tissue of a human or animal body, one or more experiments are carried out with the NMS-test bench 10. For this first an instrument 16 to be tested as well as a desired mode, i.e. a desired RF-voltage form, are selected at the generator 20. In addition to the voltage form, the RF-power and/or the RF-voltage and if necessary other electrical parameters can be defined such as, e.g. maximum current, maximum power, the pulse-pause-ratio of the RF-voltage or a range therefore. In addition, a position of the instrument 16 can be defined in which the instrument 16 is maintained during the experiment. Alternatively, a path can be defined along which the instrument 16 shall be moved during the experiment.",
                        "For carrying out the experiment the switch 28 is actuated, which results in applying a current to instrument 16 and for example moving the instrument 16 along the wall 15 over a predefined distance. The voltages occurring thereby at the electrodes 22, 23, 24, 25 are detected, amplified (or attenuated) by the signal differential amplifier 21 and stored in storage 27. The storage 27 can be configured to store a larger number of signals that stem from a larger number of activations, i.e. actuations of the switch 28.",
                        "At least one of the signals S gained in this way is now evaluated in the second part 11 of the NMS-test bench in a reproducible manner with regard to its physiological effect. For this the NMS-test bench 11 according to FIG. 2 comprises a nerve model 30 that can be, for example, formed by an electrical network. The nerve model comprises in each case an input 31 and an output 32 that supplies a compound action potential (CAP) 32 or multiple CAPs, if a stimulation signal above a control threshold is supplied to the input 31. In the present case the nerve model 30 is formed by a nerve test chamber 33 that comprises a series of preferably stick-like electrodes orientated parallel to each other in a predefined distance of, e.g. 5 mm, on which a prepared nerve 34 that is, for example removed from an animal, is led such that it contacts the stick-like electrodes.",
                        "The part of the NMS-test bench 11 shown in FIG. 2 comprises an input 35 that can be connected with the output 29 of the NMS-test bench 10 according to FIG. 1. The connection can be any connection suitable for data transmission including a radio connection, a light path, a cable connection or a connection via data media, such as CD or stick or via a network. A processing device 36 can be connected to the input 35 that can, e.g. serve for signal filtering. For example, all of the frequency components above a frequency limit of, for example 100 kHz, can be filtered from the signal stored in the storage 27 and thus removed. Alternatively, this part of the signal processing can also be carried out by the signal differential amplifier 21 and/or the storage device 27.",
                        "The input 35 is directly connected with a signal generator 37 or indirectly via the signal processing device 36, wherein the signal generator 37 is directly connected with stimulation electrodes 39, 40 of the nerve test chamber 33 or via a signal amplifier 38. The nerve 34 led thereon receives the signal applied to the stimulation electrodes 39, 40.",
                        "An amplifier 43 is connected to two other electrodes configured as diverting electrodes 41, 42, the output signal of which is supplied to an oscilloscope, a database or a storage block 44.",
                        "It is indicated that single, multiple or all elements of the NMS-test bench 11 illustrated in FIG. 2 can be provided as electrical analog circuit, as digital circuit or as computer model.",
                        "For evaluating of the physiological effects of at least one signal determined by the NMS-test bench part 10 of FIG. 1, in the simplest case a mostly disturbance-free signal is selected from the recorded signal. Signals recorded too close to the electrode 17 can be disturbed. Signals recorded too far away can be too weak. Preferably the signal of the electrodes 22-25 is selected that is about 3 mm distant from the cut, i.e. from the electrode 17. In this distance thermal damages of tissue hardly occur, however, neuromuscular stimulations can still be expected.",
                        "The selected signal is supplied to the nerve model 30 of the NMS-test bench part 11. For this the signal received at the input 35 is transferred by the signal processing device 36, e.g. low pass filtered, amplified by the signal amplifier 38, if appropriate, and supplied to the stimulation electrodes 39, 40. The prepared nerve 34 reacts to this stimulation by generating of more or less CAPs that can be measured by the diverting electrodes 41, 42 and finally recorded in the storage block 44. Thus, the physiological effects of different signals provided at the input 35 can be evaluated and compared in a reproducible manner.",
                        "The reference stimulation signal applied to the electrodes 39, 40 is adjusted in its amplitude, such that the compound action potential 32 delivered by the nerve 34 and received at the diverting electrodes 41, 42 corresponds to a fraction of the maximum CAP. This fraction CAP80 is preferably 80% of the maximum CAP.",
                        "Also the signals of multiple or all of the electrodes 22-25 can be supplied subsequently to the nerve model 30 in order to find out in this manner in which distance from the cut neuromuscular stimulations still occur and in which distance safe cutting is still possible.",
                        "The signal received at the diverting electrodes 41, 42 can be a mixed signal that contains CAPs transmitted from the nerve 34 as well as signal portions created by direct electrical conduction. It is therefore useful to replace nerve 34 by a non-functional nerve that contains a bruise location between the stimulation electrodes 39, 40 and the diverting electrodes 41, 42 at which the stimulation propagation is interrupted. The signal transmitted by such a non-functional nerve to the diverting electrodes 41, 42 can be subtracted from the corresponding signal of the functional nerve 34 measured at the diverting electrodes 41, 42. In doing so, the signal conducted by nerve 34 can be detected and stored free of artifacts, stimulus artifacts are avoided.",
                        "Another part of the inventive method refers to the selection of the diverting electrodes 41, 42 from the group of present electrodes. For this a defined standard signal is applied to the stimulation electrodes 39, 40, e.g. a 100 μs square wave pulse of such a voltage that leads with reliability to a complete stimulation of nerve 34, i.e. of all of the contained nerve fibers, such that it supplies the maximum compound action potential CAP. The stimulation signal that is reliably sufficient for this is, e.g. a 7 V signal. Those electrodes are now selected as diverting electrodes 41, 42 that have a predefined distance of, for example 1.5 cm to the stimulation electrodes 39, 40. If the compound action potentials arriving at the diverting electrodes should be too small, i.e. falling below a predefined limit (amplitude), the distance can be shortened, e.g. to 1 cm.",
                        "Alternatively, those electrodes 41, 42 can be selected as diverting electrodes 41, 42 at which at least a compound action potential of 3 mV can be measured. If the test is started with the electrode pair that is arranged farthest to the right, diverting electrode pairs are selected that are arranged further to the left, if a compound action potential of at least 3 mV is not achieved. In the next step standard square wave impulses of, for example 100 μs duration can be applied at the stimulation electrodes 39, 40, wherein the stimulation amplitude starts at a low level of, e.g. 100 mV and is increased or decreased in a stepwise manner. If the amplitude that is necessary at the stimulation electrodes 39, 40 in order to be able to detect any compound action potential at the diverting electrodes 41, 42, is larger than 500 mV, electrodes that are arranged farther to the left are selected as diverting electrodes in a stepwise manner. In doing so, those electrodes are selected as diverting electrodes 41, 42 with which a standardized measurement is possible.",
                        "According to the invention, a two-part NMS-test bench 10, 11 is provided with which instruments 16, generator voltages and/or surgery modes can be evaluated systematically with regard to neuromuscular stimulations. By separating the NMS-test bench in a first part 10 for application of the instrument and in the second part 11 for evaluation of the physiological effect on nerves 34, a measurement free of artifacts is possible. The spatial and timely separation of the RF application from the recording of the compound action potentials makes RF-disturbances ineffective that otherwise emit from the instrument and disturb the measurement. In addition, the electrical signals gained in the instrument test chamber can be subject to a pre-processing, such as for example a filtering, an amplification or attenuation. The recorded electrical signals emitted from the instrument can be subject to an evaluation at the nerve model 30 in an arbitrary number of times. The variance that is involved with the recording of the compound action potentials during direct use of the instrument can thus be minimized. In addition, the separated test of the obtained signals at the nerve model 30 avoids thermal damage of a prepared nerve 34 and thus a falsification of measurement results. In addition, the equipment expenses for evaluation of electrosurgical systems with regard to neuromuscular stimulations is reduced by the present invention."
                    ],
                    "subsections": [
                        {
                            "title": "LIST OF REFERENCE SIGNS",
                            "paragraphs": [
                                "- **10** NMS test bench—first part\n- **11** NMS test bench—second part\n- **12** instrument test chamber\n- **13**, **14** compartments\n- **15** wall\n- **16** instrument\n- **17** electrode\n- **18** neutral electrode\n- **19** cable\n- **20** generator\n- **21** signal differential amplifier\n- **22**-**25** electrodes\n- **26** reference electrode\n- **27** storage\n- **28** switch\n- **29** output\n- **30** nerve model\n- **31** input (nerve test chamber)\n- **32** output\n- **33** nerve test chamber\n- **34** nerve\n- **35** input (nerve model)\n- **36** signal processing device\n- **37** signal generator\n- **38** signal amplifier\n- **39**, **40** stimulation electrodes\n- **41**, **42** diverting electrodes\n- **43** amplifier\n- **44** memory block"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list reference signs"
                            ],
                            "num_characters": 741,
                            "outline_medium": [
                                "list reference signs"
                            ],
                            "outline_short": [
                                "list reference signs"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe instrument test chamber",
                        "describe compartments",
                        "describe wall",
                        "describe instrument",
                        "describe electrode",
                        "describe neutral electrode",
                        "describe cable",
                        "describe generator",
                        "describe signal differential amplifier",
                        "describe electrodes",
                        "describe reference electrode",
                        "describe storage",
                        "describe switch",
                        "describe output",
                        "describe nerve model",
                        "describe input",
                        "describe output",
                        "describe nerve test chamber",
                        "describe nerve",
                        "describe input",
                        "describe signal processing device",
                        "describe signal generator",
                        "describe signal amplifier",
                        "describe stimulation electrodes",
                        "describe diverting electrodes",
                        "describe amplifier",
                        "describe memory block"
                    ],
                    "num_characters": 13978,
                    "outline_medium": [
                        "describe instrument test chamber",
                        "describe compartments and wall",
                        "describe instrument and generator",
                        "describe signal differential amplifier",
                        "describe diverting electrodes",
                        "describe storage device",
                        "describe switch",
                        "describe nerve model",
                        "describe nerve test chamber",
                        "describe signal processing device",
                        "describe signal generator",
                        "describe stimulation electrodes",
                        "describe amplifier and memory block"
                    ],
                    "outline_short": [
                        "describe instrument test chamber",
                        "describe compartments and wall of instrument test chamber",
                        "describe instrument and generator",
                        "describe signal differential amplifier and electrodes",
                        "describe nerve model and nerve test chamber",
                        "describe evaluation of physiological effects of signals"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for quantifying neuromuscular stimulations external from a living organism the method comprising the following steps:\napplying a radio frequency voltage to an instrument (16) located in an instrument test chamber (12) and positioning the instrument in a defined manner,\nrecording an electrical signal (S) in the instrument test chamber (12) via at least one electrode (22),\ndetermining a stimulation signal (A) from the recorded electrical signal (S), and\nstimulating a nerve model (30) with a stimulation signal and detecting compound action potentials (CAPs) output from the nerve model (30).",
        "2. The method according to claim 1, further comprising placing a section of a prepared nerve (34) for use as the nerve model (30) in a nerve test chamber (33) comprising at least one stimulation electrode pair (39, 40) and at least one diverting electrode pair (41, 42), such that the prepared nerve (34) contacts the at least one stimulation electrode pair (39, 40) as well as the at least one diverting electrode pair (41, 42), and\napplying the stimulation signal (A) to the stimulation electrode (39, 40) and detecting a signal arriving at the diverting electrodes (41, 42) as compound action potentials (CAPs).",
        "3. The method according to claim 1, further comprising storing the recorded electrical signal (S).",
        "4. The method according to claim 1, further comprising processing the recorded electrical signal (S) for determination of the stimulation signal (A).",
        "5. The method according to claim 4, further comprising low pass filtering the recorded electrical signal (S) for determination of the stimulation signal (A).",
        "6. The method according to g claim 1, further comprising buffering the stimulation signal (A).",
        "7. The method according to claim 6, further comprising standardizing the stimulation signal (A) by referencing it with a reference stimulation voltage.",
        "8. The method according to claim 7, wherein standardizing the stimulation signal includes applying a reference stimulation signal to the stimulation electrode (39, 40) and determining first the compound action potential (CAP) and subsequently increasing or decreasing the reference stimulation signal until the resulting compound action potential (CAP) is within predetermined limits.",
        "9. The method according to claim 8, further comprising amplifying or attenuating the stimulation signal (A) with an amplification factor determined by the quotient of an amplitude of a stimulation signal providing a predefined fraction (CAP80) of the compound action potential (CAP) and an initial amplitude of the reference stimulation signal.",
        "10. The method according to claim 1, further comprising determining a stimulus artifact (ART) by applying the stimulation signal (A) to a non-functional nerve inserted in the nerve test chamber (33).",
        "11. Method according to claim 10, further comprising determining a difference signal by subtracting the stimulus artifact (ART) of the non-functional nerve from the compound action potentials (CAPs) of the functional nerve and evaluating at least one of the instrument (16), the radio frequency voltage, and the positioning of the instrument (16) in view of a potential for neuromuscular stimulations based on the difference signal.",
        "12. A device for quantification of neuromuscular stimulations external from a living organism, the device comprising:\nan instrument test chamber (12) that comprises a first compartment (13) and a second compartment (14), wherein the first and second compartments (13, 14) are separated by a wall (15), wherein each of the first and second compartments are configured to be at least partly filled with a liquid\ndiverting electrodes (22, 23, 24, 25) positioned in the first compartment (13); and wherein the second compartment (14) is configured to receive a device to be tested,\na pre-processing unit (36) to which signals (S) output from the diverting electrodes (22, 23, 24, 25) are supplied, wherein a signal generator (37) is connected to the pre-processing unit (36), and\na nerve test chamber (33) configured to receive a prepared nerve (34), wherein the signal generator (37) is connected to the nerve test chamber (33).",
        "13. The device according to claim 12, wherein the wall (15) is a current conducting membrane made of prepared biological material.",
        "14. The device according to claim 12, wherein the nerve test chamber (33) comprises two stimulation electrodes (39, 40) and at least two diverting electrodes (41, 42) that are configured as sticks arranged in a common plane parallel to each other.",
        "15. (canceled)",
        "16. (canceled)"
    ]
}