{
    "id": "US20210121087",
    "authors": [
        "Thomas Heldt",
        "Syed Muhammad Imaduddin",
        "Andrea Fanelli"
    ],
    "title": "SYSTEM AND METHODS FOR MODEL-BASED NONINVASIVE ESTIMATION AND TRACKING OF INTRACRANIAL PRESSURE",
    "date": "2019-04-30 00:00:00",
    "abstract": "Techniques for estimating intracranial pressure using arterial blood pressure and cerebral blood flow velocity measurements. The techniques may include obtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time and estimating an initial intracranial pressure value for the patient. The techniques further include obtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time, estimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value, and outputting information indicating the updated intracranial pressure value.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "Aspects of the technology described herein relate to techniques for estimating intracranial pressure (ICP) using data obtained through noninvasive or minimally invasive measurements of a patient."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of technology"
                    ],
                    "num_characters": 195,
                    "outline_medium": [
                        "define field of technology"
                    ],
                    "outline_short": [
                        "define field of technology"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Intracranial pressure (ICP) is the hydrostatic pressure of cerebrospinal fluid (CSF), which is the fluid that surrounds and cushions the brain tissue of a human or animal. When the ICP becomes elevated in an individual, blood flow to the brain can become limited and lead to cerebral ischemic injury. Additionally, brain structures may become displaced (herniation) because of pressure differences within the cranial cavity and spinal canal, which may potentially lead to coma, cessation of breathing, and/or death. Elevation of ICP may occur in various neuropathological conditions, including hydrocephalus, traumatic brain injury, hemorrhagic stroke, and brain tumors. In managing these types of neuropathological conditions, it can be important to monitor the ICP of the individual to assess the cerebrovascular and cerebrospinal state of the individual and to determine if the ICP becomes elevated to a point that puts the individual at a high risk level.",
                        "Current clinical practices for monitoring ICP in a patient involve significantly invasive techniques which include penetrating the person's skull and inserting a catheter or pressure sensor to measure ICP directly in the cerebrospinal fluid space, such as the ventricles. Alternatively, pressure sensors can be placed into the brain tissue to measure brain tissue pressure as a surrogate for ICP. These techniques generally involve a physician with neurosurgical expertise to perform and have a risk of infection arising from entering a person's skull, which can limit these types of ICP measurements to individuals who are severely ill and are generally not performed across a broader group of patients where assessing their ICP may be beneficial. For example, monitoring ICP in a person who has chronic headaches may assist a physician in diagnosing or treating the person. However, it is unlikely that the person is in a medical state that would justify the medical resources involved in performing ICP measurements or the risk associated with obtaining such measurements.",
                        "Some less invasive techniques for estimating ICP involve using other physiological measurements that correlate with ICP or may otherwise act as a proxy for ICP. For example, one noninvasive method involves assessing the diameter of the optic nerve sheath. Another method involves applying external pressure on an individual's eyeball to balance retro-orbital pressure with ICP. In addition, there have been some computational techniques for estimating ICP that use physiological signals that can be obtained through noninvasive or less invasive means and apply these signals to a physiological model. However, these techniques have not been adapted in a clinical setting because they may lack the ability to obtain reliable estimates for ICP as well as the ability to perform continuous monitoring of an individual's ICP."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce intracranial pressure",
                        "describe risks of elevated ICP",
                        "discuss current invasive ICP measurement techniques",
                        "discuss limitations of current techniques",
                        "motivate need for noninvasive ICP estimation"
                    ],
                    "num_characters": 2859,
                    "outline_medium": [
                        "describe ICP and its importance",
                        "limitations of current ICP measurement techniques"
                    ],
                    "outline_short": [
                        "describe limitations of current ICP measurement techniques"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Some embodiments are directed to a system comprising: at least one hardware processor; and at least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by the at least one hardware processor, cause the at least one hardware processor to perform a method. The method comprises obtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time; estimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values; obtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time; estimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and outputting information indicating the updated intracranial pressure value.",
                        "Some embodiments are directed to at least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by at least one hardware processor, cause the at least one hardware processor to perform: obtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time; estimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values; obtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time; estimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and outputting information indicating the updated intracranial pressure value.",
                        "Some embodiments are directed to a method, comprising: obtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time; estimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values; obtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time; estimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and outputting information indicating the updated intracranial pressure value.",
                        "Some embodiments are directed to a system comprising: at least one hardware processor; and at least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by the at least one hardware processor, cause the at least one hardware processor to perform a method. The method comprises obtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time. The arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient. The method further comprises estimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values. Using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform. The method further comprises outputting information indicating the updated intracranial pressure value.",
                        "Some embodiments are directed to at least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by at least one hardware processor, cause the at least one hardware processor to perform a method. The method comprises obtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time. The arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient. The method further comprises estimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values. Using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform. The method further comprises outputting information indicating the updated intracranial pressure value.",
                        "Some embodiments are directed to a method, comprising: obtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time. The arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient. The method further comprises estimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values. Using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform. The method further comprises outputting information indicating the updated intracranial pressure value."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce system embodiment",
                        "describe data acquisition",
                        "estimate initial ICP value",
                        "obtain updated data",
                        "estimate updated ICP value",
                        "output updated ICP value",
                        "introduce software embodiment",
                        "describe data acquisition",
                        "estimate initial ICP value",
                        "obtain updated data",
                        "estimate updated ICP value",
                        "output updated ICP value"
                    ],
                    "num_characters": 6382,
                    "outline_medium": [
                        "introduce system for estimating ICP",
                        "describe method for estimating ICP",
                        "introduce non-transitory computer-readable storage medium",
                        "describe method for estimating ICP using statistical model",
                        "introduce system for estimating ICP using time offset value",
                        "describe method for estimating ICP using time offset value"
                    ],
                    "outline_short": [
                        "introduce system for estimating ICP",
                        "describe method for estimating ICP",
                        "summarize various embodiments"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Computational techniques that incorporate physiological signals, such as arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV), may be used in estimating intracranial pressure (ICP) for an individual. However, the inventors have recognized that conventional computational techniques for estimating ICP have limitations in the accuracy of the estimated ICP value and the ability to tailor the ICP estimates to a particular patient.",
                        "For example, some conventional techniques for estimating ICP involve mapping measurements of ABP and CBFV to measurements of ICP for a group of patients, the mapping then may be used in determining an ICP estimate for a different patient by applying the mapping to ABP and CBFV measurements of the patient. However, the inventors have recognized that to determine the mapping involves obtaining ICP measurements from patients by invasively penetrating the patient's skull and that generally these patients are being hospitalized in an environment, such as in the intensive care unit, where their own ICP is being monitored and controlled to obtain a stable ICP value. As a result, these ICP measurements used in developing the mapping do not necessarily accurately represent the range of ICP measurements in the overall population of people, or even in those patients with acute injury or exacerbation of underlying conditions, which can lead to inaccuracies in estimating ICPs for other individuals. In some instances, individuals that have ICP, ABP, and/or CBFV not represented in the patient data used in developing the mapping may have inaccurate estimates for ICP when their ABP and CBFV data is applied to the mapping because the mapping does not specifically account for their own particular physiology.",
                        "In addition, some conventional techniques for estimating ICP that rely on using ABP and CBFV in computing an ICP estimate do not account for any misalignment in the ABP and CBFV waveforms as this data is obtained in real-time from different devices. In particular, the ABP and CBFV waveforms acquired from different devices may not represent cardiovascular physiology in an accurate manner. For example, ABP measurements can be obtained at an extremity of a person, such as the person's finger or wrist, while CBFV measurements can be obtained at the person's head, such as by using transcranial Doppler ultrasonography. A time shift between ABP measurements obtained at a location of the person that differs from where the CBFV measurements are obtained may create a physiologically induced time delay between the ABP waveform arriving at the cerebral artery and the ABP waveform at the actual measurement location. Although the ABP and CBFV measurements are obtained at the same time, this physiological time delay is represented in these measurements and can lead to misalignment between the ABP and CBFV waveforms in a manner that represents inaccurate or impossible physiology. In particular, cardiac cycles have quasi-regular, repeated characteristics in ABP and CBFV waveforms which are representative of the underlying cardiovascular physiology. During a cardiac cycle, a systolic peak in the CBFV waveform generally leads the corresponding systolic peak in the ABP waveform and the diastolic points in the ABP and CBFV waveforms are aligned with each other. A misalignment that arises from obtaining ABP and CBFV measurements from different locations of a person's body may create a combination of ABP and CBFV waveforms that represents physiologically inaccurate or impossible cardiac cycles. For example, one type of misalignment may include a systolic peak in the CBFV waveform following the corresponding systolic peak in the ABP waveform during the same cardiac cycle. Another type of misalignment may include the diastolic points in the ABP and CBFV waveforms not in alignment. These misalignments can lead to inaccurate estimates for ICP if not accounted for when computing an ICP using the misaligned ABP and CBFV waveforms.",
                        "Accordingly, the inventors have developed new computational techniques for estimating ICP, which accounts for the lack of physiological data representative of a cross-section of the population as well as possible misalignments in the physiological data (e.g., ABP, CBFV) being used in estimating ICP. These new computational techniques involve using a statistical model, which incorporates elements representative of cerebrovascular and cerebrospinal physiology, to estimate intracranial pressure values based on ABP and CBFV data from a patient. Estimating an intracranial pressure value may involve using the statistical model to compute an initial ICP for a patient and changes in ICP relative to that initial ICP value, which when added to the initial ICP value may provide an estimate of ICP for the patient at a particular time. For example, an initial ICP value may be obtained for ABP and CBFV data associated with a first time period and then subsequent ABP and CBFV data obtained from the patient may be used to track changes relative to that initial ICP value for subsequent time periods. Those changes in ICP may be combined with the initial ICP value to estimate an ICP value at for a particular time period. In this manner, a patient's ICP may be monitoring in real-time and dynamically updated using noninvasive physiological measurements.",
                        "The computational techniques developed by the inventors involve computing the initial ICP value using ABP and CBFV data from a patient, and may include incorporating data obtained from other people, and computing the changes in ICP value using additional ABP and CBFV data from the patient with or without other data from another person. The inventors have recognized and appreciated that while data from someone other than the patient whose ICP is being monitored may be important in computing an initial ICP value, using such data may introduce biases in the ICP estimates and provide inaccurate ICP estimates. Estimating changes in ICP using the patient's own data may account and compensate for such biases as additional patient data is obtained over time because there is less of reliance on data from people other than the patient.",
                        "The inventors have further recognized and appreciated that inaccuracy in estimating ICP can arise from misalignment in ABP and CBFV waveforms. For example, obtaining ABP and CBFV measurements at different locations of a person at the same time may introduce a physiological time delay that, when not accounted for, can lead to inaccurate estimates in ICP. As another example, the devices used in obtaining the ABP and CBFV measurements may have internal time delays. Accordingly, some embodiments of the technology described herein relates to introducing time offsets as parameters of the statistical model to account for misalignment in ABP and CBFV waveforms. In particular, computing an estimate for ICP in a patient may involve determining one or more time offset values that align the ABP and CBFV waveforms in time to meet certain physiological constraints.",
                        "Some embodiments described herein address all of the above-described issues that the inventors have recognized with estimating ICP. However, not every embodiment described herein addresses every one of these issues, and some embodiments may not address any of them. As such, it should be appreciated that embodiments of the technology described herein are not limited to addressing all or any of the above-discussed issues with estimating ICP.",
                        "Some embodiments involve obtaining data identifying arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV) of a patient, estimating an initial intracranial pressure (ICP) value for the patient, estimating an updated ICP value for the patient by determining a change in ICP of the patient based on the data, and outputting information indicating the updated ICP value. The ABP and CBFV data may be obtained over multiple cardiac cycles, and estimating the initial ICP and changes in ICP may involve using data associated with one or more cardiac cycles.",
                        "Estimating the initial ICP value may involve using a statistical model to compute a posterior distribution of ICP values based on a set of ABP and CBFV data and a prior distribution of ICP values. In some embodiments, the prior distribution of ICP values correspond to data obtained from at least one person other than the patient. The statistical model relates arterial blood pressure and cerebral blood flow velocity to intracranial pressure. In some embodiments, the statistical model includes a parameter representing cerebrovascular resistance, a parameter representing cerebrovascular compliance, and a parameter representing intracranial pressure. Estimating an updated ICP value for the patient may involve determining a change in ICP of the patient based on a different set of ABP and CBFV data and the initial ICP value. These techniques may be applied to monitoring a patient's ICP in real-time such that the patient's ICP value is updated to reflect current ABP and CBFV data obtained from the patient over time. For example, the initial ICP value may be computed from a patient's ABP and CBFV data obtained during a first time period and individual updates in ICP may be computed from the patient's ABP and CBFV data obtained from subsequent time periods, where an update in ICP is computed for the individual subsequent time periods and subsequently combined with the initial ICP value to estimate an ICP value for a particular time period. Accordingly, some embodiments involve estimating a series of ICP values for the patient by determining changes in ICP of the patient based on patient data and combining changes in ICP with the initial ICP value. In some embodiments, estimating the series of ICP values involves dynamically updating an ICP value as patient data is obtained. The dynamic updating of the ICP value may be performed in an adaptive manner.",
                        "Some embodiments involve using Bayesian statistics in estimating ICP from patient data. In some embodiments, estimating an ICP value involves using the statistical model to compute a posterior distribution of ICP values based on a likelihood of ICP given the patient data and a prior distribution of ICP values. In some embodiments, the prior distribution of ICP values may be associated with data from other patients. Such a prior distribution may be used in determining the initial ICP value. In some embodiments, the prior distribution of ICP values may be generated from user input. For example, a uniform prior distribution having the same probability across all ICP values may be inputted by a user and used in determining a change in ICP.",
                        "Some embodiments may involve evaluating whether a time period in the patient data is of low quality, noisy, or otherwise may contribute to an inaccurate ICP estimate. For example, an ICP value may be estimated for a particular timeframe and time periods within that timeframe may each provide an estimated ICP value that may be combined to determine the estimated ICP value for the timeframe. In some embodiments, some of the time periods have data of low quality (e.g., where the patient moved suddenly and disrupted one or both of the ABP and CBFV measurements during the time period). The inventors have recognized and appreciated that it is important to remove or reduce these low quality time periods in estimating an ICP value for the entire timeframe. In some embodiments, estimating an ICP value for a timeframe may involve computing an ICP value using the patient data for a time period within the timeframe, determining a metric indicative of the level of noise in the patient data for the time period, and selecting to include the ICP value for the time period in estimating the ICP value for the timeframe based on comparing the metric to a threshold value. For example, if the metric is above a threshold value, then the ICP value for the time period is not included in estimating the ICP value for the timeframe.",
                        "Some embodiments involve determining changes in ICP using the statistical model and ABP and CBFV data to estimate values for parameters of the statistical model. The inventors have further recognized and appreciated that computational costs and overall efficiency in estimating ICP values may be reduced by using optimization techniques that allow for estimating values for parameters of the statistical model by evaluating different values for parameters independently. In some instances, monitoring ICP in a patient may involve computing ICP estimates during different time periods where the time periods have relevant time scales in the range of 5 seconds to 60 seconds. Estimating an ICP value for a particular time period may involve computing values for parameters of the statistical model to use in computing an ICP value or change in ICP during that time period. For different time periods, the values for the parameters of the statistical model may need to be updated to reflect the data associated with that time period. Accordingly, to allow for monitoring of a patient's ICP as data is obtained involves computing values for these parameters at least within the time scales where providing ICP estimates in real-time is desired. Determining an estimated ICP value for a certain time period may involve evaluating particular values for parameters using patient data during that time period. By providing particular values of parameters to evaluate, computational costs may be reduced, which may allow for ICP estimates to be obtained within a desired timeframe at the time scale of one or more cardiac cycles. In some embodiments, evaluating the parameter values for a particular time period may involve evaluating different combinations of possible parameter values for that time period using parallel computing techniques, which may improve computational efficiency and reduce computational time associated with providing an updated ICP value.",
                        "Some embodiments may involve predicting an ICP value using ABP and CBFV data from a patient. The predicted ICP value may be obtained by estimating a change in ICP for a future time using the patient data and the statistical model and combining the estimated change in ICP with one or more previously determined ICP values. In particular, values for parameters of the statistical model may be estimated using the patient data and those estimated parameter values may be used in estimating the change in ICP for the future time. These predictions in ICP may assist in monitoring ICP of a patient by assessing how the patient's ICP may change in the future, such as whether ICP is likely to remain at a stable value or become elevated. In some embodiments, estimating an updated ICP value may involve computing an data-derived ICP value for a time interval using the data obtained during that interval and a predicted change in ICP for the time interval using data from a prior time interval, determining an estimated change in ICP based on the predicted change in ICP and the data-derived ICP, and using this estimated change in ICP to estimate the updated ICP value.",
                        "In some embodiments, evaluating possible values for parameters of the statistical model may involve predicting a change in ICP for a time period using patient data from a prior time period. The predicted change in ICP may be compared to a data-derived change in ICP value estimated for the time period using data from that time period. If the predicted and data-derived changes in ICP estimates are similar, then the parameter values used in obtaining the predicted and data-derived changes in ICP estimates may be determined to have a high level of accuracy in estimating ICP. While, if the predicted and data-derived changes in ICP have significant variability, then the parameter values may be determined as having a low level of accuracy in estimating ICP.",
                        "In some embodiment, a time offset between ABP and CBFV waveforms is a parameter of the statistical model and evaluating parameter values may involve evaluating intracranial pressure values at different time offsets. The time offsets may be selected from a range of time offsets obtained by aligning the ABP and CBFV waveforms using physiological constraints. In some embodiments, a range of time offsets may be identified from aligning the ABP and CBFV waveforms and one or more time offset values may be selected from the range based on whether the ABP and CBFV waveforms meet a set of physiological constraints when a particular time offset is used in shifting the ABP and CBFV waveforms relative to one another. One type of physiological constraint that may be used in aligning the ABP and CBFV waveforms is having a systolic peak in CBFV occur prior to a systolic peak in ABP for the corresponding cardiac cycle. Another type of physiological constraint that may be used in aligning the ABP and CBFV waveforms is having a diastolic point in CBFV occur at substantially the same time as a diastolic point in ABP in the same cardiac cycle.",
                        "Some embodiments involve predicting physiological signals (e.g., ABP, CBFV) for a patient using the statistical model and patient data to evaluate multiple ICP values corresponding to different time offsets between ABP and CBFV waveforms. Prediction errors may be determined by comparing predicted values for the physiological signals to the patient data. The prediction errors may be used in computing a likelihood of ICP, which may be used in estimating an ICP. In some embodiments, computing the likelihood of ICP may involve determining a likelihood distribution of ICP for different time offsets from prediction errors associated with using the time offset in computing a physiological signal. In some embodiments, computing the likelihood of ICP involves combining the likelihood of ICP distribution for the different time offsets to determine the likelihood of ICP.",
                        "It should be appreciated that the various aspects and embodiments described herein be used individually, all together, or in any combination of two or more, as the technology described herein is not limited in this respect.",
                        "FIG. 1 is a diagram of an illustrative processing pipeline 100 for estimating intracranial pressure for a patient, which may include obtaining patient data and using a statistical model to compute estimated intracranial pressure values and changes in intracranial pressure values based on the patient data, in accordance with some embodiments of the technology described herein. As shown in FIG. 1, patient data 102 may be obtained and analyzed using pipeline 100. Patient data 102 may include arterial blood pressure (ABP) 104 and cerebral blood flow velocity (CBFV) 106. ABP data 104 for a patient can be obtained by measuring ABP at an extremity of a person, such as the person's finger or wrist. CBFV data for a patient can be obtained by using transcranial Doppler ultrasonography to measure CBFV at a person's head. Patient data 102 can be obtained over multiple cardiac cycles. A cardiac cycle, which is also referred to as a heartbeat, has both a diastole phase, which is when the heart relaxes and fills with blood, and a systole phase, which is when the heart contracts and pumps blood. FIG. 2 is an exemplary plot of ABP versus time illustrating a representative ABP waveform for multiple cardiac cycles. FIG. 3 is an exemplary plot of CBFV versus time illustrating a representative CBFV waveform for multiple cardiac cycles. Systolic peaks corresponding to the end of the systole phase and diastolic points corresponding to the end of the diastole phase are labeled in FIGS. 2 and 3.",
                        "Intracranial pressure (ICP) estimation technique 108 may be used to estimate ICP baseline value 110 using patient data 102. ICP estimation technique 108 may include using a statistical model and patient data 102 to compute ICP baseline value 110. Intracranial pressure (ICP) change tracking technique 110 may be used to estimate change in ICP value(s) 114 using patient data 102. ICP change tracking technique 110 may include using the statistical model and patient data 102 to compute changes in ICP value(s) 114. ICP baseline value 110 and change in ICP value(s) 114 may be used in determining estimated ICP value(s) 116, which are outputted by processing pipeline 100.",
                        "Some embodiments may involve using pipeline 100 for estimating a series of intracranial pressure values for a patient, which may allow for real-time monitoring of the patient's ICP. In some embodiments, estimating the series of ICP values involves dynamically updating an ICP value as patient data 102 is obtained. As shown in FIG. 1, ICP estimation technique 108 may estimate an initial ICP value, I0, as ICP baseline value 110 corresponding time period, ΔT0. In some embodiments, patient data 102 corresponding to multiple cardiac cycles may be used in estimating the ICP baseline value 110. For example, some implementations of ICP estimation technique 108 involves using a time period corresponding a number of cardiac cycles in the range of 10 to 100 cardiac cycles, or any value or range of values in that range. In some embodiments, the time period of patient data 102 used by ICP estimation technique 108 to estimate ICP baseline value 110 is approximately 20 cardiac cycles. ICP change tracking technique 112 may estimate changes in ICP value(s) 114 using patient data 102 for times periods that occur after the time period ΔT0 used in estimating ICP baseline value 110. As shown in FIG. 1 ICP change tracking technique 112 may estimate change in ICP values, ΔI1, ΔI2, ΔI3, . . . , corresponding to time periods ΔT1, ΔT2, ΔT3, . . . which occur after ΔT0. Estimated ICP value(s) 116 may be determined by combining ICP baseline value 110 and change in ICP value(s) 114. Some embodiments may involve serially combining, for each additional time period, the change in ICP value corresponding to the time period with the ICP baseline value 110 to arrive at an estimated ICP value for that time period. As shown in FIG. 1, estimated ICP value(s) 116 include I0, I0+ΔI1, I0+ΔI1+ΔI2, . . . for time periods ΔT0, ΔT1, ΔT2, . . . , respectively. Additional discussion for estimating a baseline ICP value and tracking changes in ICP is described herein including in Sections A.4.4 and A.4.5.",
                        "The statistical model, which may be used by both ICP estimation technique 108 and ICP change tracking technique 112, may relate arterial blood pressure and cerebral blood flow velocity to intracranial pressure using a physiological model. Parameters of the statistical model may represent different physiological characteristics. In some embodiments, the statistical model may include one or more parameters representing resistance, cerebrovascular compliance, inertance, and intracranial pressure where arterial blood pressure and cerebral blood flow velocity are inputs to the statistical model. FIG. 4 is a diagram of a statistical model, which may be used in estimating intracranial pressure according to some embodiments. The circuit diagram on the left is representative of a physiological model relating resistance (R), cerebrovascular compliance (C), and intracranial pressure (ICP) with arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV). The statistical model may adopt a discretized time approximation form of this physiological model for estimating ICP values. In some embodiments, the statistical model may be implemented using Bayesian statistics. Additional details relating to this physiological model shown on the left-hand side in FIG. 4 and how it can be used in calculating intracranial pressure may be found in U.S. Pat. No. 8,366,627, issued on Feb. 5, 2013, which is incorporated by reference in its entirety. Additional discussion on a statistical model used in estimating intracranial pressure is described herein including in Sections A.2.1, A.2.2, and A.4.2.",
                        "ICP estimation technique 108 and ICP change tracking technique 112 may involve using Bayesian statistical techniques to compute ICP baseline value 110 and change in ICP value(s) 114, respectively. In some embodiments, ICP estimation technique 108 may involve using a statistical model to compute a posterior distribution of ICP values based on patient data 102 and a prior distribution of ICP values corresponding to data obtained from one or more other people. In some embodiments, the prior distribution of ICP values may be obtained by directly measuring ICP in patients using invasive techniques. In some embodiments, ICP change tracking technique 112 may involve using a statistical model to compute a posterior distribution of ICP values based on patient data 102 and a prior distribution of ICP values, which may be a uniform distribution according to some embodiments.",
                        "Some embodiments of the statistical model used by ICP estimation technique 108 and ICP change tracking technique 112 may involve estimating time shifts between ABP and CBFV waveforms and using those estimated time shifts in optimizing parameters of the statistical model. FIG. 5 is a diagram of an illustrative processing pipeline 500 for optimizing parameters of a statistical model, which may be implemented as part of ICP estimation technique 108 and/or ICP change tracking technique 112, in accordance with some embodiments of the technology described herein.",
                        "Time shift estimation technique 502 may be used to estimate time offset range 506 using ABP waveform 104 and CBFV waveform 106. In some embodiments, a statistical model, which may be used by ICP estimation technique 108 and ICP change tracking technique 112, may involve aligning in time ABP waveform 104 and CBFV waveform 106 using time offset range 506 estimated by time shift estimation technique 502. Time offset range 506 may include at least one time offset value that may act to shift ABP waveform 104 and CBFV waveform 106 into an alignment meeting a set of physiological constraints. Time shift estimation technique 502 may involve determining one or more alignments in time between ABP waveform 104 and CBFV waveform 106 such that one or more constraints in the set of constraints is met for at least one cardiac cycle. According to some embodiments, time shift estimation technique 502 may involve selecting one or more time offset values from a set of possible time offset values based on the alignment of ABP waveform 104 and CBFV waveform 106 meeting the set of physiological constraints. In some embodiments, the set of constraints may include constraining the alignment of ABP waveform 104 and CBFV waveform 106 such that a systolic peak in CBFV occurs prior to a systolic peak in ABP. In some embodiments, the set of constraints may include constraining the alignment of ABP waveform 104 and CBFV waveform 106 such that a diastolic point in CBFV occurs at substantially the same time as a diastolic point in ABP. Additional discussion for time-aligning ABP and CBFV waveforms is described herein including in Section A.4.3.",
                        "FIG. 6 is an exemplary plot of illustrating an arterial blood pressure (ABP) waveform 604 (shown by the solid line), cerebral blood flow velocity (CBFV) waveform 602 (shown by the dotted line), and shifted CBFV waveforms 606 (shown by the grey band). Shifted CBFV waveforms 606 have been identified by shifting CBFV waveform 602 by a range of time shifts, which may be determined using time shift estimation technique 502. As shown in FIG. 6, some or all of the shifted CBFV waveforms 606 may meet one or more physiological constraints. For example, at least some of the shifted CBFV waveforms 606 have systolic peaks that occur prior to systolic peaks in ABP waveform 604. As another example, at least some of the shifted CBFV waveforms 606 have diastolic points that occur at substantially the same time as the diastolic peaks in ABP waveform 604.",
                        "Optimization routine 504 may be used to determine parameter value(s) 508 of a statistical model used by ICP estimation technique 108 and ICP change tracking technique 112. In particular, optimization routine 504 may determine parameter value(s) 508 by using patient data 102 and time offset range 505. In some embodiments, optimization routine 504 may involve evaluating multiple ICP values at different time offsets in time offset range 506. Optimization routine 504 may involve evaluating different pairs of an ICP value and a time offset using the ABP waveform 104 and CBFV waveform 106. In some embodiments, evaluating different pairs of an ICP value and a time offset value may involve performing parallel computational processing of the different pairs. Such parallel processing may allow for improved computational efficiency in estimating intracranial pressure, particularly during real-time monitoring of intracranial pressure. Optimization routine 504 may be performed by implementing any suitable statistical techniques, including a regularized least squared error estimation, a constrained error estimation, and/or an unconstrained error estimation. Additional discussion for performing an optimization routine to determine model parameters is described herein including in Section A.4.3.",
                        "Prediction change model 510 may be used to predict physiological signal(s) (e.g., ABP, CBFV) using patient data 102 and the statistical model implemented by ICP estimation technique 108 and ICP change tracking technique 112. As shown in FIG. 5, prediction change model 510 may predict prediction error(s) 512 for the predicted physiological signal(s) using parameter value(s) 508 determined by optimization routine 504. In some embodiments, prediction error(s) 512 may be generated by comparing the predicted physiological signal(s) to patient data 102.",
                        "Some embodiments involve using one physiological signal to predict a different physiological signal. In some embodiments, optimization routine 504 may involve using ABP waveform 104 to evaluate different pairs of an ICP value and a time offset value to determine parameter value(s) 508. In such embodiments, prediction change model 510 may be used to predict a CBFV waveform for a future time period and generate prediction error(s) 512 based on comparing the predicted CBFV waveform for the future time period and a portion of CBFV waveform 106 corresponding to that time period. In other embodiments, optimization routine 504 may involve using CBFV waveform 106 to evaluate different pairs of ICP values and time offset values to determine parameter value(s) 508. In such embodiments, prediction change model 510 may be used to predict an ABP waveform for a future time period and generate prediction error(s) 512 based on comparing the predicted ABP waveform for the future time period and a portion of ABP waveform 104 corresponding to that time period.",
                        "FIG. 7 is diagram of an optimization routine used in estimating intracranial pressure, which may be used in accordance with some embodiments of the technology described herein. As shown in FIG. 7, ABP waveform is used by optimization routine to evaluate different pairs of ICP values (−10 mmHg, +30 mmHg, and +85 mmHg) and different time offsets (d). The parameter value(s) determined by this optimization process may be used in predicting CBFV waveforms for each of the different ICP values. FIG. 7 shows a predicted CBFV waveforms for each of the different ICP values and the observed CBFV waveforms obtained from patient data for the corresponding time period. Prediction errors can be determined by comparing the predicted CBFV waveform for each of the different ICP values with its corresponding observed CBFV waveform. As an example, the predicted CBFV waveform 704 for ICP value at +85 mmHg in comparison to the observed CBFV waveform 702 which is obtained from the patient data. Since predicted CBFV waveform 704 differs from the observed CBFV waveform 702, then prediction errors generated from comparing predicted CBFV waveform 704 with observed CBFV waveform 702 may indicate there being a low level of accuracy in using the parameter values obtain from performing the optimization routine with an ICP value of +85 mmHg. For the other ICP values shown in FIG. 7, −10 mmHg and +30 mmHG, the predicted CBFV waveform is more similar to the observed CBFV waveform than for predicted CBFV waveform 704, which may indicate a high level of accuracy in using the parameter values obtained from performing the optimization routine using these ICP values.",
                        "Estimating an ICP value may involve using a Bayesian statistical framework. Accordingly, some embodiments may involve using a statistical model to compute a posterior distribution of ICP values based on a likelihood of ICP given patient data and a prior distribution of ICP values. Some embodiments include using prediction error(s) 512 obtained from using prediction change model 510 in determining the likelihood of ICP. In some embodiments, computing the likelihood of ICP may involve determining a likelihood of ICP for the different time offsets and ICP values used in the processing performed by optimization routine 504 where the likelihood of ICP is computed using prediction error(s) 512 generated by prediction change model 510. In some embodiments, different likelihood of ICP distributions may be obtained for different time offsets and a single likelihood of ICP distribution may be determined by combining the different likelihood of ICP distributions. In this manner, the likelihood of ICP that may be generated using prediction error(s) 512 may collapse onto one-dimension (e.g., ICP). Combining the different likelihood of ICP distributions may involve using any suitable statistical methods, including averaging across all distributions (e.g., marginalization methods) and selecting the highest likelihood ICP value (e.g., likelihood maximization methods).",
                        "FIG. 8 is a diagram of an illustrative data processing pipeline for estimating intracranial pressure using prediction errors. As shown in FIG. 8, prediction error(s) 512, which may be obtained from optimization routine 504, may be used in determining likelihood distribution of ICP 802. Prediction error(s) 410 (0 may be found for each combination of time offset (d) and ICP value (I) used by optimization routine 504. FIG. 9 is an exemplary plot illustrating prediction errors versus time offsets and intracranial pressure. FIG. 10 is plot illustrating a likelihood distribution across both time offsets (d) and ICP values (I) corresponding to the prediction error(s) shown in FIG. 9. Likelihood distribution of ICP 802 may be obtained based on prediction error(s) by collapsing the likelihood distributions along the ICP dimension.",
                        "In some embodiments, a likelihood distribution of ICP may be obtained by relating the prediction errors to the likelihood using an exponential relationship, such as in the following equation:",
                        "\\({\\mathcal{L}\\left( {I,\\ d} \\right)} = {{\\frac{1}{S} \\times \\exp\\left\\{ {- \\left( \\frac{\\zeta^{I,d}}{m} \\right)^{p}} \\right\\}\\mspace{14mu}{where}\\mspace{14mu} m} = {\\min\\limits_{I,d}\\zeta^{I,d}}}\\)",
                        "where ζI,d is the prediction errors, and S is chosen so that (I, d) sums to unity. FIG. 11 is an exemplary plot of likelihood of intracranial pressure versus intracranial pressure where an exponential relationship between likelihood distribution of ICP and prediction errors is implemented.",
                        "In some embodiments, a likelihood distribution of ICP may be obtained by relating the prediction errors to the likelihood using an inverse relationship, such as in the following equation:",
                        "\\({\\mathcal{L}\\left( {I,\\ d} \\right)} = {\\frac{1}{S} \\times \\frac{1}{\\zeta^{I,d}}}\\)",
                        "FIG. 12 is another exemplary plot of likelihood of intracranial pressure versus intracranial pressure where an inverse relationship between likelihood distribution of ICP and prediction errors is implemented.",
                        "As shown in FIG. 8, prior distribution 804 and likelihood distribution 802 may be combined to obtain posterior distribution 806. FIGS. 13 and 14 are exemplary plots of prior distribution of intracranial pressure versus intracranial pressure. In some embodiments, a prior distribution may be obtained by fitting one or more Gaussian models to a set of ICP data, such as data obtained from patients using invasive techniques. Such a prior distribution may be used in estimating an initial ICP value, such as by ICP estimation technique 108. In some embodiments, a prior distribution may be a uniform distribution, which may not be dependent on any patient data. Such a prior distribution may be used in tracking change in ICP, such as by ICP change tracking technique 112.",
                        "Posterior distribution 806 may be obtained by combining likelihood distribution 802 and prior distribution 804, such as by performing a pointwise multiplication of probabilities. FIG. 15 is an exemplary plot of a posterior distribution of intracranial pressure versus intracranial pressure. Estimated ICP value(s) 808 may be determined from posterior distribution 806. Posterior distribution 806 may be used in providing an estimate for an ICP value using any suitable statistical technique, including obtaining the mean, mode, or median of the posterior distribution. Additional discussion for estimating ICP values by using a likelihood distribution and prior distribution to obtain a posterior distribution is described herein including in Section A.4.3.",
                        "FIG. 16 is a flow chart of an illustrative process 1600 for estimating intracranial pressure, in accordance with some embodiments of the technology described herein. Process 1600 may be performed on any suitable computing device(s) (e.g., a single computing device, multiple computing devices co-located in a single physical location or located in multiple physical locations remote from one another, one or more computing devices part of a cloud computing system, etc.), as aspects of the technology described herein are not limited in this respect. In some embodiments, ICP pressure estimation technique 108 and ICP change tracking technique 112 may perform some or all of process 1600 to estimate ICP for a patient.",
                        "Process 1600 begins at act 1610, where data identifying arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV) from a patient during an initial time period is obtained. The ABP and CBFV data are obtained at different locations of the patient. Obtaining the data include obtaining ABP and CBFV of the patient over multiple of cardiac cycles to obtain ABP and CBFV waveforms.",
                        "Next, process 1600 proceeds to act 1620, where an initial ICP value is estimated, such as by using ICP estimation technique 108. In some embodiments, estimating an initial ICP value involves using a statistical model to compute a posterior distribution of ICP values based on the data and a prior distribution of intracranial pressure values, which in some embodiments may correspond to data obtained from at least one person other than the patient. In some embodiments, estimating the initial ICP value may involve using the statistical model to compute the posterior distribution of ICP values based on a likelihood of ICP given the data and the prior distribution. The statistical model may relate ABP and CBFV to ICP, and in some embodiments may include one or more parameters representing physiological characteristics (e.g., cerebrovascular resistance, cerebrovascular compliance, and cerebrovascular inertance). In some embodiments, the statistical model includes a parameter representing cerebrovascular resistance, a parameter representing cerebrovascular compliance, and a parameter representing intracranial pressure.",
                        "Next process 1600 proceeds to act 1630, data identifying arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV) from a patient during a subsequent time period is obtained. The ABP and CBFV data are obtained at different locations of the patient. Obtaining the data include obtaining ABP and CBFV of the patient over multiple of cardiac cycles to obtain ABP and CBFV waveforms.",
                        "Next process 1600 proceeds to act 1640, where an updated ICP value is estimated, such as by using ICP change tracking technique 112 to estimate at least one change in ICP value to combine with the initial ICP value estimated in step 1620. Estimating the updated ICP value may involve determining a change in ICP of the patient based on the data and the initial ICP value. In some embodiments, determining the change in ICP is performed at least in part by using the statistical model and the data to estimate one or more values for parameter(s) of the statistical model. Next process 1600 proceeds to act 1650, where an indication of the updated ICP value is output, such as to a user via a user interface.",
                        "Some embodiments involve estimating a series of ICP values for a patient by repeating act 1630 and act 1640 as additional patient data is obtained, which may allow for real-time monitoring of ICP in the patient. Estimating the series of ICP values for the patient involve determining changes in ICP of the patient based on the additional data and combining the changes in ICP with the initial intracranial pressure value. In some embodiments, estimating the series of ICP values may include dynamically updating an ICP value during subsequent time periods. The dynamic updating of the ICP value may be performed in an adaptive manner.",
                        "FIG. 17 is a flow chart of an illustrative process 1700 for estimating intracranial pressure, in accordance with some embodiments of the technology described herein. Process 1700 may be performed on any suitable computing device(s) (e.g., a single computing device, multiple computing devices co-located in a single physical location or located in multiple physical locations remote from one another, one or more computing devices part of a cloud computing system, etc.), as aspects of the technology described herein are not limited in this respect. In some embodiments, ICP pressure estimation technique 108, ICP change tracking technique 112, and time shift estimation technique 502 may perform some or all of process 1700 to predict chemical reaction(s) and output molecule(s).",
                        "Process 1700 begins at act 1710, where data identifying arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV) waveforms from a patient is obtained. The ABP and CBFV data are obtained at different locations of the patient. Obtaining the data include obtaining ABP and CBFV of the patient over multiple of cardiac cycles to obtain ABP and CBFV waveforms.",
                        "Next, process 1700 proceeds to act 1720, where time offset value(s) between ABP and CBFV waveforms are determined, such as by using time shift estimation technique 502. In some embodiments, determining the time offset value(s) involve aligning in time the ABP and CBFV waveforms. Aligning the ABP and CBFV waveforms may include constraining the alignment, for at least one cardiac cycle, such that a systolic peak in cerebral blood flow velocity occurs prior to a systolic peak in arterial blood pressure. Aligning the ABP and CBFV waveforms may include constraining the alignment, for at least one cardiac cycle, such that a diastolic point in cerebral blood flow velocity occurs at substantially the same time as a diastolic point in arterial blood pressure. Some embodiments involve selecting the time offset value(s) from multiple time offset values based on the alignment of the arterial blood pressure waveform and the cerebral blood flow velocity waveform meeting a set of physiological constraints (e.g., a systolic peak in cerebral blood flow velocity occurs prior to a systolic peak in arterial blood pressure, a diastolic point in cerebral blood flow velocity occurs at substantially the same time as a diastolic point in arterial blood pressure).",
                        "Next, process 1700 proceeds to act 1730, where an ICP value for the patient is estimated using the time offset value(s), such as by using ICP pressure estimation technique 108 and/or ICP change tracking technique 112. Estimating the ICP value may involve using a statistical model to compute a posterior distribution of ICP values based on a likelihood of intracranial pressure given the data and a prior distribution of ICP values. In some embodiments, the prior distribution of ICP values may correspond to data obtained from at least one person other than the patient. Next process 1700 proceeds to act 1740, where an indication of the estimated ICP value is output, such as to a user via a user interface.",
                        "Some embodiments involve estimating a series of ICP values for a patient by repeating acts 1710, 1720, and 1730 as additional patient data is obtained, which may allow for real-time monitoring of ICP in the patient. Estimating the series of ICP values for the patient involve determining changes in ICP of the patient based on the additional data and combining the changes in ICP with the initial intracranial pressure value. In some embodiments, estimating the series of ICP values may include dynamically updating an ICP value during subsequent time periods.",
                        "FIG. 18 is a flow chart of an illustrative process 1800 for evaluating noise in patient data, in accordance with some embodiments of the technology described herein. Process 1800 may be performed on any suitable computing device(s) (e.g., a single computing device, multiple computing devices co-located in a single physical location or located in multiple physical locations remote from one another, one or more computing devices part of a cloud computing system, etc.), as aspects of the technology described herein are not limited in this respect. In some embodiments, ICP estimation technique 108 and/or ICP change tracking technique 112 may perform some or all of process 1800 to evaluate noise in patient data as part of determining which patient data to include in estimating an ICP value.",
                        "Process 1800 begins at act 1810, where data identifying arterial blood pressure (ABP) and cerebral blood flow velocity (CBFV) data from a patient is obtained over a time period. Next, process 1800 proceeds to act 1820, where a noise metric for the data, where the metric indicates a level of noise in the data during the time period. In some embodiments, the noise metric may be determined by comparing the ABP and CBFV data to determine a level of similarity between the ABP and CBFV waveforms. Some embodiments involve computing a cross-correlation of the ABP and CBFV waveforms where an output of the cross-correlation indicates a level of similarity between the ABP and CBFV waveforms. ABP and CBFV waveforms that have substantially similar profiles will have a noise metric indicating a low level of noise in the ABP and CBFV waveforms. ABP and CBFV waveforms that have dissimilar profiles will have a noise metric indicating a high level of noise in the ABP and CBFV waveforms.",
                        "Next, process 1800 proceeds to act 1830, where the noise metric is compared to a threshold, and to act 1840, where the data is selected to include in estimating ICP based on the comparison of the noise metric to the threshold. In some embodiments, if the noise metric is less than the threshold, then the data associated with the time period is indicated as having a low noise level and is included in estimating ICP. In some embodiments, if the noise metric is more than the threshold, then the data is indicated as having a high noise level and is not included in estimating ICP. Process 1800 may be repeated for individual time periods, such as in response to receiving additional patient data. In some embodiments, process 1800 is performed on different time periods for patient data used by ICP estimation technique 108 and/or ICP change tracking technique 112.",
                        "An illustrative implementation of a computer system 1900 that may be used in connection with any of the embodiments of the technology described herein is shown in FIG. 19. The computer system 1900 includes one or more processors 1910 and one or more articles of manufacture that comprise non-transitory computer-readable storage media (e.g., memory 1920 and one or more non-volatile storage media 1930). The processor 1910 may control writing data to and reading data from the memory 1920 and the non-volatile storage device 1930 in any suitable manner, as the aspects of the technology described herein are not limited in this respect. To perform any of the functionality described herein, the processor 1910 may execute one or more processor-executable instructions stored in one or more non-transitory computer-readable storage media (e.g., the memory 1920), which may serve as non-transitory computer-readable storage media storing processor-executable instructions for execution by the processor 1910.",
                        "Computing device 1900 may also include a network input/output (I/O) interface 1940 via which the computing device may communicate with other computing devices (e.g., over a network), and may also include one or more user I/O interfaces 1950, via which the computing device may provide output to and receive input from a user. The user I/O interfaces may include devices such as a keyboard, a mouse, a microphone, a display device (e.g., a monitor or touch screen), speakers, a camera, and/or various other types of I/O devices.",
                        "The above-described embodiments can be implemented in any of numerous ways. For example, the embodiments may be implemented using hardware, software or a combination thereof. When implemented in software, the software code can be executed on any suitable processor (e.g., a microprocessor) or collection of processors, whether provided in a single computing device or distributed among multiple computing devices. It should be appreciated that any component or collection of components that perform the functions described above can be generically considered as one or more controllers that control the above-discussed functions. The one or more controllers can be implemented in numerous ways, such as with dedicated hardware, or with general purpose hardware (e.g., one or more processors) that is programmed using microcode or software to perform the functions recited above.",
                        "In this respect, it should be appreciated that one implementation of the embodiments described herein comprises at least one computer-readable storage medium (e.g., RAM, ROM, EEPROM, flash memory or other memory technology, CD-ROM, digital versatile disks (DVD) or other optical disk storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, or other tangible, non-transitory computer-readable storage medium) encoded with a computer program (i.e., a plurality of executable instructions) that, when executed on one or more processors, performs the above-discussed functions of one or more embodiments. The computer-readable medium may be transportable such that the program stored thereon can be loaded onto any computing device to implement aspects of the techniques discussed herein. In addition, it should be appreciated that the reference to a computer program which, when executed, performs any of the above-discussed functions, is not limited to an application program running on a host computer. Rather, the terms computer program and software are used herein in a generic sense to reference any type of computer code (e.g., application software, firmware, microcode, or any other form of computer instruction) that can be employed to program one or more processors to implement aspects of the techniques discussed herein.",
                        "Some aspects of the technology described herein may be understood further based on the non-limiting illustrative embodiments described below in Section A. Any limitations of the embodiments described below in Section A are limitations only of the embodiments described in Section A, and are not limitations of any other embodiments described herein.",
                        "Section A",
                        "A noninvasive intracranial pressure (ICP) estimation method is proposed that incorporates model-based estimation within a probabilistic framework. A first-order subject-specific model of the cerebral vasculature relates arterial blood pressure with cerebral blood flow velocity. The model is solved for a range of physiologically plausible mean ICP values, and the resulting residual errors are transformed into likelihoods for each candidate ICP. First, a baseline ICP estimate is established by combining the likelihoods with a multi-modal prior distribution of the ICP to yield an a posteriori distribution whose mode is taken as the baseline ICP estimate. A single-state model of cerebral autoregulatory dynamics is then employed in subsequent data windows to track changes in the baseline by combining ICP estimates obtained with a uniform prior belief and model-predicted ICPs. The method yielded an ICP estimation bias (mean error or accuracy) of 0.6 mmHg and a root-mean-squared error (or precision) of 4.2 mmHg on data from thirteen patients at Boston Children's Hospital. These performance characteristics are well within the acceptable range for clinical decision making. The method proposed here therefore constitutes a significant step towards robust, continuous, patient-specific noninvasive ICP determination.",
                        "1. Introduction",
                        "Intracranial pressure (ICP) is the hydrostatic pressure of cerebrospinal fluid (CSF), the fluid that surrounds and cushions human brain tissue. Elevated ICP hampers brain tissue perfusion, and can lead to severe cerebral ischemic injury. Such elevations can occur in neuropathological conditions that include hydrocephalus, traumatic brain injury (TBI), hemorrhagic stroke, and brain tumors. Severe TBI, for example, is estimated to cause 52,000 deaths annually in the United States. TBI management requires accurate ICP measurement, as does hydrocephalus care, which is estimated to incur over US$1 billion annually in the U.S.",
                        "The normal mean ICP range in healthy adults in the supine posture is reported to range from 6 to 18 mmHg. In children, normal mean ICP to may range from 8 to 21 mmHg. ICP elevations beyond this normal range are lowered aggressively in current clinical practice. The latest guidelines for TBI care, for instance, recommend maintaining mean ICP of less than 22 mmHg.",
                        "Clinical ICP measurement modalities are invasive, require neurosurgical expertise, and carry an associated risk of infection. ICP measurement is therefore used only for severely ill patients, despite the fact that a larger pool of subjects may otherwise benefit from direct ICP measurement. This potential need has prompted the development of noninvasive ICP (nICP) estimation schemes. Examples of nICP estimation methods include applying external pressure on the eyeball to balance retro-orbital pressure with ICP, measuring cerebral blood flow velocity (CBFV) indices, and exploiting transcranial acoustic signal properties. Tympanic membrane displacement, and optic nerve sheath distension have also been shown to correlate with ICP. Physiologic model-based methods have been proposed, along with statistical learning frameworks. Despite these efforts, reliable and continuous nICP estimation has remained elusive and has not been adopted in clinical practice.",
                        "In this paper, we present a robust physiologic nICP estimation and tracking scheme. We model cerebral hemodynamics with a first-order, time-varying, finite impulse response (FIR) filter that relates cerebral arterial blood pressure (cABP), ICP, and CBFV. This model incorporates a first-order autoregressive (AR) process description of ICP dynamics. We use CBFV measured via transcranial Doppler (TCD) ultrasonography and radial arterial blood pressure (rABP). An associated Bayesian estimation framework is proposed to compute nICP estimates that are robust against both morphological differences between rABP and cABP, and physiologically-induced time offsets between rABP and CBFV. In this Bayesian framework, we solve our model for a physiologically plausible range of candidate ICPs and time offsets to form an ICP likelihood distribution. We combine this distribution with a preset multi-modal prior belief about the patient's ICP, and select the resulting posterior distribution's mode as the baseline ICP. Subsequent changes in the ICP are computed with a uniform prior belief to reduce dependence on the initial prior distribution. The estimated ICP changes are filtered via predictions obtained from the AR model of ICP dynamics for increased robustness.",
                        "2. Results",
                        "2.1 Model of Cerebral Hemodynamics",
                        "Sophisticated multi-parameter models that describe complex cerebrovascular behaviors are not suited for nICP estimation because their parameters are difficult to identify in a simple, noninvasive, robust, and patient-specific manner. Our group has previously proposed a Windkessel-like model that relates cerebral perfusion pressure (CPP), the difference between cABP and ICP, with cerebral blood flow, and hence CBFV. This model represents cerebrovascular blood flow resistance and vascular and brain tissue compliance with a variable resistor, R, and capacitor, C, respectively. The model, however, does not describe temporal evolution of the ICP; it is used to estimate mean ICP for each window of ABP and CBFV data segments.",
                        "Here, we have used a time-varying, first-order FIR filter approximation of our previous model with the addition of an AR process description of ICP dynamics. A first-order approximation was chosen because cABP and CBFV are quasi-periodic signals, and their spectral content is concentrated around a few frequency harmonics, limiting the order of models whose parameters can be reliably estimated using only the cABP and CBFV. As shown in the Methods section, the FIR filter coefficients are functions of R and C, and are assumed to remain constant during estimation windows comprising twenty cardiac cycles. This is because modulations in R and C are assumed to occur over longer timescales. Likewise, ICP is also considered to be a constant during an estimation window. The resulting model is shown in FIG. 20, and can be mathematically described as",
                        "q[n]=αm(pa[n]−I[m])+βm(pa[n−1]−I[m])  (1)",
                        "where q and pa denote the CBFV and cABP, respectively, and sampling and estimation window indices are denoted by n and m, respectively. The filter taps, αm and βm, and the mean ICP, I[m], are assumed to remain constant during individual estimation windows. Temporal evolution of the ICP is modeled by a first-order AR model which of the form",
                        "ΔI[m+1]=γmΔI[m]+vm  (2)",
                        "where ΔI[m]=I[m]−I [m−1], is the inter-estimation-window ICP change, γm is a parameter that represents the autoregulatory state, and vm is a white-noise sequence with variance σm2. For model stability |γm|<1 is chosen. A value of |γm| close to +1 models the tendency of ICP to rise or fall rapidly, whereas a negative γm models static ICPs that only vary slightly about their baseline. This AR model can be used to predict future changes in ICP, which can then be used to refine subsequent nICP estimates.",
                        "2.2 Model-Based Estimation Algorithm",
                        "CBFV and cABP recordings can be used to estimate the ICP using our model. In practice, however, cABP recordings are not available in clinical settings, and thus we use rABP instead. The human blood pressure profile changes along the arterial tree due to reflections from arterial branching sites and vessel taper. There is also a physiologically induced time delay between rABP and cABP due to finite wave propagation velocities. These together can introduce errors in the estimated nICPs. Hence, we developed a probabilistic estimation framework to reduce sensitivity of our nICP estimates on these factors.",
                        "In our method, we first establish a baseline ICP and subsequently track changes in this baseline. The baseline is determined by fitting the model to measured rABP and CBFV for a range of physiologically plausible ICP values and time offsets between rABP and CBFV. The fitting is achieved a least-squared-error sense. The residual errors are then transformed into a likelihood distribution of ICP values. This likelihood is combined with a preset prior distribution. The mode of the resulting a posteriori distribution is taken as the nICP estimate. This procedure is repeated for several windows, and the nICP estimates are averaged together to yield the baseline. The prior distribution employed in this stage generously models ICP values encountered at the bedside—extremely high and low values are given significant weight—in order to ensure our method's generalizability. The distribution is shown in FIG. 21, and its construction process is outlined in detail in the Methods section.",
                        "After this initial baseline estimation stage, ICP estimates are computed with a uniform distribution to reduce dependence on the initial prior belief. A downside of using a uniform distribution, however, is that the resulting nICP estimates are more error-prone than before. In our method, we addressed this problem by filtering changes in estimated nICPs by model-predicted ICP changes via a Kalman filter-like approach, and subsequently adding the filtered ICP changes back to the baseline.",
                        "2.3 Data Description and Method Validation",
                        "We used data that were collected at Boston Children's Hospital (BCH) between February 2015 and June 2017. The data collection protocols were approved by the relevant Institutional Review Boards at BCH and MIT, and informed consent was obtained from patients or their surrogates prior to data collection. Individual recording sessions lasted for nearly twenty minutes during which the rABP, CBFV, and (invasive) ICP waveforms were recorded simultaneously. Important metadata including height differences between the location of ICP and rABP transducers were also recorded. Data were collected from thirteen patients suffering from diverse pathologies that included TBI, hydrocephalus, and hemorrhagic strokes of various types. We tested our method's performance on noise-free data segments (Table 1) extracted from the ensemble data. As illustrated in FIG. 22, the extracted rABP and CBFV signals were passed through a signal conditioning stage. The conditioned data were then passed to the estimation routine that computed nICP estimates in non-overlapping twenty-cardiac-beat windows. The nICP estimates were then compared with the reference ICP measurements.",
                        "2.4 ICP Estimation Results",
                        "Nearly seven hours of data (1657 estimation windows from 118 data records) were analyzed, and estimates were computed in a fully automated manner for reproducibility. The following results were computed by setting γm=0.8, with σm2=49 mmHg2 in Equation 2 to model rapidly changing ICPs. These parameters help ensure our method's generalizability to diverse datasets, and were determined during a pilot exploration on data subsets from three patients.",
                        "Examples of the estimation results are shown in FIGS. 23A, 23B, and 23C. The first recording is from a stroke patient (Patient 1). The nICP estimation bias in this case was 0.0 mmHg with an RMSE of 1.1 mmHg. The second recording is from another stroke patient (Patient 3). The estimation bias in this case was −1.4 mmHg with an RMSE of 4.7 mmHg. In this case, CSF was being actively drained, and the ICP pulsatility was small. The third recording is from a patient suffering from cerebrohepatopathy (Patient 11). The estimation bias in this case was 0.5 mmHg with an RMSE of 2.0 mmHg. These recordings indicate that our method generated nICP estimates that were within clinically acceptable accuracy compared to standard invasive methods, and that it can function in both closed-, and open-drain scenarios, in patients with different pathologies.",
                        "We performed a Bland-Altman analysis to quantify the overall performance of our method. The analysis was performed on a per-estimation-window and per-recording basis (FIGS. 24A and 24B). These analyses indicate that our method achieved an error of 0.6 mmHg and RMSE of 4.2 mmHg in the ensemble data with limits of agreement (bias ±1.96 standard deviation (SD)) of −7.5 and 8.7 mmHg, respectively. Likewise, the comparison on a per-recording basis revealed an estimation bias and RMSE of 0.5 and 3.5 mmHg, respectively, with limits of agreement at −6.4 and 7.3 mmHg. Finally, the per-patient estimation performance is summarized in FIG. 25. These results together indicate that our estimates are well within clinically desired tolerances.",
                        "To further gauge our method's accuracy, we computed the fraction of nICP estimates below a certain RMSE on a per-patient, per-record, and per-estimation-window basis. This analysis is illustrated in FIG. 26 and indicates that nearly 80% of all our nICP estimates were within ±5 mmHg of the invasive reference ICP measurements, indicating a strong agreement between invasive reference and noninvasive estimates.",
                        "3. Discussion",
                        "It is important to analyze the accuracy of invasive ICP measurement modalities in order to put our performance metrics of an estimation bias of 0.6 mmHg and RMSE of 4.2 mmHg in perspective. Invasive ICP monitoring modalities include clinical gold-standard external ventricular drainage (EVD) systems, and integrated (micro-transducer) sensing devices such as the Camino or Codman sensors. Performance analyses of such micro-transducers have been reported in the literature. For example, a cohort of fifteen patients, the Codman sensor had an ensemble bias of 0.3 mmHg with limits of agreement of −6.7 and 7.1 mmHg, relative to EVD measurements. That our system approaches these performance characteristics is therefore a positive indicator.",
                        "Radial arterial blood pressure measurement was the only (minimally) invasive aspect of our approach and was used simply because these measurements are readily available at the bedside. The risk of infection from arterial catheters is reported to be far less than that associated with EVDs infection rates of 5% and 10% have been previously reported in EVDs. For instances, some report infection rates of 1.5% in femoral arterial lines with 1.94 times greater risk of infection at femoral sites compared to radial sites. Also, noninvasive arterial blood pressure monitors can pave the path towards fully noninvasive ICP estimation.",
                        "Previous work first proposed the continuous-time ICP model, and also developed an associated nICP estimation routine. They reported an ensemble bias of 1.6 mmHg with an SDE of 7.6 mmHg in data from TBI patients with significant reference ICP variability. They also averaged the nICP estimates obtained from CBFV signals recorded simultaneously from left and right middle cerebral arteries, and reported that this averaging resulted in a reduced SDE of 5.9 mmHg. They were, however, unable to account for the hydrostatic pressure offset between rABP and ICP measurements as they did not have access to the height differences between the ICP and rABP pressure transducers. Also, their data were recorded solely from adult TBI patients, and thus, they did not gauge their method's performance on a wider range of pathologies.",
                        "There are several challenges in adopting model-based nICP estimation approaches in clinical practice. The rABP, for example, might not always be a faithful surrogate for the cABP owing to changes in the arterial blood pressure profile, and this may affect the nICP estimation accuracy. Likewise, the CBFV waveform cannot often be recorded from the same cerebral blood vessel, and morphological differences between CBFV signals recorded from different vessels may alter the resulting nICP estimates. Physiologically induced time delays between the rABP and CBFV signals also contribute to estimation errors. Some have investigated the time offset problem while retaining the same underlying model. In their approach, they first bandpass filter the rABP and CBFV levels to suppress their respective mean levels, before estimating nICP estimates for a range of time offsets. They analyze the resulting R and C estimates to select the final nICP estimate. On a three-patient database, the authors reported an estimation bias and SDE of −1.1 and 5.6 mmHg, respectively.",
                        "Our method differs from both these prior methods in several aspects. We accounted for height differences between the pressure transducers, while not employing any mean suppression of rABP and CBFV signals in our approach. Our method includes a strategy to encounter unknown physiologically-induced time offsets between rABP and CBFV signals. Additionally, we have introduced a simple AR model of ICP dynamics that helps in tracking ICPs over long recording durations without overly relying on the prior distribution employed in the initial stage of the method. Our method generates a probability distribution of ICP values, that can be used to determine estimation-confidence metrics, a feature not provided by the other methods. We tested our method on patients with diverse pathologies. Unlike prior methods, we did not have access to simultaneous bilateral CBFV recordings, and thus our method might achieve better performance characteristics in such scenarios.",
                        "An attractive feature of our approach is that it retains its interpretability due to the underlying physiologic model. Several possible time offsets between the rABP and CBFV are considered, which helps address the challenge posed by unknown (and patient-specific) time offsets between these signals. Estimation is performed within a Bayesian framework, which helps increase the method's resilience to structured errors that may be introduced, for instance by differences between rABP and cABP morphology, and also to unstructured errors due to signal noise and motion artifacts in recorded data. An encouraging aspect of our approach is that it achieved an RMSE of nearly 4 mmHg with parameter choices that are applicable to diverse patient populations. Specifically, our prior distribution for baseline estimation spanned negative ICPs, as well as high ICPs. Also, we set γm close to +1, with a correspondingly large σm2 for generalizability to data with large ICP variability.",
                        "The nICP estimation method proposed in this paper does not require calibration to invasive ICP measurements. Our system can thus be used as a screening tool for identifying patients suffering from elevated ICP without resorting to invasive and painful procedures such as lumbar punctures. In addition to monitoring patients suffering from neurological diseases, our system can be useful in monitoring intra-operative cerebral perfusion and autoregulation. Both inadequate and excessive cerebral perfusion has been shown to be a cause of post-operative delirium. Surgical procedures such as coronary artery bypass graft (CABG) typically do not employ concurrent invasive ICP monitoring, and thus cerebral perfusion pressure cannot be directly measured. Cerebral perfusion pressure derived from our nICP estimates can be potentially used to ameliorate this problem.",
                        "Such clinical translation of our method will require implementing it for real-time operation. This is a straightforward prospect because the method employs a set of deterministic causal mathematical operations. Another possible future course of exploration can be to noninvasively estimate ICP pulsatility. While the mean ICP is clinically most relevant, ICP pulsatility has also been proposed to be an important clinical indicator. Additional work may focus on testing our proposed method on a larger dataset comprising subjects with more diverse pathologies, age and gender. We have used routinely measured rABP recordings for estimating ICPs in our clinical dataset, and future validation of the method could also involve noninvasive blood pressure monitors. Work may also focus on harnessing information in the estimated model coefficients, αm and βm, both for monitoring a subject's cerebral autoregulation status, and for assessing nICP estimation confidence on a window-by-window basis. Our model incorporates an AR description of temporal evolution of the ICP. Similar descriptions for αm and βm can be developed and integrated into our model, albeit at the cost of increasing computational complexity of the resulting ICP estimation algorithm. In the present work, we used preset values of the hyper-parameters γm and σm2 in our ICP prediction model. While these preset values were shown to function well across our data, work can focus on automatically and robustly identifying these parameters from longitudinal nICP estimates.",
                        "Continuous noninvasive ICP monitoring can benefit a large number of patients. The nICP estimation framework proposed in this paper hopefully paves the way towards developing a reliable, continuous, realtime, accurate, and fully noninvasive ICP monitoring device to improve neurocritical care across the world.",
                        "4. Methods",
                        "4.1 Data Processing",
                        "All extracted data segments were first passed through a set of preprocessing steps. First, a coarse time alignment step was applied between the rABP and the CBFV signals to account for time delays introduced by different measurement devices. This time offset was obtained by computing the cross-correlation between the rABP and the CBFV signals, and the lag with the highest cross-correlation coefficient was selected as the desired offset. Doing so, however, did not account for physiologically-induced time offsets between rABP and CBFV. Following this time offset correction step, the signals were resampled to a common 125 Hz to compensate for any underlying sampling frequency discrepancies. Finally, the baseline rABP was adjusted to account for differences in ICP and rABP transducer heights. We then passed the signals through an out-of-band-noise removal stage. The rABP and CBFV trends were first extracted via a 256-tap moving-average filter. These trends were subtracted from the rABP and CBFV signals, respectively, and the resulting detrended signals were filtered by a 128-tap bandpass filter with cutoffs at 0.5 and 16 Hz. The trend removed in the first stage was then added back to the filter output to restore the original DC levels. We then assigned an in-band-noise, ag to individual non-overlapping, twenty-beat data windows. An estimation window was marked as noisy if the cross-correlation coefficient between any of the corresponding rABP and CBFV beats was below the threshold of 0.2.",
                        "4.2 FIR Model Derivation",
                        "Our FIR model of cerebral hemodynamics is a discrete-time approximation of the continuous-time model developed earlier in our group. For the mth estimation window, this continuous-time model is of the form",
                        "\\({q(t)} = {{\\frac{1}{R_{m}}\\left( {{p_{a}(t)} - {I\\lbrack m\\rbrack}} \\right)} + {C_{m}\\frac{d}{dt}\\left( {{p_{a}(t)} - {I\\lbrack m\\rbrack}} \\right)}}\\)",
                        "where the model resistance, Rm, and compliance, Cm, are assumed to remain constant during the data window. Approximating the derivative operation by first-order finite-differences, and denoting discrete-time sampling indices with n,",
                        "\\(\\begin{matrix}\n{\\left. {{q\\lbrack n\\rbrack} = {{\\frac{1}{R_{m}}\\left( {p_{a}\\lbrack n\\rbrack} \\right)} - {I\\lbrack m\\rbrack}}} \\right) + {C_{m}f_{s}\\left\\{ {\\left( {{p_{a}\\lbrack n\\rbrack} - {I\\lbrack m\\rbrack}} \\right) - \\left( {{p_{a}\\left\\lbrack {n - 1} \\right\\rbrack} - {I\\lbrack m\\rbrack}} \\right)} \\right\\}}} \\\\\n{= {{\\left( {\\frac{1}{R_{m}} + \\frac{C}{T}} \\right)\\left( {{p_{a}\\lbrack n\\rbrack} - {I\\lbrack m\\rbrack}} \\right)} - {C_{m}{f_{s}\\left( {{p_{a}\\left\\lbrack {n - 1} \\right\\rbrack} - {I\\lbrack m\\rbrack}} \\right)}}}} \\\\\n{= {\\alpha_{m}\\left( {{p_{a}\\lbrack n\\rbrack} - {I\\lbrack m\\rbrack} + {\\beta_{m}\\left( {{p_{a}\\left( {N + 1} \\right)} - {I\\lbrack m\\rbrack}} \\right)}} \\right.}}\n\\end{matrix}\\)",
                        "where fs is the sampling rate (=125 Hz for our data),",
                        "\\({\\alpha_{m} = {\\frac{1}{R_{m}} + {C_{m}f_{s}}}},{{{and}\\mspace{14mu}\\beta_{m}} = {{- C_{m}}{f_{s}.}}}\\)",
                        "This FIR filter, along with the ICP AR process description of Equation 2 form our complete model of cerebral hemodynamics that is employed in the proposed method. The method itself comprises two stages, that internally employ a common model-solving routine. We describe this routine next, and then proceed to describing the two stages.",
                        "4.3 Model-Based Bayesian Estimation Routine",
                        "This routine is employed in both baseline determination and subsequent ICP tracking, and it solves the model in Equation 1 for a range of candidate ICP and time offset pairs. It takes as input preprocessed rABP and CBFV signals in individual estimation windows, and computes nICP estimates by treating each window independently. Since all operations are confined to individual data windows, we omit the window index, m, for clarity in the remainder of this section.",
                        "We select the time offset range such that the CBFV peaks are constrained to lead the corresponding rABP systolic peaks whilst ensuring that the diastolic points of the two waveforms are aligned with each other (FIG. 6). This is because the underlying Windkessel-like model dictates that both signals should start rising simultaneously at the onset of systole, with the CBFV rising faster to reach its peak before the rABP. To compensate for possibly inaccurate beat detections and modeling inaccuracies, we allowed the diastolic indices of the two waveforms to differ by at most three samples (≈25 ms). All time offsets in which these two criteria are met form the time offset scan range.",
                        "To form the ICP scan range, we start scanning from an ICP of −10 mmHg, as negative ICPs are physiologically possible. We scan the ICP in increments of 1 mmHg this granularity was deemed sufficient for clinical diagnostic purposes and stop at the mean rABP in the estimation window, as the ICP cannot exceed the rABP itself.",
                        "For each ICP and time offset pair, we compute estimates for α and β in a least-squared-error sense",
                        "\\(\\begin{matrix}\n{{\\left\\lbrack {{\\hat{\\alpha}}^{I,d},{\\hat{\\beta}}^{I,d}} \\right\\rbrack^{T} = {\\left( {\\Phi^{IT}\\Phi^{I}} \\right)^{\\dagger}\\Phi^{IT}\\Phi^{d}}}{{{where}\\mspace{14mu} q^{d}} = \\left\\lbrack {{q\\left\\lbrack {2 - d} \\right\\rbrack},\\ldots,{q\\left\\{ {N - d} \\right\\rbrack}} \\right\\rbrack^{T}}{\\Phi^{I} = \\begin{bmatrix}\n{{p_{a}\\lbrack 2\\rbrack} - I} & {{p_{a}\\lbrack 1\\rbrack} - I} \\\\\n\\vdots & \\vdots \\\\\n{{p_{a}\\lbrack N\\rbrack} - I} & {{p_{a}\\left\\lbrack {N - 1} \\right\\rbrack} - I}\n\\end{bmatrix}}} & (3)\n\\end{matrix}\\)",
                        "Here, the † symbol represents a matrix pseudo-inverse, N denotes the number of samples in the estimation window, and I and d signify the solution's dependence on the candidate ICP and time offset values, respectively. The corresponding residual-error norm is given by ζI,d=|ΦI[{circumflex over (α)}I,d,{circumflex over (β)}I,d]T−qd|2.",
                        "We define a likelihood distribution (I, d)",
                        "\\(\\begin{matrix}\n{{{\\mathcal{L}\\left( {I,\\ d} \\right)} = {\\frac{1}{S_{\\mathcal{L}}} \\times \\exp\\left\\{ {- \\left( \\frac{\\zeta^{I,d}}{\\theta} \\right)^{2}} \\right\\}}}{\\theta = {\\min\\limits_{I,d}\\zeta^{I,d}}}} & (4)\n\\end{matrix}\\)",
                        "where  is chosen so that (I, d)sums to one. This formulation assigns high likelihood to (I, d) pairs that result in a small residual error, and a conversely low likelihood to pairs with large residual error norms. To subsequently employ a prior distribution across the ICP, we marginalize (I, d) across the time offsets to generate a one-dimensional likelihood distribution defined across the ICP only",
                        "\\(\\begin{matrix}\n{{\\mathcal{L}(I)} = {\\sum\\limits_{d}{\\mathcal{L}\\left( {I,d} \\right)}}} & (5)\n\\end{matrix}\\)",
                        "This distribution's mode, ÎL, and variance, σL2 are computed according to",
                        "\\(\\begin{matrix}\n{{{\\hat{I}}_{L} = {\\underset{I}{argmax}{\\mathcal{L}(I)}}}{\\sigma_{L}^{2} = {\\sum\\limits_{I}\\left\\{ {\\left( {I - {\\sum\\limits_{I}{I \\times {\\mathcal{L}(I)}}}} \\right)^{2} \\times {\\mathcal{L}(I)}} \\right\\}}}} & (6)\n\\end{matrix}\\)",
                        "Finally, an a posteriori distribution is generated by combining the likelihood distribution with our prior belief",
                        "\\(\\begin{matrix}\n{{\\Pr\\left( {\\left. I \\middle| p_{a} \\right.,q_{v}} \\right)} = {\\frac{1}{S_{p}} \\times {\\Pr(I)}{\\mathcal{L}(I)}}} & (7)\n\\end{matrix}\\)",
                        "where Sp is chosen so that the distribution sums to one. The mode and variance of this combined distribution are denoted as ÎC, and variance, σC2, respectively.",
                        "In our method, we used a prior belief of the form",
                        "\\(\\begin{matrix}\n{{\\Pr(I)} = \\left\\{ \\begin{matrix}\n{{\\frac{1}{S} \\times {\\sum\\limits_{k = 1}^{2}{\\frac{w_{k}}{\\sqrt{2\\pi\\sigma_{k}}}\\exp\\left\\{ {{- \\frac{1}{2}}\\left( \\frac{I - \\mu_{k}}{\\sigma_{k}} \\right)^{2}} \\right\\}}}},{I \\in I_{range}}} \\\\\n{0,\\ {I \\notin I_{range}}}\n\\end{matrix} \\right.} & (8)\n\\end{matrix}\\)\n\n\n- - w₁, w₂ ∈\\[0, 1\\], subject to the constraint w₁+w₂=1",
                        "where Irange denotes the ICP scan range, and S is chosen such that Pr(I) sums to unity. We selected a representative subset of 46 twenty-beat estimation windows from three subjects (1, 2, and 7) to derive parameters for this distribution, and found the mean ICP and standard deviation to be 13.6 and 2.8 mmHg, respectively. We then set μ1=13.6 mmHg to model low ICPs, and set σ1=10 mmHg−a value larger than the ICP standard deviation in the 46 estimation windows—to model greater variance in ICPs. Additionally, we set μ2=50 mmHg and σ2=20 mmHg to model high ICPs. We set w1=0.8 and w2=0.2 by noting that the mean ICP exceeded 30 mmHg in 20% of the data records used in previous work from our group.",
                        "4.4 Baseline ICP Estimation",
                        "To establish a baseline, we compute a posteriori mode estimates in the first Mb=5 data windows where the corresponding in-band-noise flag is not raised. The mode estimates are averaged to yield the baseline, IB. We set Mb to five to ensure that a hundred beats (or more than a minute) of data are analyzed before setting the baseline. The nICP estimates, Î[m], in these estimation windows, are set equal to the corresponding a posteriori mode estimates, ÎC[m].",
                        "The baseline ICP is passed to the subsequent tracking stage. This stage uses mode estimates of the likelihood distribution. This amounts to using a uniform prior belief, and is done to reduce dependence on the initial prior distribution. Using a uniform belief, however, also increases the chances of error-prone nICP estimates. We therefore developed a tracking framework that filters the changes in nICP estimates computed with the uniform prior belief. This filtering is achieved by combining observed nICP estimates with model-predicted changes obtained with our AR process model.",
                        "The baseline computation stage passes its baseline ICP estimate to the tracking stage. A reference nICP and variance obtained solely from the likelihood distribution are also computed according to",
                        "IL,ref=ÎL[mTS]",
                        "σL,ref2=σL2[mTS]",
                        "where mTS is the last selected estimation window's index. These values are used to initialize the tracking filter which is described next.",
                        "4.5 Tracking Changes in the ICP",
                        "Filtered ICP-change estimates are computed by combining observed and model-predicted changes in ICP for ≥mTS. In the following description, we denote the observed nICP changes as ΔO[m+1]. Their estimated variances are denoted as σΔO2 [m+1]. We denote the model-predicted ICP changes as ΔP[m+1] and their estimated variances as σΔP2 [m+1]. Likewise, the filtered ICP-change estimates are denoted as [m+1] and their variance estimates as [m+1].",
                        "Assuming that likelihood distributions of successive estimation windows are statistically independent, the observed nICP change (with the uniform prior) and its variance are",
                        "ΔO[m+1]=ÎL[m+1]−ÎL[m]",
                        "σΔO2[m+1]=σL2[m+1]−σL2[m]  (9)",
                        "where ÎL [mTS] and σL2[mTS] are initialized to IL,ref and σL,ref2, respectively. The variance estimates are upper bounds on the true variances because, by virtue of the independence assumption, the covariance terms have not been included. We compensated for this by using relatively large values of σv2. Also, in estimation windows where the in-band-noise flag is raised, ÎL [m] is set to ÎL[m−1], and σL2 [m] is set to ϵ, where ϵ=10−9 to arrest any drifts induced by a series of noisy estimation windows. Next, we compute the model-predicted ICP change and its variance as",
                        "ΔP[m+1]=γm[m]",
                        "σΔP2[m+1]=γm2[m]−σv2  (10)",
                        "where the prediction is made using the filtered change estimate, [m], of the previous window. To initialize this computation at m=mTS, we set [mTS] and [mTS] to 0 mmHg.",
                        "Once both model-predicted and observed ICP changes and their variances have been computed, they are combined such that",
                        "\\(\\begin{matrix}\n{{{\\chi = \\frac{\\sigma_{\\Delta P}^{2}\\left\\lbrack {m + 1} \\right\\rbrack}{{\\sigma_{\\Delta P}^{2}\\left\\lbrack {m + 1} \\right\\rbrack} + {\\sigma_{\\Delta O}^{2}\\left\\lbrack {m + 1} \\right\\rbrack}}}{{\\sigma_{\\Delta O}^{2}\\left\\lbrack {m + 1} \\right\\rbrack} = {x{\\sigma_{\\Delta O}^{2}\\left\\lbrack {m + 1} \\right\\rbrack}}}}{{\\hat{\\Delta I}\\left\\lbrack {m + 1} \\right\\rbrack} = {{\\left( {1 - x} \\right)\\Delta{P\\left\\lbrack {m + 1} \\right\\rbrack}} + {{x\\Delta O}\\left\\lbrack {m + 1} \\right\\rbrack}}}} & (11)\n\\end{matrix}\\)",
                        "The resulting filtered change, [m+1], is added to [m] to yield the final nICP estimate,",
                        "Î[m+1]=Î[m]+[m+1]  (12)",
                        "where IB is used instead of Î[mTS] in the first iteration.",
                        "In this formulation, Equation 11 can be seen to merge the predicted and observed estimates of the inter-estimation-window ICP change by assigning greater weight to the estimate with lesser variance. This Kalman-filter like process is repeated for subsequent estimation windows to yield nICP estimates with greatly reduced dependence on initial prior information.",
                        "The terms “program” or “software” are used herein in a generic sense to refer to any type of computer code or set of processor-executable instructions that can be employed to program a computer or other processor to implement various aspects of embodiments as discussed above. Additionally, it should be appreciated that according to one aspect, one or more computer programs that when executed perform methods of the disclosure provided herein need not reside on a single computer or processor, but may be distributed in a modular fashion among different computers or processors to implement various aspects of the disclosure provided herein.",
                        "Processor-executable instructions may be in many forms, such as program modules, executed by one or more computers or other devices. Generally, program modules include routines, programs, objects, components, data structures, etc. that perform particular tasks or implement particular abstract data types. Typically, the functionality of the program modules may be combined or distributed as desired in various embodiments.",
                        "Also, data structures may be stored in one or more non-transitory computer-readable storage media in any suitable form. For simplicity of illustration, data structures may be shown to have fields that are related through location in the data structure. Such relationships may likewise be achieved by assigning storage for the fields with locations in a non-transitory computer-readable medium that convey relationship between the fields. However, any suitable mechanism may be used to establish relationships among information in fields of a data structure, including through the use of pointers, tags or other mechanisms that establish relationships among data elements.",
                        "Also, various inventive concepts may be embodied as one or more processes, of which examples have been provided. The acts performed as part of each process may be ordered in any suitable way. Accordingly, embodiments may be constructed in which acts are performed in an order different than illustrated, which may include performing some acts simultaneously, even though shown as sequential acts in illustrative embodiments.",
                        "All definitions, as defined and used herein, should be understood to control over dictionary definitions, and/or ordinary meanings of the defined terms.",
                        "As used herein in the specification and in the claims, the phrase “at least one,” in reference to a list of one or more elements, should be understood to mean at least one element selected from any one or more of the elements in the list of elements, but not necessarily including at least one of each and every element specifically listed within the list of elements and not excluding any combinations of elements in the list of elements. This definition also allows that elements may optionally be present other than the elements specifically identified within the list of elements to which the phrase “at least one” refers, whether related or unrelated to those elements specifically identified. Thus, as a non-limiting example, “at least one of A and B” (or, equivalently, “at least one of A or B,” or, equivalently “at least one of A and/or B”) can refer, in one embodiment, to at least one, optionally including more than one, A, with no B present (and optionally including elements other than B); in another embodiment, to at least one, optionally including more than one, B, with no A present (and optionally including elements other than A); in yet another embodiment, to at least one, optionally including more than one, A, and at least one, optionally including more than one, B (and optionally including other elements); etc.",
                        "The phrase “and/or,” as used herein in the specification and in the claims, should be understood to mean “either or both” of the elements so conjoined, i.e., elements that are conjunctively present in some cases and disjunctively present in other cases. Multiple elements listed with “and/or” should be construed in the same fashion, i.e., “one or more” of the elements so conjoined. Other elements may optionally be present other than the elements specifically identified by the “and/or” clause, whether related or unrelated to those elements specifically identified. Thus, as a non-limiting example, a reference to “A and/or B”, when used in conjunction with open-ended language such as “comprising” can refer, in one embodiment, to A only (optionally including elements other than B); in another embodiment, to B only (optionally including elements other than A); in yet another embodiment, to both A and B (optionally including other elements); etc.",
                        "Use of ordinal terms such as “first,” “second,” “third,” etc., in the claims to modify a claim element does not by itself connote any priority, precedence, or order of one claim element over another or the temporal order in which acts of a method are performed. Such terms are used merely as labels to distinguish one claim element having a certain name from another element having a same name (but for use of the ordinal term).",
                        "The phraseology and terminology used herein is for the purpose of description and should not be regarded as limiting. The use of “including,” “comprising,” “having,” “containing”, “involving”, and variations thereof, is meant to encompass the items listed thereafter and additional items.",
                        "Having described several embodiments of the techniques described herein in detail, various modifications, and improvements will readily occur to those skilled in the art. Such modifications and improvements are intended to be within the spirit and scope of the disclosure. Accordingly, the foregoing description is by way of example only, and is not intended as limiting. The techniques are limited only as defined by the following claims and the equivalents thereto."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce limitations of conventional ICP estimation techniques",
                        "describe inaccuracy of ICP estimates due to lack of physiological data",
                        "explain limitations of mapping ABP and CBFV to ICP measurements",
                        "describe inaccuracies due to misalignment of ABP and CBFV waveforms",
                        "motivate development of new computational techniques for ICP estimation",
                        "introduce statistical model for ICP estimation",
                        "describe use of statistical model to compute initial ICP value",
                        "explain estimation of changes in ICP using additional ABP and CBFV data",
                        "describe dynamic updating of ICP value using patient data",
                        "introduce importance of accounting for biases in ICP estimates",
                        "describe use of patient's own data to compensate for biases",
                        "explain inaccuracy of ICP estimates due to misalignment of ABP and CBFV waveforms",
                        "introduce time offsets as parameters of the statistical model",
                        "describe determination of time offset values to align ABP and CBFV waveforms",
                        "summarize issues with estimating ICP",
                        "introduce embodiments of technology for estimating ICP",
                        "describe obtaining data identifying ABP and CBFV of a patient",
                        "explain estimation of initial ICP value using statistical model",
                        "describe estimation of updated ICP value using changes in ICP",
                        "introduce use of Bayesian statistics in estimating ICP",
                        "describe computation of posterior distribution of ICP values",
                        "explain use of prior distribution of ICP values",
                        "describe evaluation of time periods with low-quality data",
                        "introduce removal of low-quality time periods in estimating ICP",
                        "describe determination of changes in ICP using statistical model",
                        "explain use of optimization techniques for estimating parameter values",
                        "describe computation of ICP estimates during different time periods",
                        "introduce prediction of ICP value using ABP and CBFV data",
                        "describe estimation of change in ICP for a future time",
                        "explain use of predicted change in ICP in estimating updated ICP value",
                        "describe evaluation of possible values for parameters of statistical model",
                        "introduce prediction of change in ICP for a time period",
                        "describe comparison of predicted and data-derived changes in ICP",
                        "explain evaluation of time offsets between ABP and CBFV waveforms",
                        "describe alignment of ABP and CBFV waveforms using physiological constraints",
                        "introduce prediction of physiological signals using statistical model",
                        "describe computation of prediction errors",
                        "explain use of prediction errors in computing likelihood of ICP",
                        "describe computation of likelihood distribution of ICP for different time offsets",
                        "summarize various aspects and embodiments of technology described",
                        "introduce ICP estimation technique",
                        "describe ICP baseline value estimation",
                        "describe ICP change tracking technique",
                        "introduce statistical model",
                        "describe physiological model",
                        "describe Bayesian statistical techniques",
                        "describe time shift estimation technique",
                        "describe time offset range estimation",
                        "describe optimization routine",
                        "describe parameter value estimation",
                        "describe prediction change model",
                        "describe prediction error estimation",
                        "describe ABP and CBFV waveform alignment",
                        "describe shifted CBFV waveforms",
                        "describe optimization routine for model parameters",
                        "describe prediction of physiological signals",
                        "describe using one signal to predict another",
                        "describe optimization routine for ICP values",
                        "describe predicted CBFV waveforms",
                        "describe prediction errors",
                        "describe Bayesian statistical framework",
                        "describe likelihood of ICP computation",
                        "describe combining likelihood distributions",
                        "describe data processing pipeline",
                        "describe likelihood distribution of ICP",
                        "describe exponential relationship between likelihood and prediction errors",
                        "describe inverse relationship between likelihood and prediction errors",
                        "describe prior distribution of ICP",
                        "describe combining likelihood and prior distributions",
                        "describe posterior distribution of ICP",
                        "describe estimated ICP value determination",
                        "describe using posterior distribution for ICP estimation",
                        "conclude ICP estimation technique",
                        "introduce noninvasive intracranial pressure estimation method",
                        "describe first-order subject-specific model of cerebral vasculature",
                        "explain model-based estimation within probabilistic framework",
                        "outline process for establishing baseline ICP estimate",
                        "describe single-state model of cerebral autoregulatory dynamics",
                        "summarize performance characteristics of method",
                        "introduce importance of intracranial pressure measurement",
                        "describe current clinical practice for ICP measurement",
                        "discuss limitations of current ICP measurement modalities",
                        "introduce noninvasive ICP estimation schemes",
                        "describe physiologic model-based methods",
                        "outline Bayesian estimation framework",
                        "describe model of cerebral hemodynamics",
                        "explain time-varying, first-order FIR filter approximation",
                        "describe AR process description of ICP dynamics",
                        "outline model-based estimation algorithm",
                        "describe use of radial arterial blood pressure",
                        "explain probabilistic estimation framework",
                        "describe process for establishing baseline ICP",
                        "outline process for tracking changes in baseline ICP",
                        "describe use of uniform prior distribution",
                        "explain filtering of ICP changes via Kalman filter-like approach",
                        "describe data description and method validation",
                        "introduce illustrative implementation of computer system",
                        "describe computer system components",
                        "explain processor control of data writing and reading",
                        "describe non-transitory computer-readable storage media",
                        "outline processor-executable instructions",
                        "describe network input/output interface",
                        "describe user input/output interfaces",
                        "explain implementation of embodiments",
                        "describe computer-readable storage medium",
                        "outline computer program",
                        "describe Section A",
                        "introduce noninvasive intracranial pressure estimation method",
                        "describe first-order subject-specific model of cerebral vasculature",
                        "explain model-based estimation within probabilistic framework",
                        "outline process for establishing baseline ICP estimate",
                        "describe single-state model of cerebral autoregulatory dynamics",
                        "summarize performance characteristics of method",
                        "describe results of method",
                        "outline model of cerebral hemodynamics",
                        "describe time-varying, first-order FIR filter approximation",
                        "explain AR process description of ICP dynamics",
                        "describe model-based estimation algorithm",
                        "outline data description and method validation",
                        "conclude method summary",
                        "introduce data collection",
                        "describe data collection protocol",
                        "introduce metadata recording",
                        "describe data segments extraction",
                        "introduce signal conditioning stage",
                        "describe estimation routine",
                        "introduce ICP estimation results",
                        "describe estimation results for patient 1",
                        "describe estimation results for patient 3",
                        "describe estimation results for patient 11",
                        "perform Bland-Altman analysis",
                        "describe per-estimation-window analysis",
                        "describe per-recording analysis",
                        "describe per-patient analysis",
                        "compute fraction of nICP estimates",
                        "discuss invasive ICP measurement modalities",
                        "compare with previous methods",
                        "discuss advantages of noninvasive approach",
                        "discuss challenges in adopting model-based nICP estimation",
                        "discuss differences from previous methods",
                        "discuss interpretability of approach",
                        "discuss Bayesian framework",
                        "discuss estimation performance",
                        "discuss potential applications",
                        "introduce data processing",
                        "describe time alignment step",
                        "describe resampling step",
                        "describe baseline adjustment step",
                        "describe out-of-band-noise removal stage",
                        "describe FIR model derivation",
                        "describe model-based Bayesian estimation routine",
                        "describe time offset scan range",
                        "describe ICP scan range",
                        "compute estimates for α and β",
                        "define likelihood distribution",
                        "marginalize likelihood distribution",
                        "define a posteriori distribution",
                        "derive mode and variance of combined distribution",
                        "specify prior belief",
                        "select parameters for prior belief",
                        "establish baseline ICP estimation",
                        "compute a posteriori mode estimates",
                        "set baseline ICP",
                        "pass baseline to tracking stage",
                        "compute reference nICP and variance",
                        "initialize tracking filter",
                        "compute filtered ICP-change estimates",
                        "combine observed and model-predicted changes",
                        "update filtered change estimates",
                        "compute final nICP estimate",
                        "define program or software",
                        "specify computer-executable instructions",
                        "describe data structures",
                        "define relationships among data elements",
                        "describe processes",
                        "define phrase \"at least one\"",
                        "define phrase \"and/or\"",
                        "describe use of ordinal terms",
                        "provide disclaimer and scope of disclosure"
                    ],
                    "num_characters": 91164,
                    "outline_medium": [
                        "introduce limitations of conventional ICP estimation techniques",
                        "describe inaccuracy of ICP estimates due to lack of physiological data",
                        "explain misalignment of ABP and CBFV waveforms",
                        "motivate new computational techniques for estimating ICP",
                        "introduce statistical model for estimating ICP",
                        "describe estimation of initial ICP value using ABP and CBFV data",
                        "explain estimation of changes in ICP value using additional ABP and CBFV data",
                        "discuss importance of using patient's own data to account for biases",
                        "introduce time offsets as parameters of the statistical model",
                        "describe determination of time offset values to align ABP and CBFV waveforms",
                        "summarize some embodiments of the technology described herein",
                        "describe obtaining data identifying ABP and CBFV of a patient",
                        "explain estimation of initial ICP value using a statistical model",
                        "describe estimation of updated ICP value by determining a change in ICP",
                        "discuss use of Bayesian statistics in estimating ICP",
                        "explain evaluation of time periods in patient data for low quality or noise",
                        "describe determination of changes in ICP using the statistical model",
                        "discuss optimization techniques for estimating values for parameters of the statistical model",
                        "explain prediction of ICP value using ABP and CBFV data from a patient",
                        "describe evaluation of possible values for parameters of the statistical model",
                        "introduce ICP estimation technique",
                        "describe ICP baseline value estimation",
                        "describe ICP change tracking technique",
                        "introduce statistical model",
                        "describe Bayesian statistical techniques",
                        "describe time shift estimation technique",
                        "describe optimization routine",
                        "describe prediction change model",
                        "describe using one physiological signal to predict another",
                        "describe optimization routine with multiple ICP values",
                        "describe using Bayesian statistical framework",
                        "describe computing likelihood of ICP",
                        "describe combining likelihood distributions",
                        "describe obtaining posterior distribution",
                        "describe determining estimated ICP value",
                        "conclude ICP estimation technique",
                        "introduce noninvasive intracranial pressure estimation method",
                        "describe first-order subject-specific model of cerebral vasculature",
                        "explain model-based estimation within probabilistic framework",
                        "outline process for establishing baseline ICP estimate",
                        "describe single-state model of cerebral autoregulatory dynamics",
                        "summarize performance characteristics of method",
                        "introduce importance of intracranial pressure measurement",
                        "describe limitations of current clinical ICP measurement modalities",
                        "outline need for noninvasive ICP estimation schemes",
                        "summarize existing nICP estimation methods",
                        "introduce proposed physiologic nICP estimation and tracking scheme",
                        "describe first-order, time-varying, finite impulse response filter model",
                        "explain associated Bayesian estimation framework",
                        "outline process for computing nICP estimates",
                        "describe model of cerebral hemodynamics",
                        "outline results of model-based estimation algorithm",
                        "describe process for establishing baseline ICP",
                        "outline process for tracking changes in baseline ICP",
                        "describe data description and method validation",
                        "introduce illustrative implementation of computer system",
                        "describe computer system components",
                        "outline functionality of computer system",
                        "summarize embodiments of technology described",
                        "introduce data collection",
                        "describe data processing",
                        "motivate ICP estimation",
                        "present ICP estimation results",
                        "analyze estimation results",
                        "discuss ICP estimation method",
                        "compare with prior methods",
                        "highlight advantages",
                        "discuss clinical applications",
                        "describe data processing steps",
                        "derive FIR model",
                        "present Bayesian estimation routine",
                        "describe model-solving routine",
                        "define likelihood distribution",
                        "marginalize likelihood distribution",
                        "compute mode and variance",
                        "discuss method limitations",
                        "conclude with future directions",
                        "derive posterior distribution",
                        "define prior belief",
                        "compute baseline ICP",
                        "track changes in ICP",
                        "filter ICP-change estimates",
                        "combine observed and model-predicted changes",
                        "compute final nICP estimate",
                        "discuss software implementation",
                        "describe data structures",
                        "discuss process ordering",
                        "define terms and phrases"
                    ],
                    "outline_short": [
                        "limitations of conventional ICP estimation techniques",
                        "motivate new computational techniques for ICP estimation",
                        "describe statistical model for ICP estimation",
                        "estimate initial ICP value using ABP and CBFV data",
                        "estimate changes in ICP value using additional ABP and CBFV data",
                        "account for misalignment in ABP and CBFV waveforms",
                        "introduce time offsets as parameters of the statistical model",
                        "evaluate quality of patient data for ICP estimation",
                        "predict ICP values using ABP and CBFV data",
                        "illustrate processing pipeline for ICP estimation",
                        "describe ICP estimation technique",
                        "describe statistical model for ICP estimation",
                        "describe Bayesian statistical techniques for ICP estimation",
                        "describe time shift estimation technique for aligning ABP and CBFV waveforms",
                        "describe optimization routine for determining model parameters",
                        "describe prediction change model for predicting physiological signals",
                        "describe Bayesian framework for estimating ICP values",
                        "describe data processing pipeline for estimating ICP using prediction errors",
                        "describe noninvasive ICP estimation method",
                        "motivate ICP estimation",
                        "introduce model of cerebral hemodynamics",
                        "describe model-based estimation algorithm",
                        "outline data description and method validation",
                        "illustrate process 1600 for estimating intracranial pressure",
                        "illustrate process 1700 for estimating intracranial pressure",
                        "illustrate process 1800 for evaluating noise in patient data",
                        "describe computer system implementation",
                        "outline non-limiting illustrative embodiments",
                        "summarize noninvasive ICP estimation method",
                        "introduce data collection protocol",
                        "describe data processing steps",
                        "present ICP estimation results",
                        "discuss method's performance and limitations",
                        "compare with previous work",
                        "highlight method's advantages and potential applications",
                        "outline future work directions",
                        "derive FIR model of cerebral hemodynamics",
                        "describe model-based Bayesian estimation routine",
                        "derive posterior distribution",
                        "establish baseline ICP estimation",
                        "track changes in ICP",
                        "describe software implementation",
                        "provide definitions and clarifications"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A system comprising:\nat least one hardware processor; and\nat least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by the at least one hardware processor, cause the at least one hardware processor to perform:\nobtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time;\nestimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values;\nobtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time;\nestimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and\noutputting information indicating the updated intracranial pressure value.",
        "2. The system of claim 1, wherein the statistical model includes at least one of a parameter representing cerebrovascular resistance, a parameter representing cerebrovascular compliance, a parameter representing intracranial pressure, and a parameter representing inertance.",
        "3. The system of claim 1, wherein the statistical model relates arterial blood pressure and cerebral blood flow velocity to intracranial pressure.",
        "4. The system of claim 1, wherein determining the change in intracranial pressure of the patient is performed at least in part by using the statistical model and the second set of data to estimate at least one value for a set of parameters of the statistical model.",
        "5. The system of claim 1, wherein the at least one hardware processor is further configured to perform:\npredict a change in intracranial pressure for at least a third period of time after the second period of time based on the at least one value for the set of parameters of the statistical model.",
        "6. The system of claim 4, wherein determining the change in intracranial pressure of the patient is performed at least in part by estimating the at least one value for the set of parameters of the statistical model using the statistical model and the second set of data to evaluate a plurality of intracranial pressure values at a plurality of time offsets corresponding to a time shift between arterial blood pressure measurements and cerebral blood flow velocity measurements obtained from the patient.",
        "7. The system of claim 1, wherein obtaining the first set of data includes obtaining arterial blood pressure and cerebral blood flow velocity of the patient over a plurality of cardiac cycles.",
        "8. The at least one non-transitory computer-readable storage medium of claim 17, wherein the at least one hardware processor is further configured to perform:\nestimating a series of intracranial pressure values for the patient by estimating changes in intracranial pressure of the patient based on the second set of data and combining the estimated changes in intracranial pressure with the estimated initial intracranial pressure value.",
        "9. The at least one non-transitory computer-readable storage medium of claim 8, wherein estimating the series of intracranial pressure values further comprises dynamically updating an estimated intracranial pressure value during the second period of time as the second set of data is obtained.",
        "10. The system of claim 1, wherein estimating the initial intracranial pressure value further comprises using the statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the first set of data and the prior distribution of intracranial pressure values.",
        "11. The system of claim 1, wherein the at least one hardware processor is further configured to perform:\npredicting a set of values for a physiological signal for the patient using the statistical model and data obtained from the patient, the predicting performed at least in part by using the statistical model and the data to evaluate a plurality of intracranial pressure values at a plurality of time offsets between arterial blood pressure and cerebral blood flow velocity;\ngenerating a set of prediction errors by comparing the predicted set of values for the physiological signal to a portion of the data corresponding to the physiological signal; and\ncomputing the likelihood of intracranial pressure based on the set of prediction errors.",
        "12. The system of claim 11, wherein computing the likelihood of intracranial pressure further comprises determining, for each of the plurality of time offsets, a likelihood of intracranial pressure distribution for the time offset from a subset of prediction errors associated with using the time offset in computing the physiological signal.",
        "13. The system of claim 12, wherein computing the likelihood of intracranial pressure further comprises combining the likelihood of intracranial pressure distribution for each of the plurality of time offsets to determine the likelihood of intracranial pressure.",
        "14. The method of claim 18, wherein estimating the initial intracranial pressure value further comprises:\ncomputing at least one intracranial pressure value using the first set of data at a time interval within the first period of time;\ndetermining a metric indicative of the level of noise in the first set of data during the time interval; and\nselecting, based on comparing the metric to a threshold value, to include the at least one intracranial pressure value in estimating the intracranial pressure value.",
        "15. The method of claim 18, wherein estimating an updated intracranial pressure value further comprises:\ncomputing, for a time interval within the second duration of time, a predicted change in intracranial pressure for the patient based on a subset of the second set of data corresponding to at least one time interval preceding the time interval;\ncomputing, for the time interval, a data-derived change in intracranial pressure for the patient based on a subset of the second set of data corresponding to the time interval;\ndetermining an estimated change in intracranial pressure based on the predicted change in intracranial pressure and the data-derived change in intracranial pressure; and\nusing the estimated change in intracranial pressure to estimate the updated intracranial pressure value.",
        "16. The method of claim 18, wherein the prior distribution of intracranial pressure values corresponds to data obtained from at least one person other than the patient.",
        "17. At least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by at least one hardware processor, cause the at least one hardware processor to perform:\nobtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time;\nestimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values;\nobtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time;\nestimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and\noutputting information indicating the updated intracranial pressure value.",
        "18. A method, comprising:\nusing at least one hardware processor to perform:\nobtaining a first set of data identifying arterial blood pressure and cerebral blood flow velocity of a patient during a first period of time;\nestimating an initial intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on the first set of data and a prior distribution of intracranial pressure values;\nobtaining a second set of data identifying arterial blood pressure and cerebral blood flow velocity of the patient during a second period of time;\nestimating an updated intracranial pressure value for the patient by determining a change in intracranial pressure of the patient based on the second set of data and the initial intracranial pressure value; and\noutputting information indicating the updated intracranial pressure value.",
        "19. A system comprising:\nat least one hardware processor; and\nat least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by the at least one hardware processor, cause the at least one hardware processor to perform:\nobtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time, wherein the arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient;\nestimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values, wherein using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform; and\noutputting information indicating the updated intracranial pressure value.",
        "20. The system of claim 19, wherein using the statistical model to compute the posterior distribution further comprises aligning in time the arterial blood pressure waveform and the cerebral blood flow velocity waveform.",
        "21. The system of claim 20, wherein aligning the arterial blood pressure waveform and the cerebral blood flow velocity waveform further comprises constraining the alignment, for at least one cardiac cycle, such that a systolic peak in cerebral blood flow velocity occurs prior to a systolic peak in arterial blood pressure.",
        "22. The system of claim 21, wherein aligning the arterial blood pressure waveform and the cerebral blood flow velocity waveform further comprises constraining the alignment, for at least one cardiac cycle, such that a diastolic point in cerebral blood flow velocity occurs at substantially the same time as a diastolic point in arterial blood pressure.",
        "23. The system of claim 20, wherein the at least one hardware processor is further configured to perform:\nselecting the at least one time offset value from a plurality of time offset values based on the alignment of the arterial blood pressure waveform and the cerebral blood flow velocity waveform meeting a set of physiological constraints.",
        "24. The system of claim 23, wherein the set of physiological constraints include that a systolic peak in cerebral blood flow velocity occurs prior to a systolic peak in arterial blood pressure.",
        "25. The system of claim 23, wherein the set of physiological constraints include that a diastolic point in cerebral blood flow velocity occurs at substantially the same time as a diastolic point in arterial blood pressure.",
        "26. The system of claim 19, wherein the statistical model includes at least one of a parameter representing cerebrovascular resistance, a parameter representing cerebrovascular compliance, a parameter representing intracranial pressure, and a parameter representing inertance.",
        "27. The system of claim 19, wherein the statistical model relates arterial blood pressure and cerebral blood flow velocity to intracranial pressure.",
        "28. The system of claim 19, wherein obtaining the data includes obtaining arterial blood pressure and cerebral blood flow velocity of the patient over a plurality of cardiac cycles.",
        "29. The at least one non-transitory computer-readable storage medium of claim 37, wherein the at least one hardware processor is further configured to perform:\nestimating a series of intracranial pressure values for the patient by estimating changes in intracranial pressure of the patient using the statistical model and the data.",
        "30. The at least one non-transitory computer-readable storage medium of claim 29, wherein estimating the series of intracranial pressure values further comprises dynamically updating an estimated intracranial pressure value as data is obtained during a second period of time.",
        "31. The system of claim 19, wherein estimating the initial intracranial pressure value further comprises using the statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and the prior distribution of intracranial pressure values.",
        "32. The system of claim 31, wherein the at least one hardware processor is further configured to perform:\npredicting a set of values for a physiological signal for the patient using the statistical model and the at least one time offset value, the predicting performed at least in part by evaluating a plurality of intracranial pressure values at each of the at least one time offset value;\ngenerating a set of prediction errors by comparing the predicted set of values for the physiological signal to a portion of the data corresponding to the physiological signal; and\ncomputing the likelihood of intracranial pressure based on the set of prediction errors.",
        "33. The system of claim 32, wherein computing the likelihood of intracranial pressure further comprises determining, for each of the at least one time offset value, a likelihood of intracranial pressure distribution for the time offset from a subset of prediction errors associated with using the time offset value in computing the physiological signal.",
        "34. The system of claim 33, wherein computing the likelihood of intracranial pressure further comprises combining the likelihood of intracranial pressure distribution for each of the at least one time offset in determining the likelihood of intracranial pressure.",
        "35. The method of claim 38, wherein estimating the intracranial pressure value further comprises:\ncomputing at least one intracranial pressure value using the data at a time interval within the first period of time;\ndetermining a metric indicative of the level of noise in the data during the time interval; and\nselecting, based on comparing the metric to a threshold value, to include the at least one intracranial pressure value in estimating the intracranial pressure value.",
        "36. The method of claim 38, wherein the prior distribution of intracranial pressure values corresponds to data obtained from at least one person other than the patient.",
        "37. At least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by at least one hardware processor, cause the at least one hardware processor to perform:\nobtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time, wherein the arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient;\nestimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values, wherein using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform; and\noutputting information indicating the updated intracranial pressure value.",
        "38. A method, comprising:\nusing at least one hardware processor to perform:\nobtaining data that includes an arterial blood pressure waveform and a cerebral blood flow velocity waveform of a patient during a first period of time, wherein the arterial blood pressure waveform and the cerebral blood flow velocity waveform are obtained at different locations of the patient;\nestimating an intracranial pressure value for the patient by using a statistical model to compute a posterior distribution of intracranial pressure values based on a likelihood of intracranial pressure given the data and a prior distribution of intracranial pressure values, wherein using the statistical model includes using at least one time offset value between the arterial blood pressure waveform and the cerebral blood flow velocity waveform; and\noutputting information indicating the updated intracranial pressure value."
    ]
}