{
    "id": "US20210088528",
    "authors": [
        "Shaogeng Tang",
        "Peter S. Kim"
    ],
    "title": "METHODS RELATED TO A STRUCTURE OF HIGH-AFFINITY HUMAN PD-1/PD-L2 COMPLEX",
    "date": "2020-04-28 00:00:00",
    "abstract": "Variants of human PD-1 comprising one or more of amino acid substitutions in residues corresponding to N74, T76 and A132 of SEQ ID NO:1 are described. Also described are structures, obtained using X-ray crystallography, of the human PD-1/PD-L2 complex and mutant PD-1 variants. The structures of human PD-1 described in the present disclosure are useful in drug discovery, including small-molecule drug discovery. Accordingly, methods of using the structures in drug discovery are also described.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "STATEMENT AS TO RIGHTS TO INVENTIONS MADE UNDER FEDERALLY SPONSORED RESEARCH AND DEVELOPMENT",
                    "paragraphs": [
                        "This invention was made with Government support under Contracts DA043893 and GM103393 awarded by the National Institutes of Health and DE-AC02-76F00515 awarded by the U.S. Department of Energy. The government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe government rights"
                    ],
                    "num_characters": 245,
                    "outline_medium": [
                        "describe government rights"
                    ],
                    "outline_short": [
                        "describe government rights"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Immune checkpoint blockade of programmed death 1 (PD-1) and its ligand 1 (PD-L1) has dramatically increased progression-free survival for many cancers (1-3). For example, a monoclonal antibody (mAb) drug, pembrolizumab (Keytruda®), received regulatory approval for use in patients with microsatellite instability-high (MSI-H) or mismatch repair deficient (dMMR) solid tumors (4, 5). While mAb drugs inhibiting immune checkpoints are highly useful in oncology, there is a desire for other types of inhibitors of immune checkpoints, such as small-molecules. Small-molecule drugs targeting PD-1 may lead to increases in efficacy and safety of cancer treatment, as well to improved access to cancer treatments."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce immune checkpoint blockade"
                    ],
                    "num_characters": 706,
                    "outline_medium": [
                        "introduce immune checkpoint blockade"
                    ],
                    "outline_short": [
                        "introduce immune checkpoint blockade"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Other than mAbs, compounds targeting human PD-1 so far have been out of reach. Development of human PD-1-binding drugs is hindered by the fact that the ligand-binding surface of human PD-1 is generally flat, lacking identifiable binding pockets that can serve as drug targets during computational screening of small molecule libraries and computational drug modelling efforts. Only a small cavity forms when human PD-1 binds one of its in-vivo ligands, PD-L1. The small volume of the PD-L1 binding cavity in human PD-1 prevents its use for computational modelling of PD-1 interactions with its ligands. While it is known that, in murine PD-1, the PD-L1-binding cavity extends upon binding of a different in-vivo ligand, PD-L2, the cavity of murine PD-1 cannot provide a structural model due to low sequence similarity between human and murine PD-1 proteins. As described in more detail further in the present disclosure, the inventors were able to design a substituted variant of human PD-1 that binds PD-L2 with an affinity that is two orders of magnitude higher than that of the wild-type protein, and to crystallize and, using X-ray crystallography, determine to high resolution the structures of the human PD-1 variant and the complex of the human PD-1 variant with PD-L2. As a result, a prominent pocket on the ligand-binding surface of human PD-1 was identified. The structure of the PD-L2 binding pocket of human PD-1 is described in the present disclosure. The structure of the PD-L2 binding pocket of human PD-1 is useful, for example, in the drug discovery, design and optimization methods, such as, but not limited to, the methods that involve computational (in silico) screening of small molecule libraries for candidate small molecules capable of binding to of the PD-L2 binding pocket of human PD-1, the methods that involve computational identification of ligands capable of interacting with the PD-L2 binding pocket of human PD-1, and any methods that involve computational docking of ligands to the PD-L2 binding pocket of human PD-1. Such methods are included among the embodiments of the present invention and are described in the present disclosure.",
                        "The terms “invention,” “the invention,” “this invention” and “the present invention,” as used in this document, are intended to refer broadly to all of the subject matter of this patent application and the claims below. Statements containing these terms should be understood not to limit the subject matter described herein or to limit the meaning or scope of the patent claims below. Covered embodiments of the invention are defined by the claims, not this summary. This summary is a high-level overview of various aspects of the invention and introduces some of the concepts that are described and illustrated in the present document and the accompanying figures. This summary is not intended to identify key or essential features of the claimed subject matter, nor is it intended to be used in isolation to determine the scope of the claimed subject matter. The subject matter should be understood by reference to appropriate portions of the entire specification, any or all figures and each claim. Some of the exemplary embodiments of the present invention are discussed below.",
                        "Included among the embodiments of the present invention are proteins comprising a ligand binding pocket with a three-dimensional structure corresponding to a structure of PD-L2 binding pocket of a variant of human PD-1 with one or more of amino acid substitutions in residues corresponding to N74, T76 or A132 of SEQ ID NO:1. A variant of human PD-1 can further comprises amino acid substitutions removing one or more N-linked glycosylation sites. In a protein according to the embodiments of the present invention, the one or more of the amino acid substitutions are two or three amino acid substitutions. The amino acid substitutions can be N74G, T76P or A132V. The amino acid substitutions can be N74G, T76P, A132V or A132L. A protein according to the embodiments of the present invention can comprise amino acid substitutions N74G, T76P and A132L. A protein according to the embodiments of the present invention amino acid substitutions N74G and A132V. A protein according to the embodiments of the present invention can be a variant of human PD-1. In a protein according to the embodiments of the present invention, the PD-L2 binding pocket of the variant of human PD-1 can include bound PD-L2. In a protein according to the embodiments of the present invention, a ligand binding pocket can form upon binding of a non-PD-L2 ligand to the protein. The non-PD-L2 ligand can be a small-molecule ligand. In a protein according to the embodiments of the present invention, a binding pocket can exist in the absence of a bound ligand. Embodiments of the present invention encompass crystal forms of the proteins described in the present disclosure.",
                        "Also included among the embodiments of the present invention are variants of human PD-1, wherein the variant of human PD-1 comprising one or more of amino acid substitutions in residues corresponding to N74, T76 and A132 of SEQ ID NO:1. A variant of human PD-1 can be in crystal form. A variant of human PD-1 according to the embodiments of the present invention can include two or three amino acid substitutions. The amino acid substitutions can be N74G, T76P or A132V. In an exemplary embodiment, a variant of human PD-1 includes amino acid substitutions N74G, T76P and A132L. In another exemplary embodiment, a variant of human PD-1 includes amino acid substitutions N74G and A132V. A variant of human PD-1 can further include amino acid substitutions removing one or more N-linked glycosylation sites. A variant of human PD-1 can be capable of binding PD-L2 or be bound to PD-L2.",
                        "Also included among the embodiments of the present invention are methods for identifying a small molecule capable of binding to PD-L2 binding pocket of human PD-1. A method according to the embodiments of the present invention can comprise the steps of: I) screening small molecule libraries using in silico docking for candidate small molecules that are identified based on a docking score being above a threshold for binding to a binding pocket with a three-dimensional structure corresponding to a structure of the PD-L2 binding pocket of human PD-1; and II) evaluating the candidate small molecules identified in step (I) through one or more in vitro or in vivo assays for their ability to bind to surface residues of the PD-L2 binding pocket of human PD-1 to thereby identify the small molecule capable of binding to the PD-L2 binding pocket of human PD-1. In a method, the candidate small molecules can be identified as binding with the PD-L2 binding pocket of human PD-1 via the docking score that includes one or more interactions of (a) to (k): a) the candidate small molecules interact via hydrogen bonds with one or more amino acid residues in the PD-L2 binding pocket of human PD-1; b) the candidate small molecules interact via hydrogen bonds with the PD-L2 binding pocket of human PD-1; c) the candidate small molecules interact via ionic interactions with one or more amino acid residues in the PD-L2 binding pocket of human PD-1; d) the candidate small molecules interact via ionic interactions with the PD-L2 binding pocket of human PD-1; e) the candidate small molecules interact via one or more water molecules with one or more amino acid residues in the PD-L2 binding pocket of human PD-1; f) the candidate small molecules interact via one or more water molecules with the PD-L2 binding pocket of human PD-1; g) the candidate small molecules interact via π-π interactions with one or more amino acid residues in the in the PD-L2 binding pocket of human PD-1; h) the candidate small molecules interact via van der Waals interactions to one or more amino acid residues in the in the PD-L2 binding pocket of human PD-1; i) the candidate small molecules interact via van der Waals interactions with the PD-L2 binding pocket of human PD-1; j) the candidate small molecules interact via steric interactions to one or more amino acid residues in the in the PD-L2 binding pocket of human PD-1; k) the candidate small molecules interact via steric interactions with the PD-L2 binding pocket of human PD-1. In some embodiments, the candidate small molecules are not endogenous ligands of human PD-1. In some embodiments, the candidate small molecules have 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 or 11 of the interactions (a)-(k). In some embodiments, the candidate small molecules bind via 1-20 hydrogen bonds to one or more amino acid residues in the PD-L2 binding pocket of human PD-1. In some embodiments, the candidate small molecules bind via 1-20 hydrogen bonds to the PD-L2 binding pocket of human PD-1. In some embodiments, the candidate small molecules bind via 1-20 water molecules in the PD-L2 binding pocket of human PD-1. In some embodiments, the candidate small molecules bind via 1-20 water molecules to one or more amino acid residues in the PD-L2 binding pocket of human PD-1. In some embodiments, a model of the structure of the PD-L2 binding pocket of human PD-1 is computationally derived from crystallographic data. In some embodiments, model of the PD-L2 binding pocket of human PD-1 is computationally derived from crystallographic data obtained using crystals of a variant of human PD-1 according to the embodiments of the present invention and described elsewhere in the present disclosure. In some embodiments of the methods, in silico docking comprises computational docking three-dimensional structures of small molecules from the small molecule libraries onto surface exposed amino acid residues of the model of the PD-L2 binding pocket of human PD-1. In some embodiments, the surface exposed amino acid residues comprise one or more amino acids corresponding to F63, V64, N66, Y68, E84, L122, I126, I134 or E136 of SEQ ID NO:1. In some embodiments, the computational docking comprises sampling, scoring, and binning of docking scores of a plurality of docked orientations of the small molecules relative to the model of the PD-L2 binding pocket of human PD-1. In some embodiments, the computation docking further comprising assigning a distance cutoff to match atoms of the small molecules to exposed atoms of the PD-L2 binding pocket of human PD-1. The exposed atoms can include one or more of CB of F63, CE1 of F63, CD1 of F63, CE1 of F63, CG2 of V64, CG2 of V64, O of V64, ND2 of N66, ND2 of N66, CE1 of Y68, OH of Y68, OE1 of E84, OE2 of E84, OE2 of E84, OE1 of E84, OE2 of E84, OE1 of E84, CD1 of L122, CG2 of I126, CD1 of I126, CD1 of I126, CG2 of I126, CD1 of I126, CB of I134, CG1 of I134, CG1 of I134, CD1 of I134, CD1 of I134, OE2 of E136, OE2 of E136 or OE2 of E136, wherein numbering of amino acids containing the exposed atoms is based on SEQ ID NO:1. In some embodiments, the scoring comprises determining, for complexes of the small molecules and the PD-L2 binding pocket of human PD-1, one or more of binding forces, configurational entropy, local minimal in Gibbs free energy landscape, or energy barriers between the local minima of the Gibbs free energy landscape, or combinations of two or more thereof.",
                        "Also described herein and included among the embodiments of the present invention are in silico method of identifying a compound that binds to PD-L2 binding pocket of human PD-1. The methods can comprise the steps of: (a) receiving, by a computer system, information on a three-dimensional structure of PD-L2 binding pocket of human PD-1 comprising a plurality of amino acids; (b) receiving, by the computer system, information on a three-dimensional structure of a candidate compound; (c) using the computer system and the information received into the computer system in steps (a) and (b), performing one or more of molecular dynamic simulations, kinetic Monte Carlo (KMC) simulations, direct simulations Monte Carlo (DSMC), or density functional theory (DFT) simulations to determine if the candidate compound binds to the PD-L2 binding pocket of human PD-1, thereby identifying the compound that binds to PD-L2 binding pocket of human PD-1. In the above methods, the three-dimensional structure of the PD-L2 binding pocket of human PD-1 can be computationally derived from crystallographic data. The crystallographic data can be obtained using crystals of a variant of human PD-1 according to the embodiments of the present invention and described elsewhere in the present disclosure. In a method according to the embodiments of the present invention, step (c) can include computational docking of small molecules from small molecule libraries onto surface exposed amino acid residues of the three-dimensional structure of the PD-L2 binding pocket of human PD-1. The surface exposed amino acid residues can include one or more amino acids corresponding to F63, V64, N66, Y68, E84, L122, I126, I134 or E136 of SEQ ID NO:1. In a method according to the embodiments of the present invention, step (c) can include determining, using the computer system, a docking score of the candidate compound to the PD-L2 binding pocket of human PD-1. The determining of the docking score can include sampling, scoring and binning of docking scores of a plurality of docked orientations of the small molecules relative to the model of the PD-L2 binding pocket of human PD-1, and assigning a distance cutoff to match atoms of the small molecules to exposed atoms of the PD-L2 binding pocket of human PD-1. The exposed atoms can include one or more of CB of F63, CE1 of F63, CD1 of F63, CE1 of F63, CG2 of V64, CG2 of V64, O of V64, ND2 of N66, ND2 of N66, CE1 of Y68, OH of Y68, OE1 of E84, OE2 of E84, OE2 of E84, OE1 of E84, OE2 of E84, OE1 of E84, CD1 of L122, CG2 of I126, CD1 of I126, CD1 of I126, CG2 of I126, CD1 of I126, CB of I134, CG1 of I134, CG1 of I134, CD1 of I134, CD1 of I134, OE2 of E136, OE2 of E136 or OE2 of E136, wherein numbering of amino acids containing the exposed atoms is based on SEQ ID NO:1. In a method according to the embodiments of the present invention, step (c) can include determining, for the complexes of the compound and the PD-L2 binding pocket of human PD-1, one or more of binding forces, configurational entropy, local minimal in Gibbs free energy landscape or energy barriers between the local minima of the Gibbs free energy landscape, or combinations of two or more thereof.",
                        "Also included among the embodiments of the present invention are methods for identifying interactions between a ligand and a PD-L2 binding pocket of human PD-1. A method according to the embodiments of the present invention cam comprise the steps of: (a) receiving, by a computer system, test ligand molecular data corresponding to a test ligand that is a candidate drug; (b) receiving, by the computer system, protein molecular data corresponding to a three-dimensional structure of PD-L2 binding pocket of human PD-1; (c) calculating an interaction score between the PD-L2 binding pocket of human PD-1 and the candidate drug. In A method according to the embodiments of the present invention can further comprise a step of comparing the interaction score to a threshold score to determine whether or not an interaction exists between the PD-L2 binding pocket of human PD-1 and the candidate drug. An interaction score can be determined for each of a plurality of test ligands, including the test ligand, and the method can further comprise the steps of: determining a ranking the plurality of the interactions scores; and comparing the ranking of the test ligand to a threshold to determine whether or not an interaction exists between the PD-L2 binding pocket of human PD-1 and the candidate drug. In a method according to the embodiments of the present invention, step (c) can include performing one or more of molecular dynamic simulations, kinetic Monte Carlo (KMC) simulations, direct simulations Monte Carlo (DSMC), or density functional theory (DFT) simulations, or combinations of two or more thereof. In a method according to the embodiments of the present invention, step (c) can include determining, for the complexes of the test ligand and the PD-L2 binding pocket of human PD-1, one or more of binding forces, configurational entropy, local minimal in Gibbs free energy landscape, or energy barriers between the local minima of the Gibbs free energy landscape. In a method according to the embodiments of the present invention, the three-dimensional structure of the PD-L2 binding pocket of human PD-1 is computationally derived from crystallographic data. The crystallographic data can be obtained using crystals of a variant of human PD-1 according to the embodiments of the present invention and described elsewhere in the present disclosure. In a method according to the embodiments of the present invention, step (c) can include computational docking of small molecules from the small molecule libraries onto surface exposed amino acid residues of the model of the PD-L2 binding pocket of human PD-1. The surface exposed amino acid residues can comprise one or more amino acids corresponding to F63, V64, N66, Y68, E84, L122, I126, I134 or E136 of SEQ ID NO:1. In a method according to the embodiments of the present invention, step (c) can include determining, using the computer system, a docking score of the candidate compound to the PD-L2 binding pocket of human PD-1. The determining of the docking score can include sampling, scoring and binning of docking scores of a plurality of docked orientations of the small molecules relative to the model of the PD-L2 binding pocket of human PD-1, and assigning a distance cutoff to match atoms of the small molecules to exposed atoms of the PD-L2 binding pocket of human PD-1. The exposed atoms can include one or more of CB of F63, CE1 of F63, CD1 of F63, CE1 of F63, CG2 of V64, CG2 of V64, O of V64, ND2 of N66, ND2 of N66, CE1 of Y68, OH of Y68, OE1 of E84, OE2 of E84, OE2 of E84, OE1 of E84, OE2 of E84, OE1 of E84, CD1 of L122, CG2 of I126, CD1 of I126, CD1 of I126, CG2 of I126, CD1 of I126, CB of I134, CG1 of I134, CG1 of I134, CD1 of I134, CD1 of I134, OE2 of E136, OE2 of E136 or OE2 of E136, wherein numbering of amino acids containing the exposed atoms is based on SEQ ID NO:1.",
                        "In some embodiments of the methods described in the present disclosure, a candidate compound, such as a candidate small molecule, can be a candidate anti-cancer drug. The methods can therefore include testing the candidate anti-cancer drug in an in vitro or in vivo assay to determine its anti-cancer efficacy. The methods can also include determining toxicity of the candidate anti-cancer drug. The methods can also include determining if the candidate anti-cancer drug has an off-target effect. The toxicity or the off-target effect can be determined by an in vitro assay, by an in vivo assay, in silico, or by a combination of two or more thereof. The methods can also include optimizing the candidate anti-cancer drug. For example, the candidate anti-cancer drug can be optimized to one or more of: reduce an off-target effect, reduce toxicity, increase or decrease binding affinity for the PD-L2 binding pocket of human PD-1, decrease binding affinity for the PD-L2 binding pocket of human PD-1. Also included among the embodiments of the present invention are computer products comprising a non-transitory computer readable medium storing a plurality of instructions that when executed control a computer system to identity protein-drug interactions by performing the methods according to the embodiments of the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce PD-1 inhibitors",
                        "describe limitations of mAb drugs",
                        "motivate small-molecule inhibitors",
                        "describe PD-L1 binding cavity",
                        "introduce substituted variant of human PD-1",
                        "describe crystallization and X-ray crystallography",
                        "identify prominent pocket on ligand-binding surface",
                        "describe structure of PD-L2 binding pocket",
                        "introduce drug discovery methods",
                        "describe computational screening",
                        "describe computational identification of ligands",
                        "describe computational docking",
                        "introduce proteins with ligand binding pocket",
                        "describe amino acid substitutions",
                        "describe removal of N-linked glycosylation sites",
                        "introduce variants of human PD-1",
                        "describe crystal forms of proteins",
                        "introduce methods for identifying small molecules",
                        "describe in silico docking",
                        "describe evaluation of candidate small molecules",
                        "describe interactions with PD-L2 binding pocket",
                        "describe hydrogen bonds",
                        "describe ionic interactions",
                        "describe water-mediated interactions",
                        "describe π-π interactions",
                        "describe van der Waals interactions",
                        "describe steric interactions",
                        "describe non-endogenous ligands",
                        "describe binding forces",
                        "describe configurational entropy",
                        "describe Gibbs free energy landscape",
                        "describe energy barriers",
                        "introduce in silico method",
                        "describe molecular dynamic simulations",
                        "describe kinetic Monte Carlo simulations",
                        "describe direct simulations Monte Carlo",
                        "describe density functional theory simulations",
                        "describe computational docking",
                        "describe scoring and binning"
                    ],
                    "num_characters": 19651,
                    "outline_medium": [
                        "introduce PD-1 inhibitors",
                        "describe limitations of mAbs",
                        "describe need for small-molecule inhibitors",
                        "introduce PD-L2 binding pocket",
                        "describe structure of PD-L2 binding pocket",
                        "introduce variants of human PD-1",
                        "describe PD-L2 binding pocket of variants",
                        "introduce methods for identifying small molecules",
                        "describe in silico docking",
                        "describe evaluating candidate small molecules",
                        "introduce interactions with PD-L2 binding pocket",
                        "describe hydrogen bonds",
                        "describe ionic interactions",
                        "describe water-mediated interactions",
                        "describe π-π interactions",
                        "describe van der Waals interactions",
                        "describe steric interactions",
                        "introduce in silico method for identifying compounds",
                        "describe computational docking"
                    ],
                    "outline_short": [
                        "introduce PD-1 inhibitors",
                        "describe limitations of current inhibitors",
                        "introduce human PD-1 variant",
                        "describe PD-L2 binding pocket",
                        "introduce protein embodiments",
                        "introduce method embodiments",
                        "describe in silico method",
                        "describe interactions between ligand and PD-L2 binding pocket",
                        "introduce computer products"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "PD-1 is a receptor expressed by T cells, B cells, and monocytes, and is a potent regulator of immune responses (16). PD-1 is an attractive target for anti-cancer pharmaceuticals. PD-1 has two known protein ligands in vivo, PD-L1 and PD-L2, which bind to the same region on the surface of PD-1. It would be desirable to identify other ligands, including, but not limited to small molecule compounds, that would bind to this region of human PD-1 and interfere with its binding to PD-L1 and/or PD-L2. Such ligands, once identified, may be used as lead compounds for drug development and tested for potential biological activity, such as anti-cancer activity, by suitable in vitro and/or in vivo assays. However, it is currently impossible to identify in silico the ligands that would specifically and efficiently bind to PD-1 ligand-binding site, because the PD-1 ligand-binding site lacks a defined binding pocket in the absence of its in vivo ligands. Although the structure of human PD-1/PD-L1 complex has been determined, and a model of PD-L1 binding cavity of human PD-1 exists, the volume of PD-1 binding cavity in the above model is too small for the model to be used effectively in computational studies of PD-1/ligand interactions. As a consequence, until the discoveries described in the present disclosure, effective computational of PD-1/ligand interactions were intractable, making it impossible, for example, to pre-select a reasonable number of lead ligands, such as small-molecule compounds for further testing with in vitro and/or in vivo assays for PD-1 signaling in order to identify biologically active ligands that can be used as drug candidates in pre-clinical and/or clinical testing. The absence of a model of binding PD-1/PD-L1 binding cavity also prevented in silico rational drug design and optimization studies.",
                        "The available structures of murine PD-1/PD-L1 and PD-1/PD-L2 complexes showed that a modest binding cavity was formed upon PD-L1 binding, and the cavity extended to a volume suitable for small-molecule ligands only upon PD-L2 binding to murine PD-1. However, the model of the structure of murine PD-1/PD-L2 complex is unsuitable for human drug development due to low sequence similarity between the human and murine PD-1 proteins. Since human PD-1 protein has a very mobile structure, all the multiple previous attempts to crystalize human PD-1/PD-L2 complex and determine the structure of PD-1 ligand binding pocket failed. As described in the present disclosure, the inventors were able to stabilize the structure of PD-1/PD-L2 complex by mutating several residues in two mobile loops (CC′ and FG) of PD-1, which increased the affinity of PD-1 for PD-L2. The inventors were then able to crystallize the PD-1/PD-L2 complex and determine the structure of the PD-L2 binding pocket. The model of the structure of human PD-1/PD-L2 binding pocket can now be used for drug discovery and development. One non-limiting example of the drug discovery and development process in which the structure of human PD-1/PD-L2 binding pocket can be used, is a process that involves computational screening of compounds to identify PD-1 ligands (“leads”). In the above process, screened compounds can be small molecules. For example, libraries of small compounds (small-molecule libraries) can be computationally screed according to various procedures, some of which are described in the present disclosure, to identify candidate small molecules capable of binding to a PD-L2 binding pocket of human PD-1. Based on the results of the computational screening, potential leads can be tested by appropriate in vitro and/or in vivo testing to identify the compounds that affect PD-1 signaling. Another non-limiting example in which the structure of human PD-1/PD-L2 binding pocket can be used is a process that involves computational design and testing of candidate ligands (“leads”), which can subsequently be tested by appropriate in vitro and/or in vivo testing to identify the compounds that affect PD-1 signaling. Prior to the determination of the structure, described in the present disclosure, of human PD-1/PD-L2 binding pocket, it was impossible to identify computationally (in silico) the leads for subsequent in vitro and/or in vivo testing identify the compounds that affect PD-1 signaling. Although in vitro and/or in vivo testing without prior in silico lead identification was theoretically possible, it was, in practice, unworkable due to the high costs (including monetary, time, labor and animal lives required for the testing) that would be required to test large numbers of essentially randomly selected compounds with low probability of success. The discoveries described in the present disclosure permit carrying out the processes related to drug discovery, such as, but not limited to, screening of small molecules and rational drug design, in which in vitro and/or in vivo testing of lead compounds can be implement practically and effectively due to the now available capability to perform the initial steps of lead screening and/or design computationally, thereby drastically reducing the number of the leads that need to be tested in vitro and/or in vivo to identify biologically active PD-1 ligands that can serve as drug candidates in subsequent pre-clinical and clinical testing.",
                        "An exemplary amino acid sequence of human PD-1 protein is shown as SEQ ID NO:1. The present disclosure describes, among other things, structures of the human triple-mutant PD-1/PD-L2 complex and the apo triple-mutant PD-1 variant obtained using X-ray crystallography at 2.0 Å and 1.2 Å resolution, respectively. The structures described in the present disclosure revealed that binding of PD-L2 to human PD-1 was accompanied by formation of a prominent pocket in human PD-1, as well as substantial conformational changes of the CC′ and FG loops. The structure of human apo triple-mutant PD-1 revealed that the CC′ loop adopted the ligand-bound conformation, providing support for allostery between the loop and pocket. The structures of human PD-1/PD-L2 described in the present disclosure are useful for design and discovery of small-molecule PD-1 inhibitors. While mAb drugs inhibiting immune checkpoints, such as pembrolizumab, are highly useful in oncology, small-molecule inhibitors of immune checkpoints are highly desirable. Small molecule inhibitors are expected to penetrate more effectively than mAbs in the tumor microenvironment, which can enhance their efficacy (6). In addition, if penetration into the brain is desired, small molecule inhibitors can be effective (7, 8). Also, there are rare but severe immune-related side effects of checkpoint inhibition that call for immediate drug discontinuation (9, 10). Since mAbs have long half-lives in the body (typically, weeks) (11), the treatment of such severe immune-related side effects is primarily supportive. Small-molecule checkpoint inhibitors can offer the potential for convenient dosing (e.g., once a day), while allowing for prompt drug removal, if desired (12). Small-molecule immune checkpoint inhibitors can facilitate treatment of cancers in low- and middle-income countries by reducing production costs and eliminating the need for refrigeration during transportation and storage, as compared to mAbs (13). Despite substantial efforts, currently there are no well-characterized small-molecule ligands for PD-1 (14, 15).",
                        "In vivo, PD-1 binds two distinct ligands, PD-L1 (also known as B7-H1 or CD274) and PD-L2 (also known as B7-DC) (16). The ligand-binding surface of human PD-1 is generally flat, lacking pockets considered suitable for binding small molecules (16). However, upon binding to PD-L1, a modest cavity forms on the ligand binding surface of PD-1 (17). A similar cavity is formed in murine PD-1 upon binding PD-L1 (18). When murine PD-1 binds PD-L2 (19), this cavity extends to a volume comparable to that occupied by established small-molecule inhibitors (20, 21). Unfortunately, currently available structure of murine PD-1/PD-L2 complex is insufficient to provide a structural model for the analogous pocket in the human PD-1/PD-L2 complex, as the human and murine PD-1 proteins share sequence identities of only about 63% (22). Although the structure of murine PD-1/PD-L2 complex was determined over a decade ago, the structure of the human complex has not yet been obtained due to various difficulties. Previous attempts to obtain diffraction-quality crystals of human PD-1/PD-L2 complex were unsuccessful.",
                        "The inventors realized that formation of cavities on the ligand-binding surface of PD-1 is accompanied by changes in the structures of the CC′ and FG loops. The inventors further realized that substitutions in these loops can have an allosteric effect on the conformations of PD-1 in the pocket region and alter its affinity for PD-L2. Using deep-mutational scanning (24) and yeast-surface display (25), the CC′ and FG loop variants of human PD-1 with enhanced PD-L2 binding were selected. A triple-mutant PD-1 was identified that binds PD-L2 with nanomolar affinity and is amenable to crystallization, both alone and as a complex. The formation of a prominent pocket in human PD-1 upon binding PD-L2 revealed by the X-ray crystal structures described in the present disclosure supports the notion of allostery between the pocket and the CC′ and FG loops. The pocket identified in human PD-1 can serve as a template for virtual drug discovery (26) and opens up additional avenues for the discovery of small-molecule PD-1 inhibitors.",
                        "The prominent pocket formed in human PD-1 upon binding PD-L2 has a volume of 130 Å3, comparable to those pockets that bind small-molecule drugs (20, 21, 35). The structure of the pocket in human PD-1 described in the present disclosure is quite distinct from the corresponding pocket in murine PD-1 when bound to PD-L2 (19). The pocket in human PD-1 described in the present disclosure represents an attractive drug target. It is envisioned that a small molecule binding to PD-1 contacting all or many of the residues that form the pocket, particularly F63, V64, N66, Y68, E84, L122, G124, I126, I134, and E136 in a conformation similar to that formed in the complex with PD-L2, as illustrated in FIG. 2B. The structure of human PD-1/PD-L2 complex is useful for virtual drug screening to identify potential lead compounds (see e.g., (26)). In addition, the structures of the indole and phenyl rings and neighboring sidechains of PD-L2 when bound to the pocket, as illustrated in FIG. 2C, are useful for the design of fragment-based screening scaffolds (36, 37).",
                        "Conformational changes in the CC′ and FG loops can be coupled to formation of pockets in the ligand-binding interface of PD-1 (FIG. 3). In this model, PD-1 exists in an ensemble of conformations in the absence of ligands, populating predominantly structures containing a flat ligand-binding face (K1<1). PD-1 molecules with a pre-formed pocket have a higher affinity for PD-L2 (i.e., K3>K2). Thermodynamics dictates that K1K3=K2K4, so K4>K1. In this model, the PD-1 loop variants studied here increase K1, and lead to a higher proportion of apo-PD-1 in the PD-L2-bound conformation. The increased association constants (kon) for binding ligands by the mutant PD-1s, as compared to wild-type PD-1 support this model. Such kinetic properties are consistent with an increase fraction of unliganded mutant PD-1 molecules that are in a ligand-bound conformation as compared to wild-type PD-1 (38, 39). In addition, the CC′ loop shifts toward the PD-L2-bound conformation in the apo-PD-1 triple and double mutants. While there are only minimal changes in the pocket of human PD-1, as illustrated in FIG. 2A, the pocket residues and a neighboring FG loop have substantial crystal contacts in the lattice that likely interfere with conformational changes. Such coupling can stabilize the pocket in the absence of a ligand, for example, if the two loops were held in their PD-L2-bound conformations with antibodies or aptamers. Thus, the structures of human PD-1 described in the present disclosure are useful in drug development, such as, but not limited, to small-molecule drug discovery, such as by high-throughput screening (40, 41), and rational drug design. The structures described in the present disclosure can be used to discover, design and/or optimize PD-1 ligands, including small-molecule ligands, and can also be used in the discovery of allosteric regulators of PD-1 activity."
                    ],
                    "subsections": [
                        {
                            "title": "Terms and Concepts",
                            "paragraphs": [
                                "A number of terms and concepts are discussed below. They are intended to facilitate the understanding of various embodiments of the invention in conjunction with the rest of the present document and the accompanying figures. These terms and concepts may be further clarified and understood based on the accepted conventions in the fields of the present invention. the description provided throughout the present document and/or the accompanying figures. Some other terms can be explicitly or implicitly defined in other sections of this document and in the accompanying figures, and may be used and understood based on the accepted conventions in the fields of the present invention, the description provided throughout the present document and/or the accompanying figures. The terms not explicitly defined can also be defined and understood based on the accepted conventions in the fields of the present invention and interpreted in the context of the present document and/or the accompanying figures.",
                                "Further, unless otherwise required by context, singular terms shall include pluralities and plural terms shall include the singular. Generally, nomenclatures used in connection with, and techniques of, cell and tissue culture, molecular biology, immunology, microbiology, genetics and protein and nucleic acid chemistry are those well-known and commonly used. Known methods and techniques are generally performed according to conventional methods well known and as described in various general and more specific references that are discussed throughout the present disclosure, unless otherwise indicated. For example, enzymatic reactions and purification techniques are performed according to manufacturer's specifications, as commonly accomplished. The nomenclatures used in connection with the laboratory procedures and techniques described in the present disclosure are those well-known and commonly used.",
                                "As used herein, the terms “a”, “an”, and “the” can refer to one or more unless specifically noted otherwise.",
                                "The use of the term “or” is used to mean “and/or” unless explicitly indicated to refer to alternatives only or the alternatives are mutually exclusive, although the disclosure supports a definition that refers to only alternatives and “and/or.” As used herein “another” can mean at least a second or more.",
                                "As used herein, the amino acid residues are abbreviated as follows: alanine (Ala; A), asparagine (Asn; N), aspartic acid (Asp; D), arginine (Arg; R), cysteine (Cys; C), glutamic acid (Glu; E), glutamine (Gln; Q), glycine (Gly; G), histidine (His; H), isoleucine (Ile), leucine (Leu), lysine (Lys; K), methionine (Met; M), phenylalanine (Phe; F), proline (Pro; P), serine (Ser; S), threonine (Thr; T), tryptophan (Trp; W), tyrosine (Tyr; Y), and valine (Val; V). In the broadest sense, the naturally occurring amino acids can be divided into groups based upon the chemical characteristic of the side chain of the respective amino acids. By “hydrophobic” amino acid is meant either His, Leu, Met, Phe, Trp, Tyr, Val, Ala, Cys or Pro. By “hydrophilic” amino acid is meant either Gly, Asn, Gln, Ser, Thr, Asp, Glu, Lys, Arg or His. This grouping of amino acids can be further sub-classed as follows: by “uncharged hydrophilic” amino acid is meant either Ser, Thr, Asn or Gln. By “acidic” amino acid is meant either Glu or Asp. By “basic” amino acid is meant either Lys, Arg or His.",
                                "The term “variant,” when used in the present disclosure in reference to a protein or a polypeptide, encompasses homologues, variants, isoforms, fragments, mutants, modified forms and other variations of the protein, polypeptide or amino acid sequences described in this document. The term “homologous,” “homologues” and other related terms used in this document in reference to various amino acid, are intended to describe a degree of sequence similarity among amino acid sequences, calculated according to an accepted procedure. Homologous sequences may be at least 60%, 65%, 70%, 75%, 80%, 85%, 90%, 91%, 92%, 93%, 94%, 95%, 96%, 97%, 98% 99% or 100% homologous. As used herein, “percent homology” of two amino acid sequences is determined using the algorithm of Karlin and Altschul, which is incorporated into the NBLAST and XBLAST programs, available for public use through the website of the National Institutes of Health (U.S.A.). To obtain gapped alignments for comparison purposes, Gapped BLAST is utilized. When utilizing BLAST and Gapped BLAST programs, the default parameters of the respective programs (e.g.,)(BLAST and NBLAST) are used. “Percent homology” may be used in this document to describe fragments, variants or isoforms of amino acids sequences, but other ways of describing fragments, variants or isoforms may be employed alternatively to or in conjunction with homology.",
                                "The term “ligand” and the related terms used in the present disclosure refer to a compound or compounds that form a complex with PD-1 protein. The term “ligand” encompassess all compounds, regardless of their size or origin. For example, inorganic molecules, organic molecules, small molecules, biological molecules, non-biological molecules are all encompassed by the term “ligand.”",
                                "The term “interaction” and the related terms refer to a type of physical or chemical interaction of one or more molecular subsets with itself (intramolecular) or other molecular subsets (intermolecular) or with components of an environment (environmental). Interaction types may be either enthalpic or entropic in nature and may reflect either nonbonded or bonded interactions. Examples of nonbonded interaction types include, but are not limited to, electrostatic interactions, van der Waals (or dispersion) interactions between time-varying dipole moments (often related to steric complementarity), short range repulsion between overlapping atomic orbitals, hydrogen bonding, interactions involved with metal ion coordination, or interactions with one or more ordered or structural waters. Other examples of nonbonded interaction types may also include one or more solvation effects such as electrostatic desolvation (including self-reaction field polarization effects, solvent screening in a dielectric medium or interactions with a solvent-based ionic atmosphere), the hydrophobic effect, cavitation energy, and surface tension. Examples of bonded interactions include, but are not limited to, the intramolecular strain associated with distortions of equilibrium bond lengths, angles, torsions, etc., or the energy gap between cis-trans modes or the energy differential associated with changes in chirality of one or more chiral center. Examples of entropic-based interactions include the loss of conformational entropy of molecular subsets (including loss of rotameric entropy for protein side chains) upon binding or the favorable entropy gain obtained by the release of one or more ordered waters. Other more exotic interaction types may include π-π stacking, charge transfer, or other quantum mechanical phenomena.",
                                "The term “hydrogen-bonding,” “hydrogen bonds,” and related terms relate to a partially electrostatic attraction between a hydrogen (H) which is bound to a more electronegative atom such as nitrogen (N) or oxygen (O) and another adjacent atom bearing a lone pair of electrons. For example, when it is stated that the nitrogen acts as a “hydrogen bond donor” it means that a hydrogen (H) bound to a nitrogen (N) is donated by the nitrogen as it electrostatically attracted to or accepted by an adjacent atom bearing a lone pair of electrons such as an oxygen. Similarly, when it is stated that an oxygen acts as a “hydrogen bond acceptor,” it means that a hydrogen (H) bound to a more electronegative atom such as nitrogen (N) is electrostatically attracted to or “accepted by” an adjacent atom such as oxygen bearing a lone pair of electrons. Sometimes the hydrogen bonded atoms are called out without explicitly stating the origin and presence of an intermediate hydrogen atom. The term “hydrogen bonding” is used wherever LigPlot Plus software predicts a hydrogen bonding interaction using its algorithm and applied parameters of 3.35 Å for maximum distance between hydrogen bond donor and acceptor. Not all hydrogen bonds may actually be in place simultaneously; this is evident for atoms that are shown to form 4 putative hydrogen bonds, where however, at any given time only 3 hydrogen bonds are chemically possible. In general, although crystal structures such as the co-crystal structural information herein does not directly show or detect hydrogen bonding, the software used to describe the co-crystal does predict such H-bonding exists. Therefore, throughout the disclosure when a H-bond is present and described, it may be said to be “predicted” by software to be present.",
                                "The term “ionic bonding” and related terms include a type of chemical bond that involves the electrostatic attraction between oppositely charged ions, and is the primary interaction occurring in ionic compounds.",
                                "The term “van der Waals interaction” and related terms include weak, short-range electrostatic attractive forces between uncharged molecules, arising from the interaction of permanent or transient electric dipole moments.",
                                "The term “π-π interaction or π-π stacking” and related terms include attractive, noncovalent interactions between aromatic rings that are oriented either roughly parallel or roughly perpendicular (such as in “edge-face” interactions) to each other, since they contain 7C bonds.",
                                "The term “steric interactions,” “steric effects” and the related terms describe molecular and/or atomic interactions that may arise in a number of ways. Steric effects are described, for example, in (48). For example, steric effects may result from repulsions between valence electrons or nonbonded atoms, leading to in an increase in the energy of the system. In the formation of a ligand-receptor complex, any group of atoms that is in van der Waals contact with the receptor or the biomolecule can be or is involved in the binding event. If a ligand binding pocket can adjust to any ligand, then no steric effect will be observed. If, however, the binding pocket has limited conformational flexibility, and this flexibility is not equivalent in all directions, then a steric effect will be observed. The steric effect will be dependent on conformational states, and the minimal steric interaction principle will probably be observed. This principle states that a substituent whose steric effect is conformationally variable will prefer a conformation that minimizes steric repulsions and will give rise to the smallest steric strain.",
                                "The term “binding site” and related terms refer to an area on the protein wherein a small molecule can interact with such as a region, which can be located on the surface or interior of the protein molecule. The term “pocket,” “binding pocket” or related terms can refer to a cavity on the surface or in the interior of a protein molecule that possesses suitable properties for binding a ligand. Amino acid and other residues (such as co-factors) around a pocket determine its physicochemical characteristics. Residues outside the binding site can also have a long-range effect on the properties of the binding pocket. Binding pocket can have a concave surface presenting amino acid residues in a suitable configuration for binding low molecular weight compounds (which can be referred to as “small molecules”). The mobility of a protein molecule can permit opening, closing, and adaptation of binding pockets to regulate binding processes. The influence of protein flexibility on binding pockets can vary from small changes to an already existent pocket to the formation of a completely new pocket. Pockets and binding sites are described, for example, in (47).",
                                "Typically, a set of appropriate molecular descriptors describing each distinct configuration will be used to distinguish one configuration from another. Molecular descriptors may include, but are not limited to, a) chemical descriptors (e.g., element, atom type, chemical group, residue, bond type, hybridization state, ionization state, tautomeric state, chirality, stereochemistry, protonation, hydrogen bond donor or acceptor capacity, aromaticity, etc.); b) physical descriptors (e.g., charge, both formal and partial, mass, polarizability, ionization energy, characteristic size parameters, such as van der Waals [vdW] radii, vdW well depths, hydrophobicity, hydrogen bonding potential parameters, solubility, equilibrium bond parameters relating bond energies to bond geometries, etc.); c) geometrical descriptors (e.g., atomic coordinates, bond vectors, bond lengths, bond angles, bond torsions, suitable structural descriptors for rings, descriptors for molecular surfaces and volumes, such as solvent accessible surfaces and solvent-excluded volumes, etc.); and d) environmental descriptors (e.g., temperature, pH, ionic strength, pressure, etc.). Chemical descriptors may be assigned based on application of one or more rules or concepts of organic (or inorganic, if appropriate) chemistry to represent chemical structures that must at least stipulate basic structural information such as element type and bond connectivity (i.e., minimally which nonhydrogen atoms are connected to one another) but may also contain some form of coordinate information. Such chemical structures may be stored and received in a number of different data representations. One common example of data representation, though many others are also possible, is that of a PDB file. Examples of currently available software programs that can be used to assign chemical descriptors include SYBYL™ from Tripos, Chimera™ from UCSF, and WhatIf′ (for proteins), etc. Correct assignment of chemical descriptors may also include additional input regarding chiral centers and stereochemistry or even environmental factors, such as expected pH as related to assignment of ionization states.",
                                "The term “affinity formulation” and the related term refer to the energy model used to calculate approximate quantitative values for a given interaction type for a configuration associated with a molecular combination. Typically, there may be many different affinity formulations for a given interaction type from which to choose. The choice of affinity formulation may affect the amount of error associated with the quantitative approximation of a given interaction type. The choice of affinity formulation may also involve very different levels of modeling sophistication and hence computational complexity. A given affinity formulation may require one or more molecular descriptors for evaluation. Two different affinity formulations for a given interaction type may require a very different set of molecular descriptors, while others may share multiple molecular descriptors in common. For example, electrostatic interactions may be modeled according to an affinity formulation involving the use of a modified form of Coulomb's law with distance-dependent dielectric function as applied to a set of partial charges assigned to atomic centers in each molecular subset via use of a suitable force field. In another example, both electrostatic and electrostatic desolvation interactions may be modeled according to an affinity formulation involving a solution of the Poisson-Boltzmann equation (linear or nonlinear) along with an assumption of point charges embedded in solute spherical cavities with size defined by van der Waal radius of each atom and the solute spheres placed in a homogeneous dielectric medium representing water with and possibly containing an ionic atmosphere. Alternatively, electrostatic interactions may be modeled based on quantum-mechanical solution of electronic ground states for each molecular subset. In most scenarios the modified Coulomb with distance-dependent dielectric formulation will be cheaper to compute but less accurate than a Poisson-Boltzmann-based formulation let alone a full quantum-mechanical solution. As further examples, van der Waals interactions may be modeled according to an affinity formulation based on use of a generalized Lennard-Jones potential or alternatively based on a steric complementarity. Hydrogen-bonding interactions may be modeled according to an affinity formulation based on use of a 12-10 Lennard-Jones potential with an angular weighting function or by rescaling of partial charges and van der Waals radii of hydrogen bond donor and acceptor atoms such as that found in the Amber force field. The hydrophobic effect may be modeled according to an affinity formulation based on the fragmental volume approach or the solvent accessible surface area-based formalism. Intramolecular strain associated with dihedral changes may be modeled according to an affinity formulation based on use of Pitzer potentials or by inverse Gaussian torsional constraints. As yet another example, instead of using a Poisson Boltzmann-based formulation, electrostatic desolvation for a configuration may be modeled via an affinity formulation based on use of a variant of the Generalized Born approximation.",
                                "The term “computation strategy” herein refers to the computational technique used to quantitatively evaluate a given affinity formulation for one or more interaction types. The choice of computation strategy may be influenced by the available computational systems, apparatus, means and/or methods, the available memory capacity, and/or computing time constraints. As an example of different computational strategies for the same affinity formulation, consider the electrostatic interaction for target-ligand combination, for which a modified Coulombic affinity formulation with distance-dependent dielectric may be computed according to a computation strategy involving direct summation of pair-wise calculation between all possible pairs of partial charges across the protein and ligand. For a ligand with 100 atoms and a protein with 3000 atoms, this would entail the calculation of 300 K intermolecular distances let alone the number of distinct intramolecular pairs. An alternative computation strategy is to instead utilize a probe grid map approximation, whereby an electrostatic potential function associated with source charges on the protein is evaluated and stored on 3-D grid for coordinate locations enclosing the protein. Then for each ligand charge a corresponding electrostatic potential value is accessed from memory (or other storage) and the direct product of the charge and the potential is then accumulated over all charges in the ligand. This may significantly reduce computational effort especially in the context of screening a molecule library where many molecular combinations may feature the same target protein but different ligands. Of course, the probe grid map approximation may require significant storage in order to reduce numerical errors related to variation of the potential function. Moreover, such an approximation is only suitable when the source charges of the protein do not change positions between different configurations. An alternative for a target protein featuring a flexible binding pocket, may be to use a hybrid computation strategy involving the use of the pair-wise strategy for the portion of the protein containing mobile source charges and the probe grid map strategy for the remainder of the protein. In general, various different computation strategies may be applied to other affinity formulations for other interaction types. On the other hand, the choice of computation strategy may be limited by the nature of the affinity formulation or interaction type in question. For example, it is unlikely that one would a strategy appropriate for evaluation of intermolecular electrostatics interactions to instead compute intramolecular strain components involving bonded interactions. Other types of computational strategies exist than those based on pair-wise (e.g., interactions between pairs of atoms) or map or potential field (e.g., interactions of an atom with a potential field) calculations. For example, the evaluation of a Generalized Born solvation model based on the calculation of either volume integrals over the solvent excluded volume or on the calculation of surface integrals on the solvent accessible surface area. As yet another example, various formulations of bonded interactions may be evaluated according to a computation strategy featuring traversal of an appropriate data structure containing relevant coordinate and bond descriptors.",
                                "An “affinity function” is a composition of affinity components each of which corresponds to a combination of an interaction type, an affinity formulation, and a computation strategy. An affinity component may represent interactions for the whole or parts of one or more molecular subsets. An affinity function may contain multiple affinity components relating to the same interaction type. For example, two affinity components may represent the same interaction type but differ in either their affinity formulation and/or their computation strategy. Each distinct molecular configuration for a given molecular combination may produce different quantitative results for an affinity component and hence for the corresponding affinity function. In one embodiment, the analysis of a molecular combination may be based on determination of the configuration with the best value for the affinity function. In other embodiments, multiple favorable values for the affinity function corresponding to molecular configurations associated with one or more potential binding modes may be considered. In yet another embodiment, multiple affinity functions may be computed on one or more configurations of a molecular combination and some decision or action based on their joint consideration, such as for example the scenario of consensus scoring of a small finite number of configurations for each molecular combination explored in the course of screening a molecule library against a target molecule.",
                                "The terms “about” and “approximately” as used herein shall generally mean an acceptable degree of error for the quantity measured given the nature or precision of the measurements. Typical, exemplary degrees of error are within 20 percent (%); preferably, within 10%; and more preferably, within 5% of a given value or range of values. Any reference to “about X” specifically indicates at least the values X, 0.95X, 0.96X, 0.97X, 0.98X, 0.99X, 1.01X, 1.02X, 1.03X, 1.04X, and 1.05X. Thus, “about X” is intended to teach and provide written support for a claim limitation of, e.g., “0.98X.” Alternatively, in biological systems, the terms “about” and “approximately” may mean values that are within an order of magnitude, preferably within 5-fold, and more preferably within 2-fold of a given value. Numerical quantities given herein are approximate unless stated otherwise, meaning that the term “about” or “approximately” can be inferred when not expressly stated. When “about” is applied to the beginning of a numerical range, it applies to both ends of the range.",
                                "As used herein, the terms “small molecule,” “small organic molecule” and “small inorganic molecule” includes molecules (either organic, organometallic, or inorganic), organic molecules, and inorganic molecules, respectively, which have a molecular weight of more than about 50 Da and less than about 2500 Da. Small organic (for example) molecules may be less than about 2000 Da, between about 100 Da to about 1000 Da, or between about 100 Da to about 600 Da, or between about 200 Da to about 500 Da."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define terms and concepts",
                                "facilitate understanding of embodiments",
                                "clarify terms based on accepted conventions",
                                "define singular and plural terms",
                                "describe nomenclatures used",
                                "specify enzymatic reactions and purification techniques",
                                "define \"a\", \"an\", and \"the\"",
                                "define \"or\" and \"and/or\"",
                                "define \"another\"",
                                "abbreviate amino acid residues",
                                "define \"ligand\"",
                                "describe interaction types",
                                "define nonbonded interaction types",
                                "define bonded interactions",
                                "describe entropic-based interactions",
                                "define hydrogen-bonding",
                                "describe hydrogen bond donors and acceptors",
                                "define ionic bonding",
                                "define van der Waals interaction",
                                "define π-π interaction or π-π stacking",
                                "describe steric interactions",
                                "define binding site",
                                "describe binding pocket",
                                "define molecular descriptors",
                                "describe chemical descriptors",
                                "describe physical descriptors",
                                "describe geometrical descriptors",
                                "describe environmental descriptors",
                                "assign chemical descriptors",
                                "describe data representations",
                                "define affinity formulation",
                                "describe energy model",
                                "choose affinity formulation",
                                "describe computation strategy",
                                "define computation strategy",
                                "describe direct summation",
                                "describe probe grid map approximation",
                                "describe hybrid computation strategy",
                                "define affinity function",
                                "describe affinity components",
                                "analyze molecular combination",
                                "determine configuration with best value",
                                "consider multiple favorable values",
                                "compute multiple affinity functions",
                                "define \"about\" and \"approximately\"",
                                "describe acceptable degree of error",
                                "define small molecule"
                            ],
                            "num_characters": 23620,
                            "outline_medium": [
                                "define terms and concepts",
                                "clarify understanding of embodiments",
                                "explain singular and plural terms",
                                "describe nomenclatures used",
                                "define \"a\", \"an\", and \"the\"",
                                "explain use of \"or\" and \"and/or\"",
                                "define \"another\"",
                                "abbreviate amino acid residues",
                                "define \"ligand\" and related terms",
                                "explain \"interaction\" and related terms",
                                "describe nonbonded interaction types",
                                "describe bonded interactions",
                                "explain entropic-based interactions",
                                "define \"hydrogen-bonding\" and related terms",
                                "explain ionic bonding",
                                "define \"van der Waals interaction\"",
                                "explain π-π interaction or π-π stacking",
                                "describe steric interactions",
                                "define \"binding site\" and related terms",
                                "explain molecular descriptors",
                                "define \"affinity formulation\" and related terms",
                                "explain computation strategy",
                                "define \"affinity function\""
                            ],
                            "outline_short": [
                                "define terms and concepts",
                                "clarify understanding of terms",
                                "describe nomenclatures used",
                                "define singular and plural terms",
                                "explain use of \"a\", \"an\", and \"the\"",
                                "define \"ligand\" and related terms",
                                "describe types of interactions",
                                "explain hydrogen bonding",
                                "define ionic bonding and van der Waals interaction",
                                "describe steric interactions and binding sites",
                                "explain affinity formulation and computation strategy"
                            ]
                        },
                        {
                            "title": "Drug Design and Discovery",
                            "paragraphs": [
                                "Drug design and discovery processes (which can also be referred to as “drug development”) can be divided into the following subprocesses: (1) target validation; (2) lead generation/optimization; (3) preclinical testing; and (4) clinical trials and approval. Target validation includes determination of one or more targets that have disease relevance. Results of the target validation phase might include a determination that the presence or action of the target molecule in an organism causes or influences some effect that initiates, exacerbates, or contributes to a disease for which a cure or treatment is sought. In some cases a natural binder or substrate for the target may also be determined via experimental methods. In the context of the present disclosure, a target is human PD-1 protein, with the examples of disease relevance being cancer start and/or progression, with or without treatment, some exemplary types of cancers being solid tumors and blood cancers, including metastatic cancer and cancers with high microsatellite instability and mismatch-repair deficient cancers. The types of cancers that may be relevant in the context of the present disclosure include, but are not limited to, colorectal cancer, gastrointestinal cancer, including stomach and esophageal cancer, endometrial cancer, breast cancer, prostate cancer, prostate cancer, bladder cancer, thyroid cancer, melanoma, lung cancer, head and neck cancer, including head and neck squamous cell carcinoma, or lymphoma, including Hodgkin lymphoma. Another examples of disease relevance are inherited disorders that lead to increased cancer predisposition, such as the syndromes that include mismatch repair deficiency and/or microsatellite instability, for example, Lynch syndrome.",
                                "Lead generation typically involves the identification of lead compounds, i.e., ligands, that can bind to the target molecule and that may alter the effects of the target through either activation, deactivation, catalysis, or inhibition of the function of the target, in which case the lead would be a viewed as a suitable candidate ligand to be used in the drug application process. In the context of the present disclosure, initial leads can be compounds that are identified in silico as being able to bind to a PD-L2 binding pocket of human PD-1 and determined to exert biological activity by in vitro and/or in vivo testing. Lead optimization involves the chemical and structural refinement of lead candidates into drug precursors in order to improve binding affinity to the desired target (human PD-1 in the context of the present disclosure), increase selectivity, and also to address basic issues of toxicity, solubility, and metabolism. Together lead generation and lead optimization can result in one or more chemically distinct leads for further consideration. In preclinical testing, biochemical assays and animal models are used to test the selected leads for various pharmacokinetic factors related to drug absorption, distribution, metabolism, excretion, toxicity, side effects, and required dosages. After the preclinical testing period, clinical trials and approval take place, during which the drug candidates are tested on human subjects for safety and efficacy.",
                                "A number of laboratory methods exist for measuring or estimating affinity between a target molecule and a ligand. Often the target might be first isolated and then mixed with the ligand in vitro and the molecular interaction assessed experimentally such as in the myriad biochemical and functional assays associated with high throughput screening. However, such methods are most useful where the target is simple to isolate, the ligand is simple to manufacture and the molecular interaction easily measured, but is more problematic when the target cannot be easily isolated, isolation interferes with the biological process or disease pathway, the ligand is difficult to synthesize in sufficient quantity, or where the particular target or ligand is not well characterized ahead of time. In the latter case, many thousands or millions of experiments might be needed for all possible combinations of the target and ligands, making the use of laboratory methods unfeasible.",
                                "While a number of attempts have been made to resolve this bottleneck by first using specialized knowledge of various chemical and biological properties of the target (or even related targets such as protein family members) and/or one or more already known natural binders or substrates to the target, to reduce the number of combinations required for lab processing, this is still impractical and too expensive in most cases. Instead of actually combining molecules in a laboratory setting and measuring experimental results, another approach is to use computers to simulate or characterize molecular interactions between two or more molecules (i.e., molecular combinations modeled in silico). The use of computational methods to assess molecular combinations and interactions is usually associated with one or more stages of rational drug design, whether structure-based, ligand-based, or both."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define drug design and discovery subprocesses",
                                "motivate target validation",
                                "describe lead generation",
                                "explain lead optimization",
                                "outline preclinical testing",
                                "discuss clinical trials and approval",
                                "introduce laboratory methods for measuring affinity",
                                "limitations of laboratory methods",
                                "motivate computational methods for molecular interactions",
                                "introduce rational drug design"
                            ],
                            "num_characters": 5111,
                            "outline_medium": [
                                "define drug development subprocesses",
                                "motivate target validation",
                                "describe lead generation and optimization",
                                "outline preclinical testing and clinical trials",
                                "limitations of laboratory methods"
                            ],
                            "outline_short": [
                                "outline drug development subprocesses",
                                "motivate in silico drug design"
                            ]
                        },
                        {
                            "title": "Computational Methods",
                            "paragraphs": [
                                "Rational drug design can use structural information about drug targets (structure-based) and/or their natural ligands (ligand-based) as a basis for the design of effective lead candidate generation and optimization. In the context of the present disclosure, PD-L2 binding pocket of human PD-1 can serve as a drug target in the drug design process. In some cases, natural ligands PD-L1 and/or PD-L2 can serve as a basis for generating lead candidates. Structure-based rational drug design can utilize a three-dimensional model of the structure for the target. For target proteins or nucleic acids, such structures may be the result of X-ray crystallography/NMR or other measurement procedures or may result from homology modeling, analysis of protein motifs and conserved domains, and/or computational modeling of protein folding or the nucleic acid equivalent.",
                                "In the context of the present disclosure, the structure of the target can be a three-dimensional model of the PD-L2 binding pocket of human PD-1 that is computationally derived (generated) from the structures of the PD-L2 binding pocket of human PD-1 described in the present disclosure. For example, the three-dimensional model of the PD-L2 binding pocket of human PD-1 can be computationally derived from atomic coordinates, provided elsewhere in the present disclosure, corresponding to crystals of a variant of human PD-1 comprising amino acid substitutions, such as substitutions in one or more of the residues (for example, each of the residues) corresponding to N74, T76 or A132 of SEQ ID NO:1. In some examples, in addition of a three-dimensional model of the PD-L2 binding pocket of human PD-1 that is computationally derived (generated) from the structures of the PD-L2 binding pocket of human PD-1 described in the present disclosure, structure-based in silico design, testing and/or optimization of human PD-1 ligands can also employ a three-dimensional model of human apo-PD-1 (meaning PD-1 without a ligand) that lacks a PD-2 binding pocket in a process that models formation of the PD-2 binding pocket and ligand-binding. The structure of a ligand may be computationally generated based on natural in vivo ligands, such as PD-1 and/or PD-2, or previously identified ligands. The ligand structure may instead be constructed ab initio from a known 2-D chemical representation using fundamental physics and chemistry principles, for example, when the ligand is not a biopolymer.",
                                "Rational drug design may incorporate the use of any of a number of computational components ranging from computational modeling of target-ligand molecular interactions and combinations to lead optimization to computational prediction of desired drug-like biological properties. The use of computational modeling in the context of rational drug design has been largely motivated by a desire both to reduce the required time and to improve the focus and efficiency of drug research and development, by avoiding often time consuming and costly efforts in biological “wet” lab testing and the like.",
                                "Computational modeling of target-ligand molecular combinations in the context of lead generation may involve the large-scale in silico screening of compound libraries, such as small-molecule libraries (i.e., library screening), whether the libraries are virtually generated and stored as one or more compound structural databases or constructed via combinatorial chemistry and organic synthesis, using computational methods to rank a selected subset of ligands based on computational prediction of bioactivity (or an equivalent measure) with respect to the intended target molecule.",
                                "In the context of the present disclosure, the target molecule is PD-1, and the structure of the target employed in the library screening can be a three-dimensional model of the PD-L2 binding pocket of human PD-1 that is computationally derived (generated) from the structures of the PD-L2 binding pocket of human PD-1 described in the present disclosure. For example, the three-dimensional model of the PD-L2 binding pocket of human PD-1 can be computationally derived from atomic coordinates, provided elsewhere in the present disclosure, corresponding to crystals of a variant of human PD-1 comprising amino acid substitutions, such as substitutions in one or more of the residues (for example, each of the residues) corresponding to N74, T76 or A132 of SEQ ID NO:1. In some examples, in addition of a three-dimensional model of the PD-L2 binding pocket of human PD-1 that is computationally derived (generated) from the structures of the PD-L2 binding pocket of human PD-1 described in the present disclosure, computational library screending of human PD-1 ligands can also employ a three-dimensional model of human apo-PD-1 (meaning PD-1 without a ligand) that lacks a PD-2 binding pocket in a process that models formation of the PD-2 binding pocket and ligand-binding.",
                                "Fragment-based drug discovery (FBDD), discussed, for example, in (114) and (115), is another tool for discovering leads for drug development. FBDD first identifies starting points: low-molecular-weight ligands (˜150 Da) (fragments) that bind to a target, for example, human PD-1. The fragments may bind to the target with the very low affinity. The identified fragments may be them grown or combined to produce leads with higher affinity. The three-dimensional binding mode of the fragments may be determined in silico and/or experimentally, using X-ray crystallography or NMR spectroscopy, and is used to facilitate their optimization into leads with higher activity. FBLD can be combined with screening.",
                                "Various terms and concepts are employed in computational modeling. For example, “binding mode” refers to the 3-D molecular structure of a potential molecular complex in a bound state at or near a minimum of the binding energy (i.e., maximum of the binding affinity), where the term “binding energy” (sometimes interchanged with “binding free energy” or with its conceptually antipodal counterpart “binding affinity”) refers to the change in free energy of a molecular system upon formation of a potential molecular complex, i.e., the transition from an unbound to a (potential) bound state for the ligand and target. The term “system pose” is also sometimes used to refer to the binding mode. Here the term free energy generally refers to both enthalpic and entropic effects as the result of physical interactions between the constituent atoms and bonds of the molecules between themselves (i.e., both intermolecular and intramolecular interactions) and with their surrounding environment. Examples of the free energy are the Gibbs free energy encountered in the canonical or grand canonical ensembles of equilibrium statistical mechanics.",
                                "In general, the optimal binding free energy of a given target-ligand pair directly correlates to the likelihood of combination or formation of a potential molecular complex between the two molecules in chemical equilibrium, though, in truth, the binding free energy describes an ensemble of (putative) complexed structures and not one single binding mode. However, in computational modeling, it is usually assumed that the change in free energy is dominated by a single structure corresponding to a minimal energy. This is certainly true for tight binders (pK ˜0.1 to 10 nanomolar) but questionable for weak ones (pK ˜10 to 100 micromolar). The dominating structure is usually taken to be the binding mode. In some cases, it may be necessary to consider more than one alternative binding mode when the associated system states are nearly degenerate in terms of energy.",
                                "Binding affinity is of direct interest to drug discovery and rational drug design because the interaction of two molecules, such as a protein that is part of a biological process or pathway and a drug candidate sought for targeting a modification of the biological process or pathway, often helps indicate how well the drug candidate will serve its purpose. Furthermore, where the binding mode is determinable, the action of the drug on the target can be better understood. Such understanding may be useful when, for example, it is desirable to further modify one or more characteristics of the ligand so as to improve its potency (with respect to the target), binding specificity (with respect to other target biopolymers), or other chemical and metabolic properties.",
                                "When computationally modeling the nature and/or likelihood of a potential molecular combination for a given target-ligand pair, the actual computational prediction of binding mode and affinity is customarily accomplished in two parts: (a) “docking”, in which the computational system attempts to predict the optimal binding mode for the ligand and the target and (b) “scoring”, in which the computational system attempts to refine the estimate of the binding affinity associated with the computed binding mode. During library screening, scoring may also be used to predict a relative binding affinity for one ligand vs. another ligand with respect to the target molecule and thereby rank prioritize the ligands or assign a probability for binding.",
                                "Docking may involve a search or function optimization algorithm, whether deterministic or stochastic in nature, with the intent to find one or more system poses that have favorable affinity. Scoring may involve a more refined estimation of an affinity function, where the affinity is represented in terms of a combination of one or more empirical, molecular-mechanics-based, quantum mechanics-based, or knowledge-based expressions, i.e., a scoring function. Individuals scoring functions may themselves be combined to form a more robust consensus-scoring scheme using a variety of formulations. In practice, there are many different docking strategies and scoring schemes employed in the context of today's computational drug design.",
                                "Whatever the choice of computational method there are inherent trade-offs between the computational complexity of both the underlying molecular models and the intrinsic numerical algorithms, and the amount of computing resources (time, number of CPUs, number of simulations) that must be allocated to process each molecular combination. For example, while highly sophisticated molecular dynamics simulations (MD) of the two molecules surrounded by explicit water molecules and evolved over trillions of time steps may lead to higher accuracy in modeling the potential molecular combination, the resultant computational cost (i.e., time and computing power) is so enormous that such simulations are intractable for use with more than just a few molecular combinations. On the other hand, the use of more primitive models for representing molecular interactions, in conjunction with multiple, and often error-prone, modeling shortcuts and approximations, may result in more acceptable computational cost, but will decrease modeling accuracy and predictive power.",
                                "Methods and concepts related to computational aspects of drug discovery and drug design are described in the publications summarized below. The process of high throughput docking and scoring and its applications are discussed in (46) and (49). A general approach to the design, docking, and virtual screening of multiple combinatorial libraries against a family of proteins is described in (50). The use of multiple computers to accelerate virtual screening of a large ligand library against a specific target by assigning groups of ligands to specific computers is described in (51). A number of examples of software tools are used to perform docking simulations. These methods involve a wide range of computational techniques, including use of a) rigid-body pattern-matching algorithms, either based on surface correlations, use of geometric hashing, pose clustering, or graph pattern-matching; b) fragmental-based methods, including incremental construction or ‘place and join’ operators; c) stochastic optimization methods including use of Monte Carlo, simulated annealing, or genetic (or memetic) algorithms; d) molecular dynamics simulations or e) hybrids strategies derived thereof.",
                                "The earliest docking software tool was a graph-based rigid-body pattern-matching algorithm called DOCK, developed at UCSF back in 1982 (v1.0), with more recent versions including extensions to include incremental construction. Other examples of graph-based pattern-matching algorithms are described in include CLIX (which in turn uses GRID), FLOG and LIGIN. The above and other software tools are described in (52-56). Other rigid-body pattern-matching docking software tools are described in (57-60) and include the shape-based correlation methods of FTDOCK and HEX, the geometric hashing and the pose clustering. In general, rigid-body pattern-matching algorithms assume that both the target and ligand are rigid (i.e., not flexible) and hence may be appropriate for docking small, rigid molecules (or molecular fragments) to a simple protein with a well-defined, nearly rigid active site. Thus, this class of docking tools may be suitable for de novo ligand design, combinatorial library design, or straightforward rigid-body screening of a molecule library containing multiple conformers per ligand. Incremental construction based docking software tools include FlexX (61, 62) from Tripos (licensed from EMBL), Hammerhead (63), DOCK v4.0 (as an option), and the nongreedy, backtracking algorithm of (64). Programs using incremental construction in the context of de novo ligand design include LUDI (65) (from Accelrys) and GrowMol (66_. Docking software tools also include the tools based on ‘place and join’ strategies (67).",
                                "Incremental construction algorithms may be used to model docking of flexible ligands to a rigid target molecule with a well-characterized active site. They may be used when screening a library of flexible ligands against one or more targets. They are often comparatively less compute intensive, yet consequently less accurate, than many of their stochastic optimization based competitors. Incremental construction algorithms often employ one or more scoring functions to evaluate and rank different system poses encountered during computations. For example, FlexX was extended to FlexE (68) to attempt to account for partial flexibility of the target molecule's active site via use of user-defined ensembles of certain active site rotamers. Computational docking software tools based on stochastic optimization (69) are described in (70-72) and include ICM (from MolSoft), GLIDE (from Schrodinger), and LigandFit (from Accelrys), all based on modified Monte Carlo techniques, as well as AutoDock v.2.5 (from Scripps Institute) based on simulated annealing. Other software tools based on genetic or memetic algorithms are described in (73-76) and include GOLD, DARWIN, and AutoDock v.3.0 (also from Scripps).",
                                "Stochastic optimization-based methods may be used to model docking of flexible ligands to a target molecule. They generally use a molecular-mechanics-based formulation of the affinity function and employ various strategies to search for one or more favorable system energy minima. They are often more computer intensive, yet also more robust, than their incremental construction competitors. As they are stochastic in nature, different runs or simulations may often result in different predictions. Traditionally most docking software tools using stochastic optimization assume the target to be nearly rigid (i.e., hydrogen bond donor and acceptor groups in the active site may rotate), since otherwise the combinatorial complexity increases rapidly making the problem difficult to robustly solve in reasonable time.",
                                "Molecular dynamics simulations have also been used in the context of computational modeling of target-ligand combinations. This includes the implementations presented in (77) and (71) (along with Monte Carlo). In principle, molecular dynamics simulations may be able to model protein flexibility to an arbitrary degree. On the other hand, they may also require evaluation of many fine-grained, time steps and are thus often very time-consuming (one order of hours or even days per target-ligand combination). They also often require user interaction for selection of valid trajectories. Use of molecular dynamics simulations in lead discovery can be more suited to local minimization of predicted complexes featuring a small number of promising lead candidates. Hybrid methods may involve use of rigid-body pattern-matching techniques for fast screening of selected low-energy ligand conformations, followed by Monte Carlo torsional optimization of surviving poses, and finally even molecular dynamics refinement of a few choice ligand structures in combination with a (potentially) flexible protein active site. An example of this type of docking software strategy is (78).",
                                "There are a number of examples of scoring functions implemented in software and used to estimate target-ligand affinity, rank prioritize different ligands as per a library screen, or rank intermediate docking poses in order to predict binding modes. Scoring functions traditionally fall into three distinct categories: a) empirical scoring functions, b) molecular-mechanics-based expressions, or I knowledge-based scoring functions or hybrid schemes derived thereof. Empirically derived scoring functions (as applied to target-ligand combinations) were first inspired by the linear free-energy relationships often utilized in QSAR studies. An early example is that of Böhm et al. (65, 79) (used in LUDI). Other empirical scoring functions are described in (80-84) and include SCORE (used in FlexX), ChemScore, PLP, Fresno, and GlideScore v.2.0+(modified form of ChemScore, used by GLIDE).",
                                "In general, empirical scoring functions comprise the bulk of scoring functions used today, especially in the context of large compound library screening. The basic premise is to calibrate a linear combination of empirical energy models, each multiplied by an associated numerical weight and each representing one of a set of interaction components represented in a (so-called) ‘master scoring equation’, where said equation attempts to well approximate the binding free energy of a molecular combination. The numerical weight factors may be obtained by fitting to experimental binding free energy data composed for a training set of target-ligand complexes. Molecular-mechanics-based scoring functions were first developed for use in molecular modeling in the context of molecular mechanics force fields like AMBER, OPLS, MMFF, and CHARMM (described in (85-89)). Examples of molecular-mechanics-based scoring functions include both the chemical and energy-based scoring functions of DOCK v.4.0 (based on AMBER), the objective functions used in GOLD, AutoDock v.3.0 (with empirical weights), and FLOG. In general, molecular-mechanics-based scoring functions may closely resemble the objective functions utilized by many stochastic optimization-based docking programs. Such functions typically require atomic (or chemical group) level parameterization of various attributes (e.g., charge, mass, van der Waals radii, bond equilibrium constants, etc.) based on one or more molecular mechanics force fields (e.g., AMBER, MMFF, OPLS, etc.). In some cases, the relevant parameters for the ligand may also be assigned based on usage of other molecular modeling software packages, e.g., ligand partial charges assigned via use of MOPAC (90), AMPAC (91) or AMSOL (92). They may also include intramolecular interactions (i.e., self-energy of molecules), as well as long range interactions such as electrostatics. In some cases, the combination of energy terms may again be accomplished via numerical weights optimized for reproduction of test ligand-target complexes.",
                                "Knowledge-based scoring functions were first inspired by the potential of mean force statistical mechanics methods for modeling liquids. Examples include DrugScore, PMF and BLEEP (93-95). In general, knowledge-based scoring functions do not require partitioning of the affinity function. However, they do require usage of a large database of 3-D structures of relevant molecular complexes. There is also usually no need for regression against a data set of molecular complexes with known experimental binding affinities. These methods are based on the underlying assumption that the more favorable an interaction is between two atoms, at a given distance, the more frequent its occurrence relative to expectations in a bulk, disordered medium. These schemes are sometimes referred to as ‘inverse Boltzmann’ schemes, but in fact the presence of local, optimized structures in macromolecules and protein folds means that distance-dependent pair-wise preference distributions need not be strictly Boltzmann. It is also possible to introduce the concept of singlet preferences based on other molecular descriptors, e.g., solvent accessible surface area for approximation of solvation effects. Hybrid scoring functions may be a mixture of one or more scoring functions of distinct type. One example is VALIDATE (96), which is a molecular-mechanics/empirical hybrid function. Other combinations of scoring functions may include the concept of consensus scoring in which multiple functions may be evaluated for each molecular combination and some form of ‘consensus’ decision is made based on a set of rules or statistical criteria, e.g., states that occur in the top 10% rank list of each scoring function (intersection-based), states that have a high mean rank (average-based), etc. A useful review discussion of consensus scoring can be found in (97). Various file formats exist for the digital representation of structural and chemical information for both target proteins and compounds as related to structural databases. Examples include the pdb, mol2 (from Tripos), and the SMILES formats.",
                                "A discussion on the calculation of total electrostatic energies involved in the formation of a potential molecular complex can be found in (98). Computational solutions of electrostatic potentials in the classical regime range from simpler formulations, like those involving distance-dependent dielectric functions, to more complex formulations, like those involving solution of the Poisson-Boltzmann equation (99, 100), a second order, generally nonlinear, elliptic partial differential equation. Other classical formalisms that attempt to model electrostatic desolvation include those based on the Generalized Born solvation model (101, 102), methods that involve representation of reaction field effects via additional solvent accessible or fragmental volume terms (103-105), or explicit representation of solvent in the context of molecular dynamics simulations (106-108). A lengthy review of full quantum mechanical treatment of electrostatics interactions can be found in (109).",
                                "FIG. 6 illustrates a modeling system 100 for the analysis of molecular combinations according to embodiments of the present disclosure. As shown, a configuration modeler 102 receives one or more input configuration records 106, including both the identities of and molecular descriptors for input structures for one or more molecular subsets from an input molecular combination database 104. The configuration modeler 102 comprises a configuration data transformation engine 108, an affinity calculator 109, and descriptor data storage 120. Results from the configuration modeler 102 are output as configuration results records 111 to a results database (DB) 110. Modeling system 100 may be used to determine or characterize one or more molecular combinations. In some embodiments, this may include, but is not limited to, prediction of likelihood of formation of a potential molecular complex, or a proxy thereof, the estimation of the binding affinity or binding energy between molecular subsets in an environment, the prediction of the binding mode (or even additional alternative modes) for the molecular combination, or the rank prioritization of a collection of molecular subsets (e.g., ligands) based on predicted bioactivity with a target molecular subset, and would therefore also include usage associated with computational target-ligand docking and scoring.",
                                "In a typical operation, many molecular combinations, each featuring many different molecular configurations, may be modeled. Since the total possible number of configurations may be enormous, the modeling system may sample a subset of configurations during the modeling procedure, though the sampling subset may still be very large (e.g., millions or billions of configurations per combination) and the selection strategy for configuration sampling is specified by one or more search and/or optimization techniques (e.g., steepest descent, conjugate gradient, modified Newton's methods, Monte Carlo, simulated annealing, genetic or memetic algorithms, brute force sampling, pattern matching, incremental construction, fragment place-and-join, etc.). An affinity function is evaluated for each visited configuration and the results for one or more configurations recorded in a storage medium.",
                                "The molecular combination may then be assessed by examination of the set of configuration results including the corresponding computed affinity function values. Once the cycle of computation is complete for one molecular combination, modeling of the next molecular combination may ensue. Alternatively, in some embodiments of the modeling system 100, multiple molecular combinations may be modeled in parallel as opposed to in sequence. Likewise, in some embodiments, during modeling of a molecular combination, more than one configuration may be processed in parallel as opposed to in sequence.",
                                "In one embodiment, modeling system 100 may be implemented on a dedicated microprocessor, ASIC, or FPGA. In another embodiment, modeling system 100 may be implemented on an electronic or system board featuring multiple microprocessors, ASICs, or FPGAs. In yet another embodiment, modeling system 100 may be implemented on or across multiple boards housed in one or more electronic devices. In yet another embodiment, modeling system 100 may be implemented across multiple devices containing one or more microprocessors, ASICs, or FPGAs on one or more electronic boards and the devices connected across a network.",
                                "In some embodiments, modeling system 100 may also include one or more storage media devices for the storage of various, required data elements used in or produced by the analysis. Alternatively, in some other embodiments, some or all of the storage media devices may be externally located but networked or otherwise connected to the modeling system 100. Examples of external storage media devices may include one or more database servers or file systems. In some embodiments involving implementations featuring one or more boards, the modeling system 100 may also include one or more software processing components in order to assist the computational process. Alternatively, in some other embodiments, some or all of the software processing components may be externally located but networked or otherwise connected to the modeling system 100.",
                                "In some embodiments, results records from database 110 may be further subjected to a configuration selector 112 during which one or more molecular configurations may be selected based on various selection criteria and then resubmitted to the configuration modeler 102 (possibly under different operational conditions) for further scrutiny (i.e., a feedback cycle). In such embodiments, the molecular configurations are transmitted as inputs to the configuration modeler 102 in the form of selected configuration records 114. In another embodiment, the configuration selector 112 may also send instructions to the configuration data transformation engine on how to construct one or more new configurations to be subsequently modeled by configuration modeler 102. For example, if the configuration modeler modeled ten target-ligand configurations for a given target-ligand pair (the target, in the context of the present disclosure, can be a PD-L2 binding pocket of human PD-1, and the ligand is a test ligand capable of interacting with the PD-L2 binding pocket of human PD-1), and two of the configurations had substantially higher estimated affinity than the other eight, then the configuration selector 112 may generate instructions for the configuration data transformation engine on how to construct further additional configurations (i.e., both target and ligand poses) that are structurally similar to the top two high-scoring configurations, which are then subsequently processed by the remainder of the configuration modeler 102. In some embodiments, the transmitted instructions may relate to construction from the resubmitted configurations whereas in other cases they relate to construction from the original input reference configuration(s).",
                                "In some embodiments, once analysis of a molecular combination is completed (i.e., all desired configurations assessed) a combination postprocessor 116 may be used to select one or more configuration results records from database 110 in order to generate one or more qualitative or quantitative measures for the combination, such as a combination score, a combination summary, a combination grade, etc., and the resultant combination measures are then stored in a combination results database 118. In one embodiment, the combination measure may reflect the configuration record stored in database 110 with the best observed affinity. In another embodiment, multiple high affinity configurations are submitted to the combination postprocessor 116 and a set of combination measures written to the combination results database 118. In another embodiment, the selection of multiple configurations for use by the combination postprocessor 116 may involve one or more thresholds or other decision-based criteria.",
                                "In a further embodiment, the selected configurations are also chosen based on criteria involving structural diversity or, alternatively, structural similarity (e.g., consideration of mutual rmsd of configurations, use of structure-based clustering or niching strategies, etc.). In yet another embodiment, the combination measures output to the combination results database 118 are based on various statistical analysis of a sampling of possibly a large number of configuration results records stored in database 110. In other embodiment the selection sampling itself may be based on statistical methods (e.g., principal component analysis, multidimensional clustering, multivariate regression, etc.) or on pattern-matching methods (e.g., neural networks, support vector machines, etc.)",
                                "In yet another embodiment, the combination results records stored in database 118 may not only include the relevant combination measures, but may also include some or all of the various configuration records selected by the combination postprocessor 116 in order to construct a given combination measure. For example, combination results records stored in database 118 may include representations of the predicted binding mode or of other alternative, high affinity (possibly structurally diverse) modes for the molecular combination. In another embodiment, the combination postprocessor 116 may be applied dynamically (i.e., on-the-fly) to the configuration results database 110 in conjunction with the analysis of the molecular combination as configuration results records become available. In yet another embodiment, the combination postprocessor 116 may be used to rank different configurations in order to store a sorted list of either all or a subset of the configurations stored in database 110 that are associated with the combination in question. In yet other embodiments, once the final combination results records, reflecting the complete analysis of the molecular combination by the configuration modeler 102, have been stored in database 118, some or all of the configuration records in database 110 may be removed or deleted in order to conserve storage in the context of a library screen involving possibly many different molecular combinations. Alternatively, some form of garbage collection or equivalent may be used in other embodiments to dynamically remove poor affinity configuration records from database 110.",
                                "In one embodiment, the molecular combination record database 104 may comprise one or more molecule records databases (e.g., flat file, relational, object oriented, etc.) or file systems and the configuration modeler 102 receives an input molecule record corresponding to an input structure for each molecular subset of the combination, and possibly a set of environmental descriptors for an associated environment. In another embodiment, when modeling target protein-ligand molecular combinations, the molecular combination record database 104 is replaced by an input target record database and an input ligand (or drug candidate) record database. In a further embodiment, the input target molecular records may be based on that are experimentally derived (e.g., X-ray crystallography, NMR, etc.), energy minimized, and/or model-built structures. In another embodiment, the input ligand molecular records may reflect energy minimized or randomized 3-D structures or other 3-D structures converted from a 2-D chemical representation, or even a sampling of low energy conformers of the ligand in isolation. In yet another embodiment, the input ligand molecular records may correspond to naturally existing compounds or even to virtually generated compounds, which may or may not be synthesizable.",
                                "In one embodiment the configuration data transformation engine 108 may transform one or more input molecular configurations into one or more other new configurations by application of various geometrical operators characterized by sets of geometrical descriptors. Transformation of molecular configurations into newer variants may be accomplished by one or more unary operations (i.e., acting on one input configuration, such as the mutation operator in a genetic algorithm), binary operations (i.e., acting on two input configurations, such as a binary crossover in a genetic algorithm), other n-ary operations (i.e., acting on a plurality of input configurations, such as a transform operator based on a population of configurations), or a combination thereof. In another embodiment, the transformation of molecular configurations into newer variants may result in multiple new configurations from one configuration, such as, for example, the construction of a suitable (often randomized) initial population for use in a genetic algorithm. In some embodiments, the configuration data transformation engine 108 may be able to construct ab initio one or more entirely new configurations without the requirement of input geometrical descriptors from an input molecular combination database 104, though other types of molecular descriptors may still be needed.",
                                "As already discussed, in some embodiments, the set of configurations generated via transformation during the course of an analysis of a molecular combination may be determined according to a schedule or sampling scheme specified by one or more search and/or optimization techniques used to drive the modeling processes of the configuration modeler 102. In some embodiments, the search strategy or optimization technique may be an iterative process whereby one or more configurations are generated from one or more input configurations, then affinities are calculated for each configuration, decisions are made based on affinity and/or structure, and all or part of the new set of configurations are used as input seeds for the next iteration; the process continuing until a specified number of iterations are completed configuration modeler 102 or some other convergence criteria satisfied. In such embodiments, the input configuration records 106 obtained or derived from data in the input molecular combination database 104, may serve only to initiate (or also possibly reset) the iterative process (i.e., prime the pump). For example, in the context of the present disclosure, the input target molecular records may be based on atomic coordinates of PD-L2 binding pocket of human PD-1 included in the present disclosure, which are determined from co-crystals of a variant of human PD-1 with PD-L2 ligand. In one example, the variant of human PD-1 is a variant comprising amino acid substitutions in one or more of (such as in each) of residues corresponding to N74, T76 or A132 of SEQ ID NO:1,",
                                "In some embodiments, the search strategy or optimization technique may be stochastic in nature meaning that the set of configurations visited during analysis of a molecular combination may involve some random component and thus be possibly different between different runs of the configuration modeler 102 as applied to the same molecular combination. Here the term run refers to two different initiations of (possibly iterative) cycles of computation for analysis of the same molecular combination. In some embodiments, the combination postprocessor 116 may then base its results or decisions on configuration results records stored in database 110 but obtained from different runs. In some embodiments, the configuration data transformation engine 108 may produce new configurations sequentially, such as a new possible state associated with a given iteration of a Monte Carlo-based technique, and feed them to the affinity calculator 109 in a sequential manner. In other embodiments, the configuration data transformation engine 108 may produce multiple new configurations in parallel, such as a population associated with a given iteration of a genetic algorithm, and submit them in parallel to the affinity calculator 109. In other embodiments, the configuration data transformation engine 108 may not generate additional configurations and instead the configuration modeler 102 may operate solely on one or more input configuration records from the input molecular combination database 104, such as for example in some usages of modeling system 100 related to scoring of a set of known molecular configurations. In such embodiments, the configuration data modeler 102 may not include a search or optimization strategy and instead be used to perform affinity calculations on an enumerated set of input configuration records.",
                                "In some embodiments, various descriptor data related to the configurations of a given molecular combination may be stored or cached in one or more components of a descriptor data storage 120 via one or more storage (or memory) allocation means, structure or apparatus for efficient access and storage during the cycle of computations performed by the configuration modeler 102. In one embodiment, the descriptor data storage 120 may contain chemical or physical descriptors assigned to atoms, bonds, groups, residues, etc. in each of the molecular subsets or may even also contain environmental descriptors. In another embodiment, the descriptor data common to all configurations for a given molecular combination is compactly represented via a storage allocation means in one or more lookup tables. For example, often many physical and chemical descriptors may be identical for different configurations of a combination whereas one or more geometric descriptors are not. In yet another embodiment, the descriptor data storage 120 may also contain relevant geometric descriptors for the configurations arranged in one or more storage formats via a prescribed storage allocation means. As examples, such formats may involve, but are not limited to, records analogous to pdb or mol2 file formats. Additional examples include various data structures such as those associated with the molecular representation partitioning shown in Ahuja I. As a further example, perhaps stored descriptors for atoms and bonds may represent individual nodes in one or more lists or arrays, or may alternatively be attached, respectively, to nodes and edges of a tree or directed graph.",
                                "The whole or parts of the input configuration records 106, and, if applicable, selected configuration records 114 chosen by configuration selector 112, may be converted to data representations used in the storage allocation means of the descriptor data storage 120. Data constructs contained in the descriptor data storage 120 may be either read (i.e., accessed) for use by the configuration data transformation engine 108 or the affinity calculator 109 and may be written either at the inception of or during the execution of a cycle of computation by the configuration modeler 102. The layout and access patterns for the associated descriptor data storage 120 will likely depend on the needs of the affinity calculator 109 as well as the configuration data transformation engine 108.",
                                "The affinity calculator 109 may comprise one or more processing (i.e., affinity) engines, where each affinity engine may be dedicated to performing calculations related to one or more affinity components as defined previously in regard to interaction types, affinity formulations, and computation strategies. In some embodiments, different affinity engines are assigned to each unique affinity component. In other embodiments, one or more affinity engines may compute multiple affinity components according to similarity of processing requirements. In yet other embodiments, different affinity engines may be grouped or otherwise arranged together to take advantage of common subsets of required input data in order to improve any caching scheme and/or to reduce the number of, the bandwidth requirements for, or the routing requirements for various associated data paths.",
                                "For example, in one embodiment, affinity components for both the electrostatic and van der Waals interactions involving field-based computation strategies utilizing stored pregenerated probe grid maps, may be computed on the same affinity engine, where said engine requires access to both types of probe grid maps in storage and to various numerical parameters used in evaluating the affinity formulation for the two different interactions. As another example, affinity components for both the hydrogen bonding and van der Waals interactions using affinity formulations featuring generalized Lennard-Jones potentials computed according to a pair-based computation strategy may be computed on the same affinity engine. In an alternative embodiment, the same two affinity components may be computed using two different affinity engines but grouped together in order to share common input data such as that relating to spatial coordinates and a subset of relevant chemical or physical descriptors."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce rational drug design",
                                "motivate structure-based drug design",
                                "describe three-dimensional model of target structure",
                                "derive three-dimensional model from X-ray crystallography/NMR",
                                "derive three-dimensional model from homology modeling",
                                "describe structure-based in silico design",
                                "describe testing and optimization of human PD-1 ligands",
                                "motivate computational modeling of target-ligand molecular interactions",
                                "describe lead optimization",
                                "describe computational prediction of desired drug-like biological properties",
                                "introduce library screening",
                                "describe computational modeling of target-ligand molecular combinations",
                                "rank ligands based on computational prediction of bioactivity",
                                "introduce fragment-based drug discovery",
                                "describe identifying starting points for drug development",
                                "describe growing or combining fragments to produce leads",
                                "determine three-dimensional binding mode of fragments",
                                "facilitate optimization into leads with higher activity",
                                "combine FBLD with screening",
                                "define binding mode",
                                "define binding energy",
                                "describe optimal binding free energy",
                                "describe binding affinity",
                                "motivate understanding of binding mode and affinity",
                                "introduce docking",
                                "introduce scoring",
                                "describe trade-offs between computational complexity and resources",
                                "describe molecular dynamics simulations",
                                "describe rigid-body pattern-matching algorithms",
                                "describe fragmental-based methods",
                                "describe stochastic optimization methods",
                                "describe hybrids strategies",
                                "introduce software tools for docking simulations",
                                "describe incremental construction based docking software tools",
                                "describe stochastic optimization-based methods",
                                "describe molecular dynamics simulations in lead discovery",
                                "introduce scoring functions",
                                "describe empirical scoring functions",
                                "describe molecular-mechanics-based scoring functions",
                                "introduce knowledge-based scoring functions",
                                "describe DrugScore, PMF, and BLEEP",
                                "explain assumptions of knowledge-based scoring functions",
                                "introduce concept of singlet preferences",
                                "describe hybrid scoring functions",
                                "explain consensus scoring",
                                "discuss file formats for structural and chemical information",
                                "introduce calculation of total electrostatic energies",
                                "describe classical formalisms for electrostatic desolvation",
                                "discuss full quantum mechanical treatment of electrostatics interactions",
                                "illustrate modeling system 100",
                                "describe configuration modeler 102",
                                "explain affinity calculator 109",
                                "describe descriptor data storage 120",
                                "discuss usage of modeling system 100",
                                "explain sampling of configurations",
                                "describe selection strategy for configuration sampling",
                                "discuss assessment of molecular combination",
                                "explain implementation of modeling system 100",
                                "describe storage media devices",
                                "discuss software processing components",
                                "explain configuration selector 112",
                                "describe feedback cycle",
                                "discuss combination postprocessor 116",
                                "explain generation of combination measures",
                                "describe selection of configurations",
                                "discuss statistical analysis of configuration results",
                                "explain pattern-matching methods",
                                "describe combination results records",
                                "discuss dynamic application of combination postprocessor 116",
                                "explain ranking of configurations",
                                "describe removal of configuration records",
                                "discuss molecular combination record database 104",
                                "explain input molecule records",
                                "describe input target record database and input ligand record database",
                                "discuss input target molecular records",
                                "explain input ligand molecular records",
                                "describe configuration data transformation engine 108",
                                "explain transformation of molecular configurations",
                                "discuss unary, binary, and n-ary operations",
                                "describe construction of new configurations",
                                "explain search and optimization techniques",
                                "discuss iterative process",
                                "describe stochastic search strategy",
                                "explain descriptor data storage 120"
                            ],
                            "num_characters": 42800,
                            "outline_medium": [
                                "introduce rational drug design",
                                "motivate computational modeling",
                                "describe structure-based rational drug design",
                                "define three-dimensional model of target structure",
                                "describe computational derivation of target structure",
                                "introduce library screening",
                                "describe computational modeling of target-ligand molecular interactions",
                                "define binding mode and binding energy",
                                "describe docking and scoring",
                                "discuss trade-offs between computational complexity and accuracy",
                                "summarize publications on computational drug discovery",
                                "describe rigid-body pattern-matching algorithms",
                                "describe incremental construction algorithms",
                                "describe stochastic optimization methods",
                                "describe molecular dynamics simulations",
                                "describe hybrid methods",
                                "introduce scoring functions",
                                "describe empirical scoring functions",
                                "describe molecular-mechanics-based scoring functions",
                                "introduce knowledge-based scoring functions",
                                "describe DrugScore, PMF, and BLEEP",
                                "explain inverse Boltzmann schemes",
                                "introduce hybrid scoring functions",
                                "describe VALIDATE",
                                "discuss consensus scoring",
                                "describe file formats for structural and chemical information",
                                "calculate total electrostatic energies",
                                "describe classical formalisms for electrostatic desolvation",
                                "illustrate modeling system 100",
                                "describe configuration modeler 102",
                                "explain affinity calculator 109",
                                "describe descriptor data storage 120",
                                "model molecular combinations",
                                "sample configurations during modeling",
                                "evaluate affinity function for each configuration",
                                "assess molecular combination",
                                "implement modeling system 100",
                                "describe configuration selector 112",
                                "generate instructions for configuration data transformation engine",
                                "describe combination postprocessor 116",
                                "generate combination measures"
                            ],
                            "outline_short": [
                                "introduce rational drug design",
                                "motivate computational modeling",
                                "describe structure-based rational drug design",
                                "explain fragment-based drug discovery",
                                "define binding mode and binding energy",
                                "discuss docking and scoring",
                                "describe trade-offs in computational complexity",
                                "summarize software tools for docking and scoring",
                                "categorize scoring functions",
                                "introduce knowledge-based scoring functions",
                                "discuss calculation of total electrostatic energies",
                                "describe modeling system for analysis of molecular combinations",
                                "outline operation of configuration modeler",
                                "discuss implementation of modeling system",
                                "describe configuration selector and feedback cycle",
                                "outline combination postprocessor and generation of combination measures",
                                "discuss selection of configurations based on criteria",
                                "describe transformation of molecular configurations",
                                "outline search and optimization techniques",
                                "discuss descriptor data storage and affinity calculator"
                            ]
                        },
                        {
                            "title": "In Vitro and In Vivo Methods",
                            "paragraphs": [
                                "The methods related to drug design and discovery described in the present disclosure can include determining biological activity (including presence, absence or amount of biological activity, which can be also referred of “efficacy,” of a candidate compound or molecule (which can be, but is not limited to, a small molecule) identified and/or designed by computational (in silico) methods in an in vitro biological assay or in vivo in a subject (such as a model animal, for example, a wild-type animal, a laboratory-bred animal, or a transgenic animal model). The methods disclosed in the present disclosure can also include validating or confirming in silico predicted activities of a ligand, for example, in silico binding of the ligand to PD-1 conformation of the target protein, with the results of an in vitro biological assay, and/or with the results of an in vivo study in an animal model.",
                                "One assay in vitro platform suitable for evaluation of the ability of candidate compounds to block PD-1 interaction with its in vivo ligands is described in (116). The platform uses fluorescence-base transcriptional reporters based on the human Jurkat T cell line in conjunction with engineered T cell stimulator cell lines for investigating immune checkpoint signaling pathways, including PD-1 activity. A PD-1:PD-L2 cell-based inhibitor screening assay kit for conducting is a bioluminescent cell-based assay that can be used to screen and profile inhibitors of the PD-1:PD-L2 interaction is available from BPS Bioscience (San Diego, Calif.). In the above assay, as described in the assay data sheet, PD-1/NFAT Reporter/Jurkat T cells are used as effector cells; HEK293 cells over-expressing PD-L2 and an engineered T cell receptor (TCR) activator by transient transfection are used as target cells. When the cells are co-cultivated, TCR complexes on effector cells are activated by TCR activator on target cells, resulting in expression of the NFAT luciferase reporter. However, PD-1 and PD-L2 binding prevents TCR activation and suppresses the NFAT-responsive luciferase activity. In both scenarios, this inhibition can be specifically reversed by anti-PD-1 antibodies. This interaction also can be blocked by anti-PD-L2 antibodies. These neutralizing antibodies block PD-1 signaling and promote T cell activation, resulting in reactivation of the NFAT-responsive luciferase reporter. Another example of an in vitro assay suitable for evaluation of the ability of candidade compounds to block PD-1 interaction with its ligand in vitro is competition ELISA described in (117). As described in (117), the assay measures the amount of biotin tagged PD-1 that is able to bind to the wells coated with PD-L1. Similarly, PD-L2 can be used as an in vivo ligand. An example of an in vitro assay for testing biological activity of candidate compounds, also described in (117), is an assay testing the ability of candidate compounds to promote T cell function. As described in (117), the production of IL-2 by peripheral blood mononuclear cells (PBMCs) pre-treated with PD-1/PD-L1 antagonists (or inhibitors): neutralizing mAbs or candidate compounds before stimulation with Staphylococcal enterotoxin B (SEB) for 72 hours. PBMCs include the cells that express/up-regulate both PD-1 (T cells) and PD-L1 (T cells, APCs) upon stimulation. In this assay, cytokine levels from cell culture supernatants would indicate that stimulated T cells treated with a-PD-1/PD-L1 antagonist produced significantly higher concentrations of IL-2 compared to untreated and stimulated cells, with the cells pre-treated by neutralizing mAbs serving as a positive control. Some other in vitro assays suitable for evaluating biologica activity of candidate compounds are described in (118). In one assay, PBMC from normal healthy donors are seeded at 1×105 cells/well and stimulated with SEB in the presence of candidate compounds. IL-2 secretion by PMBC is measured by ELISA on day 3 after the stimulation. In another assay, mixed lymphocyte response is assessed by co-culturing 1×105 cells CD4+ T cells with allogeneic monocyte-derived dendritic cells (DC) at a ratio of 10:1 (T:DC) in flat-bottom 96-well microtiter plates. CD4+ T cells and DC are incubated for 6 days in the presence or absence of a candidate compound. Culture supernatants are harvested on day 5 for ELISA analysis of IFN-γ secretion. One more assay measures nonspecific T cell activation. In this assay, candidate compounds are mixed with samples of heparinized fresh human whole blood to measure cytokine release. After a 4-hour incubation at 37° C., the cells are pelleted, and the plasma fraction collected for measurement of IFN-γ, TNF-α, IL-2, IL-4, IL-6, and IL-10 using a cytokine cytometric bead array assay. Studies of potential anti-cancer effects of candidate compounds can also be performed in vitro in tumor-derived cell ilnes, such as D4m melanoma lines.",
                                "In vivo assays can be performed using animals, such as mice, with chemically induced or implanted tumors. Examples of in vivo assays using mouse models are described in (118). MC38 tumor cells are cultured in DMEM and implanted subcutaneously into female C57/Bl6 mice or B6.129S7-Ifngtm1Ts/J C57BL/6 mice. CT26 tumor cells are cultured in DMEM and implanted subcutaneously in female BALB/c mice. Tumor measurements are made 2-3 times weekly using an electronic caliper. Candidate compounds are administered to mice intraperitoneally on days 7, 10, and 13. For T-cell depletion studies, 500 μg of depleting antibodies for CD4 (GK1.5) or CD8 (53.6.72; BioXCell, W. Lebanon, N.H.) are administered on day 7. following subcutaneous implantation of MC38 tumor cells in the hind flank. The efficiency of CD4+ or CD8+ T cell depletion (>90%) is confirmed by FACS analysis of blood samples collected four days after administration of the depleting antibodies. Mice are sacrificed at the study termination or pre-determined endpoints. For immune response monitoring, tumors are harvested and processed using cell disruptors. The cell suspensions are clarified, pelleted, resuspended buffer or media, and counted. Cells are incubated with anti-CD16/32 mAb 24G.2 (BioXCell) to reduce background FcγR binding and then stained with antibodies specific for CD8, CD4, and CD45. Cells are also stained with the a fixable viability. For intracellular staining (ICS), cell samples are fixed, permeabilized, and stained with antibodies specific for FoxP3, Ki67, CTLA-4, IFN-γ, and TNF-α CT26 tumor antigen-specific CD8+ T cells are identified using AH-1 MHC class I tetramers. Ex vivo AH-1 peptide stimulation is performed by culturing tumor or splenic cells with 2 μM AH-1 peptide (MBL) in the presence of brefeldin-A for 4 hours at 37° C. Ex vivo cytokine staining is performed by fixing and staining cells as described above, directly after tissue harvest. Samples are analyzed on FACS flow cytometers. Cytokine assays of harvested tumor cells can also be performed using bead-bays cytokine arrays. Immunohistochemical studies of tumor sections can also be performed according to established procedures.",
                                "Any of the methods described in the present disclosure can further comprise determining the toxicity of the ligand in an in vitro, in vivo or in silico assay. As used in the present disclosure, toxicity refers to a harmful effect on a cell or organism. For example, and not to be limiting, the cardiotoxicity or neurotoxicity of a compound can be determined. In vitro methods for assessing cardiotoxicity are known in the art. For example, electrophysiology measurements can be performed in cells, including, for example single cardiac cells. The effect of one or more compounds can be assessed in cell lines that express the human ether-a-go-go related gene (hERG1) or in cells transfected with hERG1. The hERG safety assay from Cyprotex (Watertown, Mass.) can also be used. Cardiotoxicity can also be measured in vivo by conducting an electrocardiogram (ECG) in a subject (e.g., a wild type animal or transgenic animal) expressing hERG1 after administering the compound to the animal. In vitro cytotoxicity panels can also be used to measure toxicity in individual cells. For example, assays that measure nuclear size, mitochondrial membrane potential, intracellular calcium, membrane permeability and/or cell number can be used. See, for example, the ADME-Tox panel available from EuroFins PanLabs, Inc. (Redmond, Wash.). In this assay, all five parameters are measured. Intracellular calcium and membrane permeability will increase in the presence of a cytotoxic compound. Conversely, nuclear size, cell number and mitochondrial membrane potential will decrease in the presence of a cytotoxic compound.",
                                "Genotoxicity studies can also be performed to identify mutagenic compounds. Gene mutations can be detected in bacteria, where they cause a change in growth requirements. The Ames test, which is conducted using Salmonella typhimurium is a widely used bacterial assay for the identification of compounds that can produce gene mutations, and it shows high predictive value with rodent carcinogenicity tests. Micronucleus assays can also be used to identify mutagenic compounds. Micronucleus formation is a hallmark of genotoxicity. Micronuclei are chromatin-containing bodies that represent fragments or even whole chromosomes that were not incorporated into a daughter cell nucleus at mitosis. The purpose of the assay is to detect those agents that induce chromosome damage leading to the induction of micronuclei in interphase cells. Assays that measure Cytochrome p450 (CYP) inhibition, CYP induction or drug transporter inhibition can also be performed.",
                                "Any of the methods provided in the present disclosure can further comprise determining if a candidate compound or molecule has an adverse drug reaction (ADR) or off-target effect in an in vitro, in vivo or in silico assay. It should be noted that off-target effects may be desirable or undesirable effects. In silico methods for determining off-target effects are known in the art. See, for example (110-112). In vitro assays for assessing off-target effects are also known in the art. See (113) for a review of in vitro assays that can identify undesirable off-target activity. Any of the methods provided herein can further comprise optimizing the ligand. A candidate compound or molecule can be modified or optimized for certain properties. For example, a candidate compound or molecule can be modified to reduce its toxicity, to reduce an undesirable off-target effect, to increase the binding affinity to a target protein, to decrease the binding affinity to a target protein, to increase a desirable off-target activity or to decrease an off-target activity."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe in vitro and in vivo methods for drug design and discovery",
                                "determine biological activity of candidate compounds in vitro",
                                "validate in silico predicted activities with in vitro biological assay results",
                                "validate in silico predicted activities with in vivo study results",
                                "describe in vitro platform for evaluating ability of candidate compounds to block PD-1 interaction",
                                "describe bioluminescent cell-based assay for screening and profiling inhibitors of PD-1:PD-L2 interaction",
                                "describe competition ELISA for evaluating ability of candidate compounds to block PD-1 interaction",
                                "describe assay for testing biological activity of candidate compounds",
                                "describe assay for promoting T cell function",
                                "describe other in vitro assays for evaluating biological activity of candidate compounds",
                                "describe in vitro assay for measuring IL-2 secretion by PBMC",
                                "describe mixed lymphocyte response assay",
                                "describe assay for measuring nonspecific T cell activation",
                                "describe studies of potential anti-cancer effects of candidate compounds in vitro",
                                "describe in vivo assays using mouse models",
                                "describe tumor measurement and candidate compound administration in mice",
                                "describe T-cell depletion studies",
                                "describe immune response monitoring",
                                "describe intracellular staining and cytokine assays",
                                "describe immunohistochemical studies of tumor sections",
                                "describe determining toxicity of ligand in in vitro, in vivo, or in silico assay"
                            ],
                            "num_characters": 10731,
                            "outline_medium": [
                                "describe in vitro and in vivo methods for drug design and discovery",
                                "introduce in vitro biological assay platform for evaluating candidate compounds",
                                "describe PD-1:PD-L2 cell-based inhibitor screening assay kit",
                                "outline in vitro assay for testing biological activity of candidate compounds",
                                "describe competition ELISA for evaluating ability of candidate compounds to block PD-1 interaction",
                                "introduce in vitro assay for testing ability of candidate compounds to promote T cell function",
                                "describe in vivo assays using mouse models",
                                "outline tumor measurement and candidate compound administration in in vivo assays",
                                "describe immune response monitoring and cell staining in in vivo assays",
                                "introduce toxicity determination in in vitro, in vivo, or in silico assays"
                            ],
                            "outline_short": [
                                "describe in vitro and in vivo methods for drug design and discovery",
                                "introduce in vitro assay platforms for evaluating biological activity",
                                "detail in vitro assays for testing biological activity of candidate compounds",
                                "describe in vivo assays using animal models",
                                "discuss toxicity and genotoxicity studies"
                            ]
                        },
                        {
                            "title": "Computer Systems",
                            "paragraphs": [
                                "Any of the computer systems mentioned in the present disclosure may utilize any suitable number of subsystems. In some embodiments, a computer system includes a single computer apparatus, where the subsystems can be the components of the computer apparatus. In other embodiments, a computer system can include multiple computer apparatuses, each being a subsystem, with internal components. The subsystems can be interconnected via a system bus. Additional subsystems such as a printer, keyboard, storage device(s), monitor, which is coupled to display adapter, and others are shown. Peripherals and input/output (I/O) devices, which couple to I/O controller, can be connected to the computer system by any number of means known in the art, such as serial port. For example, serial port or external interface (e.g. Ethernet, Wi-Fi, etc.) can be used to connect computer system to a wide area network such as the Internet, a mouse input device, or a scanner. The interconnection via system bus allows the central processor to communicate with each subsystem and to control the execution of instructions from system memory or the storage device(s) (e.g., a fixed disk, such as a hard drive or optical disk), as well as the exchange of information between subsystems. The system memory and/or the storage device(s) may embody a computer readable medium. Any of the data mentioned herein can be output from one component to another component and can be output to the user.",
                                "A computer system can include a plurality of the same components or subsystems, e.g., connected together by external interface or by an internal interface. In some embodiments, computer systems, subsystem, or apparatuses can communicate over a network. In such instances, one computer can be considered a client and another computer a server, where each can be part of a same computer system. A client and a server can each include multiple systems, subsystems, or components.",
                                "It should be understood that any of the embodiments of the present invention can be implemented in the form of control logic using hardware (e.g. an application specific integrated circuit or field programmable gate array) and/or using computer software with a generally programmable processor in a modular or integrated manner. As user herein, a processor includes a multi-core processor on a same integrated chip, or multiple processing units on a single circuit board or networked. Based on the disclosure and teachings provided herein, a person of ordinary skill in the art will know and appreciate other ways and/or methods to implement embodiments of the present invention using hardware and a combination of hardware and software.",
                                "Any of the software components or functions described in this application may be implemented as software code to be executed by a processor using any suitable computer language such as, for example, Java, C++ or Perl using, for example, conventional or object-oriented techniques. The software code may be stored as a series of instructions or commands on a computer readable medium for storage and/or transmission, suitable media include random access memory (RAM), a read only memory (ROM), a magnetic medium such as a hard-drive or a floppy disk, or an optical medium such as a compact disk (CD) or DVD (digital versatile disk), flash memory, and the like. The computer readable medium may be any combination of such storage or transmission devices.",
                                "Such programs may also be encoded and transmitted using carrier signals adapted for transmission via wired, optical, and/or wireless networks conforming to a variety of protocols, including the Internet. As such, a computer readable medium according to an embodiment of the present invention may be created using a data signal encoded with such programs. Computer readable media encoded with the program code may be packaged with a compatible device or provided separately from other devices (e.g., via Internet download). Any such computer readable medium may reside on or within a single computer product (e.g. a hard drive, a CD, or an entire computer system), and may be present on or within different computer products within a system or network. A computer system may include a monitor, printer, or other suitable display for providing any of the results mentioned herein to a user.",
                                "The methods described herein may be totally or partially performed with a computer system including one or more processors, which can be configured to perform the steps. Thus, embodiments can be directed to computer systems configured to perform the steps of any of the methods described herein, potentially with different components performing a respective steps or a respective group of steps. Although presented as numbered steps, steps of methods herein can be performed at a same time or in a different order. Additionally, portions of these steps may be used with portions of other steps from other methods. Also, all or portions of a step may be optional. Additionally, any of the steps of any of the methods can be performed with modules, circuits, or other means for performing these steps."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe computer systems and subsystems",
                                "describe interconnection of subsystems via system bus",
                                "describe peripherals and input/output devices",
                                "describe connection to wide area network",
                                "describe computer readable medium",
                                "describe implementation of embodiments using hardware and software",
                                "describe software components and functions",
                                "describe storage and transmission of software code",
                                "describe computer readable medium for storage and transmission",
                                "describe computer system configured to perform steps of methods"
                            ],
                            "num_characters": 5130,
                            "outline_medium": [
                                "describe computer system architecture and components",
                                "introduce subsystems and interconnections in computer systems",
                                "describe peripherals and input/output devices in computer systems",
                                "outline software implementation using hardware and computer languages",
                                "describe computer readable media and transmission of software components"
                            ],
                            "outline_short": [
                                "describe computer system architecture and components",
                                "discuss software implementation and computer readable media"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce PD-1 receptor",
                        "describe PD-1 ligands",
                        "motivate identification of new ligands",
                        "describe limitations of current methods",
                        "summarize previous attempts to determine PD-1 structure",
                        "describe stabilization of PD-1/PD-L2 complex",
                        "determine structure of PD-1/PD-L2 binding pocket",
                        "describe application of structure in drug discovery",
                        "exemplify drug discovery process",
                        "describe computational screening of compounds",
                        "describe testing of potential leads",
                        "describe importance of in silico lead identification",
                        "provide exemplary amino acid sequence of human PD-1 protein",
                        "describe structures of human triple-mutant PD-1/PD-L2 complex",
                        "describe apo triple-mutant PD-1 variant",
                        "summarize conformational changes of CC′ and FG loops",
                        "motivate design and discovery of small-molecule PD-1 inhibitors",
                        "describe advantages of small-molecule inhibitors",
                        "describe limitations of current small-molecule ligands",
                        "describe in vivo binding of PD-1 to PD-L1 and PD-L2",
                        "describe formation of cavity on ligand-binding surface of PD-1",
                        "describe difficulties in obtaining human PD-1/PD-L2 complex structure",
                        "describe realization of allosteric effect of CC′ and FG loops",
                        "describe application of pocket in virtual drug discovery"
                    ],
                    "num_characters": 12508,
                    "outline_medium": [
                        "introduce PD-1 receptor and its role in immune responses",
                        "motivate need for identifying ligands that bind to PD-1",
                        "describe limitations of current methods for identifying PD-1 ligands",
                        "summarize previous attempts to determine structure of human PD-1/PD-L2 complex",
                        "describe inventors' approach to stabilizing PD-1/PD-L2 complex structure",
                        "summarize determination of human PD-1/PD-L2 binding pocket structure",
                        "describe potential applications of human PD-1/PD-L2 binding pocket structure",
                        "provide exemplary amino acid sequence of human PD-1 protein",
                        "describe structures of human triple-mutant PD-1/PD-L2 complex and apo triple-mutant PD-1 variant",
                        "summarize conformational changes in CC′ and FG loops upon PD-L2 binding",
                        "describe potential for small-molecule PD-1 inhibitors and their advantages",
                        "outline potential uses of human PD-1/PD-L2 binding pocket structure in drug development"
                    ],
                    "outline_short": [
                        "introduce PD-1 receptor and its role in immune responses",
                        "describe limitations of identifying PD-1 ligands due to lack of defined binding pocket",
                        "summarize previous attempts to determine structure of human PD-1/PD-L2 complex",
                        "describe inventors' approach to stabilizing PD-1/PD-L2 complex and determining its structure",
                        "discuss applications of human PD-1/PD-L2 binding pocket structure in drug discovery and development",
                        "illustrate conformational changes in PD-1 loops and their implications for drug design"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "The following examples are offered to illustrate, but not to limit the claimed invention."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1: Materials and Methods",
                            "paragraphs": [
                                "A. Yeast-Surface Display",
                                "Deep mutational scanning of the CC′ and FG loops of human PD-1 was performed using a previously described PCR-based method (24). The PD-1 loop variant libraries were constructed using the Saccharomyces cerevisiae EBY100 strain. MACS and FACS experiments were performed using recombinant human PD-L2-Fc or PD-L1-Fc proteins. The yeast strains and plasmids used in the study are summarized in Table 1.",
                                "B. Bio-Layer Interferometry",
                                "BLI was performed on an Octet RED96® system at 30° C. in a buffer of 150 mM NaCl, 20 mM HEPES:NaOH pH 7.4, 0.1% BSA and 0.05% Tween 20. The human PD-1-Fc proteins were loaded onto anti-human IgG Fc capture (AHC) biosensors, associated in defined concentrations of human PD-L2-His6 or PD-L1-His6 proteins, and then dissociated in buffer.",
                                "C. Protein Crystallization and X-Ray Crystallography",
                                "The human apo-PD-1N74G T76P A132V and human apo-PD-1T76P A132V proteins were over-expressed in and refolded from the inclusion bodies of Escherichia coli BL21(DE3) cells. The human apo-PD-1N74G T76P A132V protein was crystallized in 100 mM NaCl, 100 mM Tris:HCl pH 8.0, 27% (w/v) PEG-MME 5,000. The human apo-PD-1T76P A132V protein was crystallized in 100 mM NaCl, 100 mM Tris:HCl pH 8.0, 36% (w/v) PEG 3,350. The human PD-1N74G T76P A132V and human PD-L2IgV protein complex was produced using the human Expi293F cell line. The complex was crystallized in 200 mM magnesium acetate, 10% (w/v) PEG 8000. All X-ray diffraction data were collected at the SSRL beam lines 12-2 or 14-1, and processed using HKL-3000 (42). Molecular replacement, refinement and density modification were performed in Phenix (43) and model building in Coot (44). The crystallographic data collection and refinement statistics are summarized in Table 2."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe yeast-surface display",
                                "describe bio-layer interferometry",
                                "describe protein crystallization and X-ray crystallography"
                            ],
                            "num_characters": 1775,
                            "outline_medium": [
                                "describe yeast-surface display and bio-layer interferometry"
                            ],
                            "outline_short": [
                                "describe yeast-surface display, bio-layer interferometry, and protein crystallization and X-ray crystallography"
                            ]
                        },
                        {
                            "title": "Example 2: Engineering Human PD-1 Loop Variants with Enhanced PD-L2 Affinity",
                            "paragraphs": [
                                "Substantial earlier efforts (23) to crystalize the human PD-1/PD-L2 complex were unsuccessful. Previous studies (16, 17, 19) indicated that the PD-1 ligand-binding interface comprises a hydrophobic core, the CC′ loop and the FG loop, and that formation of a complex with ligands results in loop movement and pocket formation in the hydrophobic core. In the present study, it was conceived that mutations in these two loops of PD-1 were coupled to pocket formation and may alter the affinity for PD-L2. It was then experimentally confirmed that poly-glycine mutants of these loops in human PD-1 significantly decreased its affinities for PD-L2 (data not shown). The binding of sensor-loaded PD-1, the glycine-loop-mutants and the pocket mutant to 1.9 μM PD-L2 (left) and 17 μM PD-L1 (right) was measured using biolayer interferometry. Corresponding PD-1-Fc proteins were loaded onto anti-human IgG Fc capture (AHC) biosensors. Association was monitored for 2 min and dissociation for 2 min. Since the present study was particularly interested in the structure of the PD-1 pocket when bound to PD-L2, the residues in the hydrophobic core were maintained, and directed evolution was performed exclusively in the CC′ loop (residues 70-78) and the FG loop (residues 127-133) of human PD-1. Deep mutational scanning (24, 27) was used to construct loop-variant libraries with trinucleotides encoding each of 20 residues at each position. Next, yeast-surface display (25) was used with a recombinant human PD-L2-human Fc fusion protein as the selection agent. After two rounds of selection using magnetic- and fluorescent-activated cell sorting (MACS and FACS), human PD-1 loop-variant clones with single-residue substitutions were isolated (data not shown). Substitutions at two residues were identified in the CC′ loop (N74G and T76P), and at one residue in the FG loop (A132V, A132L). In contrast, when the same yeast library was used for section with PD-L1-Fc, only the A132 substitutions were isolated as high-affinity variants (data not shown). This result suggested that the N74G and T76P variants were PD-L2-binding specific. PD-1T76P was chosen as a template to generate a second PD-1 loop variant library and selected for further enhancement of PD-L2 binding. As a result, a PD-1 triple mutant was obtained, which contained all three substitutions identified from the first library, N74G, T76P and A132V."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate directed evolution of PD-1 loop variants",
                                "describe construction of loop-variant libraries",
                                "describe selection of high-affinity variants",
                                "describe characterization of PD-1 loop variants"
                            ],
                            "num_characters": 2406,
                            "outline_medium": [
                                "motivate directed evolution of PD-1 loop variants",
                                "describe construction of loop-variant libraries and selection using yeast-surface display"
                            ],
                            "outline_short": [
                                "describe directed evolution of human PD-1 loop variants with enhanced PD-L2 affinity"
                            ]
                        },
                        {
                            "title": "Example 3: PD-1 Loop Variants Showed Increased Binding Affinity and Association Kinetics for PD-L2 and PD-L1",
                            "paragraphs": [
                                "To validate the enhanced affinity of PD-1 loop variants, human PD-1 and the loop variants, as well as human PD-L2 and PD-L1 ectodomain proteins, were recombinantly expressed and purified. Using bio-layer interferometry (BLI), the binding of PD-L2 to wild-type PD-1 and the variants was compared (data not shown). The binding of sensor-loaded PD-1 and the loop variants to 190 nM PD-L2 and 1.1 μM PD-L1 was measured using biolayer interferometry. Corresponding PD-1-Fc proteins were loaded on anti-human IgG Fc capture (AHC) biosensors. Association was monitored for 2 min and dissociation for 2 min. Fitting of binding curves was performed in Graphpad Prism 8 software using built-in equations of “Receptor binding—kinetics” models. Means and standard deviations were calculated from 3-4 independent experiments. Wild-type PD-1 bound PD-L2 with a KD of 500 nM. The variants all exhibited increased PD-L2 affinity, with KD of 170 nM for N74G, 12 nM for T76P, and 69 nM for A132V. Remarkably, the PD-1 triple mutant had a KD of 2.6 nM, exhibiting a ˜200-fold increase in PD-L2 binding affinity. Table 3 summarizes the binding affinity (KD) and kinetic parameters (association constant kon, dissociation constant koff) for the PD-1 loop variants binding to PD-L2 or PD-L1. Fitting of binding curves was performed in Graphpad Prism 8 using built-in equations of “Receptor binding—kinetics” models. Means and standard deviations were calculated from 3-4 independent experiments. The triple-mutant also showed substantially increased affinity for PD-L1. The A132V mutant showed increased affinity for PD-L1, consistent with previous reports (19, 23, 28, 29), but the N74G and T76P single mutants had minor effects. Thus, a human PD-1 triple-mutant exhibited potent binding affinity enhancement for both PD-L1 and PD-L2. Kinetic measurements of binding of the ligands by PD-1 with BLI also permitted the determination of association constants (kon). Compared to wild-type PD-1, all loop variants showed increased kon for binding PD-L2. The PD-1 triple mutant showed a 3-fold increase of kon for PD-L2, and 14-fold for PD-L1. These results suggested that these amino acid substitutions in the loops stabilized the ligand-bound state among the conformational ensembles of apo-PD-1 (17, 19)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe validation of enhanced affinity of PD-1 loop variants",
                                "describe binding of PD-L2 to wild-type PD-1 and variants",
                                "describe fitting of binding curves",
                                "describe kinetic measurements of binding"
                            ],
                            "num_characters": 2281,
                            "outline_medium": [
                                "describe validation of enhanced affinity of PD-1 loop variants",
                                "summarize binding affinity and kinetic parameters for PD-1 loop variants"
                            ],
                            "outline_short": [
                                "describe binding affinity and association kinetics of PD-1 loop variants for PD-L2 and PD-L1"
                            ]
                        },
                        {
                            "title": "Example 4: X-Ray Crystal Structure of the Human PD-1/PD-L2 Complex",
                            "paragraphs": [
                                "The human PD-1/PD-L2 complex was crystallized using the PD-1 triple mutant. Site-directed mutagenesis was used to remove all N-linked glycosylation sites in each protein in an effort to aid crystallization, as illustrated by the protein sequences summarized in Table 4. Co-expression of the PD-1 triple mutant and the PD-L2 IgV domain yielded a stable and 1:1 stoichiometric complex, which was purified. The crystals of the human PD-1N74G T76P A132V/PD-L2IgV complex were successfully obtained, and a 2.0 Å resolution structure of the complex by X-ray crystallography was determined. The structure is illustrated, for example, in FIG. 1A. The crystal contained one PD-1/PD-L2 complex per asymmetric unit, with space group P 21 21 21. The crystallographic data collection and refinement statistics are summarized in Table 2. The human PD-1/PD-L2 complex adopted an architecture similar to the previously determined murine PD-1/PD-L2 complex (19) with a Ca root-mean-square deviation (R.M.S.D.) of 3.8 Å.",
                                "The structure of human PD-1/PD-L2 complex revealed that human PD-1/PD-L2 interface was formed by the front β-sheets of both IgV domains, as illustrated in FIG. 1B, burying 1,840 Å2 (14% of the total) of solvent-accessible surface area. In the interface, notable interacting residues included the three highly conserved aromatics W110L2, Y112L2 and Y114L2 from PG of the PD-L2 IgV domain. The sidechains of these residues pointed into the center of the PD-1 ligand-binding surface, as illustrated in FIGS. 4A and 4B. To validate the interactions observed at the PD-1/PD-L2 interface, site-directed mutagenesis on several PD-1 and PD-L2 interfacial residues was performed. Using BLI, reduced binding of PD-1 interface mutants to PD-L2, and PD-L2 interface mutants to PD-1 was observed. The observed reduced binding was consistent with the structure of human PD-1/PD-L2 complex. The high-affinity loop substitutions of PD-1 localized to the interface, as illustrated in FIG. 1B. Among them, T76P and A132V made additional contacts to PD-L2, likely contributing to the increase in affinity, as illustrated in FIG. 5."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe crystallization of human PD-1/PD-L2 complex",
                                "describe structure determination",
                                "describe architecture of human PD-1/PD-L2 complex",
                                "describe validation of interactions at PD-1/PD-L2 interface"
                            ],
                            "num_characters": 2116,
                            "outline_medium": [
                                "describe crystallization and structure determination of human PD-1/PD-L2 complex",
                                "summarize structure of human PD-1/PD-L2 complex"
                            ],
                            "outline_short": [
                                "describe X-ray crystal structure of human PD-1/PD-L2 complex"
                            ]
                        },
                        {
                            "title": "Example 5: X-Ray Crystal Structures of Human Apo-PD-1 Loop Variants",
                            "paragraphs": [
                                "To assist analyses of the conformational change of PD-1 associated with PD-L2 binding, two human apo-PD-1 loop variants (see Table 4 for the amino acid sequences) were crystallized and their X-ray crystal structures were determined at 1.2 Å and 1.4 Å resolution, for PD-1N74G T76P A132V and PD-1T76P A132V respectively. Crystals of both variants contain a single PD-1 molecule per asymmetric unit, with space group P 32 2 1 (see Table 2 for crystallographic data collection and refinement statistics). Both PD-1 variants were well-defined by the electron density maps with a notable exception of the CC′ loop discussed further below. Superimposing the apo and PD-L2-bound PD-1N74G T76P A132V structures resulted in a Cα R.M.S.D. of 1.6 Å. The C′D loop of PD-1 (residues 83-92) was previously known to be a major part of the pembrolizumab epitope (30-32). This loop was not previously resolved in structures of human PD-1 without pembrolizumab (17, 23, 33), but it was clearly in both apo-PD-1 structures described in the present disclosure. The results of the structure determination indicated that the conformation of the loop changed significantly upon antibody binding."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe crystallization and structure determination of apo-PD-1 loop variants",
                                "describe conformational change of PD-1 associated with PD-L2 binding"
                            ],
                            "num_characters": 1172,
                            "outline_medium": [
                                "describe crystallization and structure determination of human apo-PD-1 loop variants"
                            ],
                            "outline_short": [
                                "describe X-ray crystal structures of human apo-PD-1 loop variants"
                            ]
                        },
                        {
                            "title": "Example 6: Formation of a Prominent Pocket in Human PD-1 Upon Binding PD-L2, with Human PD-1 Pocket Having Architecture Distinct from that of Murine PD-1 Pocket",
                            "paragraphs": [
                                "The structures of the human PD-1/PD-L2 complex and apo-PD-1 variants described in the present disclosure permitted the examination of formation of human PD-1 pocket in the PD-1/PD-L2 interface. Although human apo-PD-1 has a flat ligand-binding interface, as illustrated in FIG. 2A, the structures described in the present disclosure revealed that there were rearrangements in this interface upon binding of PD-L2. These rearrangements involved residues in βC (F63, V64, N66, Y68), βF (L122, G124, I126), βG (I134, E136) and the C′D loop (E84) forming a deep and extended pocket (illustrated in FIG. 2B), accommodating PD-L2 sidechains including the aromatic residues W110L2 and Y112L2, as illustrated in FIG. 2C. Each of these residues in PD-1 is within 4.4 Å of a PD-L2 residue (Table 5).",
                                "Comparison of the PD-1 pockets in the human and murine PD-1/PD-L2 complexes demonstrated striking differences in pocket geometries. Human PD-1 pocket adopted an open, funnel-shaped architecture. Compared to murine PD-1 pocket, human PD-1 pocket has a wider entrance and a narrower exit (illustrated in FIG. 2B). The structured described in the present disclosure revealed that distinct pocket geometries arise from at least two considerations. First, human PD-1 was revealed to employ a different subset of interfacial residues to form the pocket, as compared to murine PD-1. Human PD-1 lacks an ordered PC″ strand, and thus the open pocket in human PD-1 is formed by rearranging residues F63, V64 and E84. In contrast, murine PD-1 pocket is closed with sidechains of A81 and S83 forming a boundary. Second, several sequence variations exist among the residues that form the pocket. For example, V64 and Y68 in human PD-1 are substituted with M64 and N68 in murine PD-1, respectively. To quantitatively evaluate the pocket dimensions, pocket volumes were measured using POCASA 1.1 (34). Human and murine PD-1 pockets were measured to have volumes of 130 Å3 and 154 Å3, respectively. Notably, these pockets were comparable in size to other protein cavities with established small-molecule inhibitors (20, 21, 35).",
                                "The structure of human PD-1/PD-L2 described in the present disclosure was compared with the previously determined human PD-1/PD-L1 structure (17). Superimposing the two structures resulted in a Ca R.M.S.D. of 1.5 Å for PD-1 residues. Binding PD-L1 triggered formation a much smaller cavity in human PD-1, as compared to binding of PD-L2, with the cavity having a measured volume of 40 Å3. PD-L1 lacks a large aromatic sidechain corresponding to W110L2, so the PD-1 rearrangement was revealed to involve only a small subset of the interfacial residues to accommodate the sidechain of Y123L1, corresponding to PD-L2 residue Y112L2. These results showed that the core of the human PD-1 interface had remarkable structural plasticity and the ability to form pockets with varied dimensions, permitting the interactions with different PD-1 ligands."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe formation of human PD-1 pocket upon binding PD-L2",
                                "describe architecture of human PD-1 pocket",
                                "describe comparison of human and murine PD-1 pockets",
                                "describe pocket dimensions",
                                "describe structural plasticity of human PD-1 ligand-binding interface"
                            ],
                            "num_characters": 2947,
                            "outline_medium": [
                                "describe formation of human PD-1 pocket upon binding PD-L2",
                                "compare human and murine PD-1 pockets"
                            ],
                            "outline_short": [
                                "describe formation of a prominent pocket in human PD-1 upon binding PD-L2"
                            ]
                        },
                        {
                            "title": "Example 7: The CC′ Loop in the Triple-Mutant PD-1 Adopts a Ligand-Bound Conformation in the Absence of Ligand",
                            "paragraphs": [
                                "Conformational changes in the CC′ and FG loops upon binding of PD-L2 to human PD-1 were observed (data not shown). Earlier studies showed that the CC′ loop underwent a substantial conformational change when human PD-1 binds PD-L1 (17, 33). This CC′ loop conformational change was even larger in the human PD-1/PD-L2 structure described in the present disclosure. Strikingly, in the absence of ligands, the CC′ loop conformations of the PD-1 triple and double mutants resembled that of the ligand-bound conformations. For example, a 4.8 Å shift was observed between the Ca of T76 and P76 in the PD-1 triple mutant of apo-PD-1. When the triple-mutant PD-1 bound PD-L2, the sidechain of P76 maintained the same conformation. An increased population of the ligand-bound conformations in the mutant apo-PD-1 proteins was consistent with increased association constants (kon) of the PD-1 variants.",
                                "In contrast, the conformations of the FG loop were the same in all three apo-PD-1 structures (one with an A132L substitution in the FG loop (23) and the triple and double mutants described in the present disclosure. Upon binding PD-L1 (17), there were no significant conformational changes in the FG loop. There was, however, a substantial shift in the FG loop conformation upon binding PD-L2."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe conformational changes in CC′ and FG loops upon binding PD-L2",
                                "describe ligand-bound conformation of CC′ loop in apo-PD-1 triple mutant"
                            ],
                            "num_characters": 1286,
                            "outline_medium": [
                                "describe conformational changes in CC′ and FG loops upon binding of PD-L2"
                            ],
                            "outline_short": [
                                "describe conformational changes in the CC′ loop of PD-1"
                            ]
                        },
                        {
                            "title": "Example 8: Structural plasticity of the human PD-1 ligand-binding interface",
                            "paragraphs": [
                                "To further investigate how the loop changes were associated with pocket formation, the apo and PD-L2-bound structures of the human triple-mutant PD-1 were superimposed (data not shown). Upon binding PD-L2, a large conformational change I in the PD-1 ligand-binding interface. A three-residue shortening of βC was observed, and βC and βF moved apart to create a deep cleft. The rearrangements that I in the pocket propagated to the edge of the FG loop, resulting in a remarkable 8.2 Å lateral shift. The overall change was less dramatic in murine PD-1. The closed architecture of the murine pocket did not require flipping of residues E84 and F63, as seen in human PD-1, and there was no secondary structure change of βC in murine PD-1. Taken together, the results described in the present disclosure provide a structural basis for systematic rearrangements at the human PD-1 ligand-binding interface coupling pocket formation and changes in the loops of PD-1 when it binds PD-L2."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe structural plasticity of human PD-1 ligand-binding interface"
                            ],
                            "num_characters": 979,
                            "outline_medium": [
                                "describe conformational changes in human PD-1 ligand-binding interface upon binding PD-L2"
                            ],
                            "outline_short": [
                                "describe structural plasticity of the human PD-1 ligand-binding interface"
                            ]
                        },
                        {
                            "title": "Example 9: Coordinates and Structure Factors",
                            "paragraphs": [
                                "The atomic coordinates and structure factors for human PD-1N74G T76P A132V/PD-L2IgV complex, human apo-PD-1N74G T76P A132V and apo-PD-1T76P A132V is included as Tables 6-8, respectively, which are found in an Appendix."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe coordinates and structure factors for human PD-1/PD-L2 complex and apo-PD-1 loop variants"
                            ],
                            "num_characters": 218,
                            "outline_medium": [
                                "provide coordinates and structure factors for human PD-1/PD-L2 complex and apo-PD-1 loop variants"
                            ],
                            "outline_short": [
                                "provide coordinates and structure factors for human PD-1/PD-L2 complex and apo-PD-1 loop variants"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce examples of the claimed invention"
                    ],
                    "num_characters": 89,
                    "outline_medium": [
                        "illustrate claimed invention"
                    ],
                    "outline_short": [
                        "describe examples of the claimed invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An in silico method of identifying a compound that binds to PD-L2 binding pocket of human PD-1, the method comprising:\n(a) receiving, by a computer system, information on a three-dimensional structure of PD-L2 binding pocket of human PD-1 comprising a plurality of amino acids;\n(b) receiving, by the computer system, information on a three-dimensional structure of a candidate compound;\n(c) using the computer system and the information received into the computer system in steps (a) and (b), performing one or more of molecular dynamic simulations, kinetic Monte Carlo (KMC) simulations, direct simulations Monte Carlo (DSMC), or density functional theory (DFT) simulations to determine if the candidate compound binds to the PD-L2 binding pocket of human PD-1, thereby identifying the compound that binds to PD-L2 binding pocket of human PD-1.",
        "2. A protein comprising a ligand binding pocket with a three-dimensional structure corresponding to a structure of PD-L2 binding pocket of a variant of human PD-1 with one or more of amino acid substitutions in residues corresponding to N74, T76 or A132 of SEQ ID NO:1.",
        "3. A variant of human PD-1 comprising one or more of amino acid substitutions in residues corresponding to N74, T76 and A132 of SEQ ID NO:1."
    ]
}