{
    "id": "US20230279344",
    "authors": [
        "Salwa Alshehri",
        "Charlotte Hauser",
        "Ram Karan",
        "Magnus Rueping"
    ],
    "title": "AIR-LOADED GAS VESICLE NANOPARTICLES FOR PROMOTING CELL GROWTH IN 3D BIOPRINTED TISSUE CONSTRUCTS",
    "date": "2021-09-01 00:00:00",
    "abstract": "The present disclosure relates to a method of high yielding production of gas vesicle nanoparticles (GVNPs) and genetic tools used for high-yielding GVNPs production. The present disclosure further relates to a method of creating 3D tissue constructs with improved cell viability and proliferation and the resulting 3D tissue constructs. The GVNPs can promote cell growth and proliferation in 3D constructs and are suitable bioinks components for a bioprinter to build 3D structures through 3D printing as well as other applications.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "REFERENCE TO A “SEQUENCE LISTING”",
                    "paragraphs": [
                        "The present application includes a Sequence Listing which has been submitted electronically in an ASCII text format. This Sequence Listing is named 114147-23830US01_sequence listing.TXT was created on Aug. 27, 2021, is 1,418 bytes in size and is hereby incorporated by reference in its entirety."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "incorporate sequence listing by reference"
                    ],
                    "num_characters": 295,
                    "outline_medium": [
                        "incorporate sequence listing by reference"
                    ],
                    "outline_short": [
                        "incorporate sequence listing by reference"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Field of the Invention",
                            "paragraphs": [
                                "The present disclosure relates to a method of high yielding production of gas vesicle nanoparticles (GVNPs) and tools used for high-yielding GVNPs production. The present disclosure further relates to a method of creating 3D tissue constructs with improved cell viability and proliferation and the resulting 3D tissue constructs."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define field of invention"
                            ],
                            "num_characters": 329,
                            "outline_medium": [
                                "define field of invention"
                            ],
                            "outline_short": [
                                "define field of invention"
                            ]
                        },
                        {
                            "title": "Background of the Invention",
                            "paragraphs": [
                                "Human organs may be defined by their complex, functional organization of diverse, specialized cells and tissues1. The rising incidence rates of disease and injury leading to organ failure have led to increased demand for tissue and organ transplants. This growing demand has given rise to tissue engineering, whereby scaffolds, cells, and biologically active molecules are combined to assemble functional constructs. The goal is to develop constructs capable of restoring, improving, or maintaining damaged tissues and organs2. Of the many methods to generate these functional three-dimensional structures, 3D-bioprinting is most promising due to its ability to produce complex, scalable tissue constructs. The printing of these cellularized structures through the precise layering of cell-laden bioinks may be accomplished using inkjet-based, extrusion, stereolithography, or laser-assisted printing systems3-5. While each printer has its advantages over the others, many challenges remain to face before this technology can be translated into clinical practice, regardless of the printer setup6.",
                                "Significant issues with 3D bioprinting include identifying suitable bioinks and ensuring adequate nutrient supply to the cells7-12. While a great deal of effort has been focused on developing novel biomaterial candidates, it has been much harder to find a solution to address the diffusion barrier associated with the printed construct. The diffusion barrier is an inherent result of the nature of the bioink scaffolding material, which hinders the migration of nutrients, ranging from growth factors to oxygen, to the center. This diffusion barrier must be overcome as delivering these nutrients ensures the cells' survival, proliferation, and differentiation.",
                                "As such, oxygen-releasing biomaterials have been explored as a means of promoting its diffusion throughout the construct. Most of the oxygen-releasing biomaterials developed so far involve scaffolds integrated with peroxides and fluorinated compounds in the form of liquids or solid micro- and nanoparticles13, 14. Although early reports of these materials are promising, they all require the insertion of materials that do not occur naturally within the human body15-17. This introduces additional uncertainty about the fate of these materials as they lack the inherent biodegradability of bio-molecules, such as proteins.",
                                "Due to the limitations of the oxygen-releasing biomaterials, there exists a need for a new class of biomaterials that can facilitate nutrient migration within the tissue constructs.",
                                "Furthermore, haloarchaeal gas vesicle nanoparticles (GVNPs) are attractive for biotechnological and biomedical applications and have already found use as drug delivery systems and contrast agents for ultrasound and magnetic resonance imaging22-27. While the biotechnological tools for the expression of GVNPs are established, production so far suffers from the slow growth rates, the inconsistent induction system, and genetic instability of the Halobacterium expression host.",
                                "Therefore, a method of fast and efficient production of GVNPs is also needed.",
                                "In addition, it is also desirable to provice a biocompatible compound that is capable of forming a hydrogel that meets at least some of the above requirements to a higher extent than currently available hydrogels and that is not restricted by the above mentioned limination."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate tissue engineering",
                                "describe 3D bioprinting",
                                "limitations of 3D bioprinting",
                                "describe oxygen-releasing biomaterials",
                                "limitations of oxygen-releasing biomaterials",
                                "motivate gas vesicle nanoparticles"
                            ],
                            "num_characters": 3401,
                            "outline_medium": [
                                "motivate tissue engineering",
                                "limitations of 3D bioprinting",
                                "need for new biomaterials"
                            ],
                            "outline_short": [
                                "motivate need for tissue engineering and 3D bioprinting"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "According to a first broad aspect the present disclosure provides a 3-dimensional construct comprising ultrashort peptide scaffold; gas vesicle; and at least one mammalian cells.",
                        "According to a second broad aspect the present disclosure provides a method of high-yielding production of gas vesicle comprising amplifying a gas vesicle operon from the genome of a gas vesicle operon containing bacterium; cloning the gas vesicle operon into an expression plasmid; transforming the gas vesicle operon containing expression plasmid into Haloferax volcanii; culturing the Haloferax volcanii transformed with the gas vesicle operon containing expression plasmid; lysing the Haloferax volcanii transformed with the gas vesicle operon containing expression plasmid; and collecting the gas vesicle.",
                        "According to a third broad aspect the present disclosure provides a method of creating 3-dimensional construct comprising dissolving at least one ultrashort peptide to form a peptide solution; mixing mammalian cells with the peptide solution; dissolving the gas vesicle to form a gas vesicle solution; adding the gas vesicle solution to the mammalian cells containing peptide solution; and building 3-dimensional construct using the peptide solution containing both gas vesicle and mammalian cells; wherein the ultrashort peptide is dissolved in water or buffer solution.",
                        "Other aspects and features of the present disclosure will become apparent to those skilled in the art upon review of the following description of specific embodiments of the invention in conjunction with the accompanying figures."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize 3D construct",
                        "summarize method of high-yielding production of gas vesicle",
                        "summarize method of creating 3D construct"
                    ],
                    "num_characters": 1594,
                    "outline_medium": [
                        "summarize invention aspects"
                    ],
                    "outline_short": [
                        "summarize invention aspects"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Definitions",
                            "paragraphs": [
                                "Where the definition of terms departs from the commonly used meaning of the term, applicant intends to utilize the definitions provided below, unless specifically indicated.",
                                "Unless defined otherwise, all technical and scientific terms used herein have the same meaning as is commonly understood to which the claimed subject matter belongs. In the event that there is a plurality of definitions for terms herein, those in this section prevail. All patents, patent applications, publications and published nucleotide and amino acid sequences (e.g., sequences available in GenBank or other databases) referred to herein are incorporated by reference. Where reference is made to a URL or other such identifier or address, it is understood that such identifiers can change and particular information on the internet can come and go, but equivalent information can be found by searching the internet. Reference thereto evidences the availability and public dissemination of such information.",
                                "It is to be understood that the foregoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of any subject matter claimed. In this application, the use of the singular includes the plural unless specifically stated otherwise. It must be noted that, as used in the specification and the appended claims, the singular forms “a,” “an” and “the” include plural referents unless the context clearly dictates otherwise. In this application, the use of “or” means “and/or” unless stated otherwise. Furthermore, use of the term “including” as well as other forms, such as “include”, “includes,” and “included,” is not limiting.",
                                "For purposes of the present disclosure, the term “comprising”, the term “having”, the term “including,” and variations of these words are intended to be open-ended and mean that there may be additional elements other than the listed elements.",
                                "For purposes of the present disclosure, directional terms such as “top,” “bottom,” “upper,” “lower,” “above,” “below,” “left,” “right,” “horizontal,” “vertical,” “up,” “down,” etc., are used merely for convenience in describing the various embodiments of the present disclosure. The embodiments of the present disclosure may be oriented in various ways. For example, the diagrams, apparatuses, etc., shown in the drawing figures may be flipped over, rotated by 90° in any direction, reversed, etc.",
                                "For purposes of the present disclosure, a value or property is “based” on a particular value, property, the satisfaction of a condition, or other factor, if that value is derived by performing a mathematical calculation or logical decision using that value, property or other factor.",
                                "For purposes of the present disclosure, it should be noted that to provide a more concise description, some of the quantitative expressions given herein are not qualified with the term “about.” It is understood that whether the term “about” is used explicitly or not, every quantity given herein is meant to refer to the actual given value, and it is also meant to refer to the approximation to such given value that would reasonably be inferred based on the ordinary skill in the art, including approximations due to the experimental and/or measurement conditions for such given value.",
                                "For purposes of the present disclosure, the term “amphiphilic” or “amphiphilicity” refers to being a compound consisting of molecules having a water-soluble group at one end and a water-insoluble group at the other end.",
                                "For purposes of the present disclosure, the term “bioinks” as used herein means materials used to produce engineered/artificial live tissue, cellular grafts and organ substitutes (organoids) using 3D printing. In the present disclosure, these bioinks are mostly composed of hydrogel or organogel with cellular components embedded.",
                                "For purposes of the present disclosure, the term “gel”, “nanogel” “hydrogel” and “organogel” are used interchangeably. These terms refer to a is a network of polymer chains, entrapping water or other aqueous solutions, such as physiological buffers, of over 99% by weight. In an embodiment of the present disclosure, the polymer chains may be a peptide with repetitive sequences. If the self-assembly of the ultrashort peptides occurs in aqueous solution, hydrogels are formed. If organic solvents are used, organogels are formed.",
                                "For purposes of the present disclosure, the term “operon” refers to is a functioning unit of DNA containing a cluster of genes under the control of a single promoter. The genes are transcribed together into an mRNA strand and translated into at least one gene product.",
                                "For purposes of the present disclosure, the term “P/S” refers to penicillin-streptomycin solution.",
                                "For purposes of the present disclosure, the term “PBS” refers to a buffer solution commonly used in biological research, which is an abbreviation of phosphate-buffered saline. It is a water-based salt solution, helping to maintain a constant pH, as well as osmolarity and ion concentrations to match those of most cells. In some embodiments, PBS may include a water-based salt solution containing disodium hydrogen phosphate, sodium chloride and, in some formulations, potassium chloride and potassium dihydrogen phosphate.",
                                "For purposes of the present disclosure, the term “printability” refers to the suitability of peptide for 3D printing. In particular, it refers to the suitable speed of self-assembly at certain concentration, and viscosity. The speed of forming gel and viscosity need to be high enough so that a structure with certain height can be printed without collapsing. On the other hand, the speed and viscosity need to be low enough so that the peptide will not clog the nozzle of bioprinters.",
                                "For purposes of the present disclosure, the term “scaffolds” as used herein means the supramolecular network structures made from self-assembling ultra-short peptide or other polymer materials in the bioinks that provide support for the cellular components.",
                                "For purposes of the present disclosure, the term “structure fidelity” refers to the ability of 3D constructs to maintain its shape and internal structure over time.",
                                "For purposes of the present disclosure, the term “ultra-short peptide” refers to a sequence containing 3-7 amino acids. The peptides according an aspect of the present disclosure are also particularly useful for formulating aqueous or other solvent compositions, herein also sometimes referred to as “inks” or “bioinks” when mixed with cellular components, which may be used as inks for printing structures and as bioinks for printing cellular or tissue structures, in particular 3D structures. Such printed structures make use of the gelation properties of the peptides according to features of the present disclosure.",
                                "For purposes of the present disclosure, the terms “biocompatible” (which also can be referred to as “tissue compatible”) and “biocompatibility”, as used herein, refer to the property of a hydrogel that produces little if any adverse biological response when used in vivo.",
                                "For purposes of the present disclosure, the terms “v/v”, “v/v %” and “% v/v” are used interchangeably. These terms refer to Volume concentration of a solution.",
                                "For purposes of the present disclosure, the terms “w/v”, “w/v %” and “% w/v” are used interchangeably. These terms refer to Mass concentration of a solution, which is expressed as weight per volume.",
                                "For purposes of the present disclosure, the terms “homologously distributed” and “homologous distribution” refers to that the density or concentration of GVNPs, cells or other components in the 3D construct is about the same in different parts of the 3D construct."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define terms with non-standard meanings",
                                "specify technical and scientific terms",
                                "incorporate patents, applications, and publications by reference",
                                "define singular and plural forms of words",
                                "specify use of \"or\" and \"including\"",
                                "define \"comprising\", \"having\", and \"including\"",
                                "specify directional terms",
                                "define \"based\" on a particular value or property",
                                "specify use of \"about\" with quantitative expressions",
                                "define \"amphiphilic\" and \"amphiphilicity\"",
                                "define \"bioinks\"",
                                "define \"gel\", \"nanogel\", \"hydrogel\", and \"organogel\"",
                                "define \"operon\"",
                                "define \"P/S\" and \"PBS\"",
                                "define \"printability\", \"scaffolds\", \"structure fidelity\", and other terms"
                            ],
                            "num_characters": 7704,
                            "outline_medium": [
                                "define terms with non-standard meanings",
                                "specify technical and scientific terms",
                                "incorporate patents, applications, and publications by reference",
                                "define URLs and internet identifiers",
                                "specify singular and plural forms of words",
                                "define \"comprising\", \"having\", and \"including\"",
                                "define directional terms and \"based\" on a value"
                            ],
                            "outline_short": [
                                "define terms used in the invention",
                                "provide general description and disclaimers",
                                "specify notation and abbreviations"
                            ]
                        },
                        {
                            "title": "DESCRIPTION",
                            "paragraphs": [
                                "3D bioprinting has emerged as a promising method for the engineering of tissues and organs. Still, it faces challenges in its widespread use due to issues with the development of bioink materials and the nutrient diffusion barrier inherent to these scaffold materials. Disclosed embodiments introduce a method to promote oxygen diffusion throughout the printed constructs using genetically encoded gas vesicles derived from haloarchaea. These hollow nanostructures are comprised of a protein shell that allows gases to permeate freely while excluding the water flow. After printing cells with gas vesicles of various concentrations, the cells are observed to have increased activity and proliferation. These results suggest that air-filled gas vesicles can help overcome the diffusion barrier throughout the 3D bioprinted constructs by increasing oxygen availability to cells within the center of the construct. The biodegradable nature of the gas vesicle proteins combined with the disclosed promising results permits their potential use as oxygen-promoting materials in biological samples.",
                                "In one embodiment, gas vesicle nanoparticles (GVNPs) are used to promote the oxygen diffusion within 3D tissue constructs.",
                                "Gas vesicles are hollow gas-filled proteinaceous intracellular organelles common to many species of bacteria and archaea 18. In nature, gas vesicles promote floatation and the availability of oxygen in the microbial cell19. These cylindrical- or spindle-shaped organelles have conical ends and vary in size depending on the organism20, 21. Over the years, gas vesicle nanoparticles have drawn interest in biotechnological and biomedical applications. This includes traditional nanoparticle applications as drug delivery systems and other applications based on their unique physical properties. It has been discovered that gas vesicles possess sound scattering properties and have the ability to produce harmonic ultrasound signals. One pioneering use of GVNPs is as novel contrast agents and molecular sensors for ultrasound and magnetic resonance besides others22-27.",
                                "In one embodiment, a new, efficient system for haloarchaeal Haloferax volcanii gas vesicle expression is developed. The system utilizes a combination of attributes, such as moderate temperature, fast and elevated cell growth, no requirement for antibiotics), to facilitate cheaper and faster GVNP production at yields high enough to be suitable for bioreactor scale22, 28.",
                                "In one embodiment, gas vesicles are printed homogeneously throughout the 3D tissue constructs, to improve cell growth by promoting the diffusion of oxygen.",
                                "In one embodiment, the bioprinting of gas vesicles is conducted with a 3D bioprinting system designed for ultra-short peptide hydrogels29-33, wherein the printability of peptide bioinks and biocompatibility with various cell types was confirmed to be high34, 35.",
                                "Gas vesicles have been reported to promote cell activity in cell culture36. In one embodiment, gas vesicles are used to promote cell activity, in order to attain better outcomes in 3D bioprinting.",
                                "In one embodiment, the biocompatibility of the gas vesicles was tested with human embryonic kidney cells in both 2D and 3D cell cultures.",
                                "In one embodiment, the printability of the gas vesicles is sufficient to ensure that the nanoparticles are capable of withstanding the shear stress involved in the printing process.",
                                "In one embodiment, the bioink and scaffolding material used throughout this study was IK6 self-assembling peptide (SEQ ID No. 1).",
                                "In one embodiment, the 3D printing of gas vesicles may positively affect cell activity for up to seven days when printed together with cells, as evidenced by high cell viability and healthy morphology of cells printed with gas vesicles."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce 3D bioprinting and its challenges",
                                "describe gas vesicles and their properties",
                                "introduce genetically encoded gas vesicles for oxygen diffusion",
                                "describe the use of gas vesicle nanoparticles (GVNPs) in 3D bioprinting",
                                "describe the development of a new system for haloarchaeal gas vesicle expression",
                                "describe the bioprinting of gas vesicles with ultra-short peptide hydrogels",
                                "describe the biocompatibility of gas vesicles with human embryonic kidney cells"
                            ],
                            "num_characters": 3769,
                            "outline_medium": [
                                "introduce 3D bioprinting and its challenges",
                                "describe gas vesicles and their use in promoting oxygen diffusion",
                                "outline the benefits of using gas vesicles in 3D bioprinting"
                            ],
                            "outline_short": [
                                "introduce 3D bioprinting and its challenges"
                            ]
                        },
                        {
                            "title": "GVNPs Characterization",
                            "paragraphs": [
                                "In one embodiment, expression of the gas vesicle operon in H. volcanii leds to spindle- or cylinder-shaped gas vesicles with conical tips, diameters of 60-200 nm, and lengths of up to 1.5 μm. FIG. 1 shows the gas vesicle expressiong H. volcanii cells grown in liquid culture. As shown in FIG. 1, buoyant cells floated at the top, after bing left to stand. The pure white gas vesicles floating at the top is shown in FIG. 2.",
                                "In one embodiment, the shape and size of intact gas vesicles nanoparticles are determined by transmission electron microscopy (FEI Titan CT microscope) equipped with a 4 k×4 k CCD camera (Gatan®, Pleasanton, Calif., USA). FIG. 3 shows a transmission electron microscopic (TEM) photo of the spindle-shaped intact gas vesicles. In one exemplary embodiment, FIG. 4 shows an individual intact gas vesicle, with its size indicated. As shown in FIG. 4, the intact gas vesicle has a length of up to 1.5 μm and width of about 60-200 nm.",
                                "In one embodiment, the TEM imaging of the cultured gas vesicle nanoparticles showed that nearly all of the gas vesicles were intact and ready for use in subsequent applications."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe the expression of gas vesicle operon in H. volcanii",
                                "characterize the shape and size of intact gas vesicles nanoparticles"
                            ],
                            "num_characters": 1132,
                            "outline_medium": [
                                "describe the expression and characterization of gas vesicle nanoparticles"
                            ],
                            "outline_short": [
                                "describe gas vesicle nanoparticles and their properties"
                            ]
                        },
                        {
                            "title": "Hexapeptide Characterization",
                            "paragraphs": [
                                "In one embodiment, the IK6 amphiphilic peptide (SEQ ID No. 1) has a hydrophilic head group at the C terminus followed by a series of hydrophobic residues, increasing in hydrophobicity to the N terminus at the tail end of the peptide.",
                                "In one embodiment, the IK6 amphiphilic peptide may be optionally connected to an N-terminal protecting group, preferably acetylated, and may be amidated o by a C-terminal protecting group, resulting in a sequence of Ac-ILVAGK-NH2 (SEQ ID No. 1).",
                                "In one embodiment, the IK6 peptide (SEQ ID No. 1) readily forms a hydrogel in PBS.",
                                "In one embodiment, the IK6 peptide (SEQ ID No. 1) has rapid self-assembly capability and is ease of use.",
                                "In one embodiment, the IK6 peptide (SEQ ID No. 1) has high degree of biocompatibility.",
                                "In one embodiment, the IK6 peptide (SEQ ID No. 1) has demonstrated excellent gelling properties as it gelated quickly enough to ensure the structural integrity of the construct and printed smoothly to avoid clumping or inconsistencies. Therefore, the IK6 peptide (SEQ ID No. 1) is used as bioink, when mixed with cellularized components, in one embodiment.",
                                "It has been previously reported that self-assembling ultrashort tetrapeptide forms fibrous peptide network formation, characterizing the structures with circular dichroism (CD) and X-ray diffraction (XRD)44. In one embodiment, the peptide IK6 (SEQ ID No. 1) forms similar peptide networks as self-assembling ultrashort tetrapeptide compounds.",
                                "In one embodiment, the network formed by IK6 peptide (SEQ ID No. 1) was characterized with scanning electron microscopy (SEM) after printing with a printing system. FIG. 5 shows the morphological characterization of the printed IK6 peptide (SEQ ID No. 1) scaffold by SEM. The condensed fibers of IK6 hydrogels shown in FIG. 5 was at a concentration of 16 mM. The In FIG. 5, the left panel was obtained at 200,000× magnification, while the right panel was obtained at 50,000× magnification.",
                                "In one embodiment, the IK6 hydrogel's formation of fibrous network is throughout the construct.",
                                "In one embodiment, the morphological characteristics of hydrogel construct prepared with 3D printing system are similar to those in hydrogel samples prepared manually. The samples prepared for imaging were at a concentration of approximately 16 mM.",
                                "In one embodiment, this concentration of IK6 peptide (SEQ ID No. 1) used with the cells and GVNPs was also 16 mM.",
                                "In one embodiment, the printing of at IK6 hydrogels at 16 mM occurred smoothly and consistently."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe the IK6 amphiphilic peptide sequence",
                                "describe the self-assembly capability of IK6 peptide",
                                "describe the biocompatibility of IK6 peptide",
                                "characterize the network formed by IK6 peptide"
                            ],
                            "num_characters": 2511,
                            "outline_medium": [
                                "describe the properties of the IK6 amphiphilic peptide",
                                "characterize the IK6 peptide's self-assembly and biocompatibility"
                            ],
                            "outline_short": [
                                "describe IK6 amphiphilic peptide and its properties"
                            ]
                        },
                        {
                            "title": "Effect of GVNPs on Cell Viability in 3D Construct",
                            "paragraphs": [
                                "Halobacterium sp. NRC-1 gas vesicle cytotoxicity is assessed through the 2D culture of HEK cells22. In one embodiment, the cell viability is nearly 100%, at the concentrations of GVNPs up to 500 μg/mL22",
                                "In one embodiment, cytotoxicity of gas vesicles expressed in Haloferax volcanii was assessed by testing cell growth and proliferation in 2D culture and 3D culture with varying concentrations of GVNPs. FIGS. 6 and 7 show the cell proliferation of HEK cells cultured in 2D culture together with GVNPs.",
                                "FIG. 6 shows the bright-field microscopic images characterizing the HEK cells in 2D after one day of culture, with different concentrations of GVNPs, including 0 μg/mL (control) (602), 250 μg/mL (606), 500 μg/mL (604), and 750 μg/mL (608).",
                                "FIG. 7 shows cell morphology of HEK cells in 2D with fluorescent staining. In FIG. 7, HEK cells cultured without GVNPs is shown in the left column, while HEK cells cultured with 750 μg/mL GVNPs is shown in the right column. Also in FIG. 7, actin is shown in red, while nucleus are shown in blue.",
                                "FIG. 8 shows he bright-field microscopic images characterizing the HEK cells in 3D after one day of culture, with different concentrations of GVNPs, including 0 μg/mL (control) (802), 250 μg/mL (806), 500 μg/mL (804), and 750 μg/mL (808).",
                                "In one embodiment, cell proliferation is quantified with the CellTiter-Glo© Assay. FIG. 9 shows the results of the CellTiter-Glo© Assay. The HEK cells are cultured with GVNPs at the concentration of 250 μg/mL and 750 μg/mL. As shown in FIG. 9, an increase in cell activity is observed from day 1 to day 7. When compared to the 3D and negative control groups, the cells cultured with GVNPs show significantly increased proliferation, as also shown in FIG. 9. With regard to the 3D control in FIG. 9, the HEK cells are cultured in DMEM medium without GVNPs. Furthermore, cell proliferation was observed to increase with increasing concentrations of GVNPs. FIG. 9 shows a mean value±SD (standard deviation), with a sample size of 6. In FIG. 9, * indicates p<0.05, while *** indicates p<0.001 The differences in cell proliferation was compared between the 3D control and cells cultured with GVNPs using student's t-test and the p values are summarized below:"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe the assessment of gas vesicle cytotoxicity",
                                "describe the cell viability in 2D culture with varying concentrations of GVNPs",
                                "describe the cell viability in 3D culture with varying concentrations of GVNPs",
                                "quantify cell proliferation with the CellTiter-Glo Assay"
                            ],
                            "num_characters": 2237,
                            "outline_medium": [
                                "assess the cytotoxicity of gas vesicles in 2D and 3D cultures",
                                "quantify cell proliferation with the CellTiter-Glo Assay"
                            ],
                            "outline_short": [
                                "describe the effect of GVNPs on cell viability in 2D and 3D cultures"
                            ]
                        },
                        {
                            "title": "3D Bioprinting Process",
                            "paragraphs": [
                                "In one embodiment, various shapes are printed using IK6 peptide (SEQ ID No. 1) to optimize printing parameters, including peptide and PBS flow rates.",
                                "In one embodiment, the rapid gelation of the IK6 peptide (SEQ ID No. 1) facilitate smooth and consistent extrusion of the bioink, thus achieving a more refined and stable construct of 10 mm in height. The construct of 10 mm height formed with IK6 peptide (SEQ ID No. 1) is shown in FIG. 10. In FIG. 10, the left panel shows cylinder printed with IK6 peptide (SEQ ID No. 1) on day 1, while the right panel shows the same construct after 8 weeks.",
                                "In one embodiment, IK6 peptide has high degree of bioprintability, structure fidelity, and cell viability45.",
                                "In one embodiment, the stability of the bioprinted construct with IK6 peptide (SEQ ID No. 1) is high enough to maintain high degree of construct fidelity during the incubation period of several weeks.",
                                "In one embodiment, the construct maintained structure and hold shape, after 8 weeks, thus confirming the high structure fidelity of the IK6 peptide (SEQ ID No. 1).",
                                "In one embodiment, the gas vesicles are suitable for bioprinting.",
                                "In one embodiment, the optimal printing parameters of bioprinting using gas vesicles are determined.",
                                "Previous studies find that gas vesicles are relatively weak and their strength varies depending on the organism and strain from which they are derived19, 21. However, in one embodiment, the gas vesicles may withstand the stress of the 3D printing process.",
                                "In one embodiment, the morphology of the printed gas vesicles is c compared to those that were not printed. Analysis of these images via SEM imaging, confirming that the gas vesicles remained intact and maintained their structural integrity throughout the printing process. The SEM images are shown in FIG. 11. In FIG. 11, the left panel shows photo of printed peptide scaffold with GVNPs obtained at 35,000× magnification, while the right panel shows that obtained at 100,000× magnification.",
                                "In one embodiment, the addition of gas vesicles can improve oxygen availability to cells within the center of printed constructs.",
                                "In one embodiment, optimal gas vesicle distribution within the samples is determined.",
                                "In one embodiment, gas vesicle distributes homogenously throughout the construct.",
                                "In one embodiment, fluorescent gas vesicle particles engineered with sfGFP is created and used to determine the homogenous distribution of gas vesicle throughout the construct. FIG. 12 shows a confocal image of these samples printed with sfGFP engineered gas vesicles confirming a homogenous distribution of gas vesicles throughout the printed sample. In FIG. 12, the scale bar is 2 μm."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe the optimization of printing parameters",
                                "describe the rapid gelation of IK6 peptide",
                                "describe the bioprinting of various shapes with IK6 peptide",
                                "describe the stability of the bioprinted construct",
                                "describe the suitability of gas vesicles for bioprinting"
                            ],
                            "num_characters": 2681,
                            "outline_medium": [
                                "describe the optimization of printing parameters using IK6 peptide",
                                "characterize the bioprintability and structure fidelity of IK6 peptide"
                            ],
                            "outline_short": [
                                "describe the 3D bioprinting process using IK6 peptide and GVNPs"
                            ]
                        },
                        {
                            "title": "Influence of GVNPs on the Viability of Bioprinted Cells",
                            "paragraphs": [
                                "In one embodiment, the HEK 293 cells are 3D printed, and the cell viability with the presence of GVNPs is increased at 3 different time points, including 24 hours, 4 days and 7 days, compared to cells cultured without GVNPs.",
                                "FIG. 13 shows a live/dead cell staining image, comparing cell viability of HEK 293 cells s cultured with GVNPs or without GVNPs (control).",
                                "FIG. 14 shows the quantification of cell viability, indicating the presence of GVNPs increaded cell viability. The cell viability data are summarized below, with the data expressed as mean value±SD. The differences of cell viability on day 4 and day 7 between control and those grown with GVNPs are analyzed using student's t test, with the p value also summarized in the table below."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe the influence of GVNPs on cell viability in 3D bioprinted constructs"
                            ],
                            "num_characters": 750,
                            "outline_medium": [
                                "evaluate the effect of GVNPs on cell viability in 3D bioprinted constructs"
                            ],
                            "outline_short": [
                                "describe the effect of GVNPs on the viability of bioprinted cells"
                            ]
                        },
                        {
                            "title": "Morphological Study of Bioprinted Cells",
                            "paragraphs": [
                                "In one embodiment, cell aggregates form within gels after printing. In one embodiment, the cells proliferate within gels after printing The actin cytoskeletons and nuclei of these cell aggregates were stained, as shown in FIG. 15. In FIG. 15 the growth of the cell aggregates was tracked for 7 days. The growing size of the cellular aggregates over time is evidence for cell proliferation. In FIG. 15, the nucleus are shown in blue, F-actin in red and the scale bar is 50 μm.",
                                "In one embodiment, the GVNPs in the gel construct after printing are visualized using microscopy imaging. These images depicting the GVNPs in the environment surrounding the cells 2 and 8 days after printing are shown in FIG. 16. This is contrasted with the lack of gas vesicles present in the imaged control samples. In FIG. 16, the scale bar is 5 μm.",
                                "In one embodiment, a new plasmid construct allowing fast and high-yielding GVNPs production in Haloferax volcanii without the requirement of antibiotics is provided. In one embodiment, Haloferax volcanii is completely sequenced and has clean genetic background with respect to gas vesicle genes, making it a suitable and attractive organism of choice for expressing Halobacterium gas vesicle nanoparticles. H. volcanii is a nonpathogenic halophile that grows to high density in the presence of high concentrations of salt, which precludes contamination by less halophilic microorganisms42, 46. In one embodiment, the S-layer cell walls of H. volcanii is fragile enough to be easily lysed upon addition of water, releasing cellular proteins and reducing the cost of protein purification47, 48, which also makes it attractive feature for biotechnological and biomedical applications.",
                                "In one embodiment, the Superfolder Green Fluorescent Protein (sfGFP) is displayed on the GVNPs surface, which demonstrated the application of GVNPs as imaging tools and oxygen carriers as well as protein display and delivery vehicle.",
                                "In one embodiment, the protein expression system and purification process are straightforward and efficient enough to produce a substantial number of gas vesicles that can be scaled.",
                                "In one embodiment, the GVNPs has a spindle or cylindrical shape, which increases volume to surface area ratio. The increased volume to surface area ratio allows improved gas exchange and nutrient diffusion.",
                                "In one embodiment, the diameter/width of the gas vesicles ranging from 60-200 nm is also ideal for biomedical applications. GVNPs are small enough to fit within the pores of the fibrous extracellular matrix of hydrogels while still too large to cross the blood-brain barrier and cell membrane49.",
                                "The biocompatibility of Halobacterium sp. NRC-1 gas vesicles in 2D cell culture was studied22. In one embodiment, gas vesicles expressed in Haloferax volcanii has high biocompatibility, as confirmed by 3D cell culture of HEK 293 cells with various concentrations of GVNPs. In one embodiment, the gas vesicles have no associated toxicity, as indicated by the qualitative and quantitative assessment concerning cell growth, morphology, and proliferation.",
                                "In one embodiment, the bioink and gas vesicles survives the stress associated with the printing process. In one embodiment, comparison of the imaged printed and manually prepared peptide bioink samples confirmed that the peptide maintained its ability to self-assemble into helical fibers and form supramolecular structures, despite the shear stress imposed by the printing.",
                                "In one embodiment, the versatility of the printing system shown in FIG. 17 is suitable for the use of ultrashort self-assembling peptide as bioink material and the incorporation of gas vesicles in the constructs.",
                                "In one embodiment, nearly all of the 3D printed gas vesicles remained intact, thereby providing further evidence of the strength of halophilic gas vesicles and suggesting potential applications of gas vesicles for biomedical applications.",
                                "In one embodiment, recombinant GVNPs are stable for several months at room temperature and at elevated temperatures of around 50° C., with little to no degradation27.",
                                "In one embodiment, these protein-based nanostructures can promote the growth of printed cells, which is crucial to preserve cell viability, morphology, and function after printing 54-57. Previous studies have reported that the stress induced by the printing process may harm the cells57, 58. However, the extent of this cellular damage may differ according to cell type and the printing procedure.",
                                "In one embodiment, in the case of 3D bioprinter using the configuration shown in FIG. 17, the printing procedure could be modified by adjusting syringe pump flow rates, inner diameters of the nozzle, printing speed, and layer height.",
                                "In one embodiment, the 3D bioprinting parameters are optimized for HEK 293 cells and incorporated the GVNPs into the 3D construct, which were mitigated such that cell viability, proliferation, and morphology were improved.",
                                "The notion that cell growth and death are very strongly affected by the extracellular environment has been well documented in the literature59. The extracellular matrix (ECM) is crucial to tissue engineering, as it dictates cellular morphology and guides the connections between cells and the site of interactions. Together, the ECM architecture and its composition affect cell growth, connection, differentiation, and adhesion. In one embodiment, the GVNPs were able to incorporate within the peptide fibers. The gas vesicles were also able to stay within the extracellular environment for at least 8 days, increase the porosity of the gel constructs, and thereby allow more medium and nutrients to penetrate the center.",
                                "In one embodiment, the GVNPs are able to influence the ECM without directly affecting the morphology of the HEK293 cells, as shown in FIGS. 13, 15 and 16.",
                                "In one embodiment, the cells printed with GVNPs show better viability than the cells printed without GVNPs. As the GVNPs constitute the thin protein-membrane and the gases inside and are permeable to gases in the environment, the effect is likely due to the gas permeability of the protein shell. One way, through which this can occur, is by promoting the availability of oxygen to the cells, as the oxygen is allowed to diffuse from within the gas vesicles to the surrounding environment. In one embodiment, the increased oxygen availability may render the environment more similar to favorable in vivo conditions, thereby promoting cell survival. In another embodiment, nearby GVNPs enable cells to clear waste or other species within the environment more rapidly. Byproducts of cellular respiration include CO2. Therefore, the permeability of the GVNP shell coupled with the concentration gradient of the different gases in the system may have promoted the diffusion of CO2 away from the cells.",
                                "In one embodiment, Gas vesicles are excellent materials for applications in medicine, due to their aforementioned advantages over other nanostructures. In another embodiment, these gas-filled stable protein nanostructures are uniquely well suited for bioengineering.",
                                "In one embodiment, the use of genetically encoded air-filled gas vesicles for 3D bioprinting is demonstrated for the first time. In one embodiment, the gas vesicles does not harm cell proliferation, despite its bacterial origination. In one embodiment, cell viability is promoted by the gas vesicles.",
                                "In one embodiment, the additional oxygen support is beneficial. This extra support is beneficial for the cells that are encapsulated within the center of the 3D printed construct and thus due to the diffusion barrier less accessible to nutrients. Thus, air-filled GVNPs that are printed together with living cells can counterbalance stress factors which the cells are experiencing during and after 3D printing.",
                                "In one embodiment, promoting viability of bioprinted cells with the addition of GVNPs facilitates the 3D printing of large tissues and organs.",
                                "In one embodiment, using gas vesicles in tissue engineering applications enhances the proliferation of mammalian cells in 3D cultures. In one embodiment, the gas vesicles can withstand the stress associated with the bioprinting process and positively influence cell viability suggest that this method can promote the survival of cells within 3D printed constructs. In one embodiment, the gas vesicles can be used as a suitable and easy-to-prepare tool to promote cell viability during tissue construct formation and can serve as an oxygen place holder during nascent vascularization approaches.",
                                "Having described the many embodiments of the present disclosure in detail, it will be apparent that modifications and variations are possible without departing from the scope of the invention defined in the appended claims. Furthermore, it should be appreciated that all examples in the present disclosure, while illustrating many embodiments of the invention, are provided as non-limiting examples and are, therefore, not to be taken as limiting the various aspects so illustrated."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce cell aggregates",
                                "track cell growth",
                                "visualize GVNPs in gel construct",
                                "describe plasmid construct for GVNPs production",
                                "motivate Haloferax volcanii as organism of choice",
                                "describe sfGFP display on GVNPs surface",
                                "summarize protein expression and purification process",
                                "describe shape and size of GVNPs",
                                "discuss biocompatibility of Halobacterium sp. NRC-1 gas vesicles",
                                "study bioink and gas vesicles survival during printing",
                                "describe versatility of printing system",
                                "show stability of recombinant GVNPs",
                                "discuss promotion of cell growth by GVNPs",
                                "optimize 3D bioprinting parameters",
                                "describe influence of GVNPs on ECM",
                                "show improved cell viability with GVNPs",
                                "discuss applications of gas vesicles in medicine and bioengineering"
                            ],
                            "num_characters": 9030,
                            "outline_medium": [
                                "describe cell aggregates formation",
                                "visualize GVNPs in gel construct",
                                "introduce plasmid construct for GVNPs production",
                                "demonstrate application of GVNPs as imaging tools",
                                "describe protein expression and purification process",
                                "discuss biocompatibility of Halobacterium sp. NRC-1 gas vesicles",
                                "describe versatility of printing system and stability of GVNPs",
                                "discuss applications of GVNPs in biomedical and tissue engineering"
                            ],
                            "outline_short": [
                                "describe cell aggregates formation",
                                "visualize GVNPs in gel construct",
                                "demonstrate GVNPs application",
                                "discuss biocompatibility and versatility"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Materials**",
                                "The self-assembling peptide IK6 (Ac-ILVAGK-NH2) (SEQ ID No. 1) was custom synthesized by Bachem® AG (Budendorf, Switzerland). Human embryonic kidney cells (HEK293) were purchased from (ATCC®, USA). Cells were cultured in medium Dulbecco's modified Eagle's medium-high glucose DMEM-HG (Gibco Thermo Fisher Scientific®, USA). T175 or T75 cell culture flasks and 96 and 48 well-plates were purchased from Corning, USA. Halobacterium sp. NRC-1 was obtained from Carolina Biological Supply (Burlington, N.C., USA) and cultured in CM+ medium containing 4.3M NaCl and trace metals at 42° C. with shaking as previously described 37. Haloferax volcanii H1895 and its corresponding vector pTA963 were kindly provided by Dr. Thorsten Allers (Institute of Genetics, School of Biology, University of Nottingham, Queen's Medical Centre, Nottingham, UK). Haloferax volcanii and derivatives were cultured in the Hv-YPC medium at 45° C. with shaking as previously described 3, 39. For solid media, 2% (w/v) agar was added. The CellTiter-Glo® luminescent 3D cell viability assay kit, LIVE/DEAD® Viability/Cytotoxicity kit and Actin Cytoskeleton/Focal Adhesion Staining kit were purchased from Promega, USA, Life Technologies™, USA, and Sigma-Aldrich®, USA, respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list materials",
                                "describe cell culture"
                            ],
                            "num_characters": 1267,
                            "outline_medium": [
                                "list materials"
                            ],
                            "outline_short": [
                                "list materials"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "Engineering and Expression of Gas Vesicles in Haloferax volcanii",
                                "sfGFP synthetic gene (IDT®, Leuven, Belgium) was codon-optimized using the java codon adaptation online tool JCat for Halobacterium sp. (strain NRC-1/ATCC 700922/JCM 11081)40. The gas vesicle operon from Halobacterium sp. NRC-1 was amplified from the genome by Polymerase Chain Reaction (PCR) and cloned with sfGFP via FspAI-HpaI and HpaI-BamHI using the Gibson Assembly Cloning Kit into plasmid vector pTA963 to generate the pTA963_sfGFP_GVNPs expression plasmid (Table 1). The construct was validated by restriction digestion using FspAI, HpaI, and BamHI, PCR amplification, and DNA sequencing. Gas vesicles containing the vector were transformed into Haloferax volcanii H1895 using the PEG/EDTA method41"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "engineer and express gas vesicles"
                            ],
                            "num_characters": 772,
                            "outline_medium": [
                                "engineer and express gas vesicles"
                            ],
                            "outline_short": [
                                "engineer and express gas vesicles"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Culturing and Gas Vesicle Preparation**",
                                "The processes for producing and culturing gas vesicles were performed as previously described 19, 22, 42. Briefly, H. volcanii lawns or floating cells were lysed osmotically with PBS solution [137 mM NaCl, 2.7 mM KCl, 10 mM sodium phosphate dibasic, and 2 mM potassium phosphate monobasic (pH 7.4)] containing 10 mM MgSO4 and 20 μg/mL of DNase I (Sigma-Aldrich®, USA). The cell lysate suspension was incubated for 1 hour at 37° C. before overnight centrifugation at 60 g in a swinging bucket rotor in an Allegra® X-15R centrifuge (Beckman Coulter®, CA, USA) to accelerate floatation of the gas vesicles. Intact gas vesicles were collected and re-suspended in PBS solution, then floated by overnight centrifugation and harvested again. This floatation procedure was repeated until a white, milky suspension of gas vesicles was obtained. Gas vesicle concentration was quantified via NanoDrop® 2000 spectrophotometer (Thermo Scientific®, Waltham, Mass., USA) by measuring a small sample of gas vesicles broken by sonicating for several minutes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe culturing and gas vesicle preparation",
                                "quantify gas vesicle concentration"
                            ],
                            "num_characters": 1084,
                            "outline_medium": [
                                "prepare and culture gas vesicles"
                            ],
                            "outline_short": [
                                "prepare and culture gas vesicles"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Hydrogel Preparation**",
                                "The ultrashort peptide IK6 (Ac-ILVAGK-NH2) (SEQ ID No. 1) used in this study was synthesized by Bachem® AG (Budendorf, Switzerland) using solid-phase peptide synthesis and purified to above 95% via HPLC. Amino acid and peptide content analysis were performed. The lyophilized peptide powders were first dissolved in Milli-Q® water and mixed by vortexing for 30 seconds to obtain a homogenous solution. Then, 10× phosphate-buffered saline (PBS) was added to the peptide solution for a final concentration of 1×. Gelation occurred within a few minutes at 8 mg/mL peptide concentration."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare hydrogel"
                            ],
                            "num_characters": 609,
                            "outline_medium": [
                                "prepare hydrogel"
                            ],
                            "outline_short": [
                                "prepare hydrogel"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Cell Culture in 2D**",
                                "HEK293 cells were purchased from ATCC® (USA). Cells were cultured in Dulbecco's modified Eagle's medium-high glucose (DMEM-HG), supplemented with 10% (v/v) fetal bovine serum (FBS) and 1% penicillin/streptomycin (PS, Gibco®) at 37° C. with 5% CO2. The cells were subcultured with trypsin at approximately 80% confluence. The culture media was changed every 2-3 days. Cells at passages 6-8 were encapsulated for 3D culture and monolayer culture."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "culture cells in 2D"
                            ],
                            "num_characters": 468,
                            "outline_medium": [
                                "culture cells in 2D"
                            ],
                            "outline_short": [
                                "culture cells in 2D"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Cell Culture in 3D**",
                                "HEK293 cells were cultured in 75 T flasks and incubated in a CO2 incubator maintained at 37° C. with 5% CO2. Culture media was replaced every 48 hours until the cells reached 80% confluency. Confluent cells were subcultured, and cells at passages 6-8 were used for the study. For the 3D culture, the peptide was sterilized by exposure to UV light for 30 minutes. 10,000 cells in 2× PBS were mixed at a 1:1 ratio with peptide solution and used to prepare 100 μl of 3D construct in a 96 well-plate without the addition of GVNPs to serve as a control. Different concentrations of GVNPs were obtained by mixing with PBS before adding them to form 3D samples. This allowed for the evaluation of the GVNPs effect on cell proliferation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "culture cells in 3D"
                            ],
                            "num_characters": 753,
                            "outline_medium": [
                                "culture cells in 3D"
                            ],
                            "outline_short": [
                                "culture cells in 3D"
                            ]
                        },
                        {
                            "title": "Example 7",
                            "paragraphs": [
                                "**3D Bioprinting**",
                                "16 mM of IK6 peptide (SEQ ID No. 1) was diluted in 1 mL of MilliQ® water, mixed well, and sonicated to assure a homogenous solution. Eight million cells were suspended in 1× PBS without GVNPs (control). When printing with GVNPs, the cells were mixed with a 1× PBS solution containing GVNPs at a 300 μg/ml concentration.",
                                "A custom-designed 3D bioprinter along with commercial microfluidic pumps was set up, and a homemade dual coaxial nozzle was used for bioink extrusion32, 33, 43. Structures were printed in the shape of a rectangular prism with a length, width, and height of 10 mm, 10 mm, and 1.5 mm, respectively. Illustrated figure of the printed structure along with the printer setup is shown in FIG. 17. A preview of the gcode file of the printed structure with dimensions measuring 10 mm×10 mm×1.5 mm is shown in FIG. 18. To facilitate imaging, the structure was printed onto an 18×18 mm glass coverslip. The glass coverslip was then placed on top of a heat-bed set to 40° C. to create a suitable temperature environment for the cells.",
                                "Three syringe pumps were set up to dispense homogenous gel and extrude peptide bioink through the nozzle. The first syringe pump was loaded with peptide solution and set to a flow rate of 55 μl/min. The second pump was loaded with 7× PBS and set to a flow rate of 20 μl/min. The third pump was loaded with the cells and set to a flow rate of 20 μl/min. Three samples of the 4-layer rectangular prism were printed for each condition with a height of 1.5 mm per sample to facilitate imaging. The same procedure was conducted for samples without gas vesicles to serve as controls."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare peptide solution",
                                "set up 3D bioprinter",
                                "print 3D structure"
                            ],
                            "num_characters": 1643,
                            "outline_medium": [
                                "bioprint 3D structure"
                            ],
                            "outline_short": [
                                "bioprint 3D structure"
                            ]
                        },
                        {
                            "title": "Example 8",
                            "paragraphs": [
                                "**3D Cell Proliferation Assay**",
                                "The CellTiter-Glo® luminescent 3D cell viability assay was used to assess cell proliferation in 3D hydrogels by measuring ATP production. At each time point, the kit was equilibrated at room temperature for approximately 30 minutes. CellTiter-Glo® Reagent equal to the volume of cell culture medium present in each well was added. The contents were mixed for 5 minutes to digest the hydrogels and then incubated for 30 minutes. After incubation, the luminescence was recorded using a plate reader (PHERAstar® FS, Germany)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "assess cell proliferation"
                            ],
                            "num_characters": 555,
                            "outline_medium": [
                                "assess cell proliferation"
                            ],
                            "outline_short": [
                                "assess cell proliferation"
                            ]
                        },
                        {
                            "title": "Example 9",
                            "paragraphs": [
                                "**Live/Dead Staining**",
                                "HEK293 cells were seeded into peptide according to the protocol described in Example 6 above. After one, three, and seven days of incubation, the media was removed and replaced with PBS solution containing staining solution approximately 2 mM calcein AM and 4 mM ethidium homodimer-1 (staining solution) prior to incubation for 40 minutes. Before imaging, the staining solution was removed, and fresh PBS was added. Stained cells were imaged under an inverted confocal microscope (Zeiss® LSM 710 Inverted Confocal Microscope, Germany). The percentage of living cells was obtained through analysis with ImageJ.",
                                "**Example 10**",
                                "**Cytoskeletal Staining and Imaging**",
                                "Immunostaining was performed at each culture time point. In brief, the cells were fixed with 4% (v/v) paraformaldehyde solution for 30 minutes and incubated in a cold cytoskeleton buffer (3 mM MgCl2, 300 mM sucrose, and 0.5%, v/v Triton X-100 in PBS solution) for 5 minutes to permeabilize the cell membranes. The permeabilized cells were then incubated in blocking buffer solution (5% FBS, 0.1%, v/v Tween-20, and 0.02%, w/v sodium azide in PBS) for 30 minutes at 37° C. For F-Actin, anti-mouse IgG (whole molecule)-FITC and rhodamine-phalloidin (1:300) were added to the cells for 1 hour. Further, the cells were incubated in DAPI for five minutes to counterstain the nucleus. The fluorescent dye-treated cells were observed and imaged using a laser scanning confocal microscope (Zeiss® LSM 710 Inverted Confocal).",
                                "**Example 11**",
                                "**Scanning Electron Microscopy**",
                                "The printed samples were characterized using Scanning Electron Microscopy (SEM) to visualize the morphology of the peptide bioink and gas vesicles in printed samples43. Samples were printed on 18×18 mm glass coverslips and given time to solidify before dehydration by gradual immersion in increasing concentrations of 20%, 40%, 60%, 80%, and 100% (v/v) ethanol solutions for 5 min in each solution. Further dehydration in 100% ethanol solution was done by changing the absolute ethanol solution with a fresh ethanol solution twice for 5 min each, followed by a third time for 2 hours. Dehydrated samples were subsequently placed into the critical point dryer (Sorvall Critical Point Drying System) for evaporation before being mounted onto SEM aluminum pin stubs with double-stick conductive carbon tape and a final sputter coating of 10 nm of iridium. Images were taken with FEI Magellan XHR SEM. This was done with a TLD detector, and imaging parameters included a current of 50 pA, a high voltage of 3.00 kV, and a working distance of 4.0 m. Biological peptide hydrogel coating cells were fixed with 2.5% (v/v) glutaraldehyde (diluted from 25%) in water overnight at 4° C., the post-fixation was done by 1% (w/v) osmium tetroxide in 0.1 M PBS for one hour in the dark followed by washing 3 times by ddH2O. This was followed by serial dehydration with 10 mL of H2O (twice), 25% ethanol, 50% ethanol, 75% ethanol, 80% ethanol, 90% ethanol, and 100% (v/v) ethanol (twice). Samples in ethanol were then critically point dried using liquid CO2 (Sorvall Critical Point Drying System).",
                                "**Example 12**",
                                "**Statistical Analysis**",
                                "All experimental approaches were executed in triplicates to allow for statistical testing. Results are represented as mean±standard deviation, n≥3. The differences observed in HEK293 cell behavior for conditions with and without GVNPs were compared. Statistical analysis was performed by a student's t-test, and values with p<0.05 were considered statistically significant.",
                                "It is intended that the invention not be limited to the particular embodiment disclosed herein contemplated for carrying out this invention, but that the invention will include all embodiments falling within the scope of the claims.",
                                "All documents, patents, journal articles and other materials cited in the present application are incorporated herein by reference.",
                                "The many features and advantages of the invention are apparent from the detailed specification, and thus, it is intended by the appended claims to cover all such features and advantages of the invention which fall within the true spirit and scope of the invention. Further, since numerous modifications and variations will readily occur to those skilled in the art, it is not desired to limit the invention to the exact construction and operation illustrated and described, and accordingly, all suitable modifications and equivalents may be resorted to, falling within the scope of the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "seed cells",
                                "incubate cells",
                                "remove media",
                                "add staining solution",
                                "incubate cells",
                                "remove staining solution",
                                "image cells",
                                "analyze images"
                            ],
                            "num_characters": 4521,
                            "outline_medium": [
                                "stain cells",
                                "image stained cells",
                                "analyze live cells",
                                "quantify live cells"
                            ],
                            "outline_short": [
                                "stain cells",
                                "image cells"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A 3-dimensional construct comprising:\nan ultrashort peptide scaffold;\nat least one gas vesicle; and\nat least one mammalian cell.",
        "2. The 3-dimensional construct of claim 1, wherein the ultrashort peptide scaffold comprises at least one ultrashort peptide having a general formula selected from:\n\n\nAnBmX,BmAnX,XAnBm and XBmAn \n\nwherein the total number of amino acids of the ultrashort peptide does not exceed 7 amino acids;\nwherein A is an aliphatic amino acids, selected from the group consisting of: isoleucine, leucine or any combination thereof, with n being an integer being selected from 0-5;\nwherein B is comprised of at least one aromatic amino acid selected from the group consisting of: tyrosine, tryptophan, phenylalanine, hydrophobic amino acid phenylalanine, or comprised of a peptidomimetic amino acid that is the aliphatic counterpart of the aromatic amino acid, such as cyclohexylalanine, which is the counterpart of amino acid phenylalanine with m being an integer being selected from 0-3;\nwherein X is comprised of a polar amino acid, selected from the group consisting of:\naspartic acid, glutamic acid, lysine, arginine, histidine, cysteine, serine, threonine, asparagine, and glutamine.",
        "3. The 3-dimensional construct of claim 1, wherein the ultrashort peptide scaffold comprises an IK6 peptide with the sequence of ILVAGK (SEQ ID No. 1),\nwherein the IK6 peptide is optionally connected to an N-terminal protecting group and a C-terminal protecting group.",
        "4. The 3-dimensional construct of claim 3, wherein the N-terminal protecting group is an acetylated group and the C-terminal protecting group is an amidated group.",
        "5. The 3-dimensional construct of claim 1, wherein the gas vesicle is homologously distributed in the 3D construct.",
        "6. The 3-dimensional construct of claim 1, wherein the wall of the gas vesicle is gas, water and nutrient permeable.",
        "7. The 3-dimensional construct of any claim 1, wherein the size of the gas vesicle is smaller than the pores of the ultrashort peptide scaffold.",
        "8. The 3-dimensional construct of claim 1, wherein the size of the gas vesicle is too large to cross the blood-brain barrier and cell membrane of the mammalian cell.",
        "9. The 3-dimensional construct of claim 1, wherein the diameter of the gas vesicle is 60-200 nm.",
        "10. The 3-dimensional construct of claim 1, wherein the concentration of the gas vesicle is at least 250 μg/mL.",
        "11. The 3-dimensional construct of claim 1, wherein the concentration of the gas vesicle is 250 μg/mL-750 μg/mL.",
        "12. A method of high-yielding production of gas vesicle comprising:\namplifying a gas vesicle operon from the genome of a gas vesicle operon containing bacterium;\ncloning the gas vesicle operon into an expression plasmid;\ntransforming the gas vesicle operon containing expression plasmid into Haloferax volcanii; \nculturing the Haloferax volcanii transformed with the gas vesicle operon containing expression plasmid;\nlysing the Haloferax volcanii transformed with the gas vesicle operon containing expression plasmid; and\ncollecting the gas vesicle.",
        "13. The method of high-yielding production of gas vesicle recited in claim 12, wherein antibiotics are not used.",
        "14. The method of high-yielding production of gas vesicle recited in claim 12, wherein a second operon is cloned into the expression plasmid.",
        "15. The method of high-yielding production of gas vesicle recited in claim 12, wherein the second operon is for a sfGFP synthetic gene, wherein the sfGFP synthetic gene is optionally codon-optimized.",
        "16. The method of high-yielding production of gas vesicle recited in claim 12, wherein the gas vesicle is collected by centrifugation and floatation",
        "17. A method of creating 3-dimensional construct comprising:\ndissolving at least one ultrashort peptide to form a peptide solution;\nmixing mammalian cells with the peptide solution;\ndissolving the gas vesicle to form a gas vesicle solution;\nadding the gas vesicle solution to the mammalian cells containing peptide solution; and\nbuilding 3-dimensional construct using the peptide solution containing both gas vesicle and mammalian cells;\nwherein the ultrashort peptide is dissolved in water or buffer solution.",
        "18. The method of creating 3-dimensional construct in claim 17, wherein the ultrashort peptide is dissolved at a concentration from about 0.01 μg/ml to 100 mg/ml.",
        "19. The method of creating 3-dimensional construct in claim 17, wherein peptide solution contains 16 mM of IK6 peptide (SEQ ID No. 1).",
        "20. The method of creating 3-dimensional construct in claim 17, wherein the final concentration of the gas vesicle in the 3-dimensional construct is at least 250 μg/mL.",
        "21. The 3-dimensional construct of claim 17, wherein the final concentration of the gas vesicle in the 3-dimensional construct is 250 μg/mL-750 μg/mL.",
        "22. The 3-dimensional construct of claim 17, wherein the final concentration of the gas vesicle in the 3-dimensional construct is 300 μg/mL.",
        "23. The method of creating 3-dimensional construct in claim 17, wherein the number of cells in the 3-dimensional construct is at least 10,000.",
        "24. The method of creating 3-dimensional construct in claim 17, wherein the 3-dimensional construct is built with a 3D bioprinter or manually.",
        "25. A 3-dimensional construct comprising:\nan ultrashort peptide scaffold, wherein the ultrashort peptide scaffold comprises at least one ultrashort peptide having a general formula selected from:\n\n\nAnBmX,BmAnX,XAnBm and XBmAn \n\n\nwherein the total number of amino acids of the ultrashort peptide does not exceed 7 amino acids;\nwherein A is an aliphatic amino acids, selected from the group consisting of: isoleucine, leucine or any combination thereof, with n being an integer being selected from 0-5;\nwherein B is comprised of at least one aromatic amino acid selected from the group consisting of: tyrosine, tryptophan, phenylalanine, hydrophobic amino acid phenylalanine, or comprised of a peptidomimetic amino acid that is the aliphatic counterpart of the aromatic amino acid, such as cyclohexylalanine, which is the counterpart of amino acid phenylalanine with m being an integer being selected from 0-3;\nwherein X is comprised of a polar amino acid, selected from the group consisting of: aspartic acid, glutamic acid, lysine, arginine, histidine, cysteine, serine, threonine, asparagine, and glutamine;\nat least one mammalian cell; and\n\nat least one gas vesicle, wherein the size of the gas vesicle is smaller than the pores of the ultrashort peptide scaffold but too large to cross the cell membrane of the mammalian cell."
    ]
}