{
    "id": "https://semopenalex.org/work/W2175394847",
    "authors": [
        "Gerhard Klimeck",
        "Rajib Rahman",
        "Fahd A. Mohiyaddin",
        "Guilherme Tosi",
        "Andrea Morello",
        "Vivien Schmitt",
        "Stefanie Tenberg"
    ],
    "title": "Silicon quantum processor with robust long-distance qubit couplings",
    "date": "2017-09-06",
    "abstract": "Practical quantum computers require a large network of highly coherent qubits, interconnected in a design robust against errors. Donor spins in silicon provide state-of-the-art coherence and quantum gate fidelities, in a platform adapted from industrial semiconductor processing. Here we present a scalable design for a silicon quantum processor that does not require precise donor placement and leaves ample space for the routing of interconnects and readout devices. We introduce the flip-flop qubit, a combination of the electron-nuclear spin states of a phosphorus donor that can be controlled by microwave electric fields. Two-qubit gates exploit a second-order electric dipole-dipole interaction, allowing selective coupling beyond the nearest-neighbor, at separations of hundreds of nanometers, while microwave resonators can extend the entanglement to macroscopic distances. We predict gate fidelities within fault-tolerance thresholds using realistic noise models. This design provides a realizable blueprint for scalable spin-based quantum computers in silicon.Quantum computers will require a large network of coherent qubits, connected in a noise-resilient way. Tosi et al. present a design for a quantum processor based on electron-nuclear spins in silicon, with electrical control and coupling schemes that simplify qubit fabrication and operation.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "The successful implementation of quantum algorithms requires incorporation of error correction codes1 that deal with the fragile nature of qubits. The highest tolerances in error rates are found when using nearest-neighbor topological codes2, long-distance entanglement links3, or a combination of both4. There exist several physical platforms where state preservation5–7, qubit control8–11, and two-qubit logic gates8, 12 are achieved with fault-tolerant fidelities. The ultimate goal is to integrate a large number of qubits in expandable arrays to construct a scalable, universal quantum processor.",
                "Donor spin qubits in silicon are an appealing physical platform for that goal, due to their integrability with metal-oxide-semiconductor (MOS) structure and nanometric unit size13. By using isotopically enriched 28Si as the substrate material14, donor spins offer coherence times around a second (for the electron) or a minute (for the nucleus)7, up to hours in bulk ensembles6, and control error rates as small as 10−4  11. However, integrating several of these qubits in a scalable architecture remains a formidable challenge, mainly because of the difficulty in achieving reliable two-qubit gates.",
                "The seminal Kane proposal15 for a nuclear-spin quantum computer in silicon described the use of short-range exchange interactions J between donor-bound electrons, to mediate an effective inter-nuclear coupling of order ~100 kHz at a ~15 nm distance. However, the exchange interaction has an exponential and oscillatory spatial behavior that can result in an order of magnitude variation in strength upon displacement by a single lattice site16, 17. Notwithstanding, plenty of progress has been made in the experimental demonstration of the building blocks of a Kane-type processor18–21, including the observation of inter-donor exchange22–24. Slightly relaxed requirements on donor placement can be found when using a hyperfine-controlled exchange interaction between electron spin qubits25, or a slower magnetic dipole-dipole coupling effective at ~30 nm distances26. Other proposals space donors further apart by introducing some intermediate coupler, e.g., donor chains27, 28, charge-coupled devices29, ferromagnets30, probe spins31, or quantum dots32.",
                "Here we introduce the design of a large-scale, donor-based silicon quantum processor based upon electric dipole interactions. This processor could be fabricated using existing technology, since it does not require precise donor placement. The large inter-qubit spacing, >150 nm, leaves sufficient space to intersperse classical control and readout devices, while retaining some of the compactness of atomic-size qubits. Stabilization schemes largely decouple the qubits from electric noise while still keeping them sensitive to electric drive and mutual coupling. Finally, the whole structure retains the standard silicon MOS materials stack, important for ultimate manufacturability."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Coupling Si:P Spin Qubits To Electric Fields",
                    "paragraphs": [
                        "The phosphorus donor in silicon comprises an electron spin S = 1/2 with gyromagnetic ratio γ e = 27.97 GHz T−1 and basis states \\(\\left. \\mid \\downarrow \\right\\rangle\\) , \\(\\left. \\mid \\uparrow \\right\\rangle\\) , and a nuclear spin I = 1/2 with gyromagnetic ratio γ n = 17.23 MHz T−1 and basis states \\(\\left. \\mid \\Downarrow \\right\\rangle,\\left. \\mid \\Uparrow \\right\\rangle\\) . The electron interacts with the nucleus through the hyperfine coupling A ≈ 117 MHz. When placed in a large magnetic field B 0 (\\(\\gamma_{+}B_{0} \\gg A\\) , with γ + = γ e + γ n), the eigenstates of the system are the separable tensor products of the basis states, i.e., \\(\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle\\) , \\(\\left. \\mid {\\downarrow\\Downarrow} \\right\\rangle\\) , \\(\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle\\) , \\(\\left. \\mid {\\uparrow\\Uparrow} \\right\\rangle\\)  (Fig. 1c). The electron and the nucleus can be operated as single qubits by applying oscillating magnetic fields resonant with any of the transitions frequencies between eigenstates that differ by the flipping of one of the spins, e.g., \\(\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle\\)  ↔ \\(\\left. \\mid {\\uparrow\\Uparrow} \\right\\rangle\\)  for the electron qubit, etc. (Fig. 1c).Fig. 1Coupling donor spin qubits to electric fields via hyperfine modulation. a Qubit unit cell, in which the electron interface state, |i〉, is coupled to the donor-bound state, |d〉, by a tunnel rate V t. The solid black line represents the conduction band profile along z. b Bloch sphere of a flip-flop spin qubit coupled to a vertical electric field E z via the hyperfine interaction A. Electron-nuclear singlet and triplet states are denoted by \\(S = \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle - \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  and \\(T_{0} = \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle + \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\) . c Si:P electron-nuclear spin levels, showing standard electron spin resonance (ESR) and nuclear magnetic resonance (NMR) transitions, together with hyperfine-enabled EDSR. d Atomistic tight-binding simulations72 (dots) of the electron-nucleus hyperfine interaction, for a z d = 15.2 nm deep donor, as a function of vertical electric field. The solid line is a fit using the simplified two-level Hamiltonian \\(\\mathcal{H}_{orb} + \\mathcal{H}_{A}^{orb}\\) , which yields V t = 9.3 GHz (see Supplementary Note 1). The insets show the electron ground-state wavefunction, \\(\\left. \\mid g \\right\\rangle\\) , in the region within dashed lines in a, for three different vertical electric fields. Scale bar is 10 nm",
                        "We envisage a device where a shallow 31P donor is embedded in an isotopically enriched 28Si crystal at a depth z d from the interface with a thin SiO2 layer (Fig. 1a). The orbital wavefunction ψ of the donor-bound electron can be controlled by a vertical electric field E z applied by a metal gate on top. It changes from a bulk-like donor state at low electric fields to an interface-like state at high fields33, 34 (insets in Fig. 1d). The hyperfine interaction A(E z), proportional to the square amplitude of the electron wavefunction at the donor site |ψ(0, 0, z d)|2, changes accordingly from the bulk value A ≈ 117 MHz to A ≈ 0 when the electron is fully displaced to the interface (Fig. 1d). Shifting the electron wavefunction also results in the creation of an electric dipole μ e = ed, where e is the electron charge and d is the separation between the mean positions of the donor-bound and interface-bound wavefunctions (d ≲ z d, see Supplementary Note 1). The induced electric dipole μ e has been largely overlooked in the past, but plays a crucial role in this proposal.",
                        "The key idea is to define a new qubit, called henceforth the flip-flop qubit, described in the subspace spanned by the states \\(\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle\\) , \\(\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle\\) . Transitions between these basis states cannot be induced by magnetic resonance, because there is no change in the z-component of the total angular momentum. However, the hyperfine interaction, A S ⋅ I, is a transverse term in the flip-flop basis, since its eigenstates are \\(S = \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle - \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  and \\(T_{0} = \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle + \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  (Fig. 1b). Therefore, electrically modulating A(E z) at the frequency\\[\\epsilon_{ff}(A) = \\sqrt{\\left( {\\gamma_{+}B_{0}} \\right)^{2} + \\left\\lbrack {A\\left( E_{z} \\right)} \\right\\rbrack^{2}},\\] corresponding to the flip-flop qubit energy splitting, causes an electric dipole spin resonance (EDSR) transition between the \\(\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle\\) , \\(\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle\\)  basis states35, 36 (Fig. 1c). This transition is faster at the “ionization point”, where the electron is shared halfway between donor and interface, since A(E z) can vary strongly upon the application of a small voltage on the top gate."
                    ],
                    "subsections": []
                },
                {
                    "title": "Electrical Noise And Relaxation",
                    "paragraphs": [
                        "Since the qubit operation is based upon the use of electric fields, a natural concern is the fragility of the qubit states in the presence of electric noise. Below we show that there are special bias points that render the flip-flop qubit operation highly robust against noise.",
                        "A quantum-mechanical description of the system is obtained by treating also the electron position as a two-level system (effectively a charge qubit; see Supplementary Note 1 for a justification of this two-level approximation), where the vertical position of the electron is represented by a Pauli σ z operator, with eigenvectors |d 〉, for the electron at the donor, and |i 〉 at the interface (Fig. 1a, d). The simplified orbital Hamiltonian reads (in units of Hz):\\[\\mathcal{H}_{orb} = \\frac{V_{t}\\sigma_{x} - \\left\\lbrack {e\\left( {E_{z} - E_{z}^{0}} \\right)d\\slash h} \\right\\rbrack\\sigma_{z}}{2},\\] where V t is the tunnel coupling between the donor and the interface potential wells, \\(E_{z}^{0}\\)  is the vertical electric field at the ionization point, and h is the Planck constant. The electron ground |g 〉 and excited |e 〉 orbital eigenstates depend on E z (Fig. 1d) and have an energy difference given by:\\[\\epsilon_{o} = \\sqrt{\\left( V_{t} \\right)^{2} + \\left\\lbrack {e\\left( {E_{z} - E_{z}^{0}} \\right)d\\slash h} \\right\\rbrack^{2}}\\]",
                        "At the ionization point, the energy difference between eigenstates \\(\\left. \\mid e \\right\\rangle = \\left( {\\left. \\mid d \\right\\rangle + \\left. \\mid i \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  and \\(\\left. \\left. \\mid g \\right\\rangle = \\left( {\\left. \\mid d \\right\\rangle - \\left. \\mid i \\right\\rangle} \\right)\\slash\\sqrt{2} \\right.\\)  is minimum and equal to V t (Fig. 2a), and therefore first-order insensitive to electric noise, ∂\\(\\epsilon_{o}\\) /∂E z = 0. This bias point is referred to as the “charge qubit sweet spot”37 (CQSS—Fig. 2a).Fig. 2Robustness to electric noise. a Charge, \\(\\epsilon_{o}\\) , and flip-flop, \\(\\epsilon_{ff}\\) , qubit transition frequencies as a function of vertical electric field E z, for B 0 = 0.4 T, A = 117 MHz, d = 15 nm, Δγ = −0.2% and V t = 11.44 GHz. The inset shows the level diagram of flip-flop states coupled to charge states. CT stands for “clock transition” and CQSS for “charge qubit sweet spot”. b Estimated flip-flop qubit dephasing rate, assuming electric field noise \\(E_{z{,rms}}^{noise} = 100\\)  V m−1. c E z-dependence of flip-flop precession frequency for the three indicated tunnel coupling values. d Flip-flop qubit relaxation rate, with arrows indicating the adiabatic path used for z-gates. e Flip-flop qubit dephasing rate due to E z noise and relaxation, at second-order CTs for each B 0. f Device structure to tune the tunnel coupling V t of the charge qubit. Scale bar is 30 nm. g V t as a function of right gate voltage, calculated using a finite element Poisson solver (Synopsis TCAD) and atomistic tight biding (NEMO-3D)72. The insets illustrate the NEMO-3D wavefunctions inside dashed region in f, for three right gate voltages V r = −1, −0.35 and −0.27 V. The left gate voltage is V l = −0.5 V for all the simulations, and the top gate is biased such that the position of the electron is in between the donor and interface. Scale bar is 20 nm. The donor is assumed to be z d = 9.2 nm below the Si/SiO2 interface",
                        "Conversely, the bare flip-flop qubit energy is expected to depend strongly on E z, through the combined effect of the hyperfine interaction A (Eq. 1) and the orbital dependence of the electron gyromagnetic ratio, γ e. Indeed, the gyromagnetic ratio of an electron confined at a Si/SiO2 interface can differ from that of a donor-bound electron by a relative amount Δγ up to 0.7%38. Therefore, the Zeeman terms in the Hamiltonian must include a dependence of the electron Zeeman splitting on its orbital position, i.e., the charge qubit σ z operator:\\[\\mathcal{H}_{B_{0}}^{orb} = \\gamma_{e}B_{0}\\left\\lbrack {1 + \\left( \\frac{1 + \\sigma_{z}}{2} \\right)\\Delta_{\\gamma}} \\right\\rbrack S_{z} - \\gamma_{n}B_{0}I_{z}.\\] We can also write the hyperfine coupling as an operator that depends on the charge qubit state:\\[\\mathcal{H}_{A}^{orb} = A\\left( \\frac{1 - \\sigma_{z}}{2} \\right)\\mathbf{S} \\cdot \\mathbf{I}\\] Indeed, this simple two-level approximation, shown as a black line in Fig. 1d, reproduces the full tight-biding simulations (yellow dots).",
                        "The overall flip-flop qubit transition frequency as a function of E z becomes:\\[\\epsilon_{ff}\\left( {A,\\gamma_{e}} \\right) = \\sqrt{\\left\\lbrack {\\gamma_{e}\\left( E_{z} \\right) + \\gamma_{n}} \\right\\rbrack^{2}{B_{0}}^{2} + \\left\\lbrack {A\\left( E_{z} \\right)} \\right\\rbrack^{2}},\\] shown in Fig. 2a (dashed line), where we assumed Δγ = −0.2%38. \\(\\epsilon_{ff}\\) (A, γ e) shows a steep slope around the ionization point, mostly caused by the E z-dependence of γ e (the dependence on A is less significant because \\(\\gamma_{+}B_{0} \\gg A\\) ). Therefore, while \\(E_{z} \\approx E_{z}^{0}\\)  is the fastest operation point for the flip-flop qubit driven by a resonant modulation of A, one might expect it to be the most prone to qubit dephasing from charge and gate noise, through the influence of E z on γ e.",
                        "However, computing instead the full flip-flop qubit Hamiltonian,\\[\\mathcal{H}_{ff} = \\mathcal{H}_{B_{0}}^{orb} + \\mathcal{H}_{A}^{orb} + \\mathcal{H}_{orb},\\] reveals that the qubit transition frequency has an extra bend around the ionization point (Fig. 2a, thick yellow line). This comes from Eq. (5), which provides a transverse coupling g so between the flip-flop and charge qubits (inset in Fig. 2a):\\[g_{so} = \\frac{A}{4}\\frac{V_{t}}{\\epsilon_{o}}\\] As a result, the electron orbit dispersively shifts the flip-flop qubit by, to second order:\\[D_{orb}\\left( E_{z} \\right) = \\frac{\\left\\lbrack {g_{so}\\left( E_{z} \\right)} \\right\\rbrack^{2}}{\\delta_{so}\\left( E_{z} \\right)},\\] where δ so = \\(\\epsilon_{o}\\)  − \\(\\epsilon_{ff}\\) , reducing the flip-flop qubit frequency to:\\[\\epsilon_{ff}\\left( {A,\\gamma_{e},D_{orb}} \\right) = \\epsilon_{ff}\\left( {A,\\gamma_{e}} \\right) - D_{orb}\\left( E_{z} \\right),\\]  D orb(E z) is largest around \\(E_{z} \\approx E_{z}^{0}\\) , since δ so is lowest (i.e., the charge qubit frequency comes closest to the flip-flop qubit, Fig. 2a) and g so is highest. Equation (10) (thin black line in Fig. 2a) agrees with full numerical simulations of the Hamiltonian in Eq. (7).",
                        "Such a dispersive shift stabilizes the flip-flop precession frequency against noise. To quantify that, we assume a quasi-static electric field noise with 100 V m−1 r.m.s. amplitude along the donor-dot direction (z-axis in Fig. 1a). This noise is equivalent to a 1.5 μeV charge detuning noise for d = 15 nm, consistent with experimentally observed values in similar silicon devices39–41—see Supplementary Note 3. The estimated—see Methods section—dephasing rates can be as low as \\(1\\slash T_{2}^{*} \\approx 3\\)  kHz (Fig. 2b), comparable to the ones due to magnetic noise (\\(\\left. 1\\slash T_{2}^{*} \\approx 1 \\right.\\)  kHz in 28Si nanostructures7). This can be understood from Fig. 2c, which shows the qubit precession frequency dependence on E z, for three different values of V t. For small detunings δ so, i.e., V t close to \\(\\epsilon_{ff}\\) , the dispersive shift around the ionization point is strong, yielding two first-order “clock transitions” (CT), where ∂\\(\\epsilon_{ff}\\) /∂E z = 0 where the dephasing rate is reduced. By increasing V t, the two first-order points merge into a single one in which both the first and second derivatives vanish, yielding the slowest qubit dephasing.",
                        "Another source of errors could come from relaxation via coupling to phonons. This is not an issue for bulk donors, where electron spin relaxation time is \\(T_{1,s} \\gg 1\\)  s18. However, due to the particular valley composition of the flip-flop qubit near the ionization point, its relaxation rate 1/T 1,ff due to charge-phonon coupling is enhanced42. We estimate it by noting that, if \\(\\delta_{so} \\gg g_{so}\\) , 1/T 1,ff is equal to the amount of charge excited state in the flip-flop eigenstates43 times the charge relaxation rate42:\\[1\\slash T_{1,{ff}} = \\left( {g_{so}\\slash\\delta_{so}} \\right)^{2}\\slash T_{1,o},\\]  \\[1\\slash T_{1,o} = \\Theta\\epsilon_{o}{V_{t}}^{2},\\] where T 1,o is the charge qubit lifetime and Θ ≈ 2.37 × 10−24 s2 is determined by the silicon crystal properties42. Therefore, as can be seen from Fig. 2d, the higher the detuning δ so, the slower the relaxation. In particular, at the second-order CT, the qubit dephasing can be limited by relaxation, \\(1\\slash T_{2}^{*} = 1\\slash 2T_{1} \\approx 10^{4}\\)  Hz. This limitation can be overcome by reducing B 0 (Fig. 2e).",
                        "Tuning a flip-flop qubit into a clock transition requires the ability to tune the tunnel coupling V t. The latter is difficult to control at the fabrication stage, given its exponential dependence on donor depth, together with oscillations at the atomic scale44 arising from a similar valley interference effect as the one afflicting the exchange interaction16. Indeed, ion-implanting a donor at z d ≈ 15 nm below the interface happens with a vertical uncertainty of order ±10nm45, resulting in more than two orders of magnitude uncertainty in V t 44. Therefore, it is crucial to implement a method to tune V t in situ. A possible solution is to displace the location of the interface wavefunction laterally, which in turn modifies the overlap between the donor and interface wavefunctions and therefore V t. This can be done by adding two gates on either side of the top gate, which pulls the donor electron to the interface (Fig. 2f), in such a way that a relative voltage between the gates can modify the interface lateral potential landscape. This gate stack is identical to the well-established scheme for the confinement of single electrons in Si quantum dots10. This technique allows V t to be tuned by at least wo orders of magnitude (Fig. 2g), therefore circumventing the uncertainty in donor depth and V t arising from ion-implantation."
                    ],
                    "subsections": []
                },
                {
                    "title": "Adiabatic Phase Control",
                    "paragraphs": [
                        "The presence of slow dephasing regions is important to control the qubit phase with high fidelity. In our quantum processor, idle qubits are decoupled from electric fields by fully displacing the electron either to the interface or to the donor. Performing quantum operations on the qubit requires displacing the electrons close to the ionization point, which in turn changes its precession frequency (Fig. 2a). As a result, the accumulated phase must be corrected after quantum operations. This is optimally done by moving the electron to the second-order clock transition, therefore minimizing dephasing errors. At this point, the flip-flop qubit phase precesses \\({\\& sim;}\\Delta_{\\gamma}\\gamma_{e}B_{0}\\slash 2 - D_{orb}\\)  faster than its idle point, and therefore any phase correction in a 2π period can be applied within tens of ns. The dephasing rate at the CT, on the order of a few kHz, would cause very small errors (<10−4). However, while moving the electron from the interface toward the donor, the flip-flop qubit goes through regions of fast dephasing (Fig. 2b), and therefore this operation has to be performed as quickly as possible. It also has to be slow enough as to avoid erros due to non-adiabaticity, which include, e.g., leakage to unwanted high-energy states. These errors depend on the adiabatic factor K, which quantifies the fractional rate of change of the system’s eigenstates (the higher the value of K, the more adiabatic and slower is the process—see Methods section).",
                        "In Fig. 3a, we plot the time dynamics of an initial state \\(\\left. \\mid g \\right\\rangle \\otimes \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle + \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  while sweeping E z adiabatically (K = 50) to move the electron from the interface to the second-order CT and back, in order to realize a π z-gate. The initial adiabatic set-up part consists of a fast sweep (0.8 ns), allowed by the large charge qubit splitting when \\(E_{z} \\gg E_{z}^{0}\\) , followed by a slower sweep (3.5 ns), limited by the proximity of excited charge states to the flip-flop qubit when \\(E_{z} \\approx E_{z}^{0}\\) . The electron then remains at the CT for 60 ns, before adiabatically moving back to the interface. During the total 69 ns, the flip-flop qubit phase is shifted by π, with adiabatic errors, averaged over a set of initial flip-flop states—see Methods section—around 10−4. These errors can be controlled with the factor K, which determines the set-up time (see Fig. 3b).Fig. 3High-fidelity adiabatic z-gates. a Time-evolution of an adiabatic (K = 50) π z-gate on state \\(\\left. \\mid g \\right\\rangle \\otimes \\left( {\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle + \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\) , showing applied electric field and flip-flop/charge states. Outer brackets denote the expectation value of an operator. \\(\\sigma_{z}^{ff} = \\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle\\left\\langle {\\uparrow\\Downarrow} \\mid \\right. - \\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle\\left\\langle {\\downarrow\\Uparrow} \\mid \\right.\\)  and \\(\\sigma_{x}^{ff} = \\left. \\mid +_{x}^{ff} \\right\\rangle\\left\\langle +_{x}^{ff} \\mid \\right. - \\left. \\mid -_{x}^{ff} \\right\\rangle\\left\\langle -_{x}^{ff} \\mid \\right.\\) , where \\(\\left. \\mid +_{x}^{ff} \\right\\rangle = \\left( {\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle + \\exp\\left( {- i2\\pi\\epsilon_{ff}^{t = 0}} \\right)\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\)  and \\(\\left. \\mid -_{x}^{ff} \\right\\rangle = \\left( {\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle + \\exp\\left( {- i2\\pi\\epsilon_{ff}^{t = 0} - i\\pi} \\right)\\left. \\mid {\\downarrow\\Uparrow} \\right\\rangle} \\right)\\slash\\sqrt{2}\\) . Fast oscillations between the charge and flip-flop states are due to small deviations from perfect adiabaticity. b π z-gate leakage error for different adiabatic set-up times, which are set by the factor K. c π z-gate error due to quasi-static E z noise, at the second-order CT at B 0 = 0.4 T, for different noise amplitudes and adiabatic set-up times",
                        "Quasi-static E z noise can increase errors, due to dephasing (Fig. 3c). At realistic noise levels (100 V m−1), the gate error rate is found to be <10−4. Similar error levels arise due to relaxation, which remains below 3 × 104 Hz (Fig. 2d).",
                        "Note that the presence of clock transitions does not affect the ability to use E ac to resonantly drive the qubit, since the transverse term A(E z) still responds fully to the electric field (this is similar to the case of magnetic clock transitions, e.g,. in Si:Bi46)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Electric Drive Of The Flip-Flop Qubit",
                    "paragraphs": [
                        "We now explain how high-fidelity one-qubit x(y)-gates can be achieved via electric drive of the flip-flop qubit. The fastest one-qubit gates are obtained when the electron is around the ionization point, where ∂A/∂E z is maximum (Fig. 1d). A vertical oscillating electric field of amplitude E ac is applied (Fig. 4a) in resonance with the flip-flop qubit, i.e., ν E = \\(\\epsilon_{ff}\\) . A large detuning \\(\\delta_{so} \\gg g_{so}\\)  (Fig. 4b) ensures the least amount of the charge excited state \\(\\left. \\mid e \\right\\rangle\\)  in the qubit eigenstates, minimizing qubit relaxation via charge-phonon coupling. The flip-flop qubit is still driven, via a second-order process, at a rate (half-Rabi frequency):\\[g_{E}^{ff} = \\frac{g_{so}g_{E}}{2}\\left( {\\frac{1}{\\delta_{so}} + \\frac{1}{\\delta_{E}}} \\right),\\] where δ E = ν E − \\(\\epsilon_{o}\\)  and g E is the driven electric coupling rate between the two charge eigenstates:\\[g_{E} = \\frac{eE_{ac}d}{4h}\\frac{V_{t}}{\\epsilon_{o}},\\] where E ac is the amplitude of a sinusoidal drive. Equation (13) provides another explanation of why the fastest one-qubit gates are obtained when the electron is at the ionization point: δ so and δ E are minimum (\\(\\epsilon_{o}\\)  is minimum), and g so and g E are maximum (Eqs. (8) and (14)).Fig. 4High-fidelity electrically driven adiabatic x(y)-gates. a Spatial representation and b level diagram, for electrical drive of a flip-flop qubit, showing partially ionized electron wavefunction and spin arrows. c Time-dependent adiabatic drive amplitude and qubit dynamics of a π/2 x-gate, for K = 30, B 0 = 0.4 T, \\(E_{z} = E_{z}^{0},\\)  and V t = 11.5 GHz. Bottom plot shows flip-flop z state, \\(\\left\\langle \\sigma_{z}^{ff} \\right\\rangle\\) , electron position, 〈σ z〉, and charge qubit state, \\(\\left\\langle {\\left. \\mid e \\right\\rangle\\left\\langle e \\mid \\right. - \\left. \\mid g \\right\\rangle\\left\\langle g \\mid \\right.} \\right\\rangle\\) . For the same parameters, d shows the averaged drive power and gate time, and e the error rates for different V t. To estimate the drive power, we assumed a 50 Ω line in which a 1 μV AC voltage produces a 10 V m−1 AC vertical electric field. f Estimated flip-flop qubit π/2 x-gate error due to quasi-static noise with amplitude \\(E_{z{,rms}}^{noise} = 100\\)  V m−1. g Dependence of gate error rate on the electric noise r.m.s. amplitude and adiabatic factor K (which sets the gate time)",
                        "The electrical drive can cause some excitation of the charge qubit. It is therefore convenient to turn E ac on/off adiabatically to make sure the charge is de-excited at the end of the gate. Figure 4c shows the E ac time evolution needed for a π/2 x-gate, where we have assumed an adiabatic factor K = 30, sufficient for leakage errors <10−3. E ac increases steadily until a π/4 rotation is completed, after which E ac is gradually switched off to achieve an adiabatic π/2 x-gate. An average 4% excitation of the charge qubit causes a ~4 × 104 Hz relaxation rate of the encoded quantum state (Eq. 12), or error levels close to 10−3.",
                        "We then investigate how the total π/2 x-gate errors depend on the biasing of the electron wavefunction. At the ionization point, \\(E_{z} = E_{z}^{0}\\) , error levels close to 10−3 are found over a wide range of V t (Fig. 4e). The K = 30 choice ensures adiabatic errors <10−3 with an oscillatory character typical of adiabatic processes47. At small V t (and therefore small detuning δ so), the qubit eigenstates contain a substantial amount of charge, causing more errors due to charge-phonon relaxation. Increasing the detuning δ E with larger V t allows for a faster adiabatic sweep and higher powers (Fig. 4d), yielding shorter gate times and therefore less errors due to quasi-static noise. Still, the incident power is at least three orders of magnitude lower than the one needed to drive donor electron spin qubits, at the same Rabi frequency, with oscillating magnetic fields7, 19.",
                        "As Fig. 4f shows, low error rates are still available away from the ionization point, even though best values are found at \\(E_{z} = E_{z}^{0}\\) . This is because our gate times are so fast that dephasing, and therefore CTs, do not play a crucial role. Instead, quasi-static E z noise cause errors mainly by modulating the driving strength \\(g_{E}^{ff}\\) , causing “gate time jitter”. Indeed, the gate time is sensitive to the orbital transition frequency \\(\\epsilon_{o}\\)  (Eq. 13), and therefore gate errors are minimized close to the charge qubit sweet spot (CQSS), where ∂\\(\\epsilon_{o}\\) /∂E z = 0 (Fig. 2a).",
                        "Finally, as Fig. 4g shows, lower quasi-static E z noise can cause less errors, provided that the adiabatic factor K is increased, to reduce leakage errors, up to an optimum value where gate times are still fast as to keep noise errors low. Relaxation errors could also be reduced by reducing B 0 (recall Fig. 2e).",
                        "A number of other noise sources, including high frequency charge noise, Johnson-Nyquist, and evanescent-wave Johnson noise48 (EWJN) also affect qubits that are sensitive to electric fields. However, as we discuss in Supplementary Note 3, the corresponding error rates are much lower than the ones already previously mentioned—see all estimated error levels in Table 1.Table 1Error rates of x(y)-gates from different noise sources as discussed in Supplementary Note 3  Noise source  Spectral bandwidths  Quasi static (<10 6  Hz)  Rabi (~10 7  Hz)  Qubit (~10 10  Hz) 1/f vertical (E z)10−3 <10−4 10−4 1/f horizontal (E x,y)10−4 <10−5 -Charge-phonon relaxation--10−3 Johnson-Nyquist≪10−5 <10−5 <10−4 EWJN-<10−6 <10−4 Hyphens indicate non-existent or negligible errors."
                    ],
                    "subsections": []
                },
                {
                    "title": "Two-Qubit Coupling Via Electric Dipole Interaction",
                    "paragraphs": [
                        "We now present the method to couple donor spins that lies at the heart of our scalable quantum processor. It exploits the electric dipole that naturally arises when a donor-electron wavefunction is biased to the ionization point (Fig. 5a), due to the fact that a negative charge has been partly displaced away from the positive 31P nucleus. The electric field produced by this induced dipole in turn, modifies the energy of a nearby donor which is also biased at the ionization point, resulting in a long-range coupling between the two.Fig. 5Robust electric dipole-dipole interactions between two distant flip-flop qubits. a Device scheme for coupling qubits, showing dipole field lines, E dip, produced by the dipole on the left. b Level diagram for two-qubit coupling via electric dipole-dipole interaction. c Lowest molecular eigenstates for the two charge qubits inside dashed rectangle in b. The eigenenergy shift equals D dd = (δ so,2 − δ so,1)\\(\\left. \\left( {\\sqrt{1 + \\left\\lbrack 2g_{dd}\\slash\\left( {\\delta_{{so},2} - \\delta_{{so},1}} \\right) \\right\\rbrack^{2}} - 1} \\right)\\slash 2 \\right.\\) . The eigenstate coefficients are \\(\\beta = \\theta\\slash\\sqrt{\\theta^{2} + 1}\\)  and \\(\\alpha = \\phi\\slash\\sqrt{\\phi^{2}{+1}}\\) , with \\(\\theta,\\phi = \\left\\lbrack {\\left( {\\delta_{{so},2} - \\delta_{{so},1}} \\right) \\pm \\sqrt{\\left( {\\delta_{{so},2} - \\delta_{{so},1}} \\right)^{2} + \\left( {2g_{dd}} \\right)^{2}}} \\right\\rbrack\\slash\\left( {2g_{dd}} \\right)\\) . Effective coupling between two flip-flop qubits as a function of V t,1 = V t,2 = V t, interdistance r (d) and electric field E z,1 = E z,2 = E z (e). The arrows in e represent the adiabatic path followed for two-qubit gates. \\(E_{z}^{0,2q}\\)  is the ionization point in the presence of a second qubit, \\(E_{z}^{0,2q} = E_{z}^{0} - 2g_{dd}h\\slash\\left( {2ed_{i}} \\right)\\)",
                        "The interaction energy between two distant dipoles, μ 1 and μ 2, oriented perpendicularly to their separation, r, is49 \\(V_{dip} = \\mu_{1}\\mu_{2}\\slash\\left( {4\\pi\\varepsilon_{r}\\varepsilon_{0}r^{3}} \\right)\\) , where ε 0 is the vacuum permittivity and \\(\\epsilon\\)  r the material’s dielectric constant (ε r = 11.7 in silicon). The electric dipole of each donor-interface state is μ i = ed i(1 + σ z,i)/2, implying that the dipole-dipole interaction Hamiltonian is:\\[\\mathcal{H}_{dip} = V_{dd}\\left( {\\sigma_{z,1}\\sigma_{z,2} + \\sigma_{z,1} + \\sigma_{z,2}} \\right)\\]  \\[V_{dd} = \\frac{1}{16\\pi\\varepsilon_{0}\\varepsilon_{r}h}\\frac{e^{2}d_{1}d_{2}}{r^{3}}\\]",
                        "This electric dipole-dipole interaction is therefore equivalent to a small shift in the equilibrium orbital position of both electrons plus a coupling term between the charge qubits (blue dashed rectangle in Fig. 5b) equal to:\\[g_{dd} = V_{dd}\\frac{V_{t,1}V_{t,2}}{\\epsilon_{o,1}\\epsilon_{o,2}}\\]",
                        "Note that this interaction can be stronger due to the presence of a metallic interface on top of the qubits, which enhances vertical dipoles—see Supplementary Note 2. Most importantly, since each flip-flop qubit is coupled to their electron position (Eq. 5), the electric dipole-dipole interaction provides a natural way to couple two distant flip-flop qubits.",
                        "Indeed, the effective coupling rate between two flip-flop qubits at the ionization point, Fig. 5d, exceeds 10 MHz around two narrow regions. These bands can be understood from the energy-level diagram shown in Fig. 5c. The two charge qubits in Fig. 5b form hybridized molecular states, which are coupled to each flip-flop qubit. The two-qubit coupling rate is maximum when in resonance with a molecular state. However, this regime induces too many relaxation errors due to resonant charge excitation. Therefore, it is best to detune the flip-flop qubits from the molecular states, while still keeping a substantial inter-qubit coupling rate, via a second-order process, equal to:\\[g_{2q}^{ff} = g_{so,1}g_{so,2}\\alpha\\beta\\left( {\\frac{1}{D_{dd} - \\delta_{{so},1}} + \\frac{1}{D_{dd} + \\delta_{so,2}}} \\right),\\] where D dd is the charge eigenenergies shift and α, β the eigenstates coefficients—see Fig. 5c caption.",
                        "Two-qubit gates start with both electrons at the interface, where qubits are decoupled since the electric dipoles and the hyperfine interactions are first-order insensitive to vertical electric fields. Indeed, from Eq. (18), \\(g_{2q}^{ff}\\)  is negligible since g so vanishes and δ so diverges. The electrons are then simultaneously and adiabatically displaced to the ionization point for a time necessary for an \\(\\sqrt{i{SWAP}}\\)  gate, before returning to the interface. In Fig. 6a, we show the dynamics of a two-qubit gate performed with an adiabatic factor K = 30, following the trajectory shown in Fig. 5e. Similarly to one-qubit z-gates, the electron is first displaced in a fast time scale (~0.3 ns) set by the charge qubit parameters (\\(\\epsilon_{0}\\)  and V t), followed by a slower sweep (~19 ns) set by the spin-charge coupling parameters (δ so and g so), until it reaches the ionization point. The electron remains still for a short time before the whole process is then reversed. In the end, a \\(\\sqrt{i{SWAP}}\\)  gate is performed. While some amount of charge is excited during the process, it goes back to its ground state, \\(\\left. \\mid {gg} \\right\\rangle\\) , with an adiabatic error around 10−3.Fig. 6High-fidelity adiabatic \\(\\sqrt{i{SWAP}}\\)  gates between two distant flip-flop qubits. a Time evolution of an adiabatic \\(\\sqrt{i{SWAP}}\\)  gate, for K = 30, r = 180 nm, B 0 = 0.4 T, and V t = 11.58 GHz. b Optimized \\(\\sqrt{i{SWAP}}\\)  gate error, gate time, and adiabatic factor K. c Optimized error rate arising from quasi-static E z-noise, for different noise amplitudes and adiabatic factor K (which sets the gate time)",
                        "We quantify the two-qubit gate fidelity in presence of the most deleterious noise types for our qubits, namely quasi-static E z noise and charge-phonon relaxation. For this, we observe that the optimal gate fidelities are achieved when \\(E_{z}\\left( {\\tau_{\\sqrt{i{SWAP}}}\\slash 2} \\right) \\approx E_{z}^{0}\\) . Similarly to one-qubit x-gates, this happens because \\(\\sqrt{i{SWAP}}\\)  gates are sensitive to gate time jitter, and therefore errors are minimized at the CQSS, where \\(g_{2q}^{ff}\\)  is robust against E z noise to first order—recall Fig. 5e and Eq. (18). An optimization algorithm finds the best adiabatic factor K that minimizes errors due to E z noise for each value of V t,1 = V t,2 = V t. The result is shown in Fig. 6b. Smaller detunings δ so (small V t) result in shorter gate times, which in turn reduces errors from quasi-static noise. However, this also implies a larger admixture of charge in the qubit eigenstates, which slightly increases relaxation errors. The lowest error rates, ~3 × 10−3 are found at small detunings, V t − \\(\\epsilon_{ff}\\)  − g dd ≈ 100 MHz (V t ≈ 11.59 GHz). At even smaller detunings, the two-qubit coupling rate becomes too fast, requiring faster adiabatic sweeps to avoid over-rotation (lower K, Fig. 6b) and generating more leakage errors. The gate errors remain within 10−3 − 10−2 for a wide range of V t. Finally, we estimate in Fig. 6c how noise errors depend on the noise amplitude and adiabatic factor K, which sets the gate time.",
                        "Our proposed two-qubit gates are not only well protected against noise, but also robust against donor misplacement. Variations in r, d 1, and d 2 mainly cause variations in the charge qubits coupling g dd, therefore simply changing the energy separation between molecular charge states (Fig. 5c). However, the coupling \\(g_{2q}^{ff}\\)  between the flip-flop qubits can be kept essentially constant by simply readjusting V t, using, e.g., the method described in Fig. 2f, g. Figure 5d shows that one can keep a constant value of, e.g., \\(g_{2q}^{ff} = 1\\)  MHz for any inter-donor spacing between 180 and 500 nm, by adjusting V t between 11.3 and 11.8 GHz. In other words, since the flip-flop qubit coupling is mediated by a tunable interaction with their respective charge qubits, the inter-qubit interaction does not need to decay with r 3, as one would otherwise get when the dipole interaction couples the qubits directly26, 31. Therefore, two-qubit operations can be turned on between pairs of qubits separated by many sites in a two-dimensional array. This tunable long-range connectivity can be exploited to great advantage in large-scale quantum processors50. The large tolerance in g dd also accommodates very well the donor depth uncertainties inherent to ion implantation45, given the linear dependence of \\(g_{2q}^{ff}\\)  on d i (Eqs. (16) and (17)).",
                        "We conclude that our scheme provides a dramatic reduction in the fabrication complexity, especially compared to schemes that require placing a gate between a pair of tightly spaced donors, such as the Kane’s proposal15, which requires r ≈ 15 nm separation between two 31P nuclear spins. Note that, by relocating the problem of valley oscillations from the exchange interaction15 to the tunnel coupling, we have effectively provided a way in which the delicate parameter can now be tuned using a much simpler gate geometry."
                    ],
                    "subsections": []
                },
                {
                    "title": "Scaling Up Using Circuit Quantum Electrodynamics",
                    "paragraphs": [
                        "In order to reach the long-term goal of a large-scale quantum processor, wiring up the control and read-out lines for each individual qubit is not trivial, given the high density in typical spin qubit architectures51. Recent solutions include cross-wiring using multilayer lithography26 or floating gate electrodes inspired by dynamic random access memory systems52. In both cases, using flip-flop qubits with long-distance interactions would result in widely spaced donors and loose fabrication tolerances. In addition, since flip-flop qubits are coupled via electric fields, they could be spaced further apart by using electrical mediators. These include floating metal gates53 or even microwave resonators. Indeed, the use of electric dipole transitions allows a natural integration of donor-based spin qubits into a circuit-quantum electrodynamics architecture43, 54–56 (see Fig. 7c for a possible device layout).Fig. 7Silicon hybrid quantum processor. a Figures of merit summarizing the speed and error rates of different gate schemes presented in this paper, assuming realistic noise sources. b Level diagram for distant flip-flop qubit coupling via a microwave resonator showing photon number states and off-resonant charge states. c Device scheme for coupling qubits via a photonic link. Distant donors, placed next to the resonator center line and biased to their ionization point, are subject to the vacuum electric field E vac of a shared microwave resonator. d Schematic view of a large-scale quantum processor based upon 31P donors in Si, operated and coupled through the use of an induced electric dipole. Idle qubits have electrons at the interface, leaving the 31P nucleus in the ultra-coherent ionized state. Electrons are partially shifted toward the donor for quantum operations. The sketch shows a possible architecture where a cluster of qubits is locally coupled via the electric dipole, and a subgroup thereof is further coupled to another cluster through interaction with a shared microwave cavity (aqua). The drawing is not to scale; control lines and readout devices are not shown",
                        "A full quantum mechanical treatment yields a charge-photon coupling rate given by Eq. (14), with ν E now representing the resonator fundamental mode frequency and E ac the resonator vacuum field, E vac. Again, it is best to have the charge-excited state detuned from the flip-flop transition and resonator photon (see Fig. 7b), therefore minimizing charge excitation while retaining a second-order flip-flop photon coupling given by Eq. (13). Assuming δ so ≈ δ E ≈ 10g so ≈ 10g E, a d = 15 nm deep 31P flip-flop qubit would be coupled to photons at a \\(g_{E}^{ff} \\approx 3\\)  MHz rate. This is three orders of magnitude faster than the electron-spin coupling rate to a resonator via its magnetic vacuum field57, 58, and comparable to the coupling strength obtained by using strong magnetic field gradients59, 60, but without the need to integrate magnetic materials within a superconducting circuit. This assumes a vacuum field amplitude E vac ≈ 30 V m−1, which can be obtained by using tapered coplanar waveguide or high-inductance resonators61.",
                        "The possibility of coupling the qubits to microwave photons provides a path for dispersive qubit readout, as well as for photonic interconnects. Near-quantum limited amplifiers have recently become available to obtain excellent read-out speed and fidelities62. The resonator can also be used as a quantum bus to couple two spin qubits separated by as far as 1 cm (Fig. 7c), a distance given by the mode wavelength. Figure 7b shows the detailed energy-level diagram. To avoid losses from photon decay, the qubits should be detuned from the resonator by an amount much greater than the qubit-photon coupling rates. Assuming \\(\\delta_{E}^{ff} = 10g_{E}^{ff}\\) , where \\(\\delta_{E}^{ff} = \\nu_{E} - \\epsilon_{ff}\\) , the effective two-qubit coupling \\(g_{2q}^{ff} \\approx \\left( g_{E}^{ff} \\right)^{2}\\slash\\delta_{E}^{ff} \\approx 0.3\\)  MHz yields a \\(\\sqrt{i{SWAP}}\\)  gate that takes only 0.4 μs."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Figure 7a summarizes the key figures of merit of a quantum processor based on flip-flop qubits coupled by electric dipole interactions. Fast one-qubit x(y)-gates are attainable with low electric drive power and error rates ~10−3. Two-qubit \\(\\sqrt{i{SWAP}}\\)  gates are fast and with error rates approaching 10−3. At the end of all operations, the phase of each qubit can be corrected, via adiabatic z-gates, in fast time scales and low error rates ~10−4. These values are based on current experimentally known values of charge noise in silicon devices39, and are possibly amenable to improvement through better control of the fabrication parameters. More advanced control pulse schemes could allow for faster gates with less leakage63–65, and active noise cancellation techniques, e.g., pulses for gate time jitter66 or decoherence67 suppression, could further improve gate fidelities.",
                "Idle qubits are best decoupled from all other qubits by having the electron at the interface and the quantum state stored in the nuclear spin, which has a record coherence times T 2 ≳ 30 s7, and can be even longer in bulk samples6. Quantum information can be swapped between the nuclear and the flip-flop qubit by simply applying an ESR π-pulse that excites the \\(\\left. \\mid {\\downarrow\\Downarrow} \\right\\rangle\\)  state to \\(\\left. \\mid {\\uparrow\\Downarrow} \\right\\rangle\\)  (Fig. 1c).",
                "Qubit read-out can be obtained by spin-dependent tunneling into a cold charge reservoir, detected by a single-electron transistor18. Read-out times can be ~1 μs with cryogenic amplifiers68, which is comparable to the time necessary to perform, e.g., ~20 individual gates lasting ~50 ns each, in a surface code error correction protocol2.",
                "A large-scale, fault-tolerant architecture can be built in a variety of ways. One- or two-dimensional arrays can be built to implement error correction schemes such as the Steane69 or the surface2 code, since all mutual qubit couplings are tunable and gateable. A larger processor can include a hybrid of both coupling methods, incorporating cells of dipolarly coupled qubits, interconnected by microwave photonic links (Fig. 7d), in which case more advanced error-correction codes can be implemented1, 3, 4, 50. Microwave resonators could be also used to interface donors with superconducting qubits8, 70, for the long-term goal of a hybrid quantum processor that benefits from the many advantages of each individual architecture55.",
                "In conclusion, we have presented a way to encode quantum information in the electron-nuclear spin states of 31P donors in silicon, and to realize fast, high-fidelity, electrically driven universal quantum gates. Our proposal provides a credible pathway to the construction of a large-scale quantum processor, where atomic-size spin qubits are integrated with silicon nanoelectronic devices, in a platform that does not require atomic-scale precision in the qubit placement. The qubits are naturally amenable to being placed on two-dimensional grids and, with realistic assumptions on noise and imperfections, are predicted to achieve error rates compatible with fault-tolerant quantum error correction."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Adiabaticity",
                    "paragraphs": [
                        "Given a time-dependent Hamiltonian in a two-dimensional Hilbert space,\\[\\mathcal{H}_{2} = \\Delta(t)\\sigma_{z} + \\Omega(t)\\sigma_{x},\\] in units of rad s−1, the adiabatic condition is expressed as71 \\[K = {\\mid \\frac{\\omega_{eff}}{\\mathring{\\alpha}} \\mid} \\gg 1,\\] where \\(\\omega_{eff} = \\sqrt{\\Delta^{2} + \\Omega^{2}}\\)  is the instantaneous transition angular frequency between eigenstates, and \\(\\mathring{\\alpha}\\)  is the rate of change of the orientation of ω eff (α = arctan(Ω/Δ)). It follows from Eq. (20) that\\[K = \\frac{\\left( {\\Delta^{2} + \\Omega^{2}} \\right)^{3 \\slash 2}}{\\mid {\\mathring{\\Delta}\\Omega - \\mathring{\\Omega}\\Delta} \\mid} \\gg 1,\\]",
                        "Although the processes described in this paper involve multiple levels, we applied Eq. (21) in different forms as an approximation of adiabaticity. This was confirmed to be always valid by checking that the leakage errors were kept below a target level.",
                        "In particular, for one-qubit z-gates and two-qubit \\(\\sqrt{i{SWAP}}\\)  gates, we used \\(\\Delta_{c} = \\pi e\\left( {E_{z} - E_{z}^{0}} \\right)d\\slash h\\)  and Ωc = πV t to find K c for the charge qubit, and Δso = πδ so and Ωso = 2πg so to find K so for the spin-charge coupling. For a chosen adiabatic factor K, we find E z(t) by satisfying the condition min(K so, K c) = K.",
                        "For one-qubit drive, we used ΔE = πδ E and ΩE = 2πg E to find K E. A particular choice of K = K E sets the adiabatic sweep rate of E ac(t)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Estimation Of Dephasing And Gate Errors",
                    "paragraphs": [
                        "In order to estimate the effects of quasi-static E z noise on dephasing, we first calculate the flip-flop qubit transition frequency \\(\\epsilon_{ff}\\)  (difference between eigenfrequencies corresponding to eigenstates closest to \\(\\left. \\mid {g\\downarrow\\Uparrow} \\right\\rangle\\)  and \\(\\left. \\mid {g\\uparrow\\Downarrow} \\right\\rangle\\) , which we denote as \\(\\left. \\mid {g\\downarrow\\Uparrow} \\right\\rangle_{e}\\)  and \\(\\left. \\mid {g\\uparrow\\Downarrow} \\right\\rangle_{e}\\) ). Next, for a uniformly distributed noise in the range \\(E_{z}^{n} = \\sqrt{3}\\left\\lbrack {- E_{z,{rms}}^{noise},E_{z,{rms}}^{noise}} \\right\\rbrack\\) , we estimate the qubit dephasing rate to be\\[{Dephasing}\\;{rate} = \\sum\\limits_{n}{\\mid {\\epsilon_{ff} - \\epsilon_{ff}^{n}} \\mid}\\slash N_{n},\\] where N n is the number of sampled \\(E_{z}^{n}\\)  and \\(\\epsilon_{ff}^{n}\\)  is calculated for each value of \\(E_{z}^{n}\\) .",
                        "The averaged error rate (without noise) of a desired adiabatic unitary process U ideal is calculated by averaging the fidelity of the actual process U over a set of initial states \\(\\left. \\mid j \\right\\rangle\\) ,\\[{Adiabatic}\\;{error} = 1 - \\sum\\limits_{\\mid j\\rangle}{\\mid {\\left\\langle j \\mid \\right.U^{\\dagger}U_{ideal}\\left. \\mid j \\right\\rangle} \\mid}^{2}\\slash N_{j},\\] where N j is the number of initial states. For one-qubit gates (e.g., a π z-gate or a π/2 x(y)-gate), we choose \\(\\left. \\mid j \\right\\rangle = \\left\\{ {\\left. \\mid {g\\downarrow\\Uparrow} \\right\\rangle_{e},\\left. \\mid {g\\uparrow\\Downarrow} \\right\\rangle_{e},\\left( {\\left. \\mid {g\\downarrow\\Uparrow} \\right\\rangle_{e} + \\left. \\mid {g\\uparrow\\Downarrow} \\right\\rangle_{e}} \\right)\\slash\\sqrt{2},\\left( {\\left. \\mid {g\\downarrow\\Uparrow} \\right\\rangle_{e} + i\\left. \\mid {g\\uparrow\\Downarrow} \\right\\rangle_{e}} \\right)\\slash\\sqrt{2}} \\right\\}\\)  and N j = 4, whereas for two-qubit gates (e.g., \\(\\sqrt{i{SWAP}}\\) ) \\(\\left. \\mid j \\right\\rangle = \\left. \\mid j_{1} \\right\\rangle \\otimes \\left. \\mid j_{2} \\right\\rangle\\)  (the 1,2 indexes refer to the aforementioned four initial states for each qubit) and N j = 16.",
                        "To estimate the averaged gate error rate under quasi-static E z noise, the actual process U and eigenstates \\(\\left. \\mid j \\right\\rangle\\)  are calculated for each value of \\(E_{z}^{n}\\)  before averaging,\\[{Noise}\\;{error} = 1 - \\sum\\limits_{n,{\\mid j\\rangle}_{n}}{\\mid {\\left\\langle j \\mid \\right._{n}U_{n}^{\\dagger}U_{n,{ideal}}{\\;\\left. \\mid j \\right\\rangle}_{n}} \\mid}^{2}\\slash\\left( {N_{j}N_{n}} \\right)\\]",
                        "Finally, to estimate errors due to charge-phonon relaxation, we multiply the averaged charge excitation by its relaxation rate and assume a exponential decay in fidelity:\\[{Relax}.\\;{error} = \\frac{1 - e^{- \\int\\limits_{0}^{\\tau_{gate}}{({\\sum\\limits_{\\mid {j{(t)}}\\rangle}{\\langle{j{(t)}{\\mid e\\rangle}{\\langle e \\mid}j{(t)}}\\rangle}\\slash N_{j}})}dt \\slash T_{1,o}}}{2},\\] where \\(\\left. \\mid {j(t)} \\right\\rangle\\)  are the time-evolution of the initial set states \\(\\left. \\mid j \\right\\rangle\\) . For two-qubit gates, we sum up the error rate of each qubit."
                    ],
                    "subsections": []
                },
                {
                    "title": "Data Availability",
                    "paragraphs": [
                        "The data that support the findings of this study are available from the corresponding author on reasonable request."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Electronic Supplementary Material",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "",
                    "paragraphs": [
                        ""
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}