{
    "id": "US20120122819",
    "authors": [
        "Jérôme Mulhbacher",
        "Daniel Lafontaine",
        "François Malouin",
        "Marianne Allard",
        "Eric Marsault"
    ],
    "title": "GUANINE RIBOSWITCH BINDING COMPOUNDS AND THEIR USE AS ANTIBIOTICS",
    "date": "2010-06-14 00:00:00",
    "abstract": "The present invention includes novel compounds and pharmaceutically acceptable formulations of said compounds which exhibit antibiotic activity against microorganisms bearing a guanine riboswitch that controls the expression of the guaA gene, including organisms which are resistant to certain antibiotic families, and which are useful as antibacterial agents for treatment or prophylaxis of bacterial infections in animals or in humans, in particular but not limited to infections of the mammary gland, or their use as antiseptics, agents for sterilization or disinfection.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to novel antimicrobial compounds. More specifically, the present invention is concerned with novel antimicrobial compounds which bind to a guanine riboswitch and inhibit the expression of the microbial gene guaA, methods of manufacturing same, disinfection, sterilization or antisepsis methods using same, and methods of treating or preventing microbial infections involving the administration of same."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define novel antimicrobial compounds"
                    ],
                    "num_characters": 432,
                    "outline_medium": [
                        "define novel antimicrobial compounds"
                    ],
                    "outline_short": [
                        "define novel antimicrobial compounds"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Bovine mastitis is the most frequently occurring and costly disease affecting dairy producers. The transmittable bacterium Staphylococcus aureus is the most common cause of bovine mastitis and current antibiotic therapies usually fail to eliminate the infection from dairy herds (Sears, P. M. and K. K. McCarthy, 2003).",
                        "Multiple drug resistance (MDR), partly due to the excessive and improper use of antibiotics both in human medicine and food animal production, is a growing problem that has come to the forefront particularly in the last decade. A major cause of this widespread multi-drug resistance is the fact that recent drug design has been largely based on a limited number of new chemical scaffolds, allowing pathogens to adapt and circumvent common antibiotic action mechanisms (Blount and Breaker, 2006). Staphylococcus aureus and Clostridium difficile, which are particularly prone to developing antibiotic resistance, are nosocomial pathogens of major importance responsible for a significant mortality rate in hospitals and increased health care costs (Talbot et al, 2006). Alternative antibacterial drugs targeting RNA, mainly based on a fortuitous interaction between an exogenous ligand and its RNA target, have recently been developed and may help alleviate the problem of MDR (Knowles et al, 2002). However, there remains a great need for the identification of novel antimicrobial targets and compounds.",
                        "Bacterial riboswitches as a mechanism for regulating gene expression are known in the art. Riboswitches are segments of the 5′-untranslated region of certain mRNA molecules that, upon recognition of specific ligands, modify the expression of one or more proteins encoded in the message. Ligand-binding results in structural changes in the riboswitch that affect the ability of the mRNA molecule to be properly transcribed or translated. Thus riboswitches can function as RNA sensors, allowing control of gene expression at the mRNA level. The best-characterized riboswitches contain an aptamer region that is involved in ligand binding and an expression platform that is responsible for bringing about changes in gene expression (Coppins et al., 2007).",
                        "The scientific literature suggests that all bacterial riboswitches indiscriminately represent molecular antimicrobial targets. However, in order to develop novel specific antimicrobial therapies that will avoid contributing to widespread MDR, it would be highly desirable to identify riboswitches that are therapeutically selective, i.e., riboswitches that do not represent antimicrobial targets in all microbial species or commensal microorganisms that bear similar switches but on the contrary, riboswitches that have specific properties that only appear in the targeted pathogens.",
                        "Guanine riboswitches represent a subclass of riboswitches that are known in the art (Barrick and Breaker, 2007; Batey et al, 2004; Mulhbacher and Lafontaine, 2007). Application WO 2006/55351 teaches that the guanine riboswitch, in the presence of the guanine ligand, inhibits the expression of the genes xpt and pbuX in the non-pathogenic bacteria Bacillus subtilis. Some of the guanine analogs proposed in application WO 2006/55351 as potential therapeutic agents were reported to have non-specific antibacterial activities in vitro against a broad selection of pathogenic and non-pathogenic bacteria including the non-pathogenic Bacillus subtilis. Furthermore, later studies from the same investigators reported that these two genes (xpt and pbuX), assumed to be controlled by the guanine riboswitch, were expected to be non essential for the survival or virulence of Staphylococcus aureus (Blount and Breaker, 2006). It is well known in the field that genes (and their products) that are essential for the survival or virulence of a microbial pathogen represent ideal targets to obtain quick microbial killing, while avoiding the development of microbial resistance arising from mutations inactivating non-essential anti-microbial targets. The teachings of WO 2006/55351 and of Blount and Breaker (2006) thus suggested that the guanine riboswitch was not a desirable target for selective antibacterial intervention against the pathogen S. aureus in vivo.",
                        "Hence in this field of research and therapeutic applications, it would be highly desirable to identify microbial pathogens having essential survival or virulence gene(s) under control of a riboswitch. It would also be highly desirable to identify antimicrobial compounds that specifically bind to these riboswitches and selectively inhibit the expression of the gene(s) essential for the survival or virulence of specific pathogens in vivo. Such compounds would allow selective treatment of pathogens affecting animals and humans. It would also be highly desirable to identify compounds that are sufficiently distinct from the natural riboswitch ligand to avoid transformation of the compound by the host or microbial flora (for example by ribosylation) and to prevent potential broad and non-specific bacterial growth inhibition or toxicity to the mammalian host.",
                        "The present invention seeks to meet these and other needs.",
                        "The present description refers to a number of documents, the content of which is herein incorporated by reference in their entirety."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce bovine mastitis",
                        "describe current antibiotic therapies",
                        "discuss multiple drug resistance",
                        "motivate alternative antibacterial drugs",
                        "describe bacterial riboswitches",
                        "discuss limitations of current riboswitches",
                        "introduce guanine riboswitches",
                        "describe prior art on guanine riboswitches",
                        "discuss limitations of prior art",
                        "motivate need for novel antimicrobial targets"
                    ],
                    "num_characters": 5281,
                    "outline_medium": [
                        "motivate bovine mastitis problem",
                        "discuss multiple drug resistance issue",
                        "introduce RNA-based antibacterial drugs",
                        "describe bacterial riboswitches",
                        "discuss limitations of prior art"
                    ],
                    "outline_short": [
                        "motivate need for novel antimicrobial compounds",
                        "summarize limitations of current antimicrobial therapies"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention discloses that expression of the gene guaA (Tiedeman et al, 1985)encoding GMP synthetase (glutamine aminotransferase), which catalyses the synthesis of GMP (guanosine-5′-monophosphate) is under the control of a guanine riboswitch and is needed for survival or virulence in some relevant environments (e.g., during infection of a mammalian host) for specific pathogens. The present invention also presents antibiotic-like compounds with antimicrobial activity against such pathogens. Furthermore, such compounds cannot be modified by ribosylation to prevent incorporation into cellular nucleosides, nucleotides or nucleic acids, and thus prevent broad, non-specific toxicity for bacterial species not targeted by the compound and for the mammalian or animal host in which the present compounds are used for therapeutic intervention.",
                        "More specifically, in accordance with an aspect of the present invention, there is provided a compound of the general formula 1.0,",
                        "wherein, when said compound is bound to a guanine riboswitch, R3 may serve as a hydrogen bond acceptor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, —CH— or —O—; wherein R6 is a carbon atom; wherein R1, R2, R4 or R5 are identical or different and are independently —NR8-, —CHR8-, ═CR8-, —C(═O)— or 'C(═NR8)-; wherein R8 is —H, —NH2, —OH, —SH, a halide, fluorine, chlorine, bromine, iodine, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—NH2, —NH—SO2—R9, —NHCO2CH2—R9, —NH—OR9, —NH2—R9, —NH—NH—R9, —NHR9, —NH—CH2—R9, or —NH—NH'CH2—R9, wherein R9 is:",
                        "wherein n is an integer from 1 to 5; wherein R10 is —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine or iodine; wherein, R7 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR8, ═NR9, —NHCO2CH2—R9, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R9, —NH—OR9, —NH—R9, —NH—NH—R9, —NH—NH—CH2—R9, or —NH—CH2—R9, wherein R8 and R9 are as defined above, with the proviso that the compound is not: 4-hydroxy-2,5,6-triaminopyrimidine (1.01); 2,4-diamino-6-hydroxypyrimidine (1.13); or 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (1.16).",
                        "It is well understood by those skilled in the art that heterocyclic compounds such as the compounds of the present invention can exist under different tautomeric forms, each tautomeric form being described using a specific formula and a specific name. Herein, the use of the name of one tautomeric form of a compound is meant to refer to and encompass all other tautomeric forms of the same compound. For example, as used herein, the terms “4-hydroxy-2,5,6-triaminopyrimidine” and “formula 1.01” are meant to refer to both “4-hydroxy-2,5,6-triaminopyrimidine” and “2,5,6-triaminopyrimidine-4-one”.",
                        "As used herein, the terms “4,5-diamino-6-hydroxy-2-mercaptopyrimidine” or “formula 1.16” are meant to refer to both “4,5-diamino-6-hydroxy-2-mercaptopyrimidine” and “5,6-diamino-2-mercaptopyrimidine-4-one”.",
                        "As used herein, the terms “2,4-diamino-6-hydroxypyrimidine” or “formula 1.13” are meant to refer to both “2,4-diamino-6-hydroxypyrimidine” and “2,6-diaminopyrimidine-4-one”.",
                        "As used herein, the terms “9-oxoguanine” or “formula 2.02” are meant to refer to both “9-oxoguanine” and “5-Amino-6H-oxazolo[5,4-d]pyrimidin-7-one”.",
                        "In a specific embodiment of the composition of the general formula 1.0, (i) R1 is —NH—; (ii) R2 is —C(NH2)═ or ═C(SH)—; (iii) R3 is —N═; (iv) R4 is ═CNH2—; R5 is —CH═ or 'C(NH2)═; R6 is —C═; R7 is ═ NH or ═O; or any combination of (i) to (vii).",
                        "In accordance with another aspect of the present invention, there is provided a compound of the general formula 2.0,",
                        "wherein, when said compound is bound to a guanine riboswitch, R9 may serve as a hydrogen bond donor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, or —O—; wherein R1 or R2 are identical or different and are independently —NR11-, —CHR11-, ═CR11-, —C(═O)— or —C(═NR11)-; wherein R11 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)N H2, —NH—NH2, —NH—SO2—R12, —NHCO2CH2—R12, —NH—OR12, —NH2—R12, —NH—NH—R12, —NHR12, —NH—CH2—R12, or —NH—NH—CH2—R12;",
                        "wherein R12 is:",
                        "wherein n is in integer from 1 to 5; wherein R13 is at least one of —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, iodine; wherein R4, R5 and R6 are carbon atoms; wherein R7 is —═N—, —NH—, —CH2—; —O— or —S—; wherein R8 is —CH2, —O—, —S—, —CHR13- or —CR13=, wherein R13 is as defined above; wherein R9 is —CH2—; —O—, —S—, or —P(OOH)—, —N═; wherein R10 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CH2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, - NHC(O)alkyl, —NHCO2alkyl, ═NR11, =NR12, —NHCO2CH2—R12, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R12, —NH—R12, —NH—R12, —NH—NH—R12, —NH—NH—CH2—R12, or —NH—CH2—R12; wherein R11 and R12 are as defined above, with the proviso that the compound is not: guanine, hypoxanthine, xanthine or 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In accordance with another aspect of the present invention, there is provided a compound of the general formula 3.0,",
                        "wherein, when the compound is bound to a guanine riboswitch, R10 may serve as a hydrogen bond donor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, or —O—; wherein R10 is —N═, —CH2—; —O—, —S—, or —P(OOH)—; wherein R1, R2 and R9are identical or different and are independently —NR12-, —CHR12-, ═OR12-, —O(═O)— or—O(═NR12)—; wherein R12 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—NH2, —NH—SO2—R13,—NHCO2CH2—R13, —NH—OR13, —N+H2-R13, —NH—NH—R13, —NHR13, —NH—CH2—R13, or —NH—NH—CH2—R13;",
                        "wherein R13 is:",
                        "wherein n is an integer from 1 to 5; wherein R14 is —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, or iodine; wherein R4, R5 and R6 are carbon atoms; wherein R7 and R8 are identical or different and are independently —CH═N—, —CH2—O—, CH2—S—, or CH2SO2—; wherein R11 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, 'C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR12, ═NR13, —NHCO2CH2—R13, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R13, —NH—OR13, —NH—R13, —NH—NH—R13, —NH—NH—CH2—R13, or —NH—CH2—R13; and wherein R12 and R13 are as defined above.",
                        "In accordance with an aspect of the present invention, there is provided a compound of the general formula (2.0a),",
                        "wherein R2, R7, R8, R9 and R10 are as defined for formula 2.0 above.",
                        "In a specific embodiment of the compound of the present invention, there is provided a compound of the general formula (2.0), wherein: (i) R1 is —NH—; (ii) R2 is ═CNH2—; (iii) R3 is —N═; (iv) R7 is —N═ or —S—; (v) R8 is —CR13=; (vi) R9 is —O— or —N═; (vii) R10 is ═O or ═NH; or (viii) any combination of (i) to (vii).",
                        "In another specific embodiment of the compound of formula 2.0a of the present invention, R2 is ═CNH2, in another specific embodiment, R7 is —N═ or —S—, in another specific embodiment, R8 is —CR13=, in another specific embodiment, R9 is —O— or —N═, in another specific embodiment, R10 is ═O or ═NH.",
                        "In accordance with an aspect of the present invention, there is provided a compound of the general formula 3.0a,",
                        "wherein, R2, R7, R10 and R11 are as defined as defined for formula 3.0 above.",
                        "In accordance with another aspect of the present invention, there is provided a compound of the general formula 1.0a,",
                        "wherein R2 and R7 are as defined for formula 1.0 above and wherein R5 is —CH═ or —C(NH2)═ while R4 is —C(NH2)═.",
                        "In a specific embodiment of the compound of the general formula 1.0a, R7 is ═O or ═NH. In a specific embodiment of the compound of the general formula 1.0a, R2 is —C(NH2)═ or —C(SH)═.",
                        "In accordance with another aspect of the present invention, there is provided the compound defined above, for (a) preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (b) the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (c) treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a composition comprising a compound of the general formula 1.0,",
                        "wherein, when said compound is bound to a guanine riboswitch, R3 may serve as a hydrogen bond acceptor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, —CH— or —O—; wherein R6 is a carbon atom; wherein R1, R2, R4 or R5 are identical or different and are independently —NR8-, —CHR8-, ═CR8-, —O(═O)— or —C(═NR8)-; wherein R8 is —H, —NH2, —OH, —SH, a halide, fluorine, chlorine, bromine, iodine, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—NH2, —NH—SO2—R9, —NHCO2CH2—R9, —NH—OR9, —NH2—R9, —NH—NH—R9, —NHR9, —NH—CH2—R9, or —NH—NH—CH2—R9, wherein R9 is:",
                        "wherein n is an integer from 1 to 5; wherein R10 is -H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine or iodine; wherein, R7 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR8, ═NR9, —NHCO2CH2—R9, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R9, —NH—OR9, —NH—R9, —NH—NH—R9, —NH—NH—CH2—R9, or —NH—CH2—R9, wherein R8 and R9 are as defined above, and (a) an antibiotic; (b) an antiseptic; (c) a disinfectant; (d) a diluent; (e) an excipient; (f) a pharmaceutically acceptable carrier; or any combination of (a)-(f).",
                        "In accordance with another aspect of the present invention, there is provided a composition comprising a compound of the general formula 2.0,",
                        "wherein, when said compound is bound to a guanine riboswitch, R9 may serve as a hydrogen bond donor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, or —O—; wherein R1 or R2 are identical or different and are independently —NR11-, —CHR11-, ═CR11-, —O(═O)— or —C(═NR11)-; wherein R11 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)N H2, —NH—NH2, —NH—SO2—R12, —NHCO2CH2—R12, —NH—OR12, —NH2—R12, —NH—NH—R12, —NHR12, —NH—CH2—R12, or —NH—NH—CH2—R12;",
                        "wherein R12 is:",
                        "wherein n is in integer from 1 to 5; wherein R13 is at least one of —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, iodine; wherein R4, R5 and R6 are carbon atoms; wherein R7 is —═N—, —NH—, —CH2—; —O— or —S—; wherein R8 is —CH2, —O—, —S—, —CHR13- or—OR13=, wherein R13 is as defined above; wherein R9 is —CH2—; —O—, —S—, or —P(OOH)—, —N═; wherein R10 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR11, ═NR12, —NHCO2CH2—R12, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R12, —NH—R12, —NH—R12, —NH—NH—R12, —NH—NH—CH2—R12, or —NH—CH2—R12; wherein R11 and R12 are as defined above, and an (a) antibiotic; (b) an antiseptic; (c) a disinfectant; (d) a diluent; (e) an excipient; (f) a pharmaceutically acceptable carrier; or any combination of (a)- (f).",
                        "In accordance with another aspect of the present invention, there is provided a composition comprising a compound of the general formula 3.0,",
                        "wherein, when the compound is bound to a guanine riboswitch, R10 may serve as a hydrogen bond donor but cannot be ribosylated; whereinrepresents a single or double bond; wherein R3 is —N═, —S—, or —O—; wherein R10 is —N═, —CH2—; —O—, —S—, or —P(OOH)—; wherein R1, R2 and R9are identical or different and are independently —NR12-, —CHR12-, ═CR12-, —C(═O)— or —O(═NR12)-;",
                        "wherein R12 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)N H2, —NH—NH2, —NH—SO2—R13,—NHCO2CH2—R13, —NH—OR13, —N+H2-R13, —NH—NH—R13, —NHR13, —NH—CH2—R13, or —NH—NH—CH2—R13;",
                        "wherein R13 is:",
                        "wherein n is an integer from 1 to 5; wherein R14 is —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, or iodine; wherein R4, R5 and R6 are carbon atoms; wherein R7 and R8 are identical or different and are independently —CH═N—, —CH2—O—, CH2—S—, or CH2SO2—; wherein R11 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halideo, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR12, ═NR13, —NHCO2CH2—R13, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R13, —NH—OR13, —NH—R13, —NH—NH—R13, —NH—NH—CH2—R13, or —NH—CH2—R13; and wherein R12 and R13 are as defined above, and (a) an antibiotic; (b) an antiseptic; (c) a disinfectant; (d) a diluent; (e) an excipient; (f) a pharmaceutically acceptable carrier; or any combination of (a)-(f).",
                        "In a specific embodiment of the composition of the present invention, the compound is of the general formula,",
                        "In another specific embodiment of the composition of the present invention, the compound is of the general formula,",
                        "In another specific embodiment of the composition of the present invention, the compound is of the general formula,",
                        "wherein R5 and R4 are independently —CH═ or —C(NH2)═.",
                        "In accordance with another aspect of the present invention, there is provided a composition comprising (i) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (ii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iii) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (iv) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); and (a) an antibiotic; (b) an antiseptic; (c) a disinfectant; (d) a pharmaceutically acceptable carrier; or (e) any combination of (a)-(d).",
                        "In accordance with another aspect of the present invention, the composition defined above is for (a) preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (b) the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (c) treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In another specific embodiment, said composition is a pharmaceutical composition.",
                        "In accordance with another aspect of the present invention there is provided a method of preventing or treating a microbial infection in a subject, said method comprising administering to said subject a therapeutically effective amount of a non ribosylable ligand of a guanine riboswitch, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a method of preventing or treating a microbial infection in a subject, said method comprising administering to said subject a therapeutically effective amount of the compound defined above or of the above-mentioned composition, wherein said microbial infection is caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the method, said non ribosylable ligand of a guanine riboswitch is (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In a specific embodiment of the method of the present invention, said subject is an animal (e.g., cattle such as cow; goat, ewe, ass, horse, pig; cat; dog; etc.). n another specific embodiment, said subject is a cow. In another specific embodiment, said subject is a human. In another specific embodiment, said pathogen is a bacteria belonging to the genus Staphylococcus or Clostridium. In another specific embodiment, said bacteria is Staphylococcus aureus, methicillin-resistant Staphylococcus aureus, Staphylococcus epidermidis, Staphylococcus haemolyticus, Clostridium botulinum or Clostridium difficile. In another specific embodiment, said infection is a mammary gland infection.",
                        "In accordance with another aspect of the present invention, there is provided a use of a therapeutically effective amount of a non ribosylable ligand of a guanine riboswitch, for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of a therapeutically effective amount of a non ribosylable ligand of a guanine riboswitch, for the manufacture of a medicament for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of the compound defined above or of the above-mentioned composition, for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of the compound defined above or of the above-mentioned composition, for the manufacture of a medicament for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
                        "In a specific embodiment of said uses, said non ribosylable ligand of a guanine riboswitch is (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In a specific embodiment of the use of the present invention, said subject is an animal (e.g., cattle such as cow; goat, ewe, ass, horse, pig; cat; dog; etc.). n another specific embodiment, said subject is a cow. In another specific embodiment said subject is a human. In another specific embodiment, said pathogen is a bacteria belonging to the genus Staphylococcus or Clostridium. In another specific embodiment, said bacteria is Staphylococcus aureus, methicillin-resistant Staphylococcus aureus, Staphylococcus epidermidis, Staphylococcus haemolyticus, Clostridium botulinum or Clostridium difficile. In another specific embodiment, said infection is a mammary gland infection.",
                        "In accordance with another aspect of the present invention, there is provided a method of disinfecting and/or sterilizing an object of a pathogen, said method comprising applying an effective amount of a non ribosylable ligand of a guanine riboswitch to said object, wherein said pathogen bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a method of disinfecting and/or sterilizing an object of a pathogen, said method comprising applying an effective amount of the compound defined above or of the above-mentioned composition to said object, wherein said pathogen bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the method of the present invention, said non ribosylable ligand of a guanine riboswitch is (i) the compound of defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In a specific embodiment of the methods, said object is an animal or milk.",
                        "In accordance with another aspect of the present invention, there is provided a use of an effective amount of a non ribosylable ligand of a guanine riboswitch for the disinfection, sterilization and/or antisepsis of an object from a pathogen, said pathogen bearing a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of the compound defined above or of the above-mentioned composition for the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the use, said non ribosylable ligand of a guanine riboswitch is (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine(formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In a specific embodiment of the uses, said object is an animal or milk.",
                        "In accordance with another aspect of the present invention, there is provided a method of selecting a pathogen treatable by a non ribosylable ligand of a guanine riboswitch, or the compound defined above, or the above-mentioned composition, said method comprising determining whether said pathogen bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the method, the method is method of selecting a pathogen treatable by (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); or (vi) the above-mentioned composition, said method comprising determining whether said pathogen bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a method of identifying a compound for treating or preventing a microbial infection caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA, said method comprising contacting said pathogen with a candidate compound and determining the effect of said compound of the growth or survival of said pathogen, wherein a decrease in the growth or survival of said pathogen in the presence as compared to in the absence of said candidate compound is an indication that said compound is suitable for treating or preventing said microbial infection.",
                        "In accordance with another aspect of the present invention, there is provided a method of identifying a compound for preventing or treating a microbial infection caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA, said method comprising contacting a guanine riboswitch with said compound; determining whether said compound binds to said guanine riboswitch; wherein the binding of said compound to said guanine riboswitch is an indication that said compound is suitable for treating said microbial infection.",
                        "In a specific embodiment of the method, said guanine riboswitch is the guanine xpt riboswitch from Streptococcus pyogenes (STPY-xpt). In another specific embodiment, the method further comprises contacting said guanine riboswitch with guanine or a guanine-like ligand. In another specific embodiment, the method further comprises determining whether said compound may be ribosylated.",
                        "In accordance with another aspect of the present invention, there is provided a method for preventing the development of multi-drug resistance of a bacteria in a subject, said method comprising administering a non ribosylable ligand of a guanine riboswitch to the subject, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a method for preventing the development of multi-drug resistance of a bacteria in a subject, or treating a multidrug resistance of a bacteria in the subject said method comprising administering a non ribosylable ligand of a guanine riboswitch to the subject, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the method, said non ribosylable ligand of a guanine riboswitch is: (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In accordance with another aspect of the present invention, there is provided a use of a non ribosylable ligand of a guanine riboswitch for treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of a non ribosylable ligand of a guanine riboswitch for the manufacture of a medicament for treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In accordance with another aspect of the present invention, there is provided a use of the compound defined above or the above-mentioned composition for treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the uses, said non ribosylable ligand of a guanine riboswitch is: (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
                        "In accordance with another aspect of the present invention there is provided a non ribosylable ligand of a guanine riboswitch (a) for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA; or (b) for the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (c) for treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of said ligand for the disinfection, sterilization and/or antisepsis of an object, said object is an animal or milk.",
                        "In accordance with another aspect of the present invention, there is provided (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17), for (a) preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (b) the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (c) treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of said composition for the disinfection, sterilization and/or antisepsis of an object, said object is an animal or milk.",
                        "In accordance with another aspect of the present invention, there is provided a composition comprising (i) the compound defined in any one of claims 1 to 15; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); and (a) an antibiotic; (b) an antiseptic; (c) a disinfectant; (d) a diluent; (e) an excipient; (f) a pharmaceutically acceptable carrier; or (g) any combination of (a)-(f), said composition being: (aa) for preventing or treating a microbial infection in a subject, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA; or (bb) for the disinfection, sterilization and/or antisepsis of an object from a pathogen bearing a guanine riboswitch that controls the expression of guaA; or (cc) for treating a multi-drug resistant bacteria or preventing the development of a multi-drug resistant bacteria, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
                        "In a specific embodiment of the ligands, compounds and compositions for uses described above, said subject is an animal (e.g., cattle such as cow; goat, ewe, ass, horse, pig; cat; dog; etc.). In another specific embodiment, said subject is a cow. In another specific embodiment, said subject is a human. In another specific embodiment, said pathogen is a bacteria belonging to the genus Staphylococcus or Clostridium. In another specific embodiment, said bacteria is Staphylococcus aureus, methicillin-resistant Staphylococcus aureus, Staphylococcus epidermidis, Staphylococcus haemolyticus, Clostridium botulinum or Clostridium difficile. In another specific embodiment, said infection is a mammary gland infection.",
                        "In accordance with another aspect of the present invention, there is provided a kit comprising the compound defined above or the above-mentioned composition, and instructions to use same in the prevention or treatment of a microbial infection.",
                        "In a specific embodiment of the kit, the kit comprises: (i) the compound defined above; (ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01); (iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16); (iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); (v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); or (vi) the composition defined above, and instructions to use same in the prevention or treatment of a microbial infection.",
                        "In accordance with another aspect of the present invention, there is provided a method for preparing the compound of formula 2.02",
                        "said method comprising (a) reacting diethylacetamido malonate with guanidine hydrochloride in the presence of sodium methoxide and methanol to obtain a solid; (b) dissolving the solid of (a) in an aqueous solution; (c) subjecting the solution of (b) to an acidic precipitation to obtain a 5-formamino-2-amino-4,6-dihydroxypyrimidine precipitate; (d) dissolving the 5-formamino-2-amino-4,6-dihydroxypyrimidine precipitate in an acid; and (e) precipitating the solution of (d) to obtain the compound of formula 2.02.",
                        "In a specific embodiment of the method, said reacting is performed under reflux. In another specific embodiment, said acidic precipitation of (b) is performed using a hydrochloric acid (HCl) solution. In another specific embodiment, said HCl solution is a 50% HCl solution. In another specific embodiment, dissolving of (d) is performed using sulfuric acid. In another specific embodiment, said sulfuric acid is 12 M sulfuric acid. In another specific embodiment, the method further comprises washing said solid of (a) with methanol and chloroform. In another specific embodiment, said aqueous solution is water. In another specific embodiment, said precipitating of (e) is performed using tetrahydrofuran (THF).",
                        "Other objects, advantages and features of the present invention will become more apparent upon reading of the following non-restrictive description of specific embodiments thereof, given by way of example only with reference to the accompanying drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce guaA gene and GMP synthetase",
                        "describe role of guanine riboswitch in gene expression",
                        "present antibiotic-like compounds with antimicrobial activity",
                        "define general formula 1.0 for compounds",
                        "specify R1 to R10 substituents for general formula 1.0",
                        "provide examples of tautomeric forms of compounds",
                        "define specific embodiment of general formula 1.0",
                        "introduce general formula 2.0 for compounds",
                        "specify R1 to R12 substituents for general formula 2.0",
                        "provide examples of tautomeric forms of compounds",
                        "define specific embodiment of general formula 2.0",
                        "introduce general formula 3.0 for compounds",
                        "specify R1 to R14 substituents for general formula 3.0",
                        "provide examples of tautomeric forms of compounds",
                        "define specific embodiment of general formula 3.0",
                        "introduce general formula 2.0a for compounds",
                        "specify R2, R7, R8, R9, and R10 substituents for general formula 2.0a",
                        "define specific embodiment of general formula 2.0a",
                        "define compound formula 1.0a",
                        "specify R7 and R2 embodiments",
                        "describe application of compound formula 1.0a",
                        "define compound formula 1.0",
                        "specify R3, R6, R1, R2, R4, R5, and R8",
                        "describe composition comprising compound formula 1.0",
                        "define compound formula 2.0",
                        "specify R9, R3, R1, R2, R11, and R12",
                        "describe composition comprising compound formula 2.0",
                        "define compound formula 3.0",
                        "specify R10, R3, R1, R2, R9, and R12",
                        "describe composition comprising compound formula 3.0",
                        "specify specific embodiments of compound formulas",
                        "describe composition comprising specific compounds",
                        "specify additional compounds",
                        "describe composition comprising additional compounds",
                        "define composition",
                        "specify uses of composition",
                        "describe method of preventing or treating microbial infection",
                        "specify pathogen and guanine riboswitch",
                        "describe pharmaceutical composition",
                        "specify non ribosylable ligand of guanine riboswitch",
                        "describe method of preventing or treating microbial infection",
                        "specify subject and pathogen",
                        "describe use of non ribosylable ligand",
                        "specify manufacture of medicament",
                        "describe use of composition",
                        "specify disinfection, sterilization, and/or antisepsis",
                        "describe method of disinfecting and/or sterilizing object",
                        "specify non ribosylable ligand of guanine riboswitch",
                        "describe use of non ribosylable ligand",
                        "specify object",
                        "describe method of selecting pathogen",
                        "specify non ribosylable ligand of guanine riboswitch",
                        "describe method of identifying compound",
                        "specify guanine riboswitch",
                        "describe method of identifying compound",
                        "specify binding of compound to guanine riboswitch",
                        "describe method of preventing development of multi-drug resistance",
                        "specify non ribosylable ligand of guanine riboswitch",
                        "describe use of non ribosylable ligand",
                        "specify manufacture of medicament",
                        "describe use of composition",
                        "specify non ribosylable ligand of guanine riboswitch",
                        "describe composition",
                        "specify object",
                        "describe non ribosylable ligand of guanine riboswitch",
                        "specify composition",
                        "describe composition",
                        "specify antibiotic, antiseptic, disinfectant, diluent, excipient, or pharmaceutically acceptable carrier",
                        "describe kit",
                        "specify instructions",
                        "describe method of preparing compound of formula 2.02"
                    ],
                    "num_characters": 36393,
                    "outline_medium": [
                        "introduce guaA gene and GMP synthetase",
                        "describe role of guanine riboswitch in controlling gene expression",
                        "present antibiotic-like compounds with antimicrobial activity",
                        "define general formula 1.0 for compounds",
                        "specify substituents for R1-R10 in general formula 1.0",
                        "provide specific embodiments of compounds of general formula 1.0",
                        "introduce general formula 2.0 for compounds",
                        "specify substituents for R1-R12 in general formula 2.0",
                        "provide specific embodiments of compounds of general formula 2.0",
                        "define compound formula 1.0a",
                        "specify embodiment of compound formula 1.0a",
                        "provide composition for preventing microbial infection",
                        "define compound formula 1.0",
                        "define compound formula 2.0",
                        "define compound formula 3.0",
                        "provide specific embodiments of composition",
                        "provide composition with specific compounds",
                        "define composition",
                        "specify uses of composition",
                        "describe method of preventing or treating microbial infection",
                        "describe method of disinfecting and/or sterilizing an object",
                        "describe use of non ribosylable ligand for disinfection, sterilization and/or antisepsis",
                        "describe method of selecting a pathogen treatable by non ribosylable ligand",
                        "describe method of identifying a compound for treating or preventing microbial infection",
                        "describe method of preventing the development of multi-drug resistance of a bacteria",
                        "describe use of non ribosylable ligand for treating a multi-drug resistant bacteria",
                        "describe use of compound defined above or above-mentioned composition for treating a multi-drug resistant bacteria",
                        "describe non ribosylable ligand for preventing or treating a microbial infection",
                        "describe composition comprising non ribosylable ligand and antibiotic, antiseptic, disinfectant, diluent, excipient, or pharmaceut",
                        "describe kit comprising compound defined above or above-mentioned composition and instructions",
                        "describe method for preparing compound of formula 2.02",
                        "describe specific embodiments of method for preparing compound of formula 2.02",
                        "describe specific embodiments of subject",
                        "describe specific embodiments of pathogen",
                        "describe specific embodiments of infection"
                    ],
                    "outline_short": [
                        "disclose guaA gene expression control",
                        "present antibiotic-like compounds with antimicrobial activity",
                        "describe compounds with specific structural formulas",
                        "provide specific embodiments of compounds",
                        "define compounds",
                        "describe applications",
                        "provide specific embodiments",
                        "list compositions",
                        "define composition for microbial infection treatment",
                        "describe methods of preventing or treating microbial infections",
                        "outline uses of non ribosylable ligand of guanine riboswitch",
                        "describe methods of disinfecting and/or sterilizing an object",
                        "outline uses of compound defined above or above-mentioned composition",
                        "describe method of selecting a pathogen treatable by non ribosylable ligand",
                        "describe method of identifying a compound for treating or preventing microbial infection",
                        "describe method for preventing the development of multi-drug resistance of a bacteria",
                        "describe composition and kit for preventing or treating microbial infections"
                    ]
                },
                {
                    "title": "DESCRIPTION OF ILLUSTRATIVE EMBODIMENTS",
                    "paragraphs": [
                        "The gene guaA is essential for the survival or virulence of various microbial pathogens and encodes the enzyme GMP synthetase, which catalyses the synthesis of GMP (guanosine-5′-monophosphate) (E.C. 6.3.5.2) from XMP (xanthosine 5′-monophosphate). The present invention showed that, in some microbial pathogens, expression of the essential gene guaA is under control of the guanine riboswitch. As shown in the accompanying examples, the guanine riboswitch in S. aureus was found herein to control the expression of four genes present on the same mRNA transcript: xpt, pbuX, guaB and guaA. A bioinformatic analysis revealed that such guanine riboswitches are found in pathogen microorganisms such as Staphylococcus aureus and Clostridium difficile but not in microorganisms such as Bacillus subtilis and Streptococci in which a guanine riboswitch does not control the expression of guaA. See Table 3 below for examples of microorganisms which contain or not a guanine riboswitch that controls the expression of guaA.",
                        "The present invention also relates to the unexpected discovery that some pathogen microorganisms, such as S. aureus, highly express guaA in specific environments during infection of an animal host such as a mammal. As shown in the accompanying examples, microarray and quantitative PCR gene expression analysis was performed on various S. aureus strains isolated from bovine intramammary infections. These studies reveal that guaA is highly expressed during infection in cows by prototypical S. aureus strains known to cause bovine mastitis as well as in strains known to cause persistent and chronic mastitis. Therefore, the present invention also relates to the surprising discovery that guanine riboswitches controlling the expression of the guaA gene are suitable targets for therapeutic antimicrobial intervention.",
                        "The present invention also relates to the surprising discovery that guanine-like compounds modified to be unable to undergo ribosylation, are nevertheless capable of binding to or interacting with riboswitch aptamers and can affect expression of genes that are under riboswitch control. As shown in the accompanying examples, binding and competition assays measuring the ability of various compounds to displace a known guanine riboswitch ligand showed that the compounds of the present invention are capable of binding to the guanine riboswitch. Microarray gene expression analysis confirmed that the compounds of the present invention can not only bind to guanine riboswitches but also modulate expression of genes under control of the guanine riboswitch. Furthermore, the specificity and mechanism of this modulation was validated by studies combining a compound of the present invention with the metabolite GMP.",
                        "The present invention also relates to the discovery that the compounds of the present invention can act as specific or selective antimicrobial agents to which microbial pathogens (that have the guaA gene under control of the guanine riboswitch) cannot develop resistance. The present invention also relates to the discovery that the compounds of the present invention have no substantial inhibitory activity against microorganisms in which the gene guaA is not controlled by a guanine riboswitch. As shown in the accompanying examples, the compounds of the present invention can demonstrate an anti-bacterial effect on S. aureus and C. difficile strains when grown in vitro (e.g., in culture media or milk) or in vivo (e.g., in mice mammary gland infections). The specificity of the compounds of the present invention was demonstrated by their failure to exert an antibacterial effect on strains (e.g., E. coli) lacking a guaA under control of the guanine riboswitch. The anti-bacterial effect of the compounds of the present invention were shown herein to be comparable to several well-known antibiotic compounds. Strikingly, unlike the well-known antibiotic compounds, ciprofloxacin and rifampicin, a S. aureus lstrain did not develop antibiotic resistance to a compound of the present invention. Therefore, it is also disclosed herein that the compounds of the present invention are able to inhibit the expression of the gene guaA, preventing rapid development of bacterial resistance in S. aureus.",
                        "The present invention also relates to compounds of the following general formulas:",
                        "Guanine",
                        "Formula 1.0:",
                        "Formula 1.01 (4-hydroxy-2,5,6-triaminopyrimidine here shown as the guanine riboswitch ligand 2,5,6-triaminopyrimidine-4-one):",
                        "Formula 1.13 (2,4-diamino-6-hydroxypyrimidine here shown as the guanine riboswitch ligand 2,6-diaminopyrimidine-4-one):",
                        "Formula 1.16 (4,5-diamino-6-hydroxy-2-mercaptopyrimidine here shown as the guanine riboswitch ligand 5,6-diamino-2-mercaptopyrimidine-4-one)",
                        "Formula 2.0:",
                        "Formula 2.02 (9-oxoguanine here shown as 5-Amino-6H-oxazolo[5,4-d]pyrimidin-7-one)",
                        "Formula 2.17 (5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one)",
                        "Formula 3.0:",
                        "The compounds of the present invention bind to the guanine riboswitch binding site and yet are chemically unable to be ribosylated by the targeted pathogens. This property prevents incorporation of the compounds into cellular nucleosides, nucleotides or nucleic acids, and thus prevents broad, non-specific toxicity for bacterial species not targeted by the compound and for the mammalian or animal host in which the present compounds are used for therapeutic intervention."
                    ],
                    "subsections": [
                        {
                            "title": "Definitions",
                            "paragraphs": [
                                "The use of the word “a” or “an” when used in conjunction with the term “comprising” in the claims and/or the specification may mean “one” but it is also consistent with the meaning of “one or more”, “at least one”, and “one or more than one”.",
                                "As used in this specification and claim(s), the words “comprising” (and any form of comprising, such as “comprise” and “comprises”), “having” (and any form of having, such as “have” and “has”), “including” (and any form of including, such as “includes” and “include”) or “containing” (and any form of containing, such as “contains” and “contain”) are inclusive or open-ended and do not exclude additional, un-recited elements or method steps.",
                                "As used herein, the terms “molecule”, “compound”, “agent” or “ligand” are used interchangeably and broadly to refer to natural, synthetic or semi-synthetic molecules or compounds. The term “compound” therefore denotes, for example, chemicals, macromolecules, cell or tissue extracts (from plants or animals) and the like. Non-limiting examples of compounds include peptides, antibodies, carbohydrates, nucleic acid molecules and pharmaceutical agents. The compound can be selected and screened by a variety of means including random screening, rational selection and by rational design using, for example, ligand modeling methods such as computer modeling. The terms “rationally selected” or “rationally designed” are meant to define compounds which have been chosen based on the configuration of interacting domains of the present invention (e.g., the guanine riboswitch). As will be understood by the person of ordinary skill, molecules having non-naturally occurring modifications are also within the scope of the term “compound”. For example, the compounds of the present invention can be modified to enhance their activity, stability, toxicity and/or bioavailability. The compounds or molecules identified in accordance with the teachings of the present invention have a therapeutic value in diseases or conditions related to microbial infections.",
                                "The term “subject” or “patient” as used herein refers to an animal, preferably a mammal such as but not limited cattle such as cow; goat; ewe; ass; horse; pig; cat; dog; etc. or human who is the object of treatment, observation or experiment.",
                                "As used herein, the terms “pharmaceutically acceptable” refer to molecular entities and compositions that are physiologically tolerable and do not typically produce an allergic or similar untoward reaction, such as gastric upset, dizziness and the like, when administered to animals (e.g., cows) or human. Preferably, as used herein, the term “pharmaceutically acceptable” means approved by regulatory agency of the federal or state government or listed in the U.S. Pharmacopeia or other generally recognized pharmacopeia for use in animals, and more particularly in humans.",
                                "The term “carrier” refers to a diluent, adjuvant, excipient, or vehicle with which the compounds of the present invention may be administered. Sterile water or aqueous saline solutions and aqueous dextrose and glycerol solutions may be employed as carriers, particularly for injectable solutions. Suitable pharmaceutical carriers are described in “Remington's Pharmaceutical Sciences” by E. W. Martin.",
                                "Compounds of the invention may be administered in a pharmaceutical composition. Pharmaceutical compositions may be administered in unit dosage form. Any appropriate route of administration may be employed, for example, parenteral, subcutaneous, intramuscular, intramammary, intracranial, intraorbital, ophthalmic, intraventricular, intracapsular, intraarticular, intraspinal, intracisternal, intraperitoneal, intranasal, aerosol, or oral administration. Examples of specific routes of administration include parenteral, e.g., intravenous, intradermal, subcutaneous, intramammary; oral (e.g., inhalation); transdermal (topical); transmucosal, and rectal administration.",
                                "Conventional pharmaceutical practice may be employed to provide suitable formulations or compositions to administer such compositions to patients. Methods well known in the art for making pharmaceutical compositions and formulations are found in, for example, Remington: The Science and Practice of Pharmacy, (20th ed.) ed. A. R. Gennaro A R., 2000, Lippincott: Philadelphia.",
                                "Therapeutic formulations for oral administration, may be in the form of tablets or capsules; ; for transmucosal (e.g., rectal, intranasal) or transdermal/percutaneous administration may be in the form of ointments, powders, nasal drops, sprays/aerosols or suppositories; for topical administration, may be in the form of ointments, creams, gels or solutions; for parenteral administration (e.g., intravenously, intramuscularly, intradermal, intramammary, subcutaneously, intrathecally or transdermally), using for example injectable solutions. Furthermore, administration can be carried out sublingually or as ophthalmological preparations or as an aerosol, for example in the form of a spray. Intravenous, intramuscular or oral administration is a preferred form of use."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define \"a\" and \"an\" in claims and specification",
                                "define \"comprising\" and related terms",
                                "define \"molecule\", \"compound\", \"agent\", and \"ligand\"",
                                "define \"rationally selected\" and \"rationally designed\"",
                                "define \"subject\" or \"patient\"",
                                "define \"pharmaceutically acceptable\"",
                                "define \"carrier\"",
                                "describe pharmaceutical compositions and formulations",
                                "describe routes of administration",
                                "describe therapeutic formulations"
                            ],
                            "num_characters": 5083,
                            "outline_medium": [
                                "define \"a\" and \"an\" in conjunction with \"comprising\"",
                                "define \"comprising\", \"having\", \"including\", and \"containing\"",
                                "define \"molecule\", \"compound\", \"agent\", and \"ligand\"",
                                "define \"subject\" or \"patient\"",
                                "define \"pharmaceutically acceptable\" and \"carrier\""
                            ],
                            "outline_short": [
                                "define terms used in specification and claims",
                                "explain meaning of \"comprising\", \"having\", \"including\", and \"containing\""
                            ]
                        },
                        {
                            "title": "Oral",
                            "paragraphs": [
                                "For the purpose of oral therapeutic administration, the active compound can be incorporated with excipients and used for example in the form of tablets, troches, dragees, hard or soft gelatin capsules, solutions (e.g., syrups), emulsions or suspensions, or capsules. For the preparation of formulations for oral administration, the compounds of the present invention may be admixed with pharmaceutically inert, inorganic or organic excipients (e.g., pharmaceutically compatible binding agents, and/or adjuvant). The tablets, pills, capsules, troches and the like can contain any of the following ingredients, or compounds of a similar nature: a binder such as microcrystalline cellulose, gum tragacanth or gelatin; an excipient such as starch or lactose, a disintegrating agent such as alginic acid, Primogel, or corn starch; a lubricant such as magnesium stearate or Sterotes; a glidant such as colloidal silicon dioxide; a sweetening agent such as sucrose or saccharin; or a flavoring agent such as peppermint, methyl salicylate, or orange flavoring. Examples of suitable excipients for tablets, dragees or hard gelatin capsules for example include lactose, maize starch or derivatives thereof, talc or stearic acid or salts thereof. Suitable excipients for use with soft gelatin capsules include for example vegetable oils, waxes, fats, semi-solid or liquid polyols etc.; according to the nature of the active ingredients it may however be the case that no excipient is needed at all for soft gelatin capsules.",
                                "For the preparation of solutions and syrups, excipients which may be used include for example water, polyols, saccharose, invert sugar and glucose."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe oral therapeutic administration",
                                "list excipients for tablets, dragees, and hard gelatin capsules",
                                "list excipients for solutions and syrups"
                            ],
                            "num_characters": 1662,
                            "outline_medium": [
                                "describe formulation options for oral administration"
                            ],
                            "outline_short": [
                                "describe formulations for oral administration"
                            ]
                        },
                        {
                            "title": "Nasal",
                            "paragraphs": [
                                "For administration by inhalation, the compounds may be delivered in the form of an aerosol spray from pressured container or dispenser which contains a suitable propellant, e.g., a gas such as carbon dioxide, or a nebulizer. Formulations for inhalation may contain excipients, or example, lactose, or may be aqueous solutions containing, for example, polyoxyethylene-9-lauryl ether, glycocholate and deoxycholate, or may be oily solutions for administration in the form of nasal drops, or as a gel."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe administration by inhalation"
                            ],
                            "num_characters": 498,
                            "outline_medium": [
                                "describe formulation options for nasal administration"
                            ],
                            "outline_short": [
                                "describe formulations for nasal administration"
                            ]
                        },
                        {
                            "title": "Transmucosal or Transdermal",
                            "paragraphs": [
                                "For transmucosal or transdermal administration, penetrants appropriate to the barrier to be permeated are used in the formulation. Such penetrants are generally known in the art, and include, for example, for transmucosal administration, detergents, bile salts, and fusidic acid derivatives. Transmucosal administration can be accomplished through the use of nasal sprays or suppositories. For transdermal administration, the active compounds are formulated into ointments, salves, gels, or creams as generally known in the art. For suppositories, and local or percutaneous application, excipients which may be used include for example natural or hardened oils, waxes, fats and semi-solid or liquid polyols."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe transmucosal or transdermal administration"
                            ],
                            "num_characters": 707,
                            "outline_medium": [
                                "describe formulation options for transmucosal or transdermal administration"
                            ],
                            "outline_short": [
                                "describe formulations for transmucosal or transdermal administration"
                            ]
                        },
                        {
                            "title": "Parenteral",
                            "paragraphs": [
                                "Pharmaceutical compositions suitable for injectable use include sterile aqueous solutions (where water soluble) or dispersions and sterile powders for the extemporaneous preparation of sterile injectable solutions or dispersion. Solutions or suspensions used for parenteral application can include the following components: a sterile diluent such as water for injection (where water soluble), saline solution, fixed oils (e.g., paraffin oil), polyalkylene glycols such as polyethylene glycols, glycerine, propylene glycol or other synthetic solvents, oils of vegetable origin, or hydrogenated napthalenes; antibacterial agents such as benzyl alcohol or methyl parabens; antioxidants such as ascorbic acid or sodium bisulfite; chelating agents such as ethylenediaminetetraacetic acid; reducing agents such as dithiothreitol, buffers such as acetates, citrates or phosphates and agents for the adjustment of tonicity such as sodium chloride or dextrose. The pH can be adjusted with acids or bases, such as hydrochloric acid or sodium hydroxide. Biocompatible, biodegradable lactide polymer, lactide/glycolide copolymer, or polyoxyethylene-polyoxypropylene copolymers may be used to control the release of the compounds. Other potentially useful parenteral delivery systems for compounds of the invention include ethylenevinyl acetate copolymer particles, osmotic pumps, implantable infusion systems, and liposomes. The parenteral preparation can also be enclosed in ampoules, disposable syringes or multiple dose vials made of glass or plastic.",
                                "For intravenous or intramammary administration, suitable carriers include physiological saline, bacteriostatic water, Cremophor EL™ (BASF, Parsippany, N.J.) or phosphate buffered saline (PBS).",
                                "Liposomal suspensions (including liposomes targeted to specific cell types) can also be used as pharmaceutically acceptable carriers. A variety of liposomal formulations suitable for delivering a compound to an animal have been described and demonstrated to be effective in delivering a variety of compound, including, e.g., small molecules, nucleic acids, and polypeptides.",
                                "As mentioned earlier, medicaments containing the compounds of the present invention are also an object of the present invention, as is a process for the manufacture of such medicaments, which process comprises bringing one or more of the compounds of the present invention to, if desired, one or more other therapeutically valuable substances into a galenical administration form."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe injectable use",
                                "list components for parenteral application",
                                "describe biocompatible, biodegradable polymers",
                                "describe liposomal suspensions"
                            ],
                            "num_characters": 2494,
                            "outline_medium": [
                                "describe formulation options for parenteral administration",
                                "discuss liposomal suspensions as pharmaceutically acceptable carriers"
                            ],
                            "outline_short": [
                                "describe formulations for parenteral administration"
                            ]
                        },
                        {
                            "title": "Salts, Esters, Hydrates and Solvates",
                            "paragraphs": [
                                "The compounds of the present invention include pharmacologically acceptable salts and ester derivatives thereof as well as hydrates or solvates thereof and all stereoisomeric forms of the referenced compounds. The compounds and pharmacologically acceptable esters thereof of the present invention can form pharmacologically acceptable salts if necessary.",
                                "**Salts**",
                                "The terms “pharmacologically acceptable salt thereof” refer to a salt to which the compounds of the present invention can be converted. Preferred examples of such a salt include alkali metal salts such as a sodium salt, a potassium salt, a lithium salt, magnesium or calcium salts; alkaline earth metal salts such as a calcium salt and a magnesium salt; metal salts such as an aluminium salt, an iron salt, a zinc salt, a copper salt, a nickel salt and a cobalt salt; amine salts such as inorganic salts including an ammonium salt; organic salts or ammonium saltssuch as a t-octylamine salt, a dibenzylamine salt, a morpholine salt, a glucosamine salt, a phenylglycine alkyl ester salt, an ethylenediamine salt, an N-methylglucamine salt, a guanidine salt, a diethylamine salt, a triethylamine salt, a dicyclohexylamine salt, an N,N′-dibenzylethylenediamine salt, a chloroprocaine salt, a procaine salt, a diethanolamine salt, an N-benzyl-phenethylamine salt, a piperazine salt, a tetramethylammonium salt and a tris(hydroxymethyl)aminomethane salt; inorganic acid salts such as hydrohalic acid salts such as a hydrofluoride, a hydrochloride, a hydrobromide or a hydroiodide, a nitrate, a perchlorate, a sulfate or a phosphate; lower alkanesulfonates such as a methanesulfonate, trifluoromethanesulfonate or an ethanesulfonate; arylsulfonates such as a benzenesulfonate or a p-toluenesulfonate and the like, which are non toxic to living organisms; organic acid salts such as an acetate, a malate, adipate, a fumarate, a succinate, a citrate, alginate, ascorbate, benzoate, benzenesulfonate, bisulfate, butyrate, camphorate, camphorsulfonate, cinnamate, cyclopentanepropionate, digluconate, dodecylsulfate, ethanesulfonate, glucoheptanoate, glycerophosphate, hemisulfate, heptanoate, hexanoate, hydrochloride, hydrobromide, hydroiodide, 2- hydroxyethanesulfonate, itaconate, lactate, maleate, mandelate, sulfonate, methanesulfonate, trifluoromethanesulfonates, ethanesulfonates 2-naphthalenesulfonate, nicotinate, nitrate, oxalate, pamoate, pectinate, persulfate, 3-phenylpropionate, picrate, pivalate, propionate, tartrate, thiocyanate, tosylate, and undecanoate, a tartrate, an oxalate or a maleate; and amino acid salts such as a glycine salt, a lysine salt, an arginine salt, an omithine salt, histidine, a glutamate or an aspartate salt. Additionally, basic nitrogen containing groups may be quaternized with such agents as lower alkyl halides such as methyl, ethyl, propyl, and butyl chlorides, bromides and iodides; dialkyl sulfates including dimethyl, diethyl, and dibutyl sulfate; and diamyl sulfates, long chain halides such as decyl, lauryl, myristyl and strearyl chlorides, bromides and iodides, aralkyl halides including benzyl and phenethyl bromides, and others. For further example, see S. M. Berge, et al. “Pharmaceutical Salts,” J. Pharm. Sci. 1977, 66, 1-19. Such salts can be formed quite readily by those skilled in the art using standard techniques.",
                                "Preferred example of the salts formed with an acidic group present in the compounds of the present invention include metal salts such as alkali metal salts (e.g., sodium salts, potassium salts and lithium salts), alkali earth metal salts (e.g., calcium salts and magnesium salts), aluminum salts and iron salts; amine salts such as inorganic amine salts (e.g., ammonium salts) and organic amine salts (e.g., t-octylamine salts, dibenzylamine salts, morpholine salts, glucosamine salts, phenylglycinealkyl ester salts, ethylenediamine salts, N-methylglucamine salts, guanidine salts, diethylamine salts, triethylamine salts, dicyclohexylamine salts, N,N′-dibenzylethylenediamine salts, chloroprocaine salts, procaine salts, diethanolamine salts. N-benzylphenethylamine salts, piperazine salts, tetramethylammonium salts and tris(hydroxymethyl)aminomethane salts; and amino acid salts such as glycine salts, lysine salts, arginine salts, ornithine salts, glutamates and aspartates.",
                                "All salts are intended to be pharmaceutically acceptable salts within the scope of the invention and all salts are considered equivalent to the free forms of the corresponding compounds for purposes of the invention.",
                                "**Esters**",
                                "Physiologically/pharmaceutically acceptable esters are also useful as active medicaments. The term “pharmaceutically acceptable esters” embraces esters of the compounds of the present invention, in which hydroxy groups (e.g., in carboxylic acid) have been converted to the corresponding esters and may act as a prodrug which, when absorbed into the bloodstream of a warm-blooded animal, may cleave in such a manner as to release the drug form and permit the drug to afford improved therapeutic efficacy. Such esters can be formed with inorganic or organic acids such as nitric acid, sulphuric acid, phosphoric acid, citric acid, formic acid, maleic acid, acetic acid, succinic acid, tartaric acid, methanesulphonic acid, p-toluenesulphonic acid and the like, which are non toxic to living organisms. Further examples are the esters with aliphatic or aromatic acids such as acetic acid or with aliphatic alcohol (e.g., alkyl esters, including methyl, ethyl, propyl, isopropyl, butyl, isobutyl or pentyl esters, and the like) or aromatic alcohols (e.g., benzyl ester)",
                                "Esters can be prepared from their corresponding acids or salts by a variety of methods known to those skilled in the art, such as, for example, by first transforming the acid to the acid chloride and then reacting the acid chloride with a suitable alcohol. Other suitable methods for making esters are described in Kemp and Vellaccio, 1980.",
                                "Where esters of the invention have a basic group, such as an amino group, the compound can be converted to a salt by reacting it with an acid, and in the case where the esters have an acidic group, such as a sulfonamide group, the compound can be converted to a salt by reacting it with a base. The compounds of the present invention encompass such salts.",
                                "Salts and esters of the compounds of the present invention may be prepared by known method by employing appropriate starting materials or intermediate compounds that are readily available and/or are described herein.",
                                "Generally, a desired salt of a compound of this invention can be prepared in situ during the final isolation and purification of a compound by means well known in the art. For example, a desired salt can be prepared by separately reacting the purified compound in its free base or free acid form with a suitable organic or inorganic acid, or suitable organic or inorganic base, respectively, and isolating the salt thus formed. In the case of basic compounds, for example, the free base is treated with anhydrous HCl in a suitable solvent such as THF, and the salt isolated as a hydrochloride salt. In the case of acidic compounds, the salts may be obtained, for example, by treatment of the free acid with anhydrous ammonia in a suitable solvent such as ether and subsequent isolation of the ammonium salt. These methods are conventional and would be readily apparent to one skilled in the art.",
                                "The compounds of this invention may be esterified by a variety of conventional procedures including reacting the appropriate anhydride, carboxylic acid or acid chloride with the alcohol group of a compound of this invention. The appropriate anhydride is reacted with the alcohol in the presence of a base to facilitate acylation such as 1,8-bis[dimethylamino]naphthalene or N,N-dimethylaminopyridine. Or, an appropriate carboxylic acid can be reacted with the alcohol in the presence of a dehydrating agent such as dicyclohexylcarbodiimide, 1-[3-dimethylaminopropyl]-3-ethylcarbodiimide or other water soluble dehydrating agents which are used to drive the reaction by the removal of water, and, optionally, an acylation catalyst. Esterification can also be effected using the appropriate carboxylic acid in the presence of trifluoroacetic anhydride and, optionally, pyridine, or in the presence of N,N-carbonyldiimidazole with pyridine. Reaction of an acid chloride with the alcohol can be carried out with an acylation catalyst such as 4-DMAP or pyridine.",
                                "One skilled in the art would readily know how to successfully carry out these as well as other known methods of esterification of alcohols.",
                                "**Hydrates**",
                                "As used herein the terms, “pharmaceutically acceptable hydrate” refer to the compounds of the instant invention crystallized with one or more molecules of water to form a hydrated form.",
                                "**Prodrugs and Solvates**",
                                "Prodrugs and solvates of the compounds of the invention are also contemplated herein. A discussion of prodrugs is provided in T. Higuchi and V. Stella, Pro-drugs as Novel Delivery Systems (1987) 14 of the A.C.S. Symposium Series, and in Bioreversible Carriers in Drug Design, (1987) Edward B. Roche, ed., American Pharmaceutical Association and Pergamon Press. The term “prodrug” means a compound (e.g., a drug precursor) that is transformed in vivo to yield a compound of the present invention or a pharmaceutically acceptable salt, hydrate or solvate of the compound. The transformation may occur by various mechanisms (e.g., by metabolic or chemical processes), such as, for example, through hydrolysis in blood. A discussion of the use of prodrugs is provided by T. Higuchi and W. Stella, “Pro-drugs as Novel Delivery Systems,” Vol. 14 of the A.C.S. Symposium Series, and in Bioreversible Carriers in Drug Design, ed. Edward B. Roche, American Pharmaceutical Association and Pergamon Press, 1987.",
                                "For example, if a compound of the present invention or a pharmaceutically acceptable salt, hydrate or solvate of the compound contains a carboxylic acid functional group, a prodrug can comprise an ester formed by the replacement of the hydrogen atom of the acid group with a group such as, for example, (C1-C8)alkyl, (C2-C12)alkanoyloxymethyl, 1-(alkanoyloxy)ethyl having from 4 to 9 carbon atoms, 1-methyl-1-(alkanoyloxy)-ethyl having from 5 to 10 carbon atoms, alkoxycarbonyloxymethyl having from 3 to 6 carbon atoms, 1-(alkoxycarbonyloxy)ethyl having from 4 to 7 carbon atoms, 1-methyl-1-(alkoxycarbonyloxy)ethyl having from 5 to 8 carbon atoms, N-(alkoxycarbonyl)aminomethyl having from 3 to 9 carbon atoms, 1-(N-(alkoxycarbonyl)amino)ethyl having from 4 to 10 carbon atoms, 3-phthalidyl, 4-crotonolactonyl, gamma-butyrolacton-4-yl, di-N,N—(C1-C2)alkylamino(C2-C3)alkyl (such as δ-dimethylaminoethyl), carbamoyl-(C1-C2)alkyl, N,N-di(C1-C2)alkylcarbamoyl-(C1-C2)alkyl and piperidino-, pyrrolidino- or morpholino(C2-C3)alkyl, and the like.",
                                "Similarly, if a compound of the present invention contains an alcohol functional group, a prodrug can be formed by the replacement of the hydrogen atom of the alcohol group with a group such as, for example, (C1-C6)alkanoyloxymethyl, 1-((C1-C6)alkanoyloxy)ethyl, 1-methyl-1-((C1-C6)alkanoyloxy)ethyl, (C1-C6)alkoxycarbonyloxymethyl, N—(C1-C6)alkoxycarbonylaminomethyl, succinoyl, (C1-C6)alkanoyl, α-amino(C1-C4)alkanyl, arylacyl and α-aminoacyl, or α-aminoacyl-α-aminoacyl, where each α-aminoacyl group is independently selected from the naturally occurring L-amino acids, P(O)(OH)2, —P(O)(O(C1C6)alkyl)2 or glycosyl (the radical resulting from the removal of a hydroxyl group of the hemiacetal form of a carbohydrate), and the like.",
                                "If a compound of the present invention incorporates an amine functional group, a prodrug can be formed by the replacement of a hydrogen atom in the amine group with a group such as, for example, R-carbonyl, RO-carbonyl, NRR′-carbonyl where R and R′ are each independently (C1-C10)alkyl, (C3-C7)cycloalkyl, benzyl, or R-carbonyl is a natural α-aminoacyl or natural α-aminoacyl, —C(OH)C(O)O Y1 wherein Y1 is H, (C1-C6)alkyl or benzyl, —C(OY2)Y3 wherein Y2 is (C1-C4) alkyl and Y3 is (C1-C6)alkyl, carboxy (C1-C6)alkyl, amino(C1-C4)alkyl or mono-N— or di-N,N—(C1-C6)alkylaminoalkyl, —C(Y4)Y5 wherein Y4 is H or methyl and Y5 is mono-N—or di-N,N—(C1-C6)alkylamino morpholino, piperidin-1-yl or pyrrolidin-1-yl, and the like.",
                                "One or more compounds of the invention may exist in unsolvated as well as solvated forms with pharmaceutically acceptable solvents such as water, ethanol, and the like, and it is intended that the invention embrace both solvated and unsolvated forms. “Solvate” means a physical association of a compound of this invention with one or more solvent molecules. This physical association involves varying degrees of ionic and covalent bonding, including hydrogen bonding. In certain instances the solvate will be capable of isolation, for example when one or more solvent molecules are incorporated in the crystal lattice of the crystalline solid. “Solvate” encompasses both solution-phase and isolatable solvates. Non-limiting examples of suitable solvates include ethanolates, methanolates, and the like. “Hydrate” is a solvate wherein the solvent molecule is H2O.",
                                "One or more compounds of the invention may optionally be converted to a solvate. Preparation of solvates is generally known. Thus, for example, M. Caira et al, J. Pharmaceutical Sci., 93(3), 601-611 (2004) describe the preparation of the solvates of the antifungal fluconazole in ethyl acetate as well as from water. Similar preparations of solvates, hemisolvate, hydrates and the like are described by E. C. van Tonder et al, AAPS Pharm Sci Tech., 5(1), article 12 (2004); and A. L. Bingham et al, Chem. Commun., 603-604 (2001). A typical, non-limiting, process involves dissolving the inventive compound in desired amounts of the desired solvent (organic or water or mixtures thereof) at a higher than ambient temperature, and cooling the solution at a rate sufficient to form crystals which are then isolated by standard methods. Analytical techniques such as, for example I. R. spectroscopy, show the presence of the solvent (or water) in the crystals as a solvate (or hydrate)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define pharmacologically acceptable salts",
                                "list examples of salts",
                                "describe formation of salts",
                                "define pharmacologically acceptable esters",
                                "list examples of esters",
                                "describe formation of esters",
                                "describe conversion of esters to salts",
                                "describe conversion of salts to esters",
                                "define pharmacologically acceptable hydrates",
                                "describe formation of hydrates",
                                "define prodrugs",
                                "describe formation of prodrugs",
                                "list examples of prodrugs",
                                "describe solvates",
                                "describe formation of solvates",
                                "list examples of solvates",
                                "describe preparation of solvates",
                                "describe analytical techniques for solvates",
                                "describe purification of enantiomers",
                                "describe separation of isomeric mixtures",
                                "describe pharmaceutical compositions",
                                "list additives in pharmaceutical compositions",
                                "describe dosages",
                                "describe factors affecting dosages",
                                "describe toxicity and therapeutic efficacy",
                                "describe determination of LD50 and ED50",
                                "describe therapeutic index",
                                "describe kits"
                            ],
                            "num_characters": 14207,
                            "outline_medium": [
                                "define pharmacologically acceptable salts",
                                "list examples of salts",
                                "describe formation of salts",
                                "define pharmacologically acceptable esters",
                                "list examples of esters",
                                "describe formation of esters",
                                "define pharmacologically acceptable hydrates",
                                "describe formation of hydrates",
                                "define prodrugs and solvates",
                                "describe formation of prodrugs",
                                "list examples of prodrugs",
                                "describe solvates",
                                "list examples of solvates",
                                "describe preparation of solvates"
                            ],
                            "outline_short": [
                                "define pharmacologically acceptable salts",
                                "list examples of salts",
                                "describe formation of salts",
                                "define pharmacologically acceptable esters",
                                "describe formation of esters",
                                "define hydrates and solvates",
                                "describe prodrugs and solvates"
                            ]
                        },
                        {
                            "title": "Stereoisomers, Enantiomers, Racemates, Tautomers",
                            "paragraphs": [
                                "The compounds of the present invention have asymmetric carbon atoms and can exist in the form of optically pure enantiomers or as racemates. The invention embraces all of these forms.",
                                "For purposes of this Specification, “pharmaceutically acceptable tautomer” means any tautomeric form of any compound of the present invention.",
                                "The purification of enantiomers and the separation of isomeric mixtures of a compound of the present invention may be accomplished by standard techniques known in the art.",
                                "The pharmaceutical compositions may also contain preserving agents, solubilising agents, stabilising agents, wetting agents, emulsifiers, sweeteners, colorants, odorants, salts for the variation of osmotic pressure, buffers, coating agents or antioxidants. As mentioned earlier, they may also contain other therapeutically valuable agents."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe stereoisomers, enantiomers, racemates, and tautomers"
                            ],
                            "num_characters": 841,
                            "outline_medium": [
                                "describe stereoisomers, enantiomers, racemates, and tautomers"
                            ],
                            "outline_short": [
                                "describe stereoisomers, enantiomers, racemates, and tautomers"
                            ]
                        },
                        {
                            "title": "Dosages",
                            "paragraphs": [
                                "The dosages in which the compounds of the present invention are administered in effective amounts depend on the nature of the specific active ingredient, the age and the requirements of the patient and the mode of application. In general, daily dosages of about 1 mg -1000 mg, preferably 5 mg -500 mg, per day come into consideration.",
                                "The skilled artisan will appreciate that certain factors may influence the dosage required to effectively treat a subject, including but not limited to the severity of the disease or disorder, previous treatments, the general health and/or age of the subject, and other diseases present. Moreover, treatment of a subject with a therapeutically effective amount of a compound of the present invention can include a series of treatments."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe dosages"
                            ],
                            "num_characters": 771,
                            "outline_medium": [
                                "describe dosages of compounds"
                            ],
                            "outline_short": [
                                "describe dosages of compounds"
                            ]
                        },
                        {
                            "title": "Toxicity and Therapeutic Efficacy",
                            "paragraphs": [
                                "Toxicity and therapeutic efficacy of such compounds can be determined by standard pharmaceutical procedures in cell cultures or experimental animals, e.g., for determining the LD50 (the dose lethal to 50% of the population) and the ED50 (the dose therapeutically effective in 50% of the population). The dose ratio between toxic and therapeutic effects is the therapeutic index and it can be expressed as the ratio LD50/ED50. Compounds that exhibit large therapeutic indices are preferred. While compounds that exhibit toxic side effects may be used, care should be taken to design a delivery system that targets such compounds to the site of affected tissue in order to minimize potential damage to uninfected cells and, thereby, reduce side effects.",
                                "Data obtained from cell culture assays and animal studies can be used in formulating a range of dosage for use in humans. The dosage of such compounds lies preferably within a range of circulating concentrations that include the ED50 with little or no toxicity. The dosage may vary within this range depending upon the dosage form employed and the route of administration utilized. For any compound used in the method of the invention, the therapeutically effective dose can be estimated initially from cell culture assays. A dose may be formulated in animal models to achieve a circulating plasma concentration range that includes the IC50 (i.e., the concentration of the test compound which achieves a half-maximal inhibition of symptoms) as determined in cell culture. Such information can be used to more accurately determine useful doses in humans. Levels in plasma may be measured, for example, by high performance liquid chromatography.",
                                "**Kits**",
                                "The present invention also encompasses kits comprising the compounds of the present invention. For example, the kit can comprise one or more compounds or agents binding to a guanine riboswitch and inhibit or reduce the expression of the gene guaA. The kit may optionally include one or more control samples. The compounds or agents can be packaged in a suitable container. The kit can further comprise instructions for using the kit.",
                                "The present invention also relates to methods for preparing the above-mentioned compounds. In an embodiment, the above-mentioned method is that defined in Examples 13 and 16 below.",
                                "The present invention is illustrated in further details by the following non-limiting examples."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe toxicity and therapeutic efficacy",
                                "describe determination of LD50 and ED50",
                                "describe therapeutic index",
                                "describe dosage range"
                            ],
                            "num_characters": 2420,
                            "outline_medium": [
                                "describe determination of toxicity and therapeutic efficacy",
                                "describe estimation of therapeutically effective dose"
                            ],
                            "outline_short": [
                                "describe toxicity and therapeutic efficacy of compounds"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce gene guaA and its essentiality",
                        "describe guanine riboswitch control of guaA expression",
                        "present bioinformatic analysis of guanine riboswitches",
                        "highlight unexpected discovery of guaA high expression",
                        "describe microarray and quantitative PCR gene expression analysis",
                        "introduce guanine-like compounds and their binding properties",
                        "present binding and competition assays",
                        "describe microarray gene expression analysis of compound effects",
                        "highlight specificity and mechanism of compound modulation",
                        "describe anti-bacterial effects of compounds"
                    ],
                    "num_characters": 5419,
                    "outline_medium": [
                        "introduce gene guaA and its role in microbial pathogens",
                        "describe discovery of guanine riboswitch controlling guaA expression",
                        "discuss high expression of guaA in specific environments during infection",
                        "describe surprising discovery of guanine-like compounds binding to riboswitch aptamers",
                        "discuss compounds as specific antimicrobial agents with no substantial inhibitory activity against non-target microorganisms"
                    ],
                    "outline_short": [
                        "describe gene guaA and its role in microbial pathogens",
                        "describe discovery of guanine riboswitches and their control of guaA expression"
                    ]
                },
                {
                    "title": "EXAMPLE 1",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "guaA Expression in S. aureus Isolates from Infected Cows and from Milk",
                            "paragraphs": [
                                "The present invention relates to the discovery that some pathogen microorganisms, such as S. aureus, sustain a significant level of expression of the gene guaA (comparable to some known essential genes) in specific environments during infection of a mammalian or animal host. The present invention also discloses the sustained expression of guaA in several S. aureus isolates, including those causing persistent and chronic bovine mastitis, during infection in a cow. The present invention also discloses that the expression of guaA in several S. aureus isolates, including those causing persistent and chronic bovine mastitis, was relatively higher during infection in cows compared to the expression of guaA in the corresponding S. aureus isolates grown in vitro in freshly collected milk obtained from a healthy cow.",
                                "DNA microarray gene expression analysis was used to identify genes that were expressed (at different time points) by various S. aureus strains in vivo during bovine mastitis. Mastitis infection in two cows were examined: Cow #310 and cow #5325. The results of this analysis with respect to all genes are summarized in the Venn diagram presented in FIG. 1. Briefly, the chip was produced from genes amplified and selected in inventor's laboratory. FIG. 1 shows the number of genes (including guaA) that are commonly or differentially expressed by a prototypical S. aureus mastitis isolate (SHY97-3906) and S. aureus isolates causing persistent and chronic bovine mastitis (isolates #3, #557 and #1290). The results of this microarray analysis with respect to expression of guaA, are summarized in Table 1 below. Although guaA mRNA expression was detected in all samples analyzed, most of the samples showed that guaA was expressed at a level higher than the average level of expression for all genes detected on the arrays (Table 1). These results appear to indicate that, even though the different S. aureus strains (prototypical and chronic) show some differences in the genes they each express, guaA is commonly expressed by both the prototypical mastitis strain (SHY97-3906) and the group of chronic strains (#3, #557 and #1290). Also, the level of expression of guaA, measured by real-time PCR for strain #1290 isolated from three different samples of mastitic milk in vivo, was very similar to that measured for gyrB (1.19 ±0.33 fold vs. gyrB), demonstrating that guaA is expressed during infection at levels comparable to the well-known S. aureus essential gene gyrB, which encodes an essential DNA gyrase (Anderson et al., 2000).",
                                "Depicted in FIG. 2 are quantitative PCR analyses showing the relative level of guaA mRNA expression by mastitis isolates of S. aureus in the in vivo cow-collected samples compared to when the corresponding S. aureus isolates were grown in vitro in freshly collected milk from a healthy cow. All results were normalized using the level of expression of S. aureus essential gene, gyrB. The horizontal bar represents the median. RNA samples from S. aureus grown in two different animals were analyzed: cow #5325 at day 10 of infection with strain SHY97-3906 (∘), #3 (⋄), #557 (□), #1290 (□). The same shapes were used for the four different strains for the samples coming from cow #307 at day 8 of infection (black) and cow #307 at day 14 (grey). Quantitative PCR was also done in triplicate for the RNA sample recovered from strain #1290 in cow 5325 at day 10 of infection and the error bar is shown accordingly.",
                                "Briefly, four different Staphylococcus aureus strains (clinical isolate SHY97-3906 and chronic isolates 3, 557 and 1290) were inoculated in 8 multiparous Holstein cows in mid lactation at the Dairy and Swine Research and Development Centre of Agriculture and Agri-Food Canada in Sherbrooke, QC, Canada. Each quarter of the mammary gland of the cows was infused with 50 CFU of each S. aureus strain. After the inoculation, milk was collected from each quarter of each cow every 2-4 days in the morning for a total of 18 days. S. aureus was then isolated from the mastitic milk and RNA was extracted from the in vivo grown S. aureus. With the RNA, fluorescent probes for hybridization to DNA arrays were generated through an aminoallyl cDNA labelling procedure. The fluorescent probes (labeled with Cy5) were hybridized to a DNA array that contained a selection of 530 known or putative genes. Only genes with a Cy5 signal intensity of ≧100%, i.e., greater or equal to the mean Cy5 intensity of the entire array were analyzed. The results were confirmed by quantitative PCR and the level of expression of genes found to be strongly expressed during mastitis by S. aureus was compared to that of in vitro grown S. aureus. FIG. 2 shows that guaA is expressed at level that is roughly equivalent to or higher than the essential gene gyrB in S. aureus present in mastitic milk (Mayer et al, 1988)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "relate invention to discovery of guaA expression",
                                "describe DNA microarray gene expression analysis",
                                "summarize results of microarray analysis",
                                "describe real-time PCR analysis",
                                "compare guaA expression to gyrB",
                                "describe in vivo and in vitro experiments",
                                "detail RNA extraction and hybridization",
                                "confirm results with quantitative PCR",
                                "summarize guaA expression during infection"
                            ],
                            "num_characters": 4862,
                            "outline_medium": [
                                "identify genes expressed by S. aureus strains in vivo during bovine mastitis",
                                "analyze guaA expression in S. aureus isolates from infected cows and milk",
                                "compare guaA expression levels in vivo and in vitro",
                                "demonstrate guaA expression during infection at levels comparable to essential genes"
                            ],
                            "outline_short": [
                                "identify genes expressed by S. aureus strains in vivo during bovine mastitis",
                                "compare guaA expression in S. aureus isolates from infected cows and milk"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLE 2",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Polycistronic RNA Encoding xpt/pbuX/guaB/guaA",
                            "paragraphs": [
                                "The present invention relates to the discovery that the guanine riboswitch of S. aureus controls the expression of a polycistronic mRNA encoding xpt/pbuX/guaB/guaA and not only the non-essential genes xpt and pbuX, contradicting the teachings of the prior art that the S. aureus guanine riboswitch controls genes that are not essential for survival or virulence of the pathogen. Example 1 showed that there was a sustained expression of guaA in S. aureus during infection in cows.",
                                "Shown in FIG. 3A is a schematic representation of the structure of the operon xpt/pbuX/guaB/guaA from S. aureus as redefined herein with the number of base pairs present in the intergenic regions indicated. A gray rectangle represents the guanine riboswitch. Annotated arrows indicate the number of bases between adjacent genes. This schematic representation was compiled from the results of an RT-PCR analysis of total RNA from S. aureus (FIG. 3B) of the intergenic regions between xpt and pbuX (1); pbuX and guaB (2); and guaB and guaA (3). Briefly, total RNA extract from S. aureus was submitted to DNAse1 followed by reverse transcription. The obtained cDNA was then amplified by PCR using the following primer designed to amplify intergenic region. These results clearly demonstrate the polycistronic nature of the mRNA transcript downstream of the guanine riboswitch."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "relate invention to discovery of polycistronic mRNA",
                                "describe RT-PCR analysis of intergenic regions"
                            ],
                            "num_characters": 1355,
                            "outline_medium": [
                                "redefine operon structure of xpt/pbuX/guaB/guaA with guanine riboswitch"
                            ],
                            "outline_short": [
                                "redefine operon xpt/pbuX/guaB/guaA structure in S. aureus"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLE 3",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Ability of Compounds of the Invention to Bind Guanine Riboswitches",
                            "paragraphs": [
                                "The compounds of the present invention are able to compete with guanine-like ligands for binding to the guanine riboswitch. Structural modifications of these and other related compounds influence this property.",
                                "Shown in FIG. 4A is the structure of the guanine ligand and the compounds: 4-hydroxy-2,5,6-triaminopyrimidine shown as 2,5,6-triaminopyrimidine-4-one (compound 1.01), 2,4-diamino-6-hydroxypyrimidine shown as 2,6-diaminopyrimidine-4-one (compound 1.13) and 5,6-diamino-uracil (2AU) as well as their predicted hydrogen bonds (arrows). FIG. 4B shows a histogram representing the relative binding affinity of several compounds (i.e. guanine (G or Gua), adenine (A), xanthine (X), hypoxanthine (H), compound 1.13, compound 1.01, 5,6-diamino-uracil (2AU) and 6-thioguanine (6-thio)) at two concentrations (1 or 10 μM) for a guanine xpt riboswitch from Streptococcus pyogenes (STPY-xpt). The experiment was performed as in for example Mulhbacher and Lafontaine, 2007. Compounds 1.01 and 1.13 were purchased from Fluka product numbers 17376 and 33050 respectively. Briefly, STPY-xpt aptamers were incubated in the presence of the guanine-like ligand 2-aminopurine alone (Neg. control) or in the presence of 1 or 10 μM of the above-listed compounds. The relative binding affinity was obtained from the ability of a ligand to displace the 2-aminopurine from the guanine riboswitch STPY-xpt aptamer. The results comparing the relative binding of 1 μM guanine with 10 μM of the various tested compounds are summarized in Table 2 below. The phrase “appropriate properties” is meant to refer to structural characteristics enabling compounds to fit or interact with the active site of the guanine riboswitch, while lacking the chemistry required to undergo ribosylation, thus precluding the compounds incorporation into cellular nucleosides, nucleotides or nucleic acids of non targeted bacteria or of the mammalian host treated with the compounds."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe structure of guanine ligand and compounds",
                                "describe binding affinity experiment",
                                "summarize results of binding affinity experiment"
                            ],
                            "num_characters": 1945,
                            "outline_medium": [
                                "demonstrate compounds' ability to compete with guanine-like ligands for binding"
                            ],
                            "outline_short": [
                                "demonstrate compounds' ability to bind guanine riboswitches"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLE 4",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Growth Inhibition of Bacterial Species Possessing a Guanine Riboswitch that Controls the Expression of the guaA Gene by Compounds of the Present Invention",
                            "paragraphs": [
                                "As disclosed herein, compounds of the present invention (such as 4-hydroxy-2,5,6-triaminopyrimidine (compound 1.01)) are able to inhibit the growth of bacteria if such bacteria possess a guanine riboswitch that controls the expression of the guaA gene. Also, the compounds of the present invention (e.g., compound 1.01) do not substantially inhibit the growth of bacteria that have the guaA gene but not the guanine riboswitch that controls its expression.",
                                "Shown in Table 3 below are examples of the genes and operons controlled by guanine riboswitches in several bacterial species following a bioinformatic analysis involving a sequence homology algorithm as described in Mulhbacher and Lafontaine, 2007. Briefly, the identification of riboswitches controlling guaA was realized using the Rfam database or a published article (Barrick J E and Breaker R R, Genome Biol. 2007) which repertories guanine riboswitches. The NCBI database was then blasted to find the associate genes. The identification of new guanine riboswitches in newly sequenced genomes could also be realized using the RNAmotif™ solftware. Genes corresponding to guaA are highlighted. Accession numbers for the genome of the bacterium and positions corresponding to the beginning of the riboswitch and of the gene or the operon containing guaA are also presented. Consistent with the teachings of the present invention, bacterial strains (e.g., S. aureus and C. difficile) expressing the guaA gene under the control of a guanine riboswitch are expected to be susceptible to the antimicrobial effects of the compounds of the present invention. Also consistent with the teachings of the present invention, bacterial strains expressing the guaA gene independently from the guanine riboswitch (e.g., E. coli and Bacillus subtilis) are expected to be not significantly affected by the antimicrobial effects of the compounds of the present invention.",
                                "FIG. 5 depicts antibiograms showing the effect of compound 1.01 on the growth of various bacterial species in which the guanine riboswitch controls (FIG. 5B) (i.e. Bh: Bacillus halodurans; STAh: S. haemolyticus; STAa: S. aureus ATCC29213; SA228a: S. aureus resistant to beta-lactams, erythromycin, ciprofloxacin, gentamicin and tetracycline; MRSAcoI: methicilin resistant S. aureus col,; Cb: Clostridium botulinum; Cd6: Clostridium difficile virulent isolated in Quebec; Cd630: Clostridium difficile strain 630 with complete sequenced genome; and STAe: S. epidermidis) or not (FIG. 5A) (i.e. Bs: Bacillus subtilis; Ef: Enterococcus feacium; Lm: Listeria monocytogenes; STRd: Streptococcus dysgalactiae; STRpy: Streptococus pyogenes; and STRu: Streptococcus uberis) the expression of the essential guaA gene. Briefly, for each strain, bacteria were inoculated at 105 CFU/mL by dilution in Muller-Hinton agar. After agar medium was solidified six wells of 4 mm diameter were made and filled with 15 μl of tested molecule (5 mg/mL). While strains insensitive to compound 1.01 (shown in FIG. 5A) do not have the expression of guaA under control of a riboswitch, the strains sensitive to compound 1.01 (shown in FIG. 5B) control guaA expression via a riboswitch mechanism."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce compounds of the present invention",
                                "describe growth inhibition of bacteria with guanine riboswitch",
                                "describe lack of growth inhibition of bacteria without guanine riboswitch",
                                "show examples of genes and operons controlled by guanine riboswitches",
                                "describe method for identifying new guanine riboswitches",
                                "show antibiograms of compounds on various bacterial species"
                            ],
                            "num_characters": 3182,
                            "outline_medium": [
                                "introduce guanine riboswitch-controlled guaA gene",
                                "describe compounds inhibiting bacterial growth",
                                "show antibiograms of compound 1.01 on various bacterial species"
                            ],
                            "outline_short": [
                                "describe growth inhibition of bacterial species"
                            ]
                        },
                        {
                            "title": "EXAMPLE 5",
                            "paragraphs": [
                                "**Preclusion from Ribosylation of the Compounds of the Present Invention**",
                                "Shown schematically in FIG. 6A is the ribosylation reaction leading to the formation of nucleosides as well as examples of compounds of the invention that would prevent this ribosylation to occur. Asterisks (*) denote the position within the compound where chemical modification precludes ribosylation. FIG. 6B shows typical antibiograms performed as described in the previous example on strains of E. coli ATCC 35695 (which lacks a guaA riboswitch) and methicillin resistant S. aureus (which contains a guaA riboswitch) grown in the absence (1) or presence of 6-thioguanine at a concentration of 0.5 mg/mL (2) or 1 mg/mL (3). FIG. 6C shows that 6-thioguanine is able to be ribosylated and is incorporated into DNA and RNA (Swann et al., 1996), which results in its riboswitch-independent, non-specific antibiotic activity toward both E. coli and S. aureus (as shown in FIG. 6B).",
                                "The effects of several antimicrobial compounds on the growth and survival of various strains of E. coli are summarized in Table 4 and presented in the form of minimum inhibitory concentrations (MIC, in μg/mL). Briefly, minimal inhibitory concentration of compounds 1.01 and 1.13 was determined using the microdilution method in 96-well microplates. Bacteria were inoculated at 105 CFU/mL and incubated at 37° C. for 24 h in Muller-Hinton cation adjusted media. Then OD595 nm was read on microplate reader.",
                                "The results depicted in Table 4 above show that the guanine switch-less bacterium Escherichia coli is not inhibited by compounds 1.01 and 1.13 while the E. coli strain is highly permeable (strain E. coli Imp) to large antibiotic molecules like erythromycin and vancomycin or lacks the efflux pump AcrAB (strain E. coli AcrAB−/−) that is able to pump toxic molecules out of the cell. These results demonstrate the antimicrobial specificity of the compounds of the present invention (e.g., compounds 1.01 and 1.13) for bacteria that possess a guanine riboswitch controlling the expression of guaA. These results also demonstrate that the compounds of the present invention (e.g., compounds 1.01 and 1.13) are not broadly toxic to other bacteria lacking a guanine riboswitch controlling the expression of guaA. Thus, the compounds of the present invention allow for selective treatment of microbial pathogens affecting animals and humans. For example, compound 1.01 is sufficiently distinct from the natural guanine riboswitch ligand (guanine), to prevent incorporation of compounds into cellular nucleosides, nucleotides or nucleic acids, thus preventing toxicity for the mammalian or animal host in which such a compound is used for therapeutic intervention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce ribosylation reaction",
                                "describe prevention of ribosylation by compounds of the present invention",
                                "show antibiograms of compounds on E. coli and S. aureus",
                                "describe effect of 6-thioguanine on bacterial growth",
                                "summarize results of antibiogram experiments"
                            ],
                            "num_characters": 2721,
                            "outline_medium": [
                                "describe ribosylation reaction and prevention by compounds",
                                "show antibiograms of compounds on E. coli and S. aureus"
                            ],
                            "outline_short": [
                                "describe preclusion from ribosylation of compounds of the present invention"
                            ]
                        },
                        {
                            "title": "EXAMPLE 6",
                            "paragraphs": [
                                "**Minimal Inhibitory Concentrations and Bactericidal Activities of Compounds of the Present Invention**",
                                "As disclosed herein, the compounds of the present invention (e.g., compounds 1.01 and 1.13) are able to specifically and selectively inhibit the growth and/or kill bacterial species that possess the guanine riboswitch controlling the expression of guaA such as S. aureus and C. difficile. The compounds of the present invention demonstrate an anti-bacterial effect on prototypical bacterial strains or bacterial stains causing persistent and chronic bovine mastitis in vitro (e.g., in culture media or milk) and in vivo (e.g., in mice mammary gland infections). Furthermore, the anti-bacterial effect of the compounds of the present invention (e.g., compound 1.01) is as rapid as that of the well-known antibiotic ciprofloxacin that is used in human and veterinary medicine.",
                                "The effect of various antibiotic compounds, including compounds 1.13 and 1.01, on the growth of S. aureus strain ATCC 29213 in vitro in Muller-Hinton cation adjusted media was tested and is shown in FIG. 7 and/or Table 5 below. For each experiment, bacteria were inoculated at a concentration of 105 CFU/mL grown in Muller-Hinton cation adjusted media in the presence or absence of various antimicrobial compounds. After a specified time, bacteria were sampling and diluted in 96-well microplates before being inoculated on TSA plate. After 24 hours at 37° C., CFU were counted. FIG. 7A shows the growth of S. aureus strain ATCC 29213 as a function of ligand concentration for compounds 1.13 () and 1.01 (□). The MICs were determined using the microdilution method in 96-well microplates and the bacteria were incubated at 37° C. for 24 h following inoculation. The MIC for compound 1.13 was determined to be about 5000 μg/mL and that for compound 1.01 was determined to be about 600 μg/mL. FIGS. 7B and 7C show the growth of S. aureus strain ATCC 29213 as a function of time in the absence () or presence of various compounds. Specifically, FIG. 7B shows the anti-bacterial effect of the MIC corresponding to 0.5 μg/mL of erythromycin (▴), 1 μg/mL of vancomycin (▪), 600 μg/mL of compound 1.01 (▾), and 0.5 μg/mL ciprofloxacin (♦). FIG. 7C shows the anti-bacterial effect in the absence () or presence of the same compounds at a dose of ¼ of their corresponding MICs (i.e., 0.125 μg/mL ciprofloxacin (♦), 0.125 μg/mL erythromycin (▴), 0.25 μg/mL vancomycin (▪), 150 μg/mL compound 1.01 (▾)). FIG. 7D shows the growth of S. aureus strain ATCC 29213 as a function of time in media alone (), in the presence of 600 μg/mL of compound 1.01 (▾), or in the presence of 600 μg/mL of compound 1.01 supplemented with 100 μM GMP (i.e. a molecule normally synthesized by the enzyme GMP synthetase encoded by guaA) (▴)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce minimal inhibitory concentrations and bactericidal activities",
                                "describe effect of compounds on S. aureus growth",
                                "show growth curves of S. aureus with various compounds",
                                "describe bactericidal activity of compounds on S. aureus",
                                "summarize results of MIC and bactericidal activity experiments"
                            ],
                            "num_characters": 2792,
                            "outline_medium": [
                                "describe minimal inhibitory concentrations and bactericidal activities",
                                "show growth of S. aureus strain ATCC 29213 with various compounds"
                            ],
                            "outline_short": [
                                "describe minimal inhibitory concentrations and bactericidal activities of compounds of the present invention"
                            ]
                        },
                        {
                            "title": "EXAMPLE 7",
                            "paragraphs": [
                                "**Bactericidal Activity of Compound 1.01 on Various S. aureus Strains**",
                                "The bactericidal activity of compound 1.01 on various strains of S. aureus (including 3 chronic strains and 3 prototypical strains) was determined. These strains include prototypical S. aureus strains ATCC 29213, Newbould 305, SHY97-3906 as well as S. aureus strains isolated from persistent and chronic bovine mastitis cases (isolates #3, #557, #1290). C. difficile strain Cd6 was also examined. The bacteria were inoculated at 105 CFU/mL in Muller-Hinton cation adjusted media in absence or presence of 600 μg/mL compound 1.01 and grown for 4 hours. The results are summarized in Table 5 below and are expressed as the mean fold reduction of CFU/mL (i.e., the number of CFU/mL of control bacteria divided by the number of CFU/mL of treated bacteria). These results indicate that compound 1.01 has a significant anti-bacterial effect against all the strains tested, with the highest effect being against S. aureus strain ATCC 29213."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe bactericidal activity of compound 1.01 on S. aureus strains",
                                "summarize results of bactericidal activity experiments"
                            ],
                            "num_characters": 1006,
                            "outline_medium": [
                                "describe bactericidal activity of compound 1.01 on various S. aureus strains"
                            ],
                            "outline_short": [
                                "describe bactericidal activity of compound 1.01 on various S. aureus strains"
                            ]
                        },
                        {
                            "title": "EXAMPLE 8",
                            "paragraphs": [
                                "**Mode of Action of Compounds of the Present Invention**",
                                "To verify the specificity and explore the mechanism of action of compound 1.01, a transcriptomic microarray analysis was used to follow the expression of more then 500 S. aureus genes. Compound 1.01 was used alone or in combination with GMP and the results are shown in FIG. 8A. Briefly, the relative expression of S. aureus genes (xpt, pbuX, guaA and guaB) under the control of guanine riboswitch when grown in presence of compound 1.01 or compound 1.01 supplemented with GMP was examined. Bacteria were inoculated at 108 CFU/mL in Muller-Hinton cation adjusted media in absence or presence of 600 μg/mL of compound 1.01 or 600 μg/mL compound 1.01 supplemented with 100 μM GMP. After 30 min of growth, RNA was extracted and 2.5 μg of RNA were submitted to reverse transcription to generate fluorescent probes through an aminoallyl cDNA labeling procedure before being hybridized on the microarray (Moisan et al., 2006). The experiments were repeated three times and the averages and standard deviations are shown. Gene expression was normalized to that of xpt in the presence of compound 1.01. The expression levels the genes gyrA and gyrB (encoding gyrase protein subunits) were also included as controls since their expression is not down-regulated in the presence of GMP. When compound 1.01 was used alone, more then 75% of genes were repressed including those controlled by the guanine riboswitch, xpt/pbuX/guaB/guaA (FIG. 8A). This could be explained by the inhibition of GMP production that is essential for the synthesis of messenger RNA (see FIG. 8B). When compound 1.01 and GMP were added in combination, the GMP allowed most of the studied genes to maintain their expression level and only 20% genes were repressed, among which were those controlled by the guanine riboswitch, xpt/pbuX/guaB/guaA (FIG. 8A). As depicted in FIG. 8B, the compounds of the present invention (e.g., compound 1.01) can interact with the guanine riboswitch and reduce expression of the genes xpt/pbuX/guaB/guaA. In particular, the inhibition of guaA causes a cellular depletion of the levels of GMP, which in turn inhibits general DNA and RNA synthesis. The supplementation of GMP counteract the effects of the compounds of the present invention (e.g., compound 1.01) on DNA and RNA synthesis. These results demonstrate the specificity of compound 1.01 as shown on the schema of FIG. 8B.",
                                "FIG. 8B shows a schematic representation of the inhibitory effect of compound 1.01 in S. aureus. A unique guanine riboswitch performs gene expression regulation of all four guanine-related genes (xpt, pbux, guaA and guaB). Riboswitch-regulated genes appear in gray and the compound 1.01 inhibitory effect is indicated by grey bars. A thick bar indicates the effect of compound 1.01 on expression of guaA. Broken arrows represent multiple synthesis steps that are not shown in the figure. Ovals represent genes encoding various metabolite transporters."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce mode of action of compounds of the present invention",
                                "describe transcriptomic microarray analysis",
                                "show effect of compound 1.01 on gene expression",
                                "describe mechanism of action of compound 1.01",
                                "summarize results of transcriptomic analysis"
                            ],
                            "num_characters": 2985,
                            "outline_medium": [
                                "describe mode of action of compounds",
                                "show transcriptomic microarray analysis of S. aureus genes"
                            ],
                            "outline_short": [
                                "describe mode of action of compounds of the present invention"
                            ]
                        },
                        {
                            "title": "EXAMPLE 9",
                            "paragraphs": [
                                "**Inhibitory Effect of Compounds of the Present Invention During In Vivo Infection in Mice and Cows**",
                                "The compounds of the present invention (e.g., compound 1.01) are able to inhibit the growth and/or kill microbial pathogens possessing the guanine riboswitch controlling the expression of guaA during infection of the mammary glands in the mouse.",
                                "The efficacy of compound 1.01 in treating a S. aureus infection of the mouse mammary glands was examined. Briefly, mouse mammary glands were infected with 100 CFU of S. aureus. Four hours after the inoculation, the glands were treated with vehicle (PBS), 10, 50 or 100 μg/gland of compound 1.01. Six hours later, glands were excised, homogenized and plated on Mueller-Hinton agar. CFU were then counted after 18 hours at 35° C. The results of these studies are shown in FIG. 9. Each dot represents the CFU of each individual gland (n=6-12) and the median value for each group is indicated by the bar. Statistical differences (P <0.05) between CFU recovered from treated and untreated animals are shown by asterisks (non-parametric Kruskal-Wallis ANOVA with Dunn's post test). These results clearly demonstrate the anti-microbial effect in vivo of compound 1.01 against a S. aureus infection. This demonstrates that a compound such as compound 1.01 is sufficiently soluble, stable and bioavailable to display anti-microbial activity during an infection in an animal host. Intra-mammary injection of 10 times the effective dose of a compound such as compound 1.01 is able to reduce bacterial counts by >3 log10 without causing any significant signs of toxicity in mice, such as alterations in posture, breathing, piloerection or movement. There was also no apparent cytotoxicity upon histological observations of mammary tissues in 1.01-treated mice (100 μg/gland) compared to PBS-treated glands. Similarly, in tests performed in 4 Holstein cows over a period of 48 h, the intramammary injection of compound 1.01 at either 0 (saline control), 100 mg, 250 mg or 500 mg in the 4 individual quarters caused no change in body temperature, milk appearance, milk somatic cell counts or individual milk quarter production that could be correlated with any of the treatment."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce in vivo infection model",
                                "describe efficacy of compound 1.01 in treating S. aureus infection",
                                "show results of in vivo infection experiments",
                                "summarize results of in vivo infection experiments"
                            ],
                            "num_characters": 2214,
                            "outline_medium": [
                                "describe in vivo inhibitory effect in mice and cows",
                                "show efficacy of compound 1.01 in treating S. aureus infection in mice"
                            ],
                            "outline_short": [
                                "describe inhibitory effect of compounds of the present invention during in vivo infection in mice and cows"
                            ]
                        },
                        {
                            "title": "EXAMPLE 10",
                            "paragraphs": [
                                "**Compounds of the Present Invention Prevent Rapid Development of Bacterial Resistance in S. aureus**",
                                "The present invention relates to the discovery that the compounds of the present invention are not only able to inhibit the expression of the gene guaA when it is under riboswitch control, but can also prevent development of bacterial resistance. Specifically, FIG. 10 shows the inability of S. aureus to develop resistance toward compound 1.01. Briefly, serial passages in the presence of sub-inhibitory concentrations of test antibiotics demonstrating the inability of S. aureus to develop resistance toward 1.01 were conducted. The MIC of test compounds against S. aureus strain ATCC 29213 recovered from broth cultures containing sub-inhibitory concentrations of antibiotics was determined every 5 passages up to 30. As a comparison, results obtained with two known antibiotics, ciprofloxacin and rifampicin, were added to the histogram. High level resistance to ciprofloxacin and rifampicin was rapidly selected (within 5 daily passages) in S. aureus. Such rapid development of resistance for the traditional drugs is consistent with the selection of known single point mutations each able to provide a decrease in drug affinity for the bacterial cell target. There are at least 2 known point mutations in GyrA conferring resistance to ciprofloxacin in addition to possible over-expression of the NorA efflux pump system also occurring through mutations (at least 3 possible mutations) (Jones et al., 2000) and at least 17 possible different mutations in RpoB enabling resistance to rifampicin have been documented (Wilchelhaus et al., 2001). The S. aureus strain did not develop antibiotic resistance to compound 1.01 after at least 30 passages in culture. The absence of resistance observed in presence of 1.01 is probably because reestablishing guaA gene expression in the presence of 1.01 requires multiple mutational steps thus reducing the frequency of resistance development and/or that maintaining a functional riboswitch is a vital process that does not allow bacteria to bypass 1.01 antibiotic action. These results also strongly suggest that the compounds of the present invention not only possess an anti-microbial effect, but may also prevent the development of multi-drug resistant bacteria."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce development of bacterial resistance",
                                "describe inability of S. aureus to develop resistance to compound 1.01",
                                "show results of resistance development experiments",
                                "summarize results of resistance development experiments"
                            ],
                            "num_characters": 2313,
                            "outline_medium": [
                                "describe inability of S. aureus to develop resistance to compound 1.01",
                                "show serial passages in presence of sub-inhibitory concentrations of antibiotics"
                            ],
                            "outline_short": [
                                "describe prevention of rapid development of bacterial resistance in S. aureus"
                            ]
                        },
                        {
                            "title": "EXAMPLE 11",
                            "paragraphs": [
                                "**Illustrative Compounds of the Present Invention**",
                                "The present invention relates to a number of small molecule compounds having a selective antimicrobial activity on microbial pathogens containing guaA under control of the guanine riboswitch but having no substantial antimicrobial activity against microorganisms lacking a guaA-controlled by the guanine riboswitch. The compounds of the present invention fit the structural requirements for binding to the guanine riboswitch binding site and yet are chemically unable to be ribosylated by the targeted pathogens. The latter is meant at preventing incorporation of the compounds into cellular nucleosides, nucleotides or nucleic acids, and thus preventing broad, non-specific toxicity for the mammalian or animal host in which the present compounds are used for therapeutic intervention.",
                                "Representative structures of the compounds of the present invention derived from formulas 1.0, 2.0 and 3.0 are shown in FIG. 11. All these compounds are lacking the required chemistry to undergo ribosylation by bacterial or mammalian enzymes which could lead to broad and non-specific toxicity."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce illustrative compounds of the present invention",
                                "describe structural requirements for binding to guanine riboswitch"
                            ],
                            "num_characters": 1135,
                            "outline_medium": [
                                "describe illustrative compounds of the present invention"
                            ],
                            "outline_short": [
                                "describe illustrative compounds of the present invention"
                            ]
                        },
                        {
                            "title": "EXAMPLE 12",
                            "paragraphs": [
                                "**Effect of Compounds of the Present Invention on the Treatment of Infections**",
                                "In addition to intramammary infections, S. aureus is a pathogen also found in skin and skin structure infections, respiratory tract infections, blood and urine (Garau et al., 2009; Araki et al, 2002; Corey, 2009). Clostridium infections in humans such as those caused by C. difficile, C. botulinum, C. tetani and C. perfringens (Leffler and Lamont, 2009; Khanna, 2008), in poultry by C. perfringens (Van Immerseel et al., 2004) and in pigs are also of importance and the colonization of pigs by MRSA is also a problem linked to human health (Songer and Uzal, 2005; Khanna et al., 2008). The invention can therefore also be used for treatment of a variety of clostridial or staphylococcal infections occurring at body sites other than the mammary glands in animals and in humans."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe potential applications of compounds of the present invention"
                            ],
                            "num_characters": 859,
                            "outline_medium": [
                                "describe effect of compounds on treatment of infections"
                            ],
                            "outline_short": [
                                "describe effect of compounds of the present invention on the treatment of infections"
                            ]
                        },
                        {
                            "title": "EXAMPLE 13",
                            "paragraphs": [
                                "**Aspects Relating to Synthesis of Compounds of the Present Invention**",
                                "Analogue A can be synthesized from chloronitropyrimidine (A1) (Patel et al., 2007). Synthesis of A1 as described by Sircar et al., 1986 to give the precursor aminomercaptopyrimidine (A2). The latter can then be derivatized with ethyl oxoacetate to give the desired product A (R═H). This scheme will allow additional functionalization as well.",
                                "Pyridopyrimidine B can be synthesized following a procedure reported by Urleb et al., 1990 for a similar analogue. Pterin (X═N) is commercially available.",
                                "Oxazole derivative D was synthesized similarly to the synthesis of a methylated analogue (Miller et al, 2002).",
                                "Pyrrole derivative E can be synthesized as described by Taylor and Young, 1995."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe synthesis of compounds of the present invention"
                            ],
                            "num_characters": 764,
                            "outline_medium": [
                                "describe synthesis of compounds of the present invention"
                            ],
                            "outline_short": [
                                "describe aspects relating to synthesis of compounds of the present invention"
                            ]
                        },
                        {
                            "title": "EXAMPLE 14",
                            "paragraphs": [
                                "**Bio-Informatics Search of Guanine Riboswitches.**",
                                "Natural riboswitches contain aptamer domains which are typically very conserved in their sequence and structure given that they must bind cellular metabolites that are conserved through evolution. These aptamer domains exhibit a conserved scaffold of base-paired helices that organize the overall fold of each aptamer. The identities of each base in these helices most often reflect their need to be base-paired but in contrast, the identities of bases that are in direct contact with the bound metabolite are very highly conserved given precise role in the formation of the ligand binding site. Thus, it is possible to define a consensus sequence, representing all possible aptamer sequences, which can be used to perform computational searches in biological sequence databases. For instance, by translating the consensus sequence into an algorithm search, the software RNAmotif™ (Macke et al., 2001) can screen for all aptamer occurrences in the RefSeq™ microbial database (Pruitt et al., 2005). The output of the software gives genomic locations of all aptamer found. There is already a subgroup of aptamer sequences for various riboswitch families that have been retrieved by the scientific community that can be found at the Rfam™ database (Griffiths-Jones et al., 2005), but because it was observed that it is only partially complete, it was found preferable to build a database using RNAmotif™.",
                                "Below is an example of a consensus sequence used for the bioinformatic search. The meaningfulness of the characters and commands described in the consensus are very well described in the original RNAmotif™ article (Macke et al., 2001). This corresponds to possible guanine riboswitches that could adopt a similar structures than the known guanine riboswitch."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce bio-informatics search of guanine riboswitches",
                                "describe consensus sequence used for search",
                                "describe software used for search"
                            ],
                            "num_characters": 1814,
                            "outline_medium": [
                                "describe bio-informatics search of guanine riboswitches"
                            ],
                            "outline_short": [
                                "describe bio-informatics search of guanine riboswitches"
                            ]
                        },
                        {
                            "title": "EXAMPLE 15",
                            "paragraphs": [
                                "**Ability of Compounds of the Invention to Inhibit S. aureus Growth**",
                                "As disclosed herein, the compounds of the present invention (e.g., compounds 1.16, 2.02 and 2.17) (1.16 and 2.17 were purchased from Sigma-Aldrich and Toronto Research Chemical respectively) are able to specifically and selectively inhibit the growth and/or kill bacterial species that possess the guanine riboswitch controlling the expression of guaA such as S. aureus. As reported in Table 6 (below), compounds 1.16, 2.02 and 2.17 are able to bind guanine riboswitch and to inhibit S. aureus growth with a MIC of 0.128, 1.024 and 0.128 mg/mL, respectively.",
                                "The effect of the antibiotic compounds of formula 2.0, including compounds 2.02 and 2.17, on the growth of S. aureus strain ATCC 29213 in vitro in Muller-Hinton cation adjusted media allow to confirm the efficiency of compounds of general formula 2.0 to achieve antibiotic activity. For each compound, antibiotic activity was also tested on E. coli strain ATCC 35695 and no antimicrobial activity of the compounds (1.16, 2.02 and 2.17) was observed. The MICs were determined using the microdilution method in 96-well microplates and the bacteria were incubated at 37° C. for 24 h following inoculation.",
                                "As required, the compounds of Table 6 present no ribosylation site, so this will prevent their incorporation in DNA and their mutagenic potential."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "demonstrate antibiotic activity of compounds",
                                "describe MICs of compounds against S. aureus and E. coli"
                            ],
                            "num_characters": 1381,
                            "outline_medium": [
                                "demonstrate antibiotic activity of compounds of the invention"
                            ],
                            "outline_short": [
                                "demonstrate antibiotic activity of compounds"
                            ]
                        },
                        {
                            "title": "EXAMPLE 16",
                            "paragraphs": [
                                "**5-Formamino-2-amino-4,6-dihydroxypyrimidine**",
                                "Sodium pieces (242 mg, 10.5 mmol) were added to MeOH (20 mL). After all the sodium had reacted, guanidine hydrochloride (1.00 g, 10.5 mmol) was added and the reaction mixture was stirred for 15 min. The reaction mixture was then heated to reflux and during this time, diethylacetamido malonate (2.13 g, 10.5 mmol) was added. After 2 h, more MeOH (20 mL) was added and the reaction mixture was refluxed overnight. The reaction mixture was then cooled to rt, filtered, washed with MeOH and chloroform and dried under vacuum at 50° C. The resulting solid was dissolved in water (25 mL) and was precipitated by the addition of 50% hydrochloric acid. The solution was filtered and the solid was washed with water and acetone and was finally dried under vacuum at 50° C. to afford compound 7 as a white solid (900 mg, 50%). mp>300° C. 1H NMR (300 MHz, D2O) δ (ppm) 8.19 (s, 1H). 13C NMR (75.5 MHz, DMSO-d6) δ (ppm) 174.9, 168.2, 154.5, 92.6, 21.9.",
                                "**5-Amino-6H-oxazolo[5,4-d]pyrimidin-7-one**",
                                "Compound 7 (125 mg, 0.73 mmol) was dissolved in 12 M H2SO4 (1.50 mL) using an ultrasonic bath. The dark yellow solution was stirred at rt overnight. THF (5 mL) was then added at 0° C. to form a yellow precipitate. The mixture was stored at 4° C. for 2 h and was centrifuged to obtain compound 8 as a yellow solid. 1H NMR (300 MHz, DMSO-d6) δ (ppm) 8.71 (br s, 1H), 7.45 (br s, 1H). 13C NMR (75.5 MHz, DMSO-d6) δ (ppm) 158.6, 152.3, 84.2. LRMS (m/z, relative intensity) 137 (MH+—NH3, 100), 153 (MH+, 50), 159 (MNa+—NH3, 90). HRMS calculated for C6H6N4O3: 153.0413, found: 152.9617.",
                                "Although the present invention has been described hereinabove by way of specific embodiments thereof, it can be modified, without departing from the spirit and nature of the subject invention as defined in the appended claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize 5-Formamino-2-amino-4,6-dihydroxypyrimidine",
                                "synthesize 5-Amino-6H-oxazolo[5,4-d]pyrimidin-7-one",
                                "characterize compounds using NMR and MS"
                            ],
                            "num_characters": 1846,
                            "outline_medium": [
                                "synthesize compounds 7 and 8"
                            ],
                            "outline_short": [
                                "synthesize compounds 7 and 8"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A compound of the general formula 1.0,\n\nwherein, when said compound is bound to a guanine riboswitch, R3 may serve as a hydrogen bond acceptor but cannot be ribosylated;\nwherein represents a single or double bond;\nwherein R3 is —N═, —S—, —CH— or —O—;\nwherein R6 is a carbon atom;\nwherein R1, R2, R4 or R5 are identical or different and are independently —NR8-, —CHR8-, ═CR8-, —O(═O)— or —C(═NR8)-;\nwherein R8 is —H, —NH2, —OH, —SH, a halide, fluorine, chlorine, bromine, iodine, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, -substituted or unsubstituted NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—NH2, —NH—SO2—R9, —NHCO2CH2—R9, —NH—OR9, —NH2—R9, —NH—NH—R9, —NHR9, —NH—CH2—R9, or —NH—NH—CH2—R9, wherein R9 is:\n\n\nwherein n is an integer from 1 to 5;\nwherein R10 is —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine or iodine;\nwherein, R7 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR8, ═NR9, —NHCO2CH2—R9, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R9, —NH—OR9, —NH—R9, —NH—NH—R9, —NH—NH—CH2—R9, or —NH—CH2—R9, wherein R8 and R9 are as defined above,\nwith the proviso that the compound is not:\n4-hydroxy-2,5,6-triaminopyrimidine (1.01);\n2,4-diamino-6-hydroxypyrimidine (1.13); or\n4,5-diamino-6-hydroxy-2-mercaptopyrimidine (1.16).",
        "2. A compound of the general formula 2.0,\n\nwherein, when said compound is bound to a guanine riboswitch, R9 may serve as a hydrogen bond donor but cannot be ribosylated;\nwhereinrepresents a single or double bond;\nwherein R3 is —N═, —S—, or —O—;\nwherein R1 or R2 are identical or different and are independently —NR11-, —CHR11-, ═CR11-, —C(═O)— or —C(═NR11)-;\nwherein R11 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, substituted or unsubstituted —NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—N H2, —NH—SO2—R12, —NHCO2CH2—R12, —NH—OR12, —NH2—R12, —NH—NH—R12, —NHR12, —NH—CH2—R12, or —NH—NH—CH2—R12;\nwherein R12 is:\n\n\nwherein n is in integer from 1 to 5;\nwherein R13 is at least one of —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, iodine;\nwherein R4, R5 and R6 are carbon atoms;\nwherein R7 is —═N—, —NH—, —CH2—; —O— or —S—;\nwherein R8 is —CH2, —O—, —S—, —CHR13- or —CR13=, wherein R13 is as defined above;\nwherein R9 is —CH2—; —O—, —S—, or —P(OOH)—, —N═;\nwherein R10 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR11, ═NR12, —NHCO2CH2—R12, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R12, —NH—OR12, —NH—R12, —NH—NH—R12, —NH—NH—CH2—R12, or —NH—CH2—R12;\nwherein R11 and R12 are as defined above,\nwith the proviso that the compound is not: guanine, hypoxanthine, xanthine or 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
        "3. A compound of the general formula 3.0,\n\nwherein, when the compound is bound to a guanine riboswitch, R10 may serve as a hydrogen bond donor but cannot be ribosylated;\nwhereinrepresents a single or double bond;\nwherein R3 is —N═, —S—, or —O—;\nwherein R10 is —N═, —CH2—; —O—, —S—, or —P(OOH)—;\nwherein R1, R2 and R9are identical or different and are independently —NR12-, —CHR12-, ═CR12-, —O(═O)— or —C(═NR12)-;\nwherein R12 is —H, —NH2, —OH, —SH, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, —CH3, —POOH, —SO2alkyl, —SO2aryl, —SH, substituted or unsubstituted alkyl, substituted or unsubstituted alkoxy, substituted or unsubstituted aryl, substituted or unsubstituted aryloxy, substituted or unsubstituted benzyloxy, -substituted or unsubstituted NHalkyl, substituted or unsubstituted —NHalkoxy, substituted or unsubstituted —NHC(O)alkyl, substituted or unsubstituted —NHCO2alkyl, substituted or unsubstituted —NH—NHalkyl, substituted or unsubstituted —NH—NHalkoxy, substituted or unsubstituted —NH—SO2alkyl, —NHC(O)NH2, —NH—NH2, —NH—SO2—R13,—NHCO2CH2—R13, —NH—OR13, —N+H2-R13, —NH—NH—R13, —NHR13, —NH—CH2—R13, or —NH—NH—CH2—R13;\nwherein R13 is:\n\n\nwherein n is an integer from 1 to 5;\nwherein R14 is —H, —NH2, —OH, alkoxy, —N-morpholino, a halide, fluorine, chlorine, bromine, or iodine;\nwherein R4, R5 and R6 are carbon atoms;\nwherein R7 and R8 are identical or different and are independently —CH═N—, —CH2—O—, CH2—S—, or CH2SO2—;\nwherein R11 is ═O, —OH, —SH, —NH2, —CO2H, —CO2-alkyl, —CO2-aryl, —C(O)NH2, -alkoxy, -aryloxy, -benzyloxy, a halide, fluorine, chlorine, bromine, iodine, —NHalkyl, —NHalkoxy, —NHC(O)alkyl, —NHCO2alkyl, ═NR12, ═NR13, —NHCO2CH2—R13, —NHC(O)NH2, —NH—NH2, —NH—NHalkyl, —NH—NHalkoxy, —SO2alkyl, —SO2aryl, —NH—SO2alkyl, —NH—SO2—R13, —NH—OR13, —NH—R13, —NH—NH—R13, —NH—NH—CH2—R13, or —NH—CH2—R13; and\nwherein R12 and R13 are as defined above.",
        "4. The compound of claim 2, wherein:\n(i) R1 is —NH—;\n(ii) R2 is ═CNH2—;\n(iii) R3 is —N═;\n(iv) R7 is —N═ or —S—;\n(v) R8 is —CR13=;\n(vi) R9 is —O— or —N═;\n(vii) R10 is ═O or ═NH; or\n(viii) any combination of (i) to (vii).",
        "5. The compound of claim 2, wherein said compound is of the general formula 2.0a,\n\nwherein R2, R7, R8, R9 and R10 are as defined in claim 2.",
        "6. The compound of claim 5, wherein R2 is ═CNH2—.",
        "7. The compound of claim 5, wherein R7 is —N═ or —S—.",
        "8. The compound of claim 5, wherein R8 is —CR13=.",
        "9. The compound of claim 5, wherein R9 is —O— or —N═.",
        "10. The compound of claim 5, wherein R10 is ═O or ═NH.",
        "11. A compound of the general formula 3.0a,\n\nwherein R2, R7, R10 and R11 are as defined in claim 3.",
        "12. The compound of claim 1, wherein\n(i) R1 is —NH—;\n(ii) R2 is —C(NH2)═ or ═C(SH)—;\n(iii) R3 is —N═;\n(iv) R4 is ═CNH2—;\n(v) R5 is —CH═ or —C(NH2)═;\n(vi) R6 is —C═;\n(vii) R7 is ═NH or ═O; or\n(viii) any combination of (i) to (vii).",
        "13. The compound of claim 1, wherein said compound is of the general formula 1.0a,\n\nwherein R2 and R7 are as defined in claim 1,\nwherein R5 is —CH═ or —C(NH2)═, and wherein R4 is —C(NH2)═.",
        "14. The compound of claim 13, wherein R7 is ═O or ═NH.",
        "15. The compound of claim 13, wherein R2 is —C(NH2)═ or —C(SH)═.",
        "16. A composition comprising the compound defined in claim 1, and\n(a) an antibiotic;\n(b) an antiseptic;\n(c) a disinfectant;\n(d) a diluent;\n(e) an excipient;\n(f) a pharmaceutically acceptable carrier; or\n(g) any combination of (a)-(f).",
        "17. A composition comprising\n(i) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01);\n(ii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16)\n(iii) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or\n(iv) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); and\n(a) an antibiotic;\n(b) an antiseptic;\n(c) a disinfectant;\n(d) a pharmaceutically acceptable carrier; or\n(e) any combination of (a)-(d).",
        "18. The composition of claim 16, wherein said composition is a pharmaceutical composition.",
        "19. A method of preventing or treating a microbial infection in a subject, said method comprising administering to said subject a therapeutically effective amount of a non ribosylable ligand of a guanine riboswitch, wherein said microbial infection is caused by a pathogen bearing the guanine riboswitch, and wherein the guanine riboswitch controls the expression of guaA.",
        "20. The method of claim 19, wherein said non ribosylable ligand of a guanine riboswitch is\n(i) the compound defined in claim 1;\n(ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01);\n(iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16);\n(iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or\n(v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
        "21. The method of claim 19, wherein said subject is an animal.",
        "22. The method of claim 21, wherein said subject is a cow or a human.",
        "23. The method of claim 19, wherein said pathogen is a bacteria belonging to the genus Staphylococcus or Clostridium.",
        "24. The method of claim 23, wherein said bacteria is Staphylococcus aureus, methicillin-resistant Staphylococcus aureus, Staphylococcus epidermidis, Staphylococcus haemolyticus, Clostridium botulinum or Clostridium difficile.",
        "25. The method of claim 19, wherein said infection is a mammary gland infection.",
        "26.-33. (canceled)",
        "34. A method of disinfecting and/or sterilizing an object of a pathogen, said method comprising applying an effective amount of a non ribosylable ligand of a guanine riboswitch to said object, wherein said pathogen bears a guanine riboswitch that controls the expression of guaA.",
        "35. The method of claim 34, wherein said non ribosylable ligand of a guanine riboswitch is\n(i) the compound defined in claim 1;\n(ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01);\n(iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16);\n(iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or\n(v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
        "36. The method of claim 34, wherein said object is an animal or milk.",
        "37-39. (canceled)",
        "40. A method of selecting a pathogen treatable by\n(i) the compound defined in claim 1;\n(ii) 4-hydroxy-2,5,6-triaminopyrimidine(formula 1.01);\n(iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16);\n(iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13);\n(v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); or\n(vi) the composition defined in claim 16,\nsaid method comprising determining whether said pathogen bears a guanine riboswitch that controls the expression of guaA.",
        "41. A method of identifying a compound for preventing or treating a microbial infection caused by a pathogen bearing a guanine riboswitch that controls the expression of guaA, said method comprising contacting a guanine riboswitch with said compound; determining whether said compound binds to said guanine riboswitch; wherein the binding of said compound to said guanine riboswitch is an indication that said compound is suitable for preventing or treating said microbial infection.",
        "42. The method of claim 41, wherein said guanine riboswitch is the guanine xpt riboswitch from Streptococcus pyogenes (STPY-xpt).",
        "43. The method of claim 41, further comprising contacting said guanine riboswitch with guanine or a guanine-like ligand.",
        "44. The method of claim 43, further comprising determining whether said compound may be ribosylated.",
        "45. A method for preventing the development of multi-drug resistance of a bacteria in a subject, or treating a multidrug resistance of a bacteria in the subject said method comprising administering a non ribosylable ligand of a guanine riboswitch to the subject, wherein the bacteria bears a guanine riboswitch that controls the expression of guaA.",
        "46. The method of claim 45, wherein said non ribosylable ligand of a guanine riboswitch is:\n(i) the compound defined in claim 1;\n(ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01);\n(iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16);\n(iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13); or\n(v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17).",
        "47.-49. (canceled)",
        "50. A kit comprising:\n(i) the compound defined in claim 1;\n(ii) 4-hydroxy-2,5,6-triaminopyrimidine (formula 1.01);\n(iii) 4,5-diamino-6-hydroxy-2-mercaptopyrimidine (formula 1.16);\n(iv) 2,4-diamino-6-hydroxypyrimidine (formula 1.13);\n(v) 5-amino-2-chloro-2,3-dihydrothiazolo[4,5]pyrimidine-7-(6H)-one (2.17); or\n(vi) the composition defined in claim 16,\nand instructions to use same in the prevention or treatment of a microbial infection.",
        "51. A method for preparing the compound of formula 2.02\n\nsaid method comprising\n(a) reacting diethylacetamido malonate with guanidine hydrochloride in the presence of sodium methoxide and methanol to obtain a solid;\n(b) dissolving the solid of (a) in an aqueous solution;\n(c) subjecting the solution of (b) to an acidic precipitation to obtain a 5-formamino-2-amino-4,6-dihydroxypyrimidine precipitate;\n(d) dissolving the 5-formamino-2-amino-4,6-dihydroxypyrimidine precipitate in an acid; and\n(e) precipitating the solution of (d) to obtain the compound of formula 2.02.",
        "52. The method of claim 51, wherein said reacting is performed under reflux.",
        "53. The method of claim 51, wherein said acidic precipitation of (b) is performed using a hydrochloric acid (HCl) solution.",
        "54. The method of claim 53, wherein said HCl solution is a 50% HCl solution.",
        "55. The method of claim 51, wherein dissolving of (d) is performed using sulfuric acid.",
        "56. The method of claim 55, wherein said sulfuric acid is 12 M sulfuric acid.",
        "57. The method of claim 51, further comprising washing said solid of (a) with methanol and chloroform.",
        "58. The method of claim 51, wherein said aqueous solution is water.",
        "59. The method of claim 51, wherein said precipitating of (e) is performed using tetrahydrofuran (THF).",
        "60. -70.l (canceled)"
    ]
}