{
    "id": "https://semopenalex.org/work/W2045786048",
    "authors": [
        "Fu Tong Liu",
        "Yoshikazu Takada",
        "Yoko Takada",
        "Kit S. Lam",
        "Chun Yi Wu",
        "Nobuaki Akakura",
        "Jun Saegusa",
        "Zi Ma",
        "Case Hoogland"
    ],
    "title": "Pro-inflammatory Secretory Phospholipase A2 Type IIA Binds to Integrins αvβ3 and α4β1 and Induces Proliferation of Monocytic Cells in an Integrin-dependent Manner",
    "date": "2008-09-01",
    "abstract": "Secretory phospholipase A2 group IIA (sPLA2-IIA) plays an important role in the pathogenesis of inflammatory diseases. Catalytic activity of this enzyme that generates arachidonic acid is a major target for development of anti-inflammatory agents. Independent of its catalytic activity, sPLA2-IIA induces pro-inflammatory signals in a receptor-mediated mechanism (e.g. through the M-type receptor). However, the M-type receptor is species-specific: sPLA2-IIA binds to the M-type receptor in rodents and rabbits, but not in human. Thus sPLA2-IIA receptors in human have not been established. Here we demonstrated that sPLA2-IIA bound to integrin alphavbeta3 at a high affinity (K(D)=2 x 10(-7) M). We identified amino acid residues in sPLA2-IIA (Arg-74 and Arg-100) that are critical for integrin binding using docking simulation and mutagenesis. The integrin-binding site did not include the catalytic center or the M-type receptor-binding site. sPLA2-IIA also bound to alpha4beta1. We showed that sPLA2-IIA competed with VCAM-1 for binding to alpha4beta1, and bound to a site close to those for VCAM-1 and CS-1 in the alpha4 subunit. Wild type and the catalytically inactive H47Q mutant of sPLA2-IIA induced cell proliferation and ERK1/2 activation in monocytic cells, but the integrin binding-defective R74E/R100E mutant did not. This indicates that integrin binding is required, but catalytic activity is not required, for sPLA2-IIA-induced proliferative signaling. These results suggest that integrins alphavbeta3 and alpha4beta1 may serve as receptors for sPLA2-IIA and mediate pro-inflammatory action of sPLA2-IIA, and that integrin-sPLA2-IIA interaction is a novel therapeutic target.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Materials-Recombinant soluble ␣v␤3 was synthesized as previously described (21). CHO cells expressing recombinant ␣v␤3 (designated ␤3-CHO cells) (22), Wt or mutant ␣4 (23), and K562 human erythroleukemia cells that express human ␣4 (␣4-K562) (24) have been described. K562 cells that express human ␣v␤3 (␣v␤3-K562) (25) were provided by Eric Brown (UCSF). Human ␤3 was stably expressed in the CHO pgs745 mutant cells (26) deficient in xylosyltransferase, an essential enzyme in proteoglycan synthesis, as described (22).",
                "Synthesis of sPLA2-IIA-A cDNA fragment encoding sPLA2-IIA was amplified with sPLA2-IIA cDNA (ATCC) as a template using synthetic oligonucleotide primers 5Ј-GAAGATCTA-ATTTGGTGAATTTCCAC-3Ј and 5Ј-GGAATTCTCAG-CAACGAGGGGTGCTCCC-3Ј by PCR. After digestion with BglII and EcoRI, the cDNA fragment was subcloned into the BamHI/EcoRI sites of PET28a/Amp vector. We generated the PET28a/amp vector by replacing the kanamycin-resistant gene of PET28a with the ampicillin-resistant gene of PET21a. We generated sPLA2-IIA as an insoluble protein in bacteria BL21 and purified it by Ni-NTA affinity chromatography under denatured conditions and refolded following the protocols (\"Isolation of proteins from inclusion bodies\" available from the Bjo ¨rkman laboratory). Briefly, purified proteins in 8 M urea were diluted into refolding buffer (100 mM Tris-HCl, pH 8.0, 400 mM L-Arg, 2 mM EDTA, 0.5 mM oxidized glutathione, 5 mM reduced glutathione, and protease inhibitors) and kept for 8 h at 4 °C, and then concentrated by ultrafiltration. The refolded sPLA2-IIA was more than 90% homogeneous in SDS-PAGE. We performed site-directed mutagenesis by QuikChange method (27). The presence of mutations was confirmed by DNA sequencing. To remove endotoxin, we washed the Ni-NTA resin with 1% Triton X-114 before eluting the bound protein. We confirmed that the sPLA2-IIA (Wt and mutants) had no detectable endotoxin as tested by the Limulus amebocyte lysate assay (Fisher Scientific).",
                "Binding of Soluble ␣v␤3 to Immobilized sPLA2-IIA-sPLA2-IIA was immobilized to wells of 96-well microtiter plates and the remaining protein-binding sites were blocked by BSA as described (28). Soluble recombinant ␣v␤3 at 5 g/ml in Hepes-Tyrodes buffer supplemented with 1 mM MnCl 2 was added to the well and incubated for 2 h at room temperature. Bound ␣v␤3 was measured using anti-integrin ␤3 (mAb AV-10) followed by horseradish peroxidase-conjugated goat antimouse IgG and peroxidase substrates.",
                "Binding of FITC-labeled sPLA2-IIA to Integrins on the Cell Surface-sPLA2-IIA was labeled with FITC using fluorescein labeling kit (Pierce) according to the manufacturer's instructions. Cells were harvested with 3.5 mM EDTA in phosphatebuffered saline. Cells were double-labeled with (a) FITC-labeled sPLA2-IIA (10 g/ml in the presence of 10 mM Mg 2ϩ at room temperature for 30 min) and (b) with non-blocking antihuman integrin ␤3 subunit mAb AV10 and PE (phycoerythrin)conjugated secondary antibody. Bound FITC (FL1) and PE (FL2) were quantified in flow cytometry.",
                "Surface Plasmon Resonance Study-Recombinant soluble integrin ␣v␤3 was immobilized to Biacore Sensor chip CM5 (Biacore, Piscataway, NJ) by the standard amine coupling method. 2-fold serially diluted sPLA2-IIA and its mutants R74E/R100E (ranging from 2 nM to 500 pM) and H47Q (ranging from 4 to 1 nM) in running buffer HBS-P buffer containing 1 mM of Mn 2ϩ were injected for 3 min at the flow rate of 50 l/min. Then the sensor chip was washed with the running buffer alone at the same flow rate for another 5 min (the dissociation phase). Two consecutive 1-minute injections of 0.5 M, pH 8 EDTA solution at the same flow rate were used to regenerate the chip for another cycle of injection. The resonance unit elicited from the reference flow cell was subtracted from the resonance unit elicited from the integrin flow cell to eliminate the nonspecific protein-flow cell interaction and the bulk refractive index effect. The recorded binding curves were fitted with the 1:1 binding with drifting baseline model by using the Biaevaluation Version 4.1.",
                "Cell Proliferation and MAP Kinase Activation-K562 cells and human monocytic lymphoma U937 cells were maintained in RPMI1640 medium supplemented with 10% fetal calf serum. Cells were plated in 96-well plates (1 ϫ 10 4 cells/well), and serum-starved for 48 h at 37 °C in 5% CO 2 atmosphere. Cells were then treated with or without sPLA2-IIA in medium without serum for 48 h. Cell proliferation was determined by MTS assays using the Aqueous Cell Proliferation Assay kit (Promega). For MAP kinase activation assays, cells were serumstarved in RPMI1640 medium supplemented with 0.4% fetal calf serum for 24 h, and stimulated with Wt and mutant sPLA2-IIA (0.5 g/ml) for 10 min at 37 °C. ERK1/2 activation was measured as described (28).",
                "Other Methods-We performed docking simulation of interaction between sPLA2-IIA and integrin ␣v␤3 using the AutoDock3 as previously described (28). Adhesion assays were performed as described previously (29). mAb 7E3 was used at 10 g/ml. We assayed PLA2 activity by arachidonoyl-Thio-PC hydrolysis (Cayman Chemicals, Ann Arbor, MI) as described (30)."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS",
            "paragraphs": [
                "sPLA2-IIA Bound to Integrin ␣v␤3-We have previously shown that CHO cells that express human ␤3 (designated ␤3-CHO) bound to several different ligands to ␣v␤3 (e.g. angiostatin (31), cardiotoxin (32), ADAM15 (22), and FGF1 ( 28)) while mock-transfected CHO cells did not. Thus ␤3-CHO cells are useful tools to demonstrate the specific binding of ligands to ␣v␤3. Because sPLA2-IIA binds to proteoglycans we also used the proteoglycan-deficient variants of CHO cells (pgs745) (26) that express human ␤3 (designated as ␤3-745 cells). These cells express ␣v␤3 as a hamster ␣v/human ␤3 hybrid. We found that ␤3-CHO and ␤3-745 cells adhered to immobilized sPLA2-IIA at a much higher level than mocktransfected CHO or 745 cells (Fig. 1a). Consistent with the previous report that proteoglycans support binding of positively charged sPLA2-IIA to the cell surface (34), mock-CHO cells adhered to sPLA2-IIA better than mock-transfected 745 cells. These results suggest that the difference in adhesion between ␤3-CHO and CHO or between ␤3-745 and 745 reflects the integrin ␣v␤3-mediated adhesion to sPLA2-IIA. We found that mAb against human integrin ␤3 subunit (mAb 7E3) effectively reduced the adhesion of ␤3-CHO cells to the background level (from 67 to about 30%) (Fig. 1b), indicating that the adhesion is specific to ␣v␤3. These results indicate that ␣v␤3 mediated cell adhesion to sPLA2-IIA, that proteoglycans partly supported cell adhesion to sPLA2-IIA, consistent with a previous report (18).",
                "Next we tested if soluble sPLA2-IIA binds to cell surface ␣v␤3. We first stained the ␤3-CHO cells for ␤3 expression with anti-␤3 mAb and PE-labeled secondary antibody, and then incubated with FITC-labeled sPLA2-IIA. We selected cell populations that express high or low levels of ␤3 and tested if sPLA2-IIA binding is related to the levels of ␤3 expression in flow cytometry. We found that FITC-sPLA2-IIA bound at much higher levels to cells expressing high level ␣v␤3 (␤3-high) than to cells expressing little ␣v␤3 (␤3-low) (Fig. 1c), indicating the significant contribution of ␣v␤3 in sPLA2-IIA binding. The low level binding of sPLA2-IIA to ␣v␤3-low cells probably represents contribution of proteoglycans and other receptors.",
                "We next demonstrated that recombinant soluble ␣v␤3 bound to immobilized sPLA2-IIA in ELISA-type assays (Fig. 1d). Soluble ␣v␤3 bound to the disintegrin domain of ADAM15, a known ␣v␤3 ligand (22) (as a positive control), but did not significantly bound to BSA (as a negative control). These results indicate that ␣v␤3 directly binds to sPLA2-IIA. We showed that soluble sPLA2-IIA bound to immobilized ␣v␤3 in surface plasmon resonance studies at a high affinity (see below)."
            ],
            "subsections": [
                {
                    "title": "Docking Simulation of Interaction between Integrin and sPLA2-IIA-",
                    "paragraphs": [
                        "To determine how sPLA2-IIA binds to integrin ␣v␤3, we performed docking simulation by using AutoDock 3. AutoDock is a set of docking tools widely used for predicting the conformation of small ligands bound to receptors (35)(36)(37), and the methods has been used to predict protein-protein complex poses (38). We performed 50 dockings, each one starting with a random initial position and orientation of sPLA2-IIA (PDB code 1DCY1 and 1AYP) with respect to the headpiece of ␣v␤3 (PDB code 1L5G). The results were clustered together by positional RMSD (0.5 Å) into families of similar poses. 24 of the (cluster 1) with a docking energy Ϫ26.1 kcal/mol with 1DCY1 and Ϫ25.5 kcal/mol with 1AYP. These results predict that the docking pose of cluster 1 represents the most probable stable sPLA2-IIA pose upon binding to ␣v␤3 (Fig. 2a)). While the poses obtained by using two structures are slightly different, the integrin-binding sites are overlapping. This model predicts that the ␣v␤3 integrin-binding interface of sPLA2-IIA with integrin ␣v␤3 does not include the catalytic center of sPLA2-IIA (e.g. His-47). The interface on the ␣v␤3 side contains several ␣v (green) or ␤3 (red) residues that have been shown to be critical for ligand binding by mutagenesis and crystallographic studies (39 -41). Thus the predicted docking model is consistent with the previous biochemical studies of integrin-ligand interaction.",
                        "Mutagenesis Study of the Predicted Integrin-binding Interface of sPLA2-IIA-To test if the docking model is correct, we introduced several mutations within the predicted interface of sPLA2-IIA with integrin ␣v␤3. Positively charged amino acids at the predicted interface common to 1AYP and 1DCY (Arg-42, Arg-53, Arg-74, and Arg-100) were mutated to Glu (charge reversal mutagenesis) (Fig. 2b). We found that the R74E and R100E mutations in sPLA2-IIA reduced the binding to soluble ␣v␤3, while the R42E and R53E mutations had little or no effect on integrin binding (Fig. 3, a andb). We generated the catalytically inactive mutant of sPLA2-IIA by mutating His-47 to Gln (the H47Q mutation) as a control. The H47Q mutation did not affect the binding to soluble ␣v␤3. These results are consistent with the prediction by docking simulation. The combined R74E/R100E mutation effectively reduced the binding of sPLA2-IIA to soluble ␣v␤3 (Fig. 3b), and was used for further analysis of the role of integrins in sPLA2-IIA signaling.",
                        "We determined binding kinetics of Wt and mutant sPLA2-IIA to ␣v␤3 using surface plasmon resonance (SPR) (Fig. 3c). We immobilized recombinant soluble ␣v␤3 to a sensor chip and monitored the association and dissociation of Wt or mutant sPLA2-IIA in solution with ␣v␤3 on the chip. Wt and H47Q sPLA2-IIA showed high affinity to ␣v␤3 (K D ϭ 2.11 ϫ 10 Ϫ7 M and 4.47 ϫ 10 Ϫ8 M, respectively) and the R74E/R100E mutant showed much lower affinity (K D ϭ 1.08 ϫ 10 Ϫ6 M). This is consistent with the results obtained by ELISA-type binding assays.",
                        "PLA2 activity was measured to confirm that the integrin binding-defective mutation did not affect catalytic activity (Fig. 3d). The data suggest that the H47Q mutation reduced PLA2 activity (while its integrin binding was not affected). In contrast, the R74E/R100E mutation did not affect PLA2 activity (while its integrin binding was suppressed).",
                        "sPLA2-IIA Induced Proliferation of Monocytic Cells in an Integrin-dependent Manner-It has been reported that sPLA2-IIA induced proliferation of LNCap prostate cancer cells in a dose-dependent manner (10) and induced resistance to apoptosis in baby hamster kidney (BHK) cells (42). To address if sPLA2-IIA-integrin interaction is involved in monocyte proliferation, we tested if the integrin binding-defective or catalytically inactive mutations affects sPLA2-IIA's ability to induce proliferative signals in monocytic U937 cells. Notably, we found that Wt sPLA2-IIA and H47Q induced robust proliferation of U937 cells, but R74E/R100E did not (Fig. 4a). These results suggest that integrin binding to sPLA2-IIA plays a critical role in sPLA2-IIA-induced cell proliferation, but catalytic activity is not important in this process. Consistent with this observation, Wt sPLA2-IIA and H47Q induced, but R74E/R100E did not induce, ERK1/2 activation in U937 cells (Fig. 4b). While it has been reported that U937 cells express ␣v␤3 (43), 7E3 did not block adhesion of U937 cells to sPLA2-IIA (not shown), suggesting that other receptors are involved in the binding of sPLA2 to U937 cells. We hypothesized that integrin ␣4␤1, a major integrin in U937 cells (44), may be involved in sPLA2-IIA signaling in U937 cells.",
                        "We tested this hypothesis using K562 cells that express recombinant ␣4␤1 (␣4-K562 cells, ␣4␤1ϩ/␣5␤1ϩ). ␣4-K562 cell adhered to immobilized Wt sPLA2-IIA better than mocktransfected K562 cells (␣5␤1ϩ) (Fig. 5a), suggesting that ␣4␤1 interacts with sPLA2-IIA. We obtained similar results with CHO cells that express human ␣4 (␣4-CHO) and mock-trans- Based on the docking model we introduced mutations in the integrin-binding interface of sPLA2-IIA. The mutant proteins were tested for binding to soluble integrin ␣v␤3. The low level background binding to BSA was subtracted. b, summary of the mutagenesis study of sPLA2-IIA-integrin interaction. The binding of soluble ␣v␤3 to immobilized Wt and mutant sPLA2-IIA was determined at the saturating conditions (20 g/ml coating concentrations). The H47Q mutation is located in the catalytic center of the enzyme. c, the surface plasmon resonance study of sPLA2-IIA binding to ␣v␤3. Soluble integrin ␣v␤3 was immobilized to a sensor chip, and the binding of Wt sPLA2-IIA, and the H47Q and R74E/R100E mutants (concentrations at 2, 1, and 0.5 nM) was analyzed. K D was calculated as 2.11 ϫ 10 Ϫ7 M for Wt sPLA2-IIA, 4.47 ϫ 10 Ϫ8 M for H47Q, and 1.08 ϫ 10 Ϫ6 M for R74E/R100E. d, effect of sPLA2-IIA mutations on PLA2 activity. PLA2 activity was measured as described under \"Experimental Procedures.\" A similar result was obtained from another independent experiment.",
                        "fected CHO cells (Fig. 5c), suggesting that the observation is not cell-specific. However, a small molecular weight ␣4␤1 ligand (LLP2A) (45) or anti-␣4 mAb SG73 or P4C2 (23) did not block ␣4␤1 binding to sPLA2-IIA in transfected K562 cells (data not shown). To confirm that sPLA2-IIA binds to ␣4␤1, we tested if sPLA2-IIA competes with known ␣4␤1-specific ligand such as VCAM-1 for binding to ␣4␤1. We found that sPLA2-IIA suppressed ␣4␤1-mediated adhesion of U937 cells to VCAM-1 (Fig. 5b), whereas sPLA2-IIA did not suppress cell adhesion to ␣5␤1-specific ligand fibronectin domains 8 -11. This suggests that sPLA2-IIA competed with VCAM-1 for binding to ␣4␤1.",
                        "To confirm that sPLA2-IIA binds to ␣4␤1, we mapped the sPLA2-IIA-binding site in the ␣4 subunit. We previously identified several amino acid residues in the ␣4 subunit (e.g. Tyr-187 and Gly-190) that are critical for VCAM-1 and CS-1 binding (23) and for binding of LLP2A (45) to ␣4 by introducing point mutations in the ␣4 subunit. These amino acid residues are located within the ligand-binding site of integrins (46). We tested if these ␣4 mutations affect sPLA2-IIA binding to ␣4␤1 using CHO cells that express Wt or mutant human ␣4 as a human ␣4/hamster ␤1 hybrid (23). We found that mutating Tyr-189 and Gly-190 of ␣4 to Ala blocked binding to sPLA2-IIA (Fig. 5c), suggesting that sPLA2-IIA-binding site in ␣4 is close to or overlaps with the VCMA-1 or CS-1 binding sites. We obtained similar results using K562 cells that express the ␣4 mutants (data not shown). These findings are consistent with the observation that sPLA2-IIA and VCAM-1 competed for binding to ␣4␤1.",
                        "To test if ␣v␤3 and ␣4␤1 individually mediate sPLA2-IIAinduced cell proliferation, we used K562 cells that overexpress ␣v␤3 or ␣4␤1 (␣v␤3-and ␣4-K562 cells, respectively). sPLA2-IIA induced proliferation of ␣4-K562 cells, and to a less extent, of ␣v␤3-K562 cells. sPLA2-IIA did not induce proliferation of mock-transfected K562 cells (Fig. 6a). Consistent with the results with U937 cells, H47Q induced proliferation of ␣v␤3and ␣4-K562 cells, but R74E/R100E did not induce proliferation of ␣v␤3or ␣4-K562 (Fig. 6b). These results suggest that sPLA2-IIA-induced proliferation of K562 cells required the binding of sPLA2-IIA to ␣4␤1 or ␣v␤3, but did not require catalytic activity of sPLA2-IIA."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "The present study establishes for the first time that human sPLA2-IIA specifically bound to integrin ␣v␤3 at a high affinity (K D 2 ϫ 10 Ϫ7 M). Using docking simulation and mutagenesis, we developed an integrin binding-defective mutation of sPLA2-IIA (the R74E/R100E mutation) that effectively reduced ␣v␤3 binding without affecting catalytic activity. In contrast the H47Q mutation destroyed catalytic activity, but not reduce ␣v␤3 binding. SPR studies showed that the R74E/R100E mutation markedly reduced the binding affinity ␣v␤3, but the H47Q mutant did not. These results are consistent with the prediction from the simulation, and that the integrin-binding site is distinct from the catalytic center or the M-type receptorbinding site, in which Gly-30 and Asp-49 of sPLA2-IIA are involved (47).",
                "Integrin ␣v␤3 is a ubiquitous receptor that is expressed on a variety of cell types (48,49). Consistent with its expression profile in vivo, ␣v␤3 plays a key role in the initiation or progression of several human diseases, including rheumatoid arthritis, cancer, and ocular diseases, and cardiovascular diseases (48,49). Endothelial cells are primary targets in angiogenesis in chronic inflammation and cancer, and activated endothelial cells express high levels of ␣v␤3 (48). Macrophages represent a major mononuclear cell population in inflammation (50), and macrophages express high level ␣v␤3. Its expression is modulated by several cytokines (e.g. interleukin-4, tumor necrosis factor-␣) and growth factors (e.g. platelet-derived growth factor, fibroblast growth factor). ␣v␤3 is consistently detected on the macrophages in early and advanced human atherosclerotic lesions, and its expression is up-regulated by atherogenic stimuli (oxidized low-density lipoprotein, macrophage colonystimulating factor) in vitro (50). These reports suggest that sPLA2-IIA and ␣v␤3 co-exist in the inflammatory lesion and directly connect the pro-inflammatory action of sPLA2-IIA and ␣v␤3, the newly identified receptor of sPLA2-IIA.",
                "We also presented evidence that ␣4␤1 that is widely expressed in immunocompetent cells (19) mediated sPLA2-IIA binding using cells that express recombinant ␣4. Although mAbs or small molecular weight ligand tested against ␣4 did not significantly inhibit ␣4␤1-sPLA2-IIA interaction, we showed that sPLA2-IIA competed with VCAM-1 for binding to ␣4␤1. Also, amino acid residues within the ligand-binding site of ␣4 (Tyr-189 and Gly-190) that are critical, or close to the critical residues, for VCAM-1 and CS-1 binding were also critical for sPLA2-IIA binding. These findings suggest that sPLA2- b, sPLA2-IIA blocked adhesion of U937 cells to VCAM-1, but did not block adhesion of U937 cells to the cell-binding domain of fibronectin. Wells of 96-well microtiter plate were coated with VCAM-1 and FN-GST, and incubated with U937 cells (1 ϫ 10 4 cells/plate) in the presence of the increasing concentrations of sPLA2-IIA for 1 h at 37 °C. Adherent cells were quantified using endogenous phosphatase after gently rinsing the well to remove unbound cells. Data are shown as means Ϯ S.E. of triplicate experiments. *, p ϭ 0.0101 and **, p Ͻ 0.0001 by Student's t test. c, amino acid sequence in the ␣4 subunit that is critical for VCAM-1 and CS-1 binding is also critical for sPLA2-IIA binding. CHO cells that clonally express Wt or mutant ␣4 (23) were used for adhesion assays. Data are shown as means Ϯ S.E. of triplicate experiments. Similar results were obtained using K562 cells expressing ␣4 mutants (not shown). IIA binds to ␣4␤1 in a ligand-binding site common to those for other known ␣4␤1 ligands.",
                "We showed that Wt sPLA2-IIA and H47Q induced proliferation and ERK1/2 activation in U937 cells (␣v␤3ϩ, ␣4␤1ϩ), while R74E/R100E did not, suggesting that sPLA2-IIA induced proliferative signals of monocytic cells in an integrin-dependent manner. These observations directly connect the pro-inflammatory functions of sPLA2-IIA and integrins. Although relative contribution of ␣4␤1 and ␣v␤3 in sPLA2-IIA-induced proliferative signals in U937 cells is unclear, we showed ␣4␤1 and to a less extent ␣v␤3 can individually mediate cell proliferation using ␣v␤3and ␣4-K562 cells. In both cases sPLA2-IIA induced cell proliferation in an integrin-dependent and catalytic activity-independent manner. Because K562 cells have very low proteoglycans (51), the effect of sPLA2 binding to proteoglycans is not important in this cell type.",
                "It has been reported that specific inhibitors of sPLA2-IIA catalytic activity S-5920/LY315920Na and S-3013/LY333013 failed to demonstrate a significant therapeutic effect in rheumatoid arthritis (52) and asthma (53). The present results suggest that sPLA2-IIA-integrin interaction is a novel potential therapeutic target in inflammation. Because anti-␣4 antibodies we used and a small molecular weight ␣4 ligand (LLP2A) did not block ␣4␤1-sPLA2-IIA interaction, we were not able to directly test the role of sPLA2-IIA-␣4␤1 interaction in inflammation. Function-blocking antibodies against integrins (including ␣4␤1) have been selected for inhibition of cell adhesion to large extracellular matrix proteins (such as fibronectin). Because sPLA2-IIA is a small ligand, it is not surprising that the antibodies against ␣4 did not effectively block sPLA2-IIA-␣4␤1 binding. We will need to develop anti-␣4 antibodies that block sPLA2-IIA binding to ␣4␤1. Also, the docking simulation predicted that sPLA2-IIA will not occupy the RGD motif-binding site between the ␣ and ␤ subunits. This will probably explain why LLP2A did not block ␣4␤1-sPLA2-IIA interaction, because LLP2A is expected to bind to the LDV motif (which is related to RGD) binding site in ␣4␤1 (45). It would be important to develop antagonists that effectively block this interaction to fully evaluate the significance of this interaction in future studies."
            ],
            "subsections": []
        }
    ]
}