{
    "id": "https://semopenalex.org/work/W3170744429",
    "authors": [
        "Tse Nga Ng",
        "Jason D. Azoulay",
        "Naresh Eedugurala",
        "Lifeng Huang",
        "Jarrett H. Vella",
        "Kevin S. Mayer"
    ],
    "title": "Broadband infrared photodetection using a narrow bandgap conjugated polymer",
    "date": "2021-06-11",
    "abstract": "A conjugated polymer semiconductor enables room temperature infrared photodetection from the short- to long-wave infrared.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "The detection of infrared (IR) light forms the foundation for modern industrial, scientific, energy, medical, and defense applications. Inorganic semiconductors spanning different wavelength () regimes and complex manufacturing systems are the basis for technologies operating beyond the cutoff of silicon ( c ~ 1.1 m). State-of-the-art IR photodetectors are often diodes based off of III-V semiconductors; for example, indium gallium arsenide (InGaAs) covers up to  = 2.4 m in the shortwave IR (SWIR;  = 1 to 3 m); indium antimonide (InSb), the midwave IR (MWIR;  = 3 to 5 m); and mercury cadmium telluride (HgCdTe), the longwave IR (LWIR;  = 8 to 14 m) (1). These detectors are fabricated using high-temperature epitaxial growth and suffer from limited modularity and intrinsic fragility, generally require cryogenic cooling, and are incompatible with complementary metal-oxide semiconductor (CMOS) technologies (2)(3)(4). Similar constraints are associated with other mature technologies such as doped heterostructures of III-V semiconductors, quantum wells, and type-II superlattices (5,6). There remains a need for new semiconductors with figures of merit similar to III-V materials, but that also provide substantial cost reductions, scalable fabrication, heterogeneous integration, geometric forms, and mechanical properties that are not available using current technologies.",
                "Consequently, alternative materials have long been researched, such as various allotropes of carbon (7), graphene (8), other twodimensional (2D) materials (9,10), transition metal dichalcogenides, black arsenic phosphorus (b-AsP) (11), and solution-processable conjugated polymers (CPs), colloidal quantum dots (CQDs), and metalhalide perovskites (MHPs) (12)(13)(14)(15)(16)(17)(18). In general, the long-wavelength operation of solution-processable materials such as CPs and MHPs is limited to the near IR (NIR), while other colloidal materials such as CQDs progress further into the IR (19). These materials have enabled tremendous advancements that overcome classical photodetection limitations. For example, solution-processed PbS CQDs operating at 1.3 m show higher specific detectivities (D*) at room temperature than cooled epitaxial devices that results from a large photoconductive gain (20), while ambient temperature MWIR-LWIR operation has been demonstrated using b-AsP ( = 3 to 8.05 m) (11) and PdSe 2 (up to 10.6 m) (21). However, several challenges remain to facilitate the technical maturation and practical application of alternative narrow bandgap materials such as high dark current and noise levels, low light absorption, chemical instability, and complex manufacturing approaches. Thus, cooled epitaxial semiconductors remain the dominant technology throughout the SWIR-LWIR spectral regions.",
                "The realization of narrow bandgap semiconductors with strong IR absorption, appropriate electronic properties, solution-processability, and stability continues to remain a considerable challenge, and organic materials that offer alternatives to inorganics and graphene have yet to be found. While CPs offer the most versatility in terms of their ease of processing, scalability, cost, and structural tunability, the spectral ranges in which they operate remain limited. State-ofthe-art polymer photodetectors composed of photodiodes and phototransistors largely operate in the visible to NIR ( = 0.4 to 1 m) (12-16, 22, 23). There are a few studies partially extending CPs into the SWIR that combine NIR bandgaps with low-energy absorption tails, or studies that alter the density of states in donor-acceptor (DA) blends (24)(25)(26)(27). A smaller number of studies describe organicbased MWIR photodetectors such as a CQD-polymer hybrid (28) and composite of poly(3,4-ethylenedioxythiophene)-poly(4styrenesulfonate) and graphene (29); however, the CQD and graphene are responsible for the longer wavelength photoresponse. Organic materials have also been applied in thermal detectors such as graphenebased bolometers (30) and polymer-based pyroelectric detectors, albeit with much lower response speeds (31).",
                "Despite a vast body of knowledge and practice, controlling the bandgaps of CPs at very low energies remains a considerable challenge owing to an absence of design rules that connect chemical, electronic, and structural heterogeneities with the degree of electronic correlation and energetic disorder in these materials. Moreover, current organic photodiode strategies are unlikely to result in a useful IR response by virtue of their high nonradiative recombination rates (23,32). While most CPs exhibit closed-shell structures that ",
                "accommodate their -electrons in bonding orbitals, recent reports have demonstrated that DA copolymers with extensive -delocalization, quinoidal character, and very narrow bandgaps show open-shell electronic structures. The rich behavior of these materials emanates from the collective properties of -electrons along the conjugated backbone and diminished intramolecular electron pairing, which enables new applications (33)(34)(35)(36). The recent development of highspin DA CPs has produced polymers with electronic bandgaps in the SWIR-MWIR with absorption extending well into the LWIR (34,35). Here, we demonstrate the first example of a photoconductive detector that uses an open-shell DA CP active layer that senses SWIR, MWIR, and LWIR photons."
            ],
            "subsections": [
                {
                    "title": "RESULTS",
                    "paragraphs": [
                        "Figure 1A displays the copolymer used in this study. We previously demonstrated that DA CPs based on alternating cyclopentadithiophenethiadiazoloquinoxaline (TQ) frameworks give rise to high-spin ground states, very narrow optical bandgaps (0.2 eV < E g opt < 1 eV), intrinsic electrical conductivities () that range from ~10 -6 to 8 S cm -1 , and robust stability emanating from strong electronic correlations and extensive -delocalization (34,35). This motivated our development of poly(4-(4,4-dimethyl-4H-cyclopenta[2,1-b:3,4-b′]dithiophen-2-yl)-6,7-bis(5-hexadecylthiophen-2-yl)-[1,2,5]thiadiazolo[3,4-g]quinoxaline), a neutral high-spin DA CP in which macromolecular structure and electronic topology coalesce to afford a very narrow E g opt of < 0.10 eV. The polymer was synthesized using a microwave-assisted Stille cross-coupling copolymerization (see the Supplementary Materials). A salient design feature is a TQ acceptor in which ancillary thiophene substituents enable a further modification of the frontier orbital energetics and strategic positioning of solubilizing -C 16 H 33 side chains. This serves to minimize backbone torsion and promote a high degree of electronic coherence along the -conjugated backbone (fig. S5). Variable-temperature electron paramagnetic resonance spectroscopy demonstrates that the polymer exhibits a singlet-triplet energy splitting (E ST ) of 9.15 × 10 -3 kcal mol -1 and exchange coupling coefficient (J) of 1.60 cm -1 (fig. S6). Thus, the polymer has ferromagnetically coupled spins (J > 0, parallel) and a E ST that allows for thermal population of a nearly degenerate low-spin state with antiferromagnetic interactions between -electrons (Fig. 1A). The value of ∆E ST means that approximately 75% of spins (Boltzmann population ratio of 0.98) occupy the lower-energy, triply degenerate (high-spin) manifold at room temperature.",
                        "The extensive -conjugation is evident from a bandgap that is among the lowest obtained for conjugated organic materials and the lowest for a solution-processable material. The polymer thin film demonstrates an absorption maximum ( max ) of 1.67 m and an electronic absorption tail extending throughout the MWIR-LWIR, in which vibrational features are superimposed (Fig. 1B). Fourier transform IR (FTIR) spectroscopy is consistent with an E g opt < 0.10 eV as estimated from the absorption onset of the thin film (fig. S5). The offset from unity transmission of 46 to 63% in the MWIR and 68 to 76% in the LWIR is far stronger than monolayer graphene in these spectral regions (8). Charge transport measurements show linear currentvoltage (I-V) characteristics, consistent with  = 9.72 × 10 -5 S cm -1 in the absence of dopants (fig. S7). The ohmic transport can be associated with the low energetic barrier for thermal excitation of free carriers, as in other photoresponsive narrow bandgap semiconductors, along with extensive spin and -delocalization (34).",
                        "These properties were leveraged to realize a photoconductive detector, wherein absorption in the active layer generates additional charge carriers, which, under the action of an external DC bias, drift to the appropriate electrodes and generate a measurable change in current. The detector active area is schematically depicted in Fig. 2A as a capacitor in parallel with a variable resistor. A load resistor is in series with the detector, which represents the resistance of the external measurement circuitry. Figure 2B depicts a cross section of the proof-of-concept detector. The device consists of prepatterned gold electrodes separated by a 60 m × 1 mm spacing that acts as the detector active area with a transmission line leading away from each electrode. The polymer was spin-coated onto the detector structure, followed by active area encapsulation with a 100 nm amorphous alumina film that is largely transparent throughout the SWIR and MWIR, with only slight LWIR attenuation (Fig. 1B). The detector was then mounted in a ceramic leadless chip carrier (LCC; Fig. 2C), with gold wire bonds connecting the LCC to the chip.",
                        "We initially examined devices with films of varying thicknesses of 76 and 1078 nm. Conductivity measurements of the thinner film showed  = 9.72 × 10 -5 S cm -1 , while  increased to 5.68 × 10 -3 S cm -1 in the thicker film (fig. S7), consistent with differences in processing conditions (see the Supplementary Materials). Under an applied DC bias of +5 V, the dark current of the fully packaged detector changed from 30 ",
                        "related CPs and open-shell conductors (34,(37)(38)(39). Aggregation in the thicker film increases long-range polymer ordering resulting in a more highly conductive film (34). The decreased resistance allows more charge carriers generated by Johnson, generationrecombination (G-R), and 1/f mechanisms to be collected (2). While high-dark current noise is a major challenge for modern narrow bandgap semiconductors, these results point toward the potential for substantial optimization because electronic properties and noise characteristics can be modified using various solution-processing techniques and diverse fabrication approaches. For example, possible optimization routes include identifying a more ohmic contact to reduce 1/f noise and establishing improved processing approaches to minimize defects and charge traps to reduce G-R noise (14)(15)(16)(17).",
                        "Photocurrents of thin-film (76 nm) detectors were measured by illuminating the detector with a 1000 °C, chopped cavity blackbody radiator (2). The blackbody temperature and emission spectrum were chosen to overlap as much as possible with the polymer absorption (Fig. 1B). The calculated radiant exitance features a maximum intensity at  = 2.29 m, compared with an absorption maximum centered at  = 1.67 m for the polymer. Measurements were made without an optical bandpass filter in front of the blackbody (broadband) along with SWIR ( = 1 to 3 m), MWIR ( = 3 to 5 m), and LWIR filters ( = 8 to 12 m). Photocurrent-voltage curves for all four spectral regions were linear and relatively symmetric about 0 V, indicating that the material is acting as a resistor, consistent with a photoconductive detection mechanism. Photocurrents of 31.97, 14.21, 5.24, and 4.48 pA were obtained at +5 V for broadband, SWIR, MWIR, and LWIR illumination, respectively (Fig. 2D).",
                        "The photocurrent data can be converted to responsivity (Fig. 3A) at a fixed bias level by dividing it by the blackbody power in each spectral region. The actual power irradiating the detector is obtained through numerical integration of the calculated blackbody spectrum and is ultimately a function of detector area and distance from the source (solid angle), spectral bandpass filter used, and a form factor that relates the size of the blackbody aperture with the size of the openings in the chopper wheel (2) (see the Supplementary Materials). The broadband power incident on the detector is 4.89 nW, and the SWIR, MWIR, and LWIR power is 2.17, 1.55, and 0.255 nW, respectively. At +5 V, responsivities of 6.47, 6.33, 3.88, and 15.3 mA W -1 were calculated for broadband, SWIR, MWIR, and LWIR regions, respectively. Noise equivalent power (NEP) describes the optical power incident on the detector to give a signal-to-noise ratio of 1 with a 1-Hz bandwidth. The NEP is calculated by dividing the dark current by responsivity. For broadband, SWIR, MWIR, and LWIR regions, NEP = 72.4, 68.1, 104, and 24.3 nW Hz -1/2 , respectively. Repeated measurements of the device showed no discernible changes in photocurrent over the course of 1 year (fig. S8).",
                        "An important figure of merit is the specific detectivity, D*, which allows a comparison of performance between different detector technologies. Photoconductive detectors can be limited either by Johnson noise, the Johnson noise limited (JOLI) case (Eq. 1), or background irradiation, the background-limited infrared photodetection (BLIP) condition (Eq. 2) (2). Johnson noise is a noise current induced by the thermal motion of charge carriers in resistive materials. It becomes the limiting noise process when all other noise mechanisms in a photoconductive detector have been minimized and can  ",
                        "be reduced by cooling. JOLI D* for a photoconductive detector is defined as",
                        "where  is the detector external quantum efficiency,  is the wavelength, q e is the elementary charge, h is the Planck's constant, c is the speed of light, G is the detector gain, R eq is the detector equivalent resistance, A d is the detector area, k is the Boltzmann constant, and T d is the detector temperature.",
                        "The BLIP condition occurs when the limiting noise is determined by fluctuations in the generation and recombination of charge carriers. The background-limited D* is strongly affected by the incident background irradiance (E bkg )",
                        "For an extremely broadband photodetector such as the one described here, the limiting noise mechanism, and thus D*, can conceivably shift depending on the region of operation. When using a blackbody radiator to characterize a detector, spectral D* for both cases is calculated using a blackbody-to-spectral conversion factor u, which relates the detector responsivity (ℜ) at a given cutoff wavelength ( c ), to its response under irradiation by a blackbody of temperature",
                        "It is essentially the ratio of the total photon exitance of a blackbody at a given temperature to its spectral exitance M q (,T) up to  c, where  defines the Stefan-Boltzmann constant in Eq. 3 (2,40).",
                        "JOLI-and BLIP-limited D* were calculated from the responsivity data with u as a spectral conversion factor (Fig. 3B). In the SWIR, detectivity is limited by Johnson noise (D* = 7.53 × 10 10 to 1.03 × 10 10 Jones). The MWIR region featured a crossover point at  = 3.60 m, where the limiting noise mechanism changed to BLIP (D* = 3.21 × 10 9 to 2.10 × 10 9 Jones). LWIR detectivity was BLIP limited as well, with D* = 2.10 × 10 9 to 4.34 × 10 9 Jones. This trend-JOLI-limited SWIR, BLIP-limited MWIR, and LWIR-is reasonable. The emission spectrum of a 1000 °C blackbody radiator is primarily located in the SWIR, while a room temperature blackbody radiates principally in the LWIR. The MWIR transitions from a spectrum dominated by a higher temperature blackbody to a room temperature blackbody.",
                        "The response speed and -3 dB electrical bandwidth are important figures of merit for photoconductors. The I-V phase angle was 0°, preventing resistance-capacitance time constant measurements. Instead, the detector rise time ( r ) was calculated from the detector impulse response using a femtosecond laser operating at 1.55 m. The laser pulse width of 150 fs is much faster than any detector can respond, allowing a direct calculation of  r . The photocurrent transients in the polymer are coincident with the laser pulses and repeatable over many cycles (Fig. 3C). Expansion of one of these transients (Fig. 3D) enables calculation of the 10 to 90%  r of 115 s. This gives an optically measured bandwidth of 1.5 kHz following f = (2 r ) -1 . Fitting the impulse response decay with a single exponential gives a relaxation time of 109 s. Applying a fast Fourier transform to the optical impulse response gives the photocurrent frequency spectrum (Fig. 3D). The frequency at which the responsivity decreases by -3 dB is 1.6 kHz, which agrees closely with the optically measured bandwidth. Because sample heating through electronphonon collisions occurs over picoseconds, the 150 fs pulse width of the laser precludes any heating of the sample. If the detector had a purely thermal response such as the one obtained through a bolometric mechanism, these measurements would not have produced any meaningful impulse response. This work demonstrates the first example of broadband IR photodetection using a DA CP in spectral regions, which organic materials outside of graphene have failed to access. This material platform provides robust stability, control of the bandgap at very low energies, facile synthetic tuning of optoelectronic properties, solution processability, and room temperature operation-properties that are not synergistically achievable from other semiconductors. These attributes, along with the inherent simplicity of detector fabrication, provide an alternative means to transduce IR photons and enable fundamentally new device technologies."
                    ],
                    "subsections": []
                },
                {
                    "title": "MATERIALS AND METHODS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Photoconductor fabrication",
                            "paragraphs": [
                                "Synthetic quartz-coated glass substrates were sequentially cleaned using 2% Hellmanex detergent in deionized (DI) water, DI water, acetone, and isopropyl alcohol for 10 min using sonication, followed by drying in an oven. The substrates were then treated in a UV-ozone cleaner for 30 min. Gold electrodes (60 nm) were thermally evaporated at 1 × 10 -7 torr using a shadow mask. The electrodes were separated by a 60 m × 1 mm spacing that acts as the detector active area with a transmission line leading away from each electrode as shown in Fig. 2C. The polymer was dissolved in chloroform at 58°C to make a solution of 10 mg ml -1 in a nitrogen atmosphere. The polymer solution was spin-coated onto the substrate at 1000 rpm for 60 s, resulting in a 76 nm thick film. Next, another shadow mask was placed over the center of the substrate, followed by deposition of 100 nm alumina at 1 × 10 -7 torr over the center of the detector (layer d in Fig. 2C) using electron beam evaporation."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Device characterization",
                            "paragraphs": [
                                "The detector chip was mounted in a ceramic LCC. Ultrasonically extruded, gold wires connected the gold contact pads on the chip to the LCC leads. The LCC was then mounted in a custom-designed, printed circuit board (PCB). For responsivity measurements, the detector was illuminated with a cavity blackbody radiator (Santa Barbara Infrared Inc.) at 1000 °C equipped with a mechanical chopper. The PCB was connected by way of triaxial cables to a low-noise current preamplifier (SR570, Stanford Research Systems) and lock-in amplifier (SR830, Stanford Research Systems). Data acquisition was computer-controlled using a custom written program. A Spectra-Physics Solstice femtosecond laser (1-kHz repetition rate, 90 fs pulse width, 800 nm) was used to pump a TOPAS optical parametric amplifier to produce a wavelength of 1550 nm with a pulse width of 150 fs and a repetition rate of 1 kHz. A pair of linear polarizers was used to control the laser power. The photocurrent was routed by way of triaxial cables to an SR570 current preamplifier and voltage amplifier (SR560, Stanford Research Systems) and then finally to a 300 MHz digitizing oscilloscope (Tektronix DPO3034). Electrical phase angle measurements were made using an Agilent E4980 LCR meter."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "SUPPLEMENTARY MATERIALS",
            "paragraphs": [
                "Supplementary material for this article is available at http://advances.sciencemag.org/cgi/ content/full/7/24/eabg2418/DC1  "
            ],
            "subsections": []
        }
    ]
}