{
    "id": "https://semopenalex.org/work/W2788514052",
    "authors": [
        "Kensuke Nakamura",
        "Takeshi Honda",
        "Jun Hasegawa",
        "Mitsuhiro Iwamoto",
        "Yukiko Sekiguchi",
        "Yoshirou Kawaguchi"
    ],
    "title": "Generation of efficient mutants of endoglycosidase from Streptococcus pyogenes and their application in a novel one-pot transglycosylation reaction for antibody modification",
    "date": "2018-02-23",
    "abstract": "The fine structures of Fc N-glycan modulate the biological functions and physicochemical properties of antibodies. By remodeling N-glycan to obtain a homogeneous glycoform or chemically modified glycan, antibody characteristics can be controlled or modified. Such remodeling can be achieved by transglycosylation reactions using a mutant of endoglycosidase from Streptococcus pyogenes (Endo-S) and glycan oxazoline. In this study, we generated improved mutants of Endo-S by introducing additional mutations to the D233Q mutant. Notably, Endo-S D233Q/Q303L, D233Q/E350Q, and several other mutations resulted in transglycosylation efficiencies exceeding 90%, with a single-digit donor-to-substrate ratio of five, and D233Q/Y402F/D405A and several other mutations resulted in slightly reduced transglycosylation efficiencies accompanied by no detectable hydrolysis activity for 48 h. We further demonstrated that the combined use of mutants of Endo-S with Endo-M or Endo-CC, endoglycosidases from Mucor hiemalis and Coprinopsis cinerea, enables one-pot transglycosylation from sialoglycopeptide to antibodies. This novel reaction enables glycosylation remodeling of antibodies, without the chemical synthesis of oxazoline in advance or in situ.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Antibodies are major components of humoral immunity that protect the host from infection by specifically binding to pathogens. IgG, the most common antibody found in the circulation, contributes to host defense via several mechanisms, including complement-dependent cytotoxicity [1–5] and antibody-dependent cell-mediated cytotoxicity [6–9], and the extent of these contributions are significantly influenced by the glycoform of the conserved N-linked glycan in the Fc region. In an effort to improve the efficacy and safety of recombinant monoclonal antibody therapeutics, various expression systems have been genetically engineered to produce antibodies with desired glycoforms [10–12]. These systems would also be useful in the production of site-specific antibody–drug conjugates based on glyco-conjugation, which requires a homogeneous glycan for chemical modification [13].",
                "In vitro chemoenzymatic remodeling is a promising method that enables high uniformity and precise control over the glycoform by the transfer of oligosaccharide oxazolines using endo-β-N-acetylglucosaminidase (ENGase) [14,15]. Endo-S, an ENGase from Streptococcus pyogenes that selectively hydrolyzes the chitobiose core of the N-linked complex-type glycan of IgG, has been engineered [16–18] and used for the production of antibodies with homogeneous glycoforms to study effects on biological activity [19–21]. However, the large-scale application of this method is hampered by the need for highly active oxazoline at high quantities relative to the antibody owing to the residual hydrolysis activity of the enzyme toward the reaction product.",
                "In this paper, we describe improved mutants of Endo-S that enable efficient transglycosylation using a reduced concentration of oxazoline; the mutants were obtained by site-directed mutagenesis based on structural information and methods adapted from studies of various ENGases [17,22–26]. Further, we describe a novel one-pot reaction to transfer the glycan moiety of sialoglycopeptide (SGP) to antibodies using combinations of mutants of Endo-S and auxiliary ENGase—the mutant of Endo-M from Mucor hiemalis [24] or Endo-CC from Coprinopsis cinerea [27]. Auxiliary ENGases show activities toward complex-type glycans, but not toward core-fucosylated glycans, unlike Endo-S. Using a combination of ENGases with varying specificities, antibody glycosylation was successfully remodeled without the chemical synthesis of oxazoline."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Design And Generation Of Endo-S Mutants",
                    "paragraphs": [
                        "Huang and coworkers have previously identified the Endo-S D233Q and E235A mutants by targeting residues responsible for promoting oxazolinium ion formation by a substrate-assisted mechanism [17]. Additionally, Parson and coworkers independently identified mutations at Q303 and Y305 that assist substrate-binding, but did not find an improved mutant [28]. We targeted a slightly broader region, including other possible residues that may assist substrate-binding or acceptor-binding with substitutions that alter size, charge, or hydrophobicity based on a sequence alignment and the crystal structure of the Endo-S reported by Trastoy and coworkers [29]. Importantly, we introduced most mutations in addition to the D233Q mutation in a successive manner, producing over 120 mutants, including triple and quadruple mutants (S1 Table). The bacterial expression of the mutants yielded comparable protein levels to that of wild-type Endo-S under the same expression and purification conditions."
                    ],
                    "subsections": []
                },
                {
                    "title": "Hydrolysis And Transglycosylation Activity Of Endo-S Mutants",
                    "paragraphs": [
                        "While none of the single mutants of Endo-S displayed improvements over the D233Q mutant, a number of multiple mutants exhibited a reduced hydrolysis efficiency, while retaining a comparable or improved transglycosylation efficiency (S2 Table). The Q303L, E350Q, or D405A mutation combined with D233Q resulted in a slight reduction in hydrolysis efficiency (Fig 1A) and improved maximum transglycosylation efficiency (Fig 1B). Notably, the D233Q/Q303L mutant achieved 96% efficiency at 24 h, with a much slower product hydrolysis phase compared to that of the D233Q mutant (Fig 1B). The D233Q/D405A mutant showed a faster transglycosylation rate, reaching 78% at 2 h, and lower hydrolysis and higher transglycosylation at all time points compared to those of the D233Q mutant. Other mutants, such as D233Q/D279S, D233Q/Y402F, and D233Q/Q303L/E350Q, displayed detectable hydrolysis activity of less than 20% only at 48 h, while retaining a transglycosylation efficiency (Fig 2). Some mutants, including D233Q/Y402F/D405A, did not show detectable hydrolysis activity up to 48 h, though their maximum transglycosylation efficiency did not reach 80% at 48 h (Fig 2, S2 Table)."
                    ],
                    "subsections": []
                },
                {
                    "title": "One-Pot Transglycosylation From Sgp To Trastuzumab Using Variants Of Endo-S And Endo-M",
                    "paragraphs": [
                        "To circumvent the need to chemically synthesize sugar oxazoline in advance, we tested a novel one-pot transglycosylation reaction to transfer the glycan moiety from SGP to the antibody using a combination of endoglycosidase mutants with varying target specificities, i.e., an Endo-S mutant that preferentially targets Fc N-glycan and an Endo-M mutant that targets SGP, but not core-fucosylated Fc N-glycan. We hypothesized that the active intermediate required for transglycosylation catalyzed by the Endo-S mutant could be prepared in situ by an auxiliary endoglycosidase (Fig 3).",
                        "Several combinations of enzyme mutants indeed worked in concert to transfer the glycan moiety of SGP (Tokyo Chemical Industry Co., Ltd., Tokyo, Japan) (Fig 4). While the transglycosylation efficiency of the Endo-S D233Q mutant alone or in combination with wild-type Endo-M reached only 13% (Fig 4A), that of the combination with the Endo-M N175Q mutant reached 95% (Fig 4B). The use of a variant of SGP where the peptide portion was trimmed down to an asparagine residue (SG-Asn) as the donor substrate slightly decreased the reaction rate, but increased the maximum efficiency slightly to 97%. The Endo-S D233Q/E350Q mutant in place of the D233Q mutant could also improve the maximum efficiency to 97%, while wild-type Endo-S severely diminished the transglycosylation activity (Fig 4A).",
                        "Based on an analysis of the SGP concentration dependency, greater than approximately 100 eq of SGP is required to achieve 90% transglycosylation with the Endo-S D233Q mutant and Endo-M N175Q mutant (S3 Table). Using the combination of Endo-S D233Q and Endo-M N175Q, 10 mg of deglycosylated trastuzumab was one-pot transglycosylated using SGP or SG-Asn as a donor substrate and further purified through a protein A column and CHT column, yielding 8.0 mg of glycosylated-trastuzumab with a homogeneous glycoform, as observed by LC-ESI-MS, in both cases (Fig 5)."
                    ],
                    "subsections": []
                },
                {
                    "title": "One-Pot Transglycosylation From Sgp To Trastuzumab Using Mutants Of Endo-S And Endo-Cc",
                    "paragraphs": [
                        "To test whether Endo-M N175Q could be replaced with another ENGase, Endo-S D233Q was used in combination with variants of Endo-CC at 37°C, the optimal temperature for the latter enzyme. While the reaction with wild-type Endo-CC did not generate a detectable amount of transglycosylation product, that with the Endo-CC N180H mutant showed 57% transglycosylation efficiency at 8 h, but this was followed by significant hydrolysis of the product (Fig 6). Lowering the reaction temperature to 28°C prevented the rapid hydrolysis of the product, but did not improve the maximum efficiency."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "In this study, we generated mutants of Endo-S, an endoglycosidase from Streptococcus pyogenes, with improved transglycosylation activity compared to that of the previously reported D233Q mutant. Several notable double- and triple-mutants with high transglycosylation activity and low hydrolysis activity were identified. Notably, Endo-S D233Q/Q303L, D233Q/E350Q, and D233Q/D405A demonstrated transglycosylation efficiencies reaching over 90% at a substantially reduced donor-to-acceptor ratio of 5 molar eq (i.e., 2.5 molar oxazoline per monomeric Fc domain). This is lower than the 20 molar eq used in the recently reported highly efficient D184M mutant of Endo-S2 from Streptococcus pyogenes serotype M49 [30]. Endo-S D233Q/E350Q and D233Q/D405A also had higher transglycosylation reaction rates than that of Endo-S D233Q [17]. While several mutants displayed no hydrolytic activity, their transglycosylation efficiency did not show continuous growth after 24 h, likely because of the instability of highly reactive oxazoline at pH 7.5.",
                "In the process of generating efficient mutants, various sites that contributed to the reduced hydrolysis activity were identified, including D279 and Q303 in the proximity of catalytic residues (Fig 7). Most of the other mutations likely alter donor-binding, i.e., Y402 is in the proximity of the branched mannose residue, H122 and E350 are likely in contact with the α1–3 arm of the substrate glycan, and D405, R406, and Y348 are buried in the interior with respect to the two residues. Only the F187A mutation, which resulted in a very minor improvement, was identified in the proximity of the α1–6 arm. This area was not thoroughly explored, but it is possible that the interaction with the α1–6 arm is not as extensive as interactions with other regions of the glycan.",
                "Importantly, we showed that the glycan moiety could be transferred from SGP to the antibody by the combination of ENGase mutants. Initially, the use of wild-type Endo-S and Endo-M yielded unsuccessful results due to the hydrolysis of the product and active intermediate, respectively. However, use of the Endo-S D233Q/E350 mutant with the Endo-M N175Q mutant to minimize hydrolysis greatly improved the maximum transglycosylation efficiency to 97%. Although the detailed process remains unclear, the active intermediate generated by the Endo-M mutant may have been transferred to the Endo-S mutant for subsequent transglycosylation of the antibody. In contrast to the recently reported chemical approach in which sialoglycan hydrolyzed by wild-type Endo-M was chemically converted to SG-oxazoline in situ [31] (Fig 8A), our approach with the Endo-M N175Q mutant [23,24] did not require preparation of oxazoline as a glycan donor (Fig 8B).",
                "The applicability of the Endo-CC mutant in place of the Endo-M mutant suggests that this type of reaction can be carried out with different combinations of ENGases and their substrates (Fig 6). Additionally, this reaction may not be limited to rare mutants. The combination of wild-type Endo-S and Endo-M resulted in 1% transglycosylation efficiencies at several time points, despite the predominantly hydrolytic nature of the enzymes, partly because of the high donor-to-acceptor ratio and high transglycosylation activity of Endo-M (Fig 4A).",
                "Unexpectedly, the Endo-M N175Q mutant, without the help of Endo-S, showed approximately 5% transglycosylation efficiency towards core-fucosylated IgG (Fig 4A). This may be in conflict with a previous report by Katoh et al. They reported that the Endo-M N175Q mutant scarcely transglycosylated SG-oxazoline to the core-fucosylated acceptor at a donor-to-acceptor ratio of 1:1, whereas their engineered Endo-M N175Q/W251 double mutant showed approximately 5% transglycosylation efficiency [32]. The apparent conflict may be related to differences in conditions such as the type of donor glycan and its ratio to acceptor. Further studies of ENGases and their one-pot reactions are required to develop more efficient conditions."
            ],
            "subsections": []
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "Enzymatic remodeling of glycan has extensive research uses, but is limited for large-scale applications. In this study, over 120 mutants of Endo-S were screened with the aim of obtaining an efficient enzyme with improved transglycosylation activity and reduced hydrolysis activity. By introducing additional mutations into the D233Q mutant [17], we obtained significantly improved Endo-S mutants with transglycosylation efficiencies reaching over 90% at a donor-to-acceptor ratio of five. Using the mutant of Endo-M and Endo-CC [24,27], we also developed a novel one-pot transglycosylation reaction to circumvent the need for the chemical synthesis of a highly active intermediate. Further optimization of the one-pot reaction, especially for combinations of ENGase mutants, is expected to lower the required donor-to-acceptor ratio. These developments represent progress towards large-scale manufacturing using chemoenzymatic processes."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Site-Directed Mutagenesis And The Expression And Purification Of Recombinant Endo-S",
                    "paragraphs": [
                        "The synthesized DNA fragment encoding Endo-S from Streptococcus pyogenes was subcloned into the pGEX-4T-3 vector (GE Healthcare, Little Chalfont, UK) for the expression of glutathione-S-transferase (GST)-fused Endo-S. Mutations were introduced using the QuikChange II Site-Directed Mutagenesis Kit (Agilent, Santa Clara, CA, USA). The plasmids containing mutated Endo-S genes were transformed into Escherichia coli BL21(DE3). The transformants were cultured in 50 mL of Luria Broth supplemented with 100 μg/mL ampicillin, and overexpression was induced by the addition of 0.1 mM isopropyl-β-d-1-thio-galactopyranoside. After 20 h of culture at 16°C, the cells were harvested by centrifugation. The cell pellets were resuspended in PBS (8 g/L NaCl, 2 g/L KCl, 1.15 g/L Na2HPO4, 0.2 g/L KH2PO4, pH 7.4, Takara-Bio, Shiga, Japan) containing 0.5 mg/mL lysozyme (Wako, Osaka, Japan) and 40 U of DNaseI (Invitrogen, Carlsbad, CA, USA) and then sonicated. The supernatant of the cell lysate was affinity-purified with Glutathione Sepharose 4B (GE Healthcare), buffer exchanged to PBS, and concentrated to approximately 2 to 7 mg/mL by Amicon Ultrafiltration (10 kDa; Millipore, Burlington, MA, USA). For the large-scale purification of selected Endo-S variants, 1 L of culture was used and affinity-purified materials were gel-filtered in PBS with HiLoad 26/600 Superdex 200 prep grade (GE Healthcare), instead of diafiltration, to remove 10 mM glutathione used for elution from Glutathione Sepharose 4B."
                    ],
                    "subsections": []
                },
                {
                    "title": "Deglycosylation Of Trastuzumab By Endo-S",
                    "paragraphs": [
                        "A solution of trastuzumab (100 mg; Herceptin from Genentech Inc., San Francisco, CA, USA) was incubated with Endo-S (500 μg) at 37°C in a total volume of 4.39 mL of 50 mM phosphate buffer (pH 6.0) for 4 h. The mixture was immediately subjected to affinity chromatography with HiTrap rProteinA HP (GE Healthcare), and hydroxyapatite chromatography with CHT Type I (Bio-Rad, Hercules, CA, USA), and buffer-exchanged to 50 mM Tris-HCl buffer (pH 7.4), yielding 85.7 mg of deglycosylated trastuzumab. LC-MS results for the heavy chain of (Fucα1, 6) GlcNAc-trastuzumab, M = 49506.0 Da; found (m/z), 49505.5 (deconvolution data)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Enzyme Assays",
                    "paragraphs": [
                        "The assay for the hydrolysis activity of each Endo-S mutant (10 μg) was performed at 30°C with commercial trastuzumab (500 μg) as a substrate in Tris-HCl buffer (50 mM, pH 7.4, 30 μL). The transglycosylation activity of each Endo-S mutant (16 μg) was assayed at 30°C with deglycosylated trastuzumab (800 μg) and SG-oxazoline [33] (53.5 μg, 5 eq) in Tris-HCl buffer (50 mM, pH 7.4, 49.07 μL). In both assays, aliquots of the reaction mixture were sampled at 1, 2, 4, 8, 24, and 48 h, and instantly diluted with 4 μL of deionized water and 2 μL of a 29:1 mixture of Experion Pro260 Sample Buffer (Bio-Rad) and NuPAGE Sample Reducing Agent (Invitrogen). The aliquots were briefly heat-denatured, further diluted with 84 μL of deionized water, and analyzed using the Experion Pro260 Analysis Kit on the Experion Automated Electrophoresis Station (Bio-Rad) (S1 Fig). The peak area of the deglycosylated or transglycosylated heavy chain relative to the total heavy chain was calculated using Experion software."
                    ],
                    "subsections": []
                },
                {
                    "title": "Assay For The One-Pot Transglycosylation Of Deglycosylated Trastuzumab By The Combined Use Of Engases",
                    "paragraphs": [
                        "A solution of deglycosylated trastuzumab (1 mg) and SGP derived from egg yolk (Tokyo Chemical Industry Co., Ltd., Tokyo, Japan, 5.82 mg, 300 eq) were incubated with an Endo-S mutant (20 μg) and/or Endo-M mutant (Tokyo Chemical Industry Co., Ltd., Tokyo, Japan, 5 mU) at 28°C in Tris-HCl buffer (50 mM, pH 7.4, 64.1 μL). The SGP concentration dependency was additionally tested at 50, 100, 200, and 400 eq for the reaction with Endo-S D233Q in concert with Endo-M N175Q. The assay using SG-Asn [28] (4.74 mg, 300 eq) as a substrate was carried out at a slightly reduced volume of 58.7 μL. The assay using an Endo-S mutant (20 μg) and Endo-CC (17 mU) or Endo-CC N180H mutant (33 mU) was carried out at 28°C and/or 37°C in Tris-HCl buffer (50 mM, pH 7.4, 74.1 μL). In all assays, aliquots of the reaction mixture were sampled at 1, 2, 4, 8, 24, and 48 h, and analyzed using the Experion Pro260 Analysis Kit on the Experion Automated Electrophoresis Station (Bio-Rad). The peak area of the product relative to the total heavy chain was calculated using Experion software."
                    ],
                    "subsections": []
                },
                {
                    "title": "One-Pot Transglycosylation Of Deglycosylated Trastuzumab At A Medium Scale",
                    "paragraphs": [
                        "A solution of deglycosylated trastuzumab (10 mg) and SGP (58.2 mg, 300 eq) was incubated with the Endo-S D233Q mutant (200 μg) and Endo-M N175Q mutant (0.05 U) at 28°C in Tris-HCl buffer (50 mM, pH 7.4, 600 μL) for 4.5 h. The mixture was immediately subjected to affinity chromatography with HiTrap rProteinA FF (GE Healthcare) and hydroxyapatite chromatography with CHT Type I (Bio-Rad), and buffer-exchanged to sodium phosphate buffer (137 mM NaCl, 10 mM Na2HPO4/NaH2PO4 pH 6.0, Nacalai Tesque, Kyoto, Japan) supplemented with 5 mM EDTA (Nacalai Tesque, Kyoto, Japan), yielding 8.0 mg of 11.82 mg/mL SG-trastuzumab in 680 μL. LC-MS results for the heavy chain of SG-trastuzumab, M = 51508.7 Da; found (m/z), 51508.0 (deconvolution data). Similarly, a reaction using SG-Asn (47.3 mg, 300 eq) was carried out at slightly reduced volume of 570 μL, yielding 8.0 mg of 10.31 mg/mL SG-trastuzumab in 780 μL. LC-MS: calculated for the heavy chain of SG-trastuzumab, M = 51508.7 Da; found (m/z), 51508.0 (deconvolution data)."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}