{
    "id": "https://semopenalex.org/work/W2027870570",
    "authors": [
        "Hongrui Jiang",
        "Chensha Li",
        "Chi-Wei Lo"
    ],
    "title": "Direct solar energy conversion and storage through coupling between photoelectrochemical and ferroelectric effects",
    "date": "2011-10-03",
    "abstract": "Harvesting and storing solar energy has become more and more important. Current solid-state photovoltaic cells and conventional photoelectrochemical cells are not capable of directly storing the converted energy, which has to be facilitated by connecting to external storing devices. We demonstrate a device architecture that can convert and store solar energy in the electrical form within an intrinsically single structure. Mobile charge is internally stored, based on the coupling between photoelectrochemical and ferroelectric effects. The tested device architecture can be photo-charged under 1000 W/m2 of white light to an open-circuit voltage of 0.47V with a capacity of 37.62 mC/cm2. After removal of the light source, the mobile charge stored lasts more than 8 hours, and the open-circuit output voltage lasts more than 24 hours.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "Solar energy has become a more and more important clean and renewable source of electricity. 1,2 Current research on solar cells generally focuses on enhancing their conversion efficiency; [3][4][5][6][7][8][9] nonetheless, another grand challenge lies in that today's solar cells are not capable of direct storage of the electrical energy harvested from sun light. Presently, the common practice for storage is to connect rechargeable batteries to the solar cells externally. 10 However, this approach has certain disadvantages such as bulkiness, complexity and higher cost of the overall system, limited lifetime and recharging cycles and potential concern of pollution in the recycling process of the batteries. 11 Although it is possible to realize photovoltaically rechargeable batteries based on photoelectrochemical effects, 7,12 systems of this kind generally would require complicated internal structures, difficult fabrication process, high cost, and are difficult to miniaturize. 13 Other methods to store through external apparatus, such as superconducting coils 14 and capacitors 15 are also under development. However, it is highly desirable to create solar cells that can store solar energy directly.",
                "It has been shown that ferroelectric materials [e.g. poly(vinylidene fluoride), or PVDF] 16 can be used for storing electrical energy. 17 Previous studies have also shown that when a photoelectrochemical cell is exposed to solar irradiance, redistribution of the ions within the electrolyte can occur, causing an ion concentration gradient, 18,19 and generating an internal electric field. Therefore, we hypothesize that by coupling the photoelectrochemical effect and the ferroelectric effect in one single structure, the photoelectrochemically induced electric field will polarize the ferroelectric material. Because of the ferroelectric property, the polarization would not disappear even after the solar irradiance is removed. Rather, it will maintain the equilibrium internal electric field and hold the charge, thus the direct storage of the converted electrical energy. To confirm our hypothesis, a Author to whom correspondence should be addressed. Electronic mail: hongrui@engr.wisc.edu. "
            ],
            "subsections": []
        },
        {
            "title": "II. EXPERIMENTAL PROCEDURES",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "A. Materials",
                    "paragraphs": [
                        "Intrinsic silicon (Si) powder (mesh 300) is from Alfa Aesar (Waro Hill, MA). Hexafluorophosphate (LiPF 6 ), ethylene carbonate (EC), dimethyl carbonate (DMC), and indium tin oxide (ITO) glass slide (∼10 / ) are from Sigma-Aldrich Chemical Co. (St. Louise, Missouri). Anhydrous tetrahydrofuran (THF) and N-methylpyrolidinone (NMP) are from Aldrich Chemical Co. (Milwaukee, WI). Kynar FlexTM 301F (Mw=3.8 × 10 5 ), a PVDF copolymer is obtained from Arkema North America (Philadelphia, PA). Gold (Au) sputtered glass slides are from EMF Corp. (Ithaca, NY)."
                    ],
                    "subsections": [
                        {
                            "title": "B. Fabrication",
                            "paragraphs": [
                                "The picture of our device architecture is shown in Figure 1(a); schematic of its cross section is shown in Figure 1(b). It consists of a transparent electrode (glass sputtered with conductive ITO), a current collector (glass sputtered with Au), and a medium composed of semiconductor particles (intrinsic silicon), an electrolyte with LiPF 6 dissolved in a solution of EC and DMC (volume ratio 1:1), ferroelectric PVDF particles bound with the Si particles and a ferroelectric PVDF membrane. The light is cast onto the structure from the side of the transparent electrode. Si powder is first rinsed in hydrofluoric acid (HF) for 15 min to remove the native oxide on the surface followed by rinsing with deionized (DI) water and then drying in an oven. Top electrodes are then prepared by dissolving Kynar in NMP followed by adding the Si powder in (Si powder: Kynar = 90:10 mass ratio). The mixture undergoes ultrasonication for 30 min followed by stirring for 2 h at 55 • C. An ITO glass slide is used as the substrate. The active area is defined by a double-sided adhesive tape (3M Corp., St. Paul, MN, USA) that also controls the thickness of the coating. The Si/Kynar slurry is cast onto the defined ITO substrate. The top electrode is then dried on a hotplate at 75 • C for 12 h. The thickness of this top composite electrode is roughly 95 μm.",
                                "Kynar gel electrolyte for the structure is prepared by solvent casting. The parent electrolyte is 0.5M LiPF 6 in a solution (EC: DMC = 1:1). 1 g of Kynar is dissolved into 10 g of THF, followed by stirring. 2.5 g of the parent electrolyte is then added into this mixture, followed by stirring. The viscous slurry is cast onto the glass slide, using a razor blade, and is allowed to dry for 24 h. The thickness of the resulting gel is approximately 40 μm. The gel electrolyte is soaked in the parent electrolyte for 30 min prior to the assembly. The prepared gel electrolyte is sandwiched between the top and the bottom Au electrodes and is sealed with hot epoxy glue. The whole assembly is compressed to ensure no leakage of the electrolyte."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "C. Characterization of the device structure",
                            "paragraphs": [
                                "The device structure is illuminated with white light with an intensity of 1000 W/m 2 . The light source is a Newport (model: 66296 1000W) halogen lamp. Its spectrum is given in Figure 2. The open-circuit photo-charging measurement is carried out by placing the structure under the irradiance. The electrodes are connected to Agilent 34411A 6 1/2 Digital Multimeter to measure the open-circuit voltage. For loaded discharging measurement, the device is connected to a load resistance of 500 in series with the multimeter. For short-circuit discharging measurement, the electrodes are short circuited through the multimeter. In both cases, the current is monitored as a function of time. The step size of the digital multimeter is set to 1 reading per second. In our experiments, the light source is turned off after 10 minutes to avoid overheating of the lamp. "
                            ],
                            "subsections": []
                        },
                        {
                            "title": "D. Electrochemical analysis",
                            "paragraphs": [
                                "The structure is subjected to both cyclic voltammatry (CV) and electrochemical impedance spectroscopy (EIS). The displacement-electric field (D-E) hysteresis loops are measured with a modified Sawyer-Tower Circuit. The CV is carried out using a Bioanalytical (model: 100W) electrochemical analyzer using two-electrode configuration. The voltage scans from -0.5V to 0.5V at a rate of 100mV/sec. The EIS is performed on an Agilent 4194A impedance analyzer. The frequency range is from 100Hz to 2 MHz."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "III. RESULTS AND DISCUSSION",
            "paragraphs": [
                "The device structure first undergoes testing under light, and the results are given in Figure 3. Figure 3(a) shows that the open-circuit voltage between the two electrodes increases from 0 to 0.47V in 20 seconds upon exposure to an irradiance of 1000 W/m 2 from a white light source. This indicates that the structure has been charged. In contrast, without light, no charging is observed, also shown in Figure 3(a). After the structure is removed from light and put in a dark environment, the voltage does not drop significantly in more than 24 h, and still has about 50% of its original value after 4 days (Figure 3(b)). The structure stores mobile charges after photo charging. To demonstrate this, we perform short-circuit discharge of the charged structure as a function of time, which is plotted in Figure 3(c). Integration of the discharging curve over time indicates a storage capacity of 37.62 mC/cm 2 . Figure 3(d) shows the storing capability of the mobile charge in the photo-charged structure. After each photo-charging process, the structure is kept in a dark environment for a certain period of time before being short-circuit discharged. About 70% of the initial mobile charge is still stored in the structure after 8 h. In addition, cyclic test of the structure demonstrates good repeatability in photo-charging and discharging cycles, as shown in Table I. The structure can be charged and provide electrical current output simultaneously, using the two electrodes. Figure 3(e) shows the discharging of the photo-charged structure over a load of 500 , with and without the irradiance of 1000 W/m 2 , respectively. Note that a switch is not needed to toggle the operation of the device between photo charging and electrical discharging, as would be the case where a solar cell is connected with a capacitor. After 100 s, the device is observed to heat up due to the simultaneous discharging and exposure to the light source, which might cause the slight drop in the current output after 100 s.",
                "Further electrical testing of the device structure is then performed. Figure 4(a) presents the D-E loop of a prepared PVDF membrane (40 μm in thickness) as used in our structure and soaked with the same electrolyte, measured under the Tower-Sawyer circuit with an alternating current (ac) electric field at 10Hz with an amplitude of 10V. A typical ferroelectric D-E loop characterized by a high remnant polarization is observed in our PVDF membrane. The working potential range of our structure is checked by CV measurement. Figure 4(b) shows the obtained CV result. The structure exhibits electrochemical stability in the range from -0.5 to 0.5 V. The electrochemical behavior of our structure before photo charging is also studied through impedance analysis using EIS. Figure 4(c shows the results in a Nyquist plot. It clearly exhibits a capacitive behavior. The measured impedances as a function of frequency are imported into ZSimpWin TM , and an equivalent circuit model of the structure before photo charging is then obtained, which is shown in Figure 5.",
                "The operation of the device relies first on the photoelectrochemical effect. When the structure is exposed to irradiance, electrons and holes in Si are generated. Holes are injected into ITO, while the electrons remain in Si. This also induces redistribution of the ions within the electrolyte, causing a concentration gradient across the two electrodes. 18,19 This in turn, generates potential difference between the two electrodes. The storage can be attributed to the polarization of PVDF. From Figure 4(a), at 0.47V (corresponding to 1.2×10 4 V/m), the open-circuit output voltage of our structure after photo charging, the PVDF membrane used already demonstrates polarization. Note that although previous literature reports that non-solvated PVDF undergoes polarization in an electric field as high as 200MV/m, 17 here our PVDF is solvated with electrolyte. We also note that PVDF is known to possess pyroelectricity 20 and piezoelectricity 21 besides ferroelectricity. During our experiments when the structure is first formed, no open-circuit voltage is observed before photo charging. This indicates that the piezoelectric property of PVDF does not play a role in the harvesting and storage. Further, output current from a piezoelectric material can only be in ac form when the material vibrates. 22 The pyroelectric effect of PVDF is also found negligible. When heated up to 75 o C from room temperature, the PVDF membrane used generates less than 10 μV, significantly lower than the open-circuit voltage of 0.47V. Other experimental evidences further point to the importance of the ferroelectricity of PVDF in the storing capability of the structure. First, we make a same device structure but replace the 40-μm-thick PVDF membrane with a non-ferroelectric cellulose porous membrane. The Si particles are still bound with PVDF particles and the same electrolyte is applied. This effectively reduces the amount of PVDF in the structure. Figure 6(a) shows the open-circuit output voltage of this control device after it is fully photo-charged to 0.18V, as a function of time. The voltage can only be maintained for about 15 min and starts to drop rapidly afterwards. Next, in another control structure, the PVDF is completely removed. Figure 6(b) shows the open-circuit voltage of this second control structure. After photo charging and removal of the light source, the open-circuit voltage cannot hold even for seconds and immediately drops. Short-circuit discharge of this second control structure immediately after photo charging, as shown in Figure 6(c), indicates only 35.63 μC/cm 2 of mobile charge, three orders of magnitude lower than the full structure with PVDF (particles and membrane). Finally, the full structure with PVDF is placed on a hot plate to be heated to 95 o C after photo charging. It is known that at 95 o C, PVDF loses its ferroelectric property due to thermally induced isotropic dipole moment. 23 As shown in Figure 6(d), when the temperature ramps up to 95 o C, the open-circuit voltage of the structure rapidly drops to zero. These experimental results confirm the importance of the ferroelectric PVDF in the storage capability of our structure. It also indicates that the harvesting and storage are not due to a simple connection between a solar cell and a capacitor; otherwise, we would not expect much difference in the storage time between the full structure and the two control structures. Instead, they are due to the intrinsic coupling between photoelectrochemical and ferroelectric effects.",
                "Other components in our device structure are also indispensible. Experiments show that a similar structure without electrolyte can neither be photo charged nor store, indicating the necessity of the electrolyte. This is consistent with our concept that the charging of mobile charge in internal capacitances and polarization of the PVDF result from the ionic concentration gradient in the electrolyte. Another interesting observation is that the photo-charging and storage behavior disappears when DMC is removed from the electrolyte system. There is evidence that DMC can stabilize the ions within the electrolyte. 24 DMC might have played a similar role here to stabilize the ions and maintain the internal electric field and the equilibrium in the ionic distribution."
            ],
            "subsections": [
                {
                    "title": "IV. CONCLUSION",
                    "paragraphs": [
                        "In summary, we have demonstrated that solar energy could be converted to electrical energy and directly stored in the form of mobile charge in a single structure, owing to an intrinsic coupling between photoelectrochemical and ferroelectric effects. After being photo charged, the test device structure can hold its open-circuit output voltage for more than 24 h, and its mobile charge for more than 8 h, in a dark environment. It also demonstrates good repeatability in its photo-charging and electrical discharging cycles. In the future, we will further investigate the mechanism of the coupling between the photoelectrochemical and the ferroelectric effects, the transport of ions and mobile charges within the structure, the distribution of the electric field within the electrolyte and the ferroelectric material, and the theoretical limits for the storage in terms of capacity and longevity. This work could lead to a new type of solar cell that possesses the dual functions of solar energy harvesting and storage, and can be implemented in a wide range of applications. Improvement in the performance of these new solar cells can benefit from many technologies available today or under development for electrical energy storage 25,26 and higher solar energy conversion efficiency. 27,28 "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "paragraphs": [
                "This work was supported by the U.S. National Science Foundation (NSF) through grant number (EECS 0702095) and by Wisconsin Institutes for Discovery (WID). The authors thank Drs P. Fulay, Y. Gianchandani, Y. Xu, C.B. Eom, J. Booske and I. Knecevic for technical discussions."
            ],
            "subsections": []
        }
    ]
}