{
    "id": "https://semopenalex.org/work/W4281478438",
    "authors": [
        "Jing Wang",
        "Mingliang Liu",
        "Han Wang",
        "Xiaoyü Li",
        "Yongxin Zhang",
        "Ling Ma",
        "Shan Cen",
        "George F. Gao",
        "Jianxun Qi",
        "Yujia Wang",
        "Quanjie Li",
        "Dongrong Yi",
        "Kai Lv",
        "Yi Shi"
    ],
    "title": "Repurposing of berbamine hydrochloride to inhibit Ebola virus by targeting viral glycoprotein",
    "date": "2022-12-01",
    "abstract": "Ebola virus (EBOV) infection leads to staggeringly high mortality rate. Effective and low-cost treatments are urgently needed to control frequent EBOV outbreaks in Africa. In this study, we report that a natural compound called berbamine hydrochloride strongly inhibits EBOV replication in vitro and in vivo. Our work further showed that berbamine hydrochloride acts by directly binding to the cleaved EBOV glycoprotein (GPcl), disrupting GPcl interaction with viral receptor Niemann-Pick C1, thus blocking the fusion of viral and cellular membranes. Our data support the probability of developing anti-EBOV small molecule drugs by targeting viral GPcl. More importantly, since berbamine hydrochloride has been used in clinic to treat leukopenia, it holds great promise of being quickly repurposed as an anti-EBOV drug.",
    "sections": [
        {
            "title": "Ebola virus (EBOV) infection leads",
            "paragraphs": [
                "to staggeringly high mortality rates. Effective and low-cost treatments are urgently needed to control frequent EBOV outbreaks in Africa. In this study, we report that a natural compound called berbamine hydrochloride strongly inhibits EBOV replication in vitro and in vivo. Our work further showed that berbamine hydrochloride acts by direct binding to the cleaved EBOV glycoprotein (GPcl), disrupting GPcl interaction with viral receptor NPC1, thus blocking the fusion of viral and cellular membranes. Our data support the probability of developing anti-EBOV small molecule drugs by targeting viral GPcl. More importantly, since berbamine hydrochloride has been used in clinic to treat leukopenia, it holds great promise of being quickly repurposed as an anti-EBOV drug."
            ],
            "subsections": []
        },
        {
            "title": "Identification of berbamine hydrochloride as an EBOV entry inhibitor.",
            "paragraphs": [
                "We previously characterized the NPC1-binding site in GPcl, consisting of residues V79, T83, K84, F88, I113, V141, and P146 (24) (Fig. 1a). Based on this result, we designed a virtual screening strategy, as shown in Fig. 1b, and systematically examined 4114 compounds from the focused small compound libraries, and ranked these compounds based on the predicted binding free energies (ΔGADV). A total of 334 compounds had a ΔGADV lower than -9.0 kcal/mol (Extended Data Fig. S1) and were further visually inspected for H-bond, p-p, or salt bridge interactions to discard unrealistic poses with unreasonably high score. A final list of 46 compounds (Extended Data Table. S1) were selected for further study.",
                "We first assessed the inhibitory effect of the selected 46 compounds on infection of HIV-Luc reporter virus that was pseudotyped with EBOV GP (EBOV pseudoparticle, EBOVpp) or vesicular stomatitis virus (VSV) GP (VSV pseudoparticle, VSVpp), as we described previously (24). Of these 46 compounds, EEI-10 (Fig. 1c), EEI-33 and EEI-45 (Extended Data Fig. S2) exhibited more than 80% inhibition of EBOVpp infection, but less than 20% reduction in VSVpp infectivity, which suggests that these three compounds selectively block EBOV GP-mediated viral entry. Such a selective inhibition was also observed for the known EBOV entry inhibitor tetrandrine (thereafter called TET) (17). Next, we determined the binding affinity of the selected compounds to the purified GPcl in vitro in the BLI binding assay. The association and dissociation data suggest that only EEI-10 and EEI-20 interacted directly with GPcl with a KD of 217 μM and 229 μM, respectively (Fig. 1d and Extended Data Fig. S3). Together, among the 46 compounds tested, only EEI-10 both binds to GPcl and selectively inhibits EBOV GP-mediated viral entry. EEI-10, also called berbamine hydrochloride, is a natural compound extracted from the berberis amurensis and has been used in the clinic to treat leukopenia (25). Repurposing of an approved drug to inhibit EBOV represents a great opportunity of developing new anti-EBOV drugs. We thus decided to further characterize EEI-10 inhibition of EBOV. First, we observed that EEI-10 profoundly inhibited EBOVpp but not VSVpp (Fig. 1e). Results of dose-response experiments revealed a concentration-dependent inhibition of EBOVpp in 293T cells with EC50 of 0.49 μM (Fig. 1f). No cytotoxic effect of EEI-10 was observed even at 10 μM (Extended Data Fig. S4a). Importantly, EEI-10 potently suppressed EBOV infection of Vero E6 cells (EC50=4.1 μM, EC90 =7.6 μM) (Fig. 1g), and did not affect cell viability at the concentrations used (Extended Data Fig. S4b). These data together suggest that EEI-10 is a potent EBOV inhibitor. Left, the structure of the GPcl (yellow) in complex with NPC1 (green). Right, the receptor binding cavity at the top of GPcl.",
                "Highlighted in magenta is residues that constitute the interaction interface and are targeted by the virtual screening. b, The virtual screening strategy designed to identify small molecules targeting GPcl. c, Chemical structure of EEI-10, with molecule weight (MW). d, Representative association and dissociation sensorgrams of EEI-10 binding to EBOV-GPcl.",
                "Values of KD, KD Error, kon, kdis, and R2 are presented. e, HEK293T cells were infected with the EBOVpp in the presence of EEI-10 at the final concentration of 10 μM. VSVpp was used to control the specific antiviral effect of the tested drugs. "
            ],
            "subsections": []
        },
        {
            "title": "EEI-10 inhibits EBOV GP-mediated fusion of viral and cellular membranes.",
            "paragraphs": [
                "To determine whether EEI-10 inhibits EBOV GP-mediated virus entry, we first performed a time-of-addition experiment using EBOVpp. EEI-10 was added at different time points before and after EBOVpp infection. The results showed that both EEI-10 and TET markedly inhibited viral infection at the early time points of drug addition, and their inhibitory effects decreased after 4 hpi (Fig. 2a). In contrast, the HIV-1 reverse transcriptase inhibitor efavirenz (EFV) maintained its inhibitory effect up to 8 hpi. We further measured the possible effect of EEI-10 on the internalization of EBOVpp from the cell surface by quantifying the uptake of viral genomic RNA, and observed no effect as opposed to the marked inhibition by heparin (Fig. 2b), which has been shown to block the early attachment of EBOV to the target cells (26). These data support that EEI-10 inhibits an early step of EBOVpp infection, after EBOV GP-mediated internalization from the cell surface but prior to viral RNA replication.",
                "It is known that following internalization at the cell surface, EBOV particles translocate to the acidic late endosomes where virus-cell membrane fusion occurs, leading to the release of viral RNA into the cytoplasm (27,28). Imaging EBOVpp-infected cell at 4 hpi revealed a similar number of virions in the LAMP1 (lysosomal associated membrane protein 1)-positive late endosome/lysosome compartments in cells treated with either EEI-10 or control DMSO (Fig. 2c and Extended Data Fig. S5). This further supports the data in Figure 2b that EEI-10 does not affect the early events of virus entry from uptake of virus at the cell surface to trafficking of virions to the acidic compartments. We next tested whether the fusion of viral and cellular membranes is inhibited by EEI-10 using a beta-lactamase-Vpr chimeric protein (BlaM-Vpr) release assay that has been established to measure the delivery of HIV-1 core into the cytoplasm (29). We found that EEI-10 significantly reduced the cytoplasmic entry of BlaM-Vpr from EBOVpp by approximate 80%, whereas no such effect of EEI-10 was observed for VSVpp (Fig. 2d and Extended Data Fig. S6). This suggests that EEI-10 specifically inhibits the delivery of BlaM-Vpr into the cytoplasm resulting from EBOV GP-mediated membrane fusion. In further support of this conclusion, adding MG132 to cell culture for preventing the degradation of incoming virion, a pronounced increase was detected in the level of EBOVpp particles in newly infected cells treated with either EEI-10 or TET, but not for VSVpp infection (Fig. 2e and Extended Data Fig. S7), suggesting that EEI-10-mediated delay of virus entry at the late endosomes causes accumulation of EBOVpp particles. "
            ],
            "subsections": []
        },
        {
            "title": "EEI-10 disrupts binding of EBOV GPcl to NPC1.",
            "paragraphs": [
                "We next determined whether EEI-10 inhibits EBOV GP-mediated entry by disrupting the binding of GP to its receptor NPC1 in the infected cell. We first observed that that EEI-10 treatment reduced the colocalization of EBOVpp particles with NPC1 in the infected cells (Fig. 3a), as opposed to TET which targets the two-pore channels and had no effect as previously reported (17). EBOV GP can only bind to NPC1 after cleavage by the endosomal cathepsin. We thus pretreated EBOVpp with the protease thermolysin, which completes GP cleavage (8), and then infected cells in the presence of EEI-10. Again, strong inhibition was observed with EEI-10 but not with cysteine protease inhibitor E-64 (Fig. 3b). Thus, EEI-10 diminishes the colocalization of EBOVpp with NPC1 not through affecting GP proteolysis. We next performed co-immunoprecipitation to measure the association of GPcl with its receptor NPC1 and found that EEI-10, but not TET, markedly reduced GPcl-NPC1 interaction (Fig. 3c). This observation was supported by the data of proximity ligation assay (PLA), showing that treatment with EEI-10 diminished GPcl-NPC1 interaction in the infected cells by approximately 80% (Fig. 3d). We further showed that EEI-10 did not affect the cellular content of cholesterol (Extended Data Fig. S8) in contrast with NPC1 inhibitors U18666A and compound 3.0 that inhibited EBOV entry by causing cholesterol accumulation in late endosomes, suggesting that EEI-10 does not act on NPC1.",
                "We thus conclude that EEI-10 binds to GPcl, prevents GPcl from binding NPC1, and inhibits GP-mediated fusion of viral and cellular membranes. "
            ],
            "subsections": []
        },
        {
            "title": "GPs of EBOV and MARV share a similar binding pocket for EEI-10 and are both inhibited by EEI-10.",
            "paragraphs": [
                "We next used the AutoDock Vian computation program to model the binding of EEI-10 to GPcl. In the generated model of GPcl in complex with EEI-10 (Fig. 4a), EEI-10 is located at the hydrophobic pocket in GPcl and forms hydrogen bond interaction with the amino residue E112. We further employed the MM/GBSA computation approach to calculate the binding free energy of EEI-10 and decomposed the free energy at the amino acid level. The cavity analysis showed that the major contributing amino acids to the binding of EEI-10 include E112, T83, I113, V141, F88, L111, W86, V79, P80, and G143, which are ranked based on their ΔGADV in the range from -2.54 to -0.62 kcal/mol (Extended Data Table. S2).",
                "To validate this binding model, we mutated the three top-ranking amino acids E112, T83 and I113, and examined their effect on the sensitivity of EBOV GP-mediated entry to EEI-10. The E112A mutation severely impaired viral infectivity, thus was not further tested for EEI-10 inhibition (Extended Data Fig. S9). The I113A GP mutant was refractory to EEI-10 while remaining sensitive to the TET entry inhibitor (Fig. 4b). In the meantime, the T83A mutation exerted no effect on the sensitivity of GP to either EEI-10 or TET inhibition (Fig. 4b); this is likely because A83 is able to restore the van der Waals interaction with EEI-10 which is observed for T83 as predicted in our computation model (Extended Data Table . 2). These data demonstrate that I113 is a key residue in contact with EEI-10 and that its mutation leads to resistance to EEI-10, which supports the structural model of GPcl binding to EEI-10.",
                "Recent studies have revealed a common receptor-binding site in GPs of several filoviruses including EBOV and MARV (13,30), which suggests that EEI-10 may inhibit MARV infection as well. Indeed, EEI-10 inhibited the MARV-GP/HIV-luc virus infection at an EC50 = 0.99 μM, and inhibited MARV itself at an EC50 = 4.06 μM (Fig. 4c,d). We further conducted computational docking of EEI-10 to MARV-GP1 and then preformed MD simulation to relax the complex. The binding free energy of the MARV GP/EEI-10 was calculated as ΔGADV=-9.3kcal/mol, which is moderately higher than that of EBOV-GPcl/EEI-10 complex (ΔGADV=-10.9 kcal/mol). Notably, these two complexes are well superposed at the EEI-10 binding sites (Fig. 4e). The top 10 amino acids in MARV-GP1 that contribute most to the binding energies are L64, S67, K68, A71, F72, I95, V97, I125, G127, and N129 (Extended Data Table. S3), which are equivalent to P80, T83, K84, G87, F88, L111, I113, V141, G143, and G145 in EBOV GPcl. Importantly, seven of the top 10 major contributing amino residues are shared in both complexes (Fig. 4f). These data suggest that EEI-10 is able to bind to the GPs of EBOV and MARV, and inhibit both viruses. "
            ],
            "subsections": []
        },
        {
            "title": "EEI-10 protects mice from lethal EBOV infection.",
            "paragraphs": [
                "Finally, we asked whether EEI-10 was able to protect mice from lethal EBOV infection. Mice were treated orally once per day for 6 days with 100 mg/kg EEI-10 beginning the day prior to inoculation with a lethal dose of mouse-adapted EBOV (MA-EBOV) (Fig. 5a). Remarkably, 100% of the mice treated with EEI-10 survived infection while only one of the PBS-treated animals survived (Fig. 5b), although all exhibited weight loss (Fig. 5c). To determine whether EEI-10 was also effective if treatment was begun post-infection, mice were again inoculated with MA-EBOV and then treated orally with the same dose of drug beginning at 1 day post-infection for a period of 6 days. Whereas all PBS-treated mice succumbed to infection by day 7, nearly all mice treated with EEI-10 survived, and the time to death was prolonged in the single treated animal that died (Fig. 5d). Again, all animals exhibited weight loss (Fig. 5e), suggesting that, while EEI-10 treatment provided a significant survival advantage, it did not prevent some signs of disease. This remarkable protective efficacy of EEI-10 may be partially attributed to the relatively weak interaction of GPcl with its receptor NPC1. With a KD of 158 μM, as measured in vitro using recombinant proteins (31), the interaction between these two proteins was likely easily disrupted by EEI-10. Through medicinal chemistry to modify EEI-10 and select for variants with greater affinity to GPcl, we expect to identify EEI-10 derivatives exhibiting much stronger inhibition of EBOV as well as a higher genetic barrier to deter the development of viral resistance. Additionally, as a drug to treat leukopenia, EEI-10 is expected to modulate certain cellular pathways and host immunity, which may have also contributed to its protection of mice against lethal EBOV infection.",
                "Of note, EEI-10 was demonstrated to bind to EBOV GPcl and potently inhibit virus entry, whereas in vitro binding assay revealed that EEI-10 exhibited a low affinity for GPcl, with KD values above 100 µM (Fig. 1d), likely due to the inability of the molecule to fit into and fully fill the extremely large receptor binding cavity (Fig. 1a). Nevertheless, a similar affinity (KD = 158 μM) was reported in the complex structure of GPcl bound to NPC1 (31), suggesting the feasibility of EEI-10 to compete with NPC1 for binding to GPcl. Moreover, lower pH was reported to enhance the interaction between GPcl and NPC1 (9). This implies that the binding affinity of EEI-10 in the acidic endosome where it occurs may be underrated in vitro.",
                "In summary, we have identified a natural compound berbamine hydrochloride (EEI-10) that potently inhibits EBOV infection of cultured cells through direct binding to viral GPcl and impairing the interaction of GPcl with the viral receptor NPC1. Our data further showed that EEI-10 strongly inhibits another pathogenic filovirus, MARV, implicating the potential use of EEI-10 as a broad-spectrum inhibitor of filovirus infection.",
                "Given that berbamine hydrochloride is already approved to treat leukopenia and has been thoroughly evaluated for its safety and pharmacokinetics properties, this drug holds great promise for saving the lives of EBOV patients and preventing future EBOV epidemics or pandemics.",
                "Target Molecule Corp. Tetrandrine (TET) and efavirenz (EFV) were maintained in the Institute of Medicinal Biotechnology, Beijing.. The purity of all tested compounds is more than 95%. The following antibodies were used: Mouse anti-His (TA-02; ZSGB-Bio), Mouse anti-Flag (8146S; CST), rabbit anti-Flag (B1020; Biodragon), Mouse anti-NPC1 (ab134113; Abcam), Mouse anti-p24 (ab9071; Abcam), Rabbit anti-p24 (produced by our own lab), Mouse anti-Lamp1 (ab24170; Abcam), Mouse anti-β-actin monoclonal antibody (Abcam) and goat anti-rabbit secondary antibody (Beijing zhongshan jinqiao Biotechnology). Alexa Fluor-conjugated secondary antibodies were purchased from Life Technologies."
            ],
            "subsections": [
                {
                    "title": "Generation of recombinant HIV pseudotyped with virus glycoproteins",
                    "paragraphs": [
                        "Ebola pseudotyped viruses (EBOV-GP/HIV-luc) were produced as previously described (24). Pseudotyped viruses bearing VSV envelope protein (VSV-G/HIV-luc) and MARV envelope protein (MARV-GP/HIV-luc) were produced in a similar way."
                    ],
                    "subsections": []
                },
                {
                    "title": "Infection assay",
                    "paragraphs": [
                        "Screening of the selected compounds using pesudotyped virus was performed in 96-well plates as previous described (24). Briefly, cells were infected with the EBOV-GP/HIV-luc in the presence of compounds at a final concentration of 10 μM. The infected cells were lysed and the anti-EBOV activity of test compounds was evaluated by measuring the luciferase activities at 48 h post infection (hpi). DMSO and TET were used as negative and positive controls, respectively. The VSV-G/HIV-luc was used as a control to determine the specificity of compounds. The 50% effective concentration (EC50) and EC90 values were calculated by using a four-parameter logistic regression in Prism 5 (GraphPad).",
                        "To analyze the retention of EBOVpp virions in newly infected cells, HEK293T cells were infected with EBOV-GP/HIV-luc at an MOI of 1.0 in the presence of MG132 (4μM). After 4 h, cells were fixed in 4% paraformaldehyde for 30 min on ice and virus was stained with rabbit or mouse anti-p24 antibody, followed by an anti-Rabbit AlexaFluor-555 antibody or anti-mouse AlexaFluor-488 antibody. Fluorescence was monitored with a confocal microscope with a 100× oil objective lens.",
                        "To assess the effect of berbamine hydrochloride on EBOV and MARV replication, Vero E6 cells were pretreated with drug (0 to 200 μM) or DMSO for 1 h at 37°C and infected at a multiplicity of infection (MOI) of 0.1 with EBOV expressing enhanced green fluorescent protein (EBOV-EGFP) or wild type MARV for 1 h at 37°C, after which the inoculum was removed and replaced with fresh medium (DMEM plus 2% FBS). Cells were further incubated for 72 h in the presence of EEI-10 or DMSO. For EBOV-EGFP-infected cells fluorescence was quantified on a Biotek Synergy HTX plate reader. The percent relative infectivity was determined by comparing fluorescence readings of EEI-10-treated cells to those of DMSO-treated control cells. For MARV-infected cells, supernatants were harvested and viral RNA was quantified, as described below. The percent relative infectivity was determined by comparing the amount of viral RNA detected in EEI-10 treated cells to that of DMSO-treated control cells."
                    ],
                    "subsections": [
                        {
                            "title": "qRT-PCR",
                            "paragraphs": [
                                "For HIV-based infections, total RNA was extracted from infected cells by use of an RNA extraction kit (Tiandz)."
                            ],
                            "subsections": [
                                {
                                    "title": "The level of viral RNA was determined by performing qRT-PCR analysis by use of a one-step SYBR PrimeScript",
                                    "paragraphs": [
                                        "RT-PCR kit. The primer pair (5'-TTAAGCCTCAATAAAGCTTGCC-3' and 5'-GTTCGGGCGCCACTGCTAGA-3') amplifies the LTR of HIV. Levels of cellular glyceraldehyde-3-phosphate dehydrogenase (GAPDH) RNA were amplified with primers 5'-ATCATCCCTGCCTCTACTGG-3' and 5'-GTCAGGTCCACCACTGACAC-3'; the results served as an internal control to normalize the level of HIV RNA.",
                                        "For MARV infections, viral RNA was extracted from tissue culture supernatants using the QIAamp viral RNA minikit (Qiagen). Viral RNA levels were quantified by qRT-PCR using the LightCycler 480 thermal cycler (Roche) and the LightCycler 480 RNA Master Hydrolysis Probes kit (Roche) along with the following primers and probe: 1-F, 5ʹ-GCAAAAGCATTCCCTAGTAACATGA-3ʹ; 1-R, 5ʹ-CACCCCTCACTATRGCGTTYTC-3ʹ; 2-F, 5ʹ-GCGAAGGCATTCCCTAGTAATATGA-3ʹ; 2-R, 5ʹ-CACCTCTTACTATGGCATTCTC-3ʹ; probe, 5ʹ-56-FAM/TGGCAC CAY/ZEN/AATTCAGCAAGCATAGG/ 3IABkFQ-3ʹ. Cycling conditions were as follows: 63 o C for 3 min and 95 o C for 30s, then 45 cycles of 95 o C for 15 s and 60 o C for 30 s."
                                    ],
                                    "subsections": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "Cytotoxicity analysis",
                    "paragraphs": [
                        "HEK293T and Vero E6 cells were seeded in 96-well plates. Following overnight incubation at 37°C, Tetrandrine and Berbamine hydrochloride were added at different concentrations used for the viral infection studies. Cells in culture media without drug served as control. At 48h, Cell Counting kit-8 (CCK-8, Beyotime, China) was used to evaluate cell viability."
                    ],
                    "subsections": []
                },
                {
                    "title": "Blam-Vpr releasing assay",
                    "paragraphs": [
                        "For production of pseudotyped viruses incorporating Blam-Vpr, HEK293T cells were transfected with 6 μg of pNL4-3.Luc.R-E-, 6 μg of pEbola-GP or pVSV-GP, 3 μg of pBlam-Vpr and 1.5 μg of pAdvantage using Lipo2000 in 10-cm dishes. Culture supernatants were collected after 48 h and filtered through a 0.45 μm filter. The virus was concentrated by ultracentrifugation at 36000 rpm for 4 h pelleting through a 20% sucrose cushion or by Centrifugal Filters (100 Kd). Detection of virus capsid release into the cell cytoplasm was performed using LiveBLAzer FRET-B/G Loading Kit with CCF4-AM (Invitrogen) according to manufacturer instructions. Briefly, HeLa or SupT1 cells were seeded on 6-well plates 1 day before the assay. After preincubation with each drug for 1 h, cells were infected with EBOV-GP/HIV-luc or VSV-GP/HIV-luc for 2 h at 37°C in the presence of the drug. After loading CCF4-AM substrate, cells were fixed in 4% paraformaldehyde and Amcyan or Pacific Blue fluorescence signals were detected by FACS."
                    ],
                    "subsections": []
                },
                {
                    "title": "Time-of-addition experiment",
                    "paragraphs": [
                        "Berbamine hydrochloride (1 μM), Tetrandrine (1 μM) and Efavirenz (5 nM) were added to the 293T cell culture medium before infection (-1h), during infection (0 h), and 1, 4, 5, 6, 8, 18, and 24 hpi. Viral replication was determined at 48 hpi as described above. Cell culture treated with DMSO or TET was used as negative and positive control, respectively. The HIV-1 reverse transcriptase inhibitor EFV was used to confirm the rationality of our assay system."
                    ],
                    "subsections": []
                },
                {
                    "title": "Virus binding experiment",
                    "paragraphs": [
                        "For binding tests, 4×10 5 HEK293T cells were seeded in 6-well plates overnight and infected with EBOV-GP/HIV-luc for 1 h at 4°C in the presence of Tetrandrine (5 μM), Berbamine hydrochloride (5 μM) and Heparin (5 μg/mL), followed by washing with PBS, and virus absorption on the cell surface was quantified through the measurement of viral genomic RNA by qRT-PCR."
                    ],
                    "subsections": []
                },
                {
                    "title": "In vitro protease cleavage of EBOV-GP/HIV-luc",
                    "paragraphs": [
                        "Concentrated EBOV-GP/HIV-luc was stocked in HEPES-MES buffer (40 mM HEPES, 40 mM morpholinepropanesulfonic acid, 50 mM NaCl, 0.5mM CaCl2, pH 7.5), the GP protein was cleaved by 0.5 mg/mLthermolysin (Promega, Madison, WI) at 37°C for 1h. The reaction was stopped by 0.5 mM EDTA and protease inhibitors. The cleavage efficiencies were confirmed by immunoblotting using anti-Flag antibody.",
                        "Then HEK293T cells were incubated with the cleaved or uncleaved EBOV-GP/HIV-luc in the presence of the drug for 48h, the luciferase activities were detected to evaluate the antiviral efficiencies of drugs."
                    ],
                    "subsections": [
                        {
                            "title": "In situ PLA",
                            "paragraphs": [
                                "In situ PLA was performed using kits from Sigma Aldrich: Duolink® PLA Detection Reagents (DUO92101) according to the manufacturer. Briefly, 4% paraformaldehyde-fixed samples were incubated with blocking solution to saturate nonspecific binding and subsequently with primary antibodies at 37°C for 1 h. Thereafter, slides were incubated for 1 h at 37°C with Duolink® PLA probes. Ligation solution was added for 30 min at 37°C. Ligation solution was removed with wash buffer A, and amplification solution was added for 100 min at 37°C and removed with wash buffer B. Finally, Duolink in situ mounting medium with DAPI was added. Fluorescence was monitored with a confocal microscope with a 100× oil objective lens."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Co-IP for Ebola GPcl and NPC1",
                    "paragraphs": [
                        "HEK293T cells were transfected with plasmid expressing NPC1-C-Flag using Lipo2000 in 10 cm dishes for 48 h, cells were lysed by NP40 and debris was removed through centrifugation at 12000 rpm for 10 min.",
                        "Tetrandrine (10 μM), Berbamine hydrochloride (10 μM) were pre-incubated with GPcl-His (1 μg) for 1h before mixing with cell lysate. Anti-His antibody coated beads were used to pull down GPcl-His and the bound NPC1-C-Flag was detected through WB."
                    ],
                    "subsections": []
                },
                {
                    "title": "Analysis of intracellular cholesterol",
                    "paragraphs": [
                        "Hela cells were pretreated with Tetrandrine (5 μM), Berbamine hydrochloride (5 μM), U18666A (5 μM) for 24h, and then cells were collected and fixed with paraformaldehyde (4%) for 30 min on ice. After three PBS washes, cells were incubated with 50 μg/mL filipinⅢ complex in the dark for 1 h at RT. After three PBS washes, cells were detected by FACS in the DAPI channel."
                    ],
                    "subsections": []
                },
                {
                    "title": "Bio-layer Interferometry (BLI) binding assay",
                    "paragraphs": [
                        "Octet RED (ForteBio, Inc., CA, USA) was used to measure binding affinity and kinetic profile. The purified GPcl was biotinylated by EZ-Link NHS-LC-LC-Biotin (Thermo Scientific). The biotinylated GPcl (50 μg/ml) was then captured via super streptavidin (SSA) biosensors (120 sec, at 30 °C, with 1000 rpm). A duplicate set of sensors were incubated in assay buffer (0.002% Tween-20, PBS, pH=7.4) without protein for use as a background binding control. Both the ligand and reference biosensors were quenched with 5 μg/ml biotin for 1 min. For KD determinations, the binding of a dilution series of compounds was detected for 60 sec association (kon, 1/Ms) followed by 60 sec dissociation (kdis, 1/s) in parallel to the ligand biosensors and reference biosensors. Besides, blank binding cycles using buffer only were used to correct the baseline shift during the analysis. After measurements were complete, a double reference subtraction method was processed to subtract the effect of baseline drift and nonspecific binding. KD acquired from fitting into 1:1 binding model by global fitting of multiple kinetic traces and analyzed by Data Analysis 9.0 software."
                    ],
                    "subsections": []
                },
                {
                    "title": "Computational methods",
                    "paragraphs": [
                        "Using Auto-Dock Vina package (33), structure based virtual screening was carried out over 4114 compounds in the focused database. Based on the crystal structure of GPcl in complex with the receptor, we first generated the docking parameter files using AutoDockTools-1.5.6. The grid center was located at the receptor-binding region on the head of GPcl and was designated at dimensions (x, y, and z): 34.428 Å, -17.200 Å, and -317.00 Å. The grid size was set to 24 Å, 28 Å, and 28 Å on X, Y and Z coordinates, respectively.",
                        "Then we used Open Babel software to create the ligand parameter files for docking (34). Each compound in the library was assigned hydrogen at pH 7.4 and converted to PDBQT format. Finally, all these compounds were docked to GPcl and ranked by their calculated binding free energies (ΔGADV). The molecular dynamic simulation and MM-GBSA calculation were performed as previously described (24,35)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Animal ethics statement",
                    "paragraphs": [
                        "Animal experiments were performed in the containment level 4 laboratories at CSCHAH. All experimental protocols were reviewed and approved by the institutional Animal Care Committee in accordance with guidelines from the Canadian Council on Animal Care. All staff working on animal experiments completed education and training programs according to the standard protocols appropriate for this level of biosafety."
                    ],
                    "subsections": []
                },
                {
                    "title": "Efficay of berbamine hydrochloride in EBOV-infected mice",
                    "paragraphs": [
                        "Six-to eight-week-old female BALB/c mice (Charles River) were inoculated intraperitoneally with 1,000× the 50% lethal dose (LD50) of MA-EBOV. Mice were treated with 100 mg/kg of body weight of berbamine hydrochloride via oral administration beginning on either day -1 or day +1 post-infection and continuing daily up to day 6 post-infection. Animals in the control group were treated with PBS following the same schedule. Mice were observed daily for weight change and clinical signs. Extended Data Table S1. Information of the selected 46 compounds, including the predicted binding free energies (∆GADV), TargetMol ID, CAS number, formula, and molecule weight (MolWt)."
                    ],
                    "subsections": []
                },
                {
                    "title": "No. ID",
                    "paragraphs": [
                        "∆GADV CAS Formula MolWt (Kcal/mol) The residues are ranked by the values of their total energy. The top 10 residues are shown.",
                        "Extended Data Table S3. Calculation of the interaction energy between EEI-10 and amino acid residues of MARV-GP1a. The residues are ranked by the values of their total energy. The top 10 residues are shown.      "
                    ],
                    "subsections": []
                },
                {
                    "title": "Residue van der Waals",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Conflicts of Interest:",
                            "paragraphs": [
                                "The authors declare no conflict of interest."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Cell lines, Plasmids and Virus",
                    "paragraphs": [
                        "HEK293T, Vero E6 and HeLa cells were obtained from the American Type Culture Collection and maintained at 37 o C and 5% CO2 in DMEM supplemented with 10% HI-FBS, 2 mM L-glutamine, 50 U/ml penicillin, and 50 ug/ml streptomycin. Plasmids encoding EBOV-GP, vesicular stomatitis virus envelope protein (VSV-GP) and HIV-l luciferase reporter vector pNL4-3.Luc.R-E-were kept in the Institute of Medicinal Biotechnology, Beijing. The GP genes of MARV (GenBank Accession No. ABA87127.1, amino acid (a.a.) 5941-7986) were synthesized by Suzhou GENEWIZ Biotechnology Co., Ltd., and inserted into pcDNA3.1(+) vector (Invitrogen). "
                    ],
                    "subsections": []
                },
                {
                    "title": "Compounds and antibodies",
                    "paragraphs": [
                        "TargetMol's small-compound library subsets (anti-virus compound library, anti-infection compound library, nature compound library, plant-sourced compound library, anti-inflammation library, and inhibitors library) were used for virtual screening. Small molecules selected from docking procedure were purchased from Data are presented as mean ± standard deviation (SD) from at least three independent experiments.. Statistical comparisons of the Kaplan-Meier survival curves (Fig. 5b,d) were performed using the Log-rank test. p-values are indicated as follows: p≤0.05(*), p≤0.01(**), p≤0.001(***). n.s. = not significant."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}