{
    "id": "https://semopenalex.org/work/W2114846962",
    "authors": [
        "Stéphane Culine",
        "Jean‐Jacques Patard",
        "Nathalie Rioux‐Leclercq",
        "Bruno Darbouret",
        "Pierre‐Jean Lamy",
        "Patrick Jouin",
        "Patricia Fergelot",
        "Gaïané Sarkissian"
    ],
    "title": "Identification of Pro-MMP-7 as a Serum Marker for Renal Cell Carcinoma by Use of Proteomic Analysis",
    "date": "2008-03-01",
    "abstract": "Background: No validated renal cell carcinoma (RCC) marker is known for detection of asymptomatic disease in selected populations or for prognostic purposes or treatment monitoring. We identified immunogenic proteins as tumor markers for RCC by combining conventional proteome analysis with serological screening, and we investigated the diagnostic clinical value of such markers in serum. Methods: We studied the immunogenic protein expression profile of CAL 54, a human RCC cell line, by 2-dimensional electrophoresis combined with immunoblotting using sera from healthy donors compared with RCC patients. We developed a homogeneous, fluorescent, dual-monoclonal immunoassay for metalloproteinase 7 (MMP-7) and used it to measure MMP-7 in sera from 30 healthy donors, 30 RCC patients, and 40 control patients. Results: Pro-MMP-7 (29 kDa; pI 7.7) in the CAL 54 cell line secretome was an immunogenic protein reactive with RCC patient sera but not with control sera. The concentrations of pro-MMP-7 were increased (P <0.0001) in sera of RCC patients (median 7.56 μg/L; range 3.12–30.5 μg/L) compared with healthy controls (median 2.13 μg/L; range 0.17–3.5 μg/L). Serum pro-MMP-7 had a sensitivity of 93% (95% CI 78%–99%) at a specificity of 75% (59%–87%) for RCC in the samples tested. Conclusion: Proteomics technology combined with serology led to the identification of serum pro-MMP-7 as a marker of RCC and represents a powerful tool in searching for candidate proteins as biomarkers.",
    "sections": [
        {
            "title": "BACKGROUND:",
            "paragraphs": [
                "No validated renal cell carcinoma (RCC) marker is known for detection of asymptomatic disease in selected populations or for prognostic purposes or treatment monitoring. We identified immunogenic proteins as tumor markers for RCC by combining conventional proteome analysis with serological screening, and we investigated the diagnostic clinical value of such markers in serum."
            ],
            "subsections": [
                {
                    "title": "METHODS:",
                    "paragraphs": [
                        "We studied the immunogenic protein expression profile of CAL 54, a human RCC cell line, by 2-dimensional electrophoresis combined with immunoblotting using sera from healthy donors compared with RCC patients. We developed a homogeneous, fluorescent, dual-monoclonal immunoassay for metalloproteinase 7 (MMP-7) and used it to measure MMP-7 in sera from 30 healthy donors, 30 RCC patients, and 40 control patients.",
                        "RESULTS: Pro-MMP-7 (29 kDa; pI 7.7) in the CAL 54 cell line secretome was an immunogenic protein reactive with RCC patient sera but not with control sera. The concentrations of pro-MMP-7 were increased (P Ͻ0.0001) in sera of RCC patients (median 7.56 g/L; range 3.12-30.5 g/L) compared with healthy controls (median 2.13 g/L; range 0.17-3.5 g/ L). Serum pro-MMP-7 had a sensitivity of 93% (95% CI 78%-99%) at a specificity of 75% (59%-87%) for RCC in the samples tested.",
                        "CONCLUSION: Proteomics technology combined with serology led to the identification of serum pro-MMP-7 as a marker of RCC and represents a pow-erful tool in searching for candidate proteins as biomarkers."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "PATIENTS AND CONTROLS",
                    "paragraphs": [
                        "This retrospective study included serum samples from 30 RCC patients and 40 patients with benign or malignant conditions. The samples were collected from May to December 2005 at the University Hospital Center-Pontchaillou Hospital in Rennes (France) and the Val d'Aurelle-Paul Lamarque Cancer Institute in Montpellier (France) in accordance with ethics guidelines. All samples were obtained at the time of RCC diagnosis and before immunotherapy or surgery. Table 1 summarizes patient demographics and tumor characteristics. We obtained serum from 30 healthy individuals as unused amounts remaining from routine sampling in occupational medicine. Informed consent was obtained from all participants.",
                        "All venous blood samples were collected in vacutainer tubes without clot accelerator for preparation of pure serum (Becton Dickinson) and were centrifuged within 30 min after venipuncture at 2000g for 15 min at 4 °C. The supernatants were carefully removed and stored in aliquots at Ϫ20 °C until analyzed."
                    ],
                    "subsections": []
                },
                {
                    "title": "CELL CULTURE AND SAMPLE PREPARATION",
                    "paragraphs": [
                        "We purchased the human CAL54 cell line established from the malignant pleural effusion of an RCC patient from the German Collection of Microorganisms and Cell Cultures (DSMZ GmbH). We maintained the cell line in DMEM supplemented with 10% fetal calf serum, 2 mmol/L glutamine, 100 kU/L streptomycin, 400 kU/L penicillin, 400 g/L hydrocortisone, and 100 mmol/L sodium pyruvate. Cells were switched from serum-supplemented DMEM to serum-free DMEM when the cell density was 4 ϫ 10 9 cells/L and incubated at 37 °C, 5% CO 2 , for 48 h. Cell supernatants containing secreted proteins were then collected, passed through a 0.2-nm filter (Millipore) to remove cell debris, and dialyzed against 20 mmol/L Tris-HCl (pH 6.8). Samples were then precipitated with ice-cold 800 mL/L ethanol for 1 h and centrifuged at 38000g for 25 min at 4 °C. Precipitates were washed with 800 mL/L ethanol."
                    ],
                    "subsections": []
                },
                {
                    "title": "2DE AND IMMUNOBLOTTING",
                    "paragraphs": [
                        "Ethanol precipitates were resuspended in isoelectrofocusing medium containing 8 mol/L urea, 20 g/L CHAPS, 20 mL/L Triton X-100, 8 g/L Pharmalyte 3-10 (Amersham Biosciences), 100 mmol/L dithiothreitol, 2 mL/L Tergitol NP7 (Sigma), and traces of bromophenol blue (26 ). We loaded 100 g (analytical gels) or 300 g (preparative gels) total secreted protein onto nonlinear immobilized pH gradient (IPG) strips (Immobiline Dry-Strips, pH 3-10, 18 cm long; Amersham Biosciences) and performed isoelectric focusing with IPGphor (Amersham Biosciences) according to the manufacturer's instructions. After the first dimension, the IPG strips were equilibrated for 10 min at room temperature in a buffer containing 6 mol/L urea, 50 mmol/L Tris-HCl (pH 6.8), 300 g/L glycerol, 20 g/L SDS, 10 g/L dithiothreitol, and bromophenol blue and then for 15 min in the same buffer containing 15 g/L iodoacetamide instead of dithiothreitol. SDS-PAGE was performed at 20 mÅ/gel with 12.5% polyacryl-amide gels (20 cm ϫ 20 cm ϫ 1 mm). The running buffer consisted of 25 mmol/L Tris, 192 mmol/L glycine, and 1 g/L SDS. The gels were silver-stained according to the procedure of Shevchenko et al. (27 ), and gel images were scanned by use of a flatbed scanner.",
                        "For immunoblotting, we transferred proteins from 2DE gels onto nitrocellulose membranes (Bio-Rad Laboratories). After blocking for 30 min in Trisbuffered saline (500 mmol/L NaCl, 20 mmol/L Tris-HCl, pH 6.8) supplemented with 30 g/L gelatin (Prolabo), membranes were incubated for 1 h at room temperature with serum pools (1:100 dilution). Serum pools consisted of equal volumes of serum from 6 RCC patients (stage II to IV) or 10 healthy donors. The immunoproduct was visualized with a monoclonal antihuman IgG-alkaline phosphatase conjugate (Sigma) and with a nitroblue tetrazolium/5-bromo-4-chloro-3-indolyl phosphate (NBT-BCIP) colorimetric substrate (Pierce). Each wash and antibody dilution was performed with Tris-buffered saline supplemented with 0.05% Tween 20 and 1% gelatin. Gel matching and spot evaluation were performed using Melanie II software (Gene-Bio). We compared immunoreactive spots that were positive with RCC patient serum with blots probed with normal serum to identify spots of interest."
                    ],
                    "subsections": []
                },
                {
                    "title": "PROTEIN IDENTIFICATION",
                    "paragraphs": [
                        "Proteins of interest were excised and digested in gel using sequencing-grade trypsin (Promega) according to the method of Shevchenko et al. (27 ). We mixed peptide mixtures with 10 g/L ␣-cyano-4-hydroxy-transcinnamic acid in an aqueous solution containing 500 mL/L acetonitrile and 5 mL/L trifluoroacetic acid and loaded them on the target of a BIFLEX III MALDI-TOF mass spectrometer (Bruker-Daltonik) using the dry-droplet procedure (28 ). Spectra were analyzed using XTOF software (Bruker-Franzen Analytik), and trypsin autoproteolysis products (m/z 842.51 and 1045.56) were used as internal calibrators. The mass accuracy of our analyses was usually better than Ϯ50 ppm. We performed tandem mass spectrometry of selected peptides on a quadrupole time-of-flight mass spectrometer (QSTAR; AppliedBiosystems)."
                    ],
                    "subsections": []
                },
                {
                    "title": "ANTIBODIES AND RECOMBINANT PROTEIN",
                    "paragraphs": [
                        "We purchased recombinant human MMP-7 from R&D Systems. For the generation of anti-MMP-7 antibodies, we immunized four 6-week-old female BALB/c mice with 26 g human recombinant MMP-7 dissolved in 11 mmol/L sodium phosphate buffer (pH 7.2) containing 140 mmol/L NaCl. Subsequent booster injections of immunogen were administered at 4-week intervals. The fusion was done with X63 mouse myeloma cells (P3-X63-Ag8.653) 3 months after initial immunization. We screened 4 clones (01S, 04S, 21S and 29S) by homogeneous fluoroimmunoassay as described in \"Immunoassay.\" The antibodies were purified by protein A Fast Flow affinity chromatography (Amersham) according to the manufacturer's instructions."
                    ],
                    "subsections": []
                },
                {
                    "title": "WESTERN BLOT ANALYSIS",
                    "paragraphs": [
                        "We loaded 10 g total protein/lane of CAL54 cell supernatant or 1 mg of total protein from each of 5 RCC sera and 5 healthy sera on NuPAGE 4%-12% Bis-Tris gels (Invitrogen) before proteins were transferred onto nitrocellulose membranes (Bio-Rad Laboratories).",
                        "Western blot analysis was performed as described in \"2DE and Immunoblotting.\" The membranes were probed with the following clone antibodies at a 1:1000 dilution: 01S, 04S, 21S, and 29S. As second antibody, we used goat antimouse IgG-alkaline phosphatase conjugate (Sigma). As a control, we used 0.1 g of recombinant human MMP-7 for every gel."
                    ],
                    "subsections": []
                },
                {
                    "title": "IMMUNOASSAY",
                    "paragraphs": [
                        "We set up a homogeneous sandwich fluoroimmunoassay using time-resolved amplified cryptate emission (TRACE) technology (29 ). Purified antihuman MMP-7 monoclonal antibodies of clones 29S and 01S were coupled to AF647 fluorophore (Molecular Probes Inc.) and to europium cryptate TBP-mono-MP (Cis Bio International), respectively. We performed the coupling reactions according to the manufacturers' coupling protocols.",
                        "The stock AF647-conjugated antibody and cryptate-conjugated antibody solutions were diluted to 5 mg/L and 0.35 mg/L, respectively, with assay buffer (100 mmol/L sodium phosphate, 1 g/L bovine serum albumin, 600 mmol/L KF, 0.2 g/L nonspecific mouse IgG, pH 7.1) before use. We diluted the culture supernatant of the CAL54 cell line containing natural MMP-7 with newborn calf serum (Sigma) to give MMP-7 calibrators that ranged from 0.5 to 40 g/L.",
                        "Calibrators were assigned values by analysis against highly purified recombinant human MMP-7 (R&D Systems). We performed the immunoassay by incubating 50 L of each patient's sample/calibrator, 50 L AF647-conjugated antibody solution, and 50 L cryptate-conjugated antibody solution at 37 °C on Brahms Kryptor automate (Cezanne SAS), according to the manufacturer's instructions. We performed hybridoma cell line screening by use of cryptateconjugated goat antimouse IgG (Sigma) and AF647conjugated recombinant human MMP-7 diluted to 0.3 mg/L and 1 mg/L, respectively, with assay buffer."
                    ],
                    "subsections": []
                },
                {
                    "title": "STATISTICAL ANALYSIS",
                    "paragraphs": [
                        "We performed the entire statistical analysis with GraphPad Prism 4.0. The distribution was tested using the Kolmogorov-Smirnov test. Nonparametric data were compared using the Mann-Whitney U test. A P value Ͻ0.05 was considered to indicate statistical significance. We performed ROC curve analysis to quantify serum MMP7 positivity and statistical uncertainty."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "IDENTIFICATION OF pro-MMP-7 IN RCC CELL LINE AS AN IMMUNOGENIC PROTEIN",
                    "paragraphs": [
                        "To identify proteins reacting with IgG molecules in sera obtained from RCC patients and/or healthy volunteers, total secreted protein extract obtained from CAL 54 cell line supernatant was subjected to 2DE combined with immunoblotting using serum sample pools obtained from 6 RCC patients or 10 healthy volunteers.",
                        "Three hundred seventeen protein spots appeared to be secreted by the CAL 54 cell line (Fig. 1). Computer-assisted subtraction of the control sera spot pattern from the patient sera spot pattern obtained using CAL 54 cell line blots resulted in the identification of 12 different spots (S1 to S12, Fig. 1). We could identify 11 of the proteins representing different metabolic pathways by use of a peptide mass fingerprinting method (data not shown). One spot among them, with an apparent mass of 29 kDa and pI 7.5, was identified as MMP-7 (spot S4 in Fig. 1). The peptide mass spectrum of S4 showed the presence of 2 peptides corresponding to pro-MMP-7. The peptides were sequenced by tandem mass spectrometry (FYLYDSETK and VIEIMQKPR) and were identical to residues 42-50 and 78 -86 of human pro-MMP-7 according to the sequence homology search (Swiss-Prot acc. no. P09237; data not shown)."
                    ],
                    "subsections": []
                },
                {
                    "title": "SPECIFICITY OF THE MONOCLONAL ANTIBODIES",
                    "paragraphs": [
                        "We obtained 4 clones secreting monoclonal antibodies against the human recombinant MMP-7. To characterize the specificity of each monoclonal antibody, we performed Western blotting using human recombinant MMP-7 and CAL 54 cell line supernatant. The monoclonal antibodies of clones 01S, 04S, 21S, and 29S recognized the active MMP-7 with 19 kDa in human recombinant MMP-7 by immunoblotting (data not shown).",
                        "The Western blot of CAL 54 cell line supernatant revealed the bands corresponding to pro-MMP-7 (29 kDa) using the antibodies of clones 01S, 04S, 21S, and 29S and mature active MMP-7 (19 kDa) using the antibodies of clones 04S, 21S, and 29S. We confirmed that 2 forms of MMP-7 are present in CAL 54 cell line supernatant (Fig. 2, data not shown for clone 21S)."
                    ],
                    "subsections": []
                },
                {
                    "title": "QUALITATIVE ANALYSIS OF SERUM MMP-7",
                    "paragraphs": [
                        "To characterize the serum isoforms of MMP-7, we performed Western blot analysis. Serum samples obtained from renal cancer patients and controls showed a 29-kDa band corresponding to pro-MMP-7 (Fig. 3). Surprisingly, no band corresponding to active MMP-7 was observed, although we used antibodies recognizing both forms of MMP-7."
                    ],
                    "subsections": []
                },
                {
                    "title": "INCREASED SERUM CONCENTRATION OF MMP-7 IN PATIENTS WITH RCC",
                    "paragraphs": [
                        "We developed a homogeneous sandwich fluoroimmunoassay for MMP-7 using a combination of cryptateconjugated antibody (clone 01S) and AF647-labeled antibody of clone 29S. The reaction time of the assay was 50 min.",
                        "The calibration curve of the immunoassay had a coefficient of linear correlation (r 2 ) Ͼ0.99 (slope 2.63, intercept 10.42). The intraassay CV was 4.2% at 3.1 g/L (n ϭ 10). Recovery was performed by adding 10 g/L of recombinant MMP-7 to 5 serum samples.",
                        "The average (SD) recovery was 96% (9%); 5 samples showed recoveries between 89% and 109%.",
                        "With this assay, low MMP-7 concentrations were detected in serum from healthy controls (n ϭ 30, median 2.13 g/L, range 0.17-3.5 g/L). In contrast, MMP-7 was significantly higher (P Ͻ0.0001) in patients with localized (n ϭ 19, median 7.26 g/L, range 3.12-27.9 g/L) and metastasized (n ϭ 11, median 7.87 g/L, range 4.25-30.5 g/L) RCC. The distribution of the data is shown in Fig. 4.",
                        "The results of serum MMP-7 measurement in RCC or non-RCC patients are summarized in Table 2. Of the 30 RCC patient serum samples measured, 28 (93%, 95% CI 78%-99%) had an increased MMP-7  concentration. The positive rates for patients without renal cancer, 25%, were much lower than in RCC (Table 2)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "A combination of 2DE expression profiling of tumor cell lines or tissues and immunoblotting with patient and control sera such as Proteomex or Spear might serve as a powerful tool for identification of tumorassociated antigens. Antigens eliciting a humoral response might be employed in cancer screening and diagnosis, in establishing a prognosis, or as novel therapeutic targets. So far, this experimental approach has been successfully implemented in lung carcinoma, hepatocellular carcinoma, and RCC (15,16,30,31 ). To seek for candidates as new circulating RCC markers, we explored an alternative approach based on the use of patient sera to probe 2DE Western blots of RCC cell line supernatant, rather than tumor cell lysates or tissues as in the Proteomex or Spear techniques. In this study, the results showed IgG immunoreactivity against 12 proteins secreted by the CAL54 cell line.",
                "Our experiments have produced two important findings. The first is that the presence of pro-MMP-7 as immunogenic protein in RCC cell line supernatant was confirmed by an approach combining secretome analysis with serological screening. This is the first demonstration of antibodies to pro-MMP-7 in cancer patients, although numerous circulating antitumor antibodies have been detected in cancer patient sera, with identified antigens such as Her2/neu (32 ), thymidine phosphorylase (16 ), and PGP9.5 (30 ). Furthermore, we detected 2 forms of MMP-7 in CAL 54 cell line supernatant: pro-MMP-7 and mature MMP-7, which is the result of activation of the proenzyme; however, our results demonstrated an IgG immunoreactivity only against the proenzyme. The IgG response spe-  cific to pro-MMP-7 might be associated with presence of N-terminal proregion neoepitope created in renal carcinoma cells and elicited T-cell stimulatory activity. For example, neoepitopes created by mutations in the human triosphosphate isomerase have been found in melanoma cells causing enhanced T-cell activity compared with the wild-type epitope (33 ).",
                "We have developed for the first time a homogeneous fluorescent immunoassay for MMP-7 by using 2 monoclonal antibodies (clones 01S and 29S) that recognize both active MMP-7 and pro-MMP-7 in RCC cell line supernatant by immunoblotting analysis. Thus the newly developed immunoassay can detect 2 forms of MMP-7. Zymogen MMP-7 in healthy and RCC human sera could be observed in qualitative Western blot analysis, but active MMP-7 was not detected in human serum, although antibodies recognizing 2 forms of MMP-7 were used. Ohuchi et al. (25 ) mentioned that pro-MMP-7 exists in human serum as polymers or complexed with serum proteins. Furthermore, the same group has reported undetectable levels of active MMP-7 in human normal serum using enzyme immunoassay for human active MMP-7 (34 ). Western blot data on healthy and RCC human sera therefore suggest that the level of active MMP-7 may be below the detection limit of our immunoblotting system (Ͻ0.7 g/L), or that pro-MMP-7 could be the sole form circulating in healthy and RCC human sera.",
                "Our second finding is raised MMP-7 concentrations in RCC patient sera using TRACE immunoassay. Recent data suggest a role for MMPs in a number of renal pathophysiologies (35 ). Many studies have shown that the overexpression of MMP-7 in several cancers is associated with advanced clinicopathological stages and unfavorable prognosis (21,36 ). Increased expression of MMP-7 has been observed in high-grade RCC tumors (24 ). Recently, Miyata et al. (37 ) mentioned that the MMP-7 status of RCC tissues was a strong predictor of poor prognosis. None of the studies described above have suggested that MMP-7 or pro-MMP-7 levels may be used as humoral markers for detection of RCC.",
                "Here we report raised MMP-7 concentrations in sera from patients with primary and metastasized RCC at stages I to IV. Because of small patient numbers, we could not show statistically significant correlation between serum MMP-7 levels and different stages of RCC patients. The potential association of serum MMP-7 with progression of RCC or tumor load requires further investigation using a larger sample.",
                "Certainly the presence of MMP-7 in serum is not specific to renal cancer; future studies including a larger sample should therefore aim to determine its serum concentration in patients with various tumors and benign renal diseases. Although we found MMP-7 in the serum of patients with some cancers or benign kidney tumors, the positivity was much lower than in RCC. Consequently the specificity of MMP-7 is limited, and this will restrict the use of MMP-7 for wide screening of the population.",
                "On the other hand, the high sensitivity for serum MMP-7 in RCC patients could allow the use of this marker for the following essential needs. The first is the routine screening of especially high-risk populations (Von Hippel-Lindau, hemodialysis, and transplanted or immunodepressed patients (38 )) and detection of asymptomatic tumors. In this setting, RCC is currently being detected either by CT scan as part of a screening policy or from symptoms reflecting advanced disease. Therefore, to improve survival, it makes sense to detect asymptomatic tumors, which have proven less aggressive than symptomatic counterparts (39 ). The second need is prognostication in RCC, which is important for counseling patients, adapting follow-up, and selecting patients for clinical trials. For example, a sensitive humoral RCC marker test would be valuable for detecting tumor recurrence in patients with RCC after total or partial nephrectomy. Such a marker will allow full evaluation of the spread of the disease. It may help to limit the use of invasive examination and to adapt therapeutics earlier. No biological prognostic parameter is currently recognized in clinical practice. Serum VEGF is an interesting candidate, but conflicting results have been obtained so far (40 ).",
                "Finally, in the era of new targeted therapies it is increasingly important to have reliable indicators for predicting drug response and for monitoring treatment. In summary, such a humoral marker will facilitate the monitoring of tumors during treatment and allow better prediction of therapeutic responses and prognosis.",
                "Grant/funding Support: This work was supported by a grant from the Languedoc-Roussillon Region (France). Financial Disclosures: None declared."
            ],
            "subsections": []
        }
    ]
}