{
    "id": "US20130296316",
    "authors": [
        "Michael P. Pollastri",
        "Miguel Navarro",
        "Stephen Beverley",
        "Ana Rodriguez"
    ],
    "title": "Antiparasitic Agents Based On mTOR Inhibitors",
    "date": "2011-07-11 00:00:00",
    "abstract": "Disclosed is the use of mammalian target of rapamycin (mTOR) and/or phosphoinositide-3-kinase (PI3K) inhibitors as antiparasitic drugs, particularly in those parasitic infections caused by trypanosomatid parasites {Trypanosoma sp. and Leishmania sp.). These inhibitors are useful as trypanocides.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "GRANTS",
                    "paragraphs": [
                        "The following grants supported the disclosure herein: National Institutes of Health, 1F32AI091219-01 and National Institutes of Health, RC4 application. Thus, the U.S. government has certain rights to this disclosure."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "acknowledge funding sources"
                    ],
                    "num_characters": 217,
                    "outline_medium": [
                        "acknowledge funding sources"
                    ],
                    "outline_short": [
                        "acknowledge government grants"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Human African trypanosomiasis (HAT) or African sleeping sickness, visceral and cutaneous leishmaniase (VL and CL, respectively), and Chagas disease (resulting from Trypanosoma brucei, T. cruzi, and Leishmania sp.) are a constellation of parasitic diseases that represent a significant health problem in the developing world. The World Health Organization estimates that over 22 million people are currently infected with one of these illnesses annually, all of which are debilitating and potentially fatal unless treated. However, current therapeutic interventions are significantly lacking, all with limited efficacy or life-threatening side effects. There are clear Target Product Profiles (TPPs) for new treatments, but a disproportionately small fraction of biomedical research is directed at the identification of such compounds. Since these diseases predominantly affect the very poor, they are recognized by WHO and the US Food and Drug Administration as “neglected diseases” in need of improved interventions.",
                        "Transmitted by the bite of infected insects, these diseases are treated by agents that are far from optimal in terms of safety, efficacy, and dosing methods. Currently, Stage I HAT is treated with two different drugs. The first is suramin, which has been used since the 1920s, administered by IV infusion over 30 days. The molecular target and mechanism of action for suramin are unknown and patients typically display detrimental side effects such as kidney failure, anaphylaxis, or neurological effects. The other Stage I treatment is pentamidine, which was first introduced in the 1940s and, similar to suramine, its mechanism of action is unknown. Pentamidine has fewer side effects, but requires intramuscular injection for 7 days. Neither of these drugs are effective against Stage II as they are incapable of crossing the blood-brain barrier (BBB).",
                        "There are two currently approved treatments for Stage II HAT. The first is melarsoprol, an organo-arsenic compound which is capable of crossing the BBB. Its mechanism of action is unknown and it is quite effective in treating HAT, but there are severe side effects such as cardiac arrhythmias and post-treatment reactive encephalopathy (PTRE). These side effects contribute to a 5% fatality rate in treated patients. The other treatment option for Stage II HAT is eflornithine, an irreversible ornothine decarboxylase inhibitor, which requires daily IV infusions up to 400 mg/kg per day for three weeks. Eflornithine has serious side effects, including anemia and convulsions, and is expensive to produce, leading to a large cost for treatment.",
                        "Similarly, VL has four treatment options: pentavalent antimonials, various formulations of amphotericin B, miltefosine, and paromomycin, all of which have problems with efficacy and toxicity. Only miltefosine can be administered orally. Antimonials are very toxic with side effects ranging from cardiac arrhythmia to pancreatitis. Amphotericin B treatment is very effective, but requires 30 days of hospitalization for clinical observation, a requirement that is not practical or even possible in some of the poorest nations. Miltefosine is advantageous due to its oral bioavailability, but is not safe for women who are or may become pregnant. Paromomycin is safe and inexpensive, but requires injections for 21 days.",
                        "Chagas disease therapeutics are principally the nitroaromatic compounds benznidazole and nifurtimox. Although both are orally-administered drugs, they require lengthy treatments and have significant side effects.",
                        "Thus, new treatments are needed for all three types of parasitic disease."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce parasitic diseases",
                        "describe current treatments",
                        "highlight limitations of current treatments",
                        "discuss target product profiles",
                        "explain neglected disease status",
                        "describe disease transmission",
                        "emphasize need for new treatments"
                    ],
                    "num_characters": 3629,
                    "outline_medium": [
                        "describe parasitic diseases",
                        "discuss limitations of current treatments",
                        "highlight need for new treatments"
                    ],
                    "outline_short": [
                        "describe parasitic diseases"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Disclosed is the use of mammalian target of rapamycin (mTOR) and/or phosphoinositide-3-kinase (PI3K) inhibitors as antiparasitic drugs, particularly in those parasitic infections caused by trypanosomatid parasites (Trypanosoma sp. and Leishmania sp.). These inhibitors are useful as trypanocides.",
                        "In one aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (I),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,",
                        "wherein",
                        "R27, R28, R29, and R34 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "R30 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORaRb, or C(O)NRaRb;",
                        "R31 is hydrogen, halogen, OH, CN, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "R32 and R33 are each independently hydrogen or C1-C4 alkyl;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-C4 alkyl; and",
                        "n15, n16, and n17 are each independently 0, 1, 2, 3, or 4.",
                        "In another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VI),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                        "R1, R2, R3, and R4 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;",
                        "R5 and R6 are each independently hydrogen or C1-C4 alkyl;",
                        "X1 and X2 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                        "n1, n2, and n3 are each independently 0, 1, 2, 3, or 4.",
                        "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (II),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,",
                        "wherein",
                        "R7, R8, R9, and R10 are each independently hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORa, or C(O)NRaRb;",
                        "R11, R12 and R13 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl; and",
                        "n4 is 0, 1, 2, 3, or 4.",
                        "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (III),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                        "R14 is hydrogen, —C1-C4 alkyl-NRaC(O)ORa, or",
                        "R15 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb, or",
                        "Rc and R16 are each independently hydrogen or C1-C4 alkyl;",
                        "R17 is hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl;",
                        "X is C or N;",
                        "X3 and X4 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa; and",
                        "n5, n6, and n7 are each independently 0, 1, 2, 3, or 4.",
                        "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (IV),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                        "R18, R19, and R20 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "R21 is hydrogen or C1-C4 alkyl;",
                        "X5 and X6 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                        "n8, n9, and n10 are each independently 0, 1, 2, 3, or 4.",
                        "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (V),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                        "R24 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb,",
                        "R22 and R23 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, C1-C4 alkyl-ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "R25 and R26 are each independently hydrogen or C1-C4 alkyl;",
                        "X7 and X8 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-C4 alkyl;",
                        "Y is C or N; and",
                        "n11, n12, n13, and n14 are each independently 0, 1, 2, 3, or 4.",
                        "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VII),",
                        "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                        "R35, R36, R37, and R38 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                        "R39 is hydrogen or C1-C4 alkyl;",
                        "X9 is CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                        "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                        "n18 and n19 are each independently 0, 1, 2, 3, or 4."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce mTOR and PI3K inhibitors",
                        "describe method of treating disease with Formula (I)",
                        "define Formula (I) structure",
                        "describe method of treating disease with Formula (VI)",
                        "define Formula (VI) structure",
                        "describe method of treating disease with Formula (II)",
                        "define Formula (II) structure",
                        "describe method of treating disease with Formula (III)",
                        "define Formula (III) structure",
                        "describe method of treating disease with Formula (IV)",
                        "define Formula (IV) structure",
                        "describe method of treating disease with Formula (V) and Formula (VII)"
                    ],
                    "num_characters": 6321,
                    "outline_medium": [
                        "introduce mTOR and PI3K inhibitors as antiparasitic drugs",
                        "describe method of treating disease with Formula (I) compound",
                        "describe method of treating disease with Formula (VI) compound",
                        "describe method of treating disease with Formula (II) compound",
                        "describe method of treating disease with Formula (III) compound",
                        "describe method of treating disease with Formula (IV), (V), and (VII) compounds"
                    ],
                    "outline_short": [
                        "introduce mTOR and PI3K inhibitors",
                        "describe method of treating trypanosomatid parasites",
                        "outline various formulae for inhibitor compounds"
                    ]
                },
                {
                    "title": "DESCRIPTION",
                    "paragraphs": [
                        "All publications, patent applications, patents, and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the present specification, including definitions, will control. In addition, the materials, methods, and examples are illustrative only and not intended to be limiting. Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this invention belongs. Although methods and materials similar or equivalent to those described herein can be used in the practice or testing of the present invention, suitable methods and materials are described below.",
                        "The trypanosomatids Trypanosoma brucei and Leishmania major possess multiple targets of rapamycin (TOR) enzymes that are essential for cell growth and virulence. The mammalian homolog, mTOR, has been the focus of treatments for cancer. It has been discovered that these mTOR inhibitor chemotypes are useful for the treatment of trypanosomiasis and leishmaniasis and killing the trypanosomatids responsible, at least in part, for these diseases.",
                        "Target repurposing utilizes knowledge of ‘druggable’ targets obtained in one organism and exploits this information to pursue new drug targets in other organisms. This disclosure shows the effect of inhibitors targeting the kinase domain of the mammalian Target of Rapamycin (mTOR) and human phosphoinositide-3-kinases (PI3Ks) against the kinetoplastid parasites Trypanosoma brucei, T. cruzi, Leishmania major, and L. donovani. The genomes of trypanosomatids encode at least 12 proteins belonging to the PI3K protein superfamily, some of which are unique to parasites. Moreover, the shared PI3Ks differ greatly in sequence from those of the human host, thereby providing opportunities for selective inhibition. Several inhibitors showed micromolar or better efficacy against these organisms in culture. One compound, NVP-BEZ235, displayed high potency (sub-nanomolar) efficacy against cultured parasites, and the ability to clear parasitemia in an animal model of T. brucei rhodesiense infection.",
                        "The disclosure shows that mammalian PI3/TOR kinase inhibitors are useful for anti-trypanosomal drug discovery and treatment. In one embodiment, NVP-BEZ235, an advanced clinical candidate against solid tumors, is useful as an agent for treating African sleeping sickness."
                    ],
                    "subsections": [
                        {
                            "title": "DEFINITIONS",
                            "paragraphs": [
                                "The following are definitions of terms used in the present specification. The initial definition provided for a group or term herein applies to that group or term throughout the present specification individually or as part of another group, unless otherwise indicated. Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art.",
                                "The terms “alkyl” and “alk” refer to a straight or branched chain alkane (hydrocarbon) radical containing from 1 to 12 carbon atoms, preferably 1 to 6 carbon atoms. Exemplary “alkyl” groups include methyl, ethyl, propyl, isopropyl, n-butyl, t-butyl, isobutyl pentyl, hexyl, isohexyl, heptyl, 4,4-dimethylpentyl, octyl, 2,2,4-trimethylpentyl, nonyl, decyl, undecyl, dodecyl, and the like. The term “(C1-C4)alkyl” refers to a straight or branched chain alkane (hydrocarbon) radical containing from 1 to 4 carbon atoms, such as methyl, ethyl, propyl, isopropyl, n-butyl, t-butyl, and isobutyl. The terms “alkyl” and “alk” may be optionally substituted. “Substituted alkyl” refers to an alkyl group substituted with one or more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. In the aforementioned exemplary substitutents, groups such as alkyl, cycloalkyl, alkenyl, alkynyl, cycloalkenyl, heterocycle and aryl can themselves be optionally substituted. The terms “alkylaryl” refers to alkyl group substituted by one or more aryl group. The terms “alkylheteroaryl” refers to alkyl group substituted by one or more heteroaryl group.",
                                "The term “alkenyl” refers to a straight or branched chain hydrocarbon radical containing from 2 to 12 carbon atoms and at least one carbon-carbon double bond. Exemplary such groups include ethenyl or allyl. The term “C2-C6 alkenyl” refers to a straight or branched chain hydrocarbon radical containing from 2 to 6 carbon atoms and at least one carbon-carbon double bond, such as ethylenyl, propenyl, 2-propenyl, (E)-but-2-enyl, (Z)-but-2-enyl, 2-methy(E)-but-2-enyl, 2-methy(Z)-but-2-enyl, 2,3-dimethyl-but-2-enyl, (Z)-pent-2-enyl, (E)-pent-1-enyl, (Z)-hex-1-enyl, (E)-pent-2-enyl, (Z)-hex-2-enyl, (E)-hex-2-enyl, (Z)-hex-1-enyl, (E)-hex-1-enyl, (Z)-hex-3-enyl, (E)-hex-3-enyl, and (E)-hex-1,3-dienyl. The term “alkenyl” may be optionally substituted. “Substituted alkenyl” refers to an alkenyl group substituted with one or more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted.",
                                "The term “alkynyl” refers to a straight or branched chain hydrocarbon radical containing from 2 to 12 carbon atoms and at least one carbon to carbon triple bond. Exemplary such groups include ethynyl. The term “C2-C6 alkynyl” refers to a straight or branched chain hydrocarbon radical containing from 2 to 6 carbon atoms and at least one carbon-carbon triple bond, such as ethynyl, prop-1-ynyl, prop-2-ynyl, but-1-ynyl, but-2-ynyl, pent-1-ynyl, pent-2-ynyl, hex-1-ynyl, hex-2-ynyl, hex-3-ynyl. The term “alkynyl” may be optionally substituted. “Substituted alkynyl” refers to an alkynyl group substituted with one or more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdC(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted.",
                                "The term “cycloalkyl” refers to a fully saturated cyclic hydrocarbon group containing from 1 to 4 rings and 3 to 8 carbons per ring. “C3-C7 cycloalkyl” refers to cyclopropyl, cyclobutyl, cyclopentyl, cyclohexyl, or cycloheptyl. The term “cycloalkyl” may be optionally substituted. “Substituted cycloalkyl” refers to a cycloalkyl group substituted with one or more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORJ, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted. Exemplary substituents also include spiro-attached or fused cylic substituents, especially spiro-attached cycloalkyl, spiro-attached cycloalkenyl, spiro-attached heterocycle (excluding heteroaryl), fused cycloalkyl, fused cycloalkenyl, fused heterocycle, or fused aryl, where the aforementioned cycloalkyl, cycloalkenyl, heterocycle and aryl substitutents can themselves be optionally substituted.",
                                "The term “cycloalkenyl” refers to a partially unsaturated cyclic hydrocarbon group containing 1 to 4 rings and 3 to 8 carbons per ring. Exemplary such groups include cyclobutenyl, cyclopentenyl, cyclohexenyl, etc. The term “cycloalkenyl” may be optionally substituted. “Substituted cycloalkenyl” refers to a cycloalkenyl group substituted with one more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted. Exemplary substituents also include spiro-attached or fused cylic substituents, especially spiro-attached cycloalkyl, spiro-attached cycloalkenyl, spiro-attached heterocycle (excluding heteroaryl), fused cycloalkyl, fused cycloalkenyl, fused heterocycle, or fused aryl, where the aforementioned cycloalkyl, cycloalkenyl, heterocycle and aryl substituents can themselves be optionally substituted.",
                                "The term “aryl” refers to cyclic, aromatic hydrocarbon groups that have 1 to 5 aromatic rings, especially monocyclic or bicyclic groups such as phenyl, biphenyl or naphthyl. Where containing two or more aromatic rings (bicyclic, etc.), the aromatic rings of the aryl group may be joined at a single point (e.g., biphenyl), or fused (e.g., naphthyl, phenanthrenyl and the like). The term “aryl” may be optionally substituted. “Substituted aryl” refers to an aryl group substituted by one or more substituents, preferably 1 to 3 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRC, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted. Exemplary substituents also include fused cylic groups, especially fused cycloalkyl, fused cycloalkenyl, fused heterocycle, or fused aryl, where the aforementioned cycloalkyl, cycloalkenyl, heterocycle and aryl substituents can themselves be optionally substituted.",
                                "The terms “heterocycle” and “heterocyclic” refer to fully saturated, or partially or fully unsaturated, including aromatic (i.e., “heteroaryl”) cyclic groups (for example, 4 to 7 membered monocyclic, 7 to 11 membered bicyclic, or 8 to 16 membered tricyclic ring systems) which have at least one heteroatom in at least one carbon atom-containing ring. Each ring of the heterocyclic group containing a heteroatom may have 1, 2, 3, or 4 heteroatoms selected from nitrogen atoms, oxygen atoms and/or sulfur atoms, where the nitrogen and sulfur heteroatoms may optionally be oxidized and the nitrogen heteroatoms may optionally be quaternized. (The term “heteroarylium” refers to a heteroaryl group bearing a quaternary nitrogen atom and thus a positive charge.) The heterocyclic group may be attached to the remainder of the molecule at any heteroatom or carbon atom of the ring or ring system. Exemplary monocyclic heterocyclic groups include azetidinyl, pyrrolidinyl, pyrrolyl, pyrazolyl, oxetanyl, pyrazolinyl, imidazolyl, imidazolinyl, imidazolidinyl, oxazolyl, oxazolidinyl, isoxazolinyl, isoxazolyl, thiazolyl, thiadiazolyl, thiazolidinyl, isothiazolyl, isothiazolidinyl, furyl, tetrahydrofuryl, thienyl, oxadiazolyl, piperidinyl, piperazinyl, 2-oxopiperazinyl, 2-oxopiperidinyl, 2-oxopyrrolodinyl, 2-oxoazepinyl, azepinyl, hexahydrodiazepinyl, 4-piperidonyl, pyridyl, pyrazinyl, pyrimidinyl, pyridazinyl, triazinyl, triazolyl, tetrazolyl, tetrahydropyranyl, morpholinyl, thiamorpholinyl, thiamorpholinyl sulfoxide, thiamorpholinyl sulfone, 1,3-dioxolane and tetrahydro-1,1-dioxothienyl, and the like. Exemplary bicyclic heterocyclic groups include indolyl, isoindolyl, benzothiazolyl, benzoxazolyl, benzoxadiazolyl, benzothienyl, benzo[d][1,3]dioxolyl, 2,3-dihydrobenzo[b][1,4]dioxinyl, quinuclidinyl, quinolinyl, tetrahydroisoquinolinyl, isoquinolinyl, benzimidazolyl, benzopyranyl, indolizinyl, benzofuryl, benzofurazanyl, chromonyl, coumarinyl, benzopyranyl, cinnolinyl, quinoxalinyl, indazolyl, pyrrolopyridyl, furopyridinyl (such as furo[2,3-c]pyridinyl, furo[3,2-b]pyridinyl] or furo[2,3-b]pyridinyl), dihydroisoindolyl, dihydroquinazolinyl (such as 3,4-dihydro-4-oxo-quinazolinyl), triazinylazepinyl, tetrahydroquinolinyl and the like. Exemplary tricyclic heterocyclic groups include carbazolyl, benzidolyl, phenanthrolinyl, acridinyl, phenanthridinyl, xanthenyl and the like. The terms “heterocycle” and “heterocyclic” may be optionally substituted.",
                                "“Substituted heterocycle” and “substituted heterocyclic” (such as “substituted heteroaryl”) refer to heterocycle or heterocyclic groups substituted with one or more substituents, preferably 1 to 4 substituents, at any available point of attachment. Exemplary substituents include but are not limited to one or more of the following groups: hydrogen, halogen (e.g., a single halogen substituent or multiple halo substitutents forming, in the latter case, groups such as CF3 or an alkyl group bearing CCl3), cyano, nitro, oxo (i.e., ═O), CF3, OCF3, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, aryl, ORa, SRa, S(═O)Re, S(═O)2Re, P(═O)2Re, S(═O)2ORe, P(═O)2ORe, NRbRc, NRbS(═O)2Re, NRbP(═O)2Re, S(═O)2NRbRc, P(═O)2NRbRc, C(═O)ORd, C(═O)Ra, C(═O)NRbRc, OC(═O)Ra, OC(═O)NRbRc, NRbC(═O)ORe, NRdC(═O)NRbRc, NRdS(═O)2NRbRc, NRdP(═O)2NRbRc, NRbC(═O)Ra, or NRbP(═O)2Re, wherein each occurrence of Ra is independently hydrogen, alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl; each occurrence of Rb, Rc and Rd is independently hydrogen, alkyl, cycloalkyl, heterocycle, aryl, or said Rb and Rc together with the N to which they are bonded optionally form a heterocycle; and each occurrence of Re is independently alkyl, cycloalkyl, alkenyl, cycloalkenyl, alkynyl, heterocycle, or aryl. The exemplary substitutents can themselves be optionally substituted. Exemplary substituents also include spiro-attached or fused cyclic substituents at any available point or points of attachment, especially spiro-attached cycloalkyl, spiro-attached cycloalkenyl, spiro-attached heterocycle (excluding heteroaryl), fused cycloalkyl, fused cycloalkenyl, fused heterocycle, or fused aryl, where the aforementioned cycloalkyl, cycloalkenyl, heterocycle and aryl substituents can themselves be optionally substituted.",
                                "The term “alkylamino” refers to a group having the structure —NHR′, wherein R′ is hydrogen, alkyl or substituted alkyl, cycloalkyl or substituted cyclolakyl, as defined herein. Examples of alkylamino groups include, but are not limited to, methylamino, ethylamino, n-propylamino, iso-propylamino, cyclopropylamino, n-butylamino, tert-butylamino, neopentylamino, n-pentylamino, hexylamino, cyclohexylamino, and the like.",
                                "The term “dialkylamino” refers to a group having the structure —NRR′, wherein R and R′ are each independently alkyl or substituted alkyl, cycloalkyl or substituted cycloalkyl, cycloalkenyl or substituted cyclolalkenyl, aryl or substituted aryl, heterocylyl or susbstituted heterocyclyl, as defined herein. R and R′ may be the same or different in an dialkyamino moiety. Examples of dialkylamino groups include, but are not limited to, dimethylamino, methyl ethylamino, diethylamino, methylpropylamino, di(n-propyl)amino, di(iso-propyl)amino, di(cyclopropyl)amino, di(n-butyl)amino, di(tert-butyl)amino, di(neopentyl)amino, di(n-pentyl)amino, di(hexyl)amino, di(cyclohexyl)amino, and the like. In certain embodiments, R and R′ are linked to form a cyclic structure. The resulting cyclic structure may be aromatic or non-aromatic. Examples of cyclic diaminoalkyl groups include, but are not limited to, aziridinyl, pyrrolidinyl, piperidinyl, morpholinyl, pyrrolyl, imidazolyl, 1,3,4-trianolyl, and tetrazolyl.",
                                "The terms “halogen” or “halo” refer to chlorine, bromine, fluorine or iodine.",
                                "Unless otherwise indicated, any heteroatom with unsatisfied valences is assumed to have hydrogen atoms sufficient to satisfy the valences.",
                                "The compounds used in the disclosed methods may form salts which are also within the scope of this invention. Reference to a compound of the present invention is understood to include reference to salts thereof, unless otherwise indicated. The term “salt(s)”, as employed herein, denotes acidic and/or basic salts formed with inorganic and/or organic acids and bases. In addition, when a compound of the present invention contains both a basic moiety, such as but not limited to a pyridine or imidazole, and an acidic moiety such as but not limited to a carboxylic acid, zwitterions (“inner salts”) may be formed and are included within the term “salt(s)” as used herein. Pharmaceutically acceptable (i.e., non-toxic, physiologically acceptable) salts are preferred, although other salts are also useful, e.g., in isolation or purification steps which may be employed during preparation. Salts of the compounds used in the disclosed methods may be formed, for example, by reacting a compound described herein with an amount of acid or base, such as an equivalent amount, in a medium such as one in which the salt precipitates or in an aqueous medium followed by lyophilization.",
                                "The compounds used in the disclosed methods that contain a basic moiety, such as but not limited to an amine or a pyridine or imidazole ring, may form salts with a variety of organic and inorganic acids. Exemplary acid addition salts include acetates (such as those formed with acetic acid or trihaloacetic acid, for example, trifluoroacetic acid), adipates, alginates, ascorbates, aspartates, benzoates, benzenesulfonates, bisulfates, borates, butyrates, citrates, camphorates, camphorsulfonates, cyclopentanepropionates, digluconates, dodecylsulfates, ethanesulfonates, fumarates, glucoheptanoates, glycerophosphates, hemisulfates, heptanoates, hexanoates, hydrochlorides, hydrobromides, hydroiodides, hydroxyethanesulfonates (e.g., 2-hydroxyethanesulfonates), lactates, maleates, methanesulfonates, naphthalenesulfonates (e.g., 2-naphthalenesulfonates), nicotinates, nitrates, oxalates, pectinates, persulfates, phenylpropionates (e.g., 3-phenylpropionates), phosphates, picrates, pivalates, propionates, salicylates, succinates, sulfates (such as those formed with sulfuric acid), sulfonates, tartrates, thiocyanates, toluenesulfonates such as tosylates, undecanoates, and the like.",
                                "The compounds used in the disclosed methods that contain an acidic moiety, such but not limited to a carboxylic acid, may form salts with a variety of organic and inorganic bases. Exemplary basic salts include ammonium salts, alkali metal salts such as sodium, lithium and potassium salts, alkaline earth metal salts such as calcium and magnesium salts, salts with organic bases (for example, organic amines) such as benzathines, dicyclohexylamines, hydrabamines (formed with N,N-bis(dehydroabietyl)ethylenediamine), N-methyl-D-glucamines, N-methyl-D-glycamides, t-butyl amines, and salts with amino acids such as arginine, lysine and the like. Basic nitrogen-containing groups may be quaternized with agents such as lower alkyl halides (e.g., methyl, ethyl, propyl, and butyl chlorides, bromides and iodides), dialkyl sulfates (e.g., dimethyl, diethyl, dibutyl, and diamyl sulfates), long chain halides (e.g., decyl, lauryl, myristyl and stearyl chlorides, bromides and iodides), aralkyl halides (e.g., benzyl and phenethyl bromides), and others.",
                                "Prodrugs and solvates of the compounds of the invention are also contemplated herein. The term “prodrug” as employed herein denotes a compound that, upon administration to a subject, undergoes chemical conversion by metabolic or chemical processes to yield a compound of the present invention, or a salt and/or solvate thereof. Solvates of the compounds in the disclosure include, for example, hydrates.",
                                "Compounds of the present disclosure, and salts or solvates thereof, may exist in their tautomeric form (for example, as an amide or imino ether). All such tautomeric forms are contemplated herein as part of the present invention.",
                                "All stereoisomers of the present compounds (for example, those which may exist due to asymmetric carbons on various substituents), including enantiomeric forms and diastereomeric forms, are contemplated within the scope of this invention. Individual stereoisomers of the compounds of the invention may, for example, be substantially free of other isomers (e.g., as a pure or substantially pure optical isomer having a specified activity), or may be admixed, for example, as racemates or with all other, or other selected, stereoisomers. The chiral centers of the present invention may have the S or R configuration as defined by the International Union of Pure and Applied Chemistry (IUPAC) 1974 Recommendations. The racemic forms can be resolved by physical methods, such as, for example, fractional crystallization, separation or crystallization of diastereomeric derivatives or separation by chiral column chromatography. The individual optical isomers can be obtained from the racemates by any suitable method, including without limitation, conventional methods, such as, for example, salt formation with an optically active acid followed by crystallization.",
                                "Compounds of the present disclosure are, subsequent to their preparation, preferably isolated and purified to obtain a composition containing an amount by weight equal to or greater than 90%, for example, equal to greater than 95%, equal to or greater than 99% of the compounds (“substantially pure” compounds), which is then used or formulated as described herein. Such “substantially pure” compounds are also contemplated herein as part of the present disclosure.",
                                "All configurational isomers of the compounds of the present disclosure are contemplated, either in admixture or in pure or substantially pure form. The definition of compounds of the present disclosure embraces both cis (Z) and trans (E) alkene isomers, as well as cis and trans isomers of cyclic hydrocarbon or heterocyclic rings.",
                                "Throughout the specifications, groups and substituents thereof may be chosen to provide stable moieties and compounds.",
                                "Definitions of specific functional groups and chemical terms are described in more detail below. For purposes of this invention, the chemical elements are identified in accordance with the Periodic Table of the Elements, CAS version, Handbook of Chemistry and Physics, 75th Ed., inside cover, and specific functional groups are generally defined as described therein. Additionally, general principles of organic chemistry, as well as specific functional moieties and reactivity, are described in “Organic Chemistry”, Thomas Sorrell, University Science Books, Sausalito: 1999, the entire contents of which are incorporated herein by reference.",
                                "Certain compounds of the present disclosure may exist in particular geometric or stereoisomeric forms. The present invention contemplates all such compounds, including cis- and trans-isomers, R- and S-enantiomers, diastereomers, (D)-isomers, (L)-isomers, the racemic mixtures thereof, and other mixtures thereof, as falling within the scope of the invention. Additional asymmetric carbon atoms may be present in a substituent such as an alkyl group. All such isomers, as well as mixtures thereof, are intended to be included in this invention.",
                                "Isomeric mixtures containing any of a variety of isomer ratios may be utilized in accordance with the present invention. For example, where only two isomers are combined, mixtures containing 50:50, 60:40, 70:30, 80:20, 90:10, 95:5, 96:4, 97:3, 98:2, 99:1, or 100:0 isomer ratios are all contemplated by the present invention. Those of ordinary skill in the art will readily appreciate that analogous ratios are contemplated for more complex isomer mixtures.",
                                "The present invention also includes isotopically labeled compounds, which are identical to the compounds disclosed herein, but for the fact that one or more atoms are replaced by an atom having an atomic mass or mass number different from the atomic mass or mass number usually found in nature. Examples of isotopes that can be incorporated into compounds of the present invention include isotopes of hydrogen, carbon, nitrogen, oxygen, phosphorous, sulfur, fluorine and chlorine, such as 2H, 3H, 13C, 11C, 14C, 15N, 18O, 17O, 31P, 32P, 35S, 18F, and 36Cl, respectively. Compounds of the present invention, or an enantiomer, diastereomer, tautomer, or pharmaceutically acceptable salt or solvate thereof, which contain the aforementioned isotopes and/or other isotopes of other atoms are within the scope of this invention. Certain isotopically labeled compounds of the present invention, for example those into which radioactive isotopes such as 3H and 14C are incorporated, are useful in drug and/or substrate tissue distribution assays. Tritiated, i.e., 3H, and carbon-14, i.e., 14C, isotopes are particularly preferred for their ease of preparation and detectability. Further, substitution with heavier isotopes such as deuterium, i.e., 2H, can afford certain therapeutic advantages resulting from greater metabolic stability, for example increased in vivo half-life or reduced dosage requirements and, hence, may be preferred in some circumstances. Isotopically labeled compounds can generally be prepared by carrying out the procedures disclosed in the Schemes and/or in the Examples below, by substituting a readily available isotopically labeled reagent for a non-isotopically labeled reagent.",
                                "If, for instance, a particular enantiomer of a compound of the present invention is desired, it may be prepared by asymmetric synthesis, or by derivation with a chiral auxiliary, where the resulting diastereomeric mixture is separated and the auxiliary group cleaved to provide the pure desired enantiomers. Alternatively, where the molecule contains a basic functional group, such as amino, or an acidic functional group, such as carboxyl, diastereomeric salts are formed with an appropriate optically-active acid or base, followed by resolution of the diastereomers thus formed by fractional crystallization or chromatographic means well known in the art, and subsequent recovery of the pure enantiomers.",
                                "It will be appreciated that the compounds, as described herein, may be substituted with any number of substituents or functional moieties. In general, the term “substituted” whether preceded by the term “optionally” or not, and substituents contained in formulas of this invention, refer to the replacement of hydrogen radicals in a given structure with the radical of a specified substituent. When more than one position in any given structure may be substituted with more than one substituent selected from a specified group, the substituent may be either the same or different at every position. As used herein, the term “substituted” is contemplated to include all permissible substituents of organic compounds. In a broad aspect, the permissible substituents include acyclic and cyclic, branched and unbranched, carbocyclic and heterocyclic, aromatic and nonaromatic substituents of organic compounds. For purposes of this invention, heteroatoms such as nitrogen may have hydrogen substituents and/or any permissible substituents of organic compounds described herein which satisfy the valencies of the heteroatoms. Furthermore, this invention is not intended to be limited in any manner by the permissible substituents of organic compounds. Combinations of substituents and variables envisioned by this invention are preferably those that result in the formation of stable compounds useful in the treatment, for example, of infectious diseases or proliferative disorders. The term “stable”, as used herein, preferably refers to compounds which possess stability sufficient to allow manufacture and which maintain the integrity of the compound for a sufficient period of time to be detected and preferably for a sufficient period of time to be useful for the purposes detailed herein.",
                                "As used herein, “treat,” “treating” or “treatment” refers to administering a therapy in an amount, manner (e.g., schedule of administration), and/or mode (e.g., route of administration), effective to improve a disorder (e.g., a disorder described herein) or a symptom thereof, or to prevent or slow the progression of a disorder (e.g., a disorder described herein) or a symptom thereof. This can be evidenced by, e.g., an improvement in a parameter associated with a disorder or a symptom thereof, e.g., to a statistically significant degree or to a degree detectable to one skilled in the art. An effective amount, manner, or mode can vary depending on the subject and may be tailored to the subject. By preventing or slowing progression of a disorder or a symptom thereof, a treatment can prevent or slow deterioration resulting from a disorder or a symptom thereof in an affected or diagnosed subject.",
                                "The term “or” is used herein to mean, and is used interchangeably with, the term “and/or,” unless context clearly indicates otherwise.",
                                "The term “therapeutically effective amount” refers to an amount (e.g., dose) sufficient to achieve a desired therapeutic effect when treating a subject having a disorder or condition described herein. In certain embodiments, a “therapeutically effective amount” is an amount sufficient to achieve tissue or serum concentrations required to treat, halt progression of, or the worsening of diseases disclosed herein. It is also to be understood herein that a “therapeutically effective amount” may be interpreted as an amount giving a desired therapeutic effect, either taken in one dose or in any dosage or route, taken alone or in combination with other therapeutic agents.",
                                "The term “therapeutically effective amount of an mTOR and/or PI3K inhibitor compound” refers to at least one compound selected from the list disclosed herein.",
                                "As used herein, a “subject” is any subject for whom diagnosis, prognosis, or therapy is desired. In some embodiments, the subject is a mammal. For example, a subject can be a mammal such as a human, dog, cat, horse, cow, pig, or non-human primate, such as a monkey, chimpanzee, baboon or rhesus. In particular embodiments, the subject is a human. In other particular embodiments, the subject is a livestock or domestic animal.",
                                "**Target of Rapamycin (TOR)**",
                                "Rapamycin is a natural cell growth inhibitor in mammals. TOR is a phosphoinositide-3-kinase (PI3K)-related kinase. T. brucei TOR (TbTOR1 and TbTOR2) are essential for cell growth and regulation. Tests show that Rapamycin inhibited T. brucei cell growth with an EC50 of 152 nM by inhibiting TbTOR2 complex formation. L. major expressTOR-like proteins. Some kinase domain inhibitors are selective for mTOR; others are cross-reactive with related PI3Ks.",
                                "The disclosure provides methods of treating T. brucei brucei, T. brucei rhodesiense (human infective strain) and L. major promastigotes. In some embodiments, the methods further comprise administering one or more of the disclosed compounds in combination with pharmaceutically acceptable salt or carrier. In certain embodiments, such methods include administering one or more of the disclosed compounds to a subject. In some embodiments, the subject can be a mammal, e.g., a human, mouse, rat, guinea pig, dog, cat, horse, cow, pig, or non-human primate, such as a monkey, chimpanzee, baboon or rhesus. In particular embodiments, the subject is a human.",
                                "Although some of the compounds outlined in this disclosure are useful therapeutics for trypanosomal diseases, these compound classes can also be optimized to improve their parasite killing selectivity (over human cells), improve their pharmacokinetic profiles to be even more amenable to treatment of parasites (such as crossing the blood-brain barrier for T. brucei infections), entering macrophages (for Leishmania infections), etc. In some embodiments, the disclosure provides methods of killing a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR inhibitor compound to a subject infected with a trypanosomatid parasite.",
                                "**Trypanosomatid Genomes**",
                                "Database mining of trypanosomatid genomes has revealed the presence of at least 12 proteins belonging to the PI3K protein superfamily (PFAM PF00454), many of which are unique to the parasites. Notably orthologous proteins are highly divergent from those of the human host. These include predicted kinases related to the eukaryotic class I and II PI3Ks, PI4Ks, and PIKKs including TOR, ATM and ATR ([26,27], and data not shown). Where tested, PI3Ks appear to be essential for viability and/or virulence in trypanosomatids. Two PIK subfamily members have been examined in T. brucei. The trypanosome Class III PI3K TbVps34 has an essential function in membrane trafficking and in Golgi segregation during cell division [28]. These authors suggested that, similar to yeast, T. brucei possesses only one genuine PI3K. TbPI4Kβ is also an essential protein in T. brucei, required for maintenance of Golgi structure, protein trafficking, and cytokinesis [28]. Trypanosomatids possess four distinct genes belonging to the TOR family, in contrast to mammals, which possess a single mTOR protein [29,30,31,32]. TORs act in concert with other proteins in complexes referred to as TORCs, which have different protein subunit compositions, and cellular functions [33].",
                                "In T. brucei, the two conserved signaling complexes, TORC1 and TORC2, whose functions appear analogous to that described in mammalian or yeast TORCs, mediate the essential functions of TOR1 and TOR2 for cell growth [32,34]. While TbTORC1 regulates protein synthesis, cell cycle progression and autophagy, TbTORC2 plays a key role in maintaining the polarization of the actin cytoskeleton, which is required for the proper functioning of endocytic processes, cell division, and cytokinesis [29,35]. Correspondingly, TOR1 and TOR2 are essential genes in Leishmania major [30]. Recent work has characterized a third TOR protein, TOR3, in Leishmania major and T. brucei, that is implicated in the formation of acidocalcisomes and participation in stress response [30,31]. A fourth TOR in T. brucei and Leishmania (TOR4) lacks the FRB domain responsible for binding rapamycin-binding proteins, yet possesses all other characteristic domains of TOR kinases [29,30].",
                                "The essentiality of several PIKs and TOR1 and TOR2 and the requirement for TOR3 for virulence in both trypanosomes and Leishmania provide genetic validation of these kinases as drug targets."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define terms used in the specification",
                                "introduce alkyl and alk definitions",
                                "provide examples of alkyl groups",
                                "define (C1-C4)alkyl",
                                "introduce substituted alkyl",
                                "list exemplary substituents for alkyl",
                                "define alkenyl",
                                "provide examples of alkenyl groups",
                                "introduce substituted alkenyl",
                                "list exemplary substituents for alkenyl",
                                "define alkynyl",
                                "provide examples of alkynyl groups",
                                "introduce substituted alkynyl",
                                "list exemplary substituents for alkynyl",
                                "define cycloalkyl",
                                "provide examples of cycloalkyl groups",
                                "introduce substituted cycloalkyl",
                                "define cycloalkenyl",
                                "define substituted cycloalkenyl",
                                "define aryl",
                                "define substituted aryl",
                                "define heterocycle",
                                "define substituted heterocycle",
                                "provide examples of monocyclic heterocyclic groups",
                                "provide examples of bicyclic heterocyclic groups",
                                "provide examples of tricyclic heterocyclic groups",
                                "define substituted heterocycle",
                                "provide examples of substituents for heterocycle",
                                "provide examples of spiro-attached or fused cyclic substituents",
                                "define alkylamino",
                                "provide examples of alkylamino groups",
                                "describe optional substitution of substituents",
                                "describe optional formation of heterocycle by Rb and Rc",
                                "describe optional quaternization of nitrogen heteroatoms",
                                "define dialkylamino",
                                "provide examples of dialkylamino groups",
                                "define halogen",
                                "specify assumption for unsatisfied valences",
                                "discuss salts of compounds",
                                "describe formation of salts",
                                "list exemplary acid addition salts",
                                "list exemplary basic salts",
                                "discuss prodrugs and solvates",
                                "discuss tautomeric forms",
                                "discuss stereoisomers",
                                "discuss resolution of racemic forms",
                                "discuss purification of compounds",
                                "define configurational isomers",
                                "define stable moieties",
                                "define functional groups",
                                "describe geometric isomers",
                                "describe stereoisomeric forms",
                                "describe isotopically labeled compounds",
                                "describe preparation of isotopically labeled compounds",
                                "describe asymmetric synthesis",
                                "describe diastereomeric salts",
                                "define substituted compounds",
                                "describe permissible substituents",
                                "define stable compounds",
                                "define treat and treatment",
                                "define therapeutically effective amount",
                                "define subject",
                                "introduce target of rapamycin (TOR)",
                                "describe TOR as phosphoinositide-3-kinase (PI3K)-related kinase",
                                "describe methods of treating trypanosomatid parasites",
                                "describe optimization of compounds for parasite killing selectivity",
                                "describe trypanosomatid genomes",
                                "describe PI3K protein superfamily",
                                "describe essentiality of PI3Ks for viability and virulence",
                                "describe TOR family in trypanosomatids",
                                "describe TOR complexes (TORCs) and their functions",
                                "describe genetic validation of PIKs and TORs as drug targets"
                            ],
                            "num_characters": 36927,
                            "outline_medium": [
                                "define alkyl",
                                "define substituted alkyl",
                                "define alkenyl",
                                "define substituted alkenyl",
                                "define alkynyl",
                                "define substituted alkynyl",
                                "define cycloalkyl",
                                "define substituted cycloalkyl",
                                "define cycloalkenyl",
                                "define substituted cycloalkenyl",
                                "define aryl",
                                "define substituted aryl",
                                "define heterocycle",
                                "define substituted heterocycle",
                                "define alkylamino",
                                "provide examples of alkylamino groups",
                                "define dialkylamino",
                                "define halogen",
                                "define salts",
                                "describe acid addition salts",
                                "describe basic salts",
                                "describe prodrugs and solvates",
                                "define configurational isomers",
                                "define functional groups and chemical terms",
                                "describe geometric and stereoisomeric forms",
                                "describe isotopically labeled compounds",
                                "describe substituted compounds",
                                "define treat and treatment",
                                "describe therapeutically effective amount",
                                "introduce target of rapamycin (TOR)",
                                "describe TOR in trypanosomatids",
                                "describe trypanosomatid genomes",
                                "describe PI3K protein superfamily",
                                "describe TOR family in trypanosomatids"
                            ],
                            "outline_short": [
                                "define alkyl",
                                "define alkenyl",
                                "define alkynyl",
                                "define cycloalkyl",
                                "define cycloalkenyl",
                                "define aryl",
                                "define heterocycle",
                                "define alkylamino",
                                "define terms",
                                "describe salt formation",
                                "discuss prodrugs and stereoisomers",
                                "define compounds and isomers",
                                "describe functional groups and chemical terms",
                                "introduce isotopically labeled compounds",
                                "define substituents and functional moieties",
                                "describe target of rapamycin (TOR) and its role in trypanosomatid parasites",
                                "discuss trypanosomatid genomes and PI3K protein superfamily"
                            ]
                        },
                        {
                            "title": "Methods of Treatment",
                            "paragraphs": [
                                "In one aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment.",
                                "Methods are disclosed herein for treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment. In one aspect, such methods comprise administering the compound of Formulas (I), (II), (III), (IV), (V), (VI), and (VII) or a pharmaceutically acceptable salt or hydrate thereof to a subject.",
                                "As stated herein, a “therapeutically effective amount” refers to an amount (e.g., dose) effective in treating a subject, having a disorder or condition described herein. It is also to be understood herein that a “therapeutically effective amount” may be interpreted as an amount giving a desired therapeutic effect, either taken in one dose or in any dosage or route, taken alone or in combination with other therapeutic agents. In some embodiments, the dosage range is from about 0.01 to about 1000 mg/kg of body weight. In some embodiments, the dosage range is from about 0.5 to about 500 mg/kg of body weight. In some embodiments, the dosage range is from about 0.5 to about 50 mg/kg of body weight.",
                                "In one aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or P13K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (I),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R27, R28, R29, and R34 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "R30 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORaRb, or C(O)NRaRb;",
                                "R31 is hydrogen, halogen, OH, CN, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "R32 and R33 are each independently hydrogen or C1-C4 alkyl;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-C4 alkyl; and",
                                "n15, n16, and n17 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, R31 is CN. In some embodiments, R32 and R33 are each H. In some embodiments, R30 is Me. In some embodiments, R27 is OMe, OH, or OAc. In some embodiments, R29 and R34 are each H. In some embodiments, the compound is",
                                "In another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VI),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R1, R2, R3, and R4 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;",
                                "R5 and R6 are each independently hydrogen or C1-C4 alkyl;",
                                "X1 and X2 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                                "n1, n2, and n3 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, X1 and X2 are each independently O. In some embodiments, R4 is attached to the C1 position of Formula (VI). In some embodiments, R4 is OMe. In some embodiments, R6 is Me. In some embodiments, R1 is OH. In some embodiments, the compound is",
                                "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (II),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R7, R8, R9, and R10 are each independently hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORa, or C(O)NRaRb;",
                                "R11, R12 and R13 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl; and",
                                "na is 0, 1, 2, 3, or 4.",
                                "In some embodiments, R7 and R8 are H. In some embodiments, R13 is H. In some embodiments, R9 is methyl, ethyl, or isopropyl. In some embodiments, R10 is H. In some embodiments, R11 is OH. In some embodiments, the compound is",
                                "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (III),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R14 is hydrogen, —C1-C4 alkyl-NRaC(O)ORa, or",
                                "R15 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb, or",
                                "Rc and R16 are each independently hydrogen or C1-C4 alkyl;",
                                "R17 is hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl;",
                                "X is C or N;",
                                "X3 and X4 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa; and",
                                "n5, n6, and n7 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, X4 is N-benzyl. In some embodiments, X4 is N-(pyridin-3-ylmethyl). In some embodiments, X4 is NC(O)OMe. In some embodiments, X4 is NH. In some embodiments, R14 is",
                                "In some embodiments, R17 is NH2, OH, NHC(O)OMe, or NHC(O)OC(CH3)3. In some embodiments, R15 is H. In some embodiments, R15 is NHCH2CH2OCH2CH3. In some embodiments, R14 is CH2CH2NHC(O)OCH3. In some embodiments, X3 is CH2. In some embodiments, X3 is O. In some embodiments, the compound is selected from the group consisting of:",
                                "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (IV),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R18, R19, and R20 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "R21 is hydrogen or C1-C4 alkyl;",
                                "X5 and X6 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                                "n8, n9, and n10 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, X5 is O. In some embodiments, X6 is O. In some embodiments, X6 is NH. In some embodiments, R20 is H. In some embodiments, the compound is selected from the group consisting of:",
                                "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (V),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R24 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb,",
                                "R22 and R23 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, C1-C4 alkyl-ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "R25 and R26 are each independently hydrogen or C1-C4 alkyl;",
                                "X7 and X8 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-C4 alkyl;",
                                "Y is C or N; and",
                                "n11, n12, n13, and n14 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, R24 is H. In some embodiments, R24 is NHCH2CH2OCH2CH3. In some embodiments, R24 is",
                                "In some embodiments, R24 is",
                                "In some embodiments, R24 is",
                                "In some embodiments, R23 is H. In some embodiments, R23 is ortho-OEt. In some embodiments, R23 is meta-OMe, meta-OH, or meta-OAc. In some embodiments, R23 is para-OMe. In some embodiments, R23 is meta-CH2CH2OH. In some embodiments, X7 is S or O. In some embodiments, Y is N. In some embodiments, Y is C. In some embodiments, the compound is selected from the consisting of:",
                                "In yet another aspect, a method of treating a disease caused by a trypanosomatid parasite is described, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VII),",
                                "or a pharmaceutically acceptable salt or hydrate thereof,\n\nwherein",
                                "R35, R36, R37, and R38 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;",
                                "R39 is hydrogen or C1-C4 alkyl;",
                                "X9 is CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;",
                                "Ra and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and",
                                "n18 and n19 are each independently 0, 1, 2, 3, or 4.",
                                "In some embodiments, R35 is H or OMe. In some embodiments, X9 is O. In some embodiments, the compound is",
                                "In yet another aspect, use of the compound of Formulas (I), (II), (III), (IV), (V), (VI), and (VII) as described above or a pharmaceutically acceptable salt or hydrate thereof in the manufacture of medicament for the treatment of a disease caused by a trypanosomatid parasite is disclosed.",
                                "In some embodiments, the disease is selected from the group consisting of Human African Trypanosomiasis, leishmaniasis, and Chagas Disease. In some embodiments, the Human African Trypanosomiasis is caused by Trypanosoma brucei. In some embodiments the leishmaniasis is caused by Leishmania sp. In some embodiments, leishmaniasis is visceral or cutaneous leishmaniasis. In some embodiments, the Chagas Disease is caused by Trypanosoma cruzi. In some embodiments, the disease is nagana, i.e., T. Brucei ssp. in cattle. In some embodiments, the subject is a mammal. In some embodiments, the subject is a livestock or domestic animal. In some embodiments, the mammal is a human."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe method of treating disease caused by trypanosomatid parasite",
                                "administer therapeutically effective amount of mTOR and/or PI3K inhibitor compound",
                                "define therapeutically effective amount",
                                "describe dosage range",
                                "describe compound of Formula (I)",
                                "describe compound of Formula (VI)",
                                "describe compound of Formula (II)",
                                "describe compound of Formula (III)",
                                "describe compound of Formula (IV)",
                                "describe compound of Formula (V)",
                                "describe compound of Formula (VII)",
                                "specify R groups in Formula (I)",
                                "specify R groups in Formula (VI)",
                                "specify R groups in Formula (II)",
                                "specify R groups in Formula (III)",
                                "specify R groups in Formula (IV)",
                                "specify R groups in Formula (V)",
                                "specify R groups in Formula (VII)",
                                "describe use of compound in manufacture of medicament",
                                "specify diseases caused by trypanosomatid parasite"
                            ],
                            "num_characters": 10427,
                            "outline_medium": [
                                "describe method of treating disease caused by trypanosomatid parasite",
                                "define therapeutically effective amount",
                                "describe compound of Formula (I)",
                                "describe compound of Formula (II)",
                                "describe compound of Formula (III)",
                                "describe compound of Formula (IV)",
                                "describe compound of Formula (V)",
                                "describe compound of Formula (VI)",
                                "describe compound of Formula (VII)",
                                "describe use of compounds in manufacture of medicament"
                            ],
                            "outline_short": [
                                "describe method of treating disease caused by trypanosomatid parasite",
                                "define therapeutically effective amount",
                                "describe structure of Formula (I)",
                                "describe structure of Formula (VI)",
                                "describe structure of Formula (VII)"
                            ]
                        },
                        {
                            "title": "Methods of Preparation",
                            "paragraphs": [
                                "Following are general synthetic schemes for manufacturing compounds for use in the disclosed methods. These schemes are illustrative and are not meant to limit the possible techniques one skilled in the art any use to manufacture compounds disclosed herein. Different methods will be evident to those skilled in the art. Additionally, the various steps in the synthesis may be performed in an alternate sequence or order to give the desired compound(s). All documents cited herein are incorporated herein by reference in their entirety. For example, the following reactions are illustrations but not limitations of the preparation of some of the starting materials and examples used herein.",
                                "Schemes 1-7 describe various methods for the synthesis of compounds of the present invention. Various modifications to these methods may be envisioned by those skilled in the art to achieve similar results to that of the inventors given below.",
                                "Compound of Formula (VI) may be prepared as shown in Scheme 1.",
                                "Pyrido[2,3-d]pyrimidine I′, amines II′ and IV′, and substituted benzene VI′ may be readily commercially available or be prepared by methods known to one of ordinary skill in the art.",
                                "**Step 1**",
                                "Pyrido[2,3-d]pyrimidine I′ may react with amine II′ to afford substituted pyridopyrimidine III′. Y3 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 2**",
                                "Pyridopyrimidine III′ may react with amine IV′ to afford substituted pyridopyrimidine V′. Y2 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 2 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine, and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 3**",
                                "Pyridopyrimidine V′ may react with substituted benzene VI′ to afford a compound of Formula (VI). Y1 and Y4 are each independently halogen, OTf, OTs, other leaving groups well known in the art, B(OH)2, or other boron agents, with the proviso that Y1 and Y4 are not both boron agents. Step 3 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine, diisopropylethylamine, NaHCO3, and Na2CO3. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "Compound of Formula (II) may be prepared as shown in Scheme 2.",
                                "Substituted 1H-pyrazolo[3,4-d]pyrimidine VII′ and indole VIII′ may be readily commercially available or be prepared by methods known to one of ordinary skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe general synthetic schemes for manufacturing compounds",
                                "describe Scheme 1 for preparing compound of Formula (VI)",
                                "describe Scheme 2 for preparing compound of Formula (II)",
                                "describe Scheme 3 for preparing compound of Formula (III)",
                                "describe Scheme 4 for preparing compound of Formula (IV)",
                                "describe Scheme 5 for preparing compound of Formula (V)"
                            ],
                            "num_characters": 3121,
                            "outline_medium": [
                                "describe general synthetic schemes for manufacturing compounds",
                                "describe Scheme 1 for preparing compound of Formula (VI)",
                                "describe Schemes 2-5 for preparing compounds of Formulas (II)-(V)"
                            ],
                            "outline_short": [
                                "describe general synthetic schemes for manufacturing compounds"
                            ]
                        },
                        {
                            "title": "Step 1",
                            "paragraphs": [
                                "Substituted 1H-pyrazolo[3,4-d]pyrimidine VII′ may react with optionally substituted indole VIII′ to afford a compound of Formula (II). Y5 and Y6 are each independently halogen, OTf, OTs, other leaving groups well known in the art, B(OH)2, or other boron agents, with the proviso that Y5 and Y6 are not both boron agents. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine, diisopropylethylamine, NaHCO3, and Na2CO3. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "Compound of Formula (III) may be prepared as shown in Scheme 3.",
                                "Aldehyde IX′, hydrazine X′, R15H, and R14H may be readily commercially available or be prepared by methods known to one of ordinary skill in the art.",
                                "**Step 1**",
                                "Optionally substituted aldehyde IX′ may undergo condensation reaction with hydrazine X′ to afford substituted pyrazolopyrimidine XI′. Y9 is a halogen, OTf, OTs, or other leaving groups well known in the art. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 2**",
                                "Pyrazolopyrimidine XI′ may react with R15H to afford pyrazolopyrimidine XII′. Y8 is a halogen, OTf, OTs, or other leaving groups well known in the art. Step 2 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 3**",
                                "Pyrazolopyrimidine XII′ may react with R14H to afford a compound of Formula (III). Y7 is halogen, OTf, OTs, other leaving groups well known in the art, B(OH)2, or other boron agents. Step 3 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine, diisopropylethylamine, NaHCO3, and Na2CO3. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "In some specific embodiments, the compound of Formula (III) is selected from compounds 1-8 as shown in FIG. 5. In accordance with Scheme 3, compounds 1-6 and 8 may be prepared following the synthetic methods shown in FIGS. 6-7.",
                                "Compound of Formula (IV) may be prepared as shown in Scheme 4.",
                                "Bicyclic compound XIII′, amine XIV′, and benzene XVI′ may be readily commercially available or be prepared by methods known to one of ordinary skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "react pyrido[2,3-d]pyrimidine I′ with amine II′",
                                "react substituted 1H-pyrazolo[3,4-d]pyrimidine VII′ with indole VIII′",
                                "undergo condensation reaction with hydrazine X′",
                                "react bicyclic compound XIII′ with amine XIV′",
                                "undergo cyclization reaction to afford compound XIX′"
                            ],
                            "num_characters": 2907,
                            "outline_medium": [
                                "describe reaction of pyrido[2,3-d]pyrimidine I′ with amine II′",
                                "describe reaction of substituted 1H-pyrazolo[3,4-d]pyrimidine VII′ with indole VIII′"
                            ],
                            "outline_short": [
                                "describe reaction of pyrido[2,3-d]pyrimidine I′ with amine II′"
                            ]
                        },
                        {
                            "title": "Step 1",
                            "paragraphs": [
                                "Bicyclic compound XIII′ may react with amine XIV′ to afford compound XV′. Y10 is a halogen, OTf, OTs, or other leaving groups well known in the art. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 2**",
                                "Compound XV′ may react with optionally substituted benzene XVI′ to afford a compound of Formula (IV). Y11 and Y12 are halogen, OTf, OTs, other leaving groups well known in the art, B(OH)2, or other boron agents, with the proviso that Y11 and Y12 are not both boron agents. Step 2 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "Compound of Formula (V) may be prepared as shown in Scheme 5.",
                                "Bicyclic compound XVII′ and R24H may be readily commercially available or be prepared by methods known to one of ordinary skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "react pyridopyrimidine III′ with amine IV′",
                                "react pyrazolopyrimidine XI′ with R15H"
                            ],
                            "num_characters": 1326,
                            "outline_medium": [
                                "describe condensation reaction of aldehyde IX′ with hydrazine X′"
                            ],
                            "outline_short": [
                                "describe reaction of substituted 1H-pyrazolo[3,4-d]pyrimidine VII′ with indole VIII′"
                            ]
                        },
                        {
                            "title": "Step 1",
                            "paragraphs": [
                                "Bicyclic compound XVII′ may undergo cyclization reaction to afford compound XIX′. Optionally, an oxidizing agent is used in this reaction. Non-limiting examples of the oxidizing agents include peracids, permanganate, and hydrogen peroxide. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 2**",
                                "Compound XIX′ may react with halogenation agents or esterification agents known in the art to afford compound XX′. Y13 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 2 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 3**",
                                "Compound XX′ may react with R24H to afford a compound of Formula (V). Step 3 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "In some specific embodiments, the compound of Formula (V) is selected from compounds 14-21 as shown in FIG. 8. In accordance with Scheme 5, compounds 14, 17, 19, and 21 may be prepared following the synthetic methods shown in FIG. 9.",
                                "Compound of Formula (I) may be prepared as shown in Scheme 6.",
                                "Quinoline compound XXI′, quinoline compound XXII′, aniline XXIV′, and R30NH2 may be readily commercially available or be prepared by methods known to one of ordinary skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "react pyridopyrimidine V′ with substituted benzene VI′",
                                "react pyrazolopyrimidine XII′ with R14H",
                                "react compound XV′ with optionally substituted benzene XVI′"
                            ],
                            "num_characters": 1734,
                            "outline_medium": [
                                "describe reaction of bicyclic compound XIII′ with amine XIV′"
                            ],
                            "outline_short": [
                                "describe condensation reaction of aldehyde IX′ with hydrazine X′"
                            ]
                        },
                        {
                            "title": "Step 1",
                            "paragraphs": [
                                "Quinoline compound XXI′ may be coupled with quinoline compound XXII′ to afford compound XXIII′. Y14 and Y17 are halogen, OTf, OTs, other leaving groups well known in the art, B(OH)2, or other boron agents, with the proviso that Y14 and Y17 are not both boron agents. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 2**",
                                "Compound XXIII′ may react with aniline XXIV′ to afford compound XXV′. Y15 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 2 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 3**",
                                "Compound XXV′ may react with R3OH to afford compound XXVI′. Y16 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 3 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "**Step 4**",
                                "Compound XXVI′ may be cyclized to form a compound of Formula (I). A cyclizing agent is used in this reaction. Non-limiting examples of cyclizing agents include C(O)Cl2. Step 4 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile.",
                                "Compound of Formula (VII) may be prepared as shown in Scheme 7.",
                                "Compound XXVII′ and amine XXVIII′ may be readily commercially available or be prepared by methods known to one of ordinary skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "couple quinoline compounds",
                                "specify reaction conditions",
                                "couple quinoline compounds",
                                "specify reaction conditions"
                            ],
                            "num_characters": 2257,
                            "outline_medium": [
                                "couple quinoline compounds",
                                "specify reaction conditions"
                            ],
                            "outline_short": [
                                "outline synthesis steps"
                            ]
                        },
                        {
                            "title": "Step 1",
                            "paragraphs": [
                                "Compound XXVII′ may be coupled with amine XXVIII′ to afford a compound of Formula (VII). Y18 is halogen, OTf, OTs, or other leaving groups well known in the art. Step 1 may be carried out in the present of one or more suitable bases, which include, but are not limited to, triethylamine and diisopropylethylamine. Optionally, a catalyst such as Pd(0) can be used to catalyze this reaction. Suitable solvent for this reaction includes methylene chloride, Dimethylacetamide, DMF, methanol, and acetonitrile."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "couple compound XXVII′ with amine XXVIII′"
                            ],
                            "num_characters": 505,
                            "outline_medium": [
                                "couple compound XXVII′ with amine XXVIII′"
                            ],
                            "outline_short": [
                                "outline alternative synthesis steps"
                            ]
                        },
                        {
                            "title": "Pharmaceutical Compositions",
                            "paragraphs": [
                                "In another aspect, the disclosure provides pharmaceutically acceptable preparations comprising a therapeutically effective amount of one or more of the compounds disclosed herein, formulated together with one or more pharmaceutically acceptable carriers (additives) and/or diluents. The pharmaceutical compositions of the present disclosure can be specially formulated for administration in solid or liquid form, including but not limited to those adapted for the following: (1) oral administration, for example, drenches (aqueous or non-aqueous solutions or suspensions), tablets, boluses, powders, granules, pastes for application to the tongue; or (2) parenteral administration, for example, by subcutaneous, intramuscular or intravenous injection as, for example, a sterile solution or suspension.",
                                "This invention provides a pharmaceutical composition comprising at least one of the compounds as described herein or a pharmaceutically-acceptable salt or solvate thereof, and a pharmaceutically-acceptable carrier.",
                                "In yet another aspect, a pharmaceutical composition is described, comprising at least one a compound of Formula (I), (II), (III), (IV), (V), (VI), or (VII) as described herein or a pharmaceutically acceptable salt thereof, and a pharmaceutically-acceptable carrier or diluent.",
                                "The phrase “pharmaceutically-acceptable carrier” as used herein means a pharmaceutically-acceptable material, composition or vehicle, such as a liquid or solid filler, diluent, excipient, solvent or encapsulating material, involved in carrying or transporting the subject pharmaceutical agent from one organ, or portion of the body, to another organ, or portion of the body. Each carrier must be “acceptable” in the sense of being compatible with the other ingredients of the formulation and not injurious to the patient. Some examples of materials which can serve as pharmaceutically-acceptable carriers include: sugars, such as lactose, glucose and sucrose; starches, such as corn starch and potato starch; cellulose, and its derivatives, such as sodium carboxymethyl cellulose, ethyl cellulose and cellulose acetate; powdered tragacanth; malt; gelatin; talc; excipients, such as cocoa butter and suppository waxes; oils, such as peanut oil, cottonseed oil, safflower oil, sesame oil, olive oil, corn oil and soybean oil; glycols, such as butylene glycol; polyols, such as glycerin, sorbitol, mannitol and polyethylene glycol; esters, such as ethyl oleate and ethyl laurate; agar; buffering agents, such as magnesium hydroxide and aluminum hydroxide; alginic acid; pyrogen-free water; isotonic saline; Ringer's solution; ethyl alcohol; phosphate buffer solutions; and other non-toxic compatible substances employed in pharmaceutical formulations. The term “carrier” denotes an organic or inorganic ingredient, natural or synthetic, with which the active ingredient is combined to facilitate the application. The components of the pharmaceutical compositions also are capable of being commingled with the compounds of the present invention, and with each other, in a manner such that there is no interaction which would substantially impair the desired pharmaceutical efficiency.",
                                "As set out above, certain embodiments of the present pharmaceutical agents may be provided in the form of pharmaceutically-acceptable salts. The term “pharmaceutically-acceptable salt”, in this respect, refers to the relatively non-toxic, inorganic and organic acid addition salts of compounds of the present invention. These salts can be prepared in situ during the final isolation and purification of the compounds of the invention, or by separately reacting a purified compound of the invention in its free base form with a suitable organic or inorganic acid, and isolating the salt thus formed. Representative salts include the hydrobromide, hydrochloride, sulfate, bisulfate, phosphate, nitrate, acetate, valerate, oleate, palmitate, stearate, laurate, benzoate, lactate, phosphate, tosylate, citrate, maleate, fumarate, succinate, tartrate, napthylate, mesylate, glucoheptonate, lactobionate, and laurylsulphonate salts and the like. (See, for example, Berge et al., (1977) “Pharmaceutical Salts”, J. Pharm. Sci. 66:1-19.)",
                                "The pharmaceutically acceptable salts of the subject compounds include the conventional nontoxic salts or quaternary ammonium salts of the compounds, e.g., from non-toxic organic or inorganic acids. For example, such conventional nontoxic salts include those derived from inorganic acids such as hydrochloride, hydrobromic, sulfuric, sulfamic, phosphoric, nitric, and the like; and the salts prepared from organic acids such as acetic, butionic, succinic, glycolic, stearic, lactic, malic, tartaric, citric, ascorbic, palmitic, maleic, hydroxymaleic, phenylacetic, glutamic, benzoic, salicyclic, sulfanilic, 2-acetoxybenzoic, fumaric, toluenesulfonic, methanesulfonic, ethane disulfonic, oxalic, isothionic, and the like.",
                                "In other cases, the compounds of the present invention may contain one or more acidic functional groups and, thus, are capable of forming pharmaceutically-acceptable salts with pharmaceutically-acceptable bases. The term “pharmaceutically-acceptable salts” in these instances refers to the relatively non-toxic, inorganic and organic base addition salts of compounds of the present invention. These salts can likewise be prepared in situ during the final isolation and purification of the compounds, or by separately reacting the purified compound in its free acid form with a suitable base, such as the hydroxide, carbonate or bicarbonate of a pharmaceutically-acceptable metal cation, with ammonia, or with a pharmaceutically-acceptable organic primary, secondary or tertiary amine. Representative alkali or alkaline earth salts include the lithium, sodium, potassium, calcium, magnesium, and aluminum salts and the like. Representative organic amines useful for the formation of base addition salts include ethylamine, diethylamine, ethylenediamine, ethanolamine, diethanolamine, piperazine and the like. (See, for example, Berge et al., supra.)",
                                "Wetting agents, emulsifiers and lubricants, such as sodium lauryl sulfate, magnesium stearate, and polyethylene oxide-polybutylene oxide copolymer as well as coloring agents, release agents, coating agents, sweetening, flavoring and perfuming agents, preservatives and antioxidants can also be present in the compositions.",
                                "Formulations of the present invention include those suitable for oral, nasal, topical (including buccal and sublingual), rectal, vaginal and/or parenteral administration. The formulations may conveniently be presented in unit dosage form and may be prepared by any methods well known in the art of pharmacy. The amount of active ingredient which can be combined with a carrier material to produce a single dosage form will vary depending upon the host being treated, the particular mode of administration. The amount of active ingredient, which can be combined with a carrier material to produce a single dosage form will generally be that amount of the compound which produces a therapeutic effect. Generally, out of 100%, this amount will range from about 1% to about 99% of active ingredient, preferably from about 5% to about 70%, most preferably from about 10% to about 30%.",
                                "Methods of preparing these formulations or compositions include the step of bringing into association a compound of the present invention with the carrier and, optionally, one or more accessory ingredients. In general, the formulations are prepared by uniformly and intimately bringing into association a compound of the present invention with liquid carriers, or finely divided solid carriers, or both, and then, if necessary, shaping the product.",
                                "Formulations of the invention suitable for oral administration may be in the form of capsules, cachets, pills, tablets, lozenges (using a flavored basis, usually sucrose and acacia or tragacanth), powders, granules, or as a solution or a suspension in an aqueous or non-aqueous liquid, or as an oil-in-water or water-in-oil liquid emulsion, or as an elixir or syrup, or as pastilles (using an inert base, such as gelatin and glycerin, or sucrose and acacia) and/or as mouthwashes and the like, each containing a predetermined amount of a compound of the present invention as an active ingredient. A compound of the present invention may also be administered as a bolus, electuary or paste.",
                                "In solid dosage forms of the invention for oral administration (capsules, tablets, pills, dragees, powders, granules and the like), the active ingredient is mixed with one or more pharmaceutically-acceptable carriers, such as sodium citrate or dicalcium phosphate, and/or any of the following: fillers or extenders, such as starches, lactose, sucrose, glucose, mannitol, and/or silicic acid; binders, such as, for example, carboxymethylcellulose, alginates, gelatin, polyvinyl pyrrolidone, sucrose and/or acacia; humectants, such as glycerol; disintegrating agents, such as agar-agar, calcium carbonate, potato or tapioca starch, alginic acid, certain silicates, sodium carbonate, and sodium starch glycolate; solution retarding agents, such as paraffin; absorption accelerators, such as quaternary ammonium compounds; wetting agents, such as, for example, cetyl alcohol, glycerol monostearate, and polyethylene oxide-polybutylene oxide copolymer; absorbents, such as kaolin and bentonite clay; lubricants, such a talc, calcium stearate, magnesium stearate, solid polyethylene glycols, sodium lauryl sulfate, and mixtures thereof; and coloring agents. In the case of capsules, tablets and pills, the pharmaceutical compositions may also comprise buffering agents. Solid compositions of a similar type may also be employed as fillers in soft and hard-filled gelatin capsules using such excipients as lactose or milk sugars, as well as high molecular weight polyethylene glycols and the like.",
                                "A tablet may be made by compression or molding, optionally with one or more accessory ingredients. Compressed tablets may be prepared using binder (for example, gelatin or hydroxybutylmethyl cellulose), lubricant, inert diluent, preservative, disintegrant (for example, sodium starch glycolate or cross-linked sodium carboxymethyl cellulose), surface-active or dispersing agent. Molded tablets, may be, made by molding in a suitable machine a mixture of the powdered compound moistened with an inert liquid diluent.",
                                "The tablets, and other solid dosage forms of the pharmaceutical compositions of the present invention, such as dragees, capsules, pills and granules, may optionally be scored or prepared with coatings and shells, such as enteric coatings and other coatings well known in the pharmaceutical-formulating art. They may also be formulated so as to provide slow or controlled release of the active ingredient therein using, for example, hydroxybutylmethyl cellulose in varying butortions to provide the desired release profile, other polymer matrices, liposomes and/or microspheres. They may be sterilized by, for example, filtration through a bacteria-retaining filter, or by incorporating sterilizing agents in the form of sterile solid compositions, which can be dissolved in sterile water, or some other sterile injectable medium immediately before use. These compositions may also optionally contain opacifying agents and may be of a composition that they release the active ingredient(s) only, or preferentially, in a certain portion of the gastrointestinal tract, optionally, in a delayed manner. Examples of embedding compositions, which can be used include polymeric substances and waxes. The active ingredient can also be in micro-encapsulated form, if apbutriate, with one or more of the above-described excipients.",
                                "Liquid dosage forms for oral administration of the compounds of the invention include pharmaceutically acceptable emulsions, microemulsions, solutions, suspensions, syrups and elixirs. In addition to the active ingredient, the liquid dosage forms may contain inert diluents commonly used in the art, such as, for example, water or other solvents, solubilizing agents and emulsifiers, such as ethyl alcohol, isobutyl alcohol, ethyl carbonate, ethyl acetate, benzyl alcohol, benzyl benzoate, butylene glycol, 1,3-butylene glycol, oils (in particular, cottonseed, groundnut, corn, germ, olive, castor and sesame oils), glycerol, tetrahydrofuryl alcohol, polyethylene glycols and fatty acid esters of sorbitan, and mixtures thereof. Additionally, cyclodextrins, e.g., hydroxybutyl-.beta.-cyclodextrin, may be used to solubilize compounds.",
                                "Besides inert diluents, the oral compositions can also include adjuvants such as wetting agents, emulsifying and suspending agents, sweetening, flavoring, coloring, perfuming and preservative agents.",
                                "Suspensions, in addition to the active compounds, may contain suspending agents as, for example, ethoxylated isostearyl alcohols, polyoxyethylene sorbitol and sorbitan esters, microcrystalline cellulose, aluminum metahydroxide, bentonite, agar-agar and tragacanth, and mixtures thereof.",
                                "Formulations of the pharmaceutical compositions of the invention for rectal or vaginal administration may be presented as a suppository, which may be prepared by mixing one or more compounds of the invention with one or more suitable nonirritating excipients or carriers comprising, for example, cocoa butter, polyethylene glycol, a suppository wax or a salicylate, and which is solid at room temperature, but liquid at body temperature and, therefore, will melt in the rectum or vaginal cavity and release the active pharmaceutical agents of the invention.",
                                "Formulations of the present invention which are suitable for vaginal administration also include pessaries, tampons, creams, gels, pastes, foams or spray formulations containing such carriers as are known in the art to be apbutriate.",
                                "Dosage forms for the topical or transdermal administration of a compound of this invention include powders, sprays, ointments, pastes, creams, lotions, gels, solutions, patches and inhalants. The active compound may be mixed under sterile conditions with a pharmaceutically-acceptable carrier, and with any preservatives, buffers, or butellants which may be required.",
                                "The ointments, pastes, creams and gels may contain, in addition to an active compound of this invention, excipients, such as animal and vegetable fats, oils, waxes, paraffins, starch, tragacanth, cellulose derivatives, polyethylene glycols, silicones, bentonites, silicic acid, talc and zinc oxide, or mixtures thereof.",
                                "Powders and sprays can contain, in addition to a compound of this invention, excipients such as lactose, talc, silicic acid, aluminum hydroxide, calcium silicates and polyamide powder, or mixtures of these substances. Sprays can additionally contain customary butellants, such as chlorofluorohydrocarbons and volatile unsubstituted hydrocarbons, such as butane and butane.",
                                "Transdermal patches have the added advantage of providing controlled delivery of a compound of the present invention to the body. Such dosage forms can be made by dissolving, or dispersing the pharmaceutical agents in the buter medium. Absorption enhancers can also be used to increase the flux of the pharmaceutical agents of the invention across the skin. The rate of such flux can be controlled, by either providing a rate controlling membrane or dispersing the compound in a polymer matrix or gel.",
                                "Ophthalmic formulations, eye ointments, powders, solutions and the like, are also contemplated as being within the scope of this invention.",
                                "Pharmaceutical compositions of this invention suitable for parenteral administration comprise one or more compounds of the invention in combination with one or more pharmaceutically-acceptable sterile isotonic aqueous or nonaqueous solutions, dispersions, suspensions or emulsions, or sterile powders which may be reconstituted into sterile injectable solutions or dispersions just prior to use, which may contain antioxidants, buffers, bacteriostats, solutes which render the formulation isotonic with the blood of the intended recipient or suspending or thickening agents.",
                                "In some cases, in order to prolong the effect of a drug, it is desirable to slow the absorption of the drug from subcutaneous or intramuscular injection. This may be accomplished by the use of a liquid suspension of crystalline or amorphous material having poor water solubility. The rate of absorption of the drug then depends upon its rate of dissolution, which, in turn, may depend upon crystal size and crystalline form. Alternatively, delayed absorption of a parenterally-administered drug form is accomplished by dissolving or suspending the drug in an oil vehicle. One strategy for depot injections includes the use of polyethylene oxide-polybutylene oxide copolymers wherein the vehicle is fluid at room temperature and solidifies at body temperature.",
                                "Injectable depot forms are made by forming microencapsule matrices of the subject compounds in biodegradable polymers such as polylactide-polyglycolide. Depending on the ratio of drug to polymer, and the nature of the particular polymer employed, the rate of drug release can be controlled. Examples of other biodegradable polymers include poly (orthoesters) and poly (anhydrides). Depot injectable formulations are also prepared by entrapping the drug in liposomes or microemulsions, which are compatible with body tissue.",
                                "When the compounds of the present invention are administered as pharmaceuticals, to humans and animals, they can be given per se or as a pharmaceutical composition containing, for example, 0.1% to 99.5% (more preferably, 0.5% to 90%) of active ingredient in combination with a pharmaceutically acceptable carrier.",
                                "The compounds and pharmaceutical compositions of the present invention can be employed in combination therapies, that is, the compounds and pharmaceutical compositions can be administered concurrently with, prior to, or subsequent to, one or more other desired therapeutics or medical procedures. The particular combination of therapies (therapeutics or procedures) to employ in a combination regimen will take into account compatibility of the desired therapeutics and/or procedures and the desired therapeutic effect to be achieved. It will also be appreciated that the therapies employed may achieve a desired effect for the same disorder (for example, the compound of the present invention may be administered concurrently with another anti-inflammatory or immunesupressant agent); such as but not limited to NSAIDS, DMARDS, Steroids, or biologics such as antibody therapies) or they may achieve different effects (e.g., control of any adverse effects).",
                                "The compounds of the invention may be administered intravenously, intramuscularly, intraperitoneally, subcutaneously, topically, orally, or by other acceptable means. The compounds may be used to treat arthritic conditions in mammals (i.e., humans, livestock, and domestic animals), birds, lizards, and any other organism, which can tolerate the compounds.",
                                "The invention also provides a pharmaceutical pack or kit comprising one or more containers filled with one or more of the ingredients of the pharmaceutical compositions of the invention. Optionally associated with such container(s) can be a notice in the form prescribed by a governmental agency regulating the manufacture, use or sale of pharmaceuticals or biological products, which notice reflects approval by the agency of manufacture, use or sale for human administration.",
                                "**Administration to a Subject**",
                                "Some aspects of the invention involve administering an effective amount of a composition to a subject to achieve a specific outcome. The small molecule compositions useful according to the methods of the present invention thus can be formulated in any manner suitable for pharmaceutical use.",
                                "The formulations of the invention are administered in pharmaceutically acceptable solutions, which may routinely contain pharmaceutically acceptable concentrations of salt, buffering agents, preservatives, compatible carriers, adjuvants, and optionally other therapeutic ingredients.",
                                "For use in therapy, an effective amount of the compound can be administered to a subject by any mode allowing the compound to be taken up by the appropriate target cells. “Administering” the pharmaceutical composition of the present invention can be accomplished by any means known to the skilled artisan. Specific routes of administration include but are not limited to oral, transdermal (e.g., via a patch), parenteral injection (subcutaneous, intradermal, intramuscular, intravenous, intraperitoneal, intrathecal, etc.), or mucosal (intranasal, intratracheal, inhalation, intrarectal, intravaginal, etc.). An injection can be in a bolus or a continuous infusion.",
                                "For example the pharmaceutical compositions according to the invention are often administered by intravenous, intramuscular, or other parenteral means, or by biolistic “gene-gun” application to the epidermis. They can also be administered by intranasal application, inhalation, topically, orally, or as implants, and even rectal or vaginal use is possible. Suitable liquid or solid pharmaceutical preparation forms are, for example, aqueous or saline solutions for injection or inhalation, microencapsulated, encochleated, coated onto microscopic gold particles, contained in liposomes, nebulized, aerosols, pellets for implantation into the skin, or dried onto a sharp object to be scratched into the skin. The pharmaceutical compositions also include granules, powders, tablets, coated tablets, (micro)capsules, suppositories, syrups, emulsions, suspensions, creams, drops or preparations with protracted release of active compounds, in whose preparation excipients and additives and/or auxiliaries such as disintegrants, binders, coating agents, swelling agents, lubricants, flavorings, sweeteners or solubilizers are customarily used as described above. The pharmaceutical compositions are suitable for use in a variety of drug delivery systems. For a brief review of present methods for drug delivery, see Langer R (1990) Science 249:1527-33, which is incorporated herein by reference.",
                                "The concentration of compounds included in compositions used in the methods of the invention can range from about 1 nM to about 100 μM. Effective doses are believed to range from about 10 picomole/kg to about 100 micromole/kg.",
                                "The pharmaceutical compositions are preferably prepared and administered in dose units. Liquid dose units are vials or ampoules for injection or other parenteral administration. Solid dose units are tablets, capsules, powders, and suppositories. For treatment of a patient, depending on activity of the compound, manner of administration, purpose of the administration (i.e., prophylactic or therapeutic), nature and severity of the disorder, age and body weight of the patient, different doses may be necessary. The administration of a given dose can be carried out both by single administration in the form of an individual dose unit or else several smaller dose units. Repeated and multiple administration of doses at specific intervals of days, weeks, or months apart are also contemplated by the invention.",
                                "The compositions can be administered per se (neat) or in the form of a pharmaceutically acceptable salt. When used in medicine the salts should be pharmaceutically acceptable, but non-pharmaceutically acceptable salts can conveniently be used to prepare pharmaceutically acceptable salts thereof. Such salts include, but are not limited to, those prepared from the following acids: hydrochloric, hydrobromic, sulphuric, nitric, phosphoric, maleic, acetic, salicylic, p-toluene sulphonic, tartaric, citric, methane sulphonic, formic, malonic, succinic, naphthalene-2-sulphonic, and benzene sulphonic. Also, such salts can be prepared as alkaline metal or alkaline earth salts, such as sodium, potassium or calcium salts of the carboxylic acid group.",
                                "Suitable buffering agents include: acetic acid and a salt (1-2% w/v); citric acid and a salt (1-3% w/v); boric acid and a salt (0.5-2.5% w/v); and phosphoric acid and a salt (0.8-2% w/v). Suitable preservatives include benzalkonium chloride (0.003-0.03% w/v); chlorobutanol (0.3-0.9% w/v); parabens (0.01-0.25% w/v) and thimerosal (0.004-0.02% w/v).",
                                "Compositions suitable for parenteral administration conveniently include sterile aqueous preparations, which can be isotonic with the blood of the recipient. Among the acceptable vehicles and solvents are water, Ringer's solution, phosphate buffered saline, and isotonic sodium chloride solution. In addition, sterile, fixed oils are conventionally employed as a solvent or suspending medium. For this purpose any bland fixed mineral or non-mineral oil may be employed including synthetic mono- or diglycerides. In addition, fatty acids such as oleic acid find use in the preparation of injectables. Carrier formulations suitable for subcutaneous, intramuscular, intraperitoneal, intravenous, etc. administrations can be found in Remington's Pharmaceutical Sciences, Mack Publishing Company, Easton, Pa.",
                                "The compounds useful in the invention can be delivered in mixtures of more than two such compounds. A mixture can further include one or more adjuvants in addition to the combination of compounds.",
                                "A variety of administration routes is available. The particular mode selected will depend, of course, upon the particular compound selected, the age and general health status of the subject, the particular condition being treated, and the dosage required for therapeutic efficacy. The methods of this invention, generally speaking, can be practiced using any mode of administration that is medically acceptable, meaning any mode that produces effective levels of response without causing clinically unacceptable adverse effects. Preferred modes of administration are discussed above.",
                                "The compositions can conveniently be presented in unit dosage form and can be prepared by any of the methods well known in the art of pharmacy. All methods include the step of bringing the compounds into association with a carrier which constitutes one or more accessory ingredients. In general, the compositions are prepared by uniformly and intimately bringing the compounds into association with a liquid carrier, a finely divided solid carrier, or both, and then, if necessary, shaping the product.",
                                "Other delivery systems can include time-release, delayed release or sustained release delivery systems. Such systems can avoid repeated administrations of the compounds, increasing convenience to the subject and the physician. Many types of release delivery systems are available and known to those of ordinary skill in the art. They include polymer base systems such as poly(lactide-glycolide), copolyoxalates, polycaprolactones, polyesteramides, polyorthoesters, polyhydroxybutyric acid, and polyanhydrides. Microcapsules of the foregoing polymers containing drugs are described in, for example, U.S. Pat. No. 5,075,109. Delivery systems also include non-polymer systems that are: lipids including sterols such as cholesterol, cholesterol esters and fatty acids or neutral fats such as mono-di- and tri-glycerides; hydrogel release systems; silastic systems; peptide based systems; wax coatings; compressed tablets using conventional binders and excipients; partially fused implants; and the like. Specific examples include, but are not limited to: (a) erosional systems in which an agent of the invention is contained in a form within a matrix such as those described in U.S. Pat. Nos. 4,452,775, 4,675,189, and 5,736,152, and (b) diffusional systems in which an active component permeates at a controlled rate from a polymer such as described in U.S. Pat. Nos. 3,854,480, 5,133,974 and 5,407,686. In addition, pump-based hardware delivery systems can be used, some of which are adapted for implantation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define pharmaceutical compositions",
                                "formulate for oral administration",
                                "formulate for parenteral administration",
                                "describe pharmaceutically-acceptable carrier",
                                "list examples of carriers",
                                "describe pharmaceutically-acceptable salts",
                                "list examples of salts",
                                "describe acid addition salts",
                                "describe base addition salts",
                                "list examples of alkali or alkaline earth salts",
                                "list examples of organic amines",
                                "describe wetting agents, emulsifiers, and lubricants",
                                "describe coloring agents, release agents, and coating agents",
                                "describe sweetening, flavoring, and perfuming agents",
                                "describe preservatives and antioxidants",
                                "formulate for oral, nasal, topical, rectal, vaginal, and/or parenteral administration",
                                "describe unit dosage form",
                                "determine amount of active ingredient",
                                "describe methods of preparing formulations",
                                "describe oral administration formulations",
                                "describe solid dosage forms",
                                "describe liquid dosage forms",
                                "describe suspensions",
                                "describe rectal or vaginal administration formulations",
                                "describe suppositories",
                                "describe vaginal administration formulations",
                                "describe topical or transdermal administration formulations",
                                "describe ointments, pastes, creams, and gels",
                                "describe powders and sprays",
                                "define pharmaceutical compositions",
                                "describe transdermal patches",
                                "describe ophthalmic formulations",
                                "describe pharmaceutical compositions for parenteral administration",
                                "describe depot injectable formulations",
                                "describe liposomes or microemulsions",
                                "describe combination therapies",
                                "describe administration routes",
                                "describe pharmaceutical packs or kits",
                                "introduce administration to a subject",
                                "describe formulations for pharmaceutical use",
                                "describe pharmaceutically acceptable solutions",
                                "describe routes of administration",
                                "describe pharmaceutical composition forms",
                                "describe concentration of compounds",
                                "describe effective doses",
                                "describe pharmaceutical compositions preparation",
                                "describe administration of doses",
                                "describe pharmaceutically acceptable salts",
                                "describe buffering agents",
                                "describe preservatives",
                                "describe compositions for parenteral administration",
                                "describe carrier formulations",
                                "describe mixtures of compounds",
                                "describe administration routes and delivery systems"
                            ],
                            "num_characters": 27971,
                            "outline_medium": [
                                "define pharmaceutical compositions",
                                "describe oral administration forms",
                                "describe parenteral administration forms",
                                "define pharmaceutically-acceptable carrier",
                                "list examples of pharmaceutically-acceptable carriers",
                                "define pharmaceutically-acceptable salts",
                                "describe formation of pharmaceutically-acceptable salts",
                                "list examples of pharmaceutically-acceptable salts",
                                "describe additional components of pharmaceutical compositions",
                                "describe methods of preparing pharmaceutical compositions",
                                "describe oral administration formulations",
                                "describe solid dosage forms",
                                "describe liquid dosage forms",
                                "describe formulations for rectal, vaginal, and topical administration",
                                "describe pharmaceutical compositions",
                                "formulate transdermal patches",
                                "formulate ophthalmic formulations",
                                "formulate parenteral administration",
                                "formulate depot injections",
                                "formulate injectable depot forms",
                                "describe combination therapies",
                                "describe administration routes",
                                "describe pharmaceutical packs or kits",
                                "administer effective amount to a subject",
                                "formulate pharmaceutical compositions for administration",
                                "describe delivery systems"
                            ],
                            "outline_short": [
                                "define pharmaceutical compositions",
                                "describe pharmaceutically acceptable carriers",
                                "discuss pharmaceutically acceptable salts",
                                "list accessory ingredients",
                                "outline methods of preparing formulations",
                                "describe solid dosage forms",
                                "describe liquid dosage forms",
                                "describe pharmaceutical compositions",
                                "formulate compositions for administration",
                                "administer compositions to subjects",
                                "prepare pharmaceutical pack or kit",
                                "describe modes of administration",
                                "discuss delivery systems"
                            ]
                        }
                    ],
                    "outline_long": [
                        "establish context for specification",
                        "motivate target repurposing",
                        "summarize effect of inhibitors on parasites",
                        "disclose application of NVP-BEZ235"
                    ],
                    "num_characters": 2423,
                    "outline_medium": [
                        "establish context for disclosure",
                        "disclose target repurposing for trypanosomiasis treatment"
                    ],
                    "outline_short": [
                        "introduce target repurposing"
                    ]
                },
                {
                    "title": "EQUIVALENTS",
                    "paragraphs": [
                        "The representative examples which follow are intended to help illustrate the invention, and are not intended to, nor should they be construed to, limit the scope of the invention. Indeed, various modifications of the invention and many further embodiments thereof, in addition to those shown and described herein, will become apparent to those skilled in the art from the full contents of this document, including the examples which follow and the references to the scientific and patent literature cited herein. It should further be appreciated that the contents of those cited references are incorporated herein by reference to help illustrate the state of the art. The following examples contain important additional information, exemplification and guidance which can be adapted to the practice of this invention in its various embodiments and equivalents thereof."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "disclaim limitation of examples"
                    ],
                    "num_characters": 868,
                    "outline_medium": [
                        "disclaim limitation of examples"
                    ],
                    "outline_short": [
                        "disclaim limitation of examples"
                    ]
                },
                {
                    "title": "Examples",
                    "paragraphs": [
                        "Those skilled in the art will recognize, or be able to ascertain, using no more than routine experimentation, numerous equivalents to the specific substances and procedures described herein. Such equivalents are intended to be encompassed in the scope of the claims that follow the examples below.",
                        "The Examples described below test the potency of established phosphoinosityl-3-kinase (PI3K) inhibitors against three trypanosomatid parasites: Trypanosoma brucei, T. cruzi, and Leishmania sp., which are the causative agents for African sleeping sickness, Chagas disease, and leishmaniases, respectively. Among these inhibitors is a potent clinical candidate against cancer, NVP-BEZ235, which was demonstrated to be a highly potent trypanocide against parasite cultures, and in a mouse model of T. brucei infection. Additionally, the examples describe observations of these inhibitors' effects on parasite growth and other cellular characteristics.",
                        "Presented herein are the selection and screening results of commercially available mTOR inhibitors against T. brucei and L. major as well as the design and synthesis of a variety of analogs of two non-limiting representative mTOR inhibitors, PI-103 and WYE-354. Eight mTOR kinase domain inhibitors were chosen for screening against whole parasites, including T. brucei brucei, T. brucei rhodesiense (human infective strain) and L. major promastigotes. NVP-BEZ-235, PI-103, WYE-354 and PP242 were all found to be potent anti-parasitic agents (FIGS. 1A and 1B). Three of the four were more potent with human infective T. brucei rhodesiense than with T. brucei brucei. PI-103 and WYE-354 were chosen for analog synthesis and structure activity relationship (SAR) analysis."
                    ],
                    "subsections": [
                        {
                            "title": "Materials and Methods",
                            "paragraphs": [
                                "Ethics Statement.",
                                "The animal experimental protocol (2010102/1) used for African trypanosome studies was reviewed and approved by the Ethical Committee IPBLN-CSIC of the Spanish Council of Scientific Research (CSIC). For T. cruzi, animal studies were approved by the Institutional Animal Care and Use Committee of New York University School of Medicine (protocol #81213), which is fully accredited by the Association For Assessment and Accreditation Of Laboratory Animal Care International (AAALAC). For L. major, animal studies were approved by the Animal Studies Committee at Washington University (protocol #20090086) in accordance with the Office of Laboratory Animal Welfare's guidelines and the Association for Assessment and Accreditation of Laboratory Animal Care International."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "ethics statement"
                            ],
                            "num_characters": 786,
                            "outline_medium": [
                                "ethics statement and animal study approvals"
                            ],
                            "outline_short": [
                                "describe ethics statement and animal study approvals"
                            ]
                        },
                        {
                            "title": "Compounds",
                            "paragraphs": [
                                "Inhibitor compounds were received from commercial vendors. PI-130, NVP-BEZ235, Ku-0063794, Pp242, and WYE-354 were obtained from Chemdea, Inc. (Ridgewood, N.J.). LY294002, LY303511, and Compound 401 were obtained from Tocris Biosciences (Ellisville, Mo.)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list inhibitor compounds and vendors"
                            ],
                            "num_characters": 255,
                            "outline_medium": [
                                "obtain inhibitor compounds from commercial vendors"
                            ],
                            "outline_short": [
                                "list sources of inhibitor compounds"
                            ]
                        },
                        {
                            "title": "In Vitro Experiments",
                            "paragraphs": [
                                "Potency Assessment Against T. Brucei.",
                                "Assays were performed using the strain of T. brucei brucei Lister 427 adapted to the laboratory, and the human-infective strain T. b. rhodesiense (EATRO3 ETat1.2 TREU164 [37]). Both strains were grown and tested as bloodstream forms. To establish the EC50, cultures of Trypanosoma brucei and T. b. rhodesiense were treated with two-fold increasing concentrations of compounds (with similar DMSO increasing concentration as control). Cell populations were measured at 72 hours with an Infinite F200 microplate reader (Tecan Austria GmbH, Austria); the determination of cell viability was carried out by the established colorimetric technique AlamarBlue® with modifications, a 96-well plate format spectrophotometric assay which measures the ability of living cells to reduce resazurin [38,39]. Data obtained with T. b. brucei Lister 427 were confirmed by manual counting in a Neubauer chamber for a direct microscopic examination to rule out multinucleated phenotypes that could mask the colorimetric assays, as well as the subtraction of solvent background to dismiss a potential solvent-derived fluorescence. Pentamidine was used as drug control for potency comparison, and T. b. brucei Lister 927 strain was included in our experiments to evaluate the adaptation to medium for the different strains as a variable condition.",
                                "Analysis of Morphological and Cell Cycle Alterations from Compound Treatment in T. brucei.",
                                "Flow cytometry was used to assess cell size and DNA content, to reveal a G1 arrest and inhibition of protein synthesis or G2 arrest and multinucleated cells. Briefly, bloodstream cells of T. brucei brucei Lister 427 strain in early log phase culture were treated with high dose (1 μM for PI-103, 2 μM for WYE-354 and Pp242 and 100 nM for NVP-BEZ235) of compounds for 16 hours, when the cells were pelleted and washed to remove all traces of drug. After permeabilization with 14, saponin (0.5 mg/mL final concentration), the culture was RNAse treated for 30 minutes (10 μg/mL final concentration) and stained with 20 μg/mL propidium iodide immediately before its acquisition in a FACscan cytometer. Cells incubated with equivalent concentration of drug solvent (DMSO) were included in each experiment as control population.",
                                "Potency Assessment Against T. Cruzi.",
                                "T. cruzi trypomastigotes from the Tulahuen strain stably expressing the β-galactosidase gene [40] were obtained from the supernatant of infected cultures of LLC-MK2 cells harvested between days 5 and 7. To remove amastigotes, trypomastigotes were allowed to swim out of the pellet of samples that had been centrifuged for 7 min at 2500 rpm.",
                                "Intracellular Replication.",
                                "5×104 NIH/3T3 cells and 5×104 trypomastigotes/per well were seeded in 96-well plates in DMEM supplemented with 2% FBS and Pen-Strep-Glut. DMEM did not contain phenol red to avoid interference with the assay absorbance readings at 590 nM. After 3 hours, compounds were added to a final volume of 200 μl/well at the indicated concentrations and mixed by pipetting. A 4 μM Amphotericin B solution (Sigma-Aldrich) was used as positive control. After 4 days of incubation at 37° C. 5% CO2, 50 μl of PBS containing 0.5% of NP40 and 100 μM chlorophenol red-β-D-galactoside (CPRG) (Fluka) were added in each well. Plates were incubated at 37° C. for 4 hours and absorbance was read at 590 nm.",
                                "Extracellular Survival.",
                                "Free trypomastigotes were rinsed once and placed in 96-well plates at 100,000/well with the compounds in a final volume of 200 μl of DMEM without phenol red supplemented with 2% FBS, Pen-Strep-Glut and 100 μM CPRG. Plates were incubated for 24 h at 37° C. and absorbance was read at 590 nm.",
                                "Potency Assessment Against Leishmania.",
                                "Leishmania major strain FV1 (MHOM/IL/80/Friedlin) was grown in M199 media [41]. Leishmania donovani strain LdBob (MHOM/SD/62/1S-CL2D) were grown in modified M199 media as promastigotes (26° C.) [42]. Amastigote specific media (37° C.) was used for growth and differentiation of amastigotes [42]. L. donovani axenic amastigotes were passed once following differentiation prior to use. Cells were enumerated using a Coulter Counter (BD Biosciences); as amastigotes tend to grow in clumps, L. donovani axenic amastigotes were passed gently through a blunt 27-gauge needle prior to counting. For determination of EC50s, log phase cells were inoculated at concentration of 105/ml into appropriate media with compounds as indicated, and counted when the controls lacking drug had reached late logarithmic phase. The EC50 is defined as the concentration of drug inhibiting 50% of control growth, and was calculated by linear regression analysis using SigmaPlot 2000.",
                                "Cell Size and DNA Content Analysis in Leishmania.",
                                "L. major log phase promastigotes were inoculated at a concentration of 106 cells/ml into media with compounds as indicated, and incubated overnight with varying drug concentrations to assess cell size and DNA content. For cell size, forward scatter of live promastigotes was measured by a FACS flow cytometer (Becton Dickinson), utilizing dye exclusion with 5 μg/ml propidium iodide (PI) to gate for live cells. DNA content was determined by flow cytometry using fixed and permeabilized L. major stained with PI as previously described [43,44], but reducing the incubation time with PI and RNase A from 1 hour to 30 minutes. Histogram analysis was performed using CellQuest 3.1 software (BD Bioscience)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe potency assessment against T. brucei",
                                "detail cell viability measurement",
                                "analyze morphological and cell cycle alterations",
                                "describe potency assessment against T. cruzi",
                                "detail intracellular replication assay",
                                "describe extracellular survival assay",
                                "describe potency assessment against Leishmania",
                                "analyze cell size and DNA content in Leishmania",
                                "detail flow cytometry analysis",
                                "summarize EC50 calculation"
                            ],
                            "num_characters": 5448,
                            "outline_medium": [
                                "potency assessment against T. brucei",
                                "analysis of morphological and cell cycle alterations",
                                "potency assessment against T. cruzi",
                                "potency assessment against Leishmania",
                                "cell size and DNA content analysis in Leishmania"
                            ],
                            "outline_short": [
                                "describe potency assessment against T. brucei and T. cruzi",
                                "analyze morphological and cell cycle alterations from compound treatment"
                            ]
                        },
                        {
                            "title": "In Vivo Experiments.",
                            "paragraphs": [
                                "Drug Dosage.",
                                "The targeted dosage of inhibitors was determined based on the pharmacokinetic studies disclosed by Maira, et al. [45]. The goal was to test NVP-BEZ235 in the animal models at the highest dose achievable without inducing toxicity. For L. major, 12.5 mg/kg orally was the highest tolerable dose while 30 mg/kg intraperitoneally was used for the T. cruzi infections. A lower dose was initially used in T. brucei, 5 or 10 mg/kg intraperitoneally.",
                                "T. brucei:",
                                "Balb/c female mice were obtained from Jackson Laboratories (Bar Harbor, Me.). All animal protocols in M.N. lab were approved by the CSIC-IPBLN Committee on Use and Care of Laboratory Animals. Balb/C mice were infected with 104 cells of an early log phase culture of T. b. rhodesiense EATRO3; 72 hours after infection the mice were arbitrarily separated into three independent groups, daily treated with 5 or 10 mg/kg NVP-BEZ235, or DMSO, via intraperitoneal injection for four days. The parasitemia was checked at days 3, 5, 7, 11 and 14 post-infection in alive mice: in those cases the parasitemia was too low to detect by Neubauer chamber count, the extracted blood was incubated in a 24-well plate with HMI-9 medium supplemented with 20% SBFi at 37° C. with 5% CO2, and positive wells were confirmed by direct visualization of parasites. Humanitarian sacrifice was executed, according to Ethic Commission of Animal Welfare directions, and necropsies were done in order to identify any physical side effect related to administration.",
                                "T. cruzi:",
                                "Balb/c mice were inoculated intraperitoneally with 105 trypomastigotes from T. cruzi Y strain expressing firefly luciferase (kindly provided by Dr. Barbara Burleigh, Harvard University). On day 7 post-infection, mice were anesthetized with ketamine/xylazine and injected with 3 mg of D-Luciferin Potassium Salt (Gold Biotechnology) at 20 mg/ml in PBS and imaged in the IVIS Lumina II (Caliper Life Sciences). On day 8, groups of five mice were injected ip with either 30 mg/kg of NVP-BEZ235 in DMSO or only DMSO, as control. Mice were treated for 5 days and imaged again on day 13. Data is expressed as the ratio between luciferase units in day 13 versus day 7 to determine the progression of infection with and without drug treatment.",
                                "L. major:",
                                "Mouse experiments were done in compliance with policies approved by the Animal Review Board at Washington University. Mice were infected with luciferase expressing L. major (LmFV1LucTK-1) and analyzed by bioluminescent imaging as described [46]. Balb/c mice were infected with 105 L. major metacyclic stage parasites purified by gradient centrifugation [47]. Luminescence was measured using an IVIS 100 instrument and analyzed with Living Image software version 2.60. NVP-BEZ235 was resuspended in DMSO and applied at 12.5 mg/kg/day by oral gavage for 10 days, with treatment starting day 17 post-infection. At this dose the mice showed significant weight loss, suggesting that this dosage was the highest practicable, as dosing intraperitoneally at 25 mg/kg/day was lethal."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe drug dosage determination",
                                "detail T. brucei mouse model",
                                "describe T. cruzi mouse model",
                                "detail L. major mouse model",
                                "describe bioluminescent imaging",
                                "summarize treatment and imaging protocols"
                            ],
                            "num_characters": 3040,
                            "outline_medium": [
                                "drug dosage and pharmacokinetic studies",
                                "in vivo experiments with T. brucei",
                                "in vivo experiments with T. cruzi and L. major"
                            ],
                            "outline_short": [
                                "describe drug dosage and in vivo experiments for T. brucei, T. cruzi, and L. major"
                            ]
                        },
                        {
                            "title": "Results",
                            "paragraphs": [
                                "**Compound Selection.**",
                                "Eight commercially-available compounds (FIG. 4, Table 1) were selected to profile for activity against Trypanosoma brucei, T. cruzi and two species of Leishmania, cutaneous L. major and visceral L. donovani. FIG. 1 shows EC50 determinations of WYE-354, PP242, PI-103, and NVP-BEZ-235 in T. brucei rhodesiense. To identify inhibitors of trypanosome TORs or PI3Ks, a range of compounds with varied potencies and selectivities against mTOR/PI3K were selected. In mammalian cells, compounds Ku-0063794 [21,22], Pp242 [18], and WYE-354 [48] inhibit the kinase domain of mTOR selectively with low nanomolar IC50 values. LY294002 is a mixed inhibitor targeting both mTOR/PI3K [49], and many analogs have been made (including LY303511, which inhibits mTOR-dependent and independent pathways, but does not inhibit PI3Ks [50,51]). PI-103 inhibits PI3Ks with high potency and mTOR with a reported 20 nM IC50 [52,53,54]. Compound 401, a compound structurally related to LY303511, inhibits mTOR and cellular growth at low micromolar concentrations [55], while NVP-BEZ235 inhibits both PI3Ks and mTOR with sub-nanomolar IC50 values [56,57].",
                                "The table below presents the effects of the compounds on human and trypanosome cells.",
                                "**In Vitro Testing of Inhibitors.**",
                                "The compounds were first tested against parasites grown in vitro. For T. brucei and Leishmania donovani, it is possible to cultivate free parasites in vitro as the infective stage forms: bloodstream form (BSF) for T. brucei, and axenic amastigotes for L. donovani. compounds were also tested against L. major promastigotes (the stage carried normally by the insect vector). To study infective forms of T. cruzi, compounds were added simultaneously with trypomastigotes to 3T3 fibroblast host cells and incubated for four days. This protocol thus monitors all steps of the T. cruzi infective cycle (entry, differentiation and replication as amastigotes) as well as potential effects mediated through host cell PI3Ks. The results of the in vitro assessment of this inhibitor collection are shown in Table 2.",
                                "Table 2A shows the structures of PI-103 and WYE-354 analogs that were synthesized and tested. Table 2B shows the biological assessment of PI-103 and WYE-354 analogs versus trypanosomatid parasites.",
                                "The most potent compound against all the species tested was NVP-BEZ235, showing nanomolar potency against BSF T. brucei brucei (Lister 427) and sub-nanomolar activity (730 pM) against the human-infective EATRO3 strain of T. b. rhodesiense (FIG. 10A, F). Interestingly, the BSF T. brucei gambiense, ELIANE strain [37] was even more sensitive, with an EC50 of 179 pM. PI-103 showed good activity against T. b. brucei and T. b. rhodesiense cultures (200 and 100 nM, respectively). The other inhibitors showed micromolar activity against T. brucei brucei, and, as observed with NVP-BEZ235, these inhibitors are approximately ten-fold more potent against T. b. rhodesiense. The variation in potency of NVP-BEZ235 across different strains of T. brucei, (including the T. brucei brucei Lister 927 strain) is comparable to that seen in similar studies of pentamidine, an established drug (Table 3).",
                                "In infections of host cell fibroblasts by infective trypomastigotes, T. cruzi was refractory to all the inhibitors tested, except for NVP-BEZ235 (EC50=120 nM, FIG. 10E). For this compound amastigotes lysis within host cells was observed after three days when the drug was dosed at 350 nM (˜3× the EC50; FIG. 11A). In FIG. 11A, NIH-3T3 host cells were incubated with T. cruzi trypomastigotes for 2 hours before addition of NVP-BEZ235 (350 nM). Cells were incubated for 4 days during which time the parasites differentiate and replicate as amastigotes. At that time cells were fixed and stained with an anti-T. cruzi antiserum (green) and DAPI to visualize DNA (blue). The upper panel shows control cells with intact amastigotes, and the lower panel shows debris of parasite proteins throughout the host cell cytoplasm. In contrast, NVP-BEZ235 showed little activity (EC50>50 μM) against free trypomastigotes, which do not replicate outside of host cells. This suggests that NVP-BEZ235 could act specifically against the amastigotes stage, or by activation of host cell responses.",
                                "For Leishmania, NVP-BEZ235 and PI-103 showed submicromolar inhibition across both species and stages (70-140 or 320-1050 nM respectively), while Pp242 and WYE-354 showed modest activity (0.4-2.4 μM or 4-6 μM respectively, FIG. 10B-D). The remaining four inhibitors (LY294002, LY303511, Compound 401 and Ku-63794) were inactive against L. major promastigotes and L. donovani axenic amastigotes at the highest concentration tested and were not tested against L. donovani promastigotes. While some compounds showed statistically significant differences amongst the Leishmania strains/species, the differences were modest and not studied further.",
                                "**Phenotypic Effects Elicited by PI3K Inhibitor Treatments**",
                                "We examined effects of several of the strongest inhibitors on cell size, shape and/or DNA content, since mTOR and PI3K inhibitors affect the size of both mammalian and T. brucei cells and induce characteristic growth phase arrests [29,58].",
                                "Sixteen hour treatment of BSF T. brucei brucei with drug at an effective concentration (described below) produced two different types of effects on cellular DNA content (FIG. 11B). FIG. 11B and FIG. 11C show the fluorescence-activated cell sorter (FACS) analysis of cell size (Forward Scatter, FSC) and DNA content after drug treatment. In FIG. 11B, bloodstream form culture of T. b. brucei was subjected to different drugs, indicated to the side, and analyzed by FACS for cell size and DNA content stained by propidium iodide. Cell cultures were incubated during 16 h with PI-103 (1 μM), WYE-354 (2 μM), Pp242 (2 μM) and NVP-BEZ235 (100 nM), represented with dark lines, and with DMSO as control population, represented as shaded area. Two drugs, (PI-103 and Pp242), tested at 1 μM and 2 μM, respectively) induced G1 arrest, an effect maintained even at low concentrations of Pp242 (200 nM, data not shown). While the inhibitor PI-103 showed a clearly defined profile in cell cycle progression, NVP-BEZ235 produced a combination of effects on the cell cycle progression at 0.1 μM, including the appearance of zoids (anucleated cells) [59] and multinucleated cells. This relatively high dose of NVP-BEZ235 (10× the EC50) produced a reduction of G1 and G2 cells. Finally, treatment of T. b. brucei cells with WYE-354 resulted in no significant variations in cell cycle, with a small but noticeable reduction in cell size.",
                                "We examined the effect on cell size and DNA content for the four compounds that displayed activity against L. major promastigotes, using drug concentrations (EC60-EC90) that were strongly inhibitory, but without inducing complete growth arrest or cellular toxicity (as evidenced by PI exclusion tests, not shown). For all concentrations tested, both PI-103 and WYE-354 treatment induced a G1 arrest and a decrease in cell size (FIG. 11C) as seen for start here mTORC1 inhibitors in mammalian cells. FIG. 11C shows results from the treatment of Leishmania major promastigotes. Dark lines are WT parasites examined when in logarithmic growth phase; shaded areas are parasites grown in the presence of the indicated concentration of drug. Cell size (FSC) and DNA content (PI staining) were determined as indicated in Panel B and/or as described in the Methods. The subpanels show data for PI-103 (4 μM, ˜EC90); WYE-354 (25 μM, ˜EC60); NVP-BEZ235 (0.5 μM, EC90) and Pp242 (dashed lines 12.5 μM/˜EC90, shaded area 25 μM/˜EC90). In contrast, NVP-BEZ235 treatment induced G2 growth arrest and increased promastigote size in a manner similar to the cell phenotype observed in mammalian cells exposed to mTORC2 inhibitors. Microscopy data suggests that the G2 arrest was actually due to altered cytokinesis, as evidenced by the abundance of individual cells that contain 2 nuclei and kinetoplasts (data not shown), again consistent with known effects of mTORC2 inhibition in mammalian cells. Though PI-103, WYE-354 and NVP-BEZ235 generated single phenotypes, Pp242 generated two different phenotypes depending on the drug concentration. At lower concentrations, Pp242 induced a decrease in cell size and a G1 arrest, while at higher concentrations a G2 arrest and increase in cell size was observed (FIG. 11C). This suggests the likelihood of inhibition of multiple targets with various affinities within the parasite.",
                                "**In Vivo Tests**",
                                "The most active inhibitor, NVP-BEZ235, was chosen for testing in appropriate animal models of T. brucei rhodesiense, T. cruzi, and L. major infection. Using the highest tolerable doses appropriate for each infection model, no efficacy was observed against either T. cruzi (30 mg/kg, 5 days, intraperitoneal) or L. major (12.5 mg/kg/day, 10 days, oral gavage) (data not shown). Weight loss was observed in drug-treated mice infected with L. major and higher drug doses were lethal.",
                                "In contrast, a marked decrease in parasitemia was observed by intraperitoneal dosage (5 or 10 mg/kg) of NVP-BEZ235 in T. brucei rhodesiense infected mice. Drug was administered once per day, for four days. A dramatic decrease in parasitemia was observed within two days, below the detection limit of 104 parasites/mL. All mice in the untreated group died the 6th day post-inoculation, while the mean survival day (MSD) for animals treated with 5 mg/kg of NVP-BEZ235 was extended to 10.8 (±2.4) days. The MSD of mice treated with 10 mg/kg increased to 13.4 (±3.3) days, doubling the survival of the control group (FIG. 12). FIG. 12 shows the trypanocidal activity of NVP-BEZ235 in an acute mouse infection model. The arrow indicates the drug dosing schedule. The mean parasitemia for each group is represented for each day up to the death of all mice in a group. The mean survival day (MSD) is labeled in the graphic with daggers.",
                                "These experiments have identified small molecules useful for further medicinal chemistry optimization and for gaining a better understanding of molecular pharmacology. Noting the functional and structural homology between TOR and PI3Ks in humans and trypanosomatids and encouraged by the surprising growth inhibitory phenotype resulting from suppression of TOR in T. brucei [60] and L. major [30], we identified and procured eight established inhibitors for assessment against parasite cultures. Several of these inhibitors inhibited parasite growth in all species/strains tested, and one, NVP-BEZ235, reduced parasitemia in an animal model of T. brucei rhodesiense infection, significantly extending survival.NVP-BEZ235 showed very potent inhibition of T. brucei growth, with a phenotype similar to that seen previously in genetic studies of TOR and TbVps34 [28]. A modest treatment regime (10 mg/kg, for four days) was able to eliminate 80% of the parasites in T. b. rhodesiense infections. The in vitro potency (179 pM EC50) observed against T. b. gambiense was exceedingly high, at a level rarely seen against these protozoan parasites. The reason for the difference in potency between T. b. rhodesiense and gambiense is not known at this time. While not limited by any mechanism of action, T. b. gambiense, with a lower generation rate and poorer adaptation to culture than T. b. rhodesiense, may be more affected by an antiproliferative drug as NVP-BEZ235. This difference was also observed between T. b. brucei Lister 427 and 927 (Table 3). The potency of this compound and the complex cell cycle phenotype observed suggest that the compound likely has a number of molecular targets in T. brucei, perhaps affecting other essential cellular functions besides cell proliferation.",
                                "T. cruzi was relatively insensitive to the inhibitors compared to T. brucei. While not limited by any mechanism of action, this may arise from the fact that T. cruzi trypomastigotes, the form of the parasite that proliferates in the human, only replicates in the intracellular environment. As a consequence, compounds need to cross the plasma membrane of the host cell to have access to T. cruzi, while T. brucei is directly accessible to the drugs in the bloodstream. When NVP-BEZ235 was tested against free, non-replicating T. cruzi trypomastigotes, it was inactive, while it induced lysis of intracellular T. cruzi amastigotes. This raises the possibility that this compound acts either specifically against the amastigote stage, or through effects on host cell PI3Ks, or some combination. The involvement of host cell PI3K and mTOR pathways in immune evasion has been recently reported for L. donovani [61].",
                                "Leishmania showed a range of sensitivities to the panel of inhibitors, with the most potent compounds active at sub-micromolar concentrations. This may be compared to the efficacy of current front line anti-leishmanial agents, whose potencies when measured by methods similar to those described here range from 30 nM for amphotericin B to 15 uM for antimonial based compounds (Seifert et al, 2011).",
                                "The EC50 values for the compounds tested were similar for L. major promastigotes, L. donovani promastigotes and L. donovani axenic amastigotes, suggesting that preliminary screening against a single form could be sufficient in the future. However, despite its potency against L. donovani axenic amastigotes, high doses of NVP-BEZ235 against L. major infections of mice showed no therapeutic effect (data not shown). As discussed above for T. cruzi, the lack of efficacy in the animal model of L. major could reflect a similar need for the drug to traffic to the phagolysosomal compartment where Leishmania reside. The 12.5 mg/kg regime tested here resulted in severe weight loss (not shown) suggesting attempts to treat with higher doses of NVP-BEZ235 would result in significant toxicity.",
                                "Current data suggest there are at least 12 members of the PI3 Kinase protein superfamily, for which the phenotypic effects of inhibition or genetic deletion in T. brucei or Leishmania are known for only five. Thus, it is unknown what the likely cellular target may be. However, with an eye towards initial identification of specific targets potentially involved in the activity of NVP-BEZ235, we note a similar cell cycle phenotype that Hall et al. reported upon RNAi knockdown of TbVsp34 [28], including the appearance of zoids, multinucleated cells and reduction of G1 and G2 (FIG. 11B). Barquilla et al. also showed the same pattern after RNAi of TOR2 [35].",
                                "In trypanosomes and mammals, TORC1 inhibition is known to result in G1 arrest and debreased cell size, while TORC2 results in G2 arrest and increased cell size [29,33,62,63,64,65]. In both T. brucei and Leishmania PI-103 resulted in G1 arrest and cell size reduction, while NVP-BEZ235 resulted in aberrant cell cycle and multiple cell sizes (FIG. 11). WYE-354 also resulted in G1 arrest/cell size decrease in Leishmania. In contrast, while Pp242 showed G1 arrest/cell size decrease in trypanosomes, this was only found at lower drug concentrations in L. major, and at higher drug concentrations G2 arrest and increased cell size was observed instead. Thus, while the effects of specific inhibitors on trypanosomatids may resemble those seen against mammalian cells targeting specific TOR or PI3K targets, future studies will be required to more definitely establish the true mode(s) of action against the individual parasite species, which may differ.",
                                "It appears that the mTOR/PI3K inhibitors display generally superior activity against trypanosomatid growth over mTOR-selective inhibitors. This may be suggestive of the effect being mediated via inhibition of multiple trypanosomal PI3Ks, including PI3KKs such as TOR. With that in mind, efforts to identify the mechanism of action of these mTOR inhibitors in trypanosomatids will direct further medicinal chemistry efforts. Despite the lack of certainty of the mechanism of action of these compounds, the results provide a validation for the repurposing approach as a screening tool as an efficient approach to identification of compounds that are effective in parasite killing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce compound selection",
                                "describe compound properties",
                                "present EC50 determinations",
                                "introduce in vitro testing",
                                "describe testing protocol",
                                "present results of in vitro assessment",
                                "describe PI-103 and WYE-354 analogs",
                                "present biological assessment of PI-103 and WYE-354 analogs",
                                "describe NVP-BEZ235 activity",
                                "present EC50 values for NVP-BEZ235",
                                "describe PI-103 activity",
                                "present EC50 values for PI-103",
                                "describe other inhibitors' activity",
                                "present EC50 values for other inhibitors",
                                "describe T. cruzi refractoriness",
                                "present NVP-BEZ235 activity against T. cruzi",
                                "describe Leishmania inhibition",
                                "present EC50 values for Leishmania inhibition",
                                "introduce phenotypic effects",
                                "describe cell size and DNA content effects",
                                "present FACS analysis results",
                                "describe PI-103 and Pp242 effects",
                                "describe NVP-BEZ235 effects",
                                "describe WYE-354 effects",
                                "introduce in vivo tests",
                                "describe NVP-BEZ235 testing in animal models",
                                "present results of NVP-BEZ235 testing",
                                "describe lack of efficacy in T. cruzi and L. major models",
                                "describe trypanocidal activity of NVP-BEZ235",
                                "discuss functional and structural homology",
                                "discuss growth inhibitory phenotype",
                                "discuss potential targets and future studies"
                            ],
                            "num_characters": 16150,
                            "outline_medium": [
                                "select compounds for profiling",
                                "introduce compounds with varied potencies and selectivities",
                                "describe LY294002 and its analogs",
                                "describe PI-103 and its potency against PI3Ks and mTOR",
                                "describe NVP-BEZ235 and its potency against PI3Ks and mTOR",
                                "present effects of compounds on human and trypanosome cells",
                                "describe in vitro testing of inhibitors against parasites",
                                "present results of in vitro assessment of inhibitor collection",
                                "describe potency of NVP-BEZ235 against T. brucei",
                                "describe potency of PI-103 against T. brucei",
                                "describe potency of other inhibitors against T. brucei",
                                "describe potency of NVP-BEZ235 against T. cruzi",
                                "describe potency of inhibitors against Leishmania",
                                "examine phenotypic effects of PI3K inhibitor treatments",
                                "describe in vivo tests of NVP-BEZ235 against T. brucei, T. cruzi, and L. major",
                                "discuss results and implications for further research"
                            ],
                            "outline_short": [
                                "select compounds for profiling",
                                "describe in vitro testing of inhibitors",
                                "present effects of compounds on human and trypanosome cells",
                                "describe phenotypic effects elicited by PI3K inhibitor treatments",
                                "examine effects on cell size and DNA content",
                                "describe in vivo tests of NVP-BEZ235",
                                "discuss results and implications for medicinal chemistry optimization",
                                "summarize findings and suggest future directions"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce trypanosomatid parasites",
                        "describe potency of PI3K inhibitors",
                        "summarize effects on parasite growth and cellular characteristics"
                    ],
                    "num_characters": 1718,
                    "outline_medium": [
                        "test potency of PI3K inhibitors against trypanosomatid parasites"
                    ],
                    "outline_short": [
                        "test potency of PI3K inhibitors against trypanosomatid parasites"
                    ]
                },
                {
                    "title": "EQUIVALENTS",
                    "paragraphs": [
                        "Those skilled in the art will recognize, or be able to ascertain, using no more than routine experimentation, numerous equivalents to the specific embodiments described specifically herein. Such equivalents are intended to be encompassed in the scope of the following claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "recognize equivalents to specific embodiments"
                    ],
                    "num_characters": 275,
                    "outline_medium": [
                        "acknowledge that equivalents to the specific embodiments described can be ascertained using no more than routine experimentation"
                    ],
                    "outline_short": [
                        "statement on equivalents to specific embodiments"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (I),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR27, R28, R29, and R34 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nR30 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORaRb, or C(O)NRaRb;\nR31 is hydrogen, halogen, OH, CN, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nR32 and R33 are each independently hydrogen or C1-C4 alkyl;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-C4 alkyl; and\nn15, n16, and n17 are each independently 0, 1, 2, 3, or 4.",
        "2. The method of claim 1, wherein R31 is CN.",
        "3. The method of claim 1, wherein R32 and R33 are each H.",
        "4. The method of claim 1, wherein R30 is Me.",
        "5. The method of claim 1, wherein R27 is OMe, OH, or OAc.",
        "6. The method of claim 1, wherein R29 and R34 are each H.",
        "7. The method of claim 1, wherein the compound is",
        "8. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VI),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR1, R2, R3, and R4 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;\nR5 and R6 are each independently hydrogen or C1-C4 alkyl;\nX1 and X2 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and\nn1, n2, and n3 are each independently 0, 1, 2, 3, or 4.",
        "9. The method of claim 8, wherein X1 and X2 are each independently O.",
        "10. The method of claim 8, wherein R4 is attached to the C1 position of Formula (VI).",
        "11. The method of claim 8, wherein R4 is OMe.",
        "12. The method of claim 8, wherein R6 is Me.",
        "13. The method of claim 8, wherein R1 is OH.",
        "14. The method of claim 8, wherein the compound is:",
        "15. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (II),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR7, R8, R9, and R10 are each independently hydrogen, C1-C4 alkyl, aryl, heteroaryl, alkylaryl, alkylheteroaryl, C(O)Ra, C(O)ORa, or C(O)NRaRb;\nR11, R12 and R13 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, NRaRb, C(O)Ra, or C(O)NRaRb;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl; and\nn4 is 0, 1, 2, 3, or 4.",
        "16. The method of claim 15, wherein R7 and R8 are H.",
        "17. The method of claim 15, wherein R13 is H.",
        "18. The method of claim 15, wherein R9 is methyl, ethyl, or isopropyl.",
        "19. The method of claim 15, wherein R10 is H.",
        "20. The method of claim 15, wherein R11 is OH.",
        "21. The method of claim 15, wherein the compound is:",
        "22. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (III),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein R14 is hydrogen, —C1-C4 alkyl-NRaC(O)ORa, or\n\nR15 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb, or\n\n\nRc and R16 are each independently hydrogen or C1-C4 alkyl;\nR17 is hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl;\nX is C or N;\nX3 and X4 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa; and\nn5, n6, and n7 are each independently 0, 1, 2, 3, or 4.",
        "23. The method of claim 22, wherein X4 is N-benzyl.",
        "24. The method of claim 22, wherein X4 is N-(pyridin-3-ylmethyl).",
        "25. The method of claim 22, wherein X4 is NC(O)OMe.",
        "26. The method of claim 22, wherein X4 is NH.",
        "27. The method of claim 22, wherein R14 is",
        "28. The method of claim 22, wherein R17 is NH2, OH, NHC(O)OMe, or NHC(O)OC(CH3)3.",
        "29. The method of claim 22, wherein R15 is H.",
        "30. The method of claim 22, wherein R15 is NHCH2CH2OCH2CH3.",
        "31. The method of claim 22, wherein R14 is CH2CH2NHC(O)OCH3.",
        "32. The method of claim 22, wherein X3 is CH2.",
        "33. The method of claim 22, wherein X3 is O.",
        "34. The method of claim 22, wherein the compound is selected from the group consisting of:",
        "35. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (IV),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR18, R19, and R20 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nR21 is hydrogen or C1-C4 alkyl;\nX5 and X6 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and\nn8, n9, and n10 are each independently 0, 1, 2, 3, or 4.",
        "36. The method of claim 35, wherein X5 is O.",
        "37. The method of claim 35, wherein X6 is O.",
        "38. The method of claim 35, wherein X6 is NH.",
        "39. The method of claim 35, wherein R20 is H.",
        "40. The method of claim 35, wherein the compound is selected from the group consisting of:",
        "41. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (V),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR24 is hydrogen, C1-C4 alkyl, aryl, heteroaryl, NRaRb,\n\n\nR22 and R23 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, C1-C4 alkyl-ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nR25 and R26 are each independently hydrogen or C1-C4 alkyl;\nX7 and X8 are each independently CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl-O—C1-4 alkyl;\nY is C or N; and\nn11, n12, n13, and n14 are each independently 0, 1, 2, 3, or 4.",
        "42. The method of claim 41, wherein R24 is H.",
        "43. The method of claim 41, wherein R24 is NHCH2CH2OCH2CH3.",
        "44. The method of claim 41, wherein R24 is",
        "45. The method of claim 41, wherein R24 is",
        "46. The method of claim 41, wherein R24 is",
        "47. The method of claim 41, wherein R23 is H.",
        "48. The method of claim 41, wherein R23 is ortho-OEt.",
        "49. The method of claim 41, wherein R23 is meta-OMe, meta-OH, or meta-OAc.",
        "50. The method of claim 41, wherein R23 is para-OMe.",
        "51. The method of claim 41, wherein R23 is meta-CH2CH2OH.",
        "52. The method of claim 41, wherein X7 is S or O.",
        "53. The method of claim 41, wherein Y is N.",
        "54. The method of claim 41, wherein Y is C.",
        "55. The method of claim 41, wherein the compound is selected from the consisting of:",
        "56. A method of treating a disease caused by a trypanosomatid parasite, comprising administering a therapeutically effective amount of an mTOR and/or PI3K inhibitor compound to a subject in need of treatment, wherein the compound has the structure of Formula (VII),\n\n\nor a pharmaceutically acceptable salt or hydrate thereof,\nwherein\nR35, R36, R37, and R38 are each independently hydrogen, halogen, OH, CF3, C1-C4 alkyl, ORa, OC(O)Ra, NRaRb, NRaC(O)Ra, NRaC(O)ORa, C(O)Ra, or C(O)NRaRb;\nR39 is hydrogen or C1-C4 alkyl;\nX9 is CRaRb, O, S, NRa, NC(O)Ra, or NC(O)ORa;\nRa and Rb are each independently hydrogen, C1-C4 alkyl, benzyl, pyridin-3-ylmethyl, —O—C1-C4 alkyl, or —C1-C4 alkyl O—C1-C4 alkyl; and\nn18 and n19 are each independently 0, 1, 2, 3, or 4.",
        "57. The method of claim 56, wherein R35 is H or OMe.",
        "58. The method of claim 56, wherein X9 is O.",
        "59. The method of claim 56, wherein the compound is",
        "60. The method of any one of claims 1, 8, 15, 22, 35, 41, and 56, wherein the disease is selected from the group consisting of Human African Trypanosomiasis, leishmaniasis, and Chagas Disease.",
        "61. The method of claim 60, wherein the Human African Trypanosomiasis is caused by Trypanosoma brucei.",
        "62. The method of claim 60, wherein the leishmaniasis is caused by Leishmania sp.",
        "63. The method of claim 60, wherein leishmaniasis is visceral or cutaneous leishmaniasis.",
        "64. The method of claim 60, wherein the Chagas Disease is caused by Trypanosoma cruzi.",
        "65-66. (canceled)"
    ]
}