{
    "id": "US20090123909",
    "authors": [
        "Nader Pourmand",
        "Lisa Diamond",
        "Jochen Kumm",
        "Ronald W. Davis"
    ],
    "title": "Rapid, Informative Diagnostic Assay For Influenza Viruses Including H5N1",
    "date": "2007-11-27 00:00:00",
    "abstract": "A rapid diagnostic assay for influenza virus, particularly avian influenza and more particularly H5N1, is described. The assay is based on amplification of a significant portion of the hemagglutinin (HA) gene and sequencing of several loci within the HA gene, using techniques which can obtain real time sequence information from multiple sites of a target DNA, in particular pyrosequencing and bioluminescence regenerative cycle. The assay contemplates the use of information-rich subsequences within the HA gene, e.g., (1) a glycosylation sequon; (2) receptor binding site; and (3) HA1/HA2 cleavage site. Other subsequences for sequencing include strain and clade markers, which vary among H5N1 strains.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "1. Field of the Invention",
                        "The present invention relates to the field of nucleic acid diagnostics, and, in particular to devices and methods for identification of viral pathogens such as avian influenza, by nucleic acid sequencing.",
                        "2. Related Art"
                    ],
                    "subsections": [
                        {
                            "title": "INTRODUCTION",
                            "paragraphs": [
                                "The worldwide spread of high pathogenicity H5N1 avian influenza A virus in poultry and wild birds has resulted in many human infections, with high fatality rates. Although sustained transmission human-to-human has not yet occurred, concern about a potential pandemic continues to mount. The avian influenza A subtype H5N1 was first found among domestic poultry populations in 1996 in southern China (Xu et al., 1999). A similar H5N1 influenza virus spread directly from poultry to humans in Hong Kong in 1997, causing the deaths in 6 of 18 persons diagnosed with infection with this virus (Subbarao et al., 1998). While eradicated in Hong Kong through massive culling of poultry, the disease has continued to spread across Asia, causing human deaths in Thailand, Vietnam, Indonesia, China and elsewhere (Subbarao et al., 1998). The rapid spread of H5N1 from Asia into Europe and Africa in recent months has intensified efforts to control the virus and avert a pandemic. To address the recognized need for rapid, low-cost diagnosis, tracking critically important genetic changes in the virus among animal and human host populations, and identifying specific viral clades (WHO 2005), there is described below high-throughput methods for monitoring viral mutations that may control virulence and transmissibility in humans (Shinya et al., 2005). Accurate and rapid detection and tracking of H5N1 will be critical to prevent or control a potential pandemic.",
                                "Diagnosis of influenza type A infections in clinical microbiology laboratories has traditionally been performed using cell culture and/or direct fluorescent antibody assays (Schmidt et al., 1989; Effler et al., 2002; Shinya et al., 2005). These methods are time-consuming and require biosafety level 3 (−) biocontainment facilities and equipment to protect laboratory personnel from exposure to H5N1 cultured in the laboratory. Because these facilities are not widely available, culture-based assays are increasingly being replaced in clinical settings by the various polymerase chain reaction (PCR) methods (Fan et al., 1998; Habib-Bein et al., 2003; Templeton et al., 2004; Whiley and Sloots 2005).",
                                "PCR is more sensitive than traditional tests and detection does not require viable virus or morphologically intact infected cells in the sample. The PCR-based molecular diagnostic test is currently the most widely used to diagnose the presence of H5N1 in clinical specimens ((CDC) 2006). As described below, coupling a PCR assay to a rapid sequencing method would further increase the value of molecular techniques for virus identification, especially if implemented into automated robotic platforms. Nucleic acid sequencing is considered the most reliable and highest-resolution method for virus identification, but is typically considered to be too slow and costly to use as a primary assay. Samples can be prepared sequentially for PCR diagnosis of H5N1 influenza virus, and pyrosequencing, yielding results in approximately 90 minutes, with immediate availability of the viral sequence data. The speed, sensitivity, precision, low cost, and high throughput of this method give it substantial advantages in H5N1 influenza detection.",
                                "Influenza type A viruses have an eight-segment negative-sense RNA genome complexed with nucleoprotein and polymerase surrounded by the matrix protein and a lipid envelope that contains two integral membrane glycoproteins, hemagglutinin (HA) and neuraminidase (NA), protruding from the virion surface. Described below is an assay that focuses on three biologically significant regions of the H5N1 hemagglutinin gene (HA gene), including sites informative of viral ancestry.",
                                "As described further below, these sites are:",
                                "(1) glycosylation sites at amino acid residues 154-156;",
                                "(2) the receptor-binding site at amino acid residues 221-224; and",
                                "(3) the cleavage motif at amino acid residues 325-329.",
                                "Amino acid numbering may be further identified with reference to GenBank locus ABE97594, containing the amino acid sequence of the Influenza A virus A/duck/Vietnam/317/2005(H5N1)). This amino acid sequence is reproduced below, with sites identified as (1) through (3) in the paragraph above underlined for clarity:",
                                "The above sequence varies from the Ha et al., reference in that the reference begins with the * in the sequence given above. The exact amino acid sequence and position of the features discussed here will vary from strain to strain. The features used in the present invention are identified in variant sequences, a glycosylation site, and the receptor specificity site, as described further in Table 2. Detailed sequence information can be obtained from the web site at flu.lanl.gov/, the Los Alamos National Laboratory Influenza Sequence Database (ISD), which contains all published influenza viral sequences, which sequences have been curated by domain experts to ensure high standards of accuracy and completeness. (Macken, C., Lu, H., Goodman, J., & Boykin, L., “The value of a database in surveillance and vaccine selection” in Options for the Control of Influenza IV. A. D. M. E. Osterhaus, N. Cox & A. W. Hampson (Eds.) Amsterdam: Elsevier Science, 2001, 103-106).",
                                "The HA binds to sialic acid-terminated glycan receptors on the host cell surface, triggering virion uptake by endocytosis. Human respiratory tract cells have predominantly alpha 2-6 linked sialic acid receptors, whereas duck intestine has predominantly alpha 2-3 linked sialic acid receptors. Host-adapted human and avian influenza viruses selectively bind to homologous variant sialoside structures (Paulson 1985; Connor et al., 1994; Matrosovich et al., 2000). The HA receptor binding site is located at the convergence of one helix, two loops and three single residues near the top of the molecule; amino acid residues in the 184-186 helix as well as the 130-134 and 217-224 loops make up the rims, whereas residues 91, 149 and 179 form the floor of the cavity (H5 numbering; references: (Ha et al., 2002; Stevens et al., 2006a)). In the H3 subtype of HA, amino acids 222 and 224 are major determinants of human or avian host specificity of the virus (Vines et al., 1998). Similar changes have been documented for the H1 HA that caused the 1918 so-called Spanish influenza pandemic (Reid et al., 1999; Stevens et al., 2006b).",
                                "The HA is also responsible for cell entry by mediating fusion of the endosomal and viral membranes. The HA requires proteolytic cleavage to become functional in membrane fusion. Cleavage, mediated by host proteases, results in two disulfide-linked subunits, HA1 and HA2. The HA1 region of the HA gene encompasses three sites of known biological significance, which are targets for nucleic acid identification in the present methods:\n\n\n- - A glycosylation sequon at amino acids 154-156 (of mature H5 HA1) has\n    been linked to viral adaptation to chickens; the majority of H5N1\n    viruses isolated from humans since 2004 have this motif (Banks and\n    Plowright 2003; WHO 2005).\n  - The receptor-binding site. Changes in the rims or floor of the\n    receptor-binding site thought to favor binding of human forms of\n    cell surface sialosides are considered critical for sustained\n    transmission in the human population.\n  - Finally, the number of basic amino acids (lysine or arginine) in the\n    cleavage site between HA1 and HA2 determines whether the virus is\n    highly pathogenic for birds (Bosch et al., 1981; Ohuchi et al.,\n    1989). All Eurasian H5N1 viruses currently circulating are highly\n    pathogenic and contain either five or six consecutive basic amino\n    acids at this site (WHO 2005).",
                                "Recent phylogenetic analysis of H5N1 evolution indicates that distinct major and minor clades have emerged among HA gene lineages; the two most important ones of these from a public health perspective are termed clades 1 and 2. These two clades are identifiable with two amino acids 124 and 212 (WHO 2005). These clade distinctions may be antigenically significant; therefore clade identification may aid selection of appropriate vaccines, and are also contemplated by the present methods. Rapid H5N1 identification will assist in pinpointing the source of particularly virulent outbreaks, and in targeting limited supplies of vaccines and anti-virals to key regions. Clade determinations of the samples used in the present work are shown in FIG. 1."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate avian influenza A virus",
                                "describe spread of H5N1",
                                "discuss human infections and fatality rates",
                                "introduce need for rapid diagnosis",
                                "describe traditional diagnosis methods",
                                "introduce PCR-based molecular diagnostic test",
                                "describe advantages of PCR-based test",
                                "introduce influenza type A viruses",
                                "describe hemagglutinin gene",
                                "identify biologically significant regions",
                                "describe glycosylation sites",
                                "describe receptor-binding site",
                                "describe cleavage motif",
                                "introduce Los Alamos National Laboratory Influenza Sequence Database",
                                "describe HA receptor binding site",
                                "discuss HA cleavage site"
                            ],
                            "num_characters": 8372,
                            "outline_medium": [
                                "motivate avian influenza diagnosis",
                                "describe traditional diagnosis methods",
                                "introduce PCR-based molecular diagnostic tests",
                                "describe influenza type A viruses",
                                "focus on hemagglutinin gene",
                                "identify biologically significant regions",
                                "describe receptor binding site",
                                "discuss HA cleavage site"
                            ],
                            "outline_short": [
                                "motivate need for rapid diagnosis of H5N1",
                                "describe limitations of traditional diagnosis methods",
                                "introduce PCR-based molecular diagnostic test",
                                "highlight advantages of nucleic acid sequencing"
                            ]
                        },
                        {
                            "title": "BRIEF SUMMARY OF THE INVENTION",
                            "paragraphs": [
                                "The following brief summary is not intended to include all features and aspects of the present invention, nor does it imply that the invention must include all features and aspects discussed in this summary.",
                                "The present invention provides an assay for detecting the presence of H5N1 influenza virus and, furthermore, determining selected subsequences of the H5N1 hemagglutinin (HA) gene that have biological significance. Provided here are probes and primers directed to specific regions of the HA gene, namely (1) a glycosylation sequon; (The H5 and H9 HAs share three asparagine-linked glycosylation sites (at HA1 21 and 289, and HA2 154—Ha et al.) (2) the receptor binding site; and (3) the cleavage site between HA1 and HA2 (HA 1/HA2 cleavage site). By focusing on these regions, small amounts of sequence information (5-30 bases) from a region identified here can yield sufficient data to classify a sample.",
                                "Other specific regions may also be targeted. In the present work, ten specific sequencing primers were used to determine HA clade and strain, receptor binding preference, etc.",
                                "In the present methods, a sample suspected of containing an influenza A virus is concentrated for virus, and any RNA is extracted and amplified by RT-PCR, whereby a DNA sequence complementary to the RNA encoding the HA gene, or a substantial portion of the HA gene is obtained. The primers chosen for this amplification are chosen to amplify any chosen influenza strain, e.g., any influenza A HA gene, or any H5N1 HA gene. For example, the first primer sequence given below for the Vietnam HN 304/08/05 returns approximately 100 hits when queried in NCI BLAST, all of which are H5N1.",
                                "Thus, the amplified sample will contain at least a significant fraction of the HA gene, e.g., about 70-100%. The amplified HA sequence is then contacted with site specific primers, e.g., primers which hybridize to regions flanking a clade marker, a strain marker, a glycosylation sequon, a receptor binding site, a cleavage site, etc. Thus, as shown in FIGS. 3-8 and Table 1 below, various internal primers, forward and reverse, are used to flank regions of interest, and subsequent PCR reactions are carried out.",
                                "Next, the sample amplified from the site specific markers is hybridized to a number of capture probes, which are complementary to a PCR primer region, preferably the 3′ primer region shown, e.g., double underlined at the 3′ most end of FIG. 5. The immobilized sample is then contacted with site specific (internal) primers, such as are shown in blue, which flank regions of interest, and nucleotides are dispensed for sequencing by pyrosequencing, BRC (bioluminescence regenerative cycle, as described in US PGPUB 20030082583), or the like. The primers are chosen to be generic to different strains, so that the specific identity of a given sample will be revealed by the sequence information of the chosen regions. A “consensus pre-programmed sequencing strategy” is used in the order of dispensation of nucleotides in the sequencing reaction. This reduces the need for addition of non-complementary nucleotides.",
                                "Different pyrophosphate based detection systems, in addition to pyrosequencing or BRC, may be used for DNA sequencing (e.g., Nyren and Lundin, Anal. Biochem. 151:504-509, 1985; U.S. Pat. Nos. 4,971,903; 6,210,891; 6,258,568; 6,274,320).",
                                "In one aspect of the invention, the amplified sample is generated with biotinylated primers, yielding biotinylated PCR products, which may then be immobilized by binding the amplified product to streptavidin, e.g., streptavidin-coated beads."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce assay for detecting H5N1",
                                "describe probes and primers for HA gene",
                                "identify targeted regions of HA gene",
                                "describe amplification of RNA by RT-PCR",
                                "introduce site-specific primers",
                                "describe hybridization to capture probes",
                                "introduce pyrosequencing or BRC for sequencing"
                            ],
                            "num_characters": 3586,
                            "outline_medium": [
                                "introduce assay for detecting H5N1 influenza virus",
                                "describe probes and primers for HA gene regions",
                                "outline method for determining HA gene subsequences"
                            ],
                            "outline_short": [
                                "summarize invention for detecting H5N1 influenza virus"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce field of nucleic acid diagnostics"
                    ],
                    "num_characters": 247,
                    "outline_medium": [
                        "introduce avian influenza and need for rapid diagnosis"
                    ],
                    "outline_short": [
                        "introduce avian influenza and need for rapid diagnosis"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENT",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Overview",
                            "paragraphs": [
                                "Described below is a method for identifying strains of an influenza virus, in particular H5N1, which in a preferred embodiment uses pyrosequencing technology to obtain characteristic short sequences of the virus. The method targets the hemagglutinin (HA) gene of H5N1 influenza. The assay uses RT-PCR to amplify a known H5N1-specific region of 768 nucleotides. Subsequent pyrosequencing (Ronaghi et al., 1998) of strains that are H5N1-positive with ten specific sequencing primers is used to determine HA clade and strain, receptor binding preference, low or high pathogenicity cleavage site and glycosylation status. The assay presented here is considerably more informative than traditional techniques, as it not only identifies the H5N1 lineage but also predicts receptor-binding properties that could herald the development of human-human transmissibility. Moreover, this assay is specific, rapid and cost-effective. Because specific regions of biological significance and differentiation are identified, only short sequence lengths are needed.",
                                "Representative strains are presented and the analysis of the HA gene region is described. FIG. 5 shows a multiple sequence alignment of the exemplary strains, with the particular primers and markers used indicated. By presenting these data in a sequence alignment format, it can be seen that the various representative sample sequences are identical for primer regions, yet different for regions of discrimination as found here. Primers, markers and key sites on H5N1 influenza A hemagglutinin gene are thus identified. That is, any HA gene sequence will hybridize to the primer. Strain determination is made by obtaining sequences adjacent the primers. A region of 768 bases of cDNA for hemagglutinin gene of nine strains of H5N1 was assayed to obtain sequence information for three key biologically significant sites (glycosylation, receptor specificity, and HA1/HA2 cleavage. Two clade markers were also used to distinguish clades of H5N1 (FIG. 5, lines 2 and 6 small bold “ag”). Three additional polymorphic sites (line 3 double underline, line 5 double underline, line 10 double underline) provide unambiguous strain identification. The PCR primers used to bracket this entire region are shown at the 5′ and 3′ ends in connection with FIG. 5."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce method for identifying H5N1 influenza virus strains",
                                "describe pyrosequencing technology",
                                "outline assay components",
                                "highlight advantages of the assay"
                            ],
                            "num_characters": 2297,
                            "outline_medium": [
                                "introduce influenza virus identification method",
                                "describe pyrosequencing technology"
                            ],
                            "outline_short": [
                                "describe method for identifying H5N1 influenza virus strains"
                            ]
                        },
                        {
                            "title": "DEFINITIONS",
                            "paragraphs": [
                                "All terms are used herein in their scientifically accepted sense, and are intended to be made more definite by the definitions below.",
                                "The term “glycosylation sequon” means the sequence where an oligosaccharide chain is attached to a protein by oligosaccharyl transferase, namely an asparagine occurring in the tripeptide sequence Asn-X-Ser or Asn-X-Thr, where X could be any amino acid except Pro.",
                                "The term “receptor binding site” means the portion of the HA gene which mediates binding of the influenza virus to host cells. The cellular receptors that HAs recognize are sialic acids linked to cell-surface glycoproteins and glycolipids. All subtypes of HA found in avian species prefer binding to sialic acid in a 2,3-linkage to galactose. In contrast, the HAs of human viruses recognize sialic acid in 2,6-linkage. As a consequence, the cross-species transfer of avian viruses into humans that results in pandemics requires a change in binding specificity. The mechanism that human viruses have used to achieve these changes appears to be different for different subtypes. For the HAs of the H2 and H3 human viruses a minimum of two changes in binding site amino acids, Gln-226->Leu and Gly-228->Ser, are thought to correlate with the shift from binding avian to binding human receptors. In contrast, HAs of human H1 viruses (including the 1918 virus) acquire binding to human receptors while retaining Gln-226 and Gly-228. (See, Science 303, 1838-1842 (2004); www.esrf.fr/UsersAndScience/Publications/ Highlights/2004/SB/SB4/).",
                                "The term “HA1/HA2 cleavage site” means the site where, for full infectivity, the single chain (HA0) is cut into two chains (HA1 and HA2). This site is illustrated at www-ssrl.slac.stanford.edu/research/highlights_archive/1918flu.html. The term is further explained in Zhirnov et al., “Cleavage of Influenza A Virus Hemagglutinin in Human Respiratory Epithelium Is Cell Associated and Sensitive to Exogenous Antiproteases,” J Virol. 2002 September; 76(17): 8682-8689. As explained there, the major characteristic of the HA that determines sensitivity to host proteases is the composition of the proteolytic site in the external loop in the HA0 molecule which links HA1 and HA2. This loop may contain either a single Arg or Lys residue (monobasic cleavage site) or several Lys and/or Arg residues, with an R-X-K/R-R motif, which form a multibasic cleavage site. The multibasic cleavage site of HA exists in influenza A virus subtypes H5 and H7. All other influenza A viruses and influenza B and C viruses contain HAs with a monobasic cleavage site.",
                                "The term “RT-PCR” means the reverse transcription polymerase chain reaction, a technique for amplifying a defined piece of a ribonucleic acid (RNA) molecule. The RNA strand is first reverse transcribed into its DNA complement or complementary DNA, followed by amplification of the resulting cDNA using polymerase chain reaction. Kits for carrying out this process are commercially available, such as the Titan one-tube reverse transcriptase PCR [RT-PCR] kit (Roche). Exemplary protocols may be found, e.g., in U.S. Pat. No. 6,015,664 to Henrickson, et al., issued Jan. 18, 2000, entitled “Multiplex PCR assay using unequal primer concentrations to detect HPIV 1,2,3 and RSV A,B and influenza virus A, B.”",
                                "The term “pyrosequencing” means sequencing in which DNA samples are contacted with primers to determine the starting point of complementary strand synthesis, and further contacted with DNA synthesizing enzymes, an enzyme apyrase to decompose dNTP (deoxynucleotide triphosphates) which has been added as a substrate and remained unreacted; sulfurylase to convert pyrophosphate into ATP; luciferin; and luciferase involved in the reaction of luciferin with ATP. These reagents are placed in a titer plate. At this moment, no complementary strand synthesis occurs because dideoxynucleotides (ddNTPs), a substrate for the reaction, is not present. Four kinds of ddNTPs (i.e., dATP, dCTP, dTTP and dGTP) are added in a designated order by an ink jet system. If dCTP is the designated base to be synthesized, no reaction occurs when dATP, dTTP or dGTP is added. Reaction occurs only when dCTP is added, then the complementary strand is extended by one base length, and pyrophosphate (PPi) is released. This pyrophosphate is converted into ATP by ATP sulfurylase and the ATP reacts with luciferin in the presence of luciferase to emit chemiluminescence. This chemiluminescence is detected using a secondary photon multiplier tube or the like. Remaining dCTP or unreacted dNTP is decomposed by apyrase, which converts it into a form that has no effect on the subsequent repetitive dNTP injection and the reaction that follows. The four kinds of dNTP are added repeatedly in a designated order and the base sequence is determined one by one according to the presence or absence of chemiluminescence emitted each time (see Ronaghi, M. et al., Science 281, 363-365 (1998) and U.S. Pat. No. 6,841,128 to Kambara, et al., issued Jan. 11, 2005, entitled “DNA base sequencing system”).",
                                "The term “bioluminescence regenerative cycle” means a process in which steady state levels of bioluminescence result from processes that produce pyrophosphate. Pyrophosphate reacts with adenosine 5′-phosphosulphate in the presence of ATP sulfurylase to produce ATP. The ATP reacts with luciferin in a luciferase-catalyzed reaction, producing light and regenerating pyrophosphate. The pyrophosphate is recycled to produce ATP and the regenerative cycle continues. This process is described in detail in US 2003/0082583 to Hassibi, et al., published May 1, 2003, entitled “Bioluminescence regenerative cycle (BRC) for nucleic acid quantification.”",
                                "The term “identical” when used in terms of sequence identity means that two polypeptide or nucleic acid sequences are identical (i.e., on a residue-by-residue basis) over the window of comparison. The term “percentage of sequence identity” is calculated by comparing two optimally aligned sequences over the window of comparison, determining the number of positions at which the identical residue occurs in both sequences to yield the number of matched positions, dividing the number of matched positions by the total number of positions in the window of comparison (i.e., the window size), and multiplying the result by 100 to yield the percentage of sequence identity. For sequences less than about 50 residues, the comparison window will be the entire length of the sequence. It is preferred here, that nucleic acid sequences of less than about 50 residues, preferably less than about 30 residues, as exemplified in Table 1, will be considered. For example, in a sequence of 20 residues, 90% identity would mean 18 of 20 residues are identical, with standard (no penalty) gapping allowed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define glycosylation sequon",
                                "define receptor binding site",
                                "define HA1/HA2 cleavage site",
                                "define RT-PCR",
                                "define pyrosequencing",
                                "define bioluminescence regenerative cycle",
                                "define identical in terms of sequence identity",
                                "define percentage of sequence identity",
                                "explain calculation of percentage of sequence identity",
                                "provide example of percentage of sequence identity",
                                "define window of comparison",
                                "explain consideration for sequences less than 50 residues",
                                "provide example of sequence length"
                            ],
                            "num_characters": 6798,
                            "outline_medium": [
                                "define glycosylation sequon",
                                "define receptor binding site",
                                "define HA1/HA2 cleavage site",
                                "define RT-PCR",
                                "define pyrosequencing",
                                "define bioluminescence regenerative cycle"
                            ],
                            "outline_short": [
                                "define glycosylation sequon",
                                "define receptor binding site",
                                "define HA1/HA2 cleavage site"
                            ]
                        },
                        {
                            "title": "Methods and Materials",
                            "paragraphs": [
                                "**Avian Influenza A Subtypes and H5N1-Specific Primer Design**",
                                "Sequences of 362 avian influenza A virus species were acquired from GenBank at the National Center for Biotechnology Information and Influenza Sequence Database at Los Alamos National Laboratory and aligned using Clustal X version 1.83 (Thompson et al., 1997). A specific sequencing primer was designed for H5N1, with no sequence similarity to the other influenza virus HA subtypes based on the database searches and alignments (5′ and 3′ ends in FIG. 5, lines 1 and 13 double underlining).",
                                "**H5N1 Avian Influenza Virus Isolates**",
                                "The viruses that formed the test set for this study were chosen on the basis of their diversity in biologically significant regions of hemagglutinin and/or their ability to cause infection in humans. Virus strain names are shown in FIG. 5 and accession numbers are as follows: A/goose/Guangdong/1/96 (AF144305), A/Hong Kong/156/97 (AF036356), A/Hong Kong/483/97 (AF046097), A/Hong Kong/213/2003 (AY575869), A/chicken/Korea/ES/03 (AY676035), A/Vietnam/1203/2004 (AY651334), A/Vietnam/JP14/2005 (ISDN117778), A/Vietnam/HN30408/2005 (ISDN119678), A/Indonesia/5/05 (ISDN125873).",
                                "**RNA Extraction, RT-PCR and PCR Amplification**",
                                "Viral RNA was extracted using the QIAmp vRNA Kit (Qiagen, Valencia Calif.). Extractions were performed according to manufacturer's instructions. QIAGEN Onestep RT-PCR kit (Qiagen, Valencia Calif.) was used to perform RT-PCR from 3 PI of RNA in a 50 PI reaction volume. The RT-PCR amplification primers, which are biotinylated F-H5N1-1/3 (5′-TCAATGACTATGAAGAATTGAAACA-3′), (SEQ ID NO: 22) and R-H5N1-2/4 (5′-AACCATCTACCATTCCCTGCCATCC-3) (SEQ ID NO: 23) were synthesized by IDT (Coralville, Iowa, USA). RT-PCR was performed with a DNA Engine (PTC-200) Peltier Thermal Cycler (BIO-RAD, Hercules, Calif.) as follows: 50° C. for 10 minutes, 95° C. for 15 minutes, 35 cycles of 95° C., 55° C., and 72° C. for 1 minute each, and finally a 10 minute final extension at 72° C. To confirm proper amplification, PCR products were electrophoresed in a 1% agarose gel and visualized by ethidium bromide staining under UV illumination. (Note: Y=C or T).",
                                "**Sanger Dideoxy DNA Sequencing of PCR Products**",
                                "The amplified DNA from all isolates was cycle sequenced in both directions using the BigDye Terminators Reaction Kit v. 3.1 (Applied Biosystems, Foster City, Calif.) on an ABI automated DNA sequencer (3730 XL DNA Analyzer).",
                                "**Hemagglutinin Sequencing Primers**",
                                "An entropy-based analysis of genetic variation among H5N1 strains (shown by multiple sequence alignment in FIG. 5) was used to design PCR primers (Cover and Thomas 1991). The approach focused on amplicons comprising regions for receptor binding sites, cleavage site and glycosylation sites, along with markers to identify clade and individual strain. Highly conserved sites were selected as internal sequencing primers to sequence each region of interest. The selected region is bracketed by sequences unique to and highly conserved in the H5N1 subtype. Based on sequence alignments of H5N1 and sequencing results (data not shown) from all the isolates, a set of sequencing primers were designed spanning a region of the HA informative with regards to clade, strain, receptor binding motif, cleavability and glycosylation sites and which specifically hybridize to H5N1. Sequences for relevant influenza viruses with known properties and virulence status were compiled for each sample from pyrograms. These sequences were then compared to known H5N1 sequences by alignment and visual inspection. The correct sequence obtained by the present primers was checked by pyrosequencing. FIG. 3 illustrates the pyrosequencing results. The strain marker having double underline in block 3 of FIG. 5 was confirmed, for example, to be SEQ ID NO: 2. SEQ ID NO: 3 was confirmed as corresponding to sequence beginning at line 4, FIG. 5. SEQ ID NO: 4 was confirmed as corresponding to sequence in the region of the double underline strain marker in block 5 of FIG. 5. Other sequences were similarly confirmed.",
                                "**Pyrosequencing**",
                                "Biotinylated PCR product (10 μl) from RT step from viral RNA (strain sequences shown in FIG. 5) was immobilized onto 2.5 μl streptavidin-coated High Performance Sepharose beads (Amersham Biosciences, Piscataway, N.J.) by incubation at room temperature for at least 10 minutes with agitation at 1400 rpm. Single-stranded DNA was obtained by washing the immobilized PCR product with 70% EtOH, denatured with 0.2 M NaOH, and washed with TE-Buffer (0.1 M Tris-Acetate, pH 7.6) using a Vacuum Prep Tool and Vacuum Prep Worktable (Biotage, Uppsala, Sweden). The beads were then suspended in 12 μl annealing buffer (10 mM Tris-acetate pH 7.75, 5 mM Mg-acetate) containing 0.3 pmol sequencing primer. Single-stranded DNA was hybridized to the sequencing primer by incubation at 90° C. for 2 minutes, at 60° C. for 5 minutes and at room temperature for 5 minutes.",
                                "Primed single-stranded PCR products were sequenced using PSQ™ HS96A System (Biotage). Sequencing was performed in a total volume of 12 PI using the PSQ 96 Gold kit (Biotage). Pyrosequencing was performed with consensus pre-programmed dispensation orders which were determined by integrating sequence information for each strain at a given sequencing site (Gharizadeh et al., 2005). Negative-control nucleotide dispensations were also included in these backgrounds to check for insertions and to measure background signals. The identity and number of nucleotide extension events were determined by automated measurement of the amount of light generated after incorporation of each dNTP.",
                                "Raw data were interpreted using software developed specifically for this purpose, “Classifier.” Classification of samples by strain is straightforward using the short sequence segments obtained. That is, the various short sequence segments uniquely identify a specific strain. The longest sequence needed is about 22-30 bases long. The strain markers, glycosylation site and clade markers as identified in connecting with FIG. 5 all provide sequence information which when combined uniquely identify one strain. We used a Support Vector Machine (Cristianini and Shawe-Taylor 2000) approach implemented in the statistical programming language R (R Statistical Package) to classify a given sample with statistical accuracy. This provides an automated sample identification tool, designed for eventual use with large numbers of source sequences (Duda et al., 2001; Meyer 2006). As can be seen from FIG. 5, one may visually inspect the different sequences obtained for the two clade markers, the three strain markers, the glycosylation site, the receptor specificity site, and the cleavage site and identify a particular isolate. Additional isolates may be added to the present data, and sequence searches run using a variety of known algorithms."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "acquire avian influenza A virus sequences",
                                "design H5N1-specific primer",
                                "describe H5N1 avian influenza virus isolates",
                                "extract viral RNA",
                                "perform RT-PCR",
                                "amplify PCR products",
                                "perform Sanger dideoxy DNA sequencing",
                                "design hemagglutinin sequencing primers",
                                "perform pyrosequencing",
                                "immobilize biotinylated PCR product",
                                "obtain single-stranded DNA",
                                "hybridize sequencing primer",
                                "sequence using PSQ HS96A System"
                            ],
                            "num_characters": 6878,
                            "outline_medium": [
                                "design H5N1-specific primer",
                                "extract RNA and perform RT-PCR",
                                "perform Sanger dideoxy DNA sequencing",
                                "design hemagglutinin sequencing primers",
                                "perform pyrosequencing",
                                "analyze pyrosequencing results"
                            ],
                            "outline_short": [
                                "design H5N1-specific primer",
                                "perform RT-PCR and PCR amplification",
                                "perform pyrosequencing"
                            ]
                        },
                        {
                            "title": "Results",
                            "paragraphs": [
                                "**HA Amplification by PCR**",
                                "The first step in the analysis of a clinical specimen or a viral isolate in our assay is the generation of a DNA copy of the viral RNA, which is accomplished by reverse transcription coupled to PCR (RT-PCR). This was accomplished using two different biotinylated combinations of PCR primers specific to the H5N1 regions of interest in order to achieve optimal sequencing flexibility of H5N1 isolates, as listed in FIG. 1. As shown in FIG. 2, either pair of primers provided reliable amplification of H5N1, and neither generated products when used in PCRs with negative controls (total genomic DNA from unrelated human cell lines).",
                                "All of the H5N1 PCR products were sequenced at least twice both by Sanger dideoxy sequencing and pyrosequencing; PCR-positive amplicons generated correct sequence results independent of sequencing method or fragment size. Furthermore, no loops or primer-dimers were observed when primers were pyrosequenced in the absence of template. A representative and typical pyrogram of Sample A8 (A/Vietnam/HN30408/2005) obtained by pyrosequencing is shown in FIG. 4 and FIG. 6; pyrograms for additional samples are in FIGS. 7-8. Supplemental sequence information is in the provisional patent application. The pyrosequencing run covering the required 14 bases took approximately 15 minutes.",
                                "**HA Pyrosequencing**",
                                "The results of our pyrosequencing assay clearly distinguished the nine different strains of H5N1 avian influenza, based on eight sites, as shown in Table 1. Table 1 shows sequences of H5N1 clade markers and active sites, as determined by pyrosequencing. Sample strains are listed in the leftmost column, abbreviated sequencing primer name in the top row. “F” or “R” indicates whether the primer is forward- or reverse-directed. The 5′-3′ sequences presented here were obtained by reading pyrograms (as reverse complements when using a reverse-directed sequencing primer).",
                                "Using Vietnam/120304 as an example, the marker sequences may be correlated to the full sequence given in FIG. 5, first line. “Strain Marker 1” corresponds to double underlining in block 3. “Gycosylation site” begins with the underlined portion in line 4, but extends further. “Strain Marker 2” corresponds to the single underlined part of Block 5. Clade Marker 2(F) is bolded for that sample, for purposes of illustration. The reverse, of course, would be the reverse complement, which may also be used for any of the sequences in question. Strain marker 3” of the Table as listed stops about one base short of the underlined portion at FIG. 5, block 10. The cleavage site of the Table contains an extra two bases beyond those underlined in FIG. 5, block 12. Therefore, it can be seen that there is some flexibility surrounding the exact sequences to be used. Enough sequence information should be included so that the markers used, when complied for a given sample unambiguously identify the sample as to strain, at the least, and may in addition provide additional biological information. Furthermore, this approach provided accurate sequencing of regions of known biological significance. The results of this assay can be seen in Table 2, which shows the amino acid sequences characteristic of each strain tested.",
                                "In order to characterize the strains based on the HA sequence, pyrograms obtained via pyrosequencing were visually inspected to verify the sequences of relevant active sites and the presence of polymorphisms that could serve as lineage markers. These sequences were then compared to known H5N1 sequences for clade and strain identification. Certain positions provided essential information for the identification of signatures important for public health, such as changes in the receptor-binding site, which could signal an increase in the ability of the virus to transmit from human to human. The prototypical receptor-binding site for avian isolates in amino acids 221-224 of the HA1 is GQSG. One human isolate, sample A4 (Hong Kong/213/03) had a mutation at amino acid 223, S>N, which switches the affinity of the hemagglutinin from alpha 2-3 linked sialic acid too the alpha 2-6 linked sialic acid preferred by the human influenza virus. This mutation was detected by a single nucleotide change G>A, in the sequence of the receptor binding active site. Rapid characterization of the receptor binding active site and other active sites of the hemagglutinin is critical in identification of viruses with increased pandemic potential. In addition, one may use the present methods to discern the identity of the strain quite readily.",
                                "Strain markers (three short regions) were selected based on entropy-based analysis of variation across the nine H5N1 strains used for testing (Cover and Thomas 1991).",
                                "The results described here indicate that targeted pyrosequencing approach can clearly distinguish among different strains of H5N1, and can accurately sequence regions of known biological significance. The HA sequence results obtained by pyrosequencing were 100% identical to those obtained by the Sanger method (two replicates were performed in order to obtain the longest possible read-lengths and to cross-verify results). Three pyrosequencing replicates, with nine samples at ten sites, were performed; two with a de novo dispensation and one with a pre-programmed dispensation order. Of the three pyrosequencing replicates performed, all successful runs verified one another. Because Sanger sequencing relies on molecular separation of the polymerase-mediated extension of the primer, the first ˜20-50 bases 3′ of the primer are not discernible In contrast, pyrosequencing provides unambiguous sequence from the first nucleotide 3′ to the primer, increasing the sequence information yield per assay. This feature of pyrosequencing was exploited by designing H5N1-specific primers adjacent to critical polymorphic sites such that the initial base-callings are usually sufficient to determine the lineage of a given HA gene. Given the sequence information presented here, one could design sequencing primers adjacent to any of the markers illustrated.",
                                "While a simpler detection assay that gives a positive or negative identification of H5N1 will be helpful, a more information-rich method, such as the one described here, may provide additional crucial information to guide patient care or public health measures aimed at preventing or controlling a pandemic. As this pathogen becomes more prevalent, it will be impractical to perform full sequencing of all isolates in time for analysis of rapidly changing epidemiological trends. Our assay could be a valuable complement to full sequencing at public health laboratories. Also, as strains emerge which are resistant to anti-virals or escape a vaccine response, it will be necessary to have a rapid strain typing method for use in determining clinical treatment. We have developed a rapid and inexpensive assay based on DNA sequencing, the gold-standard method producing the highest resolution for nucleic acid-based diagnosis, for early detection of virus present in host cells. This assay permits rapid, simplified and highly accurate identification of avian H5N1 influenza A virus, and consists of inexpensive and simple procedures maintaining high sensitivity and specificity. As new sites of functional relevance are identified, new site-specific primers can be added to broaden the utility of the assay. Expanded knowledge of H5N1 sequence and evolution will contribute to more effective diagnostic methods and treatments that require less investment of time and money.",
                                "The above results have validated our approach and selection of specific primers. We have moved toward a further refinement of the assay based on these results. After an initial de novo pyrosequencing run was performed on the H5N1 samples, sequence data for each strain were compiled for each nucleotide site. This information was integrated to produce consensus pre-programmed dispensation orders of nucleotides. This type of pyrosequencing would allow us to obtain sequence results of similarly high quality in 10 to 15 minutes (FIG. 4). With this approach, all known H5N1 subtypes could be positively identified. New variants would not be fully characterized, but would be heralded by truncated sequences.",
                                "In summary, we have developed a reliable, rapid, cost-effective, and information-rich diagnostic assay for H5N1 influenza. This sequence-based method could be extended to include amplicons from other genes of interest; for example, drug targets such as NA and the M2 ion channel (Scheffner 1998; Li et al., 2004), or the postulated virulence motifs on NS1 or PB2 (Hatta et al., 2000; Obenauer et al., 2006). Pyrosequencing is user-friendly, and permits significantly more efficient and rapid genotyping than traditional techniques. This method detects a wide range of influenza A H5N1 subtypes based on sequence information. This assay will allow further development of technology to directly detect H5N1 or specific strains of influenza A in clinical specimens without extensive sample preparation. In addition, BRC may be used for sequencing, without amplification of the viral RNA or resultant cDNA."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce HA amplification by PCR",
                                "describe PCR primer combinations",
                                "show reliable amplification of H5N1",
                                "sequence H5N1 PCR products",
                                "validate sequencing results",
                                "introduce HA pyrosequencing",
                                "distinguish H5N1 strains by pyrosequencing",
                                "show pyrosequencing results in Table 1",
                                "correlate marker sequences to full sequence",
                                "identify strain markers",
                                "characterize strains based on HA sequence",
                                "detect mutations in receptor-binding site",
                                "compare pyrosequencing to Sanger method",
                                "highlight advantages of pyrosequencing",
                                "discuss applications of pyrosequencing",
                                "refine pyrosequencing approach",
                                "integrate sequence data for consensus dispensation orders",
                                "summarize diagnostic assay for H5N1 influenza"
                            ],
                            "num_characters": 9201,
                            "outline_medium": [
                                "introduce HA amplification by PCR",
                                "describe PCR primer design",
                                "summarize PCR results",
                                "introduce HA pyrosequencing",
                                "describe pyrosequencing results",
                                "analyze strain markers and active sites",
                                "discuss receptor-binding site mutations",
                                "summarize advantages of pyrosequencing",
                                "conclude with assay validation and future directions"
                            ],
                            "outline_short": [
                                "amplify H5N1 by PCR",
                                "sequence PCR products by pyrosequencing",
                                "analyze pyrosequencing results for strain identification",
                                "validate pyrosequencing approach for H5N1 diagnosis"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "CONCLUSION",
                    "paragraphs": [
                        "The above specific description is meant to exemplify and illustrate the invention and should not be seen as limiting the scope of the invention, which is defined by the literal and equivalent scope of the appended claims. Any patents or publications mentioned in this specification are indicative of levels of those skilled in the art to which the patent pertains and are intended to convey details of the invention which may not be explicitly set out but which would be understood by workers in the field. Such patents or publications are hereby incorporated by reference to the same extent as if each was specifically and individually incorporated by reference, as needed for the purpose of describing and enabling the method or material referred to."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "clarify scope of invention"
                    ],
                    "num_characters": 752,
                    "outline_medium": [
                        "clarify scope of invention"
                    ],
                    "outline_short": [
                        "clarify scope of invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for detecting the presence of influenza virus and determining selected subsequences of its hemagglutinin (HA) gene, comprising:\n(a) obtaining a sample possibly containing an influenza virus;\n(b) obtaining a DNA corresponding to an HA gene in a virus in the sample;\n(c) obtaining sequence information for at least three portions of the DNA from step (b) corresponding to subsequences of the HA gene comprising (i) a glycosylation sequon; (ii) a receptor-binding site; and (iii) an HA1/HA2 cleavage site.",
        "2. The method of claim 1 wherein said sequence information is obtained by sequencing less than 30 bases for each of (i) (ii) and (iii).",
        "3. The method of claim 2 wherein the sequencing is done using pyrosequencing.",
        "4. The method of claim 1 wherein obtaining sequence information is done by detecting hybridization of sample to a probe which hybridizes to a sequence of (i) (ii) or (iii).",
        "5. The method of claim 1 wherein the DNA of step (b) is immobilized on a surface selected from a bead or a well.",
        "6. The method of claim 1 wherein said DNA is obtained by RT-PCR.",
        "7. The method of claim 6 wherein the RT-PCR is done with primers, which will amplify all of SEQ ID NOs 3 through 21.",
        "8. The method of claim 1 further comprising obtaining sequence information of a strain markers 1, 2 and 3 as set forth in Table 1.",
        "9. The method of claim 8 further comprising sequencing one or more regions of the HA gene indicative of clade, as set forth in Clade Marker 1 and Clade Marker 2 in Table 1.",
        "10. The method of claim 9 further comprising sequencing an HA cleavage site as identified in Table 1, part B.",
        "11. The method of claim 1 wherein the nucleotides A, T, G, and C are added in a predetermined order based on an expected sequence of regions (i) (ii) and (iii).",
        "12. A kit for analyzing influenza virus, comprising:\n(d) PCR primers for amplifying a substantial portion of an HA gene; and\n(e) sequencing primers, binding to different strains of influenza virus, hybridizing adjacent to (1) a glycosylation sequon; (2) a receptor-binding site; and (3) an HA1/HA2 cleavage site.",
        "13. The kit of claim 12 further comprising dNTPs A, T, G, and C.",
        "14. The kit of claim 12 further comprising DNA synthesizing enzymes, an enzyme apyrase to decompose dNTP (deoxynucleotide triphosphates); sulfurylase to convert pyrophosphate into ATP; luciferin; and luciferase for generating light in a sequencing reaction.",
        "15. The kit of claim 12 wherein said sequencing primers are selected to bind at least one of a clade marker 1, strain marker 1, glycosylation sequon, strain marker 2, clade marker 2 (forward), clade marker 2 (reverse), receptor specificity site, strain marker 3, or cleavage site each as identified in Table 1.",
        "16. The kit of claim 12 further comprising at least one sequencing primer having a sequence at least 90% identical to a sequence listed as an internal primer in FIG. 5.",
        "17. A method for analyzing an H5N1 influenza strain comprising the step of obtaining a cDNA sequence according to at least one marker listed in Table 1 and correlating the marker to a corresponding strain as listed in that Table.",
        "18. A method for analyzing an H5N1 influenza strain comprising the step of obtaining an amino acid sequence from the strain and comparing it to at least three of four amino acid sequences for HA clade, glycosylation sequon, receptor binding site and cleavage motif, as set forth in Table 1.",
        "19. PCR primers for amplifying an influenza virus HA gene comprising SEQ ID NO: 22 and SEQ ID NO: 23.",
        "20. The PCR primers of claim 19 further comprising an internal primer to a subsequence found in SEQ ID) NOs: 13, 14 and 15."
    ]
}