{
    "id": "https://semopenalex.org/work/W2606769549",
    "authors": [
        "A. Gover",
        "P. Musumeci",
        "A. Murokh",
        "J. Duris",
        "N. Sudar"
    ],
    "title": "Tapering enhanced stimulated superradiant oscillator",
    "date": "2018-08-30",
    "abstract": "In this paper, we present a new kind of high power and high efficiency free-electron laser oscillator based on the application of the tapering enhanced stimulated superradiant amplification (TESSA) scheme. The main characteristic of the TESSA scheme is a high intensity seed pulse which provides high gradient beam deceleration and efficient energy extraction. In the oscillator configuration, the TESSA undulator is driven by a high repetition rate electron beam and embedded in an optical cavity. A beam-splitter is used for outcoupling a fraction of the amplified power and recirculate the remainder as the intense seed for the next electron beam pulse. The mirrors in the oscillator cavity refocus the seed at the undulator entrance and monochromatize the radiation. We discuss the optimization of the system for a technologically relevant example at $1text{ }text{ }ensuremath{mu}mathrm{m}$ using a 1 MHz repetition rate electron linac starting with an externally injected igniter pulse.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "High wall-plug efficiency generation of intense, coherent, tunable electromagnetic radiation has many applications in all fields of science and technology. Free-electron based sources of radiation have been considered when the electromagnetic peak power is larger than the damage threshold for solid state materials or whenever it would not be possible to find a gain medium with a strong transition at the desired wavelength, as for example at the long (THz) and short (x-rays) wavelength ends of the electromagnetic spectrum.",
                "For infrared, visible and ultraviolet region of the spectrum, laser amplifiers have recently demonstrated average power levels of kW, but with limited peak intensities [1]. Applications of high intensity and average power laser sources range from driving high gradient laser accelerators [2], to inertial fusion or space-related applications [3].",
                "At shorter wavelengths, UV lithography also requires high average power sources to increase the throughput of next generation integrated circuits [4].",
                "Here we discuss a 100 kW-class average power light source which takes advantage of a novel mechanism for extracting energy from a relativistic electron beam, tapering enhanced stimulated superradiant amplification [5]. The energy exchange is mediated by the phase-synchronous ponderomotive potential wave experienced by a tightly bunched relativistic electron beam when propagating in a tapered magnetic undulator in the presence of a transverse electromagnetic wave, such as in a free-electron laser amplifier or inverse-free-electron-laser accelerator [6]. The main advantages of this coupling scheme are the absence of nearby boundary or media (i.e., this is a vacuum plane-wave interaction), so that there are basically no mechanisms for the energy to flow out of the particle-field system. The key ingredients for reaching very high extraction efficiency are a high brightness electron beam, an intense drive laser to extract energy from the particles with high deceleration gradients, and a strongly tapered undulator with a prebunching section to maximize the amount of particles captured and decelerated in the ponderomotive potential trap.",
                "Using an intense seed pulse, it has been recently experimentally demonstrated [7] that decelerating gradients of nearly 100 MV=m could be sustained for extended distances, enabling a large fraction of the energy in a relativistic electron beam to be extracted during passage in a short undulator magnet. The Nocibur experiment at the Accelerator Test Facility in BNL demonstrated over 30% energy conversion efficiency at 10 μm wavelength in a single pass 54 cm long undulator and simulations indicate that comparable efficiency can be obtained at shorter wavelengths.",
                "Taking advantage of superconducting radio frequency techniques, modern electron accelerators can create high quality electron beams at high repetition rates with 100 kW to MW high average powers. Being able to extract a large fraction (up to 50%) of this power and convert it to electromagnetic radiation at any desired wavelength (tunability) has a potentially disrupting impact on many scientific and industrial fields. A fundamental issue to this approach is the availability of intense seed pulses at the desired wavelengths that can be used to extract the energy from the electron beams.",
                "The main idea behind this paper to address this problem is to marry the TESSA high efficiency energy extractor to an optical cavity and a high repetition rate electron beam. The output coupler of the cavity can be used to separate the TESSA output radiation from the electron beamline and redirect a fraction of the amplified power to the entrance of the undulator to serve as the intense seed for the deceleration of the next electron beam pulse and so on. A concept for this TESSA-based oscillator or TESSO is shown in Fig. 1.",
                "We envision two main application areas for TESSO. First, in regions of the electromagnetic spectrum-for example visible and IR-where high peak power lasers are abundant, but lacking in high average power, and the proposed mechanism offers a path toward increasing by orders of magnitude the repetition rate (and the average power) of TW-class short pulse lasers. Second, at shorter wavelengths-for example in the deep and extreme UV-where TESSO might be the only viable solution for a high average power source. Note that in this latter case there will be no options for intense seed lasers, and one will need to develop solutions where the power builds up in the oscillator over several passes starting from a lower power seed.",
                "Free-electron laser (FEL) oscillators operating with tapered undulators have been discussed in the past [8] and recently revisited [9]. In this early works, the surprising benefits of tapering the undulator in reverse (i.e., increasing the resonant energy along the interaction) have been pointed out and the challenges associated with the start-up have been discussed. The novel elements here are the use of high intense seed pulse, strong tapering and prebunched beam distribution.",
                "The concept of a pre-bunched electron beam FEL oscillator, operating on the principle of stimulatedsuperradiance [10], was first proposed in [11,12]. In these papers it was shown that the stable saturation point of a prebunched FEL oscillator provides high radiative energy extraction efficiency and potential high power operation, by taking advantage of most efficient phase-space dynamics of tight electron bunches, performing a synchrotron oscillation process in the ponderomotive potential well. It was recognized there, however, that arriving to this optimal steady state oscillation point, starting from superradiant emission of the bunches or a low power seed radiation, requires a particular strategy of beam energy temporal tapering during an oscillation build-up stage and overcoming a bistable state of the oscillator. Such a process would be harder to implement in the present case of interest of a tapered wiggler, because the small signal gain in the early stage of the oscillation build-up is suppressed.",
                "In this article we avoid the problem of developing a strategy of oscillation build-up from low power, and concentrate on the analysis of a tapering enhanced stimulated superradiant oscillator TESSO in its optimal steadystate operation point, assuming that a single short pulse FIG. 1. Cartoon of the TESSO concept. A ringlike optical cavity is used to recirculate a small fraction of the electromagnetic radiation as a seed for the high efficiency decelerator. The cavity oscillation can be jump-started with an igniter pulse.",
                "high power laser source is available in order to ignite the oscillator (see Fig. 1).",
                "As a practical example we will examine the case of generating 1 μm radiation which is particularly interesting since it falls in a transparency window of the atmosphere. A high average power, micron wavelength light source facilitates interactions such as power beaming to highbandwidth satellites, deorbit burning of space trash, boosting satellites to higher orbits [13][14][15].",
                "The structure of the paper is organized as follows. We will first start from estimate of a single-pass module and cavity efficiency. Scaling laws are given so that the results of the paper can be easily adapted to other electron beam energies/radiation wavelengths. An experimental scenario with a 250 MeV beam will then be discussed in detail. We will then present the design of the optical cavity and perform numerical simulations to analyze the stability of the system to beam fluctuations. A new FEL simulation tool based on the well benchmarked Genesis code has been developed to follow the evolution of the field through multiple rountrips in the oscillator cavity. In the conclusions we outline the next steps towards the demonstration of a very high average power laser based on the TESSO principle."
            ],
            "subsections": [
                {
                    "title": "II. EFFICIENCY ESTIMATE A. Single pass",
                    "paragraphs": [
                        "In order to guide the choices in the TESSO oscillator design, we start by estimating the single pass efficiency of a TESSA amplifier for a helical undulator ignoring transverse effects and initially assuming that the gain in radiation intensity is small. In order to obtain rough analytical expressions for the efficiency, we will consider here the case in which only the magnetic field amplitude is tapered while the period is held constant throughout the interaction. We will also assume that the prebunching section driven by the seed laser beam effectively generates a tightly phased train of microbunches. These can then be injected at the proper phase in the decelerating tapered wiggler and trapped in the ponderomotive potential losing coherently most of their energy and contributing to the radiation gain.",
                        "The FEL equations of motion for a helical undulator are given by [6] ",
                        "where K l for a circularly polarized Gaussian laser is related to the laser power P and the 1=e 2 laser waist w as",
                        "q with Z 0 is the vacuum impedance.",
                        "Strong coupling and resonant interaction is obtained when the relative phase of the electrons in the ponderomotive potential wave ψ is stationary in Eq. ( 2), yielding the condition for the resonant energy",
                        "In order to maintain resonance as the electron beam is decelerated, the undulator parameter must be varied so that the resonant energy changes consistently with the available ponderomotive decelerating gradient. This is achieved by equating Eq. ( 1) with the derivative of Eq. ( 3) to obtain, assuming constant period, an expression for the variation in the undulator strength parameter dK=dz",
                        "Integration of this expression with the assumption that the product K l sin ψ r remains approximately constant along the undulator yields a linear variation of K over the undulator length",
                        "For a fully prebunched electron beam where particles are trapped in the ponderomotive potential to maintain resonant interaction along the entire undulator length, the energy extraction efficiency can then be approximated as",
                        "where γ 0;f are the resonant energies at the entrance and exit of the undulator respectively, K 0 is the initial undulator parameter, and the approximation holds in the limit ΔK ≪ K 0 . The efficiency increases with the number of undulator periods N w up to the maximum limit given by η",
                        "for a large initial undulator parameter (i.e., K 0 ≫ 1). This limit corresponds to a final undulator parameter equal to zero (i.e., ΔK ¼ K 0 ). In practice though, the electrons would dephase towards the end because the trap amplitude is proportional to ffiffiffiffi K p , and therefore Kðz ¼ L w Þ should be at least larger than K 0 =4. A plot of η e and the approximation in Eq. ( 5) is shown in Fig. 2.",
                        "The actual efficiency will depend on how many electrons are captured and decelerated in the ponderomotive potential. A choice of resonant phase near π=2 maximizes the decelerating gradient at the expense of the number of particles captured, whereas a resonant phase near zero optimizes beam capture with little deceleration. A resonant phase near π=4 offers a compromise between accelerator acceptance and decelerating gradient, optimizing the energy extraction.",
                        "Diffraction is responsible for variation of electromagnetic intensity (and therefore K l ) along the undulator. Including a simple model based on an Hermite-Gaussian mode propagating in free space [16], it is possible to calculate that for an undulator length with a linear K taper, the maximum energy change is obtained when the laser is focused to minimum waist position at z w ¼ L w =2 with a Rayleigh range of z r ¼ 3L w =20 [17]. Averaging K l over the length of the undulator yields 3  10 sinh -1 ð 10 3 Þ ¼ 0.576 times the peak value of the laser normalized vector potential K l;peak .",
                        "If the undulator is designed to accommodate an increasing radiation power (high gain TESSA regime), Eq. ( 5) can be considered a lower bound to the single pass extraction efficiency since the additional radiation field may be used to decelerate the beam further and the efficiency can be higher.",
                        "Invoking energy conservation, the radiation power gained at the exit of the TESSA amplifier can then be written as ΔP ¼ η e ðP in ÞP b where P b is the beam power and",
                        "which in engineering units can be simplified to",
                        "A plot of Eq. ( 7) as a function of input power and number of undulator periods for a 250 MeV beam, K 0 ¼ 4 is shown in Fig. 3(a)."
                    ],
                    "subsections": []
                },
                {
                    "title": "B. Oscillator efficiency",
                    "paragraphs": [
                        "In order to obtain an expression for the TESSO cavity efficiency, we need to include the losses on the cavity round trip η l , the output coupler reflectivity η r and consider the slippage effects.",
                        "In the undulator, the radiation slips forward relative to the electron beam by one wavelength per undulator period for a total slipped length of λN w . When the undulator is tapered to take advantage of the increasing radiation power at the head of the electron beam, radiation overlapping the tail of the electron beam may be insufficient to maintain deceleration for electrons there, and as a result, the length of the radiation pulse region with constant power is L b -λN w . This constant power region of the radiation must be stretched during a cavity roundtrip to cover the entire length of the electron bunch on the next pass, reducing the peak power by a fraction η s ¼ 1 -λN w =L b where we neglected the energy contained in the tail of the radiation temporal profile.",
                        "Consequently, the steady state power at the entrance of the undulator available for decelerating the electron beam can be written as FIG. 3. Left: Single pass TESSA power extraction efficiency η e for a 250 MeV beam, K 0 ¼ 4 as a function of input power and number of undulator periods. Right: Oscillator efficiency as a function of number of periods and output coupler reflectivity. 2. Efficiency for TESSA single pass energy extraction from a relativistic electron beam in the limit of low radiation gain for K 0 ¼ 4 (red curve). The approximation in Eq. ( 5) is also shown (blue dashed). The maximum efficiency limit η e;m is indicated by a dotted green line.",
                        "which represents the fundamental power balance equation for the oscillator cavity that allows us to find the steadystate of the system. Since the efficiency η e depends on the input power, in order to find the steady state intracavity recirculating power, we combine Eq. ( 8) with Eq. ( 5) and solve for P in;ss yielding:",
                        "The optimal configuration is found by maximizing the output coupled oscillator power which is given by P osc ¼ P out ð1 -η r Þ as a function of undulator length (N w ) and output coupler reflectivity (η r ). The result of the optimization depends on the cavity losses and is shown in Fig. 2 for η l ¼ 0.8. In this case the optimal values are N w ¼ L b =3λ and η r ¼ 0.66.",
                        "With these choices, the output oscillator pulse peak power to beam power ratio is η power ¼ P osc =P beam ¼ ð1 -η r ÞP out =P beam . The output energy per pass is obtained multiplying the peak power by the length of the radiation pulse (∼η s L b ), obtaining for the energy extraction efficiency",
                        "The outcoupled oscillator energy per pass is",
                        "where U b is the total energy of the electron beam.",
                        "Dividing the output radiation energy by the photon energy hc=λ we obtain a simple expression for the number of photons that can extracted from the oscillator per pass",
                        "where α is the fine structure constant, and N b is the number of electrons in the bunch. The number of photons is independent on the radiation wavelength or the electron energy and just goes as the square of the number of electrons participating to the interaction. This scaling is characteristic of superradiant emission [10] and is a direct consequence of the fact that the TESSO cavity ensures that electrons in one bunch generate the radiation field stimulating the electrons in the subsequent bunch to emit coherently. The average oscillator power is proportional to the electron beam repetition rate. Equation (11) should be considered as a rough estimate as the analysis ignored the possibility of varying the undulator period, which has been found to increase power extraction efficiency as seen in [5] and the additional benefits due to the steeper taper to take advantage of the additional stimulated radiation. At the same time, a rough account of diffraction is included but we ignored many three dimensional effects (beam emittance, transverse radiation mode, etc.) and assumed trapping of a fully bunched electron beam. We will consider all of these effects with the help of self-consistent particle tracking simulations in the next section. Still, these estimates are a reasonable starting point to guide the design of the oscillator.",
                        "Another thing to note about Eq. ( 11) is that the number of photons transmitted is independent of the current, suggesting optimal operation with very long electron bunches (having many particles per bunch). On the other hand, the analysis above shows that an undulator length of L w ¼ λ w N w ¼ λ w L b =3λ maximize performance. For a long electron beam, the undulator might become so long that the seed radiation size w 0 ¼ ffiffiffiffiffiffiffiffiffiffiffi z r λ=π p ¼ ffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi ffi 0.15L w λ=π p will become comparable to the undulator gap. In practice, the constraints imposed by a particular undulator technology choice will limit the optimal length of the electron bunches for this application."
                    ],
                    "subsections": []
                },
                {
                    "title": "III. TESSO OSCILLATOR DESIGN A. TESSO parameters",
                    "paragraphs": [
                        "To illustrate better the formulas derived in the previous session, let us considered a practical example of a 1 μm oscillator based on the TESSO concept. Ideally, the electron beam energy should be made small to reduce linac cost and size, but large enough to achieve large currents without compromising the beam brightness via compression. This is crucial to shorten the undulator length which is directly proportional to L b . We start with a 1 nC, 250 MeV electron beam compressed to a 2 ps duration for a current of 500 A, and peak beam power of 125 GW. The parameters for this example and the simulations of the rest of the paper are shown in Table I.",
                        "For a 2 ps long electron bunch, the undulator length to optimize energy extraction is ∼4 m (i.e., N w ≅ L b =3λ). We can then calculate the seed laser focal parameters to optimize the energy exchange between electron beam and radiation. In the case where the seed dominates the interaction, the laser waist should be placed at the center of the undulator with a Rayleigh range about 15% the length of the undulator. Using a numerical optimization model which takes into account for the growth of the stimulated radiation, it is found that the region of peak intensity shifts downstream of the seed waist. Therefore we choose a waist at z ¼ 1.6 m and Raleigh range of 45 cm to maximize the electromagnetic field intensity along the undulator and optimize the electron beam deceleration.",
                        "The oscillator average power may be increased adjusting the linac repetition rate. In our example we consider 1 MHz which is the repetition rate of superconduncting rf linacs for future light sources [18] which would require a fairly long 300 m cavity. Increasing the linac repetition rate to 5 MHz will shorten the cavity length to 60 m and proportionally increase the output power of the oscillator. Nevertheless, much higher repetition rates may be undesirable as the cavity roundtrip for pulse synchronization becomes too short. As we will see below, a relatively large distance between the undulator and the cavity mirrors is important to take advantage of diffraction to keep the radiation intensity below the damage threshold on the optics."
                    ],
                    "subsections": []
                },
                {
                    "title": "B. Prebunching",
                    "paragraphs": [
                        "A prebunched beam is needed to match the electron beam longitudinal phase space to the acceptance area of the decelerator. Prebunching may be achieved by imparting an energy modulation onto the beam with a short undulator section, and then converting that energy modulation into a density modulation by applying R 56 via a drift or magnetic chicane. A variable strength chicane enables fine adjustment of the phase delay for locking the prebunched beam with the ponderomotive bucket. Prebunching with an energy modulator and chicane enables bunching factors approaching 0.6 and may help entrain ∼60% of the electrons into the ponderomotive wave [19]. Cascading prebunchers has been suggested to increase to >90% the captured fraction by concentrating the phase space further [20].",
                        "In order to maximize the efficiency we adopt the two stage prebuncher for this design study. The phase space evolution is shown in Fig. 4. A single period undulator section (λ w ¼ 55 mm) is designed to impart a 650 keV amplitude sinusoidal energy modulation with the 50 GW seed laser power, and this energy modulation is slightly over compressed with a chicane with R 56 ¼ 143 μm. The bunched beam is then injected into a subsequent 4-period long energy modulator (λ w ¼ 30 mm), imparting a 1.45 MeV amplitude modulation to the bunched beam. A final chicane (R 56 ¼ 40 μm) serves the purpose of compressing the beam to maximize the fraction trapped within the ponderomotive bucket in the subsequent decelerator section.",
                        "It should be noted that the large R 56 required by the bunchers will add an additional delay between the radiation and the electron beam in the cavity. This must be compensated by adding a corresponding optical path length in the radiation path for example using extra cavity mirrors."
                    ],
                    "subsections": []
                },
                {
                    "title": "C. Undulator taper design",
                    "paragraphs": [
                        "We used the Genesis informed tapering scheme (GITS) to calculate the optimal taper of both magnetic field amplitude and undulator period for a range of initial seed laser powers, starting from the parameters in Table I. GITS has been described in detail in [5] and is an optimization algorithm based on the well benchmarked 3D FEL code GENESIS [21] to calculate the optimal variation of the undulator parameters taking into account the growth of the radiation along the undulator. Figure 5 displays the output electron beam resonant energy and laser power for undulators optimally designed for a given input seed laser power.",
                        "For more realistic results, instead of keeping a constant undulator period and varying only the magnetic field amplitude, the Halbach permanent magnet undulator builder equation [22] is used to obtain the magnetic field amplitude for a given undulator period and gap. NdFeB magnets with 1.42 T residual magnetization are used.",
                        "The undulator gap is varied so that > 99.5% of the radiation power clears the magnets, resulting in a minimum gap of 3 mm. The resulting undulator period and magnetic field taper for the reference 50 GW seed power are shown in Fig. 6.",
                        "Figure 7 compares the efficiency estimates of the previous section with the actual efficiency retrieved from the Genesis simulations. Whereas the theoretical estimates assumed no gain in the decelerating field, the significantly improved results from the numerical optimization are easily explained due to the fact that GITS designs the taper taking into account the extra field available from the amplification of the radiation resulting in a higher decelerating gradient.",
                        "An analysis of this simulation case provides a clear example of the effect of the slippage on the oscillator output which is the reason of the difference between peak power and energy transfer efficiency. The electron beam is 600 wavelengths long (flat-top, 2 ps long beam current profile), and the input seed radiation temporal profile is assumed to be initially perfectly synchronized with the e-beam and have exactly the same duration. Due to the FEL resonance condition, the number of radiation wavelengths slipped is equal to the number of undulator periods which in the simulations increases more or less linearly from N w ¼ 160 periods at 10 GW input power to 240 periods at 100 GW seed power for the fixed 4 m undulator length. FIG. 5. Output electron beam energy, output power for undulators optimized for a given input power. FIG. 6. Undulator period (left) and normalized undulator amplitude (right) as a function of undulator length for the reference 50 GW input seed power case.",
                        "The longitudinal phase space at the undulator exit is a low energy beam with a very strong positively chirped tail [shown in Fig. 7(b)]. Since the steady state fraction of laser is shorter than the input electron beam, the recirculated pulse must be stretched to cover the entire electron beam for the next pass. This can be accomplished by spectrally filtering or introducing dispersion on the recirculated radiation. The efficiency reduction associated with this manipulation was described by η s in the previous section. The stretching should also account for expected electron-laser time of arrival jitter in order to ensure reliable operation for hundreds or thousands of passes of the oscillator."
                    ],
                    "subsections": []
                },
                {
                    "title": "D. Cavity design",
                    "paragraphs": [
                        "The optical cavity round-trip length is set by the 1 MHz electron bunch repetition rate to be L cav ¼ 300 m. In principle, it may be possible to make multiple passes through the cavity with the benefit of dividing the resulting cavity length by the number of passes to reduce the overall size of the oscillator. This approach has many disadvantages though including higher optical losses and higher thermal load on the mirrors. On the other hand if low-loss mirrors are available, the cavity can be folded reducing considerably the footprint of the overall system.",
                        "A simple ring cavity design using a stable resonator to provide z r ¼ 45 cm near the center of the 4 m undulator can be designed using the near concentric optical resonator formulas discussed in Siegman [16], assuming no losses and no optical gain from the electron beam with the undulator as a simple drift. The radii of curvature of the mirrors are slightly larger than half length of the cavity, i.e., R ¼ L cav =2 þ ΔL so that the spot size at the waist and at the mirrors can be written",
                        "In order to achieve z r ¼ 45 cm, we have ΔL ¼ 2.7 mm and a waist size at the mirrors of 25 cm. This large spot size helps in terms of controlling the power load on the mirrors. With 100 kW recirculating power in the cavity, the incident power on the mirrors is < 1 kW=cm 2 so that it should be possible to water cool the substrate to dissipate the excess heat.",
                        "In order to maintain a few percent level, energy gradient stability with this design assuming mirrors with linear coefficient of thermal expansion of up to 10 -5 per degree typical of glass or metal mirrors, temperature stability of a few tenths of a degree Celsius is required. A shorter cavity length relaxes this requirement but increases the intensity on the mirrors, necessitating more cooling.",
                        "There are a variety of options for the ring cavity, including a three mirror design at the expenses of flexibility. In Fig. 8 we show some of the cavity options and initial dimensions. While a full optical engineering design is not the scope of this paper, we only note here that cavities with such large optical powers have been in operation [23].",
                        "This simple design just provides a first order solution which is then refined using numerical methods. In practice, Genesis calculates the transverse radiation field profile evolution on a two-dimensional grid throughout the interaction within the undulator, and writes the output radiation field to disk. The radiation evolution along the recirculation cavity is modeled using the method of Huygens-Fresnel propagation on the output Genesis radiation profile (see Appendix for details)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "IV. OSCILLATOR PERFORMANCE",
            "paragraphs": [
                "An oscillator simulation is performed by using the output of a single amplification stage as input for the next stage. For a first pass at assessing the stability of the oscillator, we initially assume that the stimulated power simply adds to the seed laser mode. We can then use a given undulator taper to generate a map between input and output powers which can be used to study the dependence of the oscillator performance on the fraction of recirculated power. Figure 9 shows the power map and power evolutions given a 50 GW startup seed power for various recirculation fractions. We find that at least 30% of the produced power must be fed into the undulator for the next pass to achieve stable operation.",
                "As expected from Fig. 9, the stable solutions with different output couplers produce the similar power gain (about 75 GW) so that the additional power recirculated simply adds to the cavity power. Higher cavity powers may be detrimental as they increase the thermal loads on the cavity mirrors. On the other hand, higher cavity powers may make up for random perturbations in the e-beam parameters which pose a challenge in a real system.",
                "Taking into account the 66% output coupler reflectivity, diffraction and mirror losses of 20%, and the slippageinduced losses of 33%, the net fraction of power returned to the undulator is η s η r η l of the output power or 35% in our example. The power converted from the beam energy per pass within the oscillator is 73 GW-nearly 150 mJ per FIG. 9. Input-output power map (top left) is used to estimate oscillator performance for 50 GW startup power various power recirculation fractions. pulse for the 2 ps long beam. Combined with the input power, the total power at the undulator's exit is 114 GW. The fraction of this power extracted from the cavity is 1 -η r ¼ 0.34 so the net output power is 39 GW or 31% of the beam power. Considering a 1 MHz electron beam repetition rate (250 kW average beam power), TESSO generates 78 kW of average output power with ∼31% efficiency.",
                "When using the full three dimensional field to seed subsequent oscillator passes, we see (Fig. 10) that the oscillator is stable for power recirculation fractions η r above 40%, in agreement with our 1D estimate. Initially during the first few passes, transient fluctuations in the radiation size due to the competition between input and output radiation modes force the on-axis intensity to fluctuate before converging on a steady value. For lower power return fractions of 35%, the power is so low that downward intensity fluctuations in the beam have a high probability of killing the oscillation. This fluctuation could be reduced by transversely shaping the input mode, improving stability for lower power return fractions and recovering the previous result.",
                "A more careful analysis is needed to understand the spectral and temporal evolution of the pulse in the oscillator. A number of authors have examined in the past the problem of the longitudinal stability of the FEL oscillator taking into account pulse evolution effects [24,25] and highlighted an important aspect of dynamics, related to the evolution of longitudinal eigenmodes with mode-specific growth rates. In particular, in these early studies it was found how the FEL oscillator would only work at operating parameters which give positive net gain for one or more eigenmodes and that when multiple modes had positive net gain, mode competition and chaotic lasing would result. While this analysis also helps us in understanding qualitatively our system, it is important to highlight here two significative differences with these early studies. First, (i) the undulator tapering gradient that we use for TESSO is more than one order of magnitude larger than what previously considered. This is possible because (ii) our system is not starting from noise, but from the strong input signal of the igniter pulse, which allows significant energy extraction at a predetermined frequency already from the first pass.",
                "Nevertheless we qualitatively retrieve a similar behavior and uncover the existence of eigenmodes, or stable longitudinal temporal profiles repeating themselves pass after pass which the solution quickly converges to. For a numerical study of the system, we used a newly developed fast 1D FEL numerical model which we recently developed in the frame of x-ray high efficiency simulations [26]. The longitudinal profile of the radiation is followed through the undulator and then pass after pass including the finite losses on the cavity optics and the effect of the cavity length, which must be slightly detuned from the vacuum synchronism condition in order to compensate for the slippage of the radiation over the electron beam in the undulator (i.e., so that the radiation pulse can interact with the full electron bunch at the beginning of the next undulator).",
                "Another important opportunity offered by our simulation model is to better understand the effect of a bandpass filter in the dynamics [27]. This is particularly important as in the previous sections of the paper, the slippage effects have been taken into account in a crude way simply adding a reduction in peak power associated with the stretching of the pulse. In practice, the proposed solution is to add a pass-band filter into the cavity to reduce the bandwidth and obtain a stretched pulse. A concern arising from the multifrequency time-dependent model of the interaction is associated with the growth of the sideband instability, basically the interaction between the synchrotron oscillations of the particles in the ponderomotive bucket and the resonant radiation mode can result in the generation of power at sideband frequencies which ultimately grow, and lead to detrapping and loss of efficiency. The other critical function of the passband filter would be to limit the growth of the sideband instability.",
                "We include the effect of the filter in the simulation by multiplying the Fourier transform of the complex radiation envelope by the filter transfer function (shown in Fig. 11 at each undulator exit. The filter is shown to introduce additional losses and in general decreases the efficiency of the system as expected. Further it adds a significant delay on the pulse (due to its complex phase) which must be compensated for by adjusting the cavity detuning.",
                "The results of the time-dependent oscillator simulations are shown in Fig. 12(a). In relatively few passes (depending on the fraction of recirculated power) a stable eigenmode for the system develops. In Fig. 12(b) we show the evolution of the pulse profile vs. the number of passes and in Fig. 12(c) the efficiency of the system which quickly converges to nearly 30% after <20 passes. Depending on the system parameters, in particular the cavity detuning and the overall losses we have also verified the existence of a region of parameters where competition between the different longitudinal modes occur leading to large variations in the output power and ultimately to chaotic lasing. We reserve for a future paper the analysis of this interesting physical system, where we will also look at the interplay between transverse and longitudinal modes which requires the development of computationally intensive time-dependent 3D simulations."
            ],
            "subsections": []
        },
        {
            "title": "V. STABILITY ANALYSIS",
            "paragraphs": [
                "We next consider the effects of random perturbations of the electron beam current on the oscillator stability. If the linac repetition rate is 3 orders of magnitude larger than that of the igniting laser, we should require stable operation for at least 1000 iterations on average.",
                "The ponderomotive energy bandwidth is on the order of 0.5 MeV so shot-to-shot variations in the electron beam energy should be below 0.25% which is well within the stateof-the-art especially for superconducting linac technology. On the other hand, shot-to-shot current variations may affect significantly the radiated power per pass which can reduce the recirculated power and stop the cavity lasing.",
                "In order to study the effect of these current fluctuations on the oscillator performance, we perform a Monte Carlo simulation using a power map accounting for various input currents in addition to input powers (shown in Fig. 13).",
                "Starting with an initial 50 GW startup seed power and a beam current randomly chosen from a normal distribution, we use the map to look up the output power and use a fixed fraction of that power and another randomly chosen current for the next iteration.",
                "The result is a series of powers for each iteration which jitter about a mean value, and a few example results are shown in Figure 14 for a constant initial power of 50 GW, 500 A average beam current with a 5% rms variation, and recirculated power fractions of 35% and 30%. For 35% returned power, the oscillator typically produces power stably for 1000 iterations and a representative shot is shown in the figure . As the fraction recirculated is decreased to 30%, the produced power begins to fluctuate, decreasing the mean power relative to the median and increasing the variance. Occasionally, the power output fluctuates low enough for the 30% recirculation case to stop power production until the next ignition pulse whereas this does not occur with 35% recirculation which should then be considered when selecting an acceptable output coupler reflectivity.",
                "To quantitatively determine the maximum rms current fluctuations the oscillator can tolerate, we take the 35% power return example and increase the relative rms current fluctuations until it degrades the oscillator performance. Figure 15 shows that the oscillator can survive up to 6% rms relative current fluctuations. As current fluctuations are increased to 6%, the rms relative power fluctuations increase proportionally; however, for current fluctuations greater than 6%, a fraction of the oscillators stop lasing before the 1000th pass, degrading the average oscillator power. Nevertheless, better than 6% current stability may be reliably achieved with linacs so this should not be a problem.",
                "Summarizing these stability requirements for a 500 A, 250 MeV electron beam, 4 m long undulator, and 50 GW seed, stable oscillator operation requires that we recirculate greater than 35% of the output power (assuming perfect TEM 00 input-output mode coupling), and keep the electron beam current fluctuations less than 6% rms."
            ],
            "subsections": []
        },
        {
            "title": "VI. CONCLUSIONS",
            "paragraphs": [
                "In conclusion, we have studied the possibility of embedding a TESSA amplifier in an optical cavity in order to reutilize a fraction of the output power as a seed for the high efficiency energy extraction. Fully self-consistent particle and field simulations show that 31% power extraction efficiency is possible with this system. In an example at 1 μm radiation wavelength, an average output power of ∼78 kW is obtained starting from an average beam power of 250 kW.",
                "To simplify the discussion we have considered here the use of an igniter pulse. This is commercially available at 1 μm wavelength. When scaling at shorter wavelengths where a low repetition rate high power seed is not available, the oscillator start-up dynamics must be studied. In principle, using a dynamically controllable taper it will be possible to increase the energy extraction efficiency as the power builds up in the cavity until reaching the steady state, which would have the same characteristics as discussed here.",
                "The results of this paper can be used as the basis of the design of a very high average power source which would enable many novel scientific and industrial applications. "
            ],
            "subsections": []
        },
        {
            "title": "APPENDIX: HUYGENS-FRESNEL PROPAGATION",
            "paragraphs": [
                "The Huygens-Fresnel propagation method treats each point of radiation as a spherical wave which acquires a phase as it diffracts outward. For one transverse dimension, the spherical wave front, diffracting from a point over a distance z 2z 1 ¼ B through an optical element represented by an ABCD linear transport matrix, acquires a phase",
                "Þ relative to an on-axis ray while the amplitude decreases to conserve power. Thus, the point spread function for one transverse dimension is given by",
                "Convolution of this point spread function with the initial radiation profile over the transverse grid containing the radiation yields the Huygens integral for one dimension",
                "One limitation of this approach is that the calculated radiation must fit on the grid. While the radiation size at the entrance and exit of the undulator may be able to fit on the same size grid, at positions along the transport line such as at lenses where fluence considerations are important to study, the transverse beam size may be significantly larger. To overcome this limitation, we may scale the transverse coordinates at each position by different grid sizes by defining ξ 1 ≡ x 1 =a 1 and ξ 2 ≡ x 2 =a 2 ¼ x 2 =Ma 1 where M ≡ a 2 =a 1 and then transform the input and output wave functions by [16] ",
                "With these scalings, the Huygens integral becomes",
                "where N c ≡ a 1 a 2 =Bλ ¼ Ma 2 1 =Bλ is the collimated Fresnel number. For a large number of grid points in two dimensions, numerical evaluation of this integral is computationally costly. In this case, numerical evaluation of the integral may be sped up significantly by using the convolution theorem to express the integral as the inverse Fourier transform of the product of the Fourier transforms of the input radiation profile and point spread function and employing a fast Fourier transform algorithm to evaluate the transforms. For this purpose, the spatial frequency projection of the point spread function is used to calculate the propagator",
                "where κ x is the spatial frequency conjugate to Δξ x . Since the largest value that Δξ x takes is 1, we have κ x ¼ 2πi, where i is an integer. Switching to 2D requires squaring the prefactors. Additionally, propagations may be chained with transverse amplitude or phase masks to simulate apertures and various focusing elements. Iteration of propagations and field dependent phase masks for small enough step sizes may even be used to model nonlinear effects in media (for example self-focusing of intense lasers in air)."
            ],
            "subsections": []
        }
    ]
}