{
    "id": "US20190203231",
    "authors": [
        "Jianhua Luo",
        "Yanping Yu",
        "Zhanghui Chen",
        "George Konstantine Michalopoulos",
        "Joel Nelson"
    ],
    "title": "METHODS FOR TREATING CELLS CONTAINING FUSION GENES",
    "date": "2019-03-18 00:00:00",
    "abstract": "The present invention relates to methods for treating prostate cancer patients. It is based, at least in part, on the discovery that approximately 90% of men carrying at least one of the following fusion genes: TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67 and CCNH-C5orf30 experienced prostate cancer recurrence, metastases and/or prostate cancer-specific death after radical prostatectomy (each examples of “progressive prostate cancer”), while these outcomes occurred in only 36% of men not carrying any of these fusion genes. It is also based, at least in part, on the discovery that a genome editing technique that specifically targets a fusion gene can induce cell death in a cancer cell that carries the fusion gene.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "1. INTRODUCTION",
                    "paragraphs": [
                        "The present invention relates to methods of treating prostate cancer patients carrying one or more specific fusion genes by performing genome targeting."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce genome targeting"
                    ],
                    "num_characters": 152,
                    "outline_medium": [
                        "introduce genome targeting"
                    ],
                    "outline_short": [
                        "introduce genome targeting"
                    ]
                },
                {
                    "title": "2. BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Clustered regularly interspaced short palindromic repeats (CRISPR)/CRISPR-associated (Cas) were originally discovered to act as immunity defense mechanisms against foreign pathogens in prokaryotic cells (Mojica et al. (2005) J. of Molecular Evolution 60:174-182). Cas9, a protein for the type II CRISPR/Cas system, was found to exhibit DNA cleavage activity. The nuclease activity of Cas9 can be guided by a CRISPR RNA and a trans-activating CRISPR RNA complementary to a targeted sequence of DNA in the genome (Jinek et al. (2012) Science 337:816-821). Since trans-activating CRISPR RNA and CRISPR RNA can be made into a chimeric RNA containing the full function of both RNA species, artificial fusion RNA sequences, also called guide RNAs (gRNAs), were generated to target the activity of Cas9 to a target DNA sequence (Esvelt et al. (2014) eLife:e03401). A D10A mutation present in the catalytic domain of Cas9 converts it to a nickase that produces single nucleotide breaks at the target DNA (Jinek et al. (2012) Science 337:816-821). Double nicking of target DNA can increase genome editing specificity by 50-1500 fold (Ranet al. (2013) Cell 154:1380-1389), with the off-target rate as low as 1/10,000. Such specificity can make somatic genomic targeting a viable approach in treating human diseases.",
                        "Despite a high incidence, only a fraction of men diagnosed with prostate cancer develop metastases and even fewer die from the disease. The majority of prostate cancers remain asymptomatic and clinically indolent. The precise mechanisms for the development of progressive, clinically concerning prostate cancer remain elusive. Furthermore, the inability to predict prostate cancer's potential aggressiveness has resulted in significant overtreatment of the disease. The dichotomous nature of prostate cancer—a subset of life-threatening malignancies in the larger background of histological alterations lacking the clinical features implicit with that label—is a fundamental challenge in disease management. Treatment of prostate cancer, particularly of those metastatic prostate cancers remains problematic. Therefore, there is a need in the art for methods of treating a subject that may develop progressive prostate cancer."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe CRISPR/Cas system",
                        "explain Cas9 nuclease activity",
                        "discuss guide RNA",
                        "motivate genome editing"
                    ],
                    "num_characters": 2233,
                    "outline_medium": [
                        "describe CRISPR/Cas system",
                        "discuss genome editing specificity"
                    ],
                    "outline_short": [
                        "discuss CRISPR/Cas system"
                    ]
                },
                {
                    "title": "3. SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to methods for treating prostate cancer patients. It is based, at least in part, on the discovery that approximately 90% of men carrying at least one of the following fusion genes: TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67 and CCNH-C5orf30 experienced prostate cancer recurrence, metastases and/or prostate cancer-specific death after radical prostatectomy (each examples of “progressive prostate cancer”), while these outcomes occurred in only 36% of men not carrying any of these fusion genes. It is also based, at least in part, on the discovery that a genome editing technique that specifically targets a fusion gene can induce cell death in a cancer cell having the fusion gene.",
                        "In various non-limiting embodiments, the present invention provides for methods of treating a subject that carries a fusion gene. In certain embodiments, a method of the present invention comprises performing a genome editing technique on one or more cancer cells, e.g., prostate cancer cells, of the subject. Non-limiting examples of such fusion genes include TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 and PCMTD1-SNTG1.",
                        "In certain non-limiting embodiments, the present invention further provides kits for performing methods of treating a subject that carries a fusion gene. In certain embodiments, a kit of the present invention can comprise one or more vectors or plasmids comprising a nucleic acid encoding a Cas protein, e.g., Cas9D10A. In certain embodiments, the one or more vectors can further comprise one or more gRNAs specific to a fusion gene, e.g., specific to a breakpoint of a fusion gene and/or sequences flanking the breakpoint of a fusion gene.",
                        "In certain embodiments, a kit of the present invention can further include one or more vectors or plasmids comprising a nucleic acid, that when expressed results in cell death. In certain embodiments, the nucleic acid encodes HSV-1 thymidine kinase. In certain embodiments, this vector can further comprise one or more targeting sequences that are complementary to sequences within the fusion gene to promote homologous recombination and insertion of the nucleic acid. In certain embodiments, where the nucleic acid encodes HSV-1 thymidine kinase, the kit can further comprise ganciclovir and/or valganciclovir."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize treating prostate cancer",
                        "motivate fusion gene targeting",
                        "describe genome editing method",
                        "outline kit components"
                    ],
                    "num_characters": 2463,
                    "outline_medium": [
                        "motivate treating prostate cancer",
                        "outline genome editing method"
                    ],
                    "outline_short": [
                        "summarize genome editing method"
                    ]
                },
                {
                    "title": "5. DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "For clarity, and not by way of limitation, the detailed description of the invention is divided into the following subsections:",
                        "(i) fusion genes;",
                        "(ii) fusion gene detection;",
                        "(iii) methods of treatment;",
                        "(iv) genome editing techniques; and",
                        "(v) kits."
                    ],
                    "subsections": [
                        {
                            "title": "5.1 Fusion Genes",
                            "paragraphs": [
                                "The term “fusion gene,” as used herein, refers to a nucleic acid or protein sequence which combines elements of the recited genes or their RNA transcripts in a manner not found in the wild type/normal nucleic acid or protein sequences. For example, but not by way of limitation, in a fusion gene in the form of genomic DNA, the relative positions of portions of the genomic sequences of the recited genes is altered relative to the wild type/normal sequence (for example, as reflected in the NCBI chromosomal positions or sequences set forth herein). In a fusion gene in the form of mRNA, portions of RNA transcripts arising from both component genes are present (not necessarily in the same register as the wild-type transcript and possibly including portions normally not present in the normal mature transcript). In non-limiting embodiments, such a portion of genomic DNA or mRNA may comprise at least about 10 consecutive nucleotides, or at least about 20 consecutive nucleotides, or at least about 30 consecutive nucleotides, or at least 40 consecutive nucleotides. In a fusion gene in the form of a protein, portions of amino acid sequences arising from both component genes are present (not by way of limitation, at least about 5 consecutive amino acids or at least about 10 amino acids or at least about 20 amino acids or at least about 30 amino acids). In this paragraph, portions arising from both genes, transcripts or proteins do not refer to sequences which may happen to be identical in the wild type forms of both genes (that is to say, the portions are “unshared”). As such, a fusion gene represents, generally speaking, the splicing together or fusion of genomic elements not normally joined together.",
                                "The fusion gene TRMT11-GRIK2 is a fusion between the tRNA methyltransferase 11 homolog (“TRMT11”) and glutamate receptor, ionotropic, kainate 2 (“GRIK2”) genes. The human TRMT11 gene is typically located on chromosome 6q11.1 and the human GRIK2 gene is typically located on chromosome 6q16.3. In certain embodiments, the TRMT11 gene is the human gene having NCBI Gene ID No: 60487, sequence chromosome 6; NC_000006.11 (126307576 . . . 126360422) and/or the GRIK2 gene is the human gene having NCBI Gene ID No:2898, sequence chromosome 6; NC_000006.11 (101841584 . . . 102517958). In certain embodiments, the junction (also referred to herein as chromosomal breakpoint and/or junction fragment) of a TRMT11-GRIK2 fusion gene comprises a sequence as shown in FIG. 1 and/or Table 1.",
                                "The fusion gene SLC45A2-AMACR is a fusion between the solute carrier family 45, member 2 (“SLC45A2”) and alpha-methylacyl-CoA racemase (“AMACR”) genes. The human SLC45A2 gene is typically located on human chromosome 5p13.2 and the human AMACR gene is typically located on chromosome 5p13. In certain embodiments the SLC45A2 gene is the human gene having NCBI Gene ID No: 51151, sequence chromosome 5; NC_000005.9 (33944721 . . . 33984780, complement) and/or the AMACR gene is the human gene having NCBI Gene ID No:23600, sequence chromosome 5; NC_000005.9 (33987091 . . . 34008220, complement). In certain embodiments, the junction and/or junction fragment of a SLC45A2-AMACR fusion gene comprises a sequence as shown in FIG. 1 and/or Table 1.",
                                "The fusion gene MTOR-TP53BP1 is a fusion between the mechanistic target of rapamycin (“MTOR”) and tumor protein p53 binding protein 1 (“TP53BP1”) genes. The human MTOR gene is typically located on chromosome 1p36.2 and the human TP53BP1 gene is typically located on chromosome 15q15-q21. In certain embodiments, the MTOR gene is the human gene having NCBI Gene ID No:2475, sequence chromosome 1 NC_000001.10 (11166588 . . . 11322614, complement) and/or the TP53BP1gene is the human gene having NCBI Gene ID No: 7158, sequence chromosome 15; NC_000015.9 (43695262 . . . 43802707, complement). In certain embodiments, the junction and/or junction fragment of a MTOR-TP53BP1 fusion gene comprises a sequence as shown in FIG. 1 and/or Table 1.",
                                "The fusion gene LRRC59-FLJ60017 is a fusion between the leucine rich repeat containing 59 (“LRRC59”) gene and the “FLJ60017” nucleic acid. The human LRRC59 gene is typically located on chromosome 17q21.33 and nucleic acid encoding human FLJ60017 is typically located on chromosome 11q12.3. In certain embodiments, the LRRC59 gene is the human gene having NCBI Gene ID No:55379, sequence chromosome 17; NC_000017.10 (48458594 . . . 48474914, complement) and/or FLJ60017 has a nucleic acid sequence as set forth in GeneBank AK_296299. In certain embodiments, the junction and/or junction fragment of a LRRC59-FLJ60017 fusion gene comprises a sequence as shown in FIG. 1, FIG. 11 and/or Table 1.",
                                "The fusion gene TMEM135-CCDC67 is a fusion between the transmembrane protein 135 (“TMEM135”) and coiled-coil domain containing 67 (“CCDC67”) genes. The human TMEM135 gene is typically located on chromosome 11q14.2 and the human CCDC67 gene is typically located on chromosome 11q21. In certain embodiments the TMEM135 gene is the human gene having NCBI Gene ID No: 65084, sequence chromosome 11; NC-000011.9 (86748886 . . . 87039876) and/or the CCDC67 gene is the human gene having NCBI Gene ID No: 159989, sequence chromosome 11; NC-000011.9 (93063156 . . . 93171636). In certain embodiments, the junction and/or junction fragment of a TMEM135-CCDC67 fusion gene comprises a sequence as shown in FIG. 1, FIG. 11, FIG. 29 and/or Table 1.",
                                "The fusion gene CCNH-C5orf30 is a fusion between the cyclin H (“CCNH”) and chromosome 5 open reading frame 30 (“C5orf30”) genes. The human CCNH gene is typically located on chromosome 5q13.3-q14 and the human C5orf30gene is typically located on chromosome 5q21.1. In certain embodiments, the CCNH gene is the human gene having NCBI Gene ID No: 902, sequence chromosome 5; NC_000005.9 (86687310 . . . 86708850, complement) and/or the C5orf30gene is the human gene having NCBI Gene ID No: 90355, sequence chromosome 5; NC_000005.9 (102594442 . . . 102614361). In certain embodiments, the junction and/or junction fragment of a CCNH-C5orf30 fusion gene comprises a sequence as shown in FIG. 1, FIG. 11 and/or Table 1.",
                                "The fusion gene KDM4B-AC011523.2 is a fusion between lysine (K)-specific demethylase 4B (“KDM4B”) and chromosomal region “AC011523.2.” The human KDM4B gene is typically located on chromosome 19p13.3 and the human AC011523.2 region is typically located on chromosome 19q13.4. In certain embodiments the KDM4B gene is the human gene having NCBI Gene ID NO: 23030, sequence chromosome 19; NC_000019.9 (4969123 . . . 5153609); and/or the AC011523.2 region comprises a sequence as shown in FIG. 1. In certain embodiments, the junction and/or junction fragment of a KDM4B-AC011523.2 fusion gene comprises a sequence as shown in FIG. 1 and/or Table 1.",
                                "The fusion gene MAN2A1-FER is a fusion between mannosidase, alpha, class 2A, member 1 (“MAN2A1”) and (fps/fes related) tyrosine kinase (“FER”). The human MAN2A1 gene is typically located on chromosome 5q21.3 and the human FER gene is typically located on chromosome 5q21. In certain embodiments, the MAN2A1gene is the human gene having NCBI Gene ID NO: 4124, sequence chromosome 5; NC_000005.9 (109025156 . . . 109203429) or NC_000005.9 (109034137 . . . 109035578); and/or the FER gene is the human gene having NCBI Gene ID NO: 2241, sequence chromosome 5: NC_000005.9 (108083523 . . . 108523373). In certain embodiments, the junction and/or junction fragment of a MAN2A1-FER fusion gene comprises a sequence as shown in FIG. 1 and/or Table 1.",
                                "The fusion gene PTEN-NOLC1 is a fusion between the phosphatase and tensin homolog (“PTEN”) and nucleolar and coiled-body phosphoprotein 1 (“NOLC1”). The human PTEN gene is typically located on chromosome 10q23.3 and the human NOLC1 gene is typically located on chromosome 10q24.32. In certain embodiments, the PTEN gene is the human gene having NCBI Gene ID NO: 5728, sequence chromosome 10; NC_000010.11 (87863438 . . . 87970345) and/or the NOLC1 gene is the human gene having NCBI Gene ID NO: 9221, sequence chromosome 10; NC_000010.11 (102152176 . . . 102163871). In certain embodiments, the junction and/or junction fragment of a PTEN-NOLC1 fusion gene comprises a sequence as shown in FIG. 13 and/or Table 1.",
                                "The fusion gene ZMPSTE24-ZMYM4 is a fusion between zinc metallopeptidase STE24 (“ZMPSTE24”) and zinc finger, MYM-type 4 (“ZMYM4”). The human ZMPSTE24 is typically located on chromosome 1p34 and the human ZMYM4 gene is typically located on chromosome 1p32-p34. In certain embodiments, the ZMPSTE24 gene is the human gene having NCBI Gene ID NO: 10269, sequence chromosome 1; NC_000001.11 (40258050 . . . 40294184) and/or the ZMYM4 gene is the human gene having NCBI Gene ID NO: 9202, sequence chromosome 1; NC_000001.11 (35268850 . . . 35421944). In certain embodiments, the junction and/or junction fragment of a ZMPSTE24-ZMYM4 fusion gene comprises a sequence as shown in FIG. 16.",
                                "The fusion gene CLTC-ETV1 is a fusion between clathrin, heavy chain (Hc) (“CLTC”) and ets variant 1 (“ETV1”). The human CLTC is typically located on chromosome 17q23.1 and the human ETV1 gene is typically located on chromosome 7p21.3. In certain embodiments, the CLTC gene is the human gene having NCBI Gene ID NO: 1213, sequence chromosome 17; NC_000017.11 (59619689 . . . 59696956) and/or the ETV1gene is the human gene having NCBI Gene ID NO: 2115, sequence chromosome 7; NC_000007.14 (13891229 . . . 13991425, complement). In certain embodiments, the junction and/or junction fragment of a CLTC-ETV1 fusion gene comprises a sequence as shown in FIG. 16 or a fragment thereof.",
                                "The fusion gene ACPP-SEC13 is a fusion between acid phosphatase, prostate (“ACPP”) and SEC13 homolog (“SEC13”). The human ACPP is typically located on chromosome 3q22.1 and the human SEC13 gene is typically located on chromosome 3p25-p24. In certain embodiments, the ACPP gene is the human gene having NCBI Gene ID NO: 55, sequence chromosome 3; NC_000003.12 (132317367 . . . 132368302) and/or the SEC13 gene is the human gene having NCBI Gene ID NO: 6396, sequence chromosome 3; NC_000003.12 (10300929 . . . 10321188, complement). In certain embodiments, the junction and/or junction fragment of a ACPP-SEC13 fusion gene comprises a sequence as shown in FIG. 16.",
                                "The fusion gene DOCK7-OLR1 is a fusion between dedicator of cytokinesis 7 (“DOCK7”) and oxidized low density lipoprotein (lectin-like) receptor 1 (“OLR1”). The human DOCK7 is typically located on chromosome 1p31.3 and the human OLR1 gene is typically located on chromosome 12p13.2-p12.3. In certain embodiments, the DOCK7 gene is the human gene having NCBI Gene ID NO: 85440, sequence chromosome 1; NC_000001.11 (62454726 . . . 62688368, complement) and/or the OLR1 gene is the human gene having NCBI Gene ID NO: 4973, sequence chromosome 12; NC_000012.12 (10158300 . . . 10172191, complement). In certain embodiments, the junction and/or junction fragment of a DOCK7-OLR1 fusion gene comprises a sequence as shown in FIG. 16.",
                                "The fusion gene PCMTD1-SNTG1 is a fusion between protein-L-isoaspartate (D-aspartate) O-methyltransferase domain containing 1 (“PCMTD1”) and syntrophin, gamma 1 (“SNTG1”). The human PCMTD1 is typically located on chromosome 8q11.23 and the human SNTG1 gene is typically located on chromosome 8q11.21. In certain embodiments, the PCMTD1 gene is the human gene having NCBI Gene ID NO: 115294, sequence chromosome 8; NC_000008.11 (51817575 . . . 51899186, complement) and/or the SNTG1gene is the human gene having NCBI Gene ID NO: 54212, sequence chromosome 8; NC_000008.11 (49909789 . . . 50794118). In certain embodiments, the junction and/or junction fragment of a PCMTD1-SNTG1 fusion gene comprises a sequence as shown in FIG. 16."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define fusion gene",
                                "describe TRMT11-GRIK2 fusion gene",
                                "describe SLC45A2-AMACR fusion gene",
                                "describe MTOR-TP53BP1 fusion gene",
                                "describe LRRC59-FLJ60017 fusion gene",
                                "describe TMEM135-CCDC67 fusion gene",
                                "describe KDM4B-AC011523.2 fusion gene",
                                "describe MAN2A1-FER fusion gene",
                                "describe PTEN-NOLC1 fusion gene",
                                "describe CCNH-C5orf30 fusion gene",
                                "describe ZMPSTE24-ZMYM4 fusion gene",
                                "describe CLTC-ETV1 fusion gene",
                                "describe ACPP-SEC13 fusion gene",
                                "describe DOCK7-OLR1 fusion gene",
                                "describe PCMTD1-SNTG1 fusion gene",
                                "provide NCBI Gene ID for TRMT11 gene",
                                "provide NCBI Gene ID for GRIK2 gene",
                                "provide NCBI Gene ID for SLC45A2 gene",
                                "provide NCBI Gene ID for AMACR gene",
                                "provide NCBI Gene ID for MTOR gene",
                                "provide NCBI Gene ID for TP53BP1 gene",
                                "provide NCBI Gene ID for LRRC59 gene",
                                "provide NCBI Gene ID for FLJ60017 gene"
                            ],
                            "num_characters": 11729,
                            "outline_medium": [
                                "define fusion gene",
                                "describe TRMT11-GRIK2 fusion gene",
                                "describe SLC45A2-AMACR fusion gene",
                                "describe MTOR-TP53BP1 fusion gene",
                                "describe LRRC59-FLJ60017 fusion gene",
                                "describe TMEM135-CCDC67 fusion gene",
                                "describe KDM4B-AC011523.2 fusion gene",
                                "describe MAN2A1-FER fusion gene",
                                "describe PTEN-NOLC1 fusion gene",
                                "describe CCNH-C5orf30 fusion gene",
                                "describe additional fusion genes"
                            ],
                            "outline_short": [
                                "describe TRMT11-GRIK2 fusion gene",
                                "describe SLC45A2-AMACR fusion gene",
                                "describe MTOR-TP53BP1 fusion gene",
                                "describe multiple fusion genes",
                                "describe PCMTD1-SNTG1 fusion gene"
                            ]
                        },
                        {
                            "title": "5.2 Fusion Gene Detection",
                            "paragraphs": [
                                "Any of the foregoing fusion genes described above in section 5.1 may be identified and/or detected by methods known in the art. The fusion genes may be detected by detecting a fusion gene manifested in a DNA molecule, an RNA molecule or a protein. In certain embodiments, a fusion gene can be detected by determining the presence of a DNA molecule, an RNA molecule or protein that is encoded by the fusion gene. For example, and not by way of limitation, the presence of a fusion gene may be detected by determining the presence of the protein encoded by the fusion gene.",
                                "The fusion gene may be detected in a sample of a subject. A “patient” or “subject,” as used interchangeably herein, refers to a human or a non-human subject. Non-limiting examples of non-human subjects include non-human primates, dogs, cats, mice, etc. The subject may or may not be previously diagnosed as having prostate cancer.",
                                "In certain non-limiting embodiments, a sample includes, but is not limited to, cells in culture, cell supernatants, cell lysates, serum, blood plasma, biological fluid (e.g., blood, plasma, serum, stool, urine, lymphatic fluid, ascites, ductal lavage, saliva and cerebrospinal fluid) and tissue samples. The source of the sample may be solid tissue (e.g., from a fresh, frozen, and/or preserved organ, tissue sample, biopsy, or aspirate), blood or any blood constituents, bodily fluids (such as, e.g., urine, lymph, cerebral spinal fluid, amniotic fluid, peritoneal fluid or interstitial fluid), or cells from the individual, including circulating cancer cells. In certain non-limiting embodiments, the sample is obtained from a cancer. In certain embodiments, the sample may be a “biopsy sample” or “clinical sample,” which are samples derived from a subject. In certain embodiments, the sample includes one or more prostate cancer cells from a subject. In certain embodiments, the one or more fusion genes can be detected in one or more samples obtained from a subject, e.g., in one or more prostate cancer cell samples.",
                                "In certain non-limiting embodiments, the fusion gene is detected by nucleic acid hybridization analysis.",
                                "In certain non-limiting embodiments, the fusion gene is detected by fluorescent in situ hybridization (FISH) analysis. FISH is a technique that can directly identify a specific sequence of DNA or RNA in a cell or biological sample and enables visual determination of the presence and/or expression of a fusion gene in a tissue sample. In certain non-limiting embodiments, where a fusion gene combines genes not typically present on the same chromosome, FISH analysis may demonstrate probes binding to the same chromosome. For example, and not by way of limitation, analysis may focus on the chromosome where one gene normally resides and then hybridization analysis may be performed to determine whether the other gene is present on that chromosome as well.",
                                "In certain non-limiting embodiments, the fusion gene is detected by DNA hybridization, such as, but not limited to, Southern blot analysis.",
                                "In certain non-limiting embodiments, the fusion gene is detected by RNA hybridization, such as, but not limited to, Northern blot analysis. In certain embodiments, Northern blot analysis can be used for the detection of a fusion gene, where an isolated RNA sample is run on a denaturing agarose gel, and transferred to a suitable support, such as activated cellulose, nitrocellulose or glass or nylon membranes. Radiolabeled cDNA or RNA is then hybridized to the preparation, washed and analyzed by autoradiography to detect the presence of a fusion gene in the RNA sample.",
                                "In certain non-limiting embodiments, the fusion gene is detected by nucleic acid sequencing analysis.",
                                "In certain non-limiting embodiments, the fusion gene is detected by probes present on a DNA array, chip or a microarray. For example, and not by way of limitation, oligonucleotides corresponding to one or more fusion genes can be immobilized on a chip which is then hybridized with labeled nucleic acids of a sample obtained from a subject. Positive hybridization signal is obtained with the sample containing the fusion gene transcripts.",
                                "In certain non-limiting embodiments, the fusion gene is detected by a method comprising Reverse Transcription Polymerase Chain Reaction (“RT-PCR”). In certain embodiments, the fusion gene is detected by a method comprising RT-PCR using the one or more pairs of primers disclosed herein (see, for example, Table 3).",
                                "In certain non-limiting embodiments, the fusion gene is detected by antibody binding analysis such as, but not limited to, Western Blot analysis and immunohistochemistry."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce fusion gene detection",
                                "describe DNA hybridization analysis",
                                "describe FISH analysis",
                                "describe Southern blot analysis",
                                "describe Northern blot analysis",
                                "describe nucleic acid sequencing analysis",
                                "describe DNA array analysis",
                                "describe RT-PCR analysis",
                                "describe antibody binding analysis"
                            ],
                            "num_characters": 4639,
                            "outline_medium": [
                                "introduce fusion gene detection",
                                "describe nucleic acid hybridization analysis",
                                "describe fluorescent in situ hybridization (FISH) analysis",
                                "describe additional detection methods"
                            ],
                            "outline_short": [
                                "describe methods of detecting fusion genes",
                                "describe specific detection methods"
                            ]
                        },
                        {
                            "title": "5.3 Methods of Treatment",
                            "paragraphs": [
                                "The present invention provides methods of treating a subject carrying one or more fusion genes. Non-limiting examples of fusion genes are disclosed herein and in section 5.1. In certain embodiments, the methods of treatment include performing a targeted genome editing technique on one or more prostate cancer cells within the subject to produce an anti-cancer effect. Non-limiting examples of genome editing techniques are disclosed in section 5.4.",
                                "An “anti-cancer effect” refers to one or more of a reduction in aggregate cancer cell mass, a reduction in cancer cell growth rate, a reduction in cancer progression, a reduction in cancer cell proliferation, a reduction in tumor mass, a reduction in tumor volume, a reduction in tumor cell proliferation, a reduction in tumor growth rate and/or a reduction in tumor metastasis. In certain embodiments, an anti-cancer effect can refer to a complete response, a partial response, a stable disease (without progression or relapse), a response with a later relapse or progression-free survival in a patient diagnosed with cancer. In certain embodiments, an anti-cancer effect can refer to the induction of cell death, e.g., in one or more cells of the cancer, and/or the increase in cell death within a tumor mass.",
                                "In certain embodiments, a method of treating a subject comprises determining the presence of one or more fusion genes in a sample of the subject, where if one or more fusion genes are present in the sample then performing a targeted genome editing technique on one or more cells within the subject to produce an anti-cancer effect. In certain embodiments, the genome editing technique specifically targets the cells that carry the fusion gene, e.g., by specifically targeting a nucleic acid sequence of the fusion gene. Non-limiting examples of techniques for identifying and/or detecting a fusion gene are disclosed in section 5.2.",
                                "In certain embodiments, the method can include determining the presence or absence of one or more, two or more, three or more, four or more, five or more, six or more, seven or more, eight or more, nine or more, ten or more, eleven or more, twelve or more, thirteen or more or all fourteen of the fusion genes disclosed herein. In certain embodiments, the one or more fusion genes can be selected from the group consisting of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, PCMTD1-SNTG1 or a combination thereof.",
                                "In certain embodiments, the fusion gene can be TMEM135-CCDC67.",
                                "In certain embodiments, the fusion gene can be CCNH-C5orf30.",
                                "In certain embodiments, the method of treating a subject comprises determining the presence of one or more fusion genes selected from the group consisting MAN2A1-FER, TMEM135-CCDC67, TRMT11-GRIK2, CCNH-C5orf30, LRRC59-FLJ60017, SLC45A2-AMACR, KDM4B-AC011523.2, PTEN-NOLC1, MTOR-TP53BP1 or a combination thereof in a sample of the subject, where if one or more fusion genes are detected in the sample then performing a targeted genome editing technique on one or more cancer cells within the subject, e.g., one or more prostate cancer cells, to produce an anti-cancer effect.",
                                "In certain embodiments, the method of treating a subject comprises determining the presence of one or more fusion genes selected from the group consisting of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, PCMTD1-SNTG1 or a combination thereof in a sample of the subject, where if one or more fusion genes are detected in the sample then performing a genome editing technique targeting the fusion gene on one or more cancer cells within the subject, e.g., one or more prostate cancer cells, to produce an anti-cancer effect.",
                                "In certain embodiments, the method of treating a subject comprises determining the presence of one or more fusion genes selected from the group consisting of ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, PCMTD1-SNTG1 or a combination thereof in a sample of the subject, where if one or more fusion genes are detected in the sample then performing a targeted genome editing technique on one or more cancer cells within the subject, e.g., one or more prostate cancer cells, to produce an anti-cancer effect.",
                                "In certain embodiments, the sample in which the one or more fusion genes are detected is a prostate cancer sample.",
                                "In certain embodiments, the fusion gene in a sample is detected by genome sequencing. In certain embodiments, the fusion gene in a sample is detected by RNA sequencing. In certain embodiments, the fusion gene in a sample is detected by FISH."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce methods of treatment",
                                "describe targeted genome editing technique",
                                "describe anti-cancer effect",
                                "describe determining presence of fusion genes",
                                "describe performing genome editing technique",
                                "describe selecting fusion genes for treatment",
                                "describe detecting fusion genes in prostate cancer sample",
                                "describe detecting fusion genes by genome sequencing",
                                "describe detecting fusion genes by RNA sequencing"
                            ],
                            "num_characters": 4779,
                            "outline_medium": [
                                "introduce methods of treatment",
                                "describe targeted genome editing technique",
                                "describe determining presence of fusion genes",
                                "describe performing genome editing technique"
                            ],
                            "outline_short": [
                                "describe treating subjects with fusion genes",
                                "describe targeted genome editing techniques"
                            ]
                        },
                        {
                            "title": "5.4 Genome Editing Techniques",
                            "paragraphs": [
                                "Genome editing is a technique in which endogenous chromosomal sequences present in one or more cells within a subject, can be edited, e.g., modified, using targeted endonucleases and single-stranded nucleic acids. The genome editing method can result in the insertion of a nucleic acid sequence at a specific region within the genome, the excision of a specific sequence from the genome and/or the replacement of a specific genomic sequence with a new nucleic acid sequence. A non-limiting example of a genome editing technique is the CRISPR/Cas 9 system. Non-limiting examples of such genome editing techniques are disclosed in PCT Application Nos. WO 2014/093701 and WO 2014/165825, the contents of which are hereby incorporated by reference in their entireties.",
                                "In certain embodiments, the genome editing technique can include the use of one or more guide RNAs (gRNAs), complementary to a specific sequence within a genome, e.g., a chromosomal breakpoint associated with a fusion gene, including protospacer adjacent motifs (PAMs), to guide a nuclease, e.g., an endonuclease, to the specific genomic sequence. A non-limiting example of an endonuclease includes the clustered, regularly interspaced short palindromic repeat (CRISPR) associated protein 9 (Cas9). In certain embodiments, the endonuclease can result in the cleavage of the targeted genome sequence and allow modification of the genome at the cleavage site through nonhomologous end joining (NHEJ) or homologous recombination.",
                                "In certain embodiments, the genome editing method and/or technique can be used to target a sequence of a fusion gene present in a cell, e.g., in a prostate cancer cell, to promote homologous recombination to insert a nucleic acid into the genome of the cell. For example, and not by way of limitation, the genome editing technique can be used to target the region where the two genes of the fusion gene are joined together (i.e., the junction and/or chromosomal breakpoint). As normal, non-cancerous, prostate cells do not contain the fusion gene, and therefore do not contain the chromosomal breakpoint associated with the fusion gene, prostate cancer cells can be specifically targeted using this genome editing technique. In certain embodiments, the genome editing technique can be used to target the junction (i.e., breakpoint) of a fusion gene selected from TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 and PCMTD1-SNTG1. For example, and not by way of limitation, the gRNAs can be designed to target (e.g., be complementary to) the sequences flanking the chromosomal breakpoint region (see, for example, FIGS. 15 and 29) to guide an endonuclease, e.g., Cas9D10A, to the chromosomal breakpoint region.",
                                "In certain embodiments, the disclosed genome editing technique can be used to promote homologous recombination with a sequence of a fusion gene, e.g., at a chromosomal breakpoint (junction) of a fusion gene, in one or more cells of a subject to allow the insertion of a nucleic acid sequence that when expressed results in the death, e.g., apoptosis, of the one or more cells. For example, and not by way of limitation, the nucleic acid sequence (also referred to herein as a donor nucleic acid) can encode the Herpes Simplex Virus 1 (HSV-1) thymidine kinase, Exotoxin A from Pseudomonas aeruginosa, Diphtheria toxin from Corynebacterium diphtheri, Ricin or abrin from Ricinus communi (castor oil plant), Cytosine deaminase from bacteria or yeast, Carboxyl esterase or Varicella Zoster virus (VZV) thymidine kinase. Additional non-limiting examples of nucleic acids and/or genes that can be inserted into the genome of a cell carrying a fusion gene to induce cell death are disclosed in Rajab et al. (2013) (J. of Genetics Syndromes and Gene Therapy, 4(9):187) and Zarogoulidis et al. (2013) (J. of Genetics Syndromes and Gene Therapy, 4(9):pii: 16849). In certain non-limiting embodiments, the nucleic acid sequence, e.g., the HSV-1 thymidine kinase nucleic acid sequence, is not operably linked to a regulatory sequence promoter (e.g., a promoter) and requires integration into the genome for expression. For example, and not by way of limitation, the promoter of the head gene of the fusion gene can promote the expression of the donor nucleic acid sequence.",
                                "In certain embodiments where a nucleic acid encoding HSV-1 thymidine kinase is inserted in the genome of one or more cells of a subject, a therapeutically effective amount of the guanine derivative, ganciclovir, or its oral homolog, valganciclovir, can be administered to the subject. HSV-1 thymidine kinase can phosphorylate and convert ganciclovir and/or valganciclovir into the triphosphate forms of ganciclovir and/or valganciclovir in the one or more cells of the subject. The triphosphate form of ganciclovir and/or valganciclovir acts as competitive inhibitor of deoxyguanosine triphosphate (dGTP) and is a poor substrate of DNA elongation, and can result in the inhibition of DNA synthesis. The inhibition of DNA synthesis, in turn, can result in the reduction and/or inhibition of growth and/or survival and/or cell death of prostate cancer cells that contain the targeted chromosomal breakpoint and the integrated HSV-1 thymidine kinase nucleic acid sequence. This genome editing method can be used to produce an anti-cancer effect in a subject, e.g., a prostate cancer subject, that has been determined to have a fusion gene and/or an increased risk for progressive prostate cancer.",
                                "In certain embodiments, a genome editing technique of the present disclosure can include the introduction of an expression vector comprising a nucleic acid sequence that encodes a Cas protein or a mutant thereof, e.g., Cas9D10A, into one or more cells of the subject, e.g., prostate cancer cells, carrying a fusion gene. In certain embodiments, the vector can further comprise one or more gRNAs for targeting the Cas9 protein to a specific nucleic acid sequence within the genome.",
                                "In certain embodiments, the one or more gRNAs can hybridize to a target sequence within a fusion gene. For example, and not by way of limitation, the one or more gRNAs can target the chromosomal breakpoint of a fusion gene and/or target the one or more sequences that flank the chromosomal breakpoint region. Non-limiting examples of sequences of fusion gene chromosomal breakpoints are disclosed herein and within the Figures (see, for example, Table 1). In certain embodiments, one gRNA can be complementary to a region within one of the genes of the fusion gene and another gRNA can be complementary to a region within the other gene of the fusion gene. For example, and not by way of limitation, one gRNA can be complementary to a region within the TMEM135 gene of the TMEM135-CCDC67 fusion gene and another gRNA can be complementary to a region within the CCDC67 gene. In certain embodiments, one gRNA can be complementary to a region upstream of the chromosomal breakpoint of a fusion gene and another gRNA can be complementary to a region downstream of the chromosomal breakpoint. In certain embodiments, genome sequencing can be performed to determine the regions of the fusion gene that can be targeted by the gRNAs. In certain embodiment, the regions of the genes that are targeted by the gRNAs can be introns and/or exons.",
                                "In certain embodiments, the nucleic acid sequence encoding the Cas protein can be operably linked to a regulatory element, and when transcribed, the one or more gRNAs can direct the Cas protein to the target sequence in the genome and induce cleavage of the genomic loci by the Cas protein. In certain embodiments, the Cas9 protein cut about 3-4 nucleotides upstream of the PAM sequence present adjacent to the target sequence. In certain embodiments, the regulatory element operably linked to the nucleic acid sequence encoding the Cas protein can be a promoter, e.g., an inducible promoter such as a doxycycline inducible promoter. The term “operably linked,” when applied to DNA sequences, for example in an expression vector, indicates that the sequences are arranged so that they function cooperatively in order to achieve their intended purposes, i.e., a promoter sequence allows for initiation of transcription that proceeds through a linked coding sequence as far as the termination signal.",
                                "In certain embodiments, the Cas9 enzyme encoded by a vector of the present invention can comprise one or more mutations. The mutations may be artificially introduced mutations or gain- or loss-of-function mutations. Non-limiting examples of such mutations include mutations in a catalytic domain of the Cas9 protein, e.g., the RuvC and HNH catalytic domains, such as the D10 mutation within the RuvC catalytic domain and the H840 in the HNH catalytic domain. In certain embodiments, a mutation in one of the catalytic domains of the Cas9 protein results in the Cas9 protein functioning as a “nickase,” where the mutated Cas9 protein cuts only one strand of the target DNA, creating a single-strand break or “nick.” In certain embodiments, the use of a mutated Cas9 protein, e.g., Cas9D10A, allows the use of two gRNAs to promote cleavage of both strands of the target DNA. Additional non-limiting examples of Cas9 mutations include VP64, KRAB and SID4X.",
                                "In certain embodiments, the genome editing technique of the present disclosure can further include introducing into the one or more cells an additional vector comprising a nucleic acid, that when expressed results in the death, e.g., apoptosis, of the one or more cells. In certain embodiments, this vector can further comprise one or more targeting sequences that are complementary (e.g., can hybridize) to the same and/or adjacent to the genomic sequences targeted by the gRNAs to allow homologous recombination to occur and insertion of the nucleic acid sequence (i.e., donor nucleic acid sequence) into the genome. In certain embodiments, the additional vector can further comprise one or more splice tag sequences of an exon/intron junction of a gene that makes up the fusion gene. In certain embodiments, the targeting sequences can be complementary to an intron, exon sequence and/or intron/extron splicing sequence within a gene of the fusion gene. In certain embodiments, one targeting sequence can be complementary to a region within one of the genes of the fusion gene targeted by the gRNAs and a second targeting sequence can be complementary to a region within the other gene of the fusion gene, to allow homologous recombination between the vector comprising the donor nucleic acid and the genome sequence cleaved by the Cas9 protein. For example, and not by way of limitation, one targeting sequence can be complementary to a region within the TMEM135 gene of the TMEM135-CCDC67 fusion gene and another targeting sequence can be complementary to a region within the CCDC67 gene. In certain embodiments, one targeting sequence can be complementary to a region upstream of the cleavage site generated by the Cas9 protein and another targeting sequence can be complementary to a region downstream of the chromosomal breakpoint. Non-limiting examples of the types of nucleic acid sequences that can be inserted into the genome are disclosed above. In certain embodiments, the nucleic acid that is to be inserted into the genome encodes HSV-1 thymidine kinase. Additional non-limiting examples of nucleic acids and/or genes that can be inserted into the genome of a cell carrying a fusion gene to induce cell death are set forth above.",
                                "The vectors for use in the present disclosure can be any vector known in the art. For example, and not by way of limitation, the vector can be derived from plasmids, cosmids, viral vectors and yeast artificial chromosomes. In certain embodiments, the vector can be a recombinant molecule that contains DNA sequences from several sources. In certain embodiments, the vector can include additional segments such as, but not limited to, promoters, transcription terminators, enhancers, internal ribosome entry sites, untranslated regions, polyadenylation signals, selectable markers, origins of replication and the like. In certain embodiments, the vectors can be introduced into the one or more cells by any technique known in the art such as by transfection and transduction. In certain embodiments, the vectors can be introduced by adenovirus transduction.",
                                "The head gene is italicized and the tail gene is non-italicized. Targeted sequences are underlined and bolded.",
                                "**5.4.1 Particular Non-Limiting Examples**",
                                "In certain embodiments, a genome editing technique of the present invention comprises introducing into one or more cells of a subject: (i) a vector comprising a nucleic acid sequence that encodes a Cas9 protein, or mutant thereof; (ii) a vector comprising one or more gRNAs that are complementary to one or more target sequences of a fusion gene, that when expressed induce Cas9-mediated DNA cleavage within the fusion gene; and (iii) a vector comprising a donor nucleic acid sequence, that when expressed results in cell death, and one or more targeting sequences that are complementary to one or more sequences of the fusion gene to promote homologous recombination and the insertion of the donor nucleic acid sequence into the fusion gene.",
                                "In certain embodiments, a genome editing technique of the present invention comprises introducing into one or more cells of a subject: (i) a vector comprising a nucleic acid sequence that encodes a Cas9 protein, or mutant thereof, and one or more gRNAs that are complementary to one or more target sequences of a fusion gene, wherein when transcribed, the one or more gRNAs direct sequence-specific binding of a Cas9 protein to the one or more target sequences of the fusion gene to promote cleavage of the fusion gene; and (ii) a vector comprising a donor nucleic acid sequence, that when expressed results in cell death, and one or more targeting sequences that are complementary to one or more sequences of the fusion gene to promote homologous recombination and the insertion of the donor nucleic acid sequence into the fusion gene.",
                                "In certain embodiments, a genome editing technique of the present invention comprises introducing into one or more cells of a subject: (i) a vector comprising a nucleic acid sequence that encodes Cas9 protein, or mutant thereof, and one or more gRNAs that are complementary to one or more target sequences of a fusion gene, wherein when transcribed, the one or more gRNAs direct sequence-specific binding of a Cas9 protein to the one or more target sequences of the fusion gene to promote cleavage of the fusion gene; and (ii) a vector comprising a donor nucleic acid sequence encoding HSV-1 thymidine kinase and one or more targeting sequences that are complementary to one or more sequences of the fusion gene to promote homologous recombination and the insertion of the donor nucleic acid sequence encoding HSV-1 thymidine kinase into the fusion gene. In certain embodiments, the genome editing technique further comprises the administration of a therapeutically effective amount of ganciclovir and/or valganciclovir."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce genome editing",
                                "define CRISPR/Cas 9 system",
                                "describe use of guide RNAs",
                                "explain endonuclease cleavage",
                                "discuss homologous recombination",
                                "target fusion gene chromosomal breakpoint",
                                "design gRNAs for targeting",
                                "introduce Cas9D10A mutant",
                                "describe insertion of nucleic acid sequence",
                                "explain cell death induction",
                                "introduce HSV-1 thymidine kinase",
                                "describe ganciclovir administration",
                                "introduce expression vector",
                                "describe Cas protein mutations",
                                "explain nickase function",
                                "introduce additional vector",
                                "describe targeting sequences",
                                "explain homologous recombination",
                                "introduce splice tag sequences",
                                "describe intron/exon junction targeting",
                                "introduce vector components",
                                "describe vector introduction methods",
                                "introduce adenovirus transduction",
                                "describe genome editing technique variations",
                                "introduce particular non-limiting examples",
                                "describe Cas9 protein and gRNA vectors",
                                "explain donor nucleic acid sequence",
                                "introduce targeting sequences",
                                "describe homologous recombination",
                                "explain cell death induction"
                            ],
                            "num_characters": 15231,
                            "outline_medium": [
                                "introduce genome editing",
                                "describe CRISPR/Cas 9 system",
                                "explain use of guide RNAs",
                                "detail endonuclease cleavage",
                                "describe homologous recombination",
                                "target fusion gene chromosomal breakpoint",
                                "introduce donor nucleic acid sequence",
                                "describe HSV-1 thymidine kinase",
                                "explain ganciclovir administration",
                                "introduce Cas9 mutations",
                                "describe use of nickase",
                                "detail targeting sequences",
                                "explain homologous recombination with donor nucleic acid",
                                "describe vector construction",
                                "introduce adenovirus transduction"
                            ],
                            "outline_short": [
                                "introduce genome editing techniques",
                                "describe CRISPR/Cas 9 system",
                                "explain use of guide RNAs to target specific sequences",
                                "detail homologous recombination to insert nucleic acid sequences",
                                "describe use of nucleic acid sequences to induce cell death",
                                "explain introduction of vectors into cells",
                                "provide non-limiting examples of genome editing techniques"
                            ]
                        },
                        {
                            "title": "5.5 Kits",
                            "paragraphs": [
                                "The present invention further provides kits for treating a subject that carries one or more of the fusion genes disclosed herein. In certain embodiments, the present disclosure provides kits for performing a targeted genome editing technique on one or more cancer cells, e.g., prostate cancer cells, within the subject that carries one or more of the fusion genes disclosed herein.",
                                "Types of kits include, but are not limited to, packaged fusion gene-specific probe and primer sets (e.g., TaqMan probe/primer sets), arrays/microarrays, antibodies, which further contain one or more probes, primers, or other reagents for detecting one or more fusion genes and/or can comprise means for performing a genome editing technique.",
                                "In certain embodiments, the kit can include means for performing the genome editing techniques disclosed herein. For example, and not by way of limitation, a kit of the present disclosure can include a container comprising one or more vectors or plasmids comprising a nucleic acid encoding a Cas protein, e.g., Cas9D10A. In certain embodiments, the nucleic acid encoding the Cas protein can be operably linked to a regulatory element such as a promoter. In certain embodiments, the one or more vectors can further comprise one or more gRNAs specific to a fusion gene, e.g., specific to a breakpoint of a fusion gene and/or sequences flanking the breakpoint of a fusion gene.",
                                "In certain embodiments, a kit of the present invention can include, optionally in the same container as the vector comprising the nucleic acid encoding a Cas protein or in another container, one or more vectors or plasmids comprising a nucleic acid, that when expressed (in the presence of absence of a compound) results in cell death. For example, and not by way of limitation, the nucleic acid sequence can encode the Herpes Simplex Virus 1 (HSV-1) thymidine kinase, Exotoxin A from Pseudomonas aeruginosa, Diphtheria toxin from Corynebacterium diphtheri, Ricin or abrin from Ricinus communi (castor oil plant), Cytosine deaminase from bacteria or yeast, Carboxyl esterase or Varicella Zoster virus (VZV) thymidine kinase. In certain embodiments, this vector can further comprise one or more targeting sequences that are complementary to sequences within the fusion gene to promote homologous recombination and insertion of the donor nucleic acid.",
                                "In certain embodiments, where the donor nucleic acid encodes HSV-1 thymidine kinase, the kit can further comprise ganciclovir and/or valganciclovir.",
                                "In certain non-limiting embodiments, a kit of the present disclosure can further comprise one or more nucleic acid primers or probes and/or antibody probes for use in carrying out any of the above-listed methods. Said probes may be detectably labeled, for example with a biotin, colorimetric, fluorescent or radioactive marker. A nucleic acid primer may be provided as part of a pair, for example for use in polymerase chain reaction. In certain non-limiting embodiments, a nucleic acid primer may be at least about 10 nucleotides or at least about 15 nucleotides or at least about 20 nucleotides in length and/or up to about 200 nucleotides or up to about 150 nucleotides or up to about 100 nucleotides or up to about 75 nucleotides or up to about 50 nucleotides in length. An nucleic acid probe may be an oligonucleotide probe and/or a probe suitable for FISH analysis. In specific non-limiting embodiments, the kit comprises primers and/or probes for analysis of at least two, at least three, at least four, at least five, six, seven, eight, nine, ten, eleven, twelve, thirteen, fourteen of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 and PCMTD1-SNTG1.",
                                "In certain non-limiting embodiments, the nucleic acid primers and/or probes may be immobilized on a solid surface, substrate or support, for example, on a nucleic acid microarray, wherein the position of each primer and/or probe bound to the solid surface or support is known and identifiable. The nucleic acid primers and/or probes can be affixed to a substrate, such as glass, plastic, paper, nylon or other type of membrane, filter, chip, bead, or any other suitable solid support. The nucleic acid primers and/or probes can be synthesized directly on the substrate, or synthesized separate from the substrate and then affixed to the substrate. The arrays can be prepared using known methods.",
                                "In non-limiting embodiments, a kit provides nucleic acid probes for FISH analysis of one or more fusion gene selected from the group consisting of: TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, CCNH-C5orf30, TRMT11-GRIK2, SLC45A2-AMACR, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, MTOR-TP53BP1, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 or PCMTD1-SNTG1. In non-limiting embodiments, a kit provides nucleic acid probes for FISH analysis of one or more fusion gene selected from the group consisting of: TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, PTEN-NOLC1 and CCNH-C5orf30, and TRMT11-GRIK2, SLC45A2-AMACR, KDM4B-AC011523.2, MAN2A1-FER and MTOR-TP53BP1. In specific non-limiting embodiments, probes to detect a fusion gene may be provided such that separate probes each bind to the two components of the fusion gene or a probe may bind to a “junction” that encompasses the boundary between the spliced genes. For example, and not by way of limitation, the junction is the region where the two genes are joined together. In specific non-limiting embodiments, the kit comprises said probes for analysis of at least two, at least three, at least four or all five of ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 or PCMTD1-SNTG1. An example of FISH analysis used to identify a fusion gene is provided in Example 1 below.",
                                "In non-limiting embodiments, a kit provides nucleic acid primers for PCR analysis of one or more fusion gene selected from the group consisting of: TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, PTEN-NOLC1, CCNH-C5orf30, TRMT11-GRIK2, SLC45A2-AMACR, KDM4B-AC011523.2, MAN2A1-FER or MTOR-TP53BP1. In non-limiting embodiments, a kit provides nucleic acid primers for PCR analysis of one or more fusion gene selected from the group consisting of: ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1or PCMTD1-SNTG1. In specific non-limiting embodiments, the kit comprises said primers for analysis of at least two, at least three, at least four, at least five, six, seven, eight, nine, ten, eleven, twelve, thirteen, fourteen of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1 and PCMTD1-SNTG1.",
                                "The following Examples are offered to more fully illustrate the disclosure, but are not to be construed as limiting the scope thereof."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce kits for treating subjects",
                                "describe kit components",
                                "introduce fusion gene-specific probe and primer sets",
                                "describe arrays/microarrays",
                                "introduce antibodies",
                                "describe means for performing genome editing",
                                "introduce vector comprising Cas protein",
                                "describe gRNA and targeting sequences",
                                "introduce donor nucleic acid sequence",
                                "describe nucleic acid primers and probes",
                                "introduce FISH analysis",
                                "describe PCR analysis",
                                "introduce examples of kits"
                            ],
                            "num_characters": 6973,
                            "outline_medium": [
                                "introduce kits for treating subjects with fusion genes",
                                "describe kit components for genome editing",
                                "detail nucleic acid primers and probes",
                                "explain FISH analysis",
                                "describe PCR analysis",
                                "introduce examples of kits"
                            ],
                            "outline_short": [
                                "introduce kits for treating subjects with fusion genes",
                                "describe contents of kits, including vectors and nucleic acid sequences",
                                "provide non-limiting examples of kits and their uses"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce fusion genes"
                    ],
                    "num_characters": 252,
                    "outline_medium": [
                        "introduce fusion genes"
                    ],
                    "outline_short": [
                        "define fusion genes"
                    ]
                },
                {
                    "title": "6. EXAMPLE 1: TRANSLOCATION AND FUSION GENE EVENTS IN PROGRESSIVE PROSTATE CANCER",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "6.1 Abstract",
                            "paragraphs": [
                                "Importance:",
                                "Prediction of prostate cancer clinical outcome remains a major challenge after the diagnosis. An accurate and reproducible test predicting the behavior of prostate cancer is urgently needed.",
                                "Objective:",
                                "To identify biomarkers that are predictive of prostate cancer recurrence or prostate cancer related death.",
                                "Design:",
                                "Genome DNA and/or total RNA from Nineteen specimens of prostate cancer (T), matched adjacent benign prostate tissues (AT), matched bloods (B) and organ donor prostates (OD) were sequenced. Eight novel fusion genes were discovered and validated. These 8 novel fusion genes were then analyzed on 174 prostate samples, including 164 prostate cancer and 10 healthy prostate organ donor samples. Up to 15 years of clinical follow-ups on prostate cancer patients were conducted.",
                                "Setting:",
                                "University of Pittsburgh Medical Center, Presbyterian and Shadyside Campus.",
                                "Participants:",
                                "One hundred sixty-four prostate cancer patients underwent radical prostatectomy from 1998-2012 were selected for fusion gene expression analysis. 80.5% (132/164) patients had been followed-up for at least 5 years.",
                                "Main Measure:",
                                "To identify the presence of any of the following fusion genes in prostate cancer samples: TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, TRMT11-GRIK2, CCNH-C5orf30, SLC45A2-AMACR, MTOR-TP53BP1 and LRRC59-FLJ60017.",
                                "Results:",
                                "Approximately 90% of men carrying at least one of six of these fusion genes (TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67 and CCNH-C5orf30) experienced prostate cancer recurrence, metastases and/or prostate cancer-specific death after radical prostatectomy, while these outcomes occurred in only 36% of men not carrying those fusion genes. Four fusion genes occurred exclusively in prostate cancer samples from patients who experienced recurrence or prostate cancer related death. The formation of these fusion genes is the result of genome recombination events.",
                                "Conclusion and Relevance:",
                                "These findings suggest that the formation of these fusion genes are associated with prostate cancer recurrence and may drive the progression."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce problem of prostate cancer prediction",
                                "state objective of identifying biomarkers",
                                "describe design of study",
                                "summarize main results"
                            ],
                            "num_characters": 2126,
                            "outline_medium": [
                                "motivate need for prostate cancer test",
                                "state objective and design"
                            ],
                            "outline_short": [
                                "motivate biomarkers for prostate cancer"
                            ]
                        },
                        {
                            "title": "6.2. Introduction",
                            "paragraphs": [
                                "Despite a high incidence1, 2, only a fraction of men diagnosed with prostate cancer develop metastases and even fewer die from the disease. The majority of prostate cancers remain asymptomatic and clinically indolent. The precise mechanisms for the development of progressive, clinically concerning prostate cancer remain elusive. Furthermore, the inability to predict prostate cancer's potential aggressiveness has resulted in significant overtreatment of the disease. The dichotomous nature of prostate cancer—a subset of life-threatening malignancies in the larger background of histological alterations lacking the clinical features implicit with that label—is a fundamental challenge in disease management.",
                                "To identify genome markers for prostate cancer, whole genome sequencing was performed on 14 prostate tissue samples from 5 prostate cancer patients: five prostate cancers (T) from patients who experienced poor clinical outcomes (reoccurrence with fast rise of prostate cancer antigen doubling time (PSADT<4 months)), five matched blood (B) samples and four matched benign prostate tissues from the prostate cancer patients (AT) (Table 2). In one patient, normal adjacent prostate tissue was not available. An average of 200 GB was sequenced per sample to achieve 33 fold coverage of the entire genome. Total RNA from all T and AT samples was sequenced to achieve >1333 (average 400 million reads/sample) fold coverage per gene. Total RNA from four age-matched, entirely histologically benign prostate tissues harvested from healthy organ donors was similarly sequenced as a tissue control. The sequencing data were aligned to human reference genome HG193. Fusion genes were then identified and validated. We hypothesize that these fusion genes from cancer samples that prove metastatic are associated poor clinical outcome for prostate cancer patients. A prediction model for prostate cancer recurrence and short post-operative prostate specific antigen doubling time (PSADT) was built. This model was then applied to 89 additional prostate cancer samples from University of Pittsburgh Medical Center, 30 samples from Stanford University Medical Center, and 36 samples from University of Wisconsin Madison Medical Center with follow-up ranging from 1 to 15 years. One hundred twenty-seven of these samples are from patients who experienced prostate cancer recurrence after radical prostatectomy, and 106 are from patients with no evidence of recurrence for at least 5 years after the surgery. The remaining 46 samples are from patients who had less than 5 years of follow-up and had not yet experienced biochemical recurrence.",
                                "The newly validated fusion genes were then analyzed on 164 prostate cancer samples with clinical follow-up ranging from 2 to 15 years. Seventy-eight of these samples are from patients who experienced prostate cancer recurrence after radical prostatectomy, while 54 are from patients had no recurrence for at least 5 years after the surgery. The remainder samples are from patients who had radical prostatectomy less than 5 years ago. Association of fusion gene expression with prostate cancer recurrence was analyzed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce prostate cancer statistics",
                                "describe limitations of current disease management",
                                "explain need for genome markers",
                                "describe whole genome sequencing approach",
                                "introduce hypothesis of fusion genes and poor clinical outcome",
                                "outline prediction model and application"
                            ],
                            "num_characters": 3158,
                            "outline_medium": [
                                "describe prostate cancer challenge",
                                "introduce whole genome sequencing",
                                "hypothesize fusion genes association"
                            ],
                            "outline_short": [
                                "introduce prostate cancer challenges"
                            ]
                        },
                        {
                            "title": "6.3 Methods",
                            "paragraphs": [
                                "Tissue Samples.",
                                "Nineteen specimens of prostate cancer (T), matched adjacent benign prostate tissues (AT), matched bloods (B) and organ donor prostates (OD) were obtained from University of Pittsburgh Tissue Bank in compliance with institutional regulatory guidelines (Table 2). To ensure high purity (≥80%) of tumor cells, needle-microdissection was performed by pathologists to isolate the tumor cells from adjacent normal tissues (≥3 mm distance from the tumor). For AT and OD samples, similar needle-microdissections were performed to achieve 80% epithelial purity. Genomic DNA of these tissues was extracted using a commercially available tissue and blood DNA extraction kit (Qiagen, Hilden, Germany). The protocols of tissue procurement and procedure were approved by Institution Board of Review of University of Pittsburgh.",
                                "Whole Genome and Transcriptome Sequencing Library Preparation.",
                                "To prepare the genomic DNA libraries, 50 ng DNA was subjected to the tagmentation reactions using the NEXTERA DNA sample prep kit (Madison, Wis.) for 5 min at 55° C. The DNA was then amplified with adaptor and sequencing primers for 9 cycles of the following procedure: 95° C. for 10s, 62° C. for 30s and 72° C. for 3 min. The PCR products were purified with Ampure beads. The quality of genomic DNA libraries was then analyzed with qPCR using Illumina sequencing primers and quantified with Agilent 2000 bioanalyzer. For transcriptome sequencing, total RNA was extracted from prostate samples using Trizol, and treated with DNAse1. Ribosomal RNA was then removed from the samples using RIBO-ZERO™ Magnetic kit (Epicentre, Madison, Wis.). The RNA was reverse-transcribed to cDNA and amplified using TRUSEQ™ RNA Sample Prep Kit v2 from Illumina, Inc (San Diego, Calif.). The library preparation process such as adenylation, ligation and amplification was performed following the manual provided by the manufacturer. The quantity and quality of the libraries were assessed as those described in genome DNA library preparation.",
                                "Whole Genome and Transcriptome Sequencing.",
                                "The Illumina whole genome sequencing system was applied to the analysis. The operation procedures strictly followed the manufacturer's instructions. Briefly, DNA libraries were hybridized to flowcells and subjected to primer extension and bridge amplification in an automatic cBot process for 4 h to generate clusters of DNA sequencing templates. These clustered flowcells were then subjected to the sequencing analysis in the Illumina HiSeq2000 system. All samples were sequenced with paired-end runs for 200 cycles.",
                                "Read Alignment.",
                                "Whole genome DNA-seq reads from 5 Ts, 4 ATs and 5 Bs were aligned by BWA3 version 1.4.1 against the UCSC hg19 human reference genome allowing maximal 2 base mismatches per (100 nucleotide) read. After alignment, the average coverage of whole genome is above 30× for all 14 samples. Picard tool (http://picard.sourceforge.net) was applied to remove duplicate reads after the alignment. RNA-seq reads (from 5 T, 4 matched AT and 4 OD samples) were at an average of 1333× coverage. Whole transcriptome RNA-seq reads were aligned with the UCSC hg19 reference genome using Tophat4-6 version 1.4.1. Maximal 2 mismatches per read were allowed.",
                                "Fusion Gene Detection.",
                                "To identify fusion gene events, we applied a Fusioncatcher (v0.97) algorithm7 on RNA sequencing samples. The analysis results by the software had been validated with high precision rate in breast cancer cell lines. Both BOWTIE and BLAT alignment were applied in the analysis and were plotted with CIRCOS software8. The preliminary list of candidate fusion transcripts are filtered in Fusioncatcher based on the existing biological knowledge of the literature including: (1) If the genes are known to be the other's paralog in Ensembl; (2) If one of the fusion transcripts are the partner's pseudogene; (3) If one of the fusion transcripts are micro/transfer/small-nuclear RNA; (4) If the fusion transcript is known to be a false positive event (e.g., Conjoin gene database21); (5) If it has been found in healthy samples (Illumina Body Map 2.0 [http://www.ebi.ac.uk/arrayexpress/experiments/E-MTAB-513/]); (6) If the head and tail genes are overlapping with each other on the same strand. Fusion genes were visualized with CIRCOS software8 as shown in FIG. 6.",
                                "Machine Learning Classifier to Predict Relapse Status.",
                                "8 fusion genes from 5 tumor samples validated by RT-PCR, Sanger sequencing and Fluorescence In-situ Hybridization (FISH) analyses were used as features to predict the relapse status (fast vs non-fast and relapse vs non-relapse) in a large validation cohort (PSADT<4 months vs PSADT>15 months or non-recurrent). The presence for each fusion pair was coded either as 1 or 0 to represent whether the fusion gene exist in the sample. Linear discriminant analysis (LDA) was used to build a classifier. In light of relatively rare occurrence of the fusion transcripts (4.4%-9.0%) in our 90-sample Pittsburgh training cohort, we also applied a simple prediction rule based on the presence in any subset of the eight fusion genes (i.e., a patient is predicted as recurrence if any fusion transcript in a designated subset exists). Leave-one-out cross validation (LOOCV) was applied to construct the model and evaluate the prediction performance. ROC curves were constructed by varying the parameters in the LDA classifier construction and the optimal prediction model was selected with the best Youden index (=sensitivity+specificity−1)22, and was then evaluated in a 89-sample Pittsburgh test cohort, a 21-sample Stanford test cohort and a 30-sample Wisconsin test cohort. To compare the statistical significance of AUC difference between two models, a bootstrap test is used to generate p-values23. To compare accuracy of two models, a test for equal proportions using “prop.test” in R is applied.",
                                "To demonstrate the potential translational predictive value of these fusion transcripts, information of Nomogram estimated five-year PSA free survival probability and Gleason scores of the patients was incorporated into our prediction models. The following models were generated: (I) 8 fusion transcripts alone, (II) Gleason scores alone, (III) Nomogram values alone, (IV) Gleason scores+8 fusion transcripts, (V) Nomogram values+8 fusion transcripts. Complete information of prediction accuracy, sensitivity, specificity and Youden index for these eight models is available in Tables 7-16.",
                                "RT-PCR.",
                                "To verify fusion genes detected by transcriptome and whole genome sequencing, total RNA was reverse-transcribed with random hexamer. Double strand cDNA was synthesized as described previously9, 10. PCRs were performed using primers indicated in Table 3 using the following condition: 94° C. for 5 min, followed by 30 cycles of 94° C. for 30 seconds, 61° C. for 1 min and 72° C. for 2 min.",
                                "Fluorescence In-Situ Hybridization.",
                                "Formalin-fixed and paraffin-embedded tissue slides (5 microns) were placed in 2×SSC at 37° C. for 30 min. Slides were then removed and dehydrated in 70% and 85% ethanol for 2 min each at room temperature, and air dried. The DNA from the selected clones (Table 4) was extracted using Nucleobond Ax kit (Macherey-Nagel, Easton, Pa.). The biotin-labeled probes were prepared using standard nick-translation procedure and hybridized to sample slides as described previously11, 12."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe tissue sample collection",
                                "explain needle-microdissection procedure",
                                "describe DNA extraction",
                                "outline whole genome sequencing library preparation",
                                "describe transcriptome sequencing library preparation",
                                "explain whole genome sequencing process",
                                "describe read alignment",
                                "outline fusion gene detection",
                                "describe machine learning classifier",
                                "explain leave-one-out cross validation",
                                "describe ROC curve construction",
                                "outline bootstrap test for AUC difference",
                                "describe RT-PCR verification",
                                "explain fluorescence in-situ hybridization"
                            ],
                            "num_characters": 7378,
                            "outline_medium": [
                                "describe tissue samples",
                                "outline whole genome sequencing library preparation",
                                "detail whole genome sequencing",
                                "explain read alignment",
                                "describe fusion gene detection",
                                "outline machine learning classifier",
                                "describe RT-PCR and FISH validation"
                            ],
                            "outline_short": [
                                "describe sample preparation",
                                "outline sequencing and alignment procedures",
                                "explain fusion gene detection and validation"
                            ]
                        },
                        {
                            "title": "6.4. Results",
                            "paragraphs": [
                                "Fusion Genes Discovered by RNA and Whole Genome Sequencing.",
                                "A total of 76 RNA fusion events were identified in prostate cancer samples by the Fusioncatcher7 program. Thirteen of these fusion events were suggested by genome sequencing. To control for tissue-based fusion gene events, fusion genes present in any of the four age-matched organ donor prostate tissues were eliminated (Table 5). Further, fusion genes with less than 20 kb between each element and read in the cis direction were also eliminated. As a result of this filtering, 28 of 76 fusion gene events were identified as prostate cancer specific (Table 6 and FIG. 6). Among these fusion events, TMPRSS2-ERG, the most common prostate cancer fusion gene13-15, was found in two prostate cancer samples. Majority of the fusion events identified are novel and not reported in the literature. None of the 29 fusion genes were identified in the matched AT transcriptome analysis. To validate these fusion genes, RT-PCR was performed using primers specific for fusion gene regions encompassing the fusion breakpoints and the PCR products were sequenced. Eight of these fusion gene events were validated through sequencing (FIG. 1).",
                                "Five of the eight fusion events resulted in truncation of a driver gene and frameshift in translation of a passenger gene. One of the fusion genes produced a truncated cyclin H and an independent open reading frame of a novel protein whose function is not known. Two fusion events, however, produced chimera proteins that possibly retain at least partial function of both genes. One of these fusion products is N-terminus 703 amino acids of α-Mannosidase 2A (MAN2A1) fusing to the C-terminus 250 amino acids of FER, a Feline tyrosine kinase. The fusion protein retains the glycoside hydrolase domain but has its manosidase domain replaced with a tyrosine kinase domain from FER. Another fusion protein product produces a chimera of membrane-associated transporter protein (SLC45A20) and alpha-methylacyl-CoA racemase (AMACR). The chimera protein has 5 of its 10 transmembrane domains deleted from SLC45A2 and replaced with methyl-acyl CoA transferase domain from AMACR. Interestingly, both MAN2A1-FER and SLC45A2-AMACR fusions are in the trans-direction, eliminating the possibility of a fusion event from simple chromosome deletion or collapse of extremely large RNA transcript.",
                                "Fluorescence In Situ Hybridization Suggests Genome Recombination Underlying Fusion Gene Formation.",
                                "To investigate the mechanism of these fusion events, fluorescence in situ hybridization (FISH) was performed on prostate cancer tissues where the fusion gene was present. Using the probes surrounding MAN2A1 breakpoint, a physical separation of signals between 5′ and 3′ MAN2A1 in cancer cells containing the fusion gene was observed, in contrast to the overlapping nature of these signals in the wild type alleles in normal prostate epithelial cells (FIG. 2). Similar “break-apart” hybridization occurred in SLC45A2-AMACR positive prostate cancer samples (FIG. 2B). These findings indicate that MAN2A1-FER and SLC45A2-AMACR fusions are the result of chromosome recombination. Interestingly, in prostate cancer cells containing “break-apart” signals of MAN2A1, only 31% of the cells retained the 3′ end signal, suggesting that the recombination of genome DNA in most prostate cancer cells results in truncation of the C-terminus of MAN2A1. A similar “collateral loss” of the N-terminus of AMACR was found in prostate cancer cells expressing SLC45A2-AMACR fusion (29% retaining the N-terminus signal of AMACR). Other FISH analyses confirm that genome translocations occur in cancer cells expressing TRMT11-GRIK2, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM137-CCDC67, CCNH-C5orf30 and KDM4B-AC011523.2 fusion genes (FIGS. 2C-G). These fusion genes are either separated by a large segment of genome DNA (TRMT11-GRIK2, TMEM135-CCDC67, CCNH-C5orf30 and KDM4B-AC011523.2) or located in separate chromosomes (MTOR-TP53BP1 and LRRC59-FLJ60017). The joining signals of hybridizations in prostate cancer cells suggest that these fusion genes were relocated to juxtapose to their fusion partners. Finally, genomic breakpoints were identified in 3 fusion pair through Sanger sequencing of the cancer genomic DNA (CCNH-C5orf30, TMEM135-CCDC67 and LRRC59-FLJ60017) (FIG. 11).",
                                "Fusion Genes Association with Prostate Cancer Recurrence.",
                                "A genomic alteration in prostate cancer without clinical consequence is of limited significance. Therefore, the association of these fusion genes with prostate cancer progression was investigated in prostate cancer specimens obtained from 213 men and from entirely benign prostate tissues obtained from 10 organ donors free of urological disease aged 20 to 70. The prostate cancer samples were linked to the clinical outcomes after radical prostatectomy: those with no detectable prostate specific antigen (PSA) recurrence after a minimum of five years of observation, those whose clinical outcomes remain unknown and those who had an observed PSA recurrence within five years. For 179 of the 223 prostate cancer samples, clinical outcome data after radical prostatectomy were available, and 81 had no detectable prostate specific antigen (PSA) recurrence after a minimum of five years of follow-up, while 98 developed biochemical recurrence (defined as a measurable PSA ≥0.2 ng/ml). Only 7.4% (6/81) primary prostate cancers expressed one of the fusion genes in non-recurrent patients. In contrast, 52% (51/98) primary prostate cancers expressed at least one fusion in patients who developed recurrence (FIG. 3 and FIG. 7A). No fusion genes were detected in benign prostate tissues obtained from healthy organ donors (FIG. 7B). Three fusion events were observed exclusively in recurrent prostate cancer after radical prostatectomy (TRMT11-GRIK2, MTOR-TP53BP1 and LRRC59-FLJ60017; FIGS. 3A and B).",
                                "Fisher's exact test showed a significant difference in recurrent status between patients with at least one of the 8 fusion transcripts and those without (p=6.8×1016). In the combined UPMC, Stanford and Wisconsin data sets, 91% (69/76) of patients positive for one of the fusion transcripts experienced prostate cancer recurrence in 5 years after prostate resection. Based on the hypothesis that the presence of at least one of the 8 fusion transcripts would indicate a recurrence for a prostate cancer patient, a prostate cancer prediction model was built and tested, using 90 randomly selected prostate cancer samples from University of Pittsburgh Medical Center (training set). This training cohort yielded an accuracy of prostate cancer recurrence prediction of 71% with 89% specificity and 58% sensitivity (p<0.005) (FIG. 12A, Table 10). When this model was applied to a separate cohort of 89 samples (test set), the model correctly predicted recurrence in 70% of patients. To further validate this model, we tested its performance in a 30-patient (21 with qualified clinical follow-up) cohort from Stanford University Medical Center and a 36-patient (30 with qualified clinical follow-up) cohort from University of Wisconsin Madison Medical Center (FIG. 3, FIG. 8 and FIG. 9). Once again, the model correctly predicted recurrence with 76.2% accuracy and with 89% specificity and 67% sensitivity on the prostate cancer cohort from Stanford, and 80% accuracy and with 100% specificity and 63% sensitivity on the cohort from Wisconsin (Table 11).",
                                "Similar to the dichotomous nature of prostate cancer in general, recurrent prostate cancer can progress in an indolent or aggressive manner. A PSA doubling time (PSADT) less than four months after radical prostatectomy is strongly associated with the early development of metastatic disease and prostate cancer-specific death, whereas these events are rare and remote in men with a PSADT of greater than 15 months16, 17. Strong association was found between the fusion genes (e.g., TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67 and CCNH-C5orf30) with prostate cancer recurrence (p=4.2×10−9) and a PSADT less than four months (p=6×10−9). To examine whether these fusion gene events have prognostic value for prostate cancer clinical outcome, receiver operator curve (ROC) analyses with varying weights of fusion genes were performed. As shown in FIG. 3C, the panel of eight fusion genes correctly predicted 74.4% for PSA doubling time less than four months in the 90-sample training cohort, and 67% for prostate cancer recurrence. To optimize the prediction model, six fusion genes were selected for an improved association with disease-free survival after radical prostatectomy. When the same algorithm was applied to a separate 89-sample test set from University of Pittsburgh Medical Center and 21-sample cohort from Stanford University Medical Center, the prediction rate for PSADT<4 months was found to be 78% and 71%, respectively (FIG. 4B). As shown in FIG. 3D, 89.5% of patients had an observed disease recurrence within five years of radical prostatectomy if they carried any of the six fusion genes. In addition, and as shown in FIG. 4C, 84.2% of patients had an observed disease recurrence within five years of radical prostatectomy if they carried any of the eight fusion genes. No patient survived five years without recurrence if their primary prostate cancer contained a TRMT11-GRIK2 or MTOR-TP53BP1 fusion gene. In contrast, 68% patients were free of disease recurrence if any of the novel fusion genes were not detected in their primary prostate cancer. Similar findings were also identified in the Stanford cohort: 88.9% patients experienced recurrence of prostate cancer if they carried any fusion transcript, while 66.7% patients were free of the disease recurrence if they are negative.",
                                "The most frequent fusion events in prostate cancer are TRMT11-GRIK2 (7.9%, or 22/279) and SLC45A2-AMACR (7.2%, or 20/279) (FIGS. 3A, 7-9). TRMT11-GRIK2 fusion represents a giant truncation of TRMT11, a tRNA methyltransferase, and elimination of GRIK2, a glutamate receptor but reported to possess tumor suppressor activity18. Indeed, GRIK2 was not expressed in prostate cancer samples that contain TRMT11-GRIK2 fusions, while it was detected in organ donor prostate samples (FIG. 10). Only 4 of 14 samples with TRMT11-GRIK2 expressed full length non-fusion TRMT11. Thus, the fusion event of TRMT11-GRIK2 represents a loss of function instead of a gain.",
                                "Combining Detection of Fusion Transcripts and Clinical/Pathological Parameters Improved the Prediction Rate of Prostate Cancer Recurrence.",
                                "Prostate cancer samples with at least one fusion transcript correlate with more advanced stage of prostate cancer (p=0.004), Lymph node involvement status (P=0.005) and lower nomogram scores (p=0.0003) (Table 12). Gleason grading alone produced a prostate cancer recurrence prediction rate of 61.1%, with 85.7% specificity and 39.6% sensitivity in the 90-sample UPMC training cohort, when Gleason ≥8 was used as cutoff to predict prostate cancer recurrence. The Gleason model yielded prediction accuracy ranging from 57-60% in 3 separate testing cohorts (Tables 13 and 14). However, when fusion transcript status was combined with Gleason Grade >8, improvement of prediction was found for all 4 cohorts: 72% for the UPMC training cohort, 74% for the UPMC test cohort, 76% for the Stanford cohort and 90% for the Wisconsin cohort. ROC showed a significant larger AUC (area under the curve) (0.84 versus 0.67, P=6.6×10-7) and higher testing accuracy (77.7% versus 59.7%, P=0.0019) (FIG. 5A) when Gleason score was combined with detection of any of 8 fusion transcripts. Similarly, Nomogram prediction of prostate cancer recurrence has the best accuracy of 76% with 68.8% sensitivity and 83.3% specificity in the analysis of 90-sample UPMC training cohort (Table 15). When this model was applied to UPMC testing, Stanford and Wisconsin cohorts independently, the results showed that the prediction accuracy ranged from 60% to 75% among the 3 cohorts (Table 16). When Nomogram was combined with the status of 8 fusion transcripts using LDA technique to build a classifier, the accuracy of prediction improves to 81-83% among the testing cohorts (Table 16). ROC showed an increase of AUC from 0.76 to 0.87 (P=0.0001) and an improvement of accuracy from 69% to 81% (P=0.026, FIG. 5B). As a result, we concluded that classifier combining Nomogram and the 8 fusion gene panel generated the best prediction accuracy that outperforms each diagnostic tool alone."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "identify fusion genes by RNA and whole genome sequencing",
                                "filter out tissue-based fusion gene events",
                                "eliminate fusion genes with less than 20 kb between each element",
                                "validate fusion genes through RT-PCR and sequencing",
                                "describe fusion gene products",
                                "analyze fusion gene products with truncation of driver genes",
                                "analyze fusion gene products with frameshift in passenger genes",
                                "describe MAN2A1-FER fusion gene product",
                                "describe SLC45A2-AMACR fusion gene product",
                                "perform fluorescence in situ hybridization (FISH)",
                                "analyze FISH results for MAN2A1-FER fusion gene",
                                "analyze FISH results for SLC45A2-AMACR fusion gene",
                                "analyze FISH results for other fusion genes",
                                "identify genomic breakpoints through Sanger sequencing",
                                "associate fusion genes with prostate cancer recurrence",
                                "analyze clinical outcomes of prostate cancer patients",
                                "compare fusion gene expression in recurrent and non-recurrent patients",
                                "build and test a prostate cancer prediction model",
                                "validate the prediction model in separate cohorts",
                                "analyze association of fusion genes with PSA doubling time",
                                "perform receiver operator curve (ROC) analyses",
                                "optimize the prediction model with six fusion genes",
                                "analyze association of fusion genes with disease-free survival",
                                "discuss the most frequent fusion events in prostate cancer"
                            ],
                            "num_characters": 12516,
                            "outline_medium": [
                                "identify fusion genes by RNA and whole genome sequencing",
                                "filter out non-prostate cancer specific fusion genes",
                                "validate fusion genes through RT-PCR and sequencing",
                                "describe fusion gene products and their potential functions",
                                "perform fluorescence in situ hybridization to investigate fusion gene formation",
                                "analyze FISH results to suggest genome recombination underlying fusion gene formation",
                                "associate fusion genes with prostate cancer recurrence",
                                "analyze clinical outcomes of prostate cancer patients with and without fusion genes",
                                "build and test a prostate cancer prediction model using fusion gene data",
                                "validate the prediction model on separate cohorts",
                                "analyze the association of fusion genes with PSA doubling time and disease-free survival",
                                "combine detection of fusion transcripts with clinical/pathological parameters to improve prediction rate"
                            ],
                            "outline_short": [
                                "identify fusion genes in prostate cancer samples",
                                "validate fusion genes through RT-PCR and sequencing",
                                "analyze fusion gene structure and function",
                                "investigate mechanism of fusion gene formation using FISH",
                                "associate fusion genes with prostate cancer recurrence",
                                "build and test prediction model for prostate cancer recurrence"
                            ]
                        },
                        {
                            "title": "6.5. Discussion",
                            "paragraphs": [
                                "Transcriptome and whole genome sequencings revealed numerous fusion RNA transcripts occurring not just in prostate cancer but also in healthy organ donor prostate samples (Table 17). Some of these fusion events are verifiable by sequencing on the cDNA products. The functions of these new transcripts are not known. Since most of these chimeric RNA transcripts in healthy individuals are the splicing products of two adjacent genes, they are likely the new isoforms of the existing genes. These previously defined independent “genes” in the transcript could be one of the preferred spliced isoforms of the existing larger genes.",
                                "This analysis reveals significant number of cancer specific fusion gene events. These fusions are not detectable in either organ donor prostate or benign prostate tissues from prostate cancer patients. Most of these fusion transcripts appear to express in low abundance, with only an average 6.6 reads of these fusion transcripts detected in >1333× sequencing. Indeed, when the coverage was reduced to 600× in simulation studies, only MTOR-TP53BP1 was detected consistently. The characteristics of these fusion genes are that they either have a large distance between the joining genes or have trans-direction of fusion that could only occur when chromosome recombination happens. In either scenario, DNA alteration in genome level must be the underlying mechanism.",
                                "Although the association between the eight novel fusion transcripts and prostate cancer recurrence is striking, the biological roles of these fusion transcripts are not yet elucidated. Given the known function of the genes contributing to the fusion transcripts, their formation may have impact on several cell pathways such as RNA stability24 (TRMT11-GRIK2), protein glycosylation25 (MAN2A1-FER), cell cycle progression26,27, 28 (CCNH-C5orf50 and MTORTP53BP1), fibroblast growth factor nuclear import29 (LRRC59-FLJ60017), histone demethylation30 (KDM4B-AC011523.2), and fatty acid metabolism31 (SLC45A2-AMACR). Many of these pathways appear to be fundamental to cell growth and survival.",
                                "Two of the fusion genes are of particular interest: MAN2A1-FER and SLC45A2-AMACR. First, MAN2A1 is a mannosidase critical in glycosylation of proteins19. It is usually located in Golgi apparatus. The truncation in MAN2A1-FER replaces the mannosidase domain with a tyrosine kinase domain from FER20, while leaves the glycosyl transferase domain intact. The chimera protein likely loses the mannosidase function. The new kinase domain in MAN2A1-FER may confer the chimera protein a tyrosine kinase activity. Thus, the impact of this fusion gene could be profound: abnormal glycosylation and phosphorylation in hundreds of secreted or plasma membrane proteins. It may impact on cell-cell interactions and signal transduction, and generate a new immune response to the cancer cells. Second, AMACR is a racemase that catalyzes 2R stereoisomers of phytanic and pristanic acid to their S counterparts. AMACR is essential for β-oxidation of branch fatty acid in mitochondria. SLC45A2 is a transmembrane solute carrier known for its protective role in melanoma. SLC45A2-AMACR chimeric protein has 5 transmembrane domains of SLC45A2 truncated and replaced with a largely intact racemase. SLC45A2-AMACR also loses the mitochondria target site in AMACR. Presumably, the fusion protein would be located in the plasma membrane. It is of interest that all prostate cancer samples with SLC45A2-AMACR fusion proved highly aggressive. Identification of the signaling pathways of this chimeric protein may gain critical insight into the behavior of prostate cancer.",
                                "Even though the prevalence of each fusion transcript in prostate cancer samples is low (ranging from 2.9% to 7.9%), up to 60% of prostate cancers that later recurred and had short PSADT were positive for at least one of these fusion transcripts. The specificity of these fusion transcripts in predicting prostate cancer recurrence appears remarkably high, ranging from 89-100% among 4 separate prediction cohorts. There were no long term recurrence-free survivors if the primary tumor contained either TRMT11-GRIK2, MTOR-TP53BP1 or LRRC59-FLJ60017 fusion transcripts.",
                                "To our knowledge, this is the first report showing that a set of fusion genes is strongly associated with poor prognosis of prostate cancer. This discovery may have salient impact on clinical practice in light of the limit of serum PSA and Gleason's grading from biopsy samples in predicting prostate cancer clinical outcome. Detection of one of these prostate cancer recurrence association fusion genes in prostate cancer sample may warrant a more aggressive treatment regimen. The fusion RNA and chimera proteins validated in this study may lay down the foundation for future molecular targeting therapy for prostate cancer patients carrying these genes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "discuss the significance of fusion RNA transcripts",
                                "describe the characteristics of cancer-specific fusion genes",
                                "discuss the biological roles of fusion transcripts",
                                "analyze the impact of fusion genes on cell pathways",
                                "discuss the significance of MAN2A1-FER and SLC45A2-AMACR fusion genes",
                                "describe the potential effects of MAN2A1-FER fusion gene",
                                "describe the potential effects of SLC45A2-AMACR fusion gene",
                                "discuss the clinical implications of fusion gene detection",
                                "conclude the significance of fusion genes in prostate cancer prognosis"
                            ],
                            "num_characters": 4860,
                            "outline_medium": [
                                "discuss the significance of fusion genes in prostate cancer",
                                "speculate on the biological roles of fusion genes",
                                "highlight two fusion genes of particular interest: MAN2A1-FER and SLC45A2-AMACR",
                                "discuss the potential impact of fusion gene detection on clinical practice and future therapy"
                            ],
                            "outline_short": [
                                "discuss significance of fusion genes in prostate cancer",
                                "speculate on biological roles of fusion genes"
                            ]
                        },
                        {
                            "title": "6.6. References",
                            "paragraphs": [
                                "- 1. Jemal A, Bray F, Center M M, Ferlay J, Ward E, Forman D. Global\n  cancer statistics. *CA Cancer J Clin*. Feb. 4, 2012.\n- 2. Siegel R, Naishadham D, Jemal A. Cancer statistics, 2012. *CA\n  Cancer J Clin*. January-February 2012; 62(1):10-29.\n- 3. Li H, Durbin R. Fast and accurate short read alignment with\n  Burrows-Wheeler transform. *Bioinformatics*. Jul. 15, 2009;\n  25(14):1754-1760.\n- 4. Trapnell C, Roberts A, Goff L, et al. Differential gene and\n  transcript expression analysis of RNA-seq experiments with TopHat and\n  Cufflinks. *Nat Protoc*. March 2012; 7(3):562-578.\n- 5. Trapnell C, Williams B A, Pertea G, et al. Transcript assembly and\n  quantification by RNA-Seq reveals unannotated transcripts and isoform\n  switching during cell differentiation. *Nat Biotechnol*. May 2010;\n  28(5):511-515.\n- 6. Trapnell C, Pachter L, Salzberg S L. TopHat: discovering splice\n  junctions with RNA-Seq. *Bioinformatics*. May 1, 2009;\n  25(9):1105-1111.\n- 7. Edgren H, Murumagi A, Kangaspeska S, et al. Identification of\n  fusion genes in breast cancer by paired-end RNA-sequencing. *Genome\n  Biol.* 12(1):R6.\n- 8. Wei Zeng C-W F, Stefan Muller Arisona, Huamin Qu. Visualizing\n  Interchange Patterns in Massive Movement Data. *Computer Graphics\n  Forum.* 2013(32):271-280.\n- 9. Luo R I, Yu Y P, Cieply K, et al. Gene expression analysis of\n  prostate cancers. *Mol Carcinog*. January 2002; 33(1):25-35.\n- 10. Yu Y P, Landsittel D, Jing L, et al. Gene expression alterations\n  in prostate cancer predicting tumor aggression and preceding\n  development of malignancy. *J Clin Oncol*. Jul. 15, 2004;\n  22(14):2790-2799.\n- 11. Ren B, Yu G, Tseng G C, et al. MCMI amplification and\n  overexpression are associated with prostate cancer progression.\n  *Oncogene*. Feb. 16, 2006; 25(7):1090-1098.\n- 12. Yu Y P, Yu G, Tseng G, et al. Glutathione peroxidase 3, deleted or\n  methylated in prostate cancer, suppresses prostate cancer growth and\n  metastasis. *Cancer Res*. Sep. 1, 2007; 67(17):8043-8050.\n- 13. Tomlins S A, Rhodes D R, Perner S, et al. Recurrent fusion of\n  TMPRSS2 and ETS transcription factor genes in prostate cancer.\n  *Science*. Oct. 28, 2005; 310(5748):644-648.\n- 14. Berger M F, Lawrence M S, Demichelis F, et al. The genomic\n  complexity of primary human prostate cancer. *Nature*. February 10;\n  470(7333):214-220.\n- 15. Baca S C, Prandi D, Lawrence M S, et al. Punctuated evolution of\n  prostate cancer genomes. *Cell*. April 25; 153(3):666-677.\n- 16. Freedland S J, Humphreys E B, Mangold L A, et al. Death in\n  patients with recurrent prostate cancer after radical prostatectomy:\n  prostate-specific antigen doubling time subgroups and their associated\n  contributions to all-cause mortality. *J Clin Oncol*. May 1, 2007;\n  25(13):1765-1771.\n- 17. Antonarakis E S, Zahurak M L, Lin J, Keizman D, Carducci M A,\n  Eisenberger M A. Changes in PSA kinetics predict metastasis-free\n  survival in men with PSA-recurrent prostate cancer treated with\n  nonhormonal agents: combined analysis of 4 phase II trials. *Cancer*.\n  March 15; 118(6):1533-1542.\n- 18. Sinclair P B, Sorour A, Martineau M, et al. A fluorescence in situ\n  hybridization map of 6q deletions in acute lymphocytic leukemia:\n  identification and analysis of a candidate tumor suppressor gene.\n  *Cancer Res*. Jun. 15, 2004; 64(12):4089-4098.\n- 19. Misago M, Liao Y F, Kudo S, et al. Molecular cloning and\n  expression of cDNAs encoding human alpha-mannosidase II and a\n  previously unrecognized alpha-mannosidase IIx isozyme. *Proc Natl Acad\n  Sci USA*. Dec. 5, 1995; 92(25):11766-11770.\n- 20. Krolewski J J, Lee R, Eddy R, Shows T B, Dalla-Favera R.\n  Identification and chromosomal mapping of new human tyrosine kinase\n  genes. *Oncogene*. March 1990; 5(3):277-282.\n- 21. Prakash T, Sharma V K, Adati N, Ozawa R, Kumar N, Nishida Y,\n  Fujikake T, Takeda T, Taylor T D: Expression of conjoined genes:\n  another mechanism for gene regulation in eukaryotes, PLoS One 2010,\n  5:e13284.\n- 22. Youden W J: Index for rating diagnostic tests, Cancer 1950,\n  3:32-35.\n- 23. Robin X, Turck N, Hainard A, Tiberti N, Lisacek F, Sanchez J C,\n  Muller M: pROC: an open-source package for R and S+ to analyze and\n  compare ROC curves, BMC Bioinformatics 12:77.\n- 24. Towns W L, Begley T J: Transfer RNA methytransferases and their\n  corresponding modifications in budding yeast and humans: activities,\n  predications, and potential roles in human health, DNA Cell Biol 2012,\n  31:434-454.\n- 25. Misago M, Liao Y F, Kudo S, Eto S, Mattei M G, Moremen K W, Fukuda\n  M N: Molecular cloning and expression of cDNAs encoding human\n  alpha-mannosidase II and a previously unrecognized alphamannosidase\n  IIx isozyme, Proc Natl Acad Sci USA 1995, 92:11766-11770.\n- 26. Fisher R P, Morgan D O: A novel cyclin associates with M015/CDK7\n  to form the CDK-activating kinase, Cell 1994, 78:713-724.\n- 27. Yang H, Rudge D G, Koos J D, Vaidialingam B, Yang H J, Pavletich N\n  P: mTOR kinase structure, mechanism and regulation, Nature 2013,\n  497:217-223.\n- 28. Wang H, Luo K, Tan L Z, Ren B G, Gu L Q, Michalopoulos G, Luo J H,\n  Yu Y P: p53-induced gene 3 mediates cell death induced by glutathione\n  peroxidase 3, J Biol Chem 2012, 287:16890-16902.\n- 29. Zhen Y, Sorensen V, Skjerpen C S, Haugsten E M, Jin Y, Walchli S,\n  Olsnes S, Wiedlocha A: Nuclear import of exogenous FGF1 requires the\n  ER-protein LRRC59 and the importins Kpnalphal and Kpnbeta1, Traffic\n  2012, 13:650-664.\n- 30. Yang J, Jubb A M, Pike L, Buffa F M, Turley H, Baban D, Leek R,\n  Gatter K C, Ragoussis J, Harris A L: The histone demethylase JMJD2B is\n  regulated by estrogen receptor alpha and hypoxia, and is a key\n  mediator of estrogen induced growth, Cancer Res 70:6456-6466.\n- 31. Savolainen K, Kotti T J, Schmitz W, Savolainen T I, Sormunen R T,\n  Ilves M, Vainio S J, Conzelmann E, Hiltunen J K: A mouse model for\n  alpha-methylacyl-CoA racemase deficiency: adjustment of bile acid\n  synthesis and intolerance to dietary methyl-branched lipids, Hum Mol\n  Genet 2004, 13:955-965."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list cancer statistics",
                                "introduce RNA-seq analysis",
                                "describe TopHat and Cufflinks",
                                "discuss transcript assembly and quantification",
                                "identify fusion genes in breast cancer",
                                "visualize interchange patterns in movement data",
                                "analyze gene expression in prostate cancer",
                                "discuss MCMI amplification and overexpression",
                                "describe glutathione peroxidase 3 in prostate cancer",
                                "identify recurrent fusion of TMPRSS2 and ETS genes",
                                "discuss genomic complexity of primary human prostate cancer",
                                "list various other references"
                            ],
                            "num_characters": 6015,
                            "outline_medium": [
                                "list cancer statistics",
                                "describe RNA-seq analysis",
                                "introduce gene expression analysis",
                                "discuss prostate cancer research",
                                "summarize bioinformatics tools",
                                "provide miscellaneous references"
                            ],
                            "outline_short": [
                                "list cancer statistics references",
                                "list bioinformatics and genomics references",
                                "list molecular biology and cancer research references"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "7. EXAMPLE 2: PTEN-NOLC1 FUSION GENES",
                    "paragraphs": [
                        "Transcriptome sequencing was performed on 15 samples of prostate cancer from patients who experienced prostate cancer recurrence after radical prostatectomy. One of the candidate fusion gene transcripts is PTEN-NOLC1. To validate the fusion transcript, RT-PCRs using primers specific for PTEN-NOLC1 were performed on the prostate cancer sample that was positive for the fusion transcript, using the following primers:",
                        "under the following conditions: 94° C. for 5′, then 30 cycles of 94° C. for 10 seconds, 61° C. for 1 min and 72° C. for 3 min, followed by 10 min at 72° C. for extension. A 158 bp PCR product was generated. The PCR product was subsequently sequenced. PTEN-NOLC1 fusion transcript was confirmed (FIG. 13A). To investigate the mechanism of PTEN-NOLC1 fusion transcript, Fluorescence In Situ Hybridizations (FISH) were performed using probes corresponding to 5′-end of PTEN genome (RP11-124B18) and 3′-end of NOLC1 genome (CTD-3082D22), respectively. In normal prostate epithelial cells, these 2 probes were hybridized to distinct separate locations in the genome due to more than 14 megabase separation of these 2 genes (FIG. 13B). In contrast, these two signals appeared to merge to generate an overlapped signal in prostate cancer genome from a sample that is positive for PTEN-NOLC1 fusion transcript. Interestingly, non-fusion PTEN was virtually undetectable in this prostate cancer sample, suggesting that PTEN-NOLC1 fusion was accompanied with PTEN deletion in another allele. These results suggest that genome rearrangement is the underlying mechanism for PTEN-NOLC1 transcription. To investigate the clinical significance of PTEN-NOLC1 fusion, 215 prostate cancer samples were analyzed for PTEN-NOLC1 expression. Over 14% (31/215) prostate cancer samples were found to express PTEN-NOLC1 (FIG. 13C). Among the positive samples, 77% (24/31, p=0.03) patients experienced prostate cancer recurrence. This indicates that PTEN-NOLC1 fusion is associated with poor clinical outcome. Interestingly, our analysis of lung adenocarcinoma, Glioblastoma multiforme, and hepatocellular carcinoma indicates that significant number of these cancers are also positive for PTEN-NOLC1 fusion: 35/38 glioblastoma multiformis, 3/20 hepatocellular carcinoma and 29/40 lung adenocarcinoma. These results suggest that PTEN-NOLC1 fusion may have broad implication for cancer development.",
                        "Expression of Pten-NOLC1 in NIH3T3 and PC3 Cells Increased Cell Growth.",
                        "To investigate whether PTEN-NOLC1 has pro-growth activity, we ligated PTEN-NOLC1 cDNA into pCDNA-FLAG vector to create pCDNA4-PTEN-NOLC1-FLAG. Subsequently, we transfected NIH3T3 and PC3 cells (a human prostate cancer cell line) with pCDNA4-PTEN-NOLC1-FLAG/pCDNA6. As shown in FIG. 27B, induction of NIH3T3 and PC3 cells produces 10.3 (p<0.01) and 3.1 fold (p<0.01) increase of cell growth, respectively. These were accompanied with 2.3 fold (p<0.01) and 2.7 fold (p<0.001) increase of cell entry into S-phase in NIH3T3 and PC3 cells in cell cycle analysis (FIG. 27C). Colony formation analyses indicate that expression of PTEN-NOLC1 produced 2.2 fold (p<0.001) higher numbers of colonies from single cell suspension for NIH3T3 cells than the un-induced controls and 2.7 fold (p<0.01) more colonies for PC3 cells when they were induced to express PTEN-NOLC1-FLAG (FIG. 27D).",
                        "To investigate the subcellular localization of PTEN-NOLC1, NIH3T3 cells were transformed with pCDNA4-PTEN-NOLC1-FLAG/pCDNA6 were induced with tetracycline to express PTEN-NOLC1-FLAG. As shown in FIG. 27A, most PTEN-NOLC1-FLAG was localized in the nucleus of the cells. This is contrary to cytoplasmic localization of PTEN. PTEN-NOLC1-FLAG was also detected in purified nucleus fraction. Without being bound to a particular theory, these results indicate that fusion formation with NOLC1 alters the subcellular localization of PTEN-NOLC1 from cytoplasm to nucleus."
                    ],
                    "subsections": [
                        {
                            "title": "8. EXAMPLE 3: THERAPEUTIC TARGETING AT FUSION TRANSCRIPT CONTAINING CHIMERA PROTEIN MAN2A1-FER",
                            "paragraphs": [
                                "**8.1. Results**",
                                "MAN2A1-FER Likely Produces Activated FER Kinase.",
                                "MAN2A1-FER was present in prostate cancer, hepatocellular carcinoma and Glioblastoma multiforme. MAN2A1 is a Golgi enzyme required for conversion of high mannose to complex type structure of N-glycan for mature glycosylation of a membrane protein1,2. Little is known about its relation with human malignancies. On the other hand, FER, a tyrosine kinase, is a well-documented oncogene3, 4. Several studies showed that FER activate androgen receptor (AR) by phosphorylating Tyr223 in AR5, and is essential for NFκB activation of EGFR6. Some studies indicate that FER is an essential component of stem cell tyrosine kinase 1 (STK1)6 and mast cell growth factor receptor (kit)7,8 signaling. Over-expression of FER is associated with poor clinical outcomes of breast cancer9, renal cell carcinoma10, 11, non-small cell lung cancer12,13 and hepatocellular carcinoma14. The N-termini of many tyrosine protein kinases serve to constrain the kinase activity and are regulated by other molecules. Domains of some N-termini bind and select specific targets for the kinases. Removal of the N-terminus from a protein kinase may produce constitutively activated kinase activity that may alter the signaling pathways and generates uninhibited cell growth. The best analogy to MAN2A1-FER is BCR-Abl. When c-Abl is intact, its kinase activity is constrained. Removal of SH3 domain in c-Abl in the BCR-Abl fusion protein converts the mutant Abl tyrosine kinase into an oncogene that plays key role in developing acute lymphoblastic leukemia and chronic myelogenous leukemia. Wild type FER with intact SH2 domain is inactive in kinase activity when assayed in cell free system. In the fusion gene MAN2A1-FER, the N-terminus of FER suffers a loss of SH2 and FHC domain (FIG. 14). These domains were replaced with glycoside hydrolase and α-mannosidase middle domain from MAN2A1. As a result, the kinase activity may be activated and substrate targets of FER tyrosine kinase may be altered.",
                                "MAN2A1-FER Expression Accelerates Cell Cycle Entry into S Phase and Increased Tyrosine Phosphorylation of EGFR in the Absence of EGFR Ligand.",
                                "To investigate whether MAN2A1-FER chimera protein is expressed in prostate cancer samples that contain MAN2A1-FER transcript, protein extracts from 5 prostate cancer samples positive for MAN2A1-FER RNA were analyzed using antibodies specific for MAN2A1 or FER. These results showed that the samples expressed a 115 Kd protein recognized by both MAN2A1 and FER antibodies (FIG. 22). This protein is not detected in prostate cancer samples that are negative for MAN2A1-FER transcript.",
                                "When MAN2A1-FER was forced to express in RWPE1 cells, a non-transformed prostate epithelial cell line, it increase the proportion of cells in S phase by 4.6-5 fold (p<0.001). MAN2A1-FER was determined to be co-localized with Golgi protein in both immunofluorescence and sucrose gradient analysis, supporting the notion that MAN2A1-FER is primarily located in Golgi apparatus. Interestingly, expression of MAN2A1-FER increased tyrosine phosphorylation of EGFR in RWPE1 cells in the absence of EGFR ligand, suggesting that MAN2A1-FER may ectopically phosphorylate the EGFR extracellular domain. Thus, MAN2A1-FER may function as a transforming oncogene and possess intrinsic tyrosine kinase activity derived from its FER kinase domain. Not to be limited to any particular theory, the kinase domain of MAN2A1-FER may be the driver of its oncogenic activity through ectopic phosphorylation of transmembrane proteins such as EGFR.",
                                "Therapeutic Targeting at MAN2A1-FER Results in Specific Cell Death Prostate Cancer Cells Expressing MAN2A1-FER.",
                                "Based on the analyses above, we reason that the altered subcellular location and substrate specificity of FER kinase will create oncogenic activity of MAN2A1-FER. A large part of this oncogenic activity results from ectopic phosphorylation and activation of EGFR and its down-stream signaling pathways. Thus, we can intervene and disrupt the oncogenic pathways of MAN2A1-FER using 2 different approaches. The first approach is inhibiting the kinase activity of MAN2A1-FER by targeting MAN2A1-FER proteins using small molecules that can inhibit tyrosine kinase. Several small molecules specific for FER such as diaminopyrimidine TAE684, and pyrazologyrididines WZ-4-49-8 and WZ-4-49-10, generic ALK/FER inhibitor crisotinib are available. Among these compound inhibitors, Crisotinib has been approved by FDA to treat advanced and metastatic non-small cell lung cancer positive for EML4-ALK, another tyrosine kinase fusion protein. The drug has been shown to be able to shrink tumor mass by at least 30% in most patients.",
                                "To investigate whether Crisotinib is also effective against MAN2A1-FER positive cancer cells, we transformed human prostate cancer cell line PC3 with pCDNA4-MAN2A1-FER-FLAG/pCDNA6 to express MAN2A1-FER fusion protein. These cells were treated with low dosage of Crisotinib for 24 hours. As shown in FIG. 22, the treatment resulted in 31% cell death in MAN2A1-FER expressing cells, while it hardly killed the same type of cancer cells that do not express this fusion protein. A dosage effect analysis showed that expression of MAN2A1-FER lowers the cancer killing EC so by at least 2 magnitudes (˜100 fold). Thus, it is reasonable to treat MAN2A1-FER positive prostate cancer with Crisotinib at a dosage that is not harmful to normal human cells.",
                                "The second approach is to target EGFR activation by EGFR inhibitors. These include erlotinib, cetuximab, bevacizumab, canertinib and bortezomib. Many of these drugs were FDA approved and is widely used in a variety of human solid tumors. To interrogate the effectiveness of EGFR activation interruption in treating prostate cancer, we treated MAN2A1-FER transformed PC3 cells with canertinib. As shown in FIG. 23, the treatment also produced 34% cell death of cells expressing MAN2A1-FER. In contrast, the effect on cells not expressing MAN2A1-FER (Tet−) was minimal: The cell death level is similar to those untreated controls. These results suggest EGFR activation is one of the critical pathways for MAN2A1-FER oncogenic activity. Interesting, when we tried to intercept the down-streaming signaling molecule of EGFR, MEK, using an experimental drug AZD6244, the differential killing effect was largely moderated and vanished (data not shown). It suggests that other signaling pathways for EGFR may bypass MEK signaling.",
                                "**8.2. References**",
                                "- 1. Moremen K W, Robbins P W: Isolation, characterization, and\n  expression of cDNAs encoding murine alpha-mannosidase II, a Golgi\n  enzyme that controls conversion of high mannose to complex N-glycans,\n  J Cell Biol 1991, 115:1521-1534.\n- 2. Misago M, Liao Y F, Kudo S, Eto S, Mattei M G, Moremen K W, Fukuda\n  M N: Molecular cloning and expression of cDNAs encoding human\n  alpha-mannosidase II and a previously unrecognized alpha-mannosidase\n  IIx isozyme, Proc Natl Acad Sci USA 1995, 92:11766-11770.\n- 3. Hao Q L, Heisterkamp N, Groffen J: Isolation and sequence analysis\n  of a novel human tyrosine kinase gene, Mol Cell Biol 1989, 9:1587-1593\n- 4. Krolewski J J, Lee R, Eddy R, Shows T B, Dalla-Favera R:\n  Identification and chromosomal mapping of new human tyrosine kinase\n  genes, Oncogene 1990, 5:277-282.\n- 5. Rocha J, Zouanat F Z, Zoubeidi A, Hamel L, Benidir T, Scarlata E,\n  Brimo F, Aprikian A, Chevalier S: The Fer tyrosine kinase acts as a\n  downstream interleukin-6 effector of androgen receptor activation in\n  prostate cancer, Mol Cell Endocrinol 381:140-149.\n- 6. Guo C, Stark G R: FER tyrosine kinase (FER) overexpression mediates\n  resistance to quinacrine through EGF-dependent activation of\n  NF-kappaB, Proc Natl Acad Sci USA 108:7968-7973.\n- 7. Kwok E, Everingham S, Zhang S, Greer P A, Allingham J S, Craig A W:\n  FES kinase promotes mast cell recruitment to mammary tumors via the\n  stem cell factor/KIT receptor signaling axis, Mol Cancer Res\n  10:881-891.\n- 8. Voisset E, Lopez S, Dubreuil P, De Sepulveda P: The tyrosine kinase\n  FES is an essential effector of KITD816V proliferation signal, Blood\n  2007, 110:2593-2599.\n- 9. Ivanova I A, Vermeulen J F, Ercan C, Houthuijzen J M, Saig F A,\n  Vlug E J, van der Wall E, van Diest P J, Vooijs M, Derksen P W: FER\n  kinase promotes breast cancer metastasis by regulating alpha6- and\n  beta1-integrin-dependent cell adhesion and anoikis resistance,\n  Oncogene 32:5582-5592.\n- 10. Miyata Y, Kanda S, Sakai H, Greer P A: Feline sarcoma-related\n  protein expression correlates with malignant aggressiveness and poor\n  prognosis in renal cell carcinoma, Cancer Sci 104:681-686.\n- 11. Wei C, Wu S, Li X, Wang Y, Ren R, Lai Y, Ye J: High expression of\n  FER tyrosine kinase predicts poor prognosis in clear cell renal cell\n  carcinoma, Oncol Lett 5:473-478.\n- 12. Ahn J, Truesdell P, Meens J, Kadish C, Yang X, Boag A H, Craig A\n  W: Fer protein-tyrosine kinase promotes lung adenocarcinoma cell\n  invasion and tumor metastasis, Mol Cancer Res 11:952-963.\n- 13. Kawakami M, Morita S, Sunohara M, Amano Y, Ishikawa R, Watanabe K,\n  Hamano E, Ohishi N, Nakajima J, Yatomi Y, Nagase T, Fukayama M, Takai\n  D: FER overexpression is associated with poor postoperative prognosis\n  and cancer-cell survival in non-small cell lung cancer, Int J Clin Exp\n  Pathol 6:598-612.\n- 14. Li H, Ren Z, Kang X, Zhang L, Li X, Wang Y, Xue T, Shen Y, Liu Y:\n  Identification of tyrosine-phosphorylated proteins associated with\n  metastasis and functional analysis of FER in human hepatocellular\n  carcinoma cells, BMC Cancer 2009, 9:366.\n- 15. Zha S, Ferdinandusse S, Denis S, Wanders R J, Ewing C M, Luo J, De\n  Marzo A M, Isaacs W B: Alpha-methylacyl-CoA racemase as an\n  androgen-independent growth modifier in prostate cancer, Cancer Res\n  2003, 63:7365-7376.\n- 16. Krastev D B, Slabicki M, Paszkowski-Rogacz M, Hubner N C,\n  Junqueira M, Shevchenko A, Mann M, Neugebauer K M, Buchholz F: A\n  systematic RNAi synthetic interaction screen reveals a link between\n  p53 and snoRNP assembly, Nature cell biology 2011, 13:809-818."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe MAN2A1-FER fusion protein",
                                "analyze expression of MAN2A1-FER in prostate cancer samples",
                                "investigate kinase activity of MAN2A1-FER",
                                "analyze cell cycle entry and tyrosine phosphorylation of EGFR",
                                "target MAN2A1-FER using small molecule inhibitors",
                                "analyze cell death in MAN2A1-FER expressing cells",
                                "analyze dosage effect of Crisotinib",
                                "target EGFR activation using EGFR inhibitors",
                                "analyze cell death in MAN2A1-FER expressing cells",
                                "analyze effect on cells not expressing MAN2A1-FER",
                                "intercept down-streaming signaling molecule of EGFR",
                                "analyze differential killing effect",
                                "describe FER tyrosine kinase",
                                "describe alpha-mannosidase II",
                                "describe EGFR activation",
                                "describe MEK signaling",
                                "describe FES kinase",
                                "describe KIT receptor signaling",
                                "describe stem cell tyrosine kinase 1 (STK1)",
                                "describe mast cell growth factor receptor (kit) signaling"
                            ],
                            "num_characters": 10101,
                            "outline_medium": [
                                "describe MAN2A1-FER fusion protein",
                                "analyze expression of MAN2A1-FER in prostate cancer samples",
                                "investigate effect of MAN2A1-FER on cell cycle entry",
                                "analyze tyrosine phosphorylation of EGFR",
                                "describe therapeutic targeting of MAN2A1-FER",
                                "test Crisotinib on MAN2A1-FER expressing cells",
                                "analyze effect of EGFR inhibitors on MAN2A1-FER expressing cells",
                                "discuss MEK signaling in MAN2A1-FER oncogenic activity",
                                "provide references for MAN2A1-FER",
                                "describe additional references"
                            ],
                            "outline_short": [
                                "investigate MAN2A1-FER expression and localization",
                                "analyze MAN2A1-FER's effect on cell cycle and EGFR phosphorylation",
                                "target MAN2A1-FER with Crisotinib and EGFR inhibitors",
                                "investigate therapeutic effects of MAN2A1-FER targeting",
                                "discuss implications of MAN2A1-FER targeting for cancer treatment"
                            ]
                        },
                        {
                            "title": "9. EXAMPLE 4. ELIMINATION OF CANCER CELLS POSITIVE FOR FUSION TRANSCRIPTS THROUGH GENOME EDITING",
                            "paragraphs": [
                                "Recent advances in genome editing using ZFN and CAS9 has made it possible to target a specific cancer genome sequence that is not present in normal cells. The mechanism of formation of fusion transcript is chromosome rearrangement. As a result, breakpoints in the chromosome are readily identified in a cancer genome. Normal cells do not have similar chromosome rearrangements, and are thus negative for the breakpoint. Targeting a specific breakpoint in the prostate cancer genome will likely generate an effective treatment for prostate cancer. Since the genomic breakpoint of CCNH-C5ORF30 and TMEM135-CCDC67 has been identified, genome editing technology targeting at the breakpoint of CCNH-C5orf30 or TMEM135-CCDC67 can be used to kill cancer cells.",
                                "As shown in FIG. 15, genome recombination in prostate cancer case 3T produced a breakpoint in chromosome 5 that connect intron 6 of CCNH with intron 1 of C5orf30. The resulting breaking point is unique in prostate cancer case 3T. The breakpoint is positive in most prostate cancer tissues but negative for normal tissues from this patient. A guide RNA (gRNA) of 23 bp including protospacer adjacent motif (PAM) sequence is designed specific for the breakpoint region. The DNA sequence corresponding to this target sequence is artificially ligated into vector containing the remainder of gRNA and CAS9. This sequence is recombined and packaged into recombinant virus (Adenovirus or lenti-virus). A promoterless Herpes Simplex Virus Type 1 (HSV-1) thymidine kinase is constructed into a shuttle vector for adenovirus along with splice tag sequence from intron/exon juncture of CCNH exon 7. A 500 bp sequence surrounding the CCNH-C5orf30 breakpoint from each side is also ligated into the shuttle vector in order to produce efficient homologous recombination to complete the donor DNA construction. The vector is recombined and packaged into AdEasy to generate recombinant viruses. These viruses are administered to patients or animals that have cancer positive for CCNH-C5orf30 fusion transcript. This leads to insertion of donor DNA into the target site (fusion breakpoint). Since HSV-1 TK in recombinant virus is promoterless, no transcription will occur if HSV-1 TK cDNA does not integrate into a transcription active genome. However, transcription of HSV-1 TK is active if HSV-1 TK is integrated into the target site of CCNH-C5orf30, since this transcript is readily detectable in the prostate cancer sample of this patient. When patient 3T takes ganciclovir or its oral homologue valganciclovir, the homologue is readily converted to triphosphate guanine analogue by HSV-1 TK and incorporated into the genomes of cancer cells. This leads to stoppage of DNA elongation in cells that are positive for CCNH-C5orf30. Since mammalian TK does not phosphorylate ganciclovir, ganciclovir is not converted to active (triphosphate) form in cells that are negative for HSV-1 TK protein. Thus, the impact of ganciclovir on normal cells is minimized.",
                                "The technique described above was applied to cells having the TMEM135-CCDC67 breakpoint. Since none of the fusion genes identified so far was present in prostate cancer cell lines, a TMEM135-CCDC67 genome breakpoint was created that is identical to the prostate cancer sample were analyzed. The expression of the TMEM135-CCDC67 breakpoint was driven by a CMV promoter. Subsequently, a donor DNA was constructed that encompassed HSV-1 TK and the splicing sites of TMEM135 exon 14. When this donor DNA was co-transfected with a vector that expresses gRNA targeting at the TMEM135-CCDC67 breakpoint into PC3 cells containing this genome breakpoint, integration of TK into the genome was identified (FIG. 28A). In contrast, when the same pairs of DNA were transfected into cells that do not contain the breakpoint, no integration of TK was found (data not shown). Treatment of PC3 cells without TMEM135-CCDC67 breakpoint has minimal cell death, while the same treatment of PC3 cells containing the breakpoint with ganciclovir resulted in 8 fold increase of cell death (FIG. 28B). This is remarkable in considering only 5-10% transfection efficiency using conventional liposome method. Without being limited to a particular theory, these data suggest that almost all the cells receiving the DNA died when treated with ganciclovir, if they contain the breakpoint. In light of this promising result, both TMEM135-CCDC67-TK cassette and NicKase-gRNATMEM135-CCDC67-BrkPt DNA are now in the process of packaging into Adenovirus. We will infect the recombinant virus into these cells in the future experiments. This will dramatically improve the delivery efficiency in the subsequent animal study and probably human."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe genome editing using ZFN and CAS9",
                                "target specific breakpoint in prostate cancer genome",
                                "design guide RNA (gRNA) specific for breakpoint region",
                                "construct donor DNA for homologous recombination",
                                "package recombinant virus for administration",
                                "describe mechanism of HSV-1 TK",
                                "analyze cell death in cells positive for CCNH-C5orf30",
                                "apply technique to cells having TMEM135-CCDC67 breakpoint",
                                "analyze cell death in cells positive for TMEM135-CCDC67"
                            ],
                            "num_characters": 4702,
                            "outline_medium": [
                                "describe genome editing technology",
                                "design guide RNA for breakpoint region",
                                "construct donor DNA for genome editing",
                                "test genome editing on cells with CCNH-C5orf30 and TMEM135-CCDC67 breakpoints"
                            ],
                            "outline_short": [
                                "design genome editing strategy targeting CCNH-C5orf30 and TMEM135-CCDC67 breakpoints",
                                "test genome editing strategy in cells with TMEM135-CCDC67 breakpoint"
                            ]
                        },
                        {
                            "title": "10. EXAMPLE 5: NOVEL FUSION TRANSCRIPTS ASSOCIATE WITH PROGRESSIVE PROSTATE CANCER",
                            "paragraphs": [
                                "The analysis of an additional 68 prostate cancer samples by transcriptome sequencing leads to the discovery of 5 additional novel fusion transcripts present in prostate cancer. It is noted that significant number of prostate cancers contained no fusion transcripts in RNA sequencing. Even though extensive transcriptome sequencings were performed on 30 prostate cancer samples that prove non-recurrent for extended period of time, no viable fusion transcripts were identified in these samples using fusion catcher software. These 5 fusion transcripts were validated through Sanger sequencing of the RT-PCR products (FIG. 16). The following primers were used:",
                                "**10.1. Results**",
                                "ZMPSTE24-ZMYM4 Fusion Genes.",
                                "This fusion transcript was discovered in a prostate cancer sample from a patient who experienced prostate cancer recurrence 1.8 month after radical prostatectomy. The patient's pelvic lymph nodes were positive for metastatic prostate cancer, while his primary cancer sample was graded with Gleason 7. In addition to ZMPSTE24-ZMYM4, his prostate cancer sample was also positive for CCNH-c5orf30. ZMPSTE24 is a zinc-metalloproteinase involved in post-translational proteolytic cleavage that coverts farnesylated prelamin A to form mature lamin A. Mutation of this protein is associated with mandibuloacral dysplasia1. It was suggested that ZMPSTE24 may be a mediator promoting invasive prostate cancer2. ZMYM4 is an anti-apoptotic gene whose function domain is located in the 3′ untranslated region. Expression of ZMYM4 3′ UTR has been shown to resist cell death induced by interferon γ through inhibition of AUF1 activity3. The fusion formation between ZMPSTE24 and ZMYM4 produces a truncation of 159 amino acids from the C-terminus of ZMPSTE24 and 1315 amino acids from the N-terminus of ZMYM4. Motif analysis suggests that ZMPSTE24-ZMYM4 fusion will delete about 50% of the peptidase domain from ZMPSTE24 and remove all zinc fingers from ZMYM4, but leave ZUF3504 (domain of unknown function) and apoptosis inhibitor domain intact (FIG. 17). Thus, ZMPSTE24-ZMYM4 fusion may provide cancer cells an important tool to resist program cell death.",
                                "CLTC-ETV1 Fusion Genes.",
                                "CLTC-ETV1 was discovered in a prostate cancer sample that has Gleason's grade of 7. The patient experienced prostate cancer recurrence 22 months after radical prostatectomy, and had been rapidly progressing. In addition to CLTC-ETV1, the prostate cancer sample was also positive for TRMT11-GRIK2 fusion. CLTC is a major protein component of coated vesicles and coated pits, and is universally expressed. Its presence is essential for cell shape formation and cell motility. ETV1 is a transcription factor that was shown to over-express in prostate cancer. ETV1 had been shown to partner at least 12 different head genes in prostate cancer and Ewing's sarcoma4,5. However, most of these fusions do not produce a functional transcription factor from ETV1 due to frameshift in the fusion or few amino acids left after the fusion. In contrary, CLTC-ETV1 fusion preserves a largely intact transcription domain in ETV1, and probably represents the first example of potential functional ETV1 fusion in prostate cancer. CLTC-ETV1 fusion deletes 3 clathrin domains from CLTC (FIG. 18). This may impair the function of CLTC for coated pit formation. ETV1 has been shown to be oncogenic in several organ systems6-8. The regulatory domain is located in the N-terminus. The regulatory domain contains MAPK phosphorylation site as well as ubiquitination site by COP19,10. Truncation in the N-terminus of ETV1 eliminates all these regulatory elements from ETV1. Thus, the protein level CLTC-ETV1 may be increased due to less degradation and activity of ETV1 may become constitutive due to the lack of regulatory constraint in the fusion protein. Since ETV1 has been shown to overexpress in many prostate cancers, CLTC-ETV1 fusion might be the underlying mechanism.",
                                "ACPP-SEC13 Fusion Genes.",
                                "The ACPP-SEC13 fusion transcript was discovered in a prostate cancer sample from patients who experienced recurrence but also had a slow rise of PSA with doubling time more than 20 months. The Gleason's grade is 7. The pathological examination reveals invasion into seminal vesicle by prostate cancer cells. ACPP is prostate specific acid phosphatase and is abundantly expressed in prostate acinar cells, while SEC13 belongs to the family of WD-repeat proteins, and is required for vesicle biogenesis from endoplasmic reticulum11. Recent studies suggest that SEC13 is a subunit of GATOR2, an octomeric GTPase activating protein. Inhibition of SEC13 suppresses mTOR activation12. In ACPP-SEC13 fusion, only the N-terminus 72 amino acids of ACPP is preserved, and over ⅔ of the phosphatase domain is truncated, while SEC13 loses 196 amino acids from its N-terminus and has 3 WD-repeat domains deleted (FIG. 19). Due to the large truncation of critical domains in both proteins, it is expected that ACPP-SEC13 contains neither phosphatase nor GTPase-activation activity. Such loss of function may lead to hyperactivity of mTOR and may make it insensitive to amino acid deprivation. A potential targeted treatment for patients positive for ACPP-SEC13 might be using mTOR inhibitor since cancer cells may become hypersensitive to mTOR inhibitors when SEC13 is not functional.",
                                "DOCK7-OLR1 Fusion Genes.",
                                "DOCK7-OLR1 fusion transcript was discovered in a prostate cancer sample from a patient who experienced recurrent prostate cancer 30.5 months after the radical prostatectomy. However, the rise of PSA appeared rapid with PSADT less than 3 months. The prostate cancer Gleason's grade was 7, and there was no invasion into seminal vesicle or other adjacent organs at the time of surgery. The surgical margin was negative. It clearly suggests that some prostate cancer cells had escaped the primary location before the surgery. DOCK7 is a guanine nucleotide exchange factor involving in migration and cell polarization13,14, while OLR1 is a low density lipoprotein receptor that belongs to the C-type lectin superfamily. OLR1 binds, internalizes and degrades oxidized low-density lipoprotein15. Unlike the above 3 fusion transcripts, DOCK7-OLR1 does not produce a chimera protein. Instead, separate translation of DOCK7 and OLR1 occurs from the fusion transcript. The fusion deleted a significant portion of cytokinesis domain of DOCK7 such that motility regulation by DOCK7 might be compromised. However, the fusion transcript will produce an intact OLR1 protein (FIG. 20). OLR1 was implicated in Fas-mediated apoptosis. The functional significance of its expression under the control of DOCK7 promoter is to be investigated.",
                                "PCMTD1-SNTG1 Fusion Genes.",
                                "PCMTD1-SNTG1 fusion transcript was discovered in a prostate cancer sample from a patient who experienced recurrent prostate cancer 5.5 months after the radical prostatectomy. The rise of PSA was rapid with PSADT less than 3 months. The Gleason's grade is 9. Seminal vesicle invasion was identified in the prostatectomy sample. The prostate cancer sample is also positive for SLC45A2-AMACR and LRRC59-FLJ60017. PCMTD1 is Daspartate methyltransferase domain containing protein. The function of PCMTD1 has not been studied. SNTG1 is a member of the syntrophin family. SNTG1 belongs to peripheral membrane protein. Recent study suggests that SNTG1 may regulate diacylglycerol kinase zeta subcellular localization and regulates the termination of diacylglycerol signaling. Similar to DOCK7-OLR1 fusion, PCMTD1-SNTG1 fusion does not produce a chimera protein. PCMTD1-SNTG1 fusion produces a truncated PCMTD1. The truncation removes half of the methyl-transferase domain of PCMTD1. However, SNTG1 is intact (FIG. 21). Since diacylglycerol kinase weakens protein kinase C activity by depleting the availability of diacylglycerol, higher level of SNTG1 might enhance PKC signaling If PCMDT1-SNTG1 fusion drives up the expression of SNTG1. Alternatively, impairing the function of PCMTD1 may have impact on cell metabolism and cell growth that are yet to be delineated.",
                                "**10.2. References**",
                                "- 1. Agarwal, A. K., Fryns, J. P., Auchus, R. J., and Garg, A. (2003)\n  Zinc metalloproteinase, ZMPSTE24, is mutated in mandibuloacral\n  dysplasia. *Human molecular genetics* 12(16), 1995-2001.\n- 2. Parr-Sturgess, C. A., Tinker, C. L., Hart, C. A., Brown, M. D.,\n  Clarke, N. W., and Parkin, E. T. Copper modulates zinc\n  metalloproteinase-dependent ectodomain shedding of key signaling and\n  adhesion proteins and promotes the invasion of prostate cancer\n  epithelial cells. *Mol Cancer Res* 10(10), 1282-1293.\n- 3. Shchors, K., Yehiely, F., Kular, R. K., Kotlo, K. U., Brewer, G.,\n  and Deiss, L. P. (2002) Cell death inhibiting RNA (CDIR) derived from\n  a 3′-untranslated region binds AUF1 and heat shock protein. 27. *The\n  Journal of biological chemistry* 277(49), 47061-47072.\n- 4. Clark, J. P., and Cooper, C. S. (2009) ETS gene fusions in prostate\n  cancer. *Nat Rev Urol* 6(8), 429-439.\n- 5. Jeon, I. S., Davis, J. N., Braun, B. S., Sublett, J. E.,\n  Roussel, M. F., Denny, C. T., and Shapiro, D. N. (1995) A variant\n  Ewing's sarcoma translocation (7; 22) fuses the EWS gene to the ETS\n  gene ETV1. *Oncogene* 10(6), 1229-1234.\n- 6. Carver, B. S., Tran, J., Chen, Z., Carracedo-Perez, A., Alimonti,\n  A., Nardella, C., Gopalan, A., Scardino, P. T., Cordon-Cardo, C.,\n  Gerald, W., and Pandolfi, P. P. (2009) ETS rearrangements and prostate\n  cancer initiation. *Nature* 457(7231), E1; discussion E2-3.\n- 7. Chi, P., Chen, Y., Zhang, L., Guo, X., Wongvipat, J., Shamu, T,\n  Fletcher, J. A., Dewell, S., Maki, R. G., Zheng, D., Antonescu, C. R.,\n  Allis, C. D., and Sawyers, C. L. ETV1 is a lineage survival factor\n  that cooperates with KIT in gastrointestinal stromal tumours. *Nature*\n  467(7317), 849-853.\n- 8. Jane-Valbuena, J., Widlund, H. R., Perner, S., Johnson, L. A.,\n  Dibner, A. C., Lin, W. M., Baker, A. C., Nazarian, R. M.,\n  Vijayendran, K. G., Sellers, W. R., Hahn, W. C., Duncan, L. M.,\n  Rubin, M. A., Fisher, D. E., and Garraway, L. A. An oncogenic role for\n  ETV1 in melanoma. *Cancer research* 70(5), 2075-2084.\n- 9. Vitari, A. C., Leong, K. G., Newton, K., Yee, C., O'Rourke, K.,\n  Liu, J., Phu, L., Vij, R., Ferrando, R., Couto, S. S., Mohan, S.,\n  Pandita, A., Hongo, J. A., Arnott, D., Wertz, I. E., Gao, W. Q.,\n  French, D.\n- 10. M., and Dixit, V. M. COP1 is a tumour suppressor that causes\n  degradation of ETS transcriptionfactors. *Nature* 474(7351), 403-406\n- 11. Willardsen, M., Hutcheson, D. A., Moore, K. B., and Vetter, M. L.\n  The ETS transcription factor Etv1 mediates FGF signaling to initiate\n  proneural gene expression during *Xenopus laevis* retinal development.\n  *Mechanisms of development* 131, 57-67\n- 12. Enninga, J., Levay, A., and Fontoura, B. M. (2003) Sec13 shuttles\n  between the nucleus and the cytoplasm and stably interacts with Nup96\n  at the nuclear pore complex. *Molecular and cellular biology* 23(20),\n  7271-7284.\n- 13. Bar-Peled, L., Chantranupong, L., Cherniack, A. D., Chen, W. W.,\n  Ottina, K. A., Grabiner, B. C., Spear, E. D., Carter, S. L., Meyerson,\n  M., and Sabatini, D. M. A Tumor suppressor complex with GAP activity\n  for the Rag GTPases that signal amino acid sufficiency to mTORC1.\n  *Science* (New York, N.Y. 340(6136), 1100-1106.\n- 14. Watabe-Uchida, M., John, K. A., Janas, J. A., Newey, S. E., and\n  Van Aelst, L. (2006) The Rac activator DOCK7 regulates neuronal\n  polarity through local phosphorylation of stathmin/Op18. *Neuron*\n  51(6), 727-739.\n- 15. Nellist, M., Burgers, P. C., van den Ouweland, A. M., Halley, D.\n  I, and Luider, T. M. (2005) Phosphorylation and binding partner\n  analysis of the TSC1-TSC2 complex. *Biochemical and biophysical\n  research communications* 333(3), 818-826."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze prostate cancer samples by transcriptome sequencing",
                                "discover 5 novel fusion transcripts",
                                "validate fusion transcripts through Sanger sequencing",
                                "describe ZMPSTE24-ZMYM4 fusion genes",
                                "motivate ZMPSTE24-ZMYM4 fusion in prostate cancer",
                                "analyze motif of ZMPSTE24-ZMYM4 fusion",
                                "describe CLTC-ETV1 fusion genes",
                                "motivate CLTC-ETV1 fusion in prostate cancer",
                                "analyze motif of CLTC-ETV1 fusion",
                                "describe ACPP-SEC13 fusion genes",
                                "motivate ACPP-SEC13 fusion in prostate cancer",
                                "analyze motif of ACPP-SEC13 fusion",
                                "describe DOCK7-OLR1 fusion genes",
                                "motivate DOCK7-OLR1 fusion in prostate cancer",
                                "analyze motif of DOCK7-OLR1 fusion",
                                "describe PCMTD1-SNTG1 fusion genes",
                                "motivate PCMTD1-SNTG1 fusion in prostate cancer",
                                "analyze motif of PCMTD1-SNTG1 fusion",
                                "provide references for ZMPSTE24",
                                "provide references for ETV1",
                                "provide references for SEC13",
                                "provide references for DOCK7",
                                "provide references for PCMTD1"
                            ],
                            "num_characters": 11770,
                            "outline_medium": [
                                "discover novel fusion transcripts in prostate cancer samples",
                                "validate fusion transcripts through Sanger sequencing",
                                "describe ZMPSTE24-ZMYM4 fusion genes",
                                "analyze motif of ZMPSTE24-ZMYM4 fusion",
                                "describe CLTC-ETV1 fusion genes",
                                "analyze motif of CLTC-ETV1 fusion",
                                "describe ACPP-SEC13 fusion genes",
                                "analyze motif of ACPP-SEC13 fusion",
                                "describe DOCK7-OLR1 fusion genes",
                                "analyze motif of DOCK7-OLR1 fusion",
                                "describe PCMTD1-SNTG1 fusion genes"
                            ],
                            "outline_short": [
                                "discover novel fusion transcripts in prostate cancer samples",
                                "validate fusion transcripts through Sanger sequencing",
                                "describe ZMPSTE24-ZMYM4 fusion genes",
                                "describe CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, and PCMTD1-SNTG",
                                "discuss potential therapeutic targets for each fusion gene"
                            ]
                        },
                        {
                            "title": "11. EXAMPLE 6: SLC45A2-AMACR FUSION GENES",
                            "paragraphs": [
                                "**11.1 Results**",
                                "The fusion transcript of Solute carrier family 45, member 2-alpha-methylacyl-CoA racemase (SLC45A2-AMACR) produces a chimera protein with Nterminus 187 amino acids of SLC45A2 and the C-terminus 311 amino acids of AMACR. SLC45A2 is a transporter protein known to be overexpressed in melanoma1, while AMACR is an enzyme involved in metabolism of branch fatty acid, and is known for its overexpression in several human malignancies. SLC45A2-AMACR replaces 5 transmembrane and cytosolic domains of SLC45A2 with an intact racemase domain from AMACR2, while leaves the extracellular and the N-terminal transmembrane domains intact (FIG. 24). Most of prostate cancer patients who were positive for SLC45A2-AMACR experienced prostate cancer recurrence within 5 years of surgical treatment. Previous studies suggest that AMACR is essential for optimal growth of prostate cancer cells in vivo. Knocking down of AMACR or treatment of prostate cancer with AMACR inhibitors resulted in death of cancer cells both in vitro and in vivo3. Formation of SLC45A2-AMACR generates ectopic racemase for fatty acid metabolism to support the growth of prostate cancer cells.",
                                "Transformation of Prostate Epithelial Cells with SLC45A2-AMACR Results in Dramatic Cell Growth and Transformation, Possibly Through Activation of SHIP2-Akt Pathway.",
                                "To investigate whether SLC45A2-AMACR chimera protein is expressed in prostate cancer samples that contain SLC45A2-AMACR transcript, protein extracts from 4 prostate cancer samples positive for SLC45A2-AMACR RNA were analyzed using antibodies specific for MAN2A1 or FER. The results showed that these samples expressed a 50 Kd protein recognized by both MAN2A1 and FER antibodies (FIG. 25A). This protein was not detected in prostate cancer samples that were negative for SLC45A2-AMACR transcript. When SLC45A2-AMACR was forced to express in RWPE1 cells, a non-transformed prostate epithelial cell line, it increased the proportion of cells in S phase by an average of 8.7 fold (p<0.001). MTT assays showed a 7.5 fold increase of cell proliferation (p<0.001)(FIG. 25 E-F). SLC45A2-AMACR was determined to be localized in the plasma membrane by immunofluorescence staining and membranous fractionation analyses. This is in contrast to native AMACR, which is located primarily in the mitochondria/cytoplasm. To investigate what are the potential signaling molecules mediating SLC45A2-AMACR induced cell growth and DNA synthesis. Yeast-two hybrid screening of prostate Yeast two-Hybrid library using pBD-SLC45A2-AMACR was performed. After 3 rounds of metabolic screening, 15 unique clones that contain SLC45A2-AMACR binding proteins were identified. One of these clones encodes inositol polyphosphate phosphatase-like 1 (INPPL1, also called SHIP2). SHIP2 is a SH2 domain containing inositol phosphatase that converts PIP3(3,4,5) to PIP2(3,4). In contrast to Pten, which converts PIP3(3,4,5) to an inactive PIP2(4,5), PIP2(3,4) generated by SHIP2 has higher affinity binding with AKT than PIP3(3,4,5), and thus hyper-activate AKT pathway. The interaction between SLC45A2 and SHIP2 was validated by both yeast Two-hybrid co-transfection analysis and co-immunoprecipitation assays in SLC45A2-AMACR expressing cells (FIG. 25G-H). Induction of SLC45A2-AMACR expression in 2 different clones of RWPE1 cells generated 2.1- and 2.3-fold higher level of PIP2(3,4), respectively. These results indicate that binding of SLC45A2-AMACR and SHIP2 leads to activation of SHIP2 phosphatase activity and probably AKT signaling pathway.",
                                "Therapeutic Targeting at SLC45A2-AMACR Using Racemase Inhibitor.",
                                "To investigate whether targeting SLC45A2-AMACR is a viable approach to treat prostate cancer, we chose 2 approaches: 1) To intercept SLC45A2-AMACR/SHIP2-Akt pathway with small molecules; and 2) to block the ectopic racemase activity of SLC45A2-AMACR with ebselen or trifluoro-ibuprofen. Surprisingly, both SHIP2 and MTOR inhibitors killed PC3 cells effectively, regardless whether they were transformed with SLC45A2-AMACR. Expression of SLC45A2-AMACR only moderately sensitized PC3 cells to Rapamycin. This is probably due to Pten negative status of PC3 cells such that Akt pathway is fully activated regardless the presence of SLC45A2-AMACR. On the other hand, when we applied ebselen, the potent inhibitor of racemase of AMACR, to SLC45A2-AMACR expressing PC3 cells, 5 fold higher sensitivity of cell growth inhibition was found for PC3 cells transformed with pCDNA4-SLC45A2-AMACR-FLAG/pCDNA6 over the controls. In contrast, non-transformed RWPE1 cells and NIH3T3 cells that expressed little AMACR was largely insensitive to ebselen killing (FIG. 26). The differential sensitivity of normal cells versus cancer cells to AMACR inhibitors may prove very useful in treating prostate cancer positive for this fusion gene.",
                                "**11.2. References**",
                                "- 1. Misago, M., Liao, Y. F., Kudo, S., Eto, S., Mattei, M. G.,\n  Moremen, K. W., and Fukuda, M. N. (1995) Molecular cloning and\n  expression of cDNAs encoding human alpha-mannosidase II and a\n  previously unrecognized alpha-mannosidase IIx isozyme. Proceedings of\n  the National Academy of Sciences of the United States of America\n  92(25), 11766-11770.\n- 2. Krolewski, J. J., Lee, R., Eddy, R., Shows, T. B., and\n  Dalla-Favera, R. (1990) Identification and chromosomal mapping of new\n  human tyrosine kinase genes. Oncogene 5(3), 277-282.\n- 3. Zha, S., Ferdinandusse, S., Denis, S., Wanders, R. J., Ewing, C.\n  M., Luo, J., De Marzo, A. M., and Isaacs, W. B. (2003)\n  Alpha-methylacyl-CoA racemase as an androgen-independent growth\n  modifier in prostate cancer. Cancer research 63(21), 7365-7376."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe SLC45A2-AMACR fusion genes",
                                "analyze motif of SLC45A2-AMACR fusion",
                                "transform prostate epithelial cells with SLC45A2-AMACR",
                                "investigate cell growth and transformation",
                                "identify SHIP2-Akt pathway",
                                "validate interaction between SLC45A2 and SHIP2",
                                "investigate therapeutic targeting of SLC45A2-AMACR",
                                "test SHIP2 and MTOR inhibitors",
                                "test racemase inhibitors",
                                "discuss differential sensitivity of normal cells versus cancer cells",
                                "provide references for SLC45A2-AMACR"
                            ],
                            "num_characters": 5661,
                            "outline_medium": [
                                "describe SLC45A2-AMACR fusion genes",
                                "analyze motif of SLC45A2-AMACR fusion",
                                "investigate SLC45A2-AMACR expression in prostate cancer samples",
                                "study SLC45A2-AMACR-induced cell growth and transformation",
                                "explore therapeutic targeting of SLC45A2-AMACR using racemase inhibitor"
                            ],
                            "outline_short": [
                                "describe SLC45A2-AMACR fusion genes and their role in prostate cancer",
                                "investigate therapeutic targeting of SLC45A2-AMACR using racemase inhibitors"
                            ]
                        },
                        {
                            "title": "12. EXAMPLE 7: GENOME TARGETING AT THE CHROMOSOME BREAKPOINT OF A FUSION GENE RESULTED IN REMISSION OF XENOGRAFTED PROSTATE CANCERS",
                            "paragraphs": [
                                "**12.1 Introduction**",
                                "Prostate cancer is the most frequent malignancies for men in the US. The mortality of prostate cancer reached 27,540 in 2014, the second most lethal cancer for men.1 Treatment of prostate cancer, particularly of those metastatic prostate cancers remains problematic. As described above, a panel of fusion genes that are present in most prostate cancers have been shown to be recurrent and lethal.2 The mechanism of these fusions is chromosome rearrangement. The expressions of these fusion genes are wide-spread among aggressive prostate cancers but are absent in normal tissues. Thus, targeting at these chromosome rearrangement breakpoints that create these fusion genes would provide a highly cancer specific approach to treat prostate cancers.",
                                "In this Example, Cas9D10A mediated genome editing was successfully used to insert Herpes Simplex Virus 1 thymidine kinase (HSV1-tk) into the chromosomal breakpoint of fusion gene TMEM135-CCDC67. Treatment of tumors harboring TMEM135-CCDC chromosome breakpoint with Ganciclovir led to cell death in cell culture and remission of xenografted prostate cancer in Severe Combined Immunodeficiency (SCID) mice.",
                                "**12.2 Methods and Materials**",
                                "Materials and Vector Construction.",
                                "All cell lines, including PC3 (prostate cancer), Du145 (prostate cancer) were purchased from American Type Cell Culture (Manassas, Va.). PC3 cells were cultured with F12K medium supplemented with 10% fetal bovine serum (InVitrogen, Carlsbad, Calif.). Du145 cells were cultured with modified Eagle medium supplemented with 10% fetal bovine serum (Invitrogen). Rabbit polyclonal anti-Cas9 antibodies were purchased from Clontech Inc., CA. Rabbit anti-HSV-1 TK polyclonal antibodies were purchased from Sigma Inc., OH. ABC kit was purchased from Vector Labs, Inc., OH.",
                                "Construction of Vector.",
                                "To construct the gRNA expression vector, sequences flanking the breakpoint region of TMEM135-CCDC67 were analyzed and gRNAs were designed using DNA 2.0 tool: https://www.dna20.com/eCommerce/cas9/input. Both gRNA− and gRNA+ were ligated into All-in-One NICKASENINJA® vector that also contains Cas9D10A. The insert was then released by restriction with XbaI, and ligated into similarly restricted VQAd5 shuttle vector to create VQAd5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9. The recombinant shuttle vector was then recombined with pAD5 virus to generate pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9 using a method previously described.7",
                                "To construct donor DNA recombinant virus, PCR was performed on pEGFP-N1 using the following primers:",
                                "The PCR product was restricted with KasI and HindIII, and ligated into similarly restricted pSELECT-zeo-HSV1tk vector to create pEGFP-HSV1-tk.",
                                "PCR was performed on the genome DNA from sample where TMEM135-CCDC67 fusion was discovered to obtain intron 13 sequence of TMEM135 using the following primers:",
                                "The PCR products were then restricted with NotI and HindIII, and ligated into similarly restricted pEGFPtk vector to create pTMEM135int13-EGFP-tk.",
                                "Subsequently, PCR was performed on the genome DNA from the sample where TMEM135-CCDC67 fusion was discovered to obtain intron 9 sequence of CCDC67 using the following primers:",
                                "The PCR was then restricted with NheI and EcoRI, and ligated into the similarly restricted pTMEM135int13-EGFP-tk vector to create pTMEM135int13-EGFP-tk-CCDC67int9. The vector was then restricted with EcoR1 and NotI and ligated into the similarly restricted pAdlox to create pAdlox-pTMEM135int13-EGFP-tk-CCDC67int9. The recombinant shuttle vector was then recombined with adenovirus to create pAd-TMEM135int13-EGFP-tk-CCDC67int9.",
                                "For the construction of pCMV-TMEM135-CCDC67 bp vector, PCR was performed on genome DNA from a prostate cancer sample that are positive for TMEM135-CCDC67 fusion using the following primers:",
                                "The PCR product was then sequenced to confirm the presence of TMEM135-CCDC67 breakpoint. The PCR product was digested with HindIII and XbaI, and ligated into similarly digested pCMVscript vector. The construct was subsequently transfected into PC3 and DU145 cells using lipofectamine 3000. Cells stably expressing TMEM135-CCDC67 breakpoint transcripts were selected by incubation of the transfected cells in medium containing G418 (200 μg/ml).",
                                "In Vitro Cas9 Target Cleavage Assays.",
                                "gRNA DNA sequence plus scaffold DNA sequence for + or − DNA strand were amplified from the all-in-one vector with the following primers:",
                                "The PCR products were in vitro transcribed using In Vitro Transcription kit from Ambion, CA, to obtain gRNA+ and gRNA− products. Cleavage assays were performed at 25° C. for 10 min and then 37° C. for 1 hour under the following condition: lx Cas9 nuclease reaction buffer, 30 nM gRNA 3 nM DNA template and 30 nM Cas9 Nuclease, S. pyogenes. The cleaved DNA was visualized in 1% agarose gel electrophoresis.",
                                "Fluorescence Activated Cell Sorting (FACS) Analysis of Apoptotic Cells.",
                                "The assays were previously described.8-16 Briefly, the cells treated with pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9/pAD-TMEM135int13-EGFP-tk-CDC67int9, and various concentrations of ganciclovir were trypsinized and washed twice with cold PBS. The cells were then resuspended in 100 μl of annexin binding buffer (Invitrogen), and incubated with 5 μl of phycoerythrin (PE)-conjugated annexin V and 1 μl of 100 ng/ml propidium iodide for 15 min in dark at room temperature. The binding assays were terminated by addition of 400 μl of cold annexin binding buffer. FACS analysis was performed using a BD-LSR-II flow cytometer (BD Science, San Jose, Calif.). The fluorescence stained cells were analyzed at the fluorescence emission at 533 nm (FL2). The negative control, cells with neither PE nor PI in the incubation medium, was used to set the background for the acquisition. UV treated cells were used as a positive control for apoptosis. For each acquisition, 10,000 to 20,000 cells were sorted based on the fluorescence color of the cells. WinMDI 2.9 software (freeware from Joseph Trotter) was used to further analyze the data.",
                                "Tumor Growth and Spontaneous Metastasis.",
                                "The xenografting procedure was described previously.10, 14-19 Briefly, Approximately 2×107 viable PC3 and Du145 cells that contain TMEM135-CCDC67 breakpoint or control vector, suspended in 0.2 mL of Hanks' balanced salt solution (Krackeler Scientific, Inc., Albany, N.Y.) were subcutaneously implanted in the abdominal flanks of 48 SCID mice to generate one tumor per mouse. Mice were observed daily, and their body weight and tumor size were recorded weekly. Tumor size were measured on the diameter. Three weeks after xenografting, these mice were applied with pAD5-Cas9D10AgRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9 (5×1010 pfu), and treated with ganciclovir (80 mg/kg) or controls as indicated in FIG. 32 through intraperitoneal and local applications. After 7 weeks, mice that were applied with pAD5-cas9D10A-gRNATMEM135int13-gRNACCDC67int9/pAD-TMEM135int13-EGFP-tk-CCDC67int9, and with ganciclovir were killed, and necropsies were performed. For mice treated with control reagents, necropsies were performed when mice died from the xenografted cancers. Serial sections of formalin-fixed, paraffin-embedded lung, brain, liver, kidney, vertebra, and lymph node specimens were collected, stained with hematoxylin and eosin, and examined microscopically. All animal procedures were approved by the University of Pittsburgh Institutional Animal Care and Use Committee.",
                                "Immunohistochemistry.",
                                "Immunohistochemistry was performed as described previously19 with antibodies specific for HSV-1 TK (1:100 dilution) or for Cas9 (1:100 dilution). The antibody was omitted in negative controls. The sections were then incubated with horseradish peroxidase-conjugated anti-rabbit IgG for 30 minutes at room temperature (ABC kit from Vector Labs, Inc). Slides were then exposed to a 3,3′-diaminobenzidine solution to visualize immunostaining. Counterstaining was performed by incubating the slides in 1% Hematoxylin solution for 2 minutes at room temperature. The slides were then rinsed briefly in distilled water to remove excessive staining.",
                                "**12.3 Results**",
                                "One of the fusion genes discovered in prostate cancer is between transmembrane protein 135 (TMEM135) and coiled-coil domain containing 67 (CCDC67). The fusion gene was created due to a 6 MB deletion in the region of chromosome 11q14.2-21. The deletion joins intron 13 of TMEM135 with intron 9 of CCDC67 in chromosome 11 (FIG. 29A). Such sequence joining creates a unique sequence breakpoint not present in normal tissues. This provides a unique target in cancer cells for therapeutic intervention. To target at this joining sequence, 2 gRNAs were designed to complement to the regions flanking the chromosomal breakpoint (FIG. 29B). These gRNAs and Cas9D10A were ligated into VQAd5-CMV shuttle vector and recombined into pAD5 adenovirus to create pAD5-cas9D10A-gRNATMEM135int13-gRNACCDC67int9. To provide a potential lethal gene for targeted cancer cells, cDNA of HSV-1 tk was ligated with enhanced green fluorescence protein (EGFP) cDNA in frame to create a chimeric gene EGFP-tk. The chimeric cDNA is promoterless, and was ligated with 584 bp of intron 13 sequence of TMEM135 at the 5′ end and 561 bp of intron 9 sequence of CCDC67 at the 3′ end. These sequences were subsequently ligated into PAdlox shuttle vector and recombined into adenovirus to create pADTMEM135int13-EGFP-tk-CCDC67int9. Such device is intended to produce single strand breaks at intron 13 of TMEM135 and intron 9 of CCDC67 in close proximity to the chromosome breakpoint and in different strands.",
                                "To examine whether the designed gRNA is adequate in recruiting Cas9 to produce DNA break at the targeted DNA, in vitro cleavage assays were performed on pCMV-TMEM135int13-CCDC67int9, using recombinant Cas9 from S. pyogenes and gRNA generated from in vitro transcription. As shown in FIG. 30A, both gRNA− and gRNA+ cleaved the linearized pCMVTMEM135int13-CCDC67int9 at the correct locations and generated the expected 4317 and 3206 bp fragments for gRNA−, and 4414 and 3109 bp for gRNA+. To test whether pAD5-Cas9D10AgRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9 induced integration of EGFP-tk into the TMEM135-CCDC67 breakpoint of the cancer genome, prostate cancer cell lines PC3 and DU145 were transfected with pCMV-TMEM135int13-CCDC67int9 such that the integrated vector would transcribe a RNA containing TMEM133-CCDC67 breakpoint under CMV 1E94 promoter (FIG. 30B). When PC3 cells stably expressing TMEM133-CCDC67 breakpoint RNA were infected with pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9, intensive EGFP-tk expression was identified in cells (green fluorescence) that also expressed Cas9D10A-RFP (red fluorescence), while little EGFP-tk expression was found in cells that had minimal Cas9D10A-RFP expression (FIGS. 30C and D, Table 19), suggesting that the integration of EGFP-tk into the genome and the expression of EGFP-tk protein are dependent on Cas9D10A-RFP. Similar finding was also observed in DU145 cells transformed with pCMV-TMEM135int13-CCDC67int9. In contrast, neither PC3 nor DU145 cells transformed with pCMVscript displayed significant expression of EGFP-tk (FIGS. 30C and D, Table 19), suggesting that no integration of EGFP-tk occurred when TMEM135-CCDC67 breakpoint was absent. These results indicate that integration of EGFP-tk into the breakpoint of TMEM135-CCDC67 using Cas9D10A is highly specific. Few off-target events occurred.",
                                "Nucleotide homologues, such as guanine analogue 9-(1,3-dihydroxy-2-propoxymethyl)guanine (ganciclovir)20, is converted to triphosphates form by HSV-1 tk but not by its mammalian counterpart. Ganciclovir triphosphates blocks DNA synthesis. To examine whether cancer cells expressing EGFP-tk are susceptible to anti-Herpes drug such as ganciclovir, PC3 or DU145 cells expressing TMEM135-CCDC67 breakpoint were infected with pAD5-Cas9D10AgRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9. These cells were exposed to various concentrations of ganciclovir. As shown in FIG. 31A, at 0.075 μg/ml of ganciclovir, the killing of PC3 or DU145 cells reached 50% of its maximal level, and at 5 μg/ml, the killing was at the peak. At 5 μg/ml of ganciclovir, apoptosis of PC3 or DU145 cells containing the TMEM135-CCDC67 breakpoint and infected with pAD5-Cas9D10AgRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9 was clearly visualized (FIG. 31B and Table 20). No significant cell deaths were identified for cells containing no TMEM135-CCDC67 breakpoint, even though they were equally infected with these viruses and exposed to high concentrations of ganciclovir (up to 100 μg/ml, FIGS. 31A and B). These findings indicate that the killing of cancer cells by ganciclovir is breakpoint dependent and is highly specific.",
                                "To examine whether such breakpoint dependent killing of cancer cells can be used as a treatment for cancer, PC3 or DU145 cells containing TMEM135-CCDC67 breakpoint were xenografted into the subcutaneous regions of severe combined immunodeficiency mice. The xenografted tumors were allowed to grow for 3 weeks to reach ˜0.7 cm3 in size. These mice were then infected with pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9 and pAD-TMEM135int13-EGFP-tk-CCDC67int9 (5×1010 pfu), and treated with ganciclovir (80 mg/kg). As shown in FIG. 32A, mice xenografted with PC3 or DU145 cancer cells containing TMEM135-CCDC67 breakpoint experienced exponential growth of tumor if they were not treated properly. In contrast, if these tumors were treated with both viruses and ganciclovir, the mice experienced up to 30% shrinking of the tumor volumes. Integration of TMEM123int13-EGFP-tk-CCDC67int9 and expression of EGFP-tk were detected in PC3 or DU145 cells that contained TMEM135-CCDC67 breakpoint and treated with recombinant viruses (FIG. 33). There was no incidence of metastasis detected in mice treated with pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9, pAD-TMEM135int13-EGFP-tk-CCDC67int9 and ganciclovir. However, PC3 or DU145 cells containing no TMEM135-CCDC67 breakpoint had 33-50% metastasis rate even treated with the recombinant viruses and ganciclovir (FIG. 32B). Mice xenografted with PC3 or DU145 cells that contain TMEM135-CCDC67 breakpoint and treated with the recombinant viruses and ganciclovir had no mortality, while all control treated mice died within 7 weeks of tumor cells xenografting (FIG. 32C). These experiments suggest that targeting fusion gene breakpoint in the cancer genome is an effective and highly specific approach to treat cancer.",
                                "**12.4 Discussion**",
                                "Chromosome rearrangement and deletion creates many cancer specific fusion genes.21 These fusion genes either acquire additional function to drive the cancer progression or destroy genes that block the progression of cancer. TMEM135-CCDC7 is an example of latter such that the fusion eliminates the open-reading frame of CCDC67, a putative cancer suppressor and truncates 65 amino acids off the C-terminus of TMEM135, a protein widely expressed in most tissues but with unknown function. The impact of fusion genes on the function of genes that are involved is probably more dramatic than most missense point mutations. The fusion genes created in cancers represent a new stratum of novel functions developed by cancer cells. The presence of chromosome rearrangement-based fusion genes is the hallmark of human malignancies. As a result, targeting at fusion genes created by cancer cells will generate highly specific cancer cell killing but will spare the destruction of normal cells that do not contain the chromosome rearrangement.",
                                "The recent advances in precision cleavage of DNA by bacterial CRISPR/Cas system made it possible to target specific genome sequence with relatively high efficiency. The approach described herein appears highly specific, with average functional off-target rates being 1.3% in both PC3 and DU145 cells (EGFP-tk+ cells/Cas9D10A-RFP+ cells in PC3+pCMV or DU145+pCMV cells, Table 18). Such precision specificity makes it possible to apply this approach to a clinical setting.",
                                "The current therapeutic approach to metastatic prostate cancer heavily relies on intervention of androgen receptor signaling pathway. However, such approach invariably leads to drug tolerance and refractory to drug treatment as cancer genome adjusts its gene expression pattern and develops new pathways to bypass the signaling blockade. The subsequent application of chemotherapy to androgen refractory prostate cancer may impact both cancer and normal tissues, and thus generally produces poor therapeutic outcomes. The genome approach may have significant advantage over chemotherapy because of its specificity for the cancer genome sequence. There is no appreciable cytotoxic side-effect of these recombinant viruses in either cell culture or animal model. The integration of EGFP-tk can be monitored by fluorescence imaging.",
                                "Furthermore, in the event of unwanted integration into the genome of healthy cells of critical location, the integrated EGFP-tk can be retrieved by Cre expression. In light of the toxic side-effect of small molecules targeting at protein molecules, genome therapeutic approach shown in this report may represent a more controlled, safe and probably minimal side-effect approach to treat human cancers.",
                                "**12.5 References**",
                                "- 1. Siegel, R. L., Miller, K. D., & Jemal, A. Cancer statistics, 2015.\n  CA: a cancer journal for clinicians 65: 5-29.\n- 2. Yu, Y. P., Ding, Y., Chen, Z., Liu, S., Michalopoulos, A., et\n  al. (2014) Novel fusion transcripts associate with progressive\n  prostate cancer. The American journal of pathology 184: 2840-2849.\n- 3. Mojica, F. J., Diez-Villasenor, C., Garcia-Martinez, J., &\n  Soria, E. (2005) Intervening sequences of regularly spaced prokaryotic\n  repeats derive from foreign genetic elements. Journal of molecular\n  evolution 60: 174-182.\n- 4. Jinek, M., Chylinski, K., Fonfara, I., Hauer, M., Doudna, J. A., et\n  al. A programmable dual-RNAguided DNA endonuclease in adaptive\n  bacterial immunity. Science (New York, N.Y. 337: 816-821.\n- 5. Esvelt, K. M., Smidler, A. L., Catteruccia, F., & Church, G. M.\n  Concerning RNA-guided gene drives for the alteration of wild\n  populations. eLife: e03401.\n- 6. Ran, F. A., Hsu, P. D., Lin, C. Y., Gootenberg, J. S., Konermann,\n  S., et al. Double nicking by RNAguided CRISPR Cas9 for enhanced genome\n  editing specificity. Cell 154: 1380-1389.\n- 7. Anderson, R. D., Haskell, R. E., Xia, H., Roessler, B. J., &\n  Davidson, B. L. (2000) A simple method for the rapid generation of\n  recombinant adenovirus vectors. Gene therapy 7: 1034-1038.\n- 8. Wang, H., Luo, K., Tan, L. Z., Ren, B. G., Gu, L. Q., et al. (2012)\n  p53-induced gene 3 mediates cell death induced by glutathione\n  peroxidase 3. The Journal of biological chemistry 287: 16890-16902.\n- 9. Zhu, Z. H., Yu, Y. P., Zheng, Z. L., Song, Y., Xiang, G. S., et\n  al. (2010) Integrin alpha 7 interacts with high temperature\n  requirement A2 (HtrA2) to induce prostate cancer cell death. The\n  American journal of pathology 177: 1176-1186.\n- 10. Shi, Y. K., Yu, Y. P., Tseng, G. C., & Luo, J. H. (2010)\n  Inhibition of prostate cancer growth and metastasis using small\n  interference RNA specific for minichromosome complex maintenance\n  component 7. Cancer gene therapy 17: 694-699.\n- 11. Luo, K. L., Luo, J. H., & Yu, Y. P. (2010)\n  (−)-Epigallocatechin-3-gallate induces Du145 prostate cancer cell\n  death via downregulation of inhibitor of DNA binding 2, a dominant\n  negative helixloop-helix protein. Cancer science 101: 707-712.\n- 12. Han, Y. C., Yu, Y. P., Nelson, J., Wu, C., Wang, H., et al. (2010)\n  Interaction of integrin-linked kinase and miniature chromosome\n  maintenance 7-mediating integrin {alpha}7 induced cell growth\n  suppression. Cancer research 70: 4375-4384.\n- 13. Zhu, Z. H., Yu, Y. P., Shi, Y. K., Nelson, J. B., &\n  Luo, J. H. (2009) CSR1 induces cell death through inactivation of\n  CPSF3. Oncogene 28: 41-51.\n- 14. Yu, Y. P., Yu, G., Tseng, G., Cieply, K., Nelson, J., et\n  al. (2007) Glutathione peroxidase 3, deleted or methylated in prostate\n  cancer, suppresses prostate cancer growth and metastasis. Cancer\n  research 67: 8043-8050.\n- 15. Ren, B., Yu, Y. P., Tseng, G. C., Wu, C., Chen, K., et al. (2007)\n  Analysis of integrin alpha7 mutations in prostate cancer, liver\n  cancer, glioblastoma multiforme, and leiomyosarcoma. Journal of the\n  National Cancer Institute 99: 868-880.\n- 16. Yu, G., Tseng, G. C., Yu, Y. P., Gavel, T., Nelson, J., et\n  al. (2006) CSR1 suppresses tumor growth and metastasis of prostate\n  cancer. American Journal of Pathology 168: 597-607.\n- 17. Han, Y. C., Zheng, Z. L., Zuo, Z. H., Yu, Y. P., Chen, R., et\n  al. (2013) Metallothionein 1 h tumour suppressor activity in prostate\n  cancer is mediated by euchromatin methyltransferase 1. The Journal of\n  pathology 230: 184-193.\n- 18. Ren, B., Yu, G., Tseng, G. C., Cieply, K., Gavel, T., et\n  al. (2006) MCMI amplification and overexpression are associated with\n  prostate cancer progression. Oncogene 25: 1090-1098.\n- 19. Jing, L., Liu, L., Yu, Y. P., Dhir, R., Acquafondada, M., et\n  al. (2004) Expression of myopodin induces suppression of tumor growth\n  and metastasis. The American journal of pathology 164:1799-1806.\n- 20. Smith, K. O., Galloway, K. S., Kennell, W. L., Ogilvie, K. K., &\n  Radatus, B. K. (1982) A new nucleoside analog,\n  9-\\[\\[2-hydroxy-1-(hydroxymethyl)ethoxyl\\]methyl\\]guanine, highly\n  active in vitro against herpes simplex virus types 1 and 2.\n  Antimicrobial agents and chemotherapy 22: 55-61.\n- 21. Luo, J. H., Liu, S., Zuo, Z. H., Chen, R., Tseng, G. C., et\n  al. (2015) Discovery and Classification of Fusion Transcripts in\n  Prostate Cancer and Normal Prostate Tissue. The American journal of\n  pathology.",
                                "Various references are cited in this document, which are hereby incorporated by reference in their entireties herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce prostate cancer problem",
                                "motivate targeting chromosome rearrangement breakpoints",
                                "describe genome editing approach",
                                "list materials and cell lines used",
                                "construct gRNA expression vector",
                                "construct donor DNA recombinant virus",
                                "perform in vitro Cas9 target cleavage assays",
                                "describe vector construction and recombination",
                                "outline cell culture and transfection procedures",
                                "introduce example 7",
                                "describe FACS analysis",
                                "describe tumor growth and spontaneous metastasis",
                                "describe immunohistochemistry",
                                "introduce results",
                                "describe in vitro cleavage assays",
                                "describe integration of EGFP-tk into TMEM135-CCDC67 breakpoint",
                                "describe killing of cancer cells by ganciclovir",
                                "describe xenografting of PC3 and DU145 cells",
                                "describe treatment with pAD5-Cas9D10A-gRNATMEM135int13-gRNACCDC67int9 and pAD-T",
                                "describe integration of TMEM123int13-EGFP-tk-CCDC67int9 and expression of EGFP-tk",
                                "describe absence of metastasis",
                                "describe mortality of mice",
                                "introduce discussion",
                                "discuss chromosome rearrangement and deletion",
                                "discuss fusion genes created by cancer cells",
                                "discuss precision cleavage of DNA by bacterial CRISPR/Cas system",
                                "discuss therapeutic approach to metastatic prostate cancer",
                                "discuss genome therapeutic approach",
                                "discuss integration of EGFP-tk",
                                "discuss Cre expression",
                                "discuss toxic side-effect of small molecules",
                                "discuss genome therapeutic approach",
                                "introduce references",
                                "list reference 1",
                                "list reference 2",
                                "list reference 3",
                                "list reference 4",
                                "list reference 5",
                                "list reference 6",
                                "list reference 7",
                                "list reference 8",
                                "list reference 9",
                                "list reference 21"
                            ],
                            "num_characters": 22066,
                            "outline_medium": [
                                "motivate genome targeting",
                                "describe vector construction",
                                "outline in vitro Cas9 target cleavage assays",
                                "detail cell culture and treatment",
                                "describe FACS analysis",
                                "describe tumor growth and spontaneous metastasis",
                                "describe immunohistochemistry",
                                "describe results of in vitro cleavage assays",
                                "describe results of integration of EGFP-tk into TMEM135-CCDC67 breakpoint",
                                "describe results of ganciclovir treatment",
                                "describe results of xenografting and ganciclovir treatment",
                                "motivate targeting fusion genes in cancer treatment",
                                "describe advantages of genome therapeutic approach",
                                "discuss limitations of current therapeutic approaches",
                                "discuss potential of genome therapeutic approach",
                                "describe specificity of CRISPR/Cas system",
                                "discuss potential of EGFP-tk integration",
                                "discuss potential of Cre expression",
                                "discuss potential of genome therapeutic approach",
                                "summarize results",
                                "provide references"
                            ],
                            "outline_short": [
                                "motivate genome targeting",
                                "describe experimental methods",
                                "describe FACS analysis",
                                "describe tumor growth and spontaneous metastasis",
                                "describe immunohistochemistry",
                                "design gRNA and Cas9D10A",
                                "perform in vitro cleavage assays",
                                "test integration of EGFP-tk into TMEM135-CCDC67 breakpoint",
                                "examine susceptibility to ganciclovir",
                                "discuss targeting fusion gene breakpoint in cancer genome"
                            ]
                        }
                    ],
                    "outline_long": [
                        "perform transcriptome sequencing",
                        "validate fusion transcript using RT-PCRs",
                        "investigate mechanism of PTEN-NOLC1 fusion transcript",
                        "analyze clinical significance of PTEN-NOLC1 fusion",
                        "express PTEN-NOLC1 in NIH3T3 and PC3 cells",
                        "analyze cell growth and cell cycle entry",
                        "investigate subcellular localization of PTEN-NOLC1"
                    ],
                    "num_characters": 3902,
                    "outline_medium": [
                        "validate PTEN-NOLC1 fusion transcript",
                        "investigate mechanism of PTEN-NOLC1 fusion transcript",
                        "analyze clinical significance of PTEN-NOLC1 fusion"
                    ],
                    "outline_short": [
                        "validate PTEN-NOLC1 fusion transcript"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A kit for performing a genome editing technique in a prostate cancer cell comprising a fusion gene, wherein the kit comprises: (i) a vector comprising a nucleic acid encoding a Cas protein or a mutant thereof and one or more guide RNAs (gRNAs); and (ii) a vector comprising a donor nucleic acid and one or more targeting sequences, and wherein the fusion gene is selected from the group consisting of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, PCMTD1-SNTG1 and a combination thereof.",
        "2. The kit of claim 1, wherein the one or more gRNAs comprise one gRNA that is complementary to a region within one gene of the fusion gene and a second gRNA that is complementary to a region within a second gene of the fusion gene.",
        "3. The kit of claim 1, wherein the fusion gene is TMEM135-CCDC67 or CCNH C5orf30.",
        "4. The kit of claim 1, wherein the donor nucleic acid encodes a protein that induces cell death of the prostate cancer cell.",
        "5. The kit of claim 4, wherein the protein that induces cell death is Herpes Simplex Virus 1 thymidine kinase.",
        "6. The kit of claim 1, wherein the one or more targeting sequences are complementary to one or more sequences of the fusion gene to promote homologous recombination of and the insertion of the donor nucleic acid into the fusion gene.",
        "7. The kit of claim 1, wherein the Cas protein or mutant thereof is a Cas 9 protein or a mutant thereof.",
        "8. The kit of claim 7, wherein the Cas 9 protein or mutant thereof is Cas9D10A.",
        "9. The kit of claim 1, further comprising ganciclovir and/or valganciclovir.",
        "10. The kit of claim 1, further comprising one or more nucleic acid primers, one or more nucleic acid probes and/or one or more antibodies for detecting the one or more fusion genes.",
        "11. A kit for performing a genome editing technique in a prostate cancer cell comprising a fusion gene, wherein the kit comprises: (i) a vector comprising a nucleic acid encoding a Cas protein; (ii) a vector comprising a nucleic acid encoding one or more guide RNAs (gRNAs); and (iii) a vector comprising a donor nucleic acid and one or more targeting sequences, and wherein the fusion gene is selected from the group consisting of TRMT11-GRIK2, SLC45A2-AMACR, MTOR-TP53BP1, LRRC59-FLJ60017, TMEM135-CCDC67, KDM4B-AC011523.2, MAN2A1-FER, PTEN-NOLC1, CCNH-C5orf30, ZMPSTE24-ZMYM4, CLTC-ETV1, ACPP-SEC13, DOCK7-OLR1, PCMTD1-SNTG1 and a combination thereof.",
        "12. The kit of claim 11, wherein the one or more gRNAs comprise one gRNA that is complementary to a region within one gene of the fusion gene and a second gRNA that is complementary to a region within a second gene of the fusion gene.",
        "13. The kit of claim 11, wherein the fusion gene is TMEM135-CCDC67 or CCNH C5orf30.",
        "14. The kit of claim 11, wherein the donor nucleic acid encodes a protein that induces cell death of the prostate cancer cell.",
        "15. The kit of claim 14, wherein the protein that induces cell death is Herpes Simplex Virus 1 thymidine kinase.",
        "16. The kit of claim 11, wherein the one or more targeting sequences are complementary to one or more sequences of the fusion gene to promote homologous recombination of and the insertion of the donor nucleic acid into the fusion gene.",
        "17. The kit of claim 11, wherein the Cas protein or mutant thereof is a Cas 9 protein or a mutant thereof.",
        "18. The kit of claim 17, wherein the Cas 9 protein or mutant thereof is Cas9D10A.",
        "19. The kit of claim 11, further comprising ganciclovir and/or valganciclovir.",
        "20. The kit of claim 11, further comprising one or more nucleic acid primers, one or more nucleic acid probes and/or one or more antibodies for detecting the one or more fusion genes."
    ]
}