{
    "id": "https://semopenalex.org/work/W3016826479",
    "authors": [
        "Gëorge F. Murphy",
        "Prashant Banerjee",
        "Johnathan Tran",
        "Natasha Y. Frank",
        "Qin Guo",
        "B. J. Wilson",
        "Markus H. Frank",
        "Si-Pei Wu",
        "John Lian",
        "Max Emmerich",
        "Svetlana A. Karpova",
        "Gretchen Berg",
        "Catherine A. A. Lee",
        "Ananda Mishra"
    ],
    "title": "Targeting the ABC transporter ABCB5 sensitizes glioblastoma to temozolomide-induced apoptosis through a cell-cycle checkpoint regulation mechanism",
    "date": "2020-05-01",
    "abstract": "Glioblastoma multiforme (GBM) is a malignant brain tumor with a poor prognosis resulting from tumor resistance to anticancer therapy and a high recurrence rate. Compelling evidence suggests that this is driven by subpopulations of cancer stem cells (CSCs) with tumor-initiating potential. ABC subfamily B member 5 (ABCB5) has been identified as a molecular marker for distinct subsets of chemoresistant tumor-initiating cell populations in diverse human malignancies. In the current study, we examined the potential role of ABCB5 in growth and chemoresistance of GBM. We found that ABCB5 is expressed in primary GBM tumors, in which its expression was significantly correlated with the CSC marker protein CD133 and with overall poor survival. Moreover, ABCB5 was also expressed by CD133-positive CSCs in the established human U-87 MG, LN-18, and LN-229 GBM cell lines. Antibody- or shRNA-mediated functional ABCB5 blockade inhibited proliferation and survival of GBM cells and sensitized them to temozolomide (TMZ)-induced apoptosis in vitro. Likewise, in in vivo human GBM xenograft experiments with immunodeficient mice, mAb treatment inhibited growth of mutant TP53, WT PTEN LN-229 tumors, and sensitized LN-229 tumors to TMZ therapy. Mechanistically, we demonstrate that ABCB5 blockade inhibits TMZ-induced G2/M arrest and augments TMZ-mediated cell death. Our results identify ABCB5 as a GBM chemoresistance marker and point to the potential utility of targeting ABCB5 to improve current GBM therapies.",
    "sections": [
        {
            "title": "Glioblastoma multiforme (GBM) is a malignant brain tumor with a poor prognosis resulting from tumor resistance to anticancer therapy and a high recurrence rate. Compelling evidence suggests that this is driven by subpopulations of cancer stem cells (CSCs) with tumor-initiating potential.",
            "paragraphs": [
                "ABC subfamily B member 5 (ABCB5) has been identified as a molecular marker for distinct subsets of chemoresistant tumor-initiating cell populations in diverse human malignancies. In the current study, we examined the potential role of ABCB5 in growth and chemoresistance of GBM. We found that ABCB5 is expressed in primary GBM tumors, in which its expression was significantly correlated with the CSC marker protein CD133 and with overall poor survival. Moreover, ABCB5 was also expressed by CD133 Glioblastoma multiforme (GBM) 3 , the most common primary malignant brain tumor in adults, is associated with poor prognosis and high lethality (1). Patient survival remains dismal owing to therapeutic resistance to clinically approved drugs, such as temozolomide (TMZ) and bevacizumab, and a high rate of tumor recurrence (2)(3)(4)(5). Due to the minimal beneficial effects of existing treatment regimens, there is an urgent need for novel therapeutic strategies targeting therapy-resistant cancer subpopulations, which may correspond to GBM cancer stem cells (CSCs) (2,5).",
                "Studies in human brain cancer models have identified a central role of CSCs in brain tumor initiation, progression, and chemoresistance (3,5,6). CD133/PROM1 has been shown by several research groups to enrich for tumor-initiating GBM subpopulations (2,4,5). CD133-positive GBM CSCs possess increased tumorigenicity, chemoresistance, and self-renewal capacity in human-to-mouse xenotransplantation experiments and have been shown to correlate with poor clinical outcomes (2,4,5,7). This suggests that specific eradication of the therapyrefractory CD133-positive CSC reservoirs might help to overcome GBM therapeutic resistance.",
                "TMZ is a clinically approved drug for the treatment of GBM, which leads to significant prolongation of patient survival (8). Although acting as a cytotoxic imidazotetrazine, TMZ can induce a G 2 /M arrest (9,10), which allows therapyresistant cancer cells to repair the DNA before entering into the mitotic or M phase, hence protecting the cells and their progeny from drug-induced cytotoxicity (11)(12)(13). An essential step for G 2 /M transition is activation of the cyclin B1/CDK1 complex. In resting cells, the tyrosine kinases WEE1 and MYT1 induce inhibitory phosphorylation of CDK1, thus maintaining the cyclin B1/CDK1 complex in an inactive state. As the cells prepare to divide, polo-like kinase (PLK1), a major positive regulator of G 2 /M transition (14), is activated. Subsequently, PLK1 induces expression of CDK1 by inhibiting WEE1 and MYT1. PLK1 also activates CDC25C, which in turn plays a pivotal role in dephosphorylation and activation of CDK1. Chemotherapeutic drugs and other DNA-damaging agents can severely impair this pathway by activating the sensory ATM/ATR kinases, which phosphorylate and activate CHEK1. CHEK1 phosphorylates and inactivates CDC25C, hence retaining the cyclin B1/CDK1 complex in an inactive phosphorylated state and eventually causing G 2 /M arrest. Thus, new approaches to cancer therapeutics aim to use conventional drugs in combination with agents that are capable of abrogating G 2 /M arrest (15)(16)(17).",
                "Our laboratory has shown that ABC family member B5 (ABCB5) is preferentially expressed by tumor-initiating and therapy-resistant CSC subpopulations in diverse human malignancies, where it is also co-expressed with CD133 (18 -22). Recently, ABCB5 was found to be highly up-regulated in the ALDH bright CSC subpopulation in the human U-87 MG GBM cell line (23). Moreover, ABCB5 has been established as a key mediator of tumor growth, aggressiveness, and multidrug resistance in malignant melanoma, colorectal cancer, hepatocellular, oral squamous and Merkel cell carcinomas, and ocular surface squamous neoplasia (18,21,(24)(25)(26)(27)(28). Here, we hypothesized that, similar to its role in other cancers, ABCB5 might contribute to malignant growth and therapy resistance of GBM.",
                "Our study results establish ABCB5 expression in GBM and show that ABCB5 targeting can inhibit tumor growth in human-to-mouse xenotransplantation models and sensitize xenograft tumors to TMZ treatment. Mechanistically, we show that ABCB5 inhibition results in modulation of G 2 /M checkpoint regulators and subsequent reversal of TMZ-induced G 2 /M arrest, leading to sensitization of GBM to this currently approved therapy."
            ],
            "subsections": [
                {
                    "title": "Results",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "ABCB5 is expressed in GBM primary tumors and cell lines",
                            "paragraphs": [
                                "We first examined ABCB5 copy number alteration and expression in GBM and lower-grade glioma (LGG) sequencing data from The Cancer Genome Atlas (TCGA) (29). An enhanced increase in copy number gains was seen in GBM (77.4%) compared with oligodendroglioma (19.6%), oligoastrocytoma (22.5%), and astrocytoma (25.3%) (Fig. 1A). There was a statis-tically significant difference between means of ABCB5 mRNA expression in various brain cancers (H ϭ 138.1, p Ͻ 0.0001). ABCB5 mRNA expression was significantly higher in GBM (0.51 Ϯ 0.11 log 2 (counts), mean Ϯ S.E.) compared with oligodendroglioma (-0.66 Ϯ 0.05 log 2 (counts), p Ͻ 0.0001), oligoastrocytoma (-0.62 Ϯ 0.06 log 2 (counts), p Ͻ 0.0001), and astrocytoma (-0.64 Ϯ 0.06 log 2 (counts), p Ͻ 0.0001) (Fig. 1B). There was no statistically significant difference in ABCB5 mRNA expression between oligodendroglioma and oligoastrocytoma (p Ͼ 0.99), oligoastrocytoma and astrocytoma (p Ͼ 0.99), or oligodendroglioma and astrocytoma (p Ͼ 0.99). ABCB5 was detected in the GBM TCGA mRNA expression data set in all three GBM subtypes (classical: 0.16 Ϯ 0.15 log 2 (counts), mesenchymal: 0.90 Ϯ 0.20 log 2 (counts), proneural: 0.48 Ϯ 0.18 log 2 (counts), mean Ϯ S.E.) (Fig. 1C, left). We also examined the correlation of ABCB5 mRNA expression with overall survival (OS) for all GBM subtypes (Fig. 1C, right). There was a significant trend for median OS to be lower (12.6 versus 14.9 months) for high compared with low ABCB5 expression (optimal cutoff high/low ϭ log 2 (0.06), p ϭ 0.053) when all GBM subtypes were considered together. For the mesenchymal subtype, median survival was significantly lower (10.4 versus 15.9 months) for high versus low ABCB5 expression (optimal cutoff ϭ log 2 (0.92), p ϭ 0.031). For the classical and the proneural subtypes, median survival was nominally lower, with 14.0 versus 14.9 months (high versus low ABCB5 expression, optimal cutoff ϭ log 2 (1.55), p ϭ 0.953) and 12.5 versus 14.9 months (high versus low ABCB5 expression, optimal cutoff ϭ log 2 (0.03), p ϭ 0.453), respectively. These results further underscore the clinical significance of ABCB5 expression in GBM, most notably for the mesenchymal subtype. Immunohistochemical analysis confirmed ABCB5 expression in patient-derived primary GBM tumor biopsy material at the protein level (Fig. 1D).",
                                "It has been recognized that GBM exhibits substantial intertumor heterogeneity and can be distinguished as primary GBM (i.e. presenting as fully developed high-grade gliomas without evidence of a precursor lesion) or secondary GBM, which evolves from less malignant astrocytomas (30). Furthermore, recent TCGA analyses identified the existence of distinct GBM molecular subtypes based on their genomic alterations and characteristic molecular signatures (31). Among them, a proneural subtype with mutations in IDH and TP53 corresponds to secondary GBM and is associated with a better outcome (32). A mesenchymal subtype that carries homozygous PTEN loss corresponds to primary GBM and is associated with a worse outcome (32,33). Here, we examined ABCB5 expression and function in GBM cell lines representative of such molecular subtypes (i.e. the LN-229 and LN-18 cell lines that carry mutations in TP53 and are PTEN WT and the U-87 MG cell line that is characterized by PTEN loss and WT TP53) (34). We found ABCB5 to be expressed in all three human GBM cell lines (LN-229, LN-18, and U-87 MG) by quantitative RT-PCR (Fig. 1E), nested RT-PCR (Fig. 1F), and flow cytometric analysis (Fig. 1G), which showed cell surface expression of ABCB5 on 40.6% (40.6 Ϯ 0.8%, mean Ϯ S.E.) of LN-229, 31.8% (31.8 Ϯ 2.1%, mean Ϯ S.E.) of LN-18, and 16.5% (16.5 Ϯ 0.9%, mean Ϯ S.E.) of U-87 MG GBM cells."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment ABCB5 is expressed by CD133-positive GBM stem cells, and antibody-mediated ABCB5 blockade reduces the frequency of CD133-positive stem cells",
            "paragraphs": [
                "Based on our finding of ABCB5 expression on a subpopulation of GBM cells (Fig. 1G), we hypothesized that ABCB5 might confer therapeutic resistance on GBM CSCs, which are marked by CD133 (2). This hypothesis was supported by previous findings in melanoma and colorectal cancer, where ABCB5 has been shown to be co-expressed with CD133 on therapy-resistant subpopulations of tumor cells (18 -22). To test this further, we first examined CD133 mRNA expression in GBM and LGG RNA-Seq data from TCGA (29). Similar to ABCB5, there was a statistically significant difference in CD133 mRNA expression between means (H ϭ 71.46, p Ͻ 0.0001). CD133 mRNA expression was significantly higher in GBM (8.39 Ϯ 0.14 log 2 (counts), mean Ϯ S.E.) compared with oligodendroglioma (7.21 Ϯ 0.08 log 2 (counts), p Ͻ 0.0001), oligoastrocytoma (7.34 Ϯ 0.08 log 2 (counts), p Ͻ 0.0001), and astrocytoma (7.64 Ϯ 0.09 log 2 (counts), p Ͻ 0.0001) (Fig. 2A). There was no statistically significant difference in expression between oligodendrogli-  "
            ],
            "subsections": []
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "oma and oligoastrocytoma (p Ͼ 0.99) or oligoastrocytoma and astrocytoma (p ϭ 0.40). Additionally, a statistically significant difference was observed between oligodendroglioma and astrocytoma (p ϭ 0.004). CD133 expression positively correlated with ABCB5 in GBM and LGG TCGA RNA-Seq data (r s (667) ϭ 0.26, p Ͻ 0.0001). Moreover, dual-color flow cytometry confirmed co-expression of ABCB5 and CD133 on 2.2% of LN-229, 6.4% of LN-18, and 3.4% of U-87 MG human GBM cells (Fig. 2B). Furthermore, 100% of CD133-positive LN-229 and U-87 MG cells and 93% of CD133-positive LN-18 cells expressed ABCB5. Considering the evidence for the tumorigenic potential of CD133-positive GBM stem cells (2), expression of ABCB5 on CD133-positive CSCs indicates the possibility of targeting GBM growth by functionally inhibiting ABCB5.",
                "Alongside our recent discovery of a novel anti-apoptotic function of ABCB5 in normal stem cells (35) and human colorectal cancer (18), we hypothesized that ABCB5 might also be required for GBM stem cell maintenance and tumor aggressiveness. When LN-229, LN-18, and U-87 MG cells were incubated with 100 g/ml anti-ABCB5 mAb (3C2-1D12) (36) or isotype-matched control mAb for 72 h and expression of CD133 (APC, FL4 fluorescence) was determined by flow cytometry, we found that in vitro treatment of the GBM cell lines LN-229 and LN-18 with anti-ABCB5 mAb reduced the frequency of CD133-positive CSC subpopulations by more than 2-fold compared with treatment with isotype control (ABCB5 mAb versus isotype control: 0.35 Ϯ 0.03% versus 0.83 Ϯ 0.03%, p Ͻ 0.0001, mean Ϯ S.E.) (Fig. 2C), whereas no significant difference in CD133-positive cell frequency was observed in U-87 MG cells after treatment with anti-ABCB5 mAb (ABCB5 mAb versus isotype control: 1.24 Ϯ 0.02% versus 1.02 Ϯ 0.13%, p ϭ 0.1664, mean Ϯ S.E.). These differential responses might be explained by the genetic heterogeneity of the GBM cell lines under study. For example, the LN-229 and LN-18 cell lines have increased mutation burden in DNA repair genes, such as TP53 and WT PTEN mutant, compared with U-87 MG, which is a TP53 WT and PTEN mutant. Moreover, these results suggest that, in U-87 MG, CD133-positive GBM stem cells might utilize additional ABCB5-independent pathways for their survival and could show attenuated responses to ABCB5 blockade in vivo."
            ],
            "subsections": [
                {
                    "title": "Antibody-mediated ABCB5 blockade inhibits proliferation and promotes apoptosis in human GBM",
                    "paragraphs": [
                        "Considering the significance of CD133-positive CSCs in the growth of GBM, we next examined the effect of the reduction in CSC frequency on GBM cell proliferation. We incubated LN-229, LN-18, and U-87 MG cells with 0 -200 g/ml ABCB5 mAb or isotype control mAb for 72 h and analyzed cell proliferation by a 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium diphenyltetrazolium bromide (MTT) assay. There was a statistically significant difference between ABCB5 mAb-treated and isotype control mAb-treated cells as determined by analysis of variance (ANOVA), (F(1, 144) ϭ 48.42, p Ͻ 0.0001). A multiple-comparison test showed that anti-ABCB5 mAb inhibited the proliferation of GBM cells and that this inhibition was statistically significant at concentrations Ն20 g/ml (concentrations, adjusted p values as follows: 20, 0.0293; 50, 0.0021; 100, Ͻ0.0001; 200, Ͻ0.0001) (Fig. 3A). Furthermore, antibody-mediated ABCB5 blockade led to increased apoptosis of GBM cells. LN-229, LN-18, and U-87 MG cells incubated with 100 g/ml ABCB5 mAb versus isotype-matched control antibody for 72 h showed a 2.3-fold increase in the percentage of apoptotic cells (early ϩ late) (ABCB5 mAb versus isotype control: 23.90 Ϯ 3.5% versus 10.55 Ϯ 1.6%, p Ͻ 0.01, mean Ϯ S.E.) (Fig. 3B) as determined by dual-color flow cytometry using annexin V (APC, FL4 fluorescence) and propidium iodide (FL2 fluorescence) staining. These results suggest that, similar to its role in normal stem cells (35), ABCB5 serves as a growth-inducing and anti-apoptotic molecule in GBM.",
                        "To evaluate the potential role of ABCB5 in GBM growth in vivo, we tested the effect of ABCB5 blockade on tumor growth in an established human-to-mouse GBM xenotransplantation model (2,37). In this experiment, we employed LN-229 and U-87 MG GBM cell lines, which exhibited differential CD133positive GBM stem cell response to ABCB5 blockade in vitro, to test whether this in vitro response translates into an in vivo effect on tumor growth. The LN-18 cell line was excluded from the in vivo study as, consistent with published reports, it reproducibly failed to form tumors (38). LN-229 and U-87 MG GBM cells were injected subcutaneously into immunodeficient NOD/SCID IL2r␥ Ϫ/Ϫ (NSG) mice as described (2,37) "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment Targeted ABCB5 blockade augments TMZ-mediated inhibition of GBM cell proliferation and promotes drug-induced apoptosis in vitro and in vivo",
            "paragraphs": [
                "To further dissect a potential role of ABCB5 in GBM therapeutic resistance, we subjected GBM cell cultures to TMZ treatment in combination with mAb-mediated ABCB5 blockade. LN-229, LN-18, and U-87 MG cells were preincubated for 2 h with 100 g/ml ABCB5 mAb or isotype control mAb and then treated with TMZ (0 -1000 M) for 72 h. A statistically significant reduction in cell proliferation as measured by MTT assay was observed by ANOVA (F(1, 160) ϭ 1756, p Ͻ 0.0001), and a multiple-comparison test showed that the inhibitory effect of TMZ on proliferation of GBM cells was further augmented by antibody-mediated blockade of ABCB5 and that this inhibitory effect was statistically significant at all time points measured with the exception of the highest concentration of TMZ (1000 M) (adjusted p value Ͻ0.0001 for concentrations of Յ200 M, p ϭ 0.0101 at 500 M) (Fig. 4A). Targeted inhibition of ABCB5 also augmented TMZ-induced apoptosis of GBM cells as determined by dual-color "
            ],
            "subsections": []
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "flow cytometry using annexin V (APC, FL4 fluorescence) and propidium iodide (FL2 fluorescence) staining. GBM cells preincubated for 2 h with 100 g/ml ABCB5 mAb followed by treatment with 100 M TMZ for 72 h showed an increased percentage (2.3-fold) of apoptotic cells (early ϩ late) compared with those incubated with isotype control mAb (ABCB5 mAb versus isotype control: 43.5 Ϯ 0.7% versus 18.6 Ϯ 1.2%, p Ͻ 0.0001, mean Ϯ S.E.) (Fig. 4B), suggesting that ABCB5 might serve as a mediator of TMZ resistance in human GBM.",
                "To test whether mAb-mediated ABCB5 blockade led to sensitization of established GBM tumors in vivo, we subjected  ABCB5 targeting sensitizes GBM to temozolomide treatment 75.52 mm 3 versus 372.3 Ϯ 107.4 mm 3 , p ϭ 0.059, mean Ϯ S.E.) (Fig. 4C). Tumors from mice injected with LN-229 cells treated with TMZ in the presence of ABCB5 mAb exhibited a 1.5-fold decrease in Ki-67 (ABCB5 mAb versus isotype control: 27.8 Ϯ 2.1% versus 40.9 Ϯ 4.6%, p ϭ 0.03, mean Ϯ S.E.) and a 3.0-fold increase in cleaved caspase-3 (ABCB5 mAb versus isotype control: 4.8 Ϯ 0.6% versus 1.6 Ϯ 0.2%, p ϭ 0.0013, mean Ϯ S.E.) (Fig. 4, D andE) positive nuclei compared with isotype control mAb-treated mice. These findings underline the potential role of ABCB5 targeting in the reversal of GBM therapeutic resistance to TMZ and also highlight differential response of GBM tumors to mAb-mediated ABCB5 blockade based on tumor molecular subtype and differences in growth kinetics."
            ],
            "subsections": [
                {
                    "title": "Antibody-mediated blockade of ABCB5 releases GBM cells from TMZ-induced G 2 /M arrest",
                    "paragraphs": [
                        "To examine potential molecular mechanisms responsible for the attenuation of GBM tumor growth in the presence of TMZ and mAb-mediated ABCB5 blockade, we performed microarray gene expression analyses of ABCB5-positive and ABCB5-negative cells sorted by flow cytometry from U-87 MG, LN-18, and LN-229 GBM cell lines. Principal component analysis performed on all genes detected by microarray showed separation specific to the cell lines on PC1 and PC2, whereas PC3 separated the ABCB5-positive and ABCB5negative cells (Fig. 5A). We generated a list of 1661 genes differentially expressed (p Ͻ 0.05) between the ABCB5-positive and ABCB5-negative cells in all three cell lines and used this list as input into ingenuity pathway analysis (IPA). IPA determined 489 disease and functional categories to be enriched between the ABCB5-positive and ABCB5-negative cells. Strikingly, 13.7% of these total categories were related to cell cycle (as compared with 5.9% for cancer and 7.6% for neuro/nervous system) (Fig. 5B). Specific enriched categories (reported as Ϫlog  A, principal component analysis of all genes detected by microarray analysis of FACS-sorted ABCB5-positive and ABCB5-negative GBM cells (n ϭ 3). B, percentage of categories with key words of interest out of 489 total diseases and function categories. C, diseases and functions determined by IPA to be enriched between ABCB5-positive and ABCB5-negative GBM cells (n ϭ 3). The p value for a given annotation is calculated by Fisher exact test using the number of focus genes that participate in that process in relation to the total number of genes associated with that process in the IPA knowledgebase. Genes identified by our study listed to the right."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "Based on these results and previous reports showing that TMZ-induced G 2 /M cell cycle arrest is responsible for the development of GBM chemoresistance and recurrence (16,39,40), we examined whether ABCB5 blockade could reverse GBM chemoresistance through modulation of the G 2 /M checkpoint regulators and subsequent reversal of drug-induced G 2 /M arrest. LN-229, LN-18, and U-87 MG cells were preincubated for 2 h with 100 g/ml ABCB5 mAb or isotype control mAb followed by treatment with 100 M TMZ for 72 h. Cells were fixed in ice-cold ethanol and stained in propidium iodide/ RNase buffer, and DNA content was analyzed by flow cytometry following FL2H versus FL2W analysis for doublet elimination (Fig. 6A). We found that antibody-mediated functional inhibition of ABCB5 is capable of abrogating TMZ-induced G 2 /M arrest in GBM cell cultures, as evidenced by the 1.4-fold reduced cell accumulation in G 2 /M phase of the cell cycle following ABCB5 mAb and TMZ treatment, compared with cells that received TMZ treatment in the presence of isotype control (ABCB5 mAb versus isotype control: 18.9 Ϯ 2.5% versus 25.76 Ϯ 4.6%, p ϭ 0.0225, mean Ϯ S.E.) (Fig. 6B). Western blot analysis revealed that ABCB5 blockade reversed TMZ-mediated G 2 /M arrest by inhibiting cell-cycle arrest-inducing checkpoint molecules (ATM, CHK1, WEE1, and MYT1), and augmenting the activation of molecules that drive cells from G 2 phase to mitosis by either inducing their phosphorylation (as for PLK1) or by removing their inhibitory phosphorylation (as for CDC25C and CDC2) (Fig. 6C). In support of these in vitro findings, similar changes in cell cycle protein expression were observed in tumor xenografts from mice treated with TMZ in the presence of either ABCB5 mAb or isotype control mAb (Fig. 6D).    "
            ],
            "subsections": []
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "phorylation and induced PLK1 phosphorylation in U-87 MG cells (Fig. 7E)."
            ],
            "subsections": [
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "In the current study, based on previously established functions in diverse malignancies (18,21,(24)(25)(26)(27)(28), we examined the potential of ABCB5 as a novel therapeutic target in GBM. Our results revealed ABCB5 expression in primary human GBM tumors and three established GBM cell lines. Using mAb-based ABCB5 inhibition strategies in vitro or ABCB5 blockade in tumor xenotransplantation models in vivo, we show for the first time that targeting ABCB5 can significantly inhibit tumor growth and sensitize a TP53 mutant PTEN WT GBM subtype to TMZ treatment. We demonstrate that ABCB5 inhibition results in modulation of the G 2 /M checkpoint regulators and subsequent reversal of TMZ-induced G 2 /M arrest.",
                        "The finding of specific ABCB5 overexpression in human GBM compared with less aggressive brain tumors and the significant correlation of ABCB5 expression with OS among GBM patients points to a potential role of ABCB5 as a determinant of GBM aggression and therapeutic resistance. This is further supported by the observed expression of ABCB5 on CD133positive GBM CSCs and a significant positive correlation between CD133 and ABCB5 expression in clinical GBM specimens. CD133-positive GBM subpopulations are enriched for CSCs and exhibit higher rates of self-renewal, proliferation, and tumorigenicity compared with CD133-negative populations (2,37,41). Moreover, enrichment of CD133-positive CSCs is observed in GBM cultures, xenografts, and clinical tumor specimens following radiation and chemotherapy (3,6,42), highlighting their role in GBM progression and therapy resistance. Our data indicate that, similar to its function in normal tissue stem cells (35), ABCB5 contributes significantly to the survival of GBM CSCs, because antibody-mediated ABCB5 blockade leads to a significant decline in the CD133-positive CSC subpopulation in human GBM cell lines. Our finding that ABCB5 blockade can attenuate proliferation and promote apoptosis underscores the potential role of ABCB5 targeting in the reversal of CSC-mediated GBM tumorigenesis.",
                        "Whereas TMZ remains one of the main therapeutic agents in GBM, less than 50% of patients respond to TMZ therapy (43). Here we identified ABCB5 as a potential mechanism of GBM resistance to TMZ. It has been well-established that in GBM, TMZ can induce G 2 /M arrest through activation of ATM/ ATR-Chk1/2 (9, 10), which is a prosurvival mechanism that enables cancer cells to repair their DNA prior to mitosis entry. Inhibition of the cell-cycle arrest may result in mitotic catastrophe and cell death (16). Our finding of specific enrichment of cell-cycle regulation-related gene categories, such as Cell Cycle: Aneuploidy (3.22), Cell Cycle: Spindle Checkpoint (2.36), and Cell Cycle: G 2 /M Transition (2.28), in ABCB5-positive GBM cells (Fig. 5B) suggests that ABCB5 blockade might potentiate growth-inhibitory and pro-apoptotic effects of TMZ through revocation of G 2 /M cell cycle arrest.",
                        "We found that treatment with TMZ triggered G 2 /M arrest in GBM cells by inducing phosphorylation and activation of ATM and CHEK1, inhibitory Ser-216 phosphorylation of CDC25C, retention of inhibitory Tyr-15 phosphorylation of CDK1, acti-vation of the inhibitory kinases WEE1 and MYT1, and finally, accumulation of cyclin B1, whereas ABCB5 blockade inhibited this arrest-inducing signaling. Treatment of GBM cells with TMZ in the presence of ABCB5 mAb removed the inhibitory phosphorylation of CDC25C and CDK1, thereby activating CDC25C and the cyclin B1/CDK1 complex. This activation of CDC25C and CDK1 triggered by ABCB5 mAb-mediated inhibition of ATM and CHEK1 and by activation of PLK1 that inhibits the inhibitory kinases WEE1 and MYT1 represents a major positive regulator of G 2 /M transition (14). Abrogation of the G 2 /M checkpoint through inactivation of ATM and CHEK1 has been shown to sensitize GBM and other cancer cells to drug cytotoxicity (16,44). As a corollary to these reports, our data indicate that attenuation of TMZ-induced G 2 /M arrest by ABCB5 blockade sensitized GBM cells to drug-mediated death, as was evident from increased apoptosis and decreased proliferation of GBM cells upon combined treatment with TMZ and ABCB5 mAb. Nevertheless, we cannot exclude the possibility that, in addition to cell-cycle regulation, ABCB5 might also function as a GBM efflux transporter, a function previously attributed to other ABC family members, such as ABCB1 and ABCG2 (45)(46)(47). Further studies would be required to investigate this possibility.",
                        "Furthermore, several recent studies demonstrated that there is significant intertumor heterogeneity in human GBM and identified GBM molecular subtypes associated with diverse patient outcomes (31)(32)(33). Proneuronal or secondary GBM is characterized by mutations in IDH and TP53 with WT PTEN status. It has features of neuronal differentiation and is associated with better outcomes (32). Primary GBM possesses a mesenchymal molecular subtype with EGFR amplification and PTEN loss. It presents at an older age and has worse outcomes (32). Here we found that, whereas ABCB5 blockade exhibited significant anti-tumor activity in all cell lines in vitro, the in vivo inhibitory effect on tumor growth was more pronounced in TP53-mutant PTEN-WT LN-229 cells compared with TP53-WT PTEN-mutant U-87 MG cells. Several factors might be contributing to this differential in vivo response. Our recent discoveries that ABCB5 serves as a critical mediator of receptor tyrosine kinase signaling with growth-inducing and anti-apoptotic functions in normal tissues and cancer (35,48) suggest that constitutive activation of this pathway in the setting of PTEN loss in U-87 MG cells can override the effect of ABCB5 blockade. This mechanism might be responsible for the limited impact of ABCB5 blockade on CD133-positive GBM CSC frequency in U-87 MG cells compared with LN-229 and LN-18 cells. As in vivo tumor growth is primarily driven by CSC, lack of an inhibitory effect on CSC frequency might also be responsible for the limited in vivo effect of ABCB5 inhibition in U-87 MG tumors. Last, the significantly larger tumor sizes in more rapidly growing U-87 MG xenografts could have adversely affected ABCB5 mAb tumor penetration and thus attenuated the effect of ABCB5 blockade on tumor growth. More extensive preclinical studies are needed to further refine ABCB5 targeting strategies for optimal clinical translation.",
                        "Our current data define a novel role of ABCB5 in GBM and elucidate a molecular mechanism underlying ABCB5-mediated GBM tumor progression and chemoresistance. They under-"
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "score the potential role of ABCB5 targeting as a novel \"two-hit\" therapeutic strategy in combating GBM via conferring chemosensitivity as well as targeting those very subpopulations that drive tumor growth."
            ],
            "subsections": [
                {
                    "title": "Experimental procedures",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "GlioVis",
                            "paragraphs": [
                                "Glioblastoma and lower-grade glioma adult brain tumor copy number alteration and RNA-Seq data sets from TCGA were queried for ABCB5 and PROM1 (CD133), whereas glioblastoma survival and patient outcomes based on subtype were queried for ABCB5 expression from RNA-Seq data sets (29). All human studies were approved by the Institutional Review Board of Partners HealthCare, and the studies abide by the Declaration of Helsinki principles."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Cell culture",
                            "paragraphs": [
                                "Authenticated human GBM cell lines U-87 MG, LN-18, and LN-229 were obtained from American Type Culture Collection (ATCC, Manassas, VA). LN-18 and LN-229 were cultured in Dulbecco's modified Eagle's medium, and U-87 MG was cultured in Eagle's minimum essential medium (ATCC, Manassas, VA) supplemented with 10% (v/v) FBS (Invitrogen GIBCO, Waltham, MA) and 1% (v/v) penicillin/streptomycin (Lonza Bio-Whittaker, Walkersville, MD). For antibody-mediated inhibition of ABCB5, GBM cells were incubated with designated doses of anti-ABCB5 mAb (clone 3C2-1D12) (36) or MOPC31C isotype control mAb (Sigma-Aldrich) for 72 h. All experiments were performed with cell lines that tested negative for mycoplasma (Lonza, Portsmouth, NH)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "RNA extraction and RT-PCR",
                            "paragraphs": [
                                "RNA was prepared from U-87 MG, LN-18, and LN-229 GBM or G3361 melanoma cells using a RNeasy Plus isolation kit (Qiagen, Germantown, MD) and reverse-transcribed using an Advantage RT-for-PCR Kit (Clontech, Mountain View, CA) according to the manufacturer's instructions. cDNA was then subjected to PCR amplification of the full ABCB5 ORF (transcript variant 2, mRNA NCBI reference sequence: NM_ 178559.5) as described previously for human skin cells (31), using equivalent oligonucleotides ORF-forward (ATG-GTGGATGAGAATGACATCAGAG) and ORF-reverse (AAC-TGCTTTACAAGCAAATGTGCTAG). For sequencing reactions, the PCR product was then used as a template for nested PCR of three overlapping fragments encompassing the ORF: N-terminal, forward (ATGGTGGATGAGAATGACATCAGAGCTTT) and reverse (GAATTAAATAGGCTCCAAATCGAAACCCT); middle, forward (AATGACTGGATTTGCCAACAAAGATA-AGC) and reverse (TTCTCAGGGAGACCTTCAATAAAAGA-ATG); and C-terminal, forward (AAATAG CAATCGTTCCTC-AAGAGCCTGTG) and reverse (TCACTGCACTGACTGTGC-ATTCACTAACT). All PCRs used Q5 high-fidelity polymerase (New England Biolabs). The full ORF sequences of ABCB5 (transcript variant 2, mRNA NCBI reference sequence: NM_178559.5) expressed by the human LN-229, LN-18, and U-87 MG glioblastoma cell lines were submitted to the Gen-Bank TM database under the following accession numbers: MK803369, MK803368, MK803366, and MK803367."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Flow cytometric analyses of ABCB5 and CD133 expression",
                            "paragraphs": [
                                "U-87 MG, LN-18, and LN-229 GBM cells were harvested with Versene (Invitrogen GIBCO) and stained with FITC-conjugated mouse monoclonal anti-ABCB5 antibody (clone 3C2-1D12) (21,36) or CFS-conjugated mouse IgG1 isotype control (R&D Systems, Minneapolis, MN) and APC-conjugated CD133/2 (293C3) (Miltenyi Biotech, Cambridge, MA) or APCconjugated mouse isotype control (R&D Systems)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Generation of stable ABCB5 knockdown glioblastoma cell variants",
                            "paragraphs": [
                                "Generation of stable LN-229 and U-87 MG ABCB5 KD or their respective shControl cell variants was accomplished described (18,48), followed by puromycin selection (2 g/ml). Reduction of ABCB5 protein expression in ABCB5 KD cell lines was confirmed by IP-Western blotting. Briefly, 5 mg each of sonicated and precleared total cell lysates were prepared in RIPA buffer (Boston BioProducts, Ashland, MA) plus protease inhibitor (Sigma-Aldrich) before incubation with 2 g of anti-ABCB5 rabbit polyclonal antibody (Abgent/Abcepta, San Diego, CA) with protein A/G-agarose for 3 h at 4 °C. After washing three times, SDS-PAGE and Western blotting was performed, using the same antibody."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Cell proliferation assay",
                            "paragraphs": [
                                "Cell proliferation was measured by an MTT Cell Proliferation Assay Kit (Trevigen, Gaithersburg, MD) following the manufacturer's protocol. Briefly, 1 ϫ 10 4 cells were seeded in 100 l of culture medium per well of 96-well plates. Following treatment with anti-ABCB5 mAb or isotype control mAb in the absence or presence of TMZ, 10 l of MTT reagent was added to each well. Once purple crystals of formazan were visible, 100 l of detergent reagent was added, and the cells were incubated in the dark for 2-4 h until the crystals became soluble. Absorbance was measured at 570 nm and corrected against blank wells, which consisted of culture medium alone and were processed in the same way as above. "
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "ABCB5 targeting sensitizes GBM to temozolomide treatment",
            "paragraphs": [
                "or its vehicle. Intraperitoneal injection of anti-ABCB5 mAb or the isotype control mAb was started a week before the initiation of daily intraperitoneal injections of TMZ. TMZ was freshly dissolved in 10% DMSO and diluted in saline before every injection. Tumor volumes were measured twice every week according to the established formula, tumor volume (mm 3 ) ϭ /6 ϫ 0.5 ϫ length ϫ (width) 2 (24). All experimental procedures were reviewed and approved by Boston Children's Hospital and the Veterans Affairs Boston Animal Care and Use Committee."
            ],
            "subsections": [
                {
                    "title": "Immunohistochemistry",
                    "paragraphs": [
                        "Immunohistochemical staining for Ki-67 and cleaved caspase-3 on deparaffinized 5-m sections of GBM tumor xenografts was done as described previously (18), using anti-Ki-67 (Vector Laboratories, Burlingame, CA) and anti-cleaved caspase-3 (Cell Signaling Technology, Danvers, MA) antibodies. For quantitative analyses of Ki-67 and cleaved caspase-3 expression in the xenograft tumors, slides were scanned via the Aperio Digital Pathology Service provided by the Research Pathology Cores, Dana-Farber/Harvard Cancer Center (Boston, MA). Nuclear staining algorithms were utilized for enumeration of the positive cells."
                    ],
                    "subsections": []
                },
                {
                    "title": "Apoptosis assay",
                    "paragraphs": [
                        "GBM cells were treated with anti-ABCB5 mAb or isotype control mAb in the absence or presence of TMZ for 72 h. Induction of apoptosis by antibody-mediated ABCB5 blockade was detected by flow cytometry using APC annexin V and PI (BD Biosciences) staining as per the manufacturer's protocol."
                    ],
                    "subsections": []
                },
                {
                    "title": "Microarray analyses",
                    "paragraphs": [
                        "Microarray analyses were performed by the Microarray Core Facility at the Dana-Farber Cancer Institute using HTA 2.0 human arrays. FACS-sorted ABCB5-positive and ABCB5-negative cells isolated from U-87 MG, LN-18, and LN-229 GBM cell lines were compared. Data were preprocessed using the R Bioconductor oligonucleotide package (49) with the RMA normalization method. Differentially expressed genes were identified using the R Bioconductor limma package (50, 51) with predefined criteria, followed by input of these genes into Ingenuity Pathway Analysis (52)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell cycle analysis",
                    "paragraphs": [
                        "Cell cycle distribution was determined by flow cytometry using PI/RNase staining buffer (BD Biosciences) following the manufacturer's protocol. Briefly, harvested cells were washed in PBS and fixed in ice-cold 70% ethanol overnight. The fixed cells were washed in PBS and resuspended in PI/RNase staining buffer. Following incubation at 37 °C for 30 min, the fractions of cells in G 0 /G 1 , S, and G 2 /M phase were analyzed by flow cytometry at an excitation wavelength of 488 nm and an emission wavelength of 630 nm (53)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Western blotting",
                    "paragraphs": [
                        "Protein lysates were prepared from cultured GBM cells or excised human GBM xenograft tumors in RIPA buffer (Cell Signaling Technology, Danvers, MA) supplemented with protease inhibitor mixture (Sigma-Aldrich). Normalized protein lysates were run on SDS-polyacrylamide gels and transferred to a polyvinylidene difluoride membrane (GE Healthcare). The membranes were incubated with either rabbit anti-␤-actin (D6A8), mouse anti-␤-actin (8H10D10), anti-phospho-ATM (Ser-1981) (D6H9), anti-ATM (D2E2), anti-phospho-CHEK1 (Ser-345) (133D3), anti-CHEK1 (2G1D5), anti-phospho-CDC25C (Ser-216) (63F9), anti-CDC25C (5H9), anti-phospho-PLK1 (Thr-210) (D5H7), anti-PLK1 (208G4), anti-cyclin B1 (D5C10), anti-phospho-CDC2 (Tyr-15) (10A11), anti-CDC2, anti-phospho-WEE1 (Ser-642) (D47G5), anti-WEE1 (D10D2), or anti-MYT1 (Cell Signaling Technology, Danvers, MA) and subsequently incubated with peroxidase-linked secondary antibody. The reactive bands were detected using chemiluminescent substrate (Thermo Scientific)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Capillary Western blotting analyses",
                    "paragraphs": [
                        "Capillary Western analyses were performed on a Western blotting system (ProteinSimple) according to the manufacturer's instructions. In brief, protein lysates were prepared from cultured GBM cells in RIPA buffer and diluted to 2 g/l in sample buffer. The diluted samples were combined with fluorescent master mix and heated for 5 min at 95 °C. The prepared samples, blocking reagent, primary antibodies (1:20 dilution for CDC25C, PLK1, cyclin B1, CDC2, WEE1, and MYT1; 1:10 dilution for CHEK1; 1:5 dilution for phospho-CHEK1, phospho-CDC25C, phospho-PLK1, phospho-CDC2, and phospho-WEE1; and 1:80 dilution for mouse and rabbit ␤-actin), secondary antibodies, and chemiluminescent substrate were pipetted into designated wells in the assay plate. The electrophoresis and immunodetection steps were carried out in the fully automated capillary system. Data were analyzed using Compass software (ProteinSimple)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistics",
                    "paragraphs": [
                        "The data are expressed as mean Ϯ S.E. of three or more independent experiments. A Kruskal-Wallis test with Dunn's multiple-comparison test with a single pooled variance was used to determine statistically significant difference in the TCGA RNA-Seq data, with p Ͻ 0.05 considered significant. To determine the cutoff between high and low ABCB5 expression in the GBM RNA-Seq data and for the different GBM subtypes, the R package maxstat was used to identify the cut point based on the maximally selected rank statistic. Statistically significant difference in expression level of markers, percentage of apoptotic cells, DNA content of cells, and tumor weight between different groups was determined by unpaired and paired t test, with p Ͻ 0.05 considered significant. Statistically significant difference in cell growth kinetics or tumor growth kinetics between different groups was determined using two-way ANOVA and Sidak's multiple-comparison test, with p Ͻ 0.05 considered significant."
                    ],
                    "subsections": []
                },
                {
                    "title": "Data availability",
                    "paragraphs": [
                        "The full ORF sequences of ABCB5 (transcript variant 2, mRNA NCBI reference sequence: NM_178559.5) expressed by the human LN-229, LN-18, and U-87 MG glioblastoma cell lines were submitted to the GenBank TM database under the following accession numbers: MK803369, MK803368, ABCB5 targeting sensitizes GBM to temozolomide treatment MK803366, and MK803367. The microarray analyses were deposited to the Gene Expression Omnibus under accession number GSE127895."
                    ],
                    "subsections": [
                        {
                            "title": "Edited by Xiao-Fan Wang",
                            "paragraphs": [
                                "This work was supported by National Institutes of Health Grant T32 EB016652-05 (to C. A. A. L.); Vetarans Affairs BLR&D Grant 1I01BX000516 and RR&D Grant 1I01RX000989, Merit Review Awards, and a Department of Defense translational team science award (to N. Y. F.); NCI, National Institutes of Health, Grants R01CA113796, R01CA158467, and R01CA138231 (to M. H. F.); and NEI, National Institutes of Health, Grants 1RO1EY025794 and R24EY028767 (to M. H. F. and N. Y. F.). N. Y. F. and M. H. Brigham and Women's Hospital, Boston, Massachusetts, and licensed to Ticeba GmbH (Heidelberg, Germany"
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        }
    ]
}