{
    "id": "US20140088890",
    "authors": [
        "Xiuchun Hao",
        "Yonggang Jiang",
        "Takayuki Fujita",
        "Kohei Higuchi",
        "Kazusuke Maenaka",
        "Hidekuni Takao"
    ],
    "title": "METHOD FOR TEMPERATURE COMPENSATION IN SENSOR, COMPUTATION PROGRAM FOR METHOD FOR TEMPERATURE COMPENSATION, COMPUTATION PROCESSING DEVICE, AND SENSOR",
    "date": "2012-05-31 00:00:00",
    "abstract": "Temperature compensation is performed using a computation program for temperature compensation, a computation processing, and a sensor. Deformation in a diaphragm caused by a pressure change due to the temperature of the gas in a cavity is cancelled out, and deformation of the diaphragm is minimized within the target temperature range, thereby allowing an optimum temperature compensation to be performed. The temperature compensation in a capacitance-type sensor executes calculation steps which include including a calculation step (S17) of acquiring the amount of change ΔC′ in capacitance. A parameter ΔC′ is obtained, through which it is possible to determine the degree of compensation for the deformation in the diaphragm section caused by a pressure change due to the temperature changes of the gas in the hermetically sealed space.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a method for temperature compensation in a sensor, a computation program for the method for temperature compensation, a computation processing device carrying out a computation process of the computation program, and a sensor that is subjected to the temperature compensation."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to temperature compensation"
                    ],
                    "num_characters": 309,
                    "outline_medium": [
                        "relate to temperature compensation"
                    ],
                    "outline_short": [
                        "define technical scope"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "A semiconductor pressure sensor conventionally includes a micro-cavity and a thin diaphragm that covers a surface of the micro-cavity, and serves as a pressure gauge by measuring a change in a resistance formed on a surface of the diaphragm resulting from deformation of the diaphragm caused by external pressure, or with another electrode provided on the opposite pole, measuring a change in the capacitance between the diaphragm and the counter electrode.",
                        "In a pressure sensor configured as described above, in cases where the inside of the cavity is vacuumed and sealed, the deformation of the diaphragm is caused by a difference between outside pressure and vacuum pressure. That is, the pressure sensor corresponds to an absolute pressure sensor. On the other hand, in cases where a gas of a certain pressure is sealed in the cavity, the deformation of the diaphragm is caused by a difference between the outside pressure and the pressure of the gas in the cavity. That is, the pressure sensor is a relative pressure sensor. Even though it suffers from difficulty in keeping the inside of the cavity in vacuum, the absolute pressure sensor with the inside of the cavity vacuumed and sealed advantageously facilitates temperature compensation for a pressure sensor because the effect of the temperature-dependent contraction of the internal gas is negligible. On the other hand, since the inside of the cavity is sealed in vacuum, the diaphragm is already significantly deformed under an outside pressure of, for example, 1 atm. Thus, for the pressure sensor used at about 1 atm, it is disadvantageously difficult to use a thinner diaphragm to increase pressure sensitivity.",
                        "On the other hand, as an example of the relative pressure sensor, a capacitive pressure sensor is well-known which has a diaphragm portion that is deformable depending on pressure, which is a type of physical quantity, as typified by Patent Literature 1. Patent Literature 1 discloses a capacitive pressure sensor including a sensor chip having a first substrate with an electrode portion formed thereon and a second substrate with a diaphragm portion that is deformable depending on pressure formed thereon, a cavity portion formed in such a way that the diaphragm portion is associated with the electrode portion so as to face each other via a gap, and a sealing material externally sealing the cavity portion, the first substrate and the second substrate being bonded together, a gap width of the gap being changed depending on a difference between a pressure to be measured applied to the diaphragm portion and a pressure in the cavity portion so that the pressure difference is detected based on a change in the capacitance between the diaphragm portion and the electrode portion caused by the change in the gap width, wherein the capacitive pressure sensor further has a closure member that closes an inside of the cavity portion."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce semiconductor pressure sensor",
                        "describe absolute pressure sensor",
                        "limitations of absolute pressure sensor",
                        "introduce relative pressure sensor",
                        "describe capacitive pressure sensor"
                    ],
                    "num_characters": 2917,
                    "outline_medium": [
                        "describe semiconductor pressure sensor",
                        "discuss limitations of absolute and relative pressure sensors"
                    ],
                    "outline_short": [
                        "summarize prior art limitations"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Technical Problem",
                            "paragraphs": [
                                "The relative pressure sensor has an advantage in particular when outside air of about 1 atm is to be measured with a gas of about 1 atm sealed in the cavity. In this case, since the difference in pressure between the sealed gas and the outside air is small and the deformation of the diaphragm is insignificant, a thinner diaphragm can be provided, enabling an increase in sensitivity at about 1 atm. However, disadvantageously, since a gas is sealed in the cavity, a change in the temperature in the cavity varies the internal pressure, hindering deformation associated with the temperature of the diaphragm from being compensated for, as defined by the combined gas law.",
                                "Thus, an object of the present invention is to provide a method for temperature compensation in a sensor, a computation program for the method for temperature compensation, a computation processing device carrying out a computation process of the computation program, and a sensor in which optimum temperature compensation can be achieved by cancelling out deformation of a diaphragm caused by a change in pressure associated with the temperature of a gas in the cavity (thermal expansion of the gas sealed in the cavity) to suppress the deformation of the diaphragm within an intended temperature range."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate relative pressure sensor",
                                "limitations of sealed gas cavity"
                            ],
                            "num_characters": 1278,
                            "outline_medium": [
                                "identify limitations of relative pressure sensor"
                            ],
                            "outline_short": [
                                "identify limitations of relative pressure sensor"
                            ]
                        },
                        {
                            "title": "Solution to Problem",
                            "paragraphs": [
                                "(1) The present invention provides a method for temperature compensation in a sensor including a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally having a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space.",
                                "The configuration in (1) can achieve optimum temperature compensation by cancelling out the deformation of the diaphragm portion caused by a change in pressure associated with the temperature of the gas in the closed space (thermal expansion of the gas sealed in the closed space) to suppress the deformation of the diaphragm portion within an intended temperature range.",
                                "Moreover, the configuration in (1) carries out effective temperature compensation to allow a sensor with a thin diaphragm to be designed and produced, thus enabling an increase in the sensitivity of the sensor.",
                                "The “compensation for the deformation of the diaphragm portion” in the present invention includes completely zeroing the amount of deformation of the diaphragm portion and approximating the amount of deformation of the diaphragm portion to zero.",
                                "(2) In the method for temperature compensation in the sensor in (1), preferably, the sensor is configured as a capacitive sensor including the substrate, the ring-like conductive portion having an inner diameter of 2R2 and an outer diameter of 2R3, the diaphragm portion formed on the surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being shaped like a circular plate that is deformable depending on pressure and having an outer diameter of 2R3, the temperature compensation member being a ring-shaped temperature compensation ring that has an inner diameter of 2R1 and an outer diameter of 2R3, and a part of the closed space being formed by the inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, and the method includes a computation step (1) of dividing, based on Timoshenko's symmetric circular plate theory, a composite circular plate configured such that center axes of the conductive portion, the diaphragm portion, and the temperature compensation ring align with one another into a first segment including a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion, a second segment including a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion and the temperature compensation ring, and a third segment including a portion with a radius of R2 to R3 based on the center axes of the conductive portion, the diaphragm portion, and the temperature compensation ring,",
                                "a computation step (2) of determining, based on Kirchhoff's circular plate theory, strains ∈0rr and ∈0θθ of a reference plane (z=0) in a stacking direction of the first to third segments (a direction of a Z axis) shown below in Formulae (5) and (6), using Formulae (1) to (4) shown below and representing relations between strains ∈rr and ∈θθ and displacements κr and κθ, in a radial direction (a direction of an r axis) and a circumferential direction (θ),",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 1} \\right\\rbrack & \\; \\\\\n{ɛ_{rr} = {ɛ_{rr}^{0} + {z\\; \\kappa_{r}}}} & (1) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 2} \\right\\rbrack & \\; \\\\\n{ɛ_{\\theta\\theta} = {ɛ_{\\theta\\theta}^{0} + {z\\; \\kappa_{\\theta}}}} & (2) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 3} \\right\\rbrack & \\; \\\\\n{\\kappa_{r} = {{{- {^{2}\\omega}}\\text{/}{r^{2}}} = {{- {\\theta}}\\text{/}{r}}}} & (3) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 4} \\right\\rbrack & \\; \\\\\n{\\kappa_{\\theta} = {{{- \\left( {1/r} \\right)}\\left( {{\\omega}\\text{/}{r}} \\right)} = {- \\left( {\\theta \\text{/}r} \\right)}}} & (4) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 5} \\right\\rbrack & \\; \\\\\n{ɛ_{rr}^{0} = \\frac{u_{0}}{r}} & (5) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 6} \\right\\rbrack & \\; \\\\\n{ɛ_{\\theta\\theta}^{0} = \\frac{u_{0}}{r}} & (6)\n\\end{matrix}\\)",
                                "a computation step (3) of inputting Young's modulus E and Poisson's ratio ν to Formula (7) shown below to determine a matrix [Q],",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 7} \\right\\rbrack & \\; \\\\\n{\\lbrack Q\\rbrack = {\\frac{E}{1 - v^{2}}\\begin{Bmatrix}\n1 & v \\\\\nv & 1\n\\end{Bmatrix}}} & (7)\n\\end{matrix}\\)",
                                "a computation step (4) of inputting the matrix [Q], the strains ∈0rr and ∈0θθ, the displacements κr and κθ, a coefficient of thermal expansion α, and a temperature difference ΔT (a difference between a reference temperature T0 in an initial state during compensation for deformation of the diaphragm portion and a temperature T1 resulting from a change) to a constitutive equation for stress on a linearly elastic symmetric circular plate with traverse isotropy shown below in Formula (8) to determine a stress σrr in the radial direction (the direction of the r axis) and a stress σθθ in the circumferential direction (θ),",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 8} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\n\\sigma_{rr} \\\\\n\\sigma_{\\theta\\theta}\n\\end{Bmatrix} = {\\lbrack Q\\rbrack \\left( {\\begin{Bmatrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{Bmatrix} + {Z\\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{\\theta}\n\\end{Bmatrix}} - \\begin{Bmatrix}\n{{\\alpha\\Delta}\\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{Bmatrix}} \\right)}} & (8)\n\\end{matrix}\\)",
                                "a computation step (5) of inputting the matrix [Q] to Formulae (9) to (11) shown below to compute matrixes [A], [B], and [D],",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 9} \\right\\rbrack & \\; \\\\\n{\\lbrack A\\rbrack = {\\begin{bmatrix}\nA_{11} & A_{12} \\\\\nA_{21} & A_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack \\ {z}}}}} & (9) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 10} \\right\\rbrack & \\; \\\\\n{\\lbrack B\\rbrack = {\\begin{bmatrix}\nB_{11} & B_{12} \\\\\nB_{21} & B_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack z\\ {z}}}}} & (10) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 11} \\right\\rbrack & \\; \\\\\n{\\lbrack D\\rbrack = {\\begin{bmatrix}\nD_{11} & D_{12} \\\\\nD_{21} & D_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack z^{2}\\ {z}}}}} & (11)\n\\end{matrix}\\)",
                                "a computation step (6) of inputting the matrix [Q], the coefficient of thermal expansion α, and the temperature difference ΔT (the difference between the reference temperature T0 in the initial state during the compensation for the deformation of the diaphragm portion and the temperature T1 resulting from the change) to Formulae (12) and (13) shown below to compute matrices [NT] and [MT],",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 12} \\right\\rbrack & \\; \\\\\n{\\begin{bmatrix}\nN_{r}^{T} \\\\\nN_{\\theta}^{T}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{{\\lbrack Q\\rbrack \\begin{bmatrix}\n{{\\alpha\\Delta}\\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{bmatrix}}\\ {z}}}} & (12) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 13} \\right\\rbrack & \\; \\\\\n{\\begin{bmatrix}\nM_{r}^{T} \\\\\nM_{\\theta}^{T}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{{\\lbrack Q\\rbrack \\begin{bmatrix}\n{{\\alpha\\Delta}\\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{bmatrix}}z\\ {z}}}} & (13)\n\\end{matrix}\\)",
                                "a computation step (7) of inputting, to Formula (14) shown below, the amount of initial deformation ω0′(r) of the diaphragm portion corresponding to the reference temperature T0 and the reference pressure P0 in the initial state during the compensation for the deformation of the diaphragm portion, and a distance g between the surface of the diaphragm portion on which the conductive portion is formed and an opposite surface of the substrate opposite to the surface of the diaphragm portion on which the conductive portion is formed, to compute a volume V0 in the closed space in the initial state,",
                                "[Formula 14]",
                                "V0=∫0R2πr(g+ω0′(r))dr  (14)",
                                "a computation step (8) of inputting a pressure PC in the closed space, the reference pressure P0, the volume V0 in the closed space in the initial state, the reference temperature T0, the temperature T1 resulting from the change, and a volume V1 (assumed value) in the closed space resulting from thermal expansion to Formula (15) shown below to compute a resultant pressure (a difference between the pressure PC in the closed space and the reference temperature P0 of an environment) P of the diaphragm portion,",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 15} \\right\\rbrack & \\; \\\\\n{P = {\\frac{P_{c}V_{0}T_{1}}{T_{0}V_{1}} - P_{0}}} & (15)\n\\end{matrix}\\)",
                                "a computation step (9) of inputting a dielectric constant ∈0 of vacuum, a relative dielectric constant (a ratio between a dielectric constant of a medium and the dielectric constant of vacuum) ∈r, the amount of initial deformation ω0′(r), and the distance g to Formula (16) shown below to compute a capacitance C0′ corresponding to the amount of initial deformation ω0′(r),",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 16} \\right\\rbrack & \\; \\\\\n{C_{0}^{\\prime} = {\\int_{0}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; r}{\\left( {g{\\omega_{0}^{\\prime}(r)}} \\right)}\\ {r}}}} & (16)\n\\end{matrix}\\)",
                                "a computation step (10) of inputting Formulae (1) to (6) shown above to Formulae (17) and (18) shown below to obtain Formula (19) shown below and representing a resultant force Nr in the first to third segments in the radial direction (the direction of the r axis), Formula (20) shown below and representing a resultant force Nθ in the first to third segments in the circumferential direction (θ), Formula (21) shown below and representing a resultant moment Mr in the first to third segments in the radial direction (the direction of the r axis), and Formula (22) shown below and representing a resultant moment Mθ in the first to third segments in the circumferential direction (θ),",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 17} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\nN_{r} \\\\\nN_{0}\n\\end{Bmatrix} = {\\lbrack A\\rbrack \\left( {\\begin{Bmatrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{Bmatrix} + {\\lbrack B\\rbrack \\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{0}\n\\end{Bmatrix}} - \\begin{Bmatrix}\nN_{r}^{T} \\\\\nN_{\\theta}^{T}\n\\end{Bmatrix}} \\right)}} & (17) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 18} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\nM_{r} \\\\\nM_{\\theta}\n\\end{Bmatrix} = {\\lbrack B\\rbrack \\left( {\\begin{Bmatrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{Bmatrix} + {\\lbrack D\\rbrack \\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{\\theta}\n\\end{Bmatrix}} - \\begin{Bmatrix}\nM_{r}^{T} \\\\\nM_{\\theta}^{T}\n\\end{Bmatrix}} \\right)}} & (18) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 19} \\right\\rbrack & \\; \\\\\n{N_{r} = {{A_{11\\;}\\frac{{u_{0}(r)}}{r}} + {A_{12}\\frac{u_{0}(r)}{r}} - {B_{11}\\frac{{\\theta (r)}}{r}} - {B_{12}\\frac{\\theta (r)}{r}} - N_{r}^{T}}} & (19) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 20} \\right\\rbrack & \\; \\\\\n{N_{\\theta} = {{A_{21}\\frac{{u_{0}(r)}}{r}} + {A_{22}\\frac{u_{0}(r)}{r}} - {B_{21}\\frac{{\\theta (r)}}{r}} - {B_{22}\\frac{\\theta (r)}{r}} - N_{\\theta}^{T}}} & (20) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 21} \\right\\rbrack & \\; \\\\\n{M_{r} = {{B_{11}\\frac{{u_{0}(r)}}{r}} + {B_{12}\\frac{u_{0}(r)}{r}} - {D_{11}\\frac{{\\theta (r)}}{r}} - {D_{12}\\frac{\\theta (r)}{r}} - M_{r}^{T}}} & (21) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 22} \\right\\rbrack & \\; \\\\\n{M_{\\theta} = {{B_{21}\\frac{{u_{0}(r)}}{r}} + {B_{22}\\frac{u_{0}(r)}{r}} - {D_{21}\\frac{{\\theta (r)}}{r}} - {D_{22}\\frac{\\theta (r)}{r}} - M_{\\theta}^{T}}} & (22)\n\\end{matrix}\\)",
                                "a computation step (11) of inputting the resultant force Nr in the first to third segments in the radial direction (the direction of the r axis), the resultant force Nθ in the first to third segments in the circumferential direction (θ), the resultant moment Mr in the first to third segments in the radial direction (the direction of the r axis), the resultant moment Mθ in the first to third segments in the circumferential direction (θ), a transverse shear force Qr, and the resultant pressure (the difference between the pressure in the closed space and the reference pressure of the environment) P of the diaphragm portion to Formulae (23) to (25) shown below, to determine a balanced equation for an axial symmetric circular plate represented in Formula (26) shown below,",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 23} \\right\\rbrack & \\; \\\\\n{{\\frac{N_{r}}{r} + \\frac{N_{r} - N_{0}}{r}} = 0} & (23) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 24} \\right\\rbrack & \\; \\\\\n{Q_{r} = {\\frac{M_{r}}{r} + \\frac{M_{r} - M_{\\theta}}{r}}} & (24) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 25} \\right\\rbrack & \\; \\\\\n{{\\frac{Q_{r}}{r} + P + \\frac{Q_{r}}{r}} = 0} & (25) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 26} \\right\\rbrack & \\; \\\\\n{{{\\frac{1}{r}\\frac{\\;}{r}\\left( {{r\\frac{M_{r}}{r}} + M_{r} + M_{\\theta}} \\right)} + P} = 0} & (26)\n\\end{matrix}\\)",
                                "a computation step (12) of inputting Formulae (19) to (22) shown above to Formulae (23) and (26) shown above to obtain relational expressions (27) and (28) shown below,",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 27} \\right\\rbrack & \\; \\\\\n{{\\frac{^{2}{\\theta (r)}}{r^{2}} + {\\frac{1}{r}\\frac{{\\theta (r)}}{r}} - \\frac{\\theta (r)}{r^{2}}} = \\frac{\\Pr}{2D_{11}^{*}}} & (27) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 28} \\right\\rbrack & \\; \\\\\n{{\\frac{^{2}{u_{0}(r)}}{r^{2}} + {\\frac{1}{r}\\frac{{u_{0}(r)}}{r}} - \\frac{u_{0}(r)}{r^{2}}} = {\\frac{\\Pr \\; \\beta}{2D_{11}^{*}}\\left( {\\beta = {{B_{11}\\text{/}A_{11}{and}D_{11}^{*}} = {D_{11} - {B_{11}^{2}\\text{/}A_{11}}}}} \\right)}} & (28)\n\\end{matrix}\\)",
                                "a computation step (13) of carrying out two integration processes on Formulae (27) and (28) shown above to obtain Formulae (29) and (30) shown below,",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 29} \\right\\rbrack & \\; \\\\\n{{\\theta (r)} = {{b_{1}r} + \\frac{b_{2}}{r} + {\\frac{1}{D_{11}^{*}}\\left( \\frac{\\Pr^{3}}{16} \\right)}}} & (29) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 30} \\right\\rbrack & \\; \\\\\n{{u_{0}(r)} = {{a_{1}r} + \\frac{a_{2}}{r} + {\\frac{\\beta}{D_{11}^{*}}\\left( \\frac{\\Pr^{3}}{16} \\right)}}} & (30)\n\\end{matrix}\\)",
                                "a computation step (14) of carrying out an integration process on Formula (29) shown above to compute an amount of deformation ω(1) of the diaphragm portion in the first segment shown below in Formula (31), an amount of deformation ω(2) of the diaphragm portion in the second segment shown below in Formula (32), and an amount of deformation ω(3) of the diaphragm portion in the third segment shown below in Formula (33),",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 31} \\right\\rbrack & \\; \\\\\n{{\\omega^{(1)} = {\\frac{\\Pr^{4}}{64D_{11}^{*{(1)}}} + \\frac{b_{1}^{(1)}r^{2}}{2} + c^{(1)}}},{0 \\leq r \\leq R_{1}}} & (31) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 32} \\right\\rbrack & \\; \\\\\n{{\\omega^{(2)} = {\\frac{\\Pr^{4}}{64D_{11}^{*{(2)}}} + \\frac{b_{1}^{(2)}r^{2}}{2} + {b_{2}^{(2)}{\\ln (r)}} + c^{(2)}}},{R_{1} \\leq r \\leq R_{2}}} & (32) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 33} \\right\\rbrack & \\; \\\\\n{{\\omega^{(3)} = 0},{R_{2} \\leq r \\leq R_{3}}} & (33)\n\\end{matrix}\\)",
                                "a computation step (15) of inputting the amount of deformation ω(1) and ω(2) and the distance g to Formula (34) shown below to compute the volume V1 in the closed space resulting from the thermal expansion,",
                                "[Formula 34]",
                                "V1=∫0R2πr(g+ω(1))dr+∫0R2πr(g+ω(2))dr  (34)",
                                "a computation step (16) of inputting the volume V1 to Formulae (31) and (32) shown above to compute a capacitance C′ shown below in Formula (35) and corresponding to the amounts of deformation ω(1) and ω(2), and",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 35} \\right\\rbrack & \\; \\\\\n{C^{\\prime} = {{\\int_{0}^{R_{1}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; r}{\\left( {g + {\\omega^{(1)}(r)}} \\right)}\\ {r}}} + {\\int_{R_{1}}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; r}{\\left( {g + {\\omega^{(2)}(r)}} \\right)}\\ {r}}}}} & (35)\n\\end{matrix}\\)",
                                "a computation step (17) of inputting the capacitances C0′ and C′ to Formula (36) shown below to determine an amount of change in capacitance ΔC′, the computation steps (1) to (17) being carried out in order.",
                                "[Formula 36]",
                                "ΔC′=C′−C′0  (6)",
                                "The configuration in (2) allows obtainment of the amount of change in capacitance ΔC′, more specifically, the parameter ΔC′ enabling determination of the degree of compensation for the deformation of the diaphragm portion caused by the thermal expansion of the gas sealed in the closed space. Thus, the deformation of the diaphragm portion can be compensated for more accurately than in the conventional art simply by applying the result of optimization of the parameter ΔC′ to the capacitive sensor. As a result, in detecting a change in the capacitance between the diaphragm portion and both the first electrode portion and the conductive portion based on the deformation of the diaphragm portion, the capacitive sensor can detect the change in capacitance more accurately than in the conventional art. Here, “optimization of the parameter ΔC′” includes completely zeroing the parameter ΔC′ and approximating the parameter ΔC′ to zero.",
                                "(3) In the method for temperature compensation in the sensor in (1) or (2), preferably, the conductive portion is a second electrode portion for detecting a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion.",
                                "The configuration in (3) allows the deformation of the diaphragm portion to be compensated for more accurately than in the conventional art simply by applying the result of optimization of the parameter ΔC′ to the capacitive sensor. As a result, in detecting a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion, the capacitive sensor can detect the change in capacitance more accurately than in the conventional art.",
                                "(4) In the method for temperature compensation in the sensor in (3), preferably, the sensor includes a barrier metal layer containing at least platinum and formed between the second electrode portion and the insulator layer, the barrier metal layer having an inner circumferential surface forming a part of the closed space. Here, the “barrier metal” refers to a material such as metal which exerts the following advantageous effects: the material (1) allows a dense film to be formed and produces a barrier effect against reaction between a wiring material and a silicon substrate, (2) is bonded well to metal and an insulating film, (3) can be micromachined by dry etching, and (4) offers reduced resistance.",
                                "The configuration in (4) applies the result of optimization of the parameter ΔC′ to the capacitive sensor. Thus, the capacitive sensor configured to enjoy the barrier metal effect of the barrier metal layer can also detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the conductive portion more accurately than in the conventional art.",
                                "(5) In the method for temperature compensation in the sensor in (2), preferably, the conductive portion is a sealing ring portion formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the temperature compensation ring is formed, and the sensor includes a ring-like second electrode portion formed between the sealing ring portion and the insulator layer to detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion.",
                                "The configuration in (5) applies the result of optimization of the parameter ΔC′ to the capacitive sensor. Thus, while configured to enjoy an effect enabling possible leakage of the gas in the closed space to be more reliably prevented by using the sealing ring to seal the portion between the diaphragm portion and the second electrode portion, the capacitive sensor can also detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion more accurately than in the conventional art.",
                                "(6) In the method for temperature compensation in the sensor in (5), preferably, the second electrode portion and the sealing ring portion of the sensor are bonded together by a gold-gold bonding.",
                                "The configuration in (6) applies the result of optimization of the parameter ΔC′ to the capacitive sensor. Thus, while configured to enjoy an effect enabling reliability of an electric connection between the second electrode portion and the sealing ring portion to be improved, the capacitive sensor can also detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion more accurately than in the conventional art.",
                                "(7) In the method for temperature compensation in the sensor in (2), preferably, the sensor includes a ring-like barrier metal layer containing at least platinum and formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the temperature compensation ring is formed, and a ring-like second electrode portion formed between the barrier metal layer and the insulator layer to detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion, and when the barrier metal layer includes a single layer, the conductive portion is the barrier metal layer, and when the barrier metal layer includes a plurality of layers, the conductive portion is a layer included in the barrier metal layer and which is closest to the diaphragm portion.",
                                "The configuration in (7) applies the result of optimization of the parameter ΔC′ to the capacitive sensor. Thus, the capacitive sensor configured to enjoy the barrier metal effect of the barrier metal layer can also detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion more accurately than in the conventional art.",
                                "(8) The present invention provides a computation program for carrying out a computation process for a method for temperature compensation in a sensor including a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally having a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space.",
                                "The configuration in (8) allows effects similar to the effects of the configuration in (1) to be enjoyed.",
                                "(9) A computation processing device according to the present invention carries out a computation process in accordance with the computation program according to claim 8.",
                                "The configuration in (9) allows effects similar to the effects of the configuration in (8) to be enjoyed.",
                                "(10) The present invention provides a sensor including a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally having a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space.",
                                "The configuration in (10) allows effects similar to the effects of the configuration in (1) to be enjoyed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce temperature compensation method",
                                "describe sensor configuration",
                                "explain deformation of diaphragm portion",
                                "introduce compensation for deformation",
                                "describe capacitive sensor configuration",
                                "define computation steps",
                                "compute strains using Timoshenko's theory",
                                "compute matrix [Q]",
                                "compute stresses using constitutive equation",
                                "compute matrices [A], [B], and [D]",
                                "compute matrices [NT] and [MT]",
                                "compute initial deformation of diaphragm portion",
                                "compute volume in closed space",
                                "compute resultant pressure",
                                "compute capacitance",
                                "compute resultant forces and moments",
                                "compute resultant force in radial direction",
                                "compute resultant force in circumferential direction",
                                "compute resultant moment in radial direction",
                                "compute resultant moment in circumferential direction",
                                "compute balanced equation for axial symmetric circular plate",
                                "derive relational expression for θ(r)",
                                "derive relational expression for u0(r)",
                                "describe computation step (1)",
                                "describe computation step (2)",
                                "describe computation step (3)",
                                "describe computation step (4)",
                                "describe computation step (5)",
                                "define solution to problem",
                                "describe computation step 13",
                                "describe computation step 14",
                                "describe computation step 15",
                                "describe computation step 16",
                                "describe computation step 17",
                                "explain configuration in (2)",
                                "explain configuration in (3)",
                                "explain configuration in (4)",
                                "explain configuration in (5)",
                                "explain configuration in (6)",
                                "explain configuration in (7)",
                                "introduce method for temperature compensation in sensor",
                                "explain configuration in (8)",
                                "explain computation program",
                                "explain computation processing device",
                                "introduce sensor",
                                "explain configuration in (9)",
                                "explain configuration in (10)",
                                "summarize advantages of configuration in (2)",
                                "summarize advantages of configuration in (3)",
                                "summarize advantages of configuration in (4)"
                            ],
                            "num_characters": 25662,
                            "outline_medium": [
                                "introduce temperature compensation method",
                                "describe sensor configuration",
                                "motivate temperature compensation",
                                "describe computation steps",
                                "derive Timoshenko's symmetric circular plate theory",
                                "compute strains and displacements",
                                "determine stress using constitutive equation",
                                "compute matrices [A], [B], and [D]",
                                "compute matrices [NT] and [MT]",
                                "compute volume V0 in closed space",
                                "compute resultant pressure P",
                                "compute capacitance C0'",
                                "derive resultant forces and moments",
                                "derive balanced equation for axial symmetric circular plate",
                                "define solution to problem",
                                "compute deformation amounts",
                                "compute volume and capacitance",
                                "determine capacitance change",
                                "describe sensor configuration",
                                "describe conductive portion",
                                "describe barrier metal layer",
                                "describe computation program",
                                "describe computation processing device",
                                "describe sensor",
                                "summarize advantages"
                            ],
                            "outline_short": [
                                "introduce temperature compensation method",
                                "describe sensor configuration",
                                "derive computation steps for stress and strain",
                                "compute matrices for stress and strain",
                                "compute resultant force and moment",
                                "derive balanced equation for axial symmetric circular plate",
                                "obtain relational expressions for diaphragm portion",
                                "define computation steps",
                                "compute deformation amounts",
                                "compute capacitance",
                                "determine amount of change in capacitance",
                                "describe sensor configurations"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "First Embodiment",
                            "paragraphs": [
                                "A method for temperature compensation in a sensor according to a first embodiment of the present invention will be described below with reference to FIG. 1 to FIG. 6.",
                                "(Configuration of a Capacitive Sensor 100)",
                                "As shown in FIG. 1(a) and FIG. 1(b), a capacitive sensor (a sensor) 100 to which the results of computations in a method for temperature compensation in the capacitive sensor are applied includes a substrate 1, an insulator layer 2, a first electrode portion 3, a second electrode portion (conductive portion) 4, a diaphragm portion 5, a temperature compensation ring (temperature compensation member) 6, and a closed space 7.",
                                "The substrate 1 is formed of a semiconductor such as silicon and has a circular recess 1a in a substantially central portion of the substrate 1.",
                                "The insulator layer 2 is a layer formed of an insulator such as silicon dioxide and is formed on one surface of the substrate 1. The insulator layer 2 also has a circular penetration portion 2a formed in a substantially central portion thereof so as to align with the recess 1a in the substrate 1 and such a generally rectangular penetration portion 2b as shown in FIG. 1(a).",
                                "The first electrode portion 3 is formed as a barrier metal layer containing at least platinum and includes three layers, that is, a layer located closest to the substrate 1 and formed of titanium, a layer located furthest from the substrate 1 and formed of gold, and a layer located between these two layers and formed of platinum.",
                                "The second electrode portion 4 is formed of gold and shaped like a ring on a surface of the insulator layer 2 opposite to a surface of the insulator layer 2 on which the substrate 1 is formed. In a variation, the second electrode portion 4 may be formed of a metal material such as silver or copper.",
                                "The diaphragm portion 5 is formed of silicon and is deformable under a pressure applied by atmospheric pressure. In a variation, the diaphragm portion 5 may be formed of a semiconductor material other than silicon.",
                                "The temperature compensation ring 6 is formed of aluminum and shaped like a ring on a surface of the diaphragm portion 5 opposite to a surface of the diaphragm portion 5 on which the second electrode portion 4 is formed. In a variation, the temperature compensation ring 6 may be a metal material with a high coefficient of thermal expansion instead of aluminum.",
                                "The closed space 7 forms an atmospheric environment suitable for detection of the pressure applied to the diaphragm portion 5. The closed space 7 is formed by being surrounded by an inner surface of the recess 1a, an inner circumferential surface of the penetration portion 2a, an inner circumferential surface of the second electrode portion 4, and the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed.",
                                "(Operation of the Capacitive Sensor 100)",
                                "Now, operation of the capacitive sensor 100 will be described. When a pressure based on atmospheric pressure is applied to the diaphragm portion 5 of the capacitive sensor 100, the diaphragm portion 5 is deformable depending on the pressure. The pressure is measured by detecting a change in the capacitance between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4.",
                                "(Principle for Compensation for the Amount of Deformation of the Diaphragm Portion 5)",
                                "Now, a general principle for compensation for the amount of deformation of the diaphragm portion 5 will be described with reference to FIG. 2. A distance g in FIG. 2(a) to FIG. 2(c) indicates the distance between the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed and an opposite surface of the recess 1a opposite to the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed.",
                                "First, in a state before compensation shown in FIG. 2(a) and in an initial state in an environment with a reference temperature T0 and a reference pressure P0, the diaphragm portion 5 is deformed to a state shown by a solid line in FIG. 5. The amount of initial deformation of the diaphragm portion 5 is ω0(r). A capacitance C0 is generated between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4 in association with the amount of initial deformation ω0(r). Then, the following are assumed. When the reference pressure remains the initial pressure P0 and only the reference temperature changes from the initial temperature T0 to a temperature T, the diaphragm portion 5 is deformed to a state shown by a dotted line in FIG. 2(a), the amount of deformation of the diaphragm portion 5 changes from the amount of initial deformation ω0(r) to an amount of deformation ω(r), and the capacitance generated between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4 changes from the initial capacitance C0 to C. Under these assumptions, the amount of change ΔC in capacitance can be expressed by Formula (37) shown below. In Formula (37), a coefficient ∈0 represents the dielectric constant of vacuum and a coefficient ∈r represents a relative dielectric constant (the ratio between the dielectric constant of a medium and the dielectric constant of vacuum).",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 37} \\right\\rbrack & \\; \\\\\n{{\\Delta \\; C} = {{C - C_{0}} = {\\int_{0}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; {r\\left( {{\\omega_{0}(r)} - {\\omega (r)}} \\right)}}{\\left( {g + {\\omega_{0}(r)}} \\right)\\left( {g + {\\omega (r)}} \\right)}\\ {r}}}}} & (37)\n\\end{matrix}\\)",
                                "Then, in a state after compensation shown in FIG. 2(b) and in an initial state in an environment with the reference temperature T0 and the reference pressure P0, the diaphragm portion 5 is deformed to a state shown by a solid line in FIG. 2(b). The amount of initial deformation of the diaphragm portion 5 is ω0′(r). A capacitance C′0 is generated between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4 in association with the amount of initial deformation ω0′(r). Then, the following are assumed. When the reference pressure remains the initial pressure P0 and only the reference temperature changes from the initial temperature T0 to a temperature T, the diaphragm portion 5 is deformed to a state shown by a dotted line in FIG. 2(b), the amount of deformation of the diaphragm portion 5 changes from the amount of initial deformation ω0′(r) to an amount of deformation ω′(r), and the capacitance generated between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4 changes from the initial capacitance C′0 to C′. Under these assumptions, the amount of change ΔC′ in capacitance can be expressed by Formula (38) shown below. In Formula (38), the coefficient ∈0 represents the dielectric constant of vacuum and the coefficient ∈r represents the relative dielectric constant (the ratio between the dielectric constant of a medium and the dielectric constant of vacuum).",
                                "\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 38} \\right\\rbrack & \\; \\\\\n{{\\Delta \\; C^{\\prime}} = {{C^{\\prime} - C_{0}^{\\prime}} = {\\int_{0}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; {r\\left( {{\\omega_{0}^{\\prime}(r)} - {\\omega^{\\prime}(r)}} \\right)}}{\\left( {g + {\\omega_{0}^{\\prime}(r)}} \\right)\\left( {g + {\\omega^{\\prime}(r)}} \\right)}\\ {r}}}}} & (38)\n\\end{matrix}\\)",
                                "Formula 38 indicates that the parameter ΔC′ may be set to zero in order to completely compensate for deformation of the diaphragm portion 5, that is, to completely zero a difference in the amount of deformation of the diaphragm portion 5 (=the amount of initial deformation ω0′(r)−the amount of deformation ω′(r)). This in turn indicates that the parameter ΔC′ enables the degree of compensation for the deformation of the diaphragm portion 5 to be determined.",
                                "FIG. 2(c) shows a comparative example for the general principle for compensation shown in FIG. 2(a) and FIG. 2(b) and shows the result of optimization of the parameter ΔC′ obtained by computations in the method for temperature compensation according to the first embodiment, more specifically, the result of setting the parameter ΔC′ to zero, and thus, the result of completely zeroing the amount of deformation of the diaphragm portion 5. In this state, the distance g is maintained between the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed and an inner surface of the recess 1a opposite to the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed. In a variation, the amount of deformation of the diaphragm portion 5 may be approximated to zero by setting the parameter ΔC′ to a value approximate to zero.",
                                "(Computation Steps of the Method for Temperature Compensation in the Sensor According to the First Embodiment)",
                                "Now, the computation steps of the method for temperature compensation in the capacitive sensor will be described with reference to FIG. 3 to FIG. 6. The purpose of each of the computation steps is to compute the deformation of the diaphragm portion 5 associated with temperature. The pressure in the closed space 7 varies depending on temperature, and thus, the deformation of the diaphragm portion 5 is calculated based on the relation between temperature and pressure.",
                                "First, in a computation step S1 shown in FIG. 3, based on the Timoshenko's symmetric circular plate theory, a composite circular plate configured such that center axes of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6 align with one another (see FIG. 6(a)) is divided into a first segment (1) including a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion 5, a second segment (2) including a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion 5 and the temperature compensation ring 6, and a third segment (3) including a portion with a radius of R2 to R3 based on the center axes of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6 (see FIG. 6(b)), as shown in FIG. 6.",
                                "An alternate long and short dash line in FIG. 6(a) and FIG. 6(b) shows an axis passing through the center axis P (the position of a radius of 0) of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6 and extending along a stacking direction of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6. Thicknesses tg, ts, and to in FIG. 6(a) and FIG. 6(b) represent the respective thicknesses of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6. A temperature difference ΔT in FIG. 6(a) and FIG. 6(b) represents a difference between the reference temperature T0 and the temperature T. A resultant pressure P in FIG. 6(a) and FIG. 6(b) represents a difference between the pressure PC in the closed space 7 and the reference pressure P0 of the environment. R1 in FIG. 6(a) and FIG. 6(b) denotes the radius of the inner diameter (2R1) of the temperature compensation ring 6. Similarly, R2 in FIG. 6(a) and FIG. 6(b) denotes the radius of the inner diameter (2R2) of the second electrode portion 4. Similarly, R3 in FIG. 6(a) and FIG. 6(b) denotes the radius of the outer diameter (2R3) of the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6. In this case, the second electrode portion 4, the diaphragm portion 5, and the temperature compensation ring 6 are formed using gold, silicon, and aluminum, respectively, as a material.",
                                "Then, in a computation step S2, based on Kirchhoff's circular plate theory, strains ∈0rr and ∈0θθ of a reference plane (z=0), shown in Formulae (5) and (6) shown above, in the stacking direction of the first to third segments (1) to (3) are determined using Formulae (1) to (4) shown above and representing the relations between strains ∈rr and ∈θθ and displacements κr and κθ in a radial direction (the direction of an r axis) and a circumferential direction (θ).",
                                "Then, in a computation step S3, Young's modulus E and Poisson's ratio ν are input to Formula (7) shown above to determine a matrix [Q].",
                                "Then, in a computation step S4, a stress σrr in the radial direction (the direction of the r axis) and a stress σθθ in the circumferential direction (θ) are determined by inputting the matrix [Q], the strains ∈0rr and ∈0θθ, the displacements κr and κθ, a coefficient of thermal expansion α, and a temperature difference ΔT (a difference between a reference temperature T0 in an initial state during compensation for deformation of the diaphragm portion 5 and a temperature T1 resulting from a change) to a constitutive equation for stress on a linearly elastic symmetric circular plate with traverse isotropy shown in Formula (8) shown above.",
                                "Then, in a computation step S5, the matrix [Q] is input to Formulae (9) to (11) shown above to compute matrices [A], [B], and [D].",
                                "Then, in a computation step S6, matrices [NT] and [MT] are respectively computed by inputting the matrix [Q], the coefficient of thermal expansion α, and the temperature difference ΔT (the difference between the reference temperature T0 in the initial state during the compensation for the deformation of the diaphragm portion and the temperature T1 resulting from the change) to Formulae (12) and (13) shown above.",
                                "Then, in a computation step S7, a volume V0 in the closed space 7 in the initial state is computed by inputting, to Formula (14) shown above, the amount of initial deformation ω0′(r) of the diaphragm portion 5 corresponding to the reference temperature T0 and the reference pressure P0 in the initial state during the compensation for the deformation of the diaphragm portion 5, and the distance g between the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed and an opposite surface of the recess 1a opposite to the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed.",
                                "Then, in a computation step S8, a resultant pressure of the diaphragm portion 5 (the difference between the pressure PC in the closed space 7 and the reference pressure P0 of the environment) P is computed by inputting the pressure PC in the closed space, the reference pressure P0, the volume V0 in the closed space 7 in the initial state, the reference temperature T0, the temperature T1 resulting from the change, and a volume V1 (assumed value) in the closed space resulting from thermal expansion to Formula (15) shown above.",
                                "Then, in a computation step S9, a capacitance C0′ corresponding to the amount of initial deformation ω0′(r) is computed by inputting the dielectric constant ∈0 of vacuum, the relative dielectric constant (the ratio between the dielectric constant of a medium and the dielectric constant of vacuum) ∈r, the amount of initial deformation ω0′(r), and the distance g to Formula (16) shown above.",
                                "Then, in a computation step S10, Formulae (1) to (6) shown above are input to Formulae (17) and (18) shown above to obtain Formula (19) shown above representing a resultant force Nr in the first segment (1) to the third segment (3) in the radial direction (the direction of the r axis), Formula (20) shown above representing a resultant force Nθ in the first segment (1) to the third segment (3) in the circumferential direction (θ), Formula (21) shown above representing a resultant moment Mr in the first segment (1) to the third segment (3) in the radial direction (the direction of the r axis), and Formula (22) shown below representing a resultant moment Mθ in the first segment (1) to the third segment (3) in the circumferential direction (θ). Here, reference characters A11, A12, B11, and B12 in Formula (19) represent components of the matrices [A] and [B] shown in Formulae (9) and (10) shown above. Reference character NrT represents a resultant force exerted in the radial direction (the direction of the r axis) at the temperature T. Reference characters A21, A22, B21, and B22 in Formula (20) represent components of the matrices [A] and [B] shown in Formulae (9) and (10) shown above. Reference character NθT represents a resultant force exerted in the circumferential direction (θ) at the temperature T. Reference characters B11, B12, D11, and D12 in Formula (21) represent components of the matrices [B] and [D] shown in Formulae (10) and (11) shown above. Reference character MrT represents a resultant moment exerted in the radial direction (the direction of the r axis) at the temperature T. Reference characters B21, B22, D21, and D22 in Formula (22) represent components of the matrices [B] and [D] shown in Formulae (10) and (11) shown above. Reference character MθT represents a resultant moment exerted in the circumferential direction (θ) at the temperature T.",
                                "Then, in a computation step S11, a balanced equation for an axial symmetric circular plate represented in Formula (26) shown above is determined by inputting the resultant force Nr in the first segment (1) to the third segment (3) in the radial direction (the direction of the r axis), the resultant force Nθ in the first segment (1) to the third segment (3) in the circumferential direction (θ), the resultant moment Mr in the radial direction (the direction of the r axis), the resultant moment Mθ in the circumferential direction (θ), a transverse shear force Qr, and the resultant pressure (the difference between the pressure PC in the closed space 7 and the reference temperature P0 of the environment) P of the diaphragm portion 5 to Formulae (23) to (25) shown above.",
                                "Then, in a computation step S12, Formulae (19) to (22) shown above are input to Formulae (23) and (26) shown above to obtain relational expressions (27) and (28) shown above. Here, reference character D*11 in Formulae (27) and (28) represents a parameter acquired using the respective components A11, B11, and D11 of the matrices [A], [B], and [D] as shown in Formula (28). Similarly, reference numeral β in Formula (28) represents a parameter acquired using the respective components A11 and B11 of the matrices [A] and [B] as shown in Formula (28) shown above.",
                                "Then, in a computation step S13, two integration processes are carried out on Formulae (27) and (28) shown above to obtain common solutions for a gradient θ(r) of a normal direction displacement shown in FIG. 29) shown above and a displacement u0(r) shown in Formula 30 shown above. Here, reference characters a1 and a2 in Formula (30) and reference characters b1 and b2 shown in Formula (29) represent coefficients.",
                                "Then, in a computation step S14, an integration step is carried out on Formula (29) shown above to compute the amount of deformation ω(1) of the diaphragm portion 5 in the first segment (1) shown above in Formula (31), the amount of deformation ω(2) of the diaphragm portion 5 in the second segment (2) shown above in Formula (32), and the amount of deformation ω(3) of the diaphragm portion 5 in the third segment (3) shown above in Formula (33). Reference characters D*11(1), b1(1), and c(1) in Formula (31) represent coefficients resulting from the integration process. Similarly, reference characters D*11(2), b1(2), b2(2), and c(2) in Formula (32) represent coefficients resulting from the integration process. Thus, the coefficients b1(1), c(1), b1(2), b2(2), and c(2) are calculated based on a condition of continuity and a condition of constraint for each of the segments of the composite circular plate.",
                                "Then, in a computation step S15, the amount of deformation ω(1) and ω(2) of the diaphragm portion 5 and the distance g are input to Formula (34) shown above to compute the volume V1 in the closed space 7 resulting from the thermal expansion.",
                                "Then, in a computation step S16, the volume V1 in the closed space 7 resulting from the thermal expansion is input to Formulae (31) and (32) shown above to compute a capacitance C′ shown in Formula (35) shown above and corresponding to the amounts of deformation ω(1) and ω(2) of the diaphragm portion 5.",
                                "Then, in a computation step S17, the capacitances C0′ and C′ are input to Formula (36) shown above to determine an amount of change in capacitance ΔC′.",
                                "The above-described configuration can achieve the optimum temperature compensation by cancelling out the deformation of the diaphragm portion 5 caused by a change in pressure associated with the temperature of the gas in the closed space 7 (the thermal expansion of the gas sealed in the closed space 7) to suppress the deformation of the diaphragm portion 5 within an intended temperature range.",
                                "Moreover, the above-described configuration carries out effective temperature compensation to allow the capacitive sensor 100 with the thin diaphragm portion 5 to be designed and produced, thus enabling an increase in the sensitivity of the capacitive sensor 100.",
                                "Moreover, the above-described configuration can provide the parameter ΔC′, which enables determination of the degree of compensation for the deformation of the diaphragm portion 5 caused by the thermal expansion of the gas sealed in the closed space 7. Thus, the deformation of the diaphragm portion 5 can be compensated for more accurately than in the conventional art simply by applying the result of optimization of the parameter ΔC′ to the capacitive sensor. As a result, in detecting a change in the capacitance between the diaphragm portion 5 and both the first electrode portion 3 and the second electrode portion 4 based on the deformation of the diaphragm portion 5, the capacitive sensor 100 can detect the change in capacitance more accurately than in the conventional art. Here, “optimization of the parameter ΔC′” includes completely zeroing the parameter ΔC′ and approximating the parameter ΔC′ to zero. Furthermore, the “compensation for the deformation of the diaphragm portion 5” includes completely zeroing the amount of deformation of the diaphragm portion 5 by setting zero for the parameter ΔC′, and approximating the amount of deformation of the diaphragm portion 5 to zero by setting a value approximate to zero for the parameter ΔC′."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe capacitive sensor 100",
                                "introduce substrate 1",
                                "introduce insulator layer 2",
                                "introduce first electrode portion 3",
                                "introduce second electrode portion 4",
                                "introduce diaphragm portion 5",
                                "introduce temperature compensation ring 6",
                                "introduce closed space 7",
                                "describe operation of capacitive sensor 100",
                                "introduce principle for compensation for deformation of diaphragm portion 5",
                                "describe state before compensation",
                                "describe state after compensation",
                                "introduce formula 37",
                                "describe formula 37",
                                "introduce formula 38",
                                "describe formula 38",
                                "describe result of optimization of parameter ΔC′",
                                "introduce computation steps of method for temperature compensation",
                                "describe computation step S1",
                                "divide composite circular plate into segments",
                                "describe computation step S2",
                                "determine strains ∈0rr and ∈0θθ",
                                "describe computation step S3",
                                "determine matrix [Q]",
                                "describe computation step S4",
                                "determine stresses σrr and σθθ",
                                "describe computation step S5",
                                "compute matrices [A], [B], and [D]",
                                "describe computation step S6",
                                "compute matrices [NT] and [MT]",
                                "describe computation step S7",
                                "compute volume V0 in closed space 7",
                                "describe computation step S8",
                                "compute resultant pressure P",
                                "describe computation step S9",
                                "compute capacitance C0′",
                                "describe computation step S10",
                                "obtain formulae (19) to (22)",
                                "describe computation step S11",
                                "determine balanced equation for axial symmetric circular plate",
                                "describe computation step S12",
                                "obtain relational expressions (27) and (28)",
                                "describe computation step S13",
                                "compute amount of deformation ω(r) of diaphragm portion 5"
                            ],
                            "num_characters": 22252,
                            "outline_medium": [
                                "describe capacitive sensor 100",
                                "introduce configuration of capacitive sensor 100",
                                "describe operation of capacitive sensor 100",
                                "introduce principle for compensation for deformation of diaphragm portion 5",
                                "describe formula for capacitance change ΔC",
                                "describe formula for capacitance change ΔC′",
                                "introduce computation steps of method for temperature compensation",
                                "divide composite circular plate into segments",
                                "determine strains ∈0rr and ∈0θθ of reference plane",
                                "determine matrix [Q]",
                                "determine stresses σrr and σθθ",
                                "compute matrices [A], [B], and [D]",
                                "compute matrices [NT] and [MT]",
                                "compute volume V0 in closed space 7",
                                "compute resultant pressure P of diaphragm portion 5",
                                "compute capacitance C0′ corresponding to amount of initial deformation ω0′(r)",
                                "obtain formulae for resultant forces and moments",
                                "determine balanced equation for axial symmetric circular plate",
                                "obtain relational expressions for gradient θ(r) and displacement u0(r)",
                                "compute amounts of deformation ω(1), ω(2), and ω(3) of diaphragm portion 5",
                                "compute volume V1 in closed space 7 resulting from thermal expansion",
                                "compute capacitance C′ and amount of change in capacitance ΔC′"
                            ],
                            "outline_short": [
                                "describe capacitive sensor 100 configuration",
                                "explain operation of capacitive sensor 100",
                                "introduce principle for compensation for diaphragm portion 5 deformation",
                                "derive formula for capacitance change ΔC",
                                "derive formula for capacitance change ΔC′",
                                "describe computation steps for temperature compensation method",
                                "divide composite circular plate into segments",
                                "compute strains, stresses, and displacements",
                                "compute resultant forces and moments",
                                "determine balanced equation for axial symmetric circular plate",
                                "compute amount of deformation and capacitance change"
                            ]
                        },
                        {
                            "title": "Second Embodiment",
                            "paragraphs": [
                                "Now, a method for temperature compensation in a sensor according to a second embodiment of the present invention will be described with reference to FIG. 7 to FIG. 10. Portions 21 to 27 (some of the portions are not shown in the drawings) of a capacitive sensor 200 to which the results of computations in the method for temperature compensation according to the second embodiment are applied are similar to the portions 1 to 7, respectively, of the capacitive sensor 100 to which the results of computations in the method for temperature compensation according to the first embodiment are applied. Thus, description of the portions 21 to 27 may be omitted.",
                                "(Configuration of the Capacitive Sensor 200)",
                                "As shown in FIG. 7, the capacitive sensor (the sensor) 200 includes a substrate 21, an insulator layer 22, a first electrode portion 23, a second electrode portion (conductive portion) 24, a diaphragm portion 25, a temperature compensation ring (temperature compensation member) 26, and a closed space 27 which are similar to the corresponding portions of the capacitive sensor 100, as well as a first barrier metal layer 28.",
                                "The first barrier metal layer 28 contains at least platinum and is formed between the second electrode portion 24 and the insulator layer 22 like a ring similar to the second electrode portion 24. The first barrier metal layer 28 includes two layers, a layer 28a located closest to the insulator layer 22 and formed of titanium and a layer 28b located closest to the second electrode portion 24 and formed of platinum. An inner circumferential surface of the first barrier metal layer 28 forms the closed space 27 along with an inner surface of a recess 21a, an inner circumferential surface of a penetration portion 22a, an inner circumferential surface of the second electrode portion 24, and a surface of the diaphragm portion 25 on which the second electrode portion 24 is formed.",
                                "(Operation of the Capacitive Sensor 200)",
                                "Now, operation of the capacitive sensor 200 will be described. When a pressure based on atmospheric pressure is applied to the diaphragm portion 25 of the capacitive sensor 200, the diaphragm portion 25 is deformable depending on the pressure. The pressure is measured by detecting a change in the capacitance between the diaphragm portion 25 and both the first electrode portion 23 and the second electrode portion 24, the change being caused by the deformation.",
                                "(Computation Steps of the Method for Temperature Compensation in the Sensor According to the Second Embodiment)",
                                "Now, computation steps of the method for temperature compensation in the capacitive sensor will be described with reference to FIG. 8 to FIG. 10. The second embodiment carries out steps S201 to S217 in order which are similar to the computation steps S1 to S17 of the method for temperature compensation according to the first embodiment.",
                                "This configuration applies the result of optimization of the parameter ΔC′ to the capacitive sensor 200. Thus, the capacitive sensor 200, configured to enjoy the barrier metal effect of the first barrier metal layer 28, can also detect a change in the capacitance between the diaphragm portion 25 and both the first electrode portion 23 and the second electrode portion 24 more accurately than in the conventional art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe capacitive sensor 200",
                                "describe configuration of capacitive sensor 200",
                                "describe operation of capacitive sensor 200",
                                "describe computation steps of method for temperature compensation",
                                "apply result of optimization of parameter ΔC′ to capacitive sensor 200",
                                "describe advantage of capacitive sensor 200"
                            ],
                            "num_characters": 3296,
                            "outline_medium": [
                                "describe capacitive sensor 200",
                                "operation of capacitive sensor 200",
                                "computation steps of method for temperature compensation"
                            ],
                            "outline_short": [
                                "describe capacitive sensor 200"
                            ]
                        },
                        {
                            "title": "Third Embodiment",
                            "paragraphs": [
                                "Now, a method for temperature compensation in a sensor according to a third embodiment of the present invention will be described with reference to FIG. 11 to FIG. 14. Portions 31 to 37 (some of the portions are not shown in the drawings) of a capacitive sensor 300 to which the results of computations in the method for temperature compensation according to the third embodiment are applied are similar to the portions 1 to 7, respectively, of the capacitive sensor 100 to which the results of computations in the method for temperature compensation according to the first embodiment are applied. Thus, description of the portions 31 to 37 may be omitted.",
                                "(Configuration of the Capacitive Sensor 300)",
                                "As shown in FIG. 11, the capacitive sensor (the sensor) 300 includes a substrate 31, an insulator layer 32, a first electrode portion 33, a second electrode portion 34, a diaphragm portion 35, a temperature compensation ring (temperature compensation member) 36, and a closed space 37 which are similar to the corresponding portions of the capacitive sensor 100, as well as a sealing ring portion (conductive portion) 38.",
                                "The sealing ring portion 38 is formed of a metal material such as gold, platinum, or titanium, has an inner diameter of 2R2 and an outer diameter of 2R3, and is formed between the diaphragm portion 35 and the second electrode portion 34 to prevent a gas sealed in the closed space 37 from leaking. In this case, the second electrode portion 34 and the sealing ring portion 38 are preferably bonded together by a gold-gold bonding. An inner circumferential surface of the sealing ring portion 38 forms the closed space 37 along with an inner surface of a recess 31a, an inner circumferential surface of a penetration portion 32a, an inner circumferential surface of the second electrode portion 34, and a surface of the diaphragm portion 35 on which the sealing ring portion 38 is formed.",
                                "(Operation of the Capacitive Sensor 300)",
                                "Now, operation of the capacitive sensor 300 will be described. When a pressure based on atmospheric pressure is applied to the diaphragm portion 35 of the capacitive sensor 300, the diaphragm portion 35 is deformable depending on the pressure. The pressure is measured by detecting a change in the capacitance between the diaphragm portion 35 and both the first electrode portion 33 and the second electrode portion 34, the change being caused by the deformation.",
                                "(Computation Steps of the Method for Temperature Compensation in the Sensor According to the Third Embodiment)",
                                "Now, computation steps of the method for temperature compensation in the capacitive sensor will be described with reference to FIG. 12 to FIG. 14. Computation steps S302 to S317 of the method for temperature compensation according to the third embodiment are similar to the computation steps S2 to S17, respectively, of the method for temperature compensation according to the first embodiment. Thus, only the computation step S301 will be described in detail.",
                                "First, in the computation step S301, based on the Timoshenko's symmetric circular plate theory, a composite circular plate configured such that center axes of the sealing ring portion 38, the diaphragm portion 35, and the temperature compensation ring 36 align with one another is divided into a first segment (1) including a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion 35, a second segment (2) including a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion 35 and the temperature compensation ring 36, and a third segment (3) including a portion with a radius of R2 to R3 based on the center axes of the sealing ring portion 38, the diaphragm portion 35, and the temperature compensation ring 36.",
                                "Then, the computation steps S302 to S317 are sequentially carried out to finish the computation steps of the method for temperature compensation in the capacitive sensor.",
                                "The above-described configuration applies the result of optimization of the parameter ΔC′ to the capacitive sensor 300. Thus, while configured to enjoy an effect enabling possible leakage of the gas in the closed space 37 to be more reliably prevented by using the sealing ring portion 38 to seal the portion between the diaphragm portion 35 and the second electrode portion 34, the capacitive sensor 300 can also detect a change in the capacitance between the diaphragm portion 35 and both the first electrode portion 33 and the second electrode portion 34 more accurately than in the conventional art.",
                                "Moreover, the above-described configuration applies the result of optimization of the parameter ΔC′ to the capacitive sensor 300. Thus, while configured to enjoy an effect enabling reliability of an electric connection between the second electrode portion 34 and the sealing ring portion 38 to be improved when the second electrode portion 34 and the sealing ring portion 38 are bonded together by a gold-gold bonding, the capacitive sensor 300 can also detect a change in the capacitance between the diaphragm portion 35 and both the first electrode portion 33 and the second electrode portion 34 more accurately than in the conventional art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe capacitive sensor 300",
                                "describe configuration of capacitive sensor 300",
                                "describe operation of capacitive sensor 300",
                                "describe computation steps of method for temperature compensation",
                                "describe computation step S301 in detail",
                                "apply result of optimization of parameter ΔC′ to capacitive sensor 300",
                                "describe advantage of capacitive sensor 300",
                                "describe effect of sealing ring portion 38",
                                "describe effect of gold-gold bonding",
                                "describe advantage of capacitive sensor 300"
                            ],
                            "num_characters": 5188,
                            "outline_medium": [
                                "describe capacitive sensor 300",
                                "operation of capacitive sensor 300",
                                "computation step S301",
                                "computation steps S302 to S317",
                                "benefits of capacitive sensor 300"
                            ],
                            "outline_short": [
                                "describe capacitive sensor 300",
                                "describe computation steps of method for temperature compensation"
                            ]
                        },
                        {
                            "title": "Fourth Embodiment",
                            "paragraphs": [
                                "Now, a method for temperature compensation in a sensor according to a fourth embodiment of the present invention will be described with reference to FIG. 15 to FIG. 18. Portions 41 to 47 (some of the portions are not shown in the drawings) of a capacitive sensor 400 to which the results of computations in the method for temperature compensation according to the fourth embodiment are applied are similar to the portions 1 to 7, respectively, of the capacitive sensor 100 to which the results of computations in the method for temperature compensation according to the first embodiment are applied. Thus, description of the portions 41 to 47 may be omitted.",
                                "(Configuration of the Capacitive Sensor 400)",
                                "As shown in FIG. 15, the capacitive sensor (the sensor) 400 includes a substrate 41, an insulator layer 42, a first electrode portion 43, a second electrode portion 44, a diaphragm portion 45, a temperature compensation ring (temperature compensation member) 46, and a closed space 47 which are similar to the corresponding portions of the capacitive sensor 100, as well as a sealing ring portion 48 and a second barrier metal layer 49.",
                                "The sealing ring portion 48 is formed of gold and provided between the diaphragm portion 45 and the second electrode portion 44, more specifically, on a surface of the second electrode portion 44 opposite to a surface of the second electrode portion 44 on which the insulator layer 42 is formed, thus preventing a gas sealed in the closed space 47 from leaking.",
                                "The second barrier metal layer 49 contains at least platinum, has an inner diameter of 2R2 and an outer diameter of 2R3, and is formed between the diaphragm portion 45 and the sealing ring 48 like a ring similar to the sealing ring 48. The second barrier metal layer 49 includes two layers, a layer 49a located closest to the sealing ring 48 and formed of platinum and a layer (conductive portion) 49b located closest to the diaphragm portion 45 and formed of titanium. An inner circumferential surface of the second barrier metal layer 49 forms the closed space 47 along with an inner circumferential surface of the sealing ring portion 48, an inner surface of a recess 41a, an inner circumferential surface of a penetration portion 42a, an inner circumferential surface of the second electrode portion 44, and a surface of the diaphragm portion 45 on which the second barrier metal layer 49 is formed.",
                                "(Operation of the Capacitive Sensor 400)",
                                "Now, operation of the capacitive sensor 400 will be described. When a pressure based on atmospheric pressure is applied to the diaphragm portion 45 of the capacitive sensor 400, the diaphragm portion 45 is deformable depending on the pressure. The pressure is measured by detecting a change in the capacitance between the diaphragm portion 45 and both the first electrode portion 43 and the second electrode portion 44, the change being caused by the deformation.",
                                "(Computation Steps of the Method for Temperature Compensation in the Sensor According to the Fourth Embodiment)",
                                "Now, computation steps of the method for temperature compensation in the capacitive sensor will be described with reference to FIG. 16 to FIG. 18. Computation steps S402 to S417 of the method for temperature compensation according to the fourth embodiment are similar to the computation steps S2 to S17, respectively, of the method for temperature compensation according to the first embodiment. Thus, only the computation step S401 will be described in detail.",
                                "First, in the computation step S401, based on the Timoshenko's symmetric circular plate theory, a composite circular plate configured such that center axes of a layer 49b of the second barrier metal layer 49 which is closest to the diaphragm portion 45, the diaphragm portion 45, and the temperature compensation ring 46 align with one another is divided into a first segment (1) including a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion 45, a second segment (2) including a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion 45 and the temperature compensation ring 46, and a third segment (3) including a portion with a radius of R2 to R3 based on the center axes of the layer 49b of the second barrier metal layer 49 which is closest to the diaphragm portion 45, the diaphragm portion 45, and the temperature compensation ring 46.",
                                "Then, the computation steps S402 to S417 are sequentially carried out to finish the computation steps of the method for temperature compensation member in the capacitive sensor.",
                                "The above-described configuration applies the result of optimization of the parameter ΔC′ to the capacitive sensor 400. Thus, the capacitive sensor 400, configured to enjoy the barrier metal effect of the second barrier metal layer 49, can also detect a change in the capacitance between the diaphragm portion 45 and both the first electrode portion 43 and the second electrode portion 44 more accurately than in the conventional art.",
                                "Moreover, the above-described configuration applies the result of optimization of the parameter ΔC′ to the capacitive sensor. Thus, while configured to enjoy an effect enabling reliability of an electric connection between the second electrode portion 44 and the sealing ring portion 48 to be improved when the second electrode portion 44 and the sealing ring portion 48 are bonded together by a gold-gold bonding, the capacitive sensor 400 can also detect a change in the capacitance between the diaphragm portion 45 and both the first electrode portion 43 and the second electrode portion 44 more accurately than in the conventional art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe capacitive sensor 400",
                                "describe configuration of capacitive sensor 400",
                                "describe operation of capacitive sensor 400",
                                "describe computation steps of method for temperature compensation",
                                "describe computation step S401 in detail",
                                "apply result of optimization of parameter ΔC′ to capacitive sensor 400",
                                "describe advantage of capacitive sensor 400",
                                "describe effect of sealing ring portion 48",
                                "describe effect of gold-gold bonding",
                                "describe effect of second barrier metal layer 49",
                                "describe advantage of capacitive sensor 400"
                            ],
                            "num_characters": 5654,
                            "outline_medium": [
                                "describe capacitive sensor 400",
                                "operation of capacitive sensor 400",
                                "computation step S401",
                                "computation steps S402 to S417",
                                "benefits of capacitive sensor 400"
                            ],
                            "outline_short": [
                                "describe capacitive sensor 400",
                                "describe computation steps of method for temperature compensation"
                            ]
                        },
                        {
                            "title": "Fifth Embodiment",
                            "paragraphs": [
                                "Now, with reference to FIG. 19 to FIG. 22, a description will be given which concerns a computation program for a method for temperature compensation in a sensor and a computation processing device carrying out a computation process of the computation program, according to a fifth embodiment of the present invention.",
                                "(Configuration of a Computation Processing Device 500)",
                                "As shown in FIG. 19, a personal computer (computation processing device) 500 includes a display 51 that displays images, a keyboard 52 via which commands, numerical values, and the like are input, and a control device 53.",
                                "The control device 53 has a CPU 54 that controls devices in the personal computer 500, a hard disk 55, and a drive device 56. A CD-ROM 57 is removably installed in the drive device 56.",
                                "(Operation of the Computation Processing Device 500)",
                                "After the CD-ROM 57 is installed in the drive device 56, a program stored in the CD-ROM 57 (a computation program according to the fifth embodiment) is downloaded into the hard disk 55 in response to an instruction input via the keyboard 52.",
                                "(Computation Steps of the Computation Processing Device According to the Fifth Embodiment)",
                                "Now, computation steps of the computation processing device according to the fifth embodiment will be described with reference to FIG. 20 to FIG. 22. The computation steps shown in FIG. 20 to FIG. 22 are implemented by the CPU 54 by executing the program stored in the hard disk 55. The fifth embodiment carries out steps S501 to S507 in order which are similar to the computation steps S1 to S17 of the method for temperature compensation according to the first embodiment.",
                                "According to the above-described configuration, the personal computer 500 specifically executes the computation program according to the fifth embodiment to enjoy effects similar to the effects of the first embodiment.",
                                "The present invention is not limited to the above-described embodiments. The embodiments may be varied based on the spirits of the present invention without departing from the scope of the present invention. For example, as shown in FIG. 23, in a capacitive sensor 600 including a substrate 61, an insulator layer 62, a first electrode portion 63, a second electrode portion 64, a diaphragm portion 65, a temperature compensation ring 66, a sealing ring portion 68, and a second barrier metal layer 69 (69a and 69b) which are similar to the corresponding components of the capacitive sensor 400, a first barrier metal layer 60 may be formed which contains at least platinum and includes two layers, a layer 60a formed between the second electrode portion 64 and the insulator layer 62 like a ring similar to the second electrode portion 64, the layer 60a formed of titanium being located closest to the insulator layer 62, and a layer 60b formed of platinum and located closest to the second electrode portion 64. In this case, an inner circumferential surface of the first barrier metal layer 60 forms a closed space 67 along with an inner circumferential surface of the second barrier metal layer 69, an inner circumferential surface of the sealing ring portion 68, an inner surface of a recess 61a, an inner circumferential surface of a penetration portion 62a, an inner circumferential surface of the second electrode portion 64, and a surface of the diaphragm portion 65 on which the second barrier metal layer 69 is formed. Thus, the result of optimization of the parameter ΔC′ is applied to the capacitive sensor 600. Therefore, the capacitive sensor 600, configured to enjoy the barrier metal effect of the first barrier metal layer 60, can also detect a change in the capacitance between the diaphragm portion 65 and both the first electrode portion 63 and the second electrode portion 64 more accurately than in the conventional art.",
                                "In the example described above in the first to fifth embodiments, the Timoshenko's symmetric circular plate theory is applied to a composite circular plate with three layers including a layer closest to a diaphragm portion, the diaphragm portion, and a temperature compensation ring to obtain the parameter ΔC′, which enables determination of the degree of compensation for deformation of the diaphragm portion. However, the embodiments are not limited to this. The Timoshenko's symmetric circular plate theory may be applied to a composite circular plate with four or more layers including the three layers, the layer closest to the diaphragm portion, the diaphragm portion, and the temperature compensation ring, and an additional layer other than the layer closest to the diaphragm portion, the diaphragm portion, and the temperature compensation ring, to obtain the parameter ΔC′, which enables determination of the degree of compensation for the deformation of the diaphragm portion.",
                                "In the example described above in the fourth embodiment, the second barrier metal layer 49 includes a plurality of layers, that is, the layer 49a formed of platinum and located closest to the sealing ring 48 and the layer 49b formed of titanium and located closest to the diaphragm portion 45. However, the embodiments are not limited to this. As shown in FIG. 24, in a capacitive sensor 700 including a substrate 71, an insulator layer 72, a first electrode portion 73, a second electrode portion 74, a diaphragm portion 75, a temperature compensation ring 76, a closed space 77, and a sealing ring portion 78 which are similar to the corresponding portions of the capacitive sensor 400, the second barrier metal layer may have a single layer configuration including only a layer 79a formed of platinum. In this case, in the above-described computation step S401 (see FIG. 16), a composite circular plate configured such that the center axes of the layer 79a, the diaphragm portion 75, and the temperature compensation ring 76 align with one another is divided into a first segment (1) including a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion 75 (the position where the radius r is zero), a second segment (2) including a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion 75 and the temperature compensation ring 76, and a third segment (3) including a portion with a radius of R2 to R3 based on the center axes of the layer 79a, the diaphragm portion 75, and the temperature compensation ring 76, based on the Timoshenko's symmetric circular plate theory as is the case with the fourth embodiment.",
                                "In the example described above in the first embodiment, the temperature compensation ring 6 is shaped like a ring on the surface of the diaphragm portion 5 opposite to the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed. However, the embodiments are not limited to this. By way of example, as shown in FIG. 25(a) and FIG. 25(b), in a capacitive sensor 800 including a substrate 81, an insulator layer 82, a first electrode portion 83, a second electrode portion 84, a diaphragm portion 85, and a closed space 87 which are similar to the corresponding portions of the capacitive sensor 100, temperature compensation members 86 each shaped generally like a rectangular parallelepiped may be arranged at every 90° along a circumferential direction of the diaphragm portion 85, on the surface of the diaphragm portion 85 opposite to the surface of the diaphragm portion 85 on which the second electrode portion 84 is formed. In this example, as shown in FIG. 25(a), a radially outward end surface of the temperature compensation member 86 is shaped identically to an outer circumferential surface of the diaphragm portion 85 (a thick line portion in FIG. 25(a)) as viewed in a stacking direction of the substrate 81 and the insulator layer 82. The temperature compensation member 86 may be disposed at any position and have any shape provided that the temperature compensation member 86 is in a condition optimum for temperature compensation. This also applies to the capacitive sensors 200 to 400 according to the other embodiments (the second to fourth embodiments).",
                                "In the example described above in the first embodiment, the temperature compensation ring 6 is formed on the surface of the diaphragm portion 5 opposite to the surface of the diaphragm portion 5 on which the second electrode portion 4 is formed. However, the embodiments are not limited to this. By way of example, as shown in FIG. 26(a) and FIG. 26(b), in a piezo-resistive physical quantity sensor (a sensor) 900 including a substrate 91, an insulator layer 92, a first electrode portion 93, a second electrode portion 94, a diaphragm portion 95, and a closed space 97 which are similar to the corresponding portions of the capacitive sensor 100, sets of a temperature compensation member 96 and a piezo element 98 shaped generally like rectangular parallelepipeds may be arranged at every 90° along a circumferential direction of the diaphragm portion 95, on the surface of the diaphragm portion 95 opposite to the surface of the diaphragm portion 95 on which the second electrode portion 94 is formed. In this example, as shown in FIG. 26(a), radially outward end surfaces of the temperature compensation member 96 and the piezo element 98 are shaped identically to an outer circumferential surface of the diaphragm portion 95 (a thick line portion in FIG. 26(a)) as viewed in a stacking direction of the substrate 91 and the insulator layer 92. The piezo-resistive physical quantity sensor 900 uses the piezo element 98, having a resistance value varying depending on strain of the diaphragm portion 95, to detect the value of a pressure applied to the diaphragm portion 95. Changes in the resistance value can be detected based on outputs from the first electrode portion 93 and the second electrode portion 94. A material for the piezo element 98 may be a piezoelectric material such as PZT (lead zirconate titanate). This also applies to the other embodiments (the second to fourth embodiments).",
                                "Furthermore, in the first to fifth embodiments described above, the conductive portion (electrode portion) is shaped like a circular ring, the diaphragm portion is shaped like a circle, and the temperature compensation member is a temperature compensation ring so that the shapes of the conductive portion, the diaphragm portion, and the temperature compensation member correspond to one another. However, the present invention is not limited to this combination. For example, for compensation for the deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space, the conductive portion (electrode portion) and the temperature compensation member may be shaped like rectangular rings and the diaphragm portion may be shaped like a rectangle so that the shapes of the conductive portion, the temperature compensation member, and the diaphragm portion correspond to one another. Of course, the conductive portion, the diaphragm portion, and the temperature compensation member may have any shapes provided that the conductive portion, the diaphragm portion, and the temperature compensation member are formed to compensate for the deformation of the diaphragm portion caused by thermal expansion of the gas sealed in the closed space."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe computation program for method for temperature compensation",
                                "describe computation processing device 500",
                                "describe configuration of computation processing device 500",
                                "describe operation of computation processing device 500",
                                "describe computation steps of computation processing device 500",
                                "describe computation step S501 in detail",
                                "apply result of optimization of parameter ΔC′ to computation processing device 500",
                                "describe advantage of computation processing device 500",
                                "describe effect of computation program",
                                "describe effect of computation processing device 500",
                                "describe capacitive sensor 600",
                                "describe configuration of capacitive sensor 600",
                                "describe operation of capacitive sensor 600",
                                "describe computation steps of method for temperature compensation",
                                "apply result of optimization of parameter ΔC′ to capacitive sensor 600",
                                "describe advantage of capacitive sensor 600",
                                "describe effect of first barrier metal layer 60",
                                "describe effect of second barrier metal layer 69",
                                "describe capacitive sensor 700",
                                "describe configuration of capacitive sensor 700",
                                "describe operation of capacitive sensor 700",
                                "describe computation steps of method for temperature compensation"
                            ],
                            "num_characters": 11258,
                            "outline_medium": [
                                "describe computation processing device 500",
                                "operation of computation processing device 500",
                                "computation steps of computation processing device",
                                "describe computation step S501",
                                "describe computation step S502",
                                "describe computation step S503",
                                "describe computation step S504",
                                "describe computation step S505",
                                "describe computation step S506",
                                "describe computation step S507",
                                "benefits of computation processing device 500"
                            ],
                            "outline_short": [
                                "describe computation program for method for temperature compensation",
                                "describe computation processing device 500",
                                "describe operation of computation processing device 500",
                                "describe computation steps of computation processing device",
                                "describe effects of computation program"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for temperature compensation in a sensor comprising a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally comprising a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space.",
        "2. The method for temperature compensation in the sensor according to claim 1, wherein the sensor is configured as a capacitive sensor comprising the substrate, the ring-like conductive portion having an inner diameter of 2R2 and an outer diameter of 2R3, the diaphragm portion formed on the surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being shaped like a circular plate that is deformable depending on pressure and has an outer diameter of 2R3, the temperature compensation member that is a ring-shaped temperature compensation ring having an inner diameter of 2R1 and an outer diameter of 2R3, and the closed space, a part of the closed space being formed by the inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, and\nthe method comprises a computation step (1) of dividing, based on Timoshenko's symmetric circular plate theory, a composite circular plate configured such that center axes of the conductive portion, the diaphragm portion, and the temperature compensation ring align with one another into a first segment comprising a portion with a radius of 0 to R1 based on the center axis of the diaphragm portion, a second segment comprising a portion with a radius of R1 to R2 based on the center axes of the diaphragm portion and the temperature compensation ring, and a third segment comprising a portion with a radius of R2 to R3 based on the center axes of the conductive portion, the diaphragm portion, and the temperature compensation ring,\na computation step (2) of determining, based on Kirchhoff's circular plate theory, strains ∈0rr and ∈0θθ of a reference plane (z=0) in a stacking direction of the first to third segments (a direction of a Z axis) shown below in Formulae (5) and (6), using Formulae (1) to (4) shown below and representing relations between strains ∈rr and ∈θθ and deformations κr and κθ, in a radial direction (a direction of an r axis) and a circumferential direction (θ),\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 1} \\right\\rbrack & \\; \\\\\n{ɛ_{rr} = {ɛ_{rr}^{0} + {z\\; \\kappa_{r}}}} & (1) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 2} \\right\\rbrack & \\; \\\\\n{ɛ_{\\theta\\theta} = {ɛ_{\\theta\\theta}^{0} + {z\\; \\kappa_{\\theta}}}} & (2) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 3} \\right\\rbrack & \\; \\\\\n{\\kappa_{r} = {{{- {^{2}\\omega}}/{r}} = {{- {\\theta}}/{\\; r}}}} & (3) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 4} \\right\\rbrack & \\; \\\\\n{\\kappa_{\\theta} = {{{- \\left( {1/r} \\right)}\\left( {{\\omega}/{r}} \\right)} = {- \\left( {\\theta/r} \\right)}}} & (4) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 5} \\right\\rbrack & \\; \\\\\n{ɛ_{rr}^{0} = \\frac{u_{0}}{r}} & (5) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 6} \\right\\rbrack & \\; \\\\\n{ɛ_{\\theta\\theta}^{0} = \\frac{u_{0}}{r}} & (6)\n\\end{matrix}\\)\na computation step (3) of inputting Young's modulus E and Poisson's ratio ν to Formula (7) shown below to determine a matrix [Q],\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}{\\mspace{11mu} \\;}7} \\right\\rbrack & \\; \\\\\n{\\lbrack Q\\rbrack = {\\frac{E}{1 - v^{2}}\\begin{Bmatrix}\n1 & v \\\\\nv & 1\n\\end{Bmatrix}}} & (7)\n\\end{matrix}\\)\na computation step (4) of inputting the matrix [Q], the strains ∈0rr and ∈0θθ, the deformations κr and κθ, a coefficient of thermal expansion α, and a temperature difference ΔT (a difference between a reference temperature T0 in an initial state during compensation for deformation of the diaphragm portion and a temperature T1 resulting from a change) to a constitutive equation for stress on a linearly elastic symmetric circular plate with traverse isotropy shown below in Formula (8) to determine a stress σrr in the radial direction (the direction of the r axis) and a stress σθθ in the circumferential direction (θ),\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 8} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\n\\sigma_{rr} \\\\\n\\sigma_{\\theta\\theta}\n\\end{Bmatrix} = {\\lbrack Q\\rbrack \\left( {\\left\\{ \\begin{matrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{matrix} \\right\\rbrack + {z\\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{\\theta}\n\\end{Bmatrix}} - \\begin{Bmatrix}\n{\\alpha \\; \\Delta \\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{Bmatrix}} \\right)}} & (8)\n\\end{matrix}\\)\na computation step (5) of inputting the matrix [Q] to Formulae (9) to (11) shown below to compute matrixes [A], [B], and [D],\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 9} \\right\\rbrack & \\; \\\\\n{\\lbrack A\\rbrack = {\\begin{bmatrix}\nA_{11} & A_{12} \\\\\nA_{21} & A_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack \\ {z}}}}} & (9) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 10} \\right\\rbrack & \\; \\\\\n{\\lbrack B\\rbrack = {\\begin{bmatrix}\nB_{11} & B_{12} \\\\\nB_{21} & B_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack \\ z{z}}}}} & (10) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 11} \\right\\rbrack & \\; \\\\\n{\\lbrack D\\rbrack = {\\begin{bmatrix}\nD_{11} & D_{12} \\\\\nD_{21} & D_{22}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{\\lbrack Q\\rbrack \\ z^{2}{z}}}}} & (11)\n\\end{matrix}\\)\na computation step (6) of inputting the matrix [Q], the coefficient of thermal expansion α, and the temperature difference ΔT (the difference between the reference temperature T0 in the initial state during the compensation for the deformation of the diaphragm portion and the temperature T1 resulting from the change) to Formulae (12) and (13) shown below to compute matrices [NT] and [MT],\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 12} \\right\\rbrack & \\; \\\\\n{\\begin{bmatrix}\nN_{r}^{T} \\\\\nN_{\\theta}^{T}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{{\\lbrack Q\\rbrack \\ \\begin{bmatrix}\n{{\\alpha\\Delta}\\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{bmatrix}}{z}}}} & (12) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 13} \\right\\rbrack & \\; \\\\\n{\\begin{bmatrix}\nM_{r}^{T} \\\\\nM_{\\theta}^{T}\n\\end{bmatrix} = {\\int_{z_{1}}^{z_{2}}{{\\lbrack Q\\rbrack \\ \\begin{bmatrix}\n{{\\alpha\\Delta}\\; T} \\\\\n{{\\alpha\\Delta}\\; T}\n\\end{bmatrix}}z{z}}}} & (13)\n\\end{matrix}\\)\na computation step (7) of inputting, to Formula (14) shown below, the amount of initial deformation ω0′(r) of the diaphragm portion corresponding to the reference temperature T0 and the reference pressure P0 in the initial state during the compensation for the deformation of the diaphragm portion, and a distance g between the surface of the diaphragm portion on which the conductive portion is formed and an opposite surface of the substrate opposite to the surface of the diaphragm portion on which the conductive portion is formed, to compute a volume V0 in the closed space in the initial state,\n\n\n[Formula 14]\n\n\n\nV0=∫0R2πr(g+ω0′(r))dr  (14)\n\n\na computation step (8) of inputting a pressure PC in the closed space, the reference pressure P0, the volume V0 in the closed space in the initial state, the reference temperature T0, the temperature T1 resulting from the change, and a volume V1 (assumed value) in the closed space resulting from thermal expansion to Formula (15) shown below to compute a resultant pressure (a difference between the pressure PC in the closed space and the reference temperature P0 of an environment) P of the diaphragm portion,\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 15} \\right\\rbrack & \\; \\\\\n{P = {\\frac{P_{c}V_{0}T_{1}}{T_{0}V_{1}} - P_{0}}} & (15)\n\\end{matrix}\\)\na computation step (9) of inputting a dielectric constant ∈0 of vacuum, a relative dielectric constant (a ratio between a dielectric constant of a medium and the dielectric constant of vacuum) ∈r, the amount of initial deformation ω0′(r), and the distance g to Formula (16) shown below to compute a capacitance C0′ corresponding to the amount of initial deformation ω0′(r),\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 16} \\right\\rbrack & \\; \\\\\n{C_{0}^{\\prime} = {\\int_{0}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\; \\pi \\; r}{\\left( {g + {\\omega_{0}^{\\prime}(r)}} \\right)}\\ {r}}}} & (16)\n\\end{matrix}\\)\na computation step (10) of inputting Formulae (1) to (6) shown above to Formulae (17) and (18) shown below to obtain Formula (19) shown below and representing a resultant force Nr in the first to third segments in the radial direction (the direction of the r axis), Formula (20) shown below and representing a resultant force N0 in the first to third segments in the circumferential direction (θ), Formula (21) shown below and representing a resultant moment Mr in the first to third segments in the radial direction (the direction of the r axis), and Formula (22) shown below and representing a resultant moment Mθ in the first to third segments in the circumferential direction (θ),\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 17} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\nN_{r} \\\\\nN_{\\theta}\n\\end{Bmatrix} = {\\lbrack A\\rbrack \\left( {\\left\\{ \\begin{matrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{matrix} \\right\\rbrack + {\\lbrack B\\rbrack \\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{\\theta}\n\\end{Bmatrix}} - \\begin{Bmatrix}\nN_{r}^{T} \\\\\nN_{\\theta}^{T}\n\\end{Bmatrix}} \\right)}} & (17) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 18} \\right\\rbrack & \\; \\\\\n{\\begin{Bmatrix}\nM_{r} \\\\\nM_{\\theta}\n\\end{Bmatrix} = {\\lbrack B\\rbrack \\left( {\\left\\{ \\begin{matrix}\nɛ_{rr}^{0} \\\\\nɛ_{\\theta\\theta}^{0}\n\\end{matrix} \\right\\rbrack + {\\lbrack D\\rbrack \\begin{Bmatrix}\n\\kappa_{r} \\\\\n\\kappa_{\\theta}\n\\end{Bmatrix}} - \\begin{Bmatrix}\nM_{r}^{T} \\\\\nM_{\\theta}^{T}\n\\end{Bmatrix}} \\right)}} & (18) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 19} \\right\\rbrack & \\; \\\\\n{N_{r} = {{A_{11}\\frac{{u_{0}(r)}}{r}} + {A_{12}\\frac{u_{0}(r)}{r}} - {B_{11}\\frac{{\\theta (r)}}{r}} - {B_{12}\\frac{\\theta (r)}{r}} - N_{r}^{T}}} & (19) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 20} \\right\\rbrack & \\; \\\\\n{N_{\\theta} = {{A_{21}\\frac{{u_{0}(r)}}{r}} + {A_{22}\\frac{u_{0}(r)}{r}} - {B_{21}\\frac{{\\theta (r)}}{r}} - {B_{22}\\frac{\\theta (r)}{r}} - N_{\\theta}^{T}}} & (20) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 21} \\right\\rbrack & \\; \\\\\n{M_{r} = {{B_{11}\\frac{{u_{0}(r)}}{r}} + {B_{12}\\frac{u_{0}(r)}{r}} - {D_{11}\\frac{{\\theta (r)}}{r}} - {D_{12}\\frac{\\theta (r)}{r}} - M_{r}^{T}}} & (21) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 22} \\right\\rbrack & \\; \\\\\n{M_{\\theta} = {{B_{21}\\frac{{u_{0}(r)}}{r}} + {B_{22}\\frac{u_{0}(r)}{r}} - {D_{21}\\frac{{\\theta (r)}}{r}} - {D_{22}\\frac{\\theta (r)}{r}} - M_{\\theta}^{T}}} & (22)\n\\end{matrix}\\)\na computation step (11) of inputting the resultant force Nr in the first to third segments in the radial direction (the direction of the r axis), the resultant force Nθ in the first to third segments in the circumferential direction (θ), the resultant moment Mr in the first to third segments in the radial direction (the direction of the r axis), the resultant moment Mθ in the first to third segments in the circumferential direction (θ), a transverse shear force Qr, and the resultant pressure (the difference between the pressure in the closed space and the reference pressure of the environment) P of the diaphragm portion to Formulae (23) to (25) shown below, to determine a balanced equation for an axial symmetric circular plate represented in Formula (26) shown below,\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 23} \\right\\rbrack & \\; \\\\\n{{\\frac{N_{r}}{r} + \\frac{N_{r} - N_{\\theta}}{r}} = 0} & (23) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 24} \\right\\rbrack & \\; \\\\\n{Q_{r} = {\\frac{M_{r}}{r} + \\frac{M_{r} - M_{\\theta}}{r}}} & (24) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 25} \\right\\rbrack & \\; \\\\\n{{\\frac{Q_{r}}{r} + P + \\frac{Q_{r}}{r}} = 0} & (25) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 26} \\right\\rbrack & \\; \\\\\n{{{\\frac{1}{r}\\frac{}{r}\\left( {{r\\frac{M_{r}}{r}} + M_{r} + M_{\\theta}} \\right)} + P} = 0} & (26)\n\\end{matrix}\\)\na computation step (12) of inputting Formulae (19) to (22) shown above to Formulae (23) and (26) shown above to obtain relational expressions (27) and (28) shown below,\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 27} \\right\\rbrack & \\; \\\\\n{{\\frac{^{2}{\\theta (r)}}{r^{2}} + {\\frac{1}{r}\\frac{{\\theta (r)}}{r}} - \\frac{\\theta (r)}{r^{2}}} = \\frac{\\Pr}{2D_{11}^{*}}} & (27) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 28} \\right\\rbrack & \\; \\\\\n{{{\\frac{^{2}{u_{0}(r)}}{r^{2}} + {\\frac{1}{r}\\frac{{u_{0}(r)}}{r}} - \\frac{u_{0}(r)}{r^{2}}} = \\frac{\\Pr \\; \\beta}{2D_{11}^{*}}}\\left( {\\beta = {{{B_{11}/A_{11}}\\mspace{14mu} {and}\\mspace{14mu} D_{11}^{*}} = {D_{11} - {B_{11}^{2}/A_{11}}}}} \\right)} & (28)\n\\end{matrix}\\)\na computation step (13) of carrying out two integration processes on Formulae (27) and (28) shown above to obtain Formulae (29) and (30) shown below,\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 29} \\right\\rbrack & \\; \\\\\n{{\\theta (r)} = {{b_{1}r} + \\frac{b_{2}}{r} + {\\frac{1}{D_{11}^{*}}\\left( \\frac{\\Pr^{3}}{16} \\right)}}} & (29) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 30} \\right\\rbrack & \\; \\\\\n{{u_{0}(r)} = {{a_{1}r} + \\frac{a_{2}}{r} + {\\frac{\\beta}{D_{11}^{*}}\\left( \\frac{\\Pr^{3}}{16} \\right)}}} & (30)\n\\end{matrix}\\)\na computation step (14) of carrying out an integration process on Formula (29) shown above to compute an amount of deformation ω(1) of the diaphragm portion in the first segment shown below in Formula (31), an amount of deformation ω(2) of the diaphragm portion in the second segment shown below in Formula (32), and an amount of deformation ω(3) of the diaphragm portion in the third segment shown below in Formula (33),\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 31} \\right\\rbrack & \\; \\\\\n{{\\omega^{(1)} = {\\frac{\\Pr^{4}}{64D_{11}^{*{(1)}}} + \\frac{b_{1}^{(1)}r^{2}}{2} + c^{(1)}}},{0 \\leq r \\leq R_{1}}} & (31) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 32} \\right\\rbrack & \\; \\\\\n{{\\omega^{(2)} = {\\frac{\\Pr^{4}}{64D_{11}^{*{(2)}}} + \\frac{b_{1}^{(2)}r^{2}}{2} + {b_{2}^{(2)}{\\ln (r)}} + c^{(2)}}},{R_{1} \\leq r \\leq R_{2}}} & (32) \\\\\n\\left\\lbrack {{Formula}\\mspace{14mu} 33} \\right\\rbrack & \\; \\\\\n{{\\omega^{(3)} = 0},{R_{2} \\leq r \\leq R_{3}}} & (33)\n\\end{matrix}\\)\na computation step (15) of inputting the amount of deformation ω(1) and ω(2) and the distance g to Formula (34) shown below to compute the volume V1 in the closed space resulting from the thermal expansion,\n\n\n[Formula 34]\n\n\n\nV1=∫0R2πr(g+ω(1))dr+∫0R2πr(g+ω(2))dr  (34)\n\n\na computation step (16) of inputting the volume V1 to Formulae (31) and (32) shown above to compute a capacitance C′ shown below in Formula (35) and corresponding to the amounts of deformation ω(1) and ω(2), and\n\n\n\\(\\begin{matrix}\n\\left\\lbrack {{Formula}\\mspace{14mu} 35} \\right\\rbrack & \\; \\\\\n{C^{\\prime} = {{\\int_{0}^{R_{1}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; r}{\\left( {g + {\\omega^{(1)}(r)}} \\right)}\\ {r}}} + {\\int_{R_{1}}^{R_{2}}{\\frac{ɛ_{0}ɛ_{r}2\\pi \\; r}{\\left( {g + {\\omega^{(2)}(r)}} \\right)}\\ {r}}}}} & (35)\n\\end{matrix}\\)\na computation step (17) of inputting the capacitances C0′ and C′ to Formula (36) shown below to determine an amount of change in capacitance ΔC′, the computation steps (1) to (17) being carried out in order,\n\n\n[Formula 36]\n\n\n\nΔC′=C′−C0′  (36)",
        "3. The method for temperature compensation in the sensor according to claim 1, wherein the conductive portion is a second electrode portion for detecting a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion.",
        "4. The method for temperature compensation in the sensor according to claim 3, wherein the sensor comprises a barrier metal layer containing at least platinum and formed between the second electrode portion and the insulator layer, the barrier metal layer having an inner circumferential surface forming a part of the closed space.",
        "5. The method for temperature compensation in the sensor according to claim 2, wherein the conductive portion is a sealing ring portion formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the temperature compensation ring is formed, and\nthe sensor comprises a ring-like second electrode portion formed between the sealing ring portion and the insulator layer to detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion.",
        "6. The method for temperature compensation in the sensor according to claim 5, wherein the second electrode portion and the sealing ring portion of the sensor are bonded together by a gold-gold bonding.",
        "7. The method for temperature compensation in the sensor according to claim 2, wherein the sensor comprises:\na ring-like barrier metal layer containing at least platinum and formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the temperature compensation ring is formed; and\na ring-like second electrode portion formed between the barrier metal layer and the insulator layer to detect a change in the capacitance between the diaphragm portion and both the first electrode portion and the second electrode portion based on the deformation of the diaphragm portion, and\nwhen the barrier metal layer comprises a single layer, the conductive portion is the barrier metal layer, and\nwhen the barrier metal layer comprises a plurality of layers, the conductive portion is a layer included in the barrier metal layer and which is closest to the diaphragm portion.",
        "8. A computation program for carrying out a computation process for a method for temperature compensation in a sensor comprising a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally comprising a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space.",
        "9. A computation processing device carrying out a computation process in accordance with the computation program according to claim 8.",
        "10. A sensor comprising a substrate with a first electrode portion formed on one surface, a conductive portion formed on the one surface of the substrate via an insulator layer, a diaphragm portion formed on a surface of the conductive portion opposite to the surface of the conductive portion on which the insulator layer is formed, the diaphragm portion being deformable depending on pressure, and a temperature compensation member formed on a surface of the diaphragm portion opposite to the surface of the diaphragm portion on which the conductive portion is formed, the sensor internally comprising a closed space, a part of the closed space being formed along an inner circumferential surface of the conductive portion and the surface of the diaphragm portion on which the conductive portion is formed, wherein the temperature compensation member compensates for deformation of the diaphragm portion caused by thermal expansion of a gas sealed in the closed space."
    ]
}