{
    "id": "https://semopenalex.org/work/W1988418021",
    "authors": [
        "H. Yazawa",
        "Alain Goulet",
        "Tôru Fujii",
        "Kiminori Hattori",
        "A. Tanaka",
        "Masayasu Sawada",
        "Kunio Konno",
        "R. Bosmans"
    ],
    "title": "Fresnel lens sidewall design for imaging optics",
    "date": "2015-03-28",
    "abstract": "We developed a ray tracing simulation tool for imaging systems including a Fresnel lens with a quasi-arbitrary sidewall structure. One issue with Fresnel lens is that noise in the image plane can appear from rays passing through or reflected at its sidewalls. One way to reduce it is to modify the orientation of the sidewalls so that rays will not reach the image plane. To find the best sidewall orientations, we developed a method where locally, a sidewall can freely be oriented. We could then derive the best modulation scheme for each Fresnel lens sidewall. In the case of a single imaging Fresnel lens, relative parasite noise intensity could mostly be prevented. To experimentally check our method, snapshot images were taken with single Fresnel lenses and a single spherical lens. No noticeable differences in image quality could be observed using a standard C-MOS camera. However, parasite noise could experimentally be detected with a Fresnel lens prototype when using a very high-dynamic range C-MOS camera.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "It is well known that refractive Fresnel lenses [1,2] are much thinner and lighter than their refractive counterparts. This is illustrated in Figure 1, which shows a cross-sectional view of a plano-convex spherical lens (1(a)) and a Fresnel lens (1(b)), whose focal length is the same. The so-called sidewalls are the wall-like surfaces linking the Fresnel surfaces as indicated in Figure 1(b). The heights of the sidewalls can be reduced as thin a few microns but in this paper, we will assume there are sufficiently tall not to consider the Fresnel lens as a diffractive lens.",
                "The use of Fresnel lenses is particularly appealing for interchangeable lens (I/L) as it could dramatically reduce its weight, make it more stable, and thus allow faster shooting. Figure 2(a) shows an example of an interchangeable lens (I/L) originally designed for this research. If the first concave minuscus lens is replaced by a refractive Fresnel as shown in Figure 2(b), its weight can already be greatly reduced.",
                "There is however a strong limitation in using refractive Fresnel lens for imaging as sidewalls commonly produce optical noise. Two types of noise should be distinguished: first, rays passing through or reflected at the sidewalls can sometimes be observed in the image plane in the form of arcs, rainbows or ghost images. A case with a parasite ray is shown on Figure 2(c): an incident ray coming from left (air) is refracted first at the Fresnel lens surface, then propagates into the PMMA lens material and is next totally reflected at a sidewall. Prediction, evaluation and reduction of this parasite noise is the purpose of this paper. We present here a new ray tracing tool for Fresnel lens optics and a method for attenuating parasite noise by optimising the local orientation of a sidewall surface.",
                "Second, although we deal with refractive Fresnel lenses and not diffractive ones (DOE), sidewalls do generate diffraction that lead to blur in the image plane. This diffractive noise depends on the Fresnel lens design (Fresnel ring size, sidewall height and orientation) but it will not be treated here.",
                "Besides, geometric and chromatic aberrations like in any standard optical system occurs if the curvature of Fresnel lens surface is not optimised or aspherised. Whether a Fresnel lens introduces more or less aberration is not the purpose of this paper but we will show it could improve coma. "
            ],
            "subsections": []
        },
        {
            "title": "RAY TRACING TOOL",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Non-sequential ray tracing",
                    "paragraphs": [
                        "A non-sequential ray tracing tool including Fresnel surfaces was developed for this work. At first, we briefly evaluated the optical performances of our I/L tracing only optical rays, i.e. rays without interaction with sidewalls. Figure 3 shows spot diagrams of the conventional and Fresnel I/Ls depicted in Figure 2(a) and 2(b). The Fresnel lens was illuminated by 6 infinite point sources at incident angles of around 0 (on-axis), 2.4, 4.8, 7.2, 9.6, and 12 degrees. Spot diagrams for the conventional I/L are shown in Figure 2(a). The spots become more distorted by coma aberration when they are off-axis, mainly because the thickness of its first meniscus concave lens greatly change from the centre to its edges. In the case of the Fresnel I/L, the spot diagrams are less distorted. It can partially be explained by the roughly constant thickness of the Fresnel lens.",
                        "As already said, what prevents the use of Fresnel lenses in imaging optics is the optical noise generated by the sidewalls. This is shown on Figure 4 where optical and parasite rays are traced. In this simulation, 5 point sources located at 1 m from the Fresnel lens illuminated it at incidence angles around 0, 10, 19, 26, and 36 degrees. As seen on Figure 4(a), the lower part of the Fresnel lens contributes to the imaging of the five point sources, represented by red dots in the photometry map (4(b)). In the upper part, parasite rays reflected at the Fresnel sidewalls pass through the overall optical system and produces parasite arcs in the image plane as shown in (4(b)).",
                        "In our software, it is possible to set a large number of reflections and refractions. Basically, each ray at any interface may lead to both a transmitted ray and reflected ray and these rays may lead to two other rays at the next interface. Also, the power of each ray is calculated using the Fresnel's equation. In Figure 4(b), intensity of parasite rays are about 1000 times smaller than that of the light sources."
                    ],
                    "subsections": []
                },
                {
                    "title": "Free orientation of a local surface in a sidewall",
                    "paragraphs": [
                        "In the previous section, we showed that the sidewalls are responsible for the parasite noise. One way to reduce it is to change the orientation of these sidewalls. For instance, one can change the tilt of the sidewalls, i.e the angle between the optical axis and the sidewall slope to have conical frustum shape sidewalls. More complex sidewalls can also be imag- The size of the photometry map in the image plane is 36 by 24 mm and thus the 2 point sources with the highest incidence angle cannot be observed.",
                        "ined as e.g assembly of individual triangular or trapezoidal facets [3].",
                        "Our basic sidewall model is to sinusoidally modulate the top and edge contours of tilted sidewalls (see Figure 5(a) and 5(b)): after tilting a sidewall, the contours of its top and bottom edge contours are sinusoidally modulated in function of the polar angle with an identical amplitude, frequency and phase. As a result, the tilt angle of a sidewall remains constant whatever the polar angle. Also the radial position of the top and bottom edge points oscillate between a minimum and maximum radial position with the difference in their radial position equal to the modulation amplitude.",
                        "The difficulty with this basic sidewall model is to find the optimal sinusoidal modulation for each sidewall as there are too many combinations and as each simulation requires long computational time. Also, this model is probably not the best to prevent parasite rays.",
                        "To get more freedom, we developed a method that allows us to freely orient a local surface of a sidewall. In details, the basic sidewall model with the sinusoidally modulated sidewalls was used to locally orient the surface of a sidewall. As shown in Figure 5(c), a sidewall segment [AB] for a ring is obtained θ tilt : the tilt angle between the segment [AB] and the Z optical axis θ twist : the twist angle around the segment [AB]",
                        "For example, when both angles are zero, the Fresnel sidewalls are vertical as shown in Figure 1. If the tilt angle is constant for each ring and the twist angle is zero, the Fresnel rings are still circularly symmetric but with the top and bottom edge circles of a sidewall having different radial distances. Using the sinusoidally modulated sidewall Fresnel design with appropriate amplitude, phase and frequency, almost any tilt and twist angles, θ tilt and θ twist , can be obtained.",
                        "A local sidewall is just a little part of a full sidewall but one could build a complete sidewall by for instance adjoining to a local sidewall with θ tilt and θ twist , a local sidewall with the same θ tilt but opposite θ twist in a rotationally periodic fashion. Looking the Fresnel ring sidewall from the top, it would look like having a triangular modulation. This Fresnel design is unfortunately extremely difficult to manufacture as structure heights are normally in the order of tens to hundreds of microns. "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "PARASITE RAY EVALUATION METHOD FROM THE FREE LOCAL ORIENTATION OF SIDEWALLS",
            "paragraphs": [
                "Conventional ray tracing starts from a source in the object space and ends at the image plane. In our simulations, we are only interested in parasite rays interacting with sidewalls and thus most rays traced with the conventional way throughout the whole Fresnel lens surface are discarded. In order to reduce calculation time, we chose to perform non-sequential ray tracing from virtual point sources located on the local sidewall. They emit light in all directions but at first, we look at rays going towards the image plane and select only rays arriving at the image plane. We then perform reverse ray-tracing to find its origin in the object space if any.",
                "In practice, our parasite ray evaluation method works as follows: First, an optical system with lenses, apertures, a Fresnel lens, and an image plane is defined (see Figure 6(a)). At this stage, the Fresnel lens may have vertical sidewalls. Then, we apply a specific orientation to the sidewall local surface of ring i as described in Section 2.2. Next, point sources are virtually positioned on segment [AB] and emit light in all directions (see Figure 5(c)). Only parasite rays passing through or reflected by the local sidewall on ring i are taken into account.",
                "The merit function for a particular tilting and twisting angle, MF i (θ tilt , θ twist ) will be the integration of parasite ray intensity hitting an area in the image plane (e.g. a disk or a rectangle having the dimensions of the image sensor).",
                "To know the best local orientation, this process is iterated: the tilt and twist angles, θ tilt and θ twist are scanned and for each orientation, ray-tracing is carried out and the merit function of each Fresnel ring is calculated. Positive twist angles are only considered as negative twist angles will lead to the same merit function (negative tilt angle is prohibited because it cannot be fabricated). At the end, the merit function map MF i (θ tilt , θ twist ) of ring i is plotted as a function of the tilt and twist angles as shown in the upper left corner of Figure 7(a). It shows the relationship between sidewall orientation and accumulated intensity of parasite rays hitting an area on the image plane. Dark blue zones have the the lowest level of parasite noise whereas red brown zones have the highest. If we look at tilted only sidewalls (θ twist = 0 degree), the merit function MF i (θ tilt , 0) is minimal for a tilt angle of about 20 degrees.",
                "The merit function map MF i shows the best sidewall orientations for ring i. Ideally, one should calculate this map for each ring and then select ring by ring the optimal sidewall orientation.",
                "Besides, for each sidewall local surface orientation, one can know the origin of the parasite rays in the object space, which is a hemisphere in front of the optical system as shown in Figure 7(c) shows a grid of polar maps with θ twist and θ tilt varying from 0 to 70 degree in steps of 10 degrees. Each polar map here corresponds to a point in the merit function map of Figure 7(a). We can conclude that the best sidewall orientation is achieved for a θ tilt of 30 degrees and a θ twist of 70 degrees, where no parasite light is observed. We can also utilize these maps for designing a Fresnel lens camera for fixed usage under known light source location."
            ],
            "subsections": []
        },
        {
            "title": "SINGLE FRESNEL LENS CAMERA DESIGN AND RESULT",
            "paragraphs": [
                "For experimental verification, 3 single lens type I/Ls have been made and fixed to a Nikon-1 digital camera body (see Figure 8(b)). The lens inside the I/Ls is either a single refractive lens, a Fresnel lens with vertical sidewalls of 0.15 mm height or a Fresnel lens derived from the previous one but with 35 degree tilted sidewalls. All lenses had a focal length of 60 mm. The Fresnel lenses were machined by diamond turning on a 5 mm thick PMMA plate (see Figure 8(a)). An aperture of 15 mm diameter was put in front of the I/Ls leaving 6 rings apparent for the Fresnel lenses. The design of the Fresnel lens with 35 tilted sidewalls was selected after applying our parasite ray evaluation and optimisation method. Figure 9 shows the integrated merit function map with respect to the 6 first rings of the Fresnel lens. Although independent tilt and twist angle tuning for each ring is the best way to minimize parasite rays, all sidewall tilt and twist angles were move from respectively 0 to 40 degrees and -70 to 70 degrees in this preliminary trial. For a particular sidewall orientation, the integrated merit function was simply the summation of the 6 ring merit functions. Figure 9 indicates that many solutions exist where the integrated merit function is null. A good compro- mise in terms of noise and manufacturability was found for sidewalls having a tilting angle of 35 degrees and zero twist.",
                "Snapshots were taken under normal condition with the single spherical lens and the two Fresnel lenses. In Figure 10, neither parasite arcs nor significant image quality difference were observed in the pictures. In the magnified views below each image, one can however notice that bright reflections and the charactor '6' appeared slightly more blurred for the Fresnel lenses. These differences can partially be explained from the spot diagrams in Figure 8(c)-(e), which shows larger spot sizes for the Fresnel lenses than for the refractive lens when going off-axis.",
                "Photometric ray-tracing simulation indicates that parasite noise should observed using the Fresnel lens with vertical sidewalls but with the camera linear CMOS sensor, it could not be observed even in contrasted scenes. To be able to detect that noise, a high dynamic range CMOS sensor (NSC1005 from New Imaging Technologies) and a bright light LED source located at 1 m and at 5 degree incidence angle were used in a dark room.",
                "Figure 11 shows photometric simulations and experimental results using that HDR CMOS sensor. Photometric simulations 11(b) and 11(d) show that parasite noise should only be observed for the 35 degree tilted sidewall Fresnel lens in this case. In the HDR-CMOS pictures 11(c) and 11(e), the LED image was located about 2 mm above the top edge of the CMOS sensor but it illuminated a peripheral circuit whose reflections were responsible for diffused light at the top of the pictures. Nevertheless, on can see in the white square boxes of these pictures that arc-like parasite noise is visible for the 35 degree tilted sidewall Fresnel lens and cannot almost be seen for the vertical sidewall Fresnel lens. The difficulty in watching the parasite noise may come from the high roughness of the sidewall surface. Indeed, as the sidewalls could not be polished, these surfaces may not be of optical quality and may diffuse light.",
                "T. Fujii, et al. "
            ],
            "subsections": []
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "We developed a non-sequential ray tracing tool for Fresnel lens design and presented a method for reducing the noise generated from their wall-like structure. The tool allows the free orientation of a local sidewall surface. It is demonstrated that the tilt and twist angle of a local sidewall surface affect the parasite rays and thus the parasite noise in the image plane.",
                "Our method not only provides the optimal sidewall orientations but shows the location of the harmful light sources in the object space. Preliminary design and evaluation of a single Fresnel lens imaging system was done by simulation and experiments using a digital camera with a linear CMOS and a high dynamic range CMOS sensor. First, ray tracing photometric simulations showed that vertical sidewall Fresnel lens generated arc-like parasite rays in the image plane whereas 35 degree tilted sidewall Fresnel lens did not as was predicted by the local sidewall surface optimisation process. When the digital camera was coupled to the single spherical convex lens or the equivalent Fresnel lenses, similar pictures were obtained with little difference in image quality. Noise-like background intensity difference between the vertical and tilted sidewall Fresnel lenses could be observed by capturing pictures with a high dynamic range CMOS sensor, however clear parasite arcs could not be observed, which may due to the surface roughness of the sidewalls."
            ],
            "subsections": []
        }
    ]
}