{
    "id": "US20200362316",
    "authors": [
        "Sergio E. Rodriguez",
        "Robert W. Cross",
        "Chad E. Mire",
        "Thomas W. Geisbert"
    ],
    "title": "VESICULAR STOMATITIS VECTORS ENCODING CRIMEAN-CONGO HEMORRHAGIC FEVER ANTIGEN",
    "date": "2020-05-15 00:00:00",
    "abstract": "Certain embodiments are directed generally to compositions and methods related to recombinant vesicular stomatitis virus vectors (ΔGrVSV) encoding Crimean-Congo Hemorrhagic Fever glycoprotein precursor (CCHFV-GPC) and forming a recombinant vesicular stomatitis virus vector encoding Crimean-Congo Hemorrhagic Fever glycoprotein precursor (ΔGrVSV-CCHFV-GPC).",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "STATEMENT REGARDING FEDERALLY FUNDED RESEARCH",
                    "paragraphs": [
                        "None."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "no federally funded research"
                    ],
                    "num_characters": 5,
                    "outline_medium": [
                        "no federally funded research"
                    ],
                    "outline_short": [
                        "no federally funded research"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Crimean-Congo hemorrhagic fever (CCHF) is a widespread tick-borne viral disease that can affect humans. It is a member of the Bunyavirales order of RNA viruses. Clinical disease is rare in infected mammals, but it is commonly severe in infected humans. Outbreaks of illness are usually attributable to handling infected animals or contact with infected people.",
                        "The causative organism is found in Asia, Eastern Europe, the Middle East, a belt across central Africa and South Africa and Madagascar. The main environmental reservoir and vector for the virus is hard ticks. Ticks carry the virus to domestic animal stock. Sheep, goats and cattle can develop viremia, but tend not to fall ill. Tick species that have been identified as infected with this virus include Argas reflexus, Hyalomma anatolicum, Hyalomma detritum, Hyalomma marginatum and Rhipicephalus sanguineus.",
                        "The onset of CCHF is sudden, with initial signs and symptoms including headache, high fever, back pain, joint pain, stomach pain, and vomiting. Red eyes, a flushed face, a red throat, and petechiae (red spots) on the skin are common. Symptoms may also include jaundice, and in severe cases, changes in mood and sensory perception. As the illness progresses, large areas of severe bruising, severe nosebleeds, and uncontrolled bleeding at injection sites can be seen, beginning on about the fourth day of illness and lasting for about two weeks.",
                        "Animal herders, livestock workers, and slaughterhouses in endemic areas are at risk of CCHF. Healthcare workers in endemic areas are at risk of infection through unprotected contact with infectious blood and body fluids. Individuals and international travelers with contact to livestock in endemic regions may also be exposed. In documented outbreaks of CCHF, fatality rates in hospitalized patients have ranged from 5% to as high as 80%.",
                        "Previous attempts to develop preventative treatment include a USSR/Bulgarian CCHF vaccine developed in 1974 comprised an inactivated antigen from CCHF virus strain V42/81. It was generated from suckling mouse brain preparations, and so is unsuitable for FDA approval in the U.S. There is also a recombinantly produced construct comprising G1 (GC), or G2 (Gn) glycoprotein ectodomains or portions thereof. However, no study exists to suggest any efficacy for this approach. Full effectiveness of this construct may be limited to the specific strain where the selected glycoproteins originated. There is no established virus-specific treatment. Ribavirin is thought to be effective in vitro, and has been used in human subjects during outbreaks. There are conflicting reports as to ribavirin effectiveness, with the more recent ones showing limited to no effectiveness against CCHF virus in vivo.",
                        "The Department of Defense views CCHF virus as a potential threat to the U.S. armed forces when operating in countries endemic to the virus. These geographical locations include but are not limited to Afghanistan, Pakistan, and the Middle East. The need for preventative treatment was underscored by death of a U.S. soldier from CCHF in 2009.",
                        "There remains a need for additional diagnostic, prophylactic, and therapeutic compositions and methods for CCHF."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce CCHF disease",
                        "describe environmental reservoir and vector",
                        "list symptoms of CCHF",
                        "identify high-risk groups",
                        "discuss previous attempts at preventative treatment",
                        "highlight need for new compositions and methods"
                    ],
                    "num_characters": 3209,
                    "outline_medium": [
                        "introduce CCHF disease",
                        "describe environmental reservoir and vector",
                        "discuss previous attempts at preventative treatment"
                    ],
                    "outline_short": [
                        "describe CCHF disease and need for treatment"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Certain embodiments are directed generally to compositions and methods related to recombinant vesicular stomatitis virus vectors (ΔGrVSV) encoding Crimean-Congo Hemorrhagic Fever glycoprotein precursor (CCHFV-GPC) and forming a recombinant vesicular stomatitis virus vector encoding Crimean-Congo Hemorrhagic Fever glycoprotein precursor (ΔGrVSV-CCHFV-GPC). In certain instance such compositions and methods can be but are not necessarily 100% effective against lethal CCHFV challenge with a single injection, as demonstrated in a mouse model, and can be effective across multiple species of CCHFV.",
                        "In certain embodiments the ΔGrVSV-CCHFV-GPC is replication competent. The replication competent ΔGrVSV-CCHFV-GPC can have a nucleotide sequence that is, is at least or is about 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, to 100% identical to the nucleic acid sequence of SEQ ID NO:1. In certain instances the replication competent ΔGrVSV-CCHFV-GPC contains 20 single nucleotide polymorphisms throughout the genome, including mutations in the CCHFV-GPC. In certain aspects, the replication competent ΔGrVSV-CCHFV-GPC contains 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, or 20 variant nucleotides at one or more positions selected from position(s) 104, 1615, 1626, 1627, 1725, 1726, 2233, 2647, 2919, 2926, 2989, 4182, 4633, 7994, 8024, 8092, 8134, 8143, 10311, and/or 14322 of SEQ ID NO:1, wherein in an 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, or 19 variants can be specifically excluded individually or in various combinations. In a particular aspect, the variant(s) are one or more of A104G, T1615C, A1626C, G1627A, C1725A, A1726G, T2233C, A2647G, T2919C, A2926G, T2989C, T4182A, C4633G, T7994G, G8024A, A8092T, T8134C, G8143C, C10311G, and/or C14322T of SEQ ID NO:1, wherein in an 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, or 19 variants can be specifically excluded. SEQ ID NO:9 provides the nucleic acid sequence of a variant VSV backbone as compared to the VSV backbone of SEQ ID NO:10. In certain aspects the GPC mutant results in a 14 amino acid truncation at the C-terminal end of the glycoprotein precursor protein (SEQ ID NO:5 or SEQ ID NO:7), as compared to the full length SEQ ID NO:8. Certain embodiments are directed to an expression vector configured to express or overexpress a CCHFV-GPC described herein. In certain instances the amino acid sequence of CCHFV-GPC protein encoded by nucleic acids described herein is, is at least or is about 90, 91, 92, 93, 94, 95, 96, 97. 98. 99, to 100% identical to the amino acid sequence of SEQ ID NO:5 or SEQ ID NO:7 or the amino acid sequence of SEQ ID NO:8.",
                        "In certain embodiments the nucleic acid segment encoding the CCHFV-GPC is codon optimized. In certain instances the nucleic acid segment encoding the codon optimized CCHFV-GPC is 95, 96, 97, 98, 99, to 100% identical to nucleic acid sequence of SEQ ID NO:2. Certain embodiments are directed to an expression vector configured to express or overexpress a codon optimized nucleic acid encoding CCHFV-GPC as described herein. In certain aspect the optimized CCHFV-GPC provides an increase in production of CCHFV glycoproteins allowing localization in the plasma membrane and enabling uptake by VSV viruses budding from the cell surface.",
                        "Certain embodiments are directed to a replication deficient recombinant Vesicular Stomatitis Virus (rVSV) vector comprising a VSV glycoprotein deficient VSV (ΔGrVSV) genome encoding a Crimean-Congo Hemorrhagic Fever virus (CCHFV) glycoprotein precursor (GPC)(ΔGrVSV-CCHFV-GPC). In certain instance the replication deficient recombinant ΔGrVSV-CCHFV-GPC has a nucleic acid sequence that is, is at least, or is about 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, to 100% identical to the nucleic acid sequence of SEQ ID NO:4.",
                        "In addition to constitutive expression, transcription can be controlled and/or driven by other expression systems in other expression platforms (mammalian cells vs. insect cells vs. bacteria) with T7 or PolII or T3 or Lac promoters etc. In certain aspects, the transcription of the nucleic acid sequence encoding the CCHFV-GPC is driven by a chicken actin promoter.",
                        "In certain aspects, the nucleic acid sequence encoding the CCHFV-GPC (SEQ ID NO:5) from the replication competent ΔGrVSV-CCHFV-GPC is 99.07% identical to the nucleic acid sequence of SEQ ID NO:4.",
                        "In certain aspects, the nucleic acid sequence encoding the CCHFV-GPC (SEQ ID NO:7) from the replication deficient ΔGrVSV-CCHFV-GPC is also 99.96% identical to the nucleic acid sequence of SEQ ID NO:6.",
                        "In certain aspects, the encoded CCHFV-GPC (SEQ ID NO:2) from the replication competent ΔGrVSV-CCHFV-GPC has an amino acid sequence that is 99.8% identical to the fully intact codon-optimized CCHFV-GPC amino acid sequence of SEQ ID NO:8.",
                        "In certain aspects, the vector backbone of the replication competent ΔGrVSV-CCHFV-GPC (SEQ ID NO:9) has a nucleic acid sequence that is 99.86% identical to the starting vector ΔGrVSV SEQ ID NO:10.",
                        "In certain embodiments a vector described herein can included in an expression cassette. The expression cassette can be further included in an expression vector, such as a plasmid vector, that expresses the ΔGrVSV-CCHFV-GPC nucleic acid.",
                        "Certain embodiments are directed to a recombinant Vesicular Stomatitis Virus (rVSV) comprising a Crimean-Congo Hemorrhagic Fever virus (CCHFV) glycoprotein (rVSV-CCHFV-GP) GN and/or GC.",
                        "Other embodiments can include a vaccine composition including a vector or a virus as described herein.",
                        "Certain embodiments are directed to methods of producing an immune response in a mammal comprising administering one or more of a vector, a virus, or a vaccine as described herein to a mammal, and in particular a human. The virus, vector, or vaccine can be administered by injection, inhalation, or instillation.",
                        "Certain embodiments are directed to methods for producing a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC) comprising the step of passaging a VSV glycoprotein complemented recombinant Vesicular Stomatitis Virus encoding Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor (VSV-G*-ΔGrVSV-CCHFV-GPC) in a non-complementing VSV glycoprotein cell line and isolating a replication competent ΔGrVSV-CCHFV-GPC vector.",
                        "Other embodiments are directed to methods of producing replication competent recombinant Vesicular Stomatitis Virus encoding a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP), comprising infecting a cell culture with the isolated replication competent ΔGrVSV-CCHFV-GPC vector and isolating ΔGrVSV-CCHFV-GP virus produced by the infected cells.",
                        "Certain embodiments are directed to kits comprising one or more of (a) at least one dose of a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC); or (b) at least one dose of a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP).",
                        "Other embodiments are directed to methods for identifying a subject infected with or exposed to Crimean-Congo Hemorrhagic Fever virus comprising the steps of: (a) contacting a biological sample with a recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP) or a cell expressing a recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC) forming a Crimean-Congo Hemorrhagic Fever glycoprotein/antibody complex with Crimean-Congo Hemorrhagic Fever glycoprotein specific antibodies present in the sample; and (b) detecting glycoprotein/antibody complexes.",
                        "Other embodiments of the invention are discussed throughout this application. Any embodiment discussed with respect to one aspect of the invention applies to other aspects of the invention as well and vice versa. Each embodiment described herein is understood to be embodiments of the invention that are applicable to all aspects of the invention. It is contemplated that any embodiment discussed herein can be implemented with respect to any method or composition of the invention, and vice versa. Furthermore, compositions and kits of the invention can be used to achieve methods of the invention.",
                        "As used herein, “rVSV” is used to refer to a recombinant vesicular stomatitis virus.",
                        "The terms “protein”, “peptide”, “polypeptide”, and “amino acid sequence” are used interchangeably herein to refer to polymers of amino acid residues of any length. The terms also encompass an amino acid polymer that has been modified naturally or by intervention; for example disulfide bond formation, glycosylation, lipidation, acetylation, phosphorylation, or any other manipulation or modification, such as conjugation with a labeling or bioactive component.",
                        "As used herein, the term “variant” refers to a polypeptide or nucleic acid differing from a reference nucleic acid or polypeptide, but retaining essential properties thereof. Generally, variants are overall closely similar, and, in many regions, identical to the reference nucleic acid or polypeptide. A variant can include one or more nucleotide or amino acid substitutions.",
                        "As used herein the term “mutant” refers to a protein or polypeptide in which one or more amino acids are added and/or substituted and/or deleted and/or inserted at the N-terminus, and/or the C-terminus, and/or within the native amino acid sequences of the proteins or polypeptides disclosed herein. As used herein the term “mutant” can refer to a nucleic acid molecule that encodes a mutant protein. Moreover, the term “mutant” refers to any shorter or longer version of the protein or nucleic acid herein.",
                        "As used herein, the terms “antigen” or “immunogen” are used interchangeably to refer to a substance, typically a protein, which is capable of inducing an immune response in a subject. The term also refers to proteins that are immunologically active in the sense that once administered to a subject (either directly or by administering to the subject a nucleotide sequence or vector that encodes the protein) is able to evoke an immune response of the humoral and/or cellular type directed against that protein.",
                        "As used herein the terms “nucleotide sequences” and “nucleic acid sequences” refer to deoxyribonucleic acid (DNA) or ribonucleic acid (RNA) sequences, including, without limitation, messenger RNA (mRNA), DNA/RNA hybrids, or synthetic nucleic acids. The nucleic acid may be single-stranded, or partially or completely double-stranded (duplex). Duplex nucleic acids may be homoduplex or heteroduplex.",
                        "As used herein the term “transgene” or “heterologous nucleic acid sequence” may be used to refer to “recombinant” nucleotide sequences that may be derived from any of the nucleotide sequences encoding the proteins of the present invention. The term “recombinant” means a nucleotide sequence that has been manipulated “by man” and which does not occur in nature, or is linked to another nucleotide sequence or found in a different arrangement in nature. It is understood that manipulated “by man” means manipulated by some artificial means, including by use of machines, codon optimization, restriction enzymes, etc.",
                        "As regards codon optimization, the nucleic acid molecules of the invention have a nucleotide sequence that encodes the antigens of the invention and may be designed to employ codons that are used in the genes of the subject in which the antigen is to be produced. Many viruses use a large number of rare codons and, by altering these codons to correspond to codons commonly used in the desired subject, enhanced expression of the antigens may be achieved. In a preferred embodiment, the codons used are “humanized” codons, i.e., the codons are those that appear frequently in highly expressed human genes (Andre et al., J. Virol. 72:1497-1503, 1998) instead of those codons that are frequently used by a virus. Such codon usage provides for efficient expression of the transgenic proteins in human cells. Any suitable method of codon optimization may be used.",
                        "Certain embodiments encompasses nucleotide sequences encoding functionally and/or antigenically equivalent variants and derivatives of the antigens of the invention and functionally equivalent fragments thereof. These functionally equivalent variants, derivatives, and fragments display the ability to retain antigenic activity. For instance, changes in a DNA sequence that do not change the encoded amino acid sequence, as well as those that result in conservative substitutions of amino acid residues, one or a few amino acid deletions or additions, and substitution of amino acid residues by amino acid analogs are those which will not significantly affect properties of the encoded polypeptide. Conservative amino acid substitutions are glycine/alanine; valine/isoleucine/leucine; asparagine/glutamine; aspartic acid/glutamic acid; serine/threonine/methionine; lysine/arginine; and phenylalanine/tyrosine/tryptophan. In one embodiment, the variants have at least 50%, at least 55%, at least 60%, at least 65%, at least 70%, at least 75%, at least 80%, at least 85%, at least 86%, at least 87%, at least 88%, at least 89%, at least 90%, at least 91%, at least 92%, at least 93%, at least 94%, at least 95%, at least 96%, at least 97%, at least 98% or at least 99% identity to the antigen, epitope, immunogen, peptide or polypeptide of interest.",
                        "For the purposes of the present invention, sequence identity is determined by comparing the sequences when aligned so as to maximize overlap and identity while minimizing sequence gaps. In particular, sequence identity may be determined using any of a number of mathematical algorithms. A nonlimiting example of a mathematical algorithm used for comparison of two sequences is the algorithm of Karlin and Altschul, Proc. Natl. Acad. Sci. USA 1990; 87: 2264-2268, modified as in Karlin and Altschul, Proc. Natl. Acad. Sci. USA 1993; 90: 5873-5877. Another example of a mathematical algorithm used for comparison of sequences is the algorithm of Myers and Miller, CABIOS 1988; 4: 11-17. Such an algorithm is incorporated into the ALIGN™ program (version 2.0) which is part of the GCG sequence alignment software package. When utilizing the ALIGN™ program for comparing amino acid sequences, a PAM 120 weight residue table, a gap length penalty of 12, and a gap penalty of 4 may be used. Yet another useful algorithm for identifying regions of local sequence similarity and alignment is the FASTA algorithm as described in Pearson and Lipman, Proc. Natl. Acad. Sci. USA 1988; 85: 2444-2448.",
                        "The nucleotide sequences of the present invention may be inserted into “vectors.” The term “vector” is widely used and understood by those of skill in the art, and as used herein the term “vector” is used consistent with its meaning to those of skill in the art. For example, the term “vector” is commonly used by those skilled in the art to refer to a vehicle that allows or facilitates the transfer of nucleic acid molecules from one environment to another or that allows or facilitates the manipulation of a nucleic acid molecule.",
                        "Any vector that allows expression of the antigens described herein may be used in accordance with the present invention. In certain embodiments, the antigens may be used in vitro (such as using cell-free expression systems) and/or in cultured cells grown in vitro in order to produce the encoded CCHFV antigens which may then be used for various applications such as in the production of proteinaceous vaccines. For such applications, any vector that allows expression of the antigen(s) in vivo, in vitro and/or in cultured cells may be used.",
                        "For applications where it is desired that the antigen(s) be expressed in vivo, for example when the transgenes of the invention are used in DNA or DNA-containing vaccines, any vector that allows for the expression of the antigen(s) described herein and is safe for use in vivo may be used. In preferred embodiments the vectors used are safe for use in humans, mammals and/or laboratory animals.",
                        "For the antigen(s) described herein to be expressed, the protein coding sequence should be “operably linked” to regulatory or nucleic acid control sequences that direct transcription and translation of the protein. As used herein, a coding sequence and a nucleic acid control sequence or promoter are said to be “operably linked” when they are covalently linked in such a way as to place the expression or transcription and/or translation of the coding sequence under the influence or control of the nucleic acid control sequence. The “nucleic acid control sequence” may be any nucleic acid element, such as, but not limited to promoters, enhancers, IRES, introns, and other elements described herein that direct the expression of a nucleic acid sequence or coding sequence that is operably linked thereto. The term “promoter” will be used herein to refer to a group of transcriptional control modules that are clustered around the initiation site for RNA polymerase II and that when operationally linked to the protein coding sequences of the invention lead to the expression of the encoded protein. The expression of the transgenes or coding regions described herein may be under the control of a constitutive promoter or of an inducible promoter, which initiates transcription only when exposed to some particular external stimulus, such as, without limitation, antibiotics such as tetracycline, hormones such as ecdysone, or heavy metals. The promoter may also be specific to a particular cell-type, tissue or organ. Many suitable promoters and enhancers are known in the art, and any such suitable promoter or enhancer may be used for expression of the transgenes of the invention. For example, suitable promoters and/or enhancers may be selected from the Eukaryotic Promoter Database (EPDB).",
                        "The phrase “pharmaceutically acceptable” is employed herein to refer to those compounds, materials, compositions, and/or dosage forms which are, within the scope of sound medical judgment, suitable for use in contact with the tissues of human beings and animals without excessive toxicity, irritation, allergic response, or other problem or complication, commensurate with a reasonable benefit/risk ratio.",
                        "The use of the word “a” or “an” when used in conjunction with the term “comprising” in the claims and/or the specification may mean “one,” but it is also consistent with the meaning of “one or more,” “at least one,” and “one or more than one.”",
                        "Throughout this application, the term “about” is used to indicate that a value includes the standard deviation of error for the device or method being employed to determine the value.",
                        "The use of the term “or” in the claims is used to mean “and/or” unless explicitly indicated to refer to alternatives only or the alternatives are mutually exclusive, although the disclosure supports a definition that refers to only alternatives and “and/or.”",
                        "As used in this specification and claim(s), the words “comprising” (and any form of comprising, such as “comprise” and “comprises”), “having” (and any form of having, such as “have” and “has”), “including” (and any form of including, such as “includes” and “include”) or “containing” (and any form of containing, such as “contains” and “contain”) are inclusive or open-ended and do not exclude additional, unrecited elements or method steps.",
                        "As used herein, the terms “comprises,” “comprising,” “includes,” “including,” “has,” “having,” “contains”, “containing,” “characterized by” or any other variation thereof, are intended to encompass a non-exclusive inclusion, subject to any limitation explicitly indicated otherwise, of the recited components. For example, a chemical composition and/or method that “comprises” a list of elements (e.g., components or features or steps) is not necessarily limited to only those elements (or components or features or steps), but may include other elements (or components or features or steps) not expressly listed or inherent to the chemical composition and/or method.",
                        "As used herein, the transitional phrases “consists of” and “consisting of” exclude any element, step, or component not specified. For example, “consists of” or “consisting of” used in a claim would limit the claim to the components, materials or steps specifically recited in the claim except for impurities ordinarily associated therewith (i.e., impurities within a given component). When the phrase “consists of” or “consisting of” appears in a clause of the body of a claim, rather than immediately following the preamble, the phrase “consists of” or “consisting of” limits only the elements (or components or steps) set forth in that clause; other elements (or components) are not excluded from the claim as a whole.",
                        "As used herein, the transitional phrases “consists essentially of” and “consisting essentially of” are used to define a chemical composition and/or method that includes materials, steps, features, components, or elements, in addition to those literally disclosed, provided that these additional materials, steps, features, components, or elements do not materially affect the basic and novel characteristic(s) of the claimed invention. The term “consisting essentially of” occupies a middle ground between “comprising” and “consisting of.”",
                        "Other objects, features and advantages of the present invention will become apparent from the following detailed description. It should be understood, however, that the detailed description and the specific examples, while indicating specific embodiments of the invention, are given by way of illustration only, since various changes and modifications within the spirit and scope of the invention will become apparent to those skilled in the art from this detailed description."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce recombinant vesicular stomatitis virus vectors",
                        "describe Crimean-Congo Hemorrhagic Fever glycoprotein precursor",
                        "outline replication competent ΔGrVSV-CCHFV-GPC",
                        "specify nucleotide sequence identity",
                        "describe single nucleotide polymorphisms",
                        "outline codon optimized CCHFV-GPC",
                        "describe expression vector",
                        "outline replication deficient ΔGrVSV-CCHFV-GPC",
                        "specify nucleotide sequence identity",
                        "describe transcription control systems",
                        "outline chicken actin promoter",
                        "compare nucleotide sequence identities",
                        "describe amino acid sequence identity",
                        "outline expression cassette",
                        "describe plasmid vector",
                        "outline recombinant Vesicular Stomatitis Virus",
                        "describe vaccine composition",
                        "outline methods of producing immune response",
                        "describe administration methods",
                        "outline methods of producing replication competent ΔGrVSV-CCHFV-GPC",
                        "describe passaging VSV glycoprotein complemented recombinant Vesicular Stomatitis Virus",
                        "outline methods of producing replication competent ΔGrVSV-CCHFV-GP",
                        "describe infecting cell culture",
                        "outline kits",
                        "describe methods for identifying subjects infected with Crimean-Congo Hemorrhagic Fever virus",
                        "outline detecting glycoprotein/antibody complexes",
                        "define recombinant vesicular stomatitis virus",
                        "define protein, peptide, polypeptide, and amino acid sequence",
                        "define variant",
                        "define mutant",
                        "define antigen and immunogen",
                        "define nucleotide sequences and nucleic acid sequences",
                        "define transgene and heterologous nucleic acid sequence",
                        "describe codon optimization",
                        "outline functionally and/or antigenically equivalent variants and derivatives",
                        "describe conservative amino acid substitutions",
                        "outline sequence identity determination",
                        "describe algorithm for comparing sequences",
                        "define vector",
                        "outline expression of antigens in vitro and in cultured cells",
                        "describe in vivo expression",
                        "outline regulatory or nucleic acid control sequences",
                        "define promoter",
                        "describe pharmaceutically acceptable compounds and materials"
                    ],
                    "num_characters": 22117,
                    "outline_medium": [
                        "introduce recombinant vesicular stomatitis virus vectors",
                        "describe Crimean-Congo Hemorrhagic Fever glycoprotein precursor",
                        "outline replication competent ΔGrVSV-CCHFV-GPC",
                        "detail nucleotide sequence of SEQ ID NO:1",
                        "list single nucleotide polymorphisms in genome",
                        "specify variant nucleotides at specific positions",
                        "describe codon optimized CCHFV-GPC",
                        "outline expression vector for codon optimized CCHFV-GPC",
                        "introduce replication deficient recombinant Vesicular Stomatitis Virus",
                        "describe nucleotide sequence of SEQ ID NO:4",
                        "outline transcription control systems",
                        "compare nucleic acid sequences of SEQ ID NO:5 and SEQ ID NO:4",
                        "compare nucleic acid sequences of SEQ ID NO:7 and SEQ ID NO:6",
                        "compare amino acid sequences of SEQ ID NO:2 and SEQ ID NO:8",
                        "compare nucleic acid sequences of SEQ ID NO:9 and SEQ ID NO:10",
                        "outline expression cassette and vector",
                        "describe vaccine composition",
                        "outline methods of producing immune response",
                        "describe methods of producing replication competent recombinant Vesicular Stomatitis Virus",
                        "outline kits comprising replication competent recombinant Vesicular Stomatitis Virus",
                        "describe methods for identifying subjects infected with Crimean-Congo Hemorrhagic Fever virus",
                        "define terms used in the invention"
                    ],
                    "outline_short": [
                        "introduce recombinant vesicular stomatitis virus vectors",
                        "describe Crimean-Congo Hemorrhagic Fever glycoprotein precursor",
                        "outline replication competent and deficient vectors",
                        "detail codon optimization of nucleic acid segments",
                        "describe expression vectors and cassettes",
                        "outline vaccine compositions and methods of production",
                        "describe methods of inducing immune response",
                        "detail kits for producing replication competent vectors",
                        "outline methods for identifying subjects infected with CCHFV",
                        "define terms used in the invention",
                        "provide general statements about the invention"
                    ]
                },
                {
                    "title": "DESCRIPTION",
                    "paragraphs": [
                        "The following discussion is directed to various embodiments of the invention. The term “invention” is not intended to refer to any particular embodiment or otherwise limit the scope of the disclosure. Although one or more of these embodiments may be preferred, the embodiments disclosed should not be interpreted, or otherwise used, as limiting the scope of the disclosure, including the claims. In addition, one skilled in the art will understand that the following description has broad application, and the discussion of any embodiment is meant only to be exemplary of that embodiment, and not intended to intimate that the scope of the disclosure, including the claims, is limited to that embodiment.",
                        "The Crimean-Congo hemorrhagic fever (CCHF) virus is a member of the genus Nairovirus, family Bunyaviridae. The negative sense RNA genome is composed of three segments—Small (S), Middle (M) and Large (L). The L segment is 11-14.4 kilobases in length while the M and S segments are 4.4-6.3 and 1.7-2.1 kilobases long respectively. The L segment encodes the RNA polymerase; the M segment encodes the envelope proteins (GC and GN); and the S segment encodes the nucleocapsid protein. The envelope protein is initially translated as a glycoprotein precursor which is then cleaved into the mature structural glycoprotein products (GN and GC) and non-structural glycoproteins.",
                        "Crimean-Congo hemorrhagic fever virus (CCHFV) is a highly pathogenic zoonotic agent in the Orthonairovirus genus within Nairoviridae (1). The principal reservoirs for CCHFV are ixodid hard ticks primarily belonging to the genus Hyalomma (2). These ticks maintain the virus in nature by feeding on small mammals, ungulates, and birds within thirty countries across the Eastern hemisphere (3). Human infection can occur from the bite of an infected tick, exposure to infected animal products, or through nosocomial transmission (4). CCHFV case-fatality rates in most outbreaks range from 3-30%, though higher rates have been documented in some instances (3, 5). CCHFV is categorized as a Category A priority pathogen by the National Institutes of Health due to its associated morbidity and mortality, potential for public health/societal impact, as well as a lack of approved therapeutic options or US/EU licensed vaccines for treatment. The guanosine analogue ribavirin has been suggested as a therapeutic when given early in human infections; however, efficacy has not been clearly demonstrated in clinical trials for CCHF (6). For these reasons, vaccines and therapeutic countermeasures against CCHFV are currently under development.",
                        "Full or partial mature CCHFV particles contain single stranded, tri-partite, negative sense RNA genomes with small (S), medium (M), and large (L) segments, respectively encoding the structural nucleoprotein (NP), two envelope proteins (GN and GC) and the viral RNA-dependent-RNA-polymerase (RdRp) (3). The M-segment contains a 5.1 kilobase open-reading frame which codes for a glycoprotein precursor polypeptide (GPC) (7). Host cell processing, cleavage events, and post-translational modifications of this GPC yield the two mature structural glycoproteins GN and GC, along with several non-structural glycoproteins which aid in structural GN and GC maturation (7-12). The two glycoproteins are likely responsible for pertinent events in the viral replication cycle such as viral attachment, cell entry, tissue tropism(s), and induction of protective immune response as seen similarly with other members of Bunyavirales (13, 14). The latter has been demonstrated for CCHFV using monoclonal antibodies (MAb) directed against GN and GC, which have demonstrated in vitro neutralization in tissue culture and in vivo passive protection in suckling mice (13-15). These data suggest that the GPC would be an important antiviral target for therapeutic and vaccine efforts.",
                        "Currently, there are several experimental vaccine candidates that have relied on the GPC as an antigenic component, which have been evaluated in immunocompromised signal transducer and activator of transcription 1 knock-out (STAT-1−/−), interferon α/β receptor knock-out (IFNAR), or interferon receptor antibody transiently suppressed (IS) mouse models for CCHFV, as they recapitulate clinical illness and are uniformly lethal models for CCHF (16-20). Vaccine candidate approaches have focused on either DNA expression of CCHFV antigens in host tissues, replication deficient viral-like particles, inactivated whole virus preparations, subunit antigen preparations, or vectored vaccinia virus vaccines (16, 20-25). Two of these preparations, a prime and boost strategy using modified recombinant Vaccinia virus (strain: Ankara) [MVA] encoding the GPC, and a prime, boost, and boost strategy with a DNA based vaccine encoding separate NP, GN, and GC antigens, have provided promising results with up to 100% protection in the IFNARK/O animal model (23, 25). Although the NP by itself in the MVA platform has failed to provide protection (26).",
                        "Recombinant vesicular stomatitis viruses (rVSV) have been developed and evaluated as promising experimental vaccines for several pathogens, often requiring only a single-dose to induce protection (27-31). The rVSV platform has been experimentally evaluated for both durability and safety (32-34), and two rVSV vaccines, one for human immunodeficiency virus (HIV) (35) and a second for Zaire ebolavirus (EBOV), have been tested in human clinical trials (36-38). For these reasons, the inventors contemplate that rVSV vectors expressing CCHFV-GPC could elicit a protective response in a lethal animal model for CCHF. The aim of our study was to design, generate, characterize, and evaluate a rVSV vector encoding the CCHFV-GPC as an experimental vaccine for CCHFV."
                    ],
                    "subsections": [
                        {
                            "title": "I. RECOMBINANT VIRUS",
                            "paragraphs": [
                                "Vesicular Stomatitis Virus (VSV) is a non-segmented negative-stranded RNA virus and belongs to the family Rhabdoviridae, genus Vesiculovirus. Its simple structure and rapid high-titered growth in mammalian and many other cell types has made it a preferential tool for molecular and cell biologists in the past 30 years. This was even strengthened with the establishment of the reverse genetics system for VSV.",
                                "VSV encodes five proteins, nucleocapsid protein (N), phosphoprotein (P), matrix protein (M), surface glycoprotein (G), and RNA dependent RNA polymerase (L). The N, P, and L proteins of VSV are required for synthesis of positive sense and negative sense genomic RNAs and mRNA, which are necessary for the synthesis of VSV proteins.",
                                "In certain embodiments, a recombinant vesicular stomatitis virus (rVSV) can be a full length VSV or a VSV lacking all or part of a surface glycoprotein encoding region (ΔGrVSV) that includes heterologous nucleic acid segment that is capable of inducing an immune response in a subject by expression of an epitope of a CCHFV. The rVSV of the present invention may induce humoral, cellular, and/or mucosal immune responses.",
                                "The rVSVs of the present invention can be prepared using techniques known in the art and/or described herein. In one embodiment, the rVSVs may be introduced in a host cell under conditions suitable for the replication and expression of the rVSV in the host. Accordingly, the present invention also provides a cell having a rVSV that has been adapted to replicate in the cell without supplying VSV G protein in trans. As such, the present invention relates also to a cell having one or more of the recombinant VSVs described herein.",
                                "Embodiments include replication competent and replication deficient ΔGrVSV-CCHFV-GPC. In certain aspects, the replication competent ΔGrVSV-CCHFV-GPC contains 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, or 20 variant nucleotides at positions 104, 1615, 1626, 1627, 1725, 1726, 2233, 2647, 2919, 2926, 2989, 4182, 4633, 7994, 8024, 8092, 8134, 8143, 10311, 14322 of SEQ ID NO:1, wherein in an 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, or 19 variants can be specifically excluded. In a particular aspect, the variant is a A104G, T1615C, A1626C, G1627A, C1725A, A1726G, T2233C, A2647G, T2919C, A2926G, T2989C, T4182A, C4633G, T7994G, G8024A, A8092T, T8134C, G8143C, C10311G, and/or C14322T of SEQ ID NO:1, wherein in an 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, or 19 variants can be specifically excluded.",
                                "The A104 variant is located in the VSV Nucloprotein coding sequence position 40 and is typically an A to G. The variant can result in a VSV Nuceloprotein mutation 114V.",
                                "The T1615 variant is located in the VSV Phosphoprotein coding sequence at position 219 and is typically a T to C. The variant typically does not result in an amino acid change in the VSV Phosphoprotein at amino acid G72.",
                                "The A1626 variant is located in the VSV Phosphoprotein coding sequence at position 230 and is typically a A to C substitution. The variant typically results in a VSV Phosphoprotein with a Q77P mutation.",
                                "The G1627 variant is located in the VSV Phosphoprotein coding sequence at position 231 and is typically a G to A. The variant typically results in a VSV Phosphoprotein Q77P mutation.",
                                "The C1725 variant is located in the VSV Phosphoprotein coding sequence at position 329 and is typically a C to A. The variant typically results in a VSV Phosphoprotein with a P110Q mutation.",
                                "The A1726 variant is located in the VSV Phosphoprotein coding sequence at position 330 and is typically a A to G. The variant typically results in a VSV Phosphoprotein with a P110Q mutation.",
                                "The T2233 variant is located in the Intergenic region between VSV Phosphoprotein and Matrixprotein at position 39 and is typically a T to C.",
                                "The A2647 variant is located in the VSV Matrixprotein coding sequence at position 397 and is typically A to G. The variant typically results in a VSV Matrixprotein with a T133A mutation.",
                                "The T2919 variant is located in the VSV Matrixprotein coding sequence at position 669 and is typically T to C. The variant typically results in a VSV Matrixprotein that retains D223 amino acid residue.",
                                "The A2926 variant is located in the VSV Matrixprotein coding sequence at position 676 and is typically A to G. The variant typically results in a VSV Matrixprotein with a S226G mutation.",
                                "The T2989 variant is located in the intergenic region between VSV Matrixprotein and truncated CCHFV Glycoprotein precursor (GPC) at position 49 and is typically T to C.",
                                "The T4182 variant is located in the truncated CCHFV Glycoprotein precursor (GPC) coding sequence at position 1101 and is typically T to A. The variant typically results in a truncated CCHFV Glycoprotein precursor (GPC) in a S368T mutation.",
                                "The C4633 variant is located in the CCHFV Glycoprotein precursor (GPC) coding sequence at position 1552 and is typically C to G. The variant typically results in a truncated CCHFV Glycoprotein precursor (GPC) having a L518V mutation.",
                                "The T7994 variant is located in the CCHFV Glycoprotein precursor (GPC) coding sequence at position 4913 and is typically T to G. The variant typically results in a truncated CCHFV Glycoprotein precursor (GPC) having a L1638R mutation.",
                                "The G8024 variant is located in the CCHFV Glycoprotein precursor (GPC) coding sequence at position 4943 and is typically G to A. The variant typically results in a truncated CCHFV Glycoprotein precursor (GPC) having a R1648Q mutation.",
                                "The A8092 variant is located in the CCHFV Glycoprotein precursor (GPC) coding sequence at position 5,011 and is typically A to T, resulting in the truncation of CCHFV GPC. The variant typically results in a Truncated CCHFV Glycoprotein precursor (GPC) open reading frame at position 1671 where an Arginine (Arg [R]) is mutated to a STOP Codon.",
                                "The T8134 variant is located in the newly created intergenic region between truncated CCHFV Glycoprotein precursor (GPC) and VSV Polymerase at position 40 and is typically T to C.",
                                "The G8143 variant is located in the newly created intergenic region between truncated CCHFV Glycoprotein precursor (GPC) and VSV Polymerase at position 49 and is typically G to C.",
                                "The C10311 variant is located in the VSV Polymerase coding sequence at position 2066 and is typically C to G. The variant typically results in a VSV Polymerase having a T689S mutation.",
                                "The C14322 variant is located in the VSV Polymerase coding sequence at position 6077 and is typically C to T. The variant typically results in a VSV Polymerase having a T20261 mutation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce VSV",
                                "describe VSV structure",
                                "explain VSV replication",
                                "introduce rVSV",
                                "describe rVSV preparation",
                                "introduce ΔGrVSV-CCHFV-GPC",
                                "describe replication competent ΔGrVSV-CCHFV-GPC",
                                "describe replication deficient ΔGrVSV-CCHFV-GPC",
                                "list variant nucleotides",
                                "describe A104 variant",
                                "describe T1615 variant",
                                "describe A1626 variant",
                                "describe additional variants"
                            ],
                            "num_characters": 6649,
                            "outline_medium": [
                                "introduce VSV and its characteristics",
                                "describe VSV proteins and their functions",
                                "introduce rVSV and its potential as a vaccine",
                                "describe preparation of rVSV using techniques known in the art",
                                "list embodiments of rVSV with variant nucleotides",
                                "describe specific variants and their effects on VSV proteins"
                            ],
                            "outline_short": [
                                "describe VSV and its structure",
                                "introduce rVSV and its potential as a vaccine",
                                "detail specific embodiments of rVSV-CCHFV-GPC"
                            ]
                        },
                        {
                            "title": "II. VACCINES OR IMMUNOGENIC COMPOSITIONS",
                            "paragraphs": [
                                "Certain embodiments are directed to vaccines or immunogenic compositions comprising one or more of the rVSVs described herein. In one embodiment, the present invention features vaccines or immunogenic compositions comprising a rVSV-CCHFV-GPC and vaccines or immunogenic compositions comprising a rVSV-CCHFV-GP, as described herein.",
                                "The nucleotide sequences and/or antigens can be administered in vivo, for example where the aim is to produce an immunogenic response in a subject. A “subject” in the context of the present invention may be any animal. For example, in some embodiments it may be desired to express the transgenes of the invention in a laboratory animal, such as for pre-clinical testing of the immunogenic compositions and vaccines. In other embodiments, it will be desirable to express the antigens in human subjects, such as in clinical trials and for actual clinical use of the immunogenic compositions and vaccine of the invention. In preferred embodiments the subject is a human, for example a human that is infected with, or is at risk of infection with, CCHFV.",
                                "For such in vivo applications the nucleotide sequences and/or antigens can be administered as a component of an immunogenic composition which may comprise the nucleotide sequences and/or antigens in admixture with a pharmaceutically acceptable carrier. The immunogenic compositions of the invention are useful to stimulate an immune response against CCHFV and may be used as one or more components of a prophylactic or therapeutic vaccine against CCHFV for the prevention, amelioration or treatment of CCHF. The nucleic acids and vectors can be particularly useful for providing genetic vaccines, i.e., vaccines for delivering the nucleic acids encoding the antigens to a subject, such as a human, such that the antigens are then expressed in the subject to elicit an immune response.",
                                "The compositions of the invention may be injectable suspensions, solutions, sprays, lyophilized powders, syrups, elixirs and the like. Any suitable form of composition may be used. To prepare such a composition, a nucleic acid or vector having the desired degree of purity is mixed with one or more pharmaceutically acceptable carriers and/or excipients. The carriers and excipients must be “acceptable” in the sense of being compatible with the other ingredients of the composition. Acceptable carriers, excipients, or stabilizers are nontoxic to recipients at the dosages and concentrations employed, and include, but are not limited to, water, saline, phosphate buffered saline, dextrose, glycerol, ethanol, or combinations thereof, buffers such as phosphate, citrate, and other organic acids; antioxidants including ascorbic acid and methionine; preservatives (such as octadecyldimethylbenzyl ammonium chloride; hexamethonium chloride; benzalkonium chloride, benzethonium chloride; phenol, butyl or benzyl alcohol; alkyl parabens such as methyl or propyl paraben; catechol; resorcinol; cyclohexanol; 3-pentanol; and m-cresol); low molecular weight (less than about 10 residues) polypeptide; proteins, such as serum albumin, gelatin, or immunoglobulins; hydrophilic polymers such as polyvinylpyrrolidone; amino acids such as glycine, glutamine, asparagine, histidine, arginine, or lysine; monosaccharides, disaccharides, and other carbohydrates including glucose, mannose, or dextrins; chelating agents such as EDTA; sugars such as sucrose, mannitol, trehalose or sorbitol; salt-forming counter-ions such as sodium; metal complexes (e.g., Zn-protein complexes); and/or non-ionic surfactants such as TWEEN™, PLURONICS™ or polyethylene glycol (PEG). The immunogenic compositions may contain additional substances, such as wetting or emulsifying agents, buffering agents, or adjuvants to enhance the effectiveness of the vaccines (Remington's Pharmaceutical Sciences, 18th edition, Mack Publishing Company, (ed.) 1980).",
                                "Adjuvants may also be included. Adjuvants include, but are not limited to, mineral salts (e.g., AlK(SO4)2, AlNa(SO4)2, AlNH(SO4)2, silica, alum, Al(OH)3, Ca3(PO4)2, kaolin, or carbon), polynucleotides with or without immune stimulating complexes (ISCOMs) (e.g., CpG oligonucleotides, poly IC or poly AU acids, polyarginine with or without CpG (also known in the art as IC31), JuvaVax™, certain natural substances (e.g., wax D from Mycobacterium tuberculosis, substances found in Cornyebacterium parvum, Bordetella pertussis, or members of the genus Brucella), flagellin (Toll-like receptor 5 ligand, saponins such as QS21, QS17, and QS7, monophosphoryl lipid A, in particular, 3-de-O-acylated monophosphoryl lipid A (3D-MPL), imiquimod (also known in the art as IQM and commercially available as Aldara®; and the CCR5 inhibitor CMPD167.",
                                "The immunogenic compositions may be designed to introduce the nucleic acids or expression vectors to a desired site of action and release it at an appropriate and controllable rate. Methods of preparing controlled-release formulations are known in the art. For example, controlled release preparations may be produced by the use of polymers to complex or absorb the immunogen and/or immunogenic composition. A controlled-release formulations may be prepared using appropriate macromolecules (for example, polyesters, polyamino acids, polyvinyl, pyrrolidone, ethylenevinylacetate, methylcellulose, carboxymethylcellulose, or protamine sulfate) known to provide the desired controlled release characteristics or release profile. Another possible method to control the duration of action by a controlled-release preparation is to incorporate the active ingredients into particles of a polymeric material such as, for example, polyesters, polyamino acids, hydrogels, polylactic acid, polyglycolic acid, copolymers of these acids, or ethylene vinylacetate copolymers. Alternatively, instead of incorporating these active ingredients into polymeric particles, it is possible to entrap these materials into microcapsules prepared, for example, by coacervation techniques or by interfacial polymerization, for example, hydroxymethylcellulose or gelatin-microcapsule and poly-(methylmethacrylate) microcapsule, respectively, in colloidal drug delivery systems (for example, liposomes, albumin microspheres, microemulsions, nano-particles and nanocapsules) or in macroemulsions. Such techniques are disclosed in New Trends and Developments in Vaccines, Voller et al. (eds.), University Park Press, Baltimore, Md., 1978 and Remington's Pharmaceutical Sciences, 16th edition.",
                                "Suitable dosages of the nucleic acids and expression vectors of the invention (collectively, the immunogens) in the immunogenic composition of the invention may be readily determined by those of skill in the art. For example, the dosage of the immunogens may vary depending on the route of administration and the size of the subject. Suitable doses may be determined by those of skill in the art, for example by measuring the immune response of a subject, such as a laboratory animal, using conventional immunological techniques, and adjusting the dosages as appropriate. Such techniques for measuring the immune response of the subject include but are not limited to, chromium release assays, tetramer binding assays, IFN-γ ELISPOT assays, IL-2 ELISPOT assays, intracellular cytokine assays, and other immunological detection assays, e.g., as detailed in the text “Antibodies: A Laboratory Manual” by Ed Harlow and David Lane.",
                                "When provided prophylactically, the immunogenic compositions of the invention are ideally administered to a subject in advance of infection, or evidence of infection, or in advance of any symptom due to CCHF, especially in high-risk subjects. The prophylactic administration of the immunogenic compositions may serve to provide protective immunity of a subject against CCHFV infection or to prevent or attenuate the progression of CCHF in a subject already infected with CCHFV. When provided therapeutically, the immunogenic compositions may serve to ameliorate and treat CCHF symptoms and are advantageously used as soon after infection as possible, preferably before appearance of any symptoms of CCHF but may also be used at (or after) the onset of the disease symptoms.",
                                "The immunogenic compositions may be administered using any suitable delivery method including, but not limited to, intramuscular, intravenous, intradermal, mucosal, and topical delivery. Such techniques are well known to those of skill in the art. More specific examples of delivery methods are intramuscular injection, intradermal injection, and subcutaneous injection. However, delivery need not be limited to injection methods. Further, delivery of DNA to animal tissue has been achieved by cationic liposomes, direct injection of naked DNA into animal muscle tissue, or intradermal injection of DNA using “gene gun” technology. Alternatively, delivery routes may be oral, intranasal or by any other suitable route. Delivery may also be accomplished via a mucosal surface such as the anal, vaginal or oral mucosa. Immunization schedules (or regimens) are well known for animals (including humans) and may be readily determined for the particular subject and immunogenic composition. Hence, the immunogens may be administered one or more times to the subject. Preferably, there is a set time interval between separate administrations of the immunogenic composition. While this interval varies for every subject, typically it ranges from 10 days to several weeks, and is often 2, 4, 6 or 8 weeks. For humans, the interval is typically from 2 to 6 weeks. The immunization regimes typically have from 1 to 6 administrations of the immunogenic composition, but may have as few as one or two or four. The methods of inducing an immune response may also include administration of an adjuvant with the immunogens. In some instances, annual, biannual or other long interval (5-10 years) booster immunization may supplement the initial immunization protocol.",
                                "Methods may also include a variety of prime-boost regimens, for example DNA prime-boost regimens. In these methods, one or more priming immunizations are followed by one or more boosting immunizations. The actual immunogenic composition may be the same or different for each immunization and the type of immunogenic composition (e.g., containing protein or expression vector), the route, and formulation of the immunogens may also be varied. For example, if an expression vector is used for the priming and boosting steps, it may either be of the same or different type (e.g., DNA or bacterial or viral expression vector). One useful prime-boost regimen provides for two priming immunizations, four weeks apart, followed by two boosting immunizations at 4 and 8 weeks after the last priming immunization. It should also be readily apparent to one of skill in the art that there are several permutations and combinations that are encompassed using the DNA, bacterial and viral expression vectors to provide priming and boosting regimens.",
                                "A specific embodiment of the invention provides methods of inducing an immune response against CCHFV in a subject by administering an immunogenic composition described herein, preferably which may comprise a vector containing DNA encoding one or more of the epitopes of the invention, one or more times to a subject wherein the epitopes are expressed at a level sufficient to induce a specific immune response in the subject. Such immunizations may be repeated multiple times at time intervals of at least 2, 4 or 6 weeks (or more) in accordance with a desired immunization regime.",
                                "The immunogenic compositions of the invention may be administered alone, or may be co-administered, or sequentially administered, with other CCHFV immunogens and/or CCHFV immunogenic compositions, e.g., with “other” immunological, antigenic or vaccine or therapeutic compositions thereby providing multivalent or “cocktail” or combination compositions of the invention and methods of employing them. Again, the ingredients and manner (sequential or co-administration) of administration, as well as dosages may be determined taking into consideration such factors as the age, sex, weight, species and condition of the particular subject, and the route of administration.",
                                "When used in combination, the other CCHFV immunogens may be administered at the same time or at different times as part of an overall immunization regime, e.g., as part of a prime-boost regimen or other immunization protocol.",
                                "It is to be understood and expected that variations in the principles of invention as described above may be made by one skilled in the art and it is intended that such modifications, changes, and substitutions are to be included within the scope of the present invention. The dose of the vaccine may vary according to factors such as the disease state, age, sex, and weight of the individual, and the ability of antibody to elicit a desired response in the individual. Dosage regime may be adjusted to provide the optimum therapeutic response. The dose of the vaccine may also be varied to provide optimum preventative dose response depending upon the circumstances."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce vaccines or immunogenic compositions",
                                "describe rVSV-CCHFV-GPC and rVSV-CCHFV-GP",
                                "administer nucleotide sequences and/or antigens in vivo",
                                "define subject",
                                "express transgenes in laboratory animal",
                                "express transgenes in human subjects",
                                "describe immunogenic composition",
                                "summarize nucleotide sequences and/or antigens",
                                "describe genetic vaccines",
                                "list composition forms",
                                "prepare composition",
                                "list carriers and excipients",
                                "describe adjuvants",
                                "list adjuvant examples",
                                "describe controlled-release formulations",
                                "prepare controlled-release formulations",
                                "describe dosage determination",
                                "measure immune response",
                                "administer prophylactically",
                                "administer therapeutically",
                                "describe delivery methods",
                                "describe immunization schedules",
                                "describe prime-boost regimens",
                                "describe DNA prime-boost regimens",
                                "co-administer with other immunogens",
                                "describe kit components"
                            ],
                            "num_characters": 13138,
                            "outline_medium": [
                                "introduce vaccines or immunogenic compositions",
                                "describe rVSV-CCHFV-GPC and rVSV-CCHFV-GP",
                                "administer nucleotide sequences and/or antigens in vivo",
                                "define subject and preferred embodiments",
                                "describe immunogenic compositions and vaccines",
                                "list composition forms and preparation methods",
                                "discuss adjuvants and their uses",
                                "describe controlled-release formulations and methods",
                                "determine suitable dosages and administration routes",
                                "discuss prophylactic and therapeutic administration",
                                "describe delivery methods and immunization schedules",
                                "outline prime-boost regimens and variations",
                                "discuss co-administration and combination compositions"
                            ],
                            "outline_short": [
                                "describe vaccine composition",
                                "administer nucleotide sequences and/or antigens",
                                "formulate immunogenic composition",
                                "add adjuvants to enhance effectiveness",
                                "design controlled-release formulations",
                                "determine suitable dosages and administration routes"
                            ]
                        },
                        {
                            "title": "III. KITS",
                            "paragraphs": [
                                "Certain embodiments are directed to for example for preventing or treating an infection. For example, a kit may comprise one or more pharmaceutical compositions or vaccines as described above and optionally instructions for their use. In still other embodiments, the invention provides kits comprising one or more pharmaceutical compositions or vaccines and one or more devices for accomplishing administration of such compositions.",
                                "Kit components may be packaged for either manual or partially or wholly automated practice of the methods described herein. In other embodiments involving kits, it is contemplated that a kit includes compositions described herein, and optionally instructions for their use. Such kits may have a variety of uses, including, for example, imaging, diagnosis, therapy, and other applications."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe kit components"
                            ],
                            "num_characters": 822,
                            "outline_medium": [
                                "describe kit components and uses"
                            ],
                            "outline_short": [
                                "provide kits for preventing or treating infection"
                            ]
                        },
                        {
                            "title": "IV. EXAMPLES",
                            "paragraphs": [
                                "The following examples as well as the figures are included to demonstrate preferred embodiments of the invention. It should be appreciated by those of skill in the art that the techniques disclosed in the examples or figures represent techniques discovered by the inventors to function well in the practice of the invention, and thus can be considered to constitute preferred modes for its practice. However, those of skill in the art should, in light of the present disclosure, appreciate that many changes can be made in the specific embodiments which are disclosed and still obtain a like or similar result without departing from the spirit and scope of the invention.",
                                "**Example 1**",
                                "**Replication Competent Vesicular Stomatitis Vector Protects Against Lethal Crimean-Congo Hemorrhagic Fever Infection in Mice**",
                                "A. Results",
                                "To ensure robust expression of the CCHFV-GPC antigen, the inventors chose to use a codon optimized CCHFV-GPC (strain: IbAr10200) containing plasmid and subsequently examined expression of CCHFV-GPC, in human liver cells transiently expressing the codon optimized CCHFV-GPC from a pCAGGs plasmid. Interestingly, immunofluorescence staining of CCHFV-GC on un-permeabilized, plasma membrane stained cells, demonstrated cell surface staining of transfected cells (Supplemental FIG. 1). These initial data, suggested over-expression under a strong promoter (such as the chicken actin promoter), as well as codon optimization, could uncharacteristically localize CCHFV-GP to the plasma membrane instead of the Golgi (14, 39) where VSV could acquire the GP when budding from the cell surface (40).",
                                "Encouraged by these over-expression results using the codon optimized CCHFV-GPC; the inventors cloned and recovered ΔGrVSV-CCHFV-GPC. Our initial attempts using the DNA clone recovery system designed by Lawson et al., failed to produce infectious ΔGrVSV-CCHFV-GPC (FIG. 1A) (41). To overcome this hurdle, the inventors used a modification based on a system described by Whitt (42) relying on in trans VSV glycoprotein (G) complementation (VSV-G*) of ΔGrVSV virions. This technique allowed for VSV-G, incorporation into recoveries to facilitate efficient assembly of the VSVΔG-CCHFV-GPC genome without the need for CCHFV-GPC to participate in initial infection of recovered virions (FIG. 1A). Thus, the inventors recovered a virion containing the CCHFV-GPC in the genome with VSV-G complementation (VSV-G*-ΔGrVSV-CCHFV-GPC) contributing to a single-cycle infection; unless VSV-G is provided in trans this virus will not replicate effectively in cell culture.",
                                "After the initial recovery of VSV-G*-ΔGrVSV-CCHFV-GPC, this virus was passaged multiple times on VSV-G complemented BHK cells and simultaneously passaged onto un-complemented (‘normal’) BHK cells. the inventors were unable to isolate infectious virus from initial supernatants however, seven total serial passages of supernatants on un-complemented BHK cells resulted in eventual cytopathic effect (CPE) in cell culture with plaque formations on the monolayers (FIG. 1B). These monolayers with CPE were harvested for RNA and stained for CCHFV-GC antigen via immunofluorescence assay. Sanger sequencing of both constructs, using primers for the CCHFV-GPC ORF, was carried out which revealed several single nucleotide polymorphisms (data not shown). Next generation sequencing (NGS) was then performed to confirm Sanger results and further detail the signal nucleotide polymorphisms within the entire genomes of both constructs (Supplemental Table 1). NGS sequencing demonstrated fourteen identical single nucleotide polymorphisms (SNP) preserved between the replication deficient and replication competent constructs; with the replication competent construct possessing four additional non-synonymous mutations within the CCHFV-GPC (FIG. 1B, Supplemental Table 1). Two of these mutations within the CCHFV-GPC of the replication competent construct, resulted in the truncation of fourteen amino acids off the C-terminal tail of the GC (FIG. 1B).",
                                "To assess the growth kinetics of the rVSV vectors compared to authentic CCHFV, the inventors performed single-cycle growth curve analysis on BHK cells infected with respective viruses at various time intervals up to 96 hrs post infection (hpi) or full monolayer destruction. The rVSV-GFP (wild-type control) peaked in titer at approximately 24 hpi, while CCHFV prototype-strain: IbAr10200 peaked at 48 hpi (FIG. 2A). Using VSV-G* complemented BHK cells, enabled replication, spreading, and formation of plaques for VSV-G*-ΔGrVSV-CCHFV-GPC, permitting growth kinetics assays and subsequent titrations. VSV-G*-ΔGrVSV-CCHFV-GPC replicated to highest titer around similar peak times for wild-type VSV titers, 16 hpi (FIG. 2A). Both ΔGrVSV-ΔCCHFV-GPC and CCHFV had peak titer, at approximately 36 hpi (FIG. 2A).",
                                "To assess the expression of the CCHFV-GPC in the ΔGrVSV-CCHFV-GPC vector, the inventors infected SW-13-CDC or BHK cells and performed immunofluorescence microscopy, using an antibody that binds to CCHFV-Gc, which revealed strong in vitro expression of CCHFV-GC antigen (FIG. 2B). The inventors additionally examined if CCHFV-GC was incorporated onto gradient purified rVSV virions, VSV-G*-ΔGrVSV-CCHFV-GPC and ΔGrVSV-ΔCCHFV-GPC, and semi-purified virions of both rVSV-GFP and CCHFV (as controls), by Coomassie staining and western blot analysis. Through Coomassie staining, differences in number and mobility of protein bands were detected among VSV-G*-ΔGrVSV-CCHFV-GPC and ΔGrVSV-ΔCCHFV-GPC. The two CCHFV-GPC recombinants both had additional protein bands below 20 kDa with analogous bands detected in CCHFV virion pellets (FIG. 2C, Lanes 2, 3, and 4). Both CCHFV-GPC recombinants also possessed more pronounced protein bands around 60 kDa, compared to our wt rVSV-GFP (FIG. 2C). CCHFV structural glycoproteins GN and GC present as bands of approximately at 37 kDa and 75 kDa, respectively, on SDS-PAGE gels. There was no observable GN band found on either CCHFV-GPC recombinant at 37 kDa, however, there were two distinct bands between 60-80 kDa in both recombinants (FIGS. 2C-2, -3). The VSV-G*-ΔGrVSV-CCHFV-GPC was expected to possess a VSV-G as one of these bands. The ΔGrVSV-ΔCCHFV-GPC did not encode for a VSV-G, nor would it be complemented with VSV-G after seven rounds of BHK passaging. A duplicate run protein gel was run and further probed by western blotting using a monoclonal antibody previously identified to be specific for CCHFV GC by western blot (Mab 11E7, BEI Resources) (14). These western blot data demonstrated limited, non-specific binding to three VSV proteins as observed in lanes rVSV-GFP and VSV-G*-ΔGrVSV-CCHFV-GPC (FIG. 2D, Lanes 1 and 2), but showed strong signal to at least two antigens at approximately 75 kDa and 150 kDa for ΔGrVSV-ΔCCHFV-GPC (FIG. 2D-3). Indicating that mature CCHFV-GC and potentially a precursor molecule or an oligomeric form of CCHFV-GC (due to the lack of β-mercaptoethanol in antigen preparations), are incorporated in/on ΔGrVSV-ΔCCHFV-GPC virions. The semi-purified CCHFV also showed limited non-specific binding to antigens at 57 kDa (CCHFV-NP) and 37 kDa (CCHFV-GN), but distinct signal at 75 kDa (CCHFV-GC) (FIG. 2D, Lane 4).",
                                "To examine the ultrastructure of the replication competent recombinant, ΔGrVSV-ΔCCHFV-GPC, transmission electron microscopy studies were conducted. Consistent with other rVSV pseudotyped with bunyavirus GP (28), our rVSV maintained rhabdovirus morphology and classical bullet shape with coiled intra-virion structure (FIG. 2E). Particles of ΔGrVSV-ΔCCHFV-GPC and VSV-G*-ΔGrVSV-CCHFV-GPC were observed to have lengths of particles ranging between 210-260 nm (FIG. 2E, Images 1 and 2). Particles of rVSV-GFP (‘wild-type’ VSV electron microscopy control) were observed between 170-200 nm (FIG. 2E, Image 3). This apparent length increase of the ΔGrVSV-ΔCCHFV-GPC and VSV-G*-ΔGrVSV-CCHFV-GPC is likely due to the genome containing approximately 4,000 extra nucleotides in comparison to the rVSV-GFP genome (which is also slightly larger than native wild-type VSV Indiana [GenBank number NC_001560.1]). Additionally, immunolabeling of ΔGrVSV-ΔCCHFV-GPC was employed with either CCHFV-GC MAb 11E7, 12A9, or 8A1 and counterstained with 15 nm gold conjugated secondary MAb (FIG. 2E, Image 1). Immunolabeling demonstrated labeling of GC spikes on the virion surface of ΔGrVSV-ΔCCHFV-GPC (FIG. 2E, Image 1).",
                                "With the data supporting that the replication deficient construct expressed CCHFV-GP in vitro and the replication competent construct additionally expressed CCHFV-GC on the surface of the virion, an in vivo study was designed to test the ability of either construct to function as an experimental vaccine. The STAT-1−/− mouse model for CCHFV was selected to test these constructs for safety and protective efficacy. A pilot study was designed to test a range of conditions, doses, and boosting response (FIG. 3A) as it was unclear whether the rVSV expressing CCHFV-GPC would be tolerated in the STAT-1−/− model. Similar rVSV vectors encoding Ebola and Marburg hemorrhagic fever virus GP, have resulted in lethal outcomes following vaccination of STAT-1−/− mice (43). Three groups of five mice were vaccinated with a prime dose of 106 pfu of the replication deficient VSV-G*-ΔGrVSV-CCHFV-GPC construct. One of these groups was boosted at two weeks post prime with a 106 pfu of the replication competent ΔGrVSV-ΔCCHFV-GPC. To avoid a limiting anamnestic response in the boosted replication deficient vaccinations, a VSV complemented with a different serogroup VSV-G (Indiana and New Jersey) between prime and boosting was also used, as previous studies have suggested immune responses can vary between serogroup VSV-G (44). This group was boosted with a 106 pfu dose of VSV-GNJ*-ΔGrVSV-CCHFV-GPC, where the in trans complemented VSV-G on the boosting was from the New Jersey VSV serogroup in comparison to prime (prime: Indiana, boost: New Jersey). Two additional groups were primed with the replication competent construct at a ‘low’ (102 pfu) and ‘high’ (106 pfu) dose of ΔGrVSV-ΔCCHFV-GPC. A final group of five STAT-1−/− mice in the pilot experiment was administered PBS for mock control purposes.",
                                "Mice were observed daily for 35 days for clinical signs, weights, and temperatures. All mice survived vaccination of prime and boost regimens, with no attributed fever, and approximately 5% weight loss observed in three of the five mice in the 106 pfu replication competent group across two days (FIGS. 3C, 3D). All mice were challenged with 100 pfu of CCHFV strain IbAr10200 at 35 d post prime and monitored for weight and temperatures. Time-to-death for the animals occurred between 3-5 days post challenge for all groups. The 106 pfu high dose of replication competent ΔGrVSV-ΔCCHFV-GPC had 40% observed survival while all other groups succumbed to CCHF (FIG. 3B).",
                                "A second experiment was designed to increase the prime only dose and incorporate a boost of only the replication competent virus (FIG. 4), as this was the sole construct to offer protection (40%) against the lethal challenge outlined from the first in vivo experiment shown in FIGS. 3A and 3B. For these experiments, the inventors challenged with a clinical strain, Turkey200406546, designated throughout this work as Turkey2004; which has previously been published in GenBank with the accession numbers KY362517 (S-segment), KY362519 (M-segment), and KY362515 (L-segment) (45). the inventors conducted NGS on our Turkey2004 isolate and found the genomes were highly similar to what had been published by Spengler et al (45). Our deep sequencing revealed four nonsynonymous mutations compared to aforementioned published sequences (S-segment: R68A, M-segment: R709A and A4039G, L-segment: A2804G). As our rVSV constructs were designed from a codon optimized GPC from the IbAr10200 strain, the inventors examined the GPC genomic alignments between the vaccination strain and challenge strain to assess the residue conservation among antigenic regions of the GPC between the IbAr10200 and Turkey2004 isolate.",
                                "Genomic alignments of all published (and complete) CCHFV-GPCs demonstrate 44.0% amino acid identity observed between all strains GPCs (Supplemental FIG. 2A). Despite Turkey2004 and IbAr10200 being from separate M-segment clades, lade V and III respectively, the genomic alignment demonstrates 84.4% identify between the GPCs of Turkey2004 and IbAr10200 (Supplemental FIG. 2B and Supplemental Table 2). Much of this variability is attributed to the non-structural components of the GP (Supplemental FIG. 2B). Further analysis revealed that the antigenic regions to be examined for countermeasure developments are largely the ectodomains of the structural GN and GC regions. These regions alone are conserved between the two isolates with 91.8% and 95.2% identity, respectively (Supplemental Table 2).",
                                "Informed by the genetic alignment and conserved residue data between strains, the inventors proceeded to vaccinate two groups of five STAT-1−/− mice with the replication competent ΔGrVSV-ΔCCHFV-GPC construct at an increased dose of 107 pfu and boosted one of these groups with the same construct and dose at 14 days post prime (FIG. 4). As a control, the inventors again used PBS as a mock vaccination. A single mouse succumbed in the boosted group (leaving only four mice to be challenged in the boosted group) the day of boosting. At 35 days post prime, all mice were challenged with 50 pfu of CCHFV strain Turkey2004 and were monitored for clinical signs, weights, and temperatures. For this CCHFV strain, the observed time-to-death was between five and six days post infection (dpi), as demonstrated with the PBS control group (FIG. 5A). For both prime and boosted groups, 100% protection was observed out to 35 dpi (FIG. 5A). All three groups displayed elevated temperatures for the first three days post challenge (FIG. 5B). The prime and PBS group displayed weight loss, while the boosted group did not (FIG. 5C). These results indicate that the primed group displayed a marked illness, while the boosted group displayed a milder form of illness post-challenge.",
                                "To examine the humoral response in mice, all groups were bled at study end points and sera were analyzed on an IgG ELISA for CCHFV-GP. Circulating IgGs to CCHFV-GP were detected in sera of both vaccinated groups (FIG. 6A). An adjusted optical density (OD) was reported for all tested sera to account for IgG response to VSV antigens. Curiously, the prime group displayed higher OD values (mean 1.25 OD) compared to the prime plus boosted group (mean 0.55 OD) (FIG. 6A). This indicates the prime only group had a higher concentration of IgG at the study endpoint which recognized CCHFV-GP, compared to the boosted group. The OD of the PBS group had negligible IgG responses to CCHFV-GP, with a mean value of <0.1 OD (FIG. 6A). To determine the neutralizing capacity of these sera, a plaque reduction neutralization test (PRNT) was carried out using the Turkey2004 challenge isolate. As depicted in FIG. 6B, the prime only group had neutralizing antibody titers with a PRNT50 of <1:1,280 and the boosted group a PRNT50 of <1:320 at the study endpoint (FIG. 6B). Our PRNT positive control, hyper-immune mouse ascitic fluid (HMAF) raised against CCHFV exposed mice, showed a PRNT50 of <1:160 while the PBS control mice did not demonstrate a PRNT50 value (FIG. 6B).",
                                "Additionally, at study endpoints for each cohort, the inventors examined tissues by immunohistochemistry (IHC) for CCHFV-NP antigen. The control cohort had marked CCHFV-NP immunolabeling in hepatocytes within the liver sections while liver sections from the prime only and boosted cohorts had no observable CCHFV-NP immunolabeling. The inventors further examined the spleen tissue sections and observed that the control cohort had marked CCHFV immunolabeling in mononuclear cells, and that the prime cohort had a cytoplasmic, mild, and diffuse immunolabeling of mononuclear cells primarily in the red pulp. The boosted cohort had no specific CCHFV immunolabeling within the spleen sections.",
                                "Studies have had varied success expressing CCHFV-GPC in trans on viral vectors (46, 47). rVSV with CCHFV-GPC has likely been challenging due to the numerous post-translational modifications required to mature, and provide functional, CCHFV-GPC (7, 8, 10, 12). Additionally, CCHFV-GPC form immature CCHFV particles at the Golgi and egress via vesicular transport (14, 39). Unlike CCHFV, VSV buds from the plasma membrane (40), which hampers efforts to recover a ΔGrVSV CCHFV-GPC vector. To approach this issue, the inventors used a mammalian codon optimized CCHFV-GPC (strain: IbAr10200). This platform has been observed to provided robust CCHFV GPC production in mammalian tissue culture (20), while maintaining native CCHFV maturation factors. The inventors hypothesized that higher expression due to codon optimization, could potentially result in shuttling of CCHFV-GP to the plasma membrane, where VSV could acquire and bud with functional components of the GPC in the viral envelope. Though, the inventors were able to drive strong expression CCHFV-GPC in vitro, the inventors were unable to generate a replication competent pseudotype without VSV-G* in trans. There have been multiple studies that have examined pseudotyping rVSV with a CCHFV-GPC using a plasmid encoding a VSVΔG backbone. A luciferase reporter pseudotype with in trans expression of the CCHFV-GPC was developed in 293T cells by Shtanko et al. (47). Suda et al., also did similar pseudotyping with in trans expression in 293T cells with various full length GPC and modified GPC constructs containing truncated GC C-terminal/endodomain tails (46). These pseudotypes also had a luciferase or GFP ORFS genomically encoded in the VSVΔG backbone (46). Both published pseudotyping CCHFV-GP*-ΔGrVSV systems had demonstrated functionality in examining neutralization and entry/infection studies, however, these constructs were not fully characterized by western blot or immune electron microscopy with respect to what was on the exterior of the pseudotypes; nor were either constructs self-replicating or capable of further expressing CCHFV-GP post infection (46, 47).",
                                "With the tools currently available for our analysis, the inventors were able to detect by western blotting and electron microscopy, a form of CCHFV-GC that was present and functional on the surface of the ΔGrVSV-ΔCCHFV-GPC virion. Immunolabeled electron micrographs demonstrated that CCHFV-GC was incorporated on the surface of the virion. While the inventors were able to immunolabel for CCHFV-Gc, PAGE and Coomassie staining analysis of our purified virion lysates, did not reveal prominent protein bands at the 37 kDa position, the estimated size of mature GN. However, the inventors did have three smaller protein bands in our VSV-G*-ΔGrVSV-CCHFV-GPC and ΔGrVSV-ΔCCHFV-GPC preparations. Similar protein profiles have been shown in other CCHFV preparations, as shown by Buttigieg et al., 2014. Though, it is possible that these protein bands may also correspond to VSV-M2 and -M3 by alternative initiation at downstream start codons present in the ORF of VSV-M (48). While not the focus of this current study, these observations warrant further characterization if this vector is to be used as a tool to further study CCHFV-GPC mechanisms.",
                                "Suda et al., have shown an increase in the amount of infectious pseudotype the more the GC tail is truncated, up to a deletion of 53 residues at the end of the C-terminal GC tail (46). Our data supports this region as a probable, or at the very least, contributory mechanism which enables the replication competent ΔGrVSV-ΔCCHFV-GPC pseudotype formation (FIG. 1B). There is likely a localization or retention signal within the transmembrane region or endodomain tail which is aberrated and fails to shuttle GC to solely the intracellular compartments and this perhaps allows shuttling to the plasma membrane. Once again this is not the focus of this study, though it will be examined in the future. It is interesting to note, that a similar motif has been demonstrated by other bunyaviruses (49, 50) and has also been demonstrated with other VSV pseudotypes (51). Structural GC alone has been examined to have putative receptor binding, a class II viral fusion domain, soluble/shed oligomeric forms of sGC, a characterized neutralization domain, and human linear B-cell epitope sites (7, 10, 13, 52-54). Our replication competent rVSV vector can enable exploration of these components at lower containment (BSL-2), without the need for transfections for in trans expression of CCHFV-GPC onto VSVΔG systems.",
                                "When exploring the use of rVSV expressing CCHFV-GP as potential vaccines, there was a concern of murine virulence, which has been observed for wild-type VSV (55, 56). Studies with rVSV expressing hemorrhagic fever virus GP have also demonstrated lethal outcomes in the STAT-1−/− model (43). This has hampered the STAT-1−/− animal platform from serving as a vaccine development tool, as ‘vaccinated’ mice succumb to a prime dosing (43). Because of this information, in our studies (FIG. 3A) the inventors tested three doses at 107, 106 and 102 pfu, for our replication competent ΔGrVSV-ΔCCHFV-GPC construct and selected a traditional 106 pfu dose for our replication deficient VSV-G*-ΔGrVSV-CCHFV-GPC construct. Demonstrating the safety profile of both constructs, no group had any attributed fatality due to the vaccines.",
                                "In pilot studies (FIG. 3A) the time-to-death for challenged mice, ranged between 3-5 dpi (FIG. 3B). The inventors hypothesized that time-to-death was occurring too rapidly in our model due to our challenge virus, CCHFV isolate IbAr10200, and may be overwhelming the immune response too quickly. The IbAr10200 strain has been widely used as the prototype strain for CCHFV research, despite it being passaged substantially in mice and without any record of human disease. The IbAr10200 strain used in this study has a documented history of thirteen passages in suckling mice, plus several passages in Vero and SW-13-CDC cell cultures. These passages, specifically in suckling mice, may have induced murine adaptation and enhanced virulence in the STAT-1−/− model. The history behind the IbAr10200 strain also reveals that this strain was isolated from a tick which had engorged on a camel and has no associated human clinical disease attributed (57). As there is ongoing debate in the field about the pathogenicity among circulating CCHFV strains (3, 58-60), a human/clinical isolate with lower passage history may be more pertinent at evaluating medical countermeasures. Additionally, our unpublished studies have shown that certain CCHFV isolates, particularly isolates from human/clinical cases, have a delayed time-to-death in the STAT-1−/− murine model, compared to the prototype CCHFV isolate IbAr10200. To delay time-to-death in the model, the inventors decreased the challenge dose and changed the CCHFV challenge strain to a human clinical disease isolate. Based on CCHFV isolate availability, the inventors selected an isolate with a much lower passage history, clinical relevance (i.e., documented history of disease in humans), and one that has a prolonged time-to-death in the STAT-1−/− mouse model, relative to the IbAr10200 isolate. Our Turkey2004 strain has a lower passage history of four passages in Vero cells and one in SW-13-CDC cells with no passaging in murine tissues and has only four nucleotide changes in the genome when compared to the Genbank published Turkey 2004 isolate (45). Despite the geographic and phylogenetic clade differences between Turkey2004 and IbAr10200, the inventors hypothesized that there is residue conservation in the GPC in general, but a high degree of residue conservation among the antigenically important regions of the GN and GC. As our genomic analysis demonstrates, the GPC contains approximately 84% amino acid variability between the IbAr10200 and Turkey2004 strains. However, the true variability of the structural proteins encoded on the M-segment is more conserved (>90%) and thus have lower residue variability. Altering the strain with a less passaged and human/clinical isolate, prolonged the time-to-death window to up to 7 days. This challenge strain switch and increasing the prime dosing improved our initial 40% protection (FIG. 3B) to 100% protection (FIG. 5A) in vaccinated mice. It is curious to speculate that if structural components of the CCHFV-GPC are preferred antigens for CCHFV vaccine design, than a multiple clade vaccine approach might be feasible for cross protection between circulating strains and across geographic areas. As our construct expressed a notable and useable form of CCHFV-Gc, and elicited a protective response against two strains, additional countermeasure studies regarding this structural GP should also be explored.",
                                "ELISA and PRNT experiments on study endpoint sera, demonstrate a humoral IgG response to CCHFV-GPC with observed neutralizing antibodies produced from the prime group that received a high (107 pfu) dose of ΔGrVSV-ΔCCHFV-GPC (FIGS. 6A, 6B). Curiously, our boosted (107 pfu) group had lower detectable antibodies to the CCHFV-GPC with lower neutralization titers (FIGS. 6A, 6B). Clinical data for these groups following CCHFV challenge show that the prime only group had elevated temperatures and weight loss, indicating illness from the CCHFV challenge (FIGS. 5B, 5C, 5D). While the boosted group did display elevated temperatures, there was neither substantial weight loss detected nor clinical scoring (FIGS. 5B, 5C, 5D). Further analysis of tissues at study end point for these cohorts, also revealed that while there was no immunolabeling in the liver of the vaccinated animals the prime cohort had diffuse cytoplasmic immunolabeling of mononuclear cells in the spleen sections (FIG. 7E), suggesting, along with the clinical scores, that there was more replication of CCHFV in this group compared to the boosted group. This could potentially lead to the higher anti-CCHFV-GPC IgG titers in the prime cohort at the study endpoint as the CCHFV challenge may have “boosted” these levels when compared to the boost cohort. Regardless, protection was achieved by both regimens, though the boosted group data supports the notion that at study endpoint, the observed IgG titers against CCHFV-GPC along with lower neutralizing titers (PRNT50 of <1:320) are sufficient in combating lethal CCHFV infection in the STAT-1−/− mouse model.",
                                "Correlates of protection against CCHF have been difficult to define due to the multiple vaccine and delivery platforms examined to date, along with the lack of an immunocompetent animal model (16). Several CCHFV experimental vaccines studies have identified cell-mediated and humoral involvement, with some instances of neutralizing antibody production (24, 61). In looking at what is known for human CCHF, survivors mount a humoral response whereas those who succumb, typically lack an IgG response (3). Other studies have examined antibody and neutralizing responses from the various vaccine platforms. DNA vaccines following a three round vaccination regimen have induced detectable antibodies with neutralizing capacity observed up to 1:160 in PRNT dilutions and achieved 100% protection, depending on the antigens encoded on the DNA plasmids (25, 62). A cell culture based inactivated virus vaccine achieved high IgG titers (1:102,400) and a high neutralizing response of 1:1,024, however, this also required three vaccination rounds, an alum adjuvant, and conferred 80% protection against the clinical isolate Turkey-Kelkit06 in IFNAR mice (21). Antibody titers, neutralization capacity, and challenge virus presented here were similar, though through the VSV platform, the inventors achieved greater protection with a single dose. These studies suggest other facets of the immune system are likely involved in conferring complete protection.",
                                "A limitation of our study is that T cell responses were not evaluated, and could be contributory as other groups have shown (23, 25, 26). Future studies, serially examining the antibody and T cell repertoire after prime and boosting doses following ΔGrVSV-ΔCCHFV-GPC and VSV-G* ΔGrVSV-CCHFV-GPC, but before CCHFV challenge, would be informative for the STAT-1−/− mouse model. Though the relevance and value of the immune response in immunodeficient mice, like STAT-1−/− or IFNAR following CCHFV infection, in relation to actual immune response during human CCHF, ultimately remains unclear. In the future, the use of the IS murine model might provide a more intact immune system to model lethal CCHFV in, to better determine murine correlates of protection (20). Further, an immunocompetent, larger animal model is much needed in the CCHF field to further test the array of CCHFV experimental vaccines which have shown promise in these mouse models.",
                                "In conclusion, this study offers not only a tool to study the biology off CCHFV as it relates to structural Gc, but also serves to develop and characterize two vectors, one replication deficient and one replication competent, in relation to CCHF vaccine development. The replication competent construct provides limited protection if used with murine adapted challenge strains of CCHFV, but demonstrates 100% protection and a robust humoral response, with a single-injection when the challenge strain is a low passaged, human clinical isolate. This information is valuable in designing future studies in CCHFV animal models, and establishes characterized tools to examine the biology of structural CCHFV-GC in a pseudotyped rVSV system.",
                                "B. Materials and Methods",
                                "Cell culture, challenge virus, and antibodies. Baby hamster kidney cells (BHK) (kindly provided by M. Whitt, University of Tennessee Health Science Center, Memphis, Tenn.), African green monkey kidney E6 clone cells (Vero E6) (American Type Culture Collection [ATCC], Manassas, Va.), a clone from the SW-13 human adrenocortical carcinoma cell line (SW-13-CDC), (kindly provided by É. Bergeron of Centers for Disease Control and Prevention, Atlanta, Ga.) were maintained in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% fetal bovine serum (FBS; Invitrogen, Carlsbad, Calif.), 2 mM L-glutamine (Invitrogen), and 1% penicillin-streptomycin (P/S; Invitrogen), cumulatively called D10. CCHFV challenge stocks, strains IbAr10200 and Turkey-200406546 [referred as Turkey2004, throughout] (kindly provided by T. Ksiazek, UTMB—World Reference Center for Emerging Viruses and Arboviruses, Galveston, Tex.), were propagated in Vero E6 cells once, plus previous passages in suckling mice and Vero cells since isolation. All in vitro and in vivo work with CCHFV was performed in a biosafety level 4 facility at the Galveston National Laboratory, University of Texas Medical Branch, Galveston, Tex. All cell and viral stocks were tested and free of mycoplasma, by PCR kit (IntronBio, Gyungg-Do, South Korea). Monoclonal antibodies (MAb) mouse-α-CCHFV-GC 11E7, 8A1, and 12A9, and mouse-α-CCHFV-GN antibody 6B12 were generated and characterized as described previously (13, 14). Described antibodies are available at BEI Resources (ATCC) except for 8A1, which was kindly provided by United States Armed Forces Research Institute for Infectious Diseases, Frederick, Md.",
                                "Generation of ΔGrVSV-CCHFV-GPC vectors. The rVSV vector was cloned and recovered from cDNA as previously described (63). Briefly, a BlueScript backbone plasmid under T7 polymerase promoter control encoding a ΔG, VSV Indiana backbone expressing a chimeric Zaire ebolavirus (ChEBOV) glycoprotein (GP), was used as the vector (designated pVSVΔG-ChEBOV-GP-3). This plasmid was modified by cutting out an existing ChEBOV-GP coding sequence via MluI and NheI restriction sites, yielding a pVSVΔG vector. An insert, coding for the codon optimized open reading frame of the complete CCHFV glycoprotein precursor (GPC), was digested and ligated into the pVSVΔG vector. The CCHFV-GPC insert was created by overhang PCR mutagenesis; flanking a 3′ MluI restriction site plus Kozak sequence, and a 5′ XbaI restriction site, from a PCR amplified, codon optimized, pCAGG-CCHFV-GPC (kindly provided by J. Kortekaas, Central Veterinary Institute, Lelystad, Netherlands). This ligated and cloned plasmid, designated pVSVΔG-CCHFV-GPC, was transfected into BHK cells that were also co-transfected with VSV protein N, P, G, and, L ‘helper’ plasmids under T7 promoter control and driven by infection (MOI 5) with recombinant vaccinia virus expressing T7 polymerase (rVV-TF7-3; kindly provided by M. Whitt). Recovered virus, designated VSV-G*-ΔGrVSV-CCHFV-GPC, was collected 24-48 hrs post infection/transfection, filtered twice through a 0.2 μm filter to remove vaccinia virus, plaque purified onto VSV-G* complemented BHK cells, and stored at −80° C. for further use. All plasmid maps and cloning primer sequences are available upon request.",
                                "Infections, enumeration, growth kinetics, and preparation of viral material. For infections of replication deficient vector, semi-confluent (˜60-80%) monolayers of BHK cells were transfected with 1 μg/1×106 cells using either pCAGG-VSV-G(Indiana) or pCAGG-VSV-G(New Jersey). Once monolayers displayed cell rounding and syncytia, they were infected at an MOI of 0.1 with VSV-G*-ΔGrVSV-CCHFV-GPC. Supernatants were harvested at 24 hrs post infection (hpi) and clarified at 2,000 rpm for 10 min at 4° C. Confluent monolayers of BHK cells were infected with replication competent ΔGrVSV-ΔCCHFV-GPC at MOI 0.1 for 1 hr at 37° C. with 5% CO2 with rocking at 15 min intervals and harvested/clarified at 48 hpi. Plaque assays for viral titrations were carried out in an analogous manner, with an overlay media final concentration of 1.25% Avicel (Sigma-Aldrich, St. Louis, Mo.) in 1× Eagles minimum essentials medium (MEM) with 5% FBS and 1% P/S on BHK cells for 24-48 hpi. After incubations, overlays were aspirated and a 10% buffered formalin fix with a 1× crystal violet stain was incubated onto monolayers for one hr. Plaques were enumerated and plaque forming units (pfu) were determined by averaging technical replicates per sample. Single-cycle growth curves at MOI 0.1 were performed by absorbing rVSV-GFP, VSV-G*-ΔGrVSV-CCHFV-GPC, ΔGrVSV-ΔCCHFV-GPC, or CCHFV onto duplicate monolayers of BHK cells in six-well plates as described above. Inoculum was aspirated, cells were washed three times with PBS, and D5 was added to monolayers and incubated at various time points indicated in FIG. 2A. At designated time points, samples were collected and stored at −80° C. until titrations were performed described above.",
                                "CCHFV-GC protein analysis. Immunofluorescence analysis was carried out by infecting SW-13-CDC and BHK monolayers at an MOI of 0.1 for 24 and 48 hpi, respectively. Cells were fixed with 4% (w/v) paraformaldehyde, permeabilized with 1% Triton X-100 and stained with 1:500 diluted MAb 8A1. Cells were washed, blocked with 5% BSA, and incubated with a dilution of 1:1,000 secondary goat-α-mouse MAb conjugated to an AlexaFluor488 (Invitrogen). Stained cells were examined on a Nikon Eclipse Ti-S fluorescence microscope. Whole virions were analyzed by infecting BHK cell monolayers, semi-purifying clarified supernatants over a 20% sucrose cushion at 37,000 rpm for 45 min at 4° C. using a Beckman SW 41 Ti rotor. Viral pellets were lysed using NP-40 with 1× Protease Inhibitor Cocktail (Invitrogen). Recombinant VSV lysates were incubated at 56° C. for 10 min and protein subsequently quantified using BCA Protein Assay per manufacturers' instructions (Thermo Fisher Scientific, Waltham, Mass.). Per institutional inactivation protocols, CCHFV lysates had a modified inactivation protocol using instead 2× Laemmli Sample Buffer (LSB) (Thermo Fisher Scientific) at 95° C. for 15 min boiling and transfer to a fresh tube. Approximately 200 ng of purified and semi-purified virion associated total protein was mixed 1:1 with 1×LSB (without β-mercaptoethanol) and run on 4-20% gradient Mini-PROTEAN TGX electrophoresis gels (Bio-Rad, Hercules, Calif.). Coomasie staining was accomplished via incubating TGX gels in Coomassie Fluor Orange protein gel stain (Thermo Fisher Scientific) per manufacturers' instructions and imaged at 300 nm on a Gel Doc XR+ gel documentation system (BioRad). Western blots were run on TGX gels using wet tank transfer to Hybond-P polyvinylidene difluoride (PVDF) membranes (GE Healthcare, Little Chalfont, UK). Membranes were blocked with 5% BSA overnight at 4° C. in Tris/0.1% Tween 20 (Sigma-Aldrich) followed by incubation with primary MAb 11E7 diluted at 1:1,000, overnight at 4° C. Secondary horse radish peroxidase (HRP) conjugated goat-α-mouse antibody (Thermo Fisher Scientific) was diluted 1:10,000 and incubated on the membrane for 1 h at room temperature. Detection of HRP was accomplished via Pierce ECL western blotting substrate (Thermo Fisher Scientific), Hyperfilm ECL (GE Healthcare), and Kodak Carestream film with X-OMAT 2000 Processor (Eastman Kodak Company, Rochester, N.Y.).",
                                "RNA purification, cDNA creation, and Sanger sequencing analysis. Clarified viral supernatants were placed in TRIzol LS (Thermo Fisher Scientific) at a ratio of 1:5, mixed, incubated for 10 min at room temperature, and transferred to fresh tubes. RNA was isolated from sample mixtures using Zymo Research Direct-zol RNA min-prep (Zymo Research Corp, Irvine, Calif.), per manufacturers' instructions. RNA was quantified using a NanoDrop 8000 (Thermo Fisher Scientific) and approximately 500 ng total RNA was used to create cDNA using the SuperScript III First-Strand Synthesis System (Invitrogen) and a VSV-M, matrix protein gene 3′ forward primer. Sanger sequencing on the cDNA was performed using VSV-M, VSV-L, and CCHFV-GPC (codon optimized) open reading frame primer sets and accomplished by the UTMB Molecular Genomics Core using an ABI Prism 3130XL DNA Sequencer (Applied Biosystems, Foster City, Calif.). Sequence analysis was performed using Geneious R9 (Biomattes, Auckland, New Zealand) based on consensus and plasmid maps. All cDNA/sequencing primers and consensus/plasmid maps are available upon request.",
                                "Deep sequence analysis of viral RNA genomes. To analyze the stocks of CCHFV or rVSV vaccine vectors used in this study the inventors performed deep sequencing analysis of RNA isolated from these virus stocks. Briefly, viral RNA was isolated from a Trizol LS (Invitrogen)/sample mixture using a Direct-zol RNA mini-prep (Zymo Research), per manufacturer's instructions. Approximately 150 ng of purified RNA was used to make cDNA using the Ovation RNA-seq 2.0 kit (NuGen) and this in turn was used for the preparation of the double-stranded DNA library, using Encore Ion Torrent library prep kit. Sequencing was performed by the UTMB Molecular Core on the Ion Torrent using 318-v2 deep sequencing chips. Sequence analysis was performed using DNA Star Seqman NGen software (DNA Star) based on unpaired analysis of 125 base pair overlaps.",
                                "Ultrastructural analysis. Viruses were propagated in multiple T-150 flasks of confluent BHK cells. Viral supernatants were harvested and clarified as described above. Clarified supernatants were concentrated by mixing with buffered 4× polyethylene glycol with incubation for 4 hrs at 4° C., followed by centrifugation at 6,800×g for 30 mins at 4° C. Concentrated pellets were re-suspended in PBS with protease inhibitor and overlaid atop Optiprep (Sigma-Aldrich) continuous gradients of 6-48% buffered iodixanol. Viruses were banded by ultracentrifugation at 25,000×g for 15 hrs at 4° C. using a SW 41 Ti rotor. Bands were harvested, washed in PBS, and pelleted at 27,000×g for 1 h at 4° C. using a SW 41 Ti rotor to remove residual iodixanol. Purified viral pellets were re-suspended in PBS and absorbed onto Formvar-carbon coated nickel grids (Electron Microscopy Sciences [EMS], Hatfield, Pa.) for 10-30 mins, incubated with MAb 11E7, 12A9, or 8A1 at 1:10 dilutions. Antibodies were absorbed for 30 mins in wet chamber and washed with PBS containing 1% BSA, and incubated with the secondary antibody, goat-α-mouse conjugated to 15 nm colloidal gold particles (EMS), at a dilution of 1:20 for 30 mins. Grids were washed with PBS and 1% BSA, and fixed using 2% (w/v) aqueous glutaraldehyde for 10 mins and stained with 2% (w/v) aqueous uranyl acetate. Grids were examined at 60 kV using a Philips CM-100 transmission electron microscope.",
                                "Ethics of care, vaccination, and animal challenge. Animal studies were approved by the UTMB Institutional Animal Care and Use Committee (IACUC). Animal research was carried out in compliance with the Animal Welfare Act and other federally regulated stipulations regarding animals and adherences to the Guide for the Care and Use of Laboratory Animals, National Research Council, 2013. The animal facilities where this research was conducted are accredited by the Association for Assessment and Accreditation of Laboratory Animal Care International. This study used female 4 to 8 weeks old 129S6/SvEv-Stat1tm1Rds mice (STAT-1−/−) (Taconic, Germantown, N.Y.). After an acclimatization period in barrier conditions in environmentally enriched sterile housing etc., mice were anesthetized by isoflurane and implanted with subdermal transponders, which provide coded identifiers and permitted body temperature measurements (Biomedic Data Solutions, Seaford, Del.). Vaccine preparations were diluted in Hanks balanced salts medium with 4% FBS, along with PBS for control groups. After anesthesia by isoflurane, 500 ul of each preparation was split and administered in two locations intraperitoneally (i.p.) on either side of the mouse, with five STAT-1−/− mice per experimental group. Mice were observed twice daily for one-week post vaccinations, and once daily thereafter. Clinical scoring, body temperature, and weight in grams, were recorded daily. Mice were brought into ABSL-4 several days prior to challenge to permit further acclimatization. At 35 days post vaccination (prime), mice were challenged with 500 ul i.p. with either 100 pfu or 50 pfu of CCHFV-Ibar10200 or CCHFV-Turkey200406546 (referred to as Turkey2004), respectively. All challenge doses were frozen for storage and verified by back-titrations by plaque assay on SW-13-CDC cells as outlined in previous methodology sections. After challenge, animals were observed twice daily for clinical scoring, temperature, and weight change for two weeks, and once daily thereafter. Upon humane endpoint scoring, or study end-points, euthanasia was carried out by isoflurane anesthesia and terminal blood collection via cardiac puncture or retro-orbital bleeding, followed by CO2 overdose. Blood was collected and plasma and serum were separated by centrifugation and frozen for storage and further analysis.",
                                "Anti-CCHFV-GPC IgG ELISA development. Iodixanol gradient purified ΔGrVSV-ACCHFV-GPC and rVSV-GFP were re-suspended in NP-40 buffer and BCA protein quantified (previously described above) and were used as whole virion antigens in coating Immunosorbent 96-well plates (Thermo Fisher Scientific). Matrices of various antigen, blocking, primary antibodies (hyperimmune mouse ascetic fluid [HMAF kindly provided by T. Ksiazek], 8A1, and 11E7) to CCHFV/CCHFV-GPC, and secondary antibody (MAb HRP-goat-α-mouse) concentrations were used to develop optimal detection conditions for the CCHFV-GPC via ELISA. Per optimizations, one microgram of purified antigen per mL was suspended in sterile filtered sodium bicarb/carbonate buffer (pH 9.6) and allowed to incubate on immunosorbent plates overnight at 4° C. Plates were washed with PBS containing a concentration 0.1% tween-20 and 0.001% thimerosal. Blocking occurred with 5% milk dissolved in wash buffer, for 2 hrs at room temperature. Sera from STAT-1−/− mice was added 1:100 and diluted 2-fold by pipetting across plates and allowed to incubate for one hr at 37° C. Plates were washed and a secondary anti-mouse antibody conjugated to HRP was added at 1:5,000 dilution for one hr at 37° C. ABTS Peroxidase substrate (KPL, SeraCare Life Sciences, Milford, Mass.) was incubated for 15 mins at room temperature prior to the addition of a 1% SDS stop solution. Plates were read with nine reads per well at 405 nm with a plastic correction factor accounted for from a 490 nm reading per well. Test sera was evaluated for both purified ΔGrVSV-ΔCCHFV-GPC and rVSV-GFP antigen response and resulting adjusted optical density (O.D.) values were adjusted by subtracting rVSV-GFP O.D. values from ΔGrVSV-ΔCCHFV-GPC O.D. values.",
                                "Plaque reduction neutralization assay. Serial dilutions of sera from four mice per treatment group, were aliquoted into cluster tubes with D10 and allowed to incubate with 100 pfu of CCHFV, isolate Turkey 2004, for approximately 2 hrs on ice. Resulting sera plus virus mixture was then overlaid onto 6-well plates of confluent SW-13-CDC cells and absorbed for 1 hr at 37° C. with 5% CO2 with rocking at 15 min intervals. Plaque assays were carried out in a manner described above in previous methods section. Resulting plaques were enumerated and compared to sera plus media only wells run for each sample, and a percent neutralization was calculated and reported for each dilution. Hyperimmune mouse ascitic fluid [HMAF] raised against CCHFV was additionally serially diluted and run as a positive control.",
                                "Immunohistochemistry of tissues. Tissue sections were deparaffinized and rehydrated through xylene and graded ethanols. Slides went through heat antigen retrieval in a steamer at 95° C. for 20 mins in Sigma Citrate Buffer, pH6.0, 10× (Sigma Aldrich, St. Louis, Mo.). To block endogenous peroxidase activity, slides were treated with a 3% hydrogen peroxide and rinsed in distilled water. The tissue sections were processed for IHC using the Thermo Autostainer 360 (ThermoFisher, Kalamazoo, Mich.). Sequential 15 min incubations with avidin D and biotin solutions (Vector, Burlingame, Calif.) were performed to block endogenous biotin reactivity. Specific anti-CCHFV immunoreactivity was detected using a primary polyclonal rabbit-α-CCHFV-NP antibody (IBT BioServices, Rockville, Md.) at a 1:3200 dilution for 60 mins. A secondary biotinylated goat-α-rabbit-IgG (Vector Laboratories, Burlingame, Calif.) at 1:200 dilution for 30 mins followed by Vector Horseradish Peroxidase Streptavidin, R.T.U (Vector) for 30 mins. Slides were developed with Dako DAB chromagen (Dako, Carpenteria, CA) for 5 mins and counterstained with Harris hematoxylin for 30 seconds. Tissue sections from uninfected mice were used as negative controls.",
                                "Statistical analysis. Statistical analysis of viral titers was performed using unpaired t-test with a 95% confidence level (P<0.05) and for survival, aKaplan-Meier survival curve with GraphPad Prism software (Graphpad Software, Inc., San Diego, Calif.)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce example 1",
                                "describe replication competent vesicular stomatitis vector",
                                "motivate codon optimized CCHFV-GPC",
                                "examine expression of CCHFV-GPC in human liver cells",
                                "describe immunofluorescence staining of CCHFV-GC",
                                "clone and recover ΔGrVSV-CCHFV-GPC",
                                "describe modification of DNA clone recovery system",
                                "use VSV-G complementation to facilitate assembly",
                                "recover virion containing CCHFV-GPC",
                                "passage virus on VSV-G complemented BHK cells",
                                "passage virus on un-complemented BHK cells",
                                "observe cytopathic effect and plaque formations",
                                "harvest RNA and stain for CCHFV-GC antigen",
                                "perform Sanger sequencing of constructs",
                                "perform next generation sequencing",
                                "identify single nucleotide polymorphisms",
                                "analyze growth kinetics of rVSV vectors",
                                "perform single-cycle growth curve analysis",
                                "examine expression of CCHFV-GPC in vitro",
                                "perform immunofluorescence microscopy",
                                "examine incorporation of CCHFV-GC onto virions",
                                "perform Coomassie staining and western blot analysis",
                                "analyze ultrastructure of replication competent recombinant",
                                "perform transmission electron microscopy studies",
                                "examine length of particles",
                                "employ immunolabeling with CCHFV-GC MAb",
                                "design in vivo study to test vaccine",
                                "select STAT-1−/− mouse model for CCHFV",
                                "design pilot study to test conditions and doses",
                                "vaccinate mice with replication deficient construct",
                                "boost mice with replication competent construct",
                                "challenge mice with CCHFV strain IbAr10200",
                                "observe survival rates",
                                "design second experiment to increase prime dose",
                                "challenge mice with CCHFV strain Turkey2004",
                                "analyze humoral response in mice",
                                "examine IgG response to CCHFV-GP",
                                "determine neutralizing capacity of sera",
                                "motivate CCHFV vaccine development",
                                "describe GC tail truncation effect",
                                "discuss localization signal in transmembrane region",
                                "summarize structural GC properties",
                                "explore rVSV vector as vaccine candidate",
                                "discuss murine virulence of rVSV expressing CCHFV-GP",
                                "describe pilot study design and results",
                                "hypothesize time-to-death in STAT-1−/− model",
                                "discuss IbAr10200 strain limitations",
                                "introduce Turkey2004 strain as alternative",
                                "compare genomic analysis of IbAr10200 and Turkey2004",
                                "discuss implications for vaccine design",
                                "present ELISA and PRNT results",
                                "analyze humoral response in prime and boosted groups",
                                "discuss clinical data and tissue analysis",
                                "correlate protection with IgG titers and neutralization",
                                "review existing CCHFV vaccine studies",
                                "discuss limitations of study and future directions",
                                "introduce IS murine model as alternative",
                                "conclude on replication competent construct",
                                "describe cell culture and challenge virus",
                                "detail antibodies used",
                                "generate ΔGrVSV-CCHFV-GPC vectors",
                                "clone and recover rVSV vector",
                                "modify pVSVΔG vector with CCHFV-GPC insert",
                                "transfect and recover VSV-G*-ΔGrVSV-CCHFV-GPC",
                                "store recovered virus for further use",
                                "introduce examples",
                                "infections and enumeration",
                                "growth kinetics",
                                "preparation of viral material",
                                "CCHFV-GC protein analysis",
                                "immunofluorescence analysis",
                                "whole virion analysis",
                                "RNA purification",
                                "cDNA creation",
                                "Sanger sequencing analysis",
                                "deep sequence analysis",
                                "ultrastructural analysis",
                                "ethics of care",
                                "vaccination",
                                "animal challenge",
                                "anti-CCHFV-GPC IgG ELISA development",
                                "ELISA optimization",
                                "plaque reduction neutralization assay",
                                "immunohistochemistry of tissues",
                                "tissue section preparation",
                                "antigen retrieval",
                                "blocking endogenous peroxidase activity",
                                "IHC processing",
                                "detecting specific anti-CCHFV immunoreactivity",
                                "developing slides",
                                "statistical analysis of viral titers",
                                "Kaplan-Meier survival curve analysis"
                            ],
                            "num_characters": 46991,
                            "outline_medium": [
                                "introduce example 1",
                                "describe replication competent vesicular stomatitis vector",
                                "motivate codon optimized CCHFV-GPC",
                                "examine expression of CCHFV-GPC in human liver cells",
                                "describe initial attempts to recover infectious ΔGrVSV-CCHFV-GPC",
                                "introduce modification for VSV glycoprotein complementation",
                                "recover virion containing CCHFV-GPC in genome",
                                "passage virus on VSV-G complemented BHK cells",
                                "analyze growth kinetics of rVSV vectors",
                                "assess expression of CCHFV-GPC in ΔGrVSV-CCHFV-GPC vector",
                                "examine incorporation of CCHFV-GC onto gradient purified rVSV virions",
                                "analyze ultrastructure of replication competent recombinant",
                                "design in vivo study to test vaccine efficacy",
                                "conduct pilot study to test range of conditions and doses",
                                "analyze survival rates and weight loss in vaccinated mice",
                                "design second experiment to increase prime dose and boost with replication competent virus",
                                "analyze genomic alignments between vaccination and challenge strains",
                                "examine humoral response in mice",
                                "discuss results and implications for CCHFV vaccine development",
                                "motivate CCHFV vaccine development",
                                "describe GC tail truncation effect",
                                "discuss localization signal in transmembrane region",
                                "summarize structural GC properties",
                                "explore rVSV vector as vaccine candidate",
                                "discuss murine virulence and STAT-1−/− model",
                                "describe pilot study results and challenge strain selection",
                                "discuss ELISA and PRNT experiments",
                                "analyze tissue samples and clinical scores",
                                "discuss correlates of protection against CCHF",
                                "describe study limitations and future directions",
                                "summarize replication competent and deficient constructs",
                                "outline materials and methods",
                                "describe viral material preparation",
                                "detail plaque assays for viral titrations",
                                "analyze CCHFV-GC protein",
                                "perform RNA purification and Sanger sequencing",
                                "conduct deep sequence analysis of viral RNA genomes",
                                "perform ultrastructural analysis",
                                "outline ethics of care, vaccination, and animal challenge",
                                "develop anti-CCHFV-GPC IgG ELISA",
                                "conduct plaque reduction neutralization assay",
                                "perform immunohistochemistry of tissues",
                                "detail statistical analysis",
                                "describe viral growth curves",
                                "analyze viral protein expression"
                            ],
                            "outline_short": [
                                "introduce replication competent vesicular stomatitis vector protecting against lethal Crimean-Congo hemorrhagic fever infection in mice",
                                "describe results of codon optimized CCHFV-GPC expression in human liver cells",
                                "detail recovery of ΔGrVSV-CCHFV-GPC using VSV-G complementation",
                                "analyze growth kinetics of rVSV vectors compared to authentic CCHFV",
                                "examine expression of CCHFV-GPC in ΔGrVSV-CCHFV-GPC vector",
                                "study ultrastructure of replication competent recombinant ΔGrVSV-ΔCCHFV-GPC",
                                "design in vivo study to test ability of constructs to function as experimental vaccine",
                                "analyze humoral response in mice and determine neutralizing capacity of sera",
                                "discuss challenges of expressing CCHFV-GPC in trans on viral vectors",
                                "describe CCHFV pseudotype formation",
                                "discuss limitations of murine virulence models",
                                "present vaccine development results",
                                "analyze immune response and correlates of protection",
                                "discuss study limitations and future directions",
                                "describe materials and methods",
                                "perform viral infections",
                                "analyze viral proteins",
                                "purify and sequence viral RNA",
                                "perform ultrastructural analysis",
                                "conduct animal studies and vaccination",
                                "develop and perform ELISA and plaque reduction neutralization assays"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce CCHFV",
                        "describe CCHFV genome",
                        "explain CCHFV transmission",
                        "discuss CCHFV case-fatality rates",
                        "motivate need for vaccines and therapeutic countermeasures",
                        "describe current experimental vaccine candidates",
                        "discuss limitations of current vaccine candidates",
                        "introduce rVSV as a promising vaccine platform",
                        "motivate use of rVSV for CCHFV",
                        "state aim of the study",
                        "introduce recombinant virus"
                    ],
                    "num_characters": 5785,
                    "outline_medium": [
                        "introduce CCHFV",
                        "describe CCHFV genome and proteins",
                        "discuss current vaccine candidates and limitations",
                        "motivate development of rVSV vaccine",
                        "state aim of the study"
                    ],
                    "outline_short": [
                        "introduce CCHFV and its characteristics",
                        "discuss current vaccine candidates and their limitations"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A replication competent recombinant Vesicular Stomatitis Virus (rVSV) vector comprising a VSV glycoprotein deficient VSV (ΔGrVSV) genome encoding a Crimean-Congo Hemorrhagic Fever virus (CCHFV) glycoprotein precursor (GPC)(ΔGrVSV-CCHFV-GPC).",
        "2. The vector of claim 1, wherein the nucleic acid sequence encoding the CCHFV-GPC is codon optimized.",
        "3. The vector of claim 1, wherein the nucleic acid sequence encoding the CCHFV-GPC is 90% identical to the nucleic acid sequence of SEQ ID NO:2, SEQ ID NO:4, or SEQ ID NO:6.",
        "4. The vector of claim 1, wherein the nucleic acid sequence encoding the CCHFV-GPC is identical to the nucleic acid sequence of SEQ ID NO:2, SEQ ID NO:4, or SEQ ID NO:6.",
        "5. The vector of claim 1, wherein the CCHFV-GPC protein has an amino acid sequence that is 95% identical to the amino acid sequence of SEQ ID NO:5, SEQ ID NO:7, or SEQ ID NO:8.",
        "6. The vector of claim 1, wherein the encoded CCHFV-GPC has an amino acid sequence of SEQ ID NO:5, SEQ ID NO:7, or SEQ ID NO:8.",
        "7. The vector of claim 1, wherein the ΔGrVSV-CCHFV-GPC vector has a nucleic acid sequence that is 90% identical to SEQ ID NO:1 or SEQ ID NO:4",
        "8. The vector of claim 1, comprised in an expression cassette.",
        "9. The vector of claim 8, wherein the expression cassette is comprised in a plasmid vector.",
        "10. A recombinant Vesicular Stomatitis Virus (rVSV) comprising a Crimean-Congo Hemorrhagic Fever virus (CCHFV) glycoprotein (rVSV-CCHFV-GP) GN and/or GC.",
        "11. A vaccine composition comprising the virus of claim 10.",
        "12. A method of producing an immune response in a mammal comprising administering one or more of the vector of claim 1, the virus of claim 10, or the vaccine of claim 11 to a mammal.",
        "13. The method of claim 12, wherein the mammal is a human.",
        "14. The method of claim 12, wherein the vector is administered by injection, inhalation, or instillation.",
        "15. A method for producing a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC) comprising the step of passaging a VSV glycoprotein complemented recombinant Vesicular Stomatitis Virus encoding Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor (VSV-G*-ΔGrVSV-CCHFV-GPC) in a non-complementing VSV glycoprotein cell line and isolating a replication competent ΔGrVSV-CCHFV-GPC vector.",
        "16. A method of producing replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP), comprising infecting a cell culture with the isolated replication competent ΔGrVSV-CCHFV-GPC vector and isolating ΔGrVSV-CCHFV-GP virus produced by the infected cells.",
        "17. A kit comprising one or more of (a) at least one dose of a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC) of claim 1; or (b) at least one dose of a replication competent recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP) of claim 9.",
        "18. A method for identifying a subject infected with or exposed to Crimean-Congo Hemorrhagic Fever virus comprising the steps of:\n(a) contacting a biological sample with a recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein virus (ΔGrVSV-CCHFV-GP) or a cell expressing a recombinant Vesicular Stomatitis Virus comprising a Crimean-Congo Hemorrhagic Fever virus glycoprotein precursor vector (ΔGrVSV-CCHFV-GPC) forming a Crimean-Congo Hemorrhagic Fever glycoprotein/antibody complex with Crimean-Congo Hemorrhagic Fever glycoprotein specific antibodies present in the sample; and\n(b) detecting glycoprotein/antibody complexes."
    ]
}