{
    "id": "US20130210636",
    "authors": [
        "Lasse Folkersen",
        "Anders Gabrielsen",
        "Ulf Hedin",
        "Gabrielle Paulsson-Berne",
        "Jonas Lars Persson"
    ],
    "title": "Method and Kit for Performing Profiling of Endarterectomy Patients",
    "date": "2012-02-14 00:00:00",
    "abstract": "A method of profiling endarterectomy patients for determining one or more post-operative risks includes steps comprising:\n\n    \n    \n        (a) obtaining a set of parameters which describe the patient, the set of parameters including at least one of: age of patient, E; smoking habits of patient, S; serum cholesterol concentration of patient, C; diabetes status of patient, D; blood pressure of patient, P;\n        (b) obtaining one or more samples of plaque tissue from endarterectomy treatment of the patient;\n        (c) isolating genetic material from the one or more samples of plaque tissue;\n        (d) determining genetic expression activities of a plurality of genes identified in the genetic material; and\n        (e) computing from the set of parameters in combination with the genetic expression activities one or more post-operative risks indicative of potential events to which the patient is susceptible as a consequence of the endarterectomy treatment.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention concerns methods of profiling endarterectomy patients, for example for determining risk factors and associated optimal post-operative treatment strategies. Moreover, the present invention also relates to kits for use for executing such methods. Furthermore, the invention concerns software products recorded on machine-readable data storage media, wherein the software products are executable on computing hardware for assisting in executing aforesaid methods."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce endarterectomy patient profiling"
                    ],
                    "num_characters": 482,
                    "outline_medium": [
                        "define invention scope"
                    ],
                    "outline_short": [
                        "define invention scope"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "“Endarterectomy” refers to a removal of material from an inside surface of the one or more arteries; the material on the inside surface is known as “plaque” and is often mechanically of a sticky flexible nature. An example of an endarterectomy procedure is Carotid endarterectomy (CEA), which is a surgical procedure employed to reduce a risk of stroke by at least partially correcting for stenosis, namely narrowing, in one or more common carotid arteries of the human body.",
                        "A natural process known as Atherosclerosis which occurs in the human body causes layers of plaque to form in the one or more arteries. In the carotid arteries atherosclerosis usually occurs in a fork where a common carotid artery divides into a corresponding internal carotid artery and a corresponding external carotid artery. The layers of plaque have a tendency to build up in the inner surfaces of the arteries, namely lumen, and cause narrowing and associated constriction of the arteries, thereby rendering blood supply to the human brain at least partially restricted. Pieces of the plaque, known as emboli, are susceptible to break off, namely become embolized, and travel up the internal carotid artery to brain regions, whereat the pieces risk blocking blood circulation, and thereby risk causing death of brain tissue which requires to be constantly furnished with oxygen and nutrients to survive.",
                        "In practice, it is found that the layers of plaque cause symptoms which are noticeable by patients themselves. The symptoms are often experienced as temporary or transitory strokes, namely transient ischemic attacks (TIA's). For purposes of conventional temporary diagnosis, TIA's last less than 24 hours; after 24 hours, TIA's are known as strokes.",
                        "In situations where the plaque does not manifest as noticeable symptoms, patients are still at a higher risk of stroke in comparison to a general human population, but not as high a risk for patients with symptomatic stenosis. An incident of stroke, including fatal stroke, is in a range of 1% to 2% per year. Surgical mortality as a result of executing endarterectomy lies often in a range of 1% to 2% of patients, but is susceptible to lying in a larger range of 1% to 10% in certain circumstances. Thus, execution of endarterectomy potentially provides potential benefits but also introduces additional risk.",
                        "In carotid endarterectomy, a surgeon opens a human carotid artery of a patient to be treated and mechanically removes plaque, namely a sticky fat-like material from the artery. A newer procedure, known as endovascular angioplasty, threads a catheter up from a groin region of the patient, around an aortic arch, and up a carotid artery to be de-plagued. The catheter employs a balloon-type structure to expand the artery, thereby providing an opportunity for a stent to be fitted to hold the artery open if required. In a plurality of clinical trials, a 30-day post-operative risk of heart attack, stroke, or even death was significantly higher when stenting was employed in comparison to just endarterectomy, namely 9.6% for stenting versus 3.9% for endarterectomy. The European International Carotid Stenting Study (ICSS) found that stents had almost double a rate of complications occurring in comparison to just endarterectomy.",
                        "When performing endarterectomy on patients, it is desirable to try to reduce a risk of post-operative complications, for example post-operative complications which can result in strokes, or worst case death, and also short- and longterm progression of atherosclerosis. Contemporary risk prediction methods for use in selecting appropriate post-operative treatments for endarterectomy patients involves assessing parameters indicative of:\n\n\n- - (a) age of patient, E;\n  - (b) smoking habits of patient, S;\n  - (c) serum cholesterol concentration of patient, C;\n  - (d) diabetes status of patient, D; and\n  - (e) blood pressure of patient, P.",
                        "The risk prediction determines a degree of aftercare required, for example prescribed certain types of medication, or subjected to additional invasive treatments; the risk R and a suitable treatment strategy T are defined by Equations 1 and 2 (Eq. 1, Eq. 2):",
                        "R=F1(E,S,C,D,P)  Eq. 1",
                        "T=F2(E,S,C,D,P)  Eq. 2",
                        "wherein F1 and F2 are multi-parameter functions.",
                        "A problem arising in practice is that Equations 1 and 2 (Eq. 1 & Eq. 2) are not sufficiently accurate, such that individuals susceptible to short-term and long term major cerebrovascular and cardiovascular ischemic events are not identified accurately. A more accurate risk prediction is desirable which will aid medical staff to treat high-risk patients more aggressively than others."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define endarterectomy",
                        "describe atherosclerosis",
                        "explain plaque formation",
                        "describe symptoms of plaque buildup",
                        "discuss risks of endarterectomy",
                        "compare endarterectomy and endovascular angioplasty",
                        "describe contemporary risk prediction methods",
                        "discuss limitations of Equations 1 and 2",
                        "motivate improved risk prediction"
                    ],
                    "num_characters": 4669,
                    "outline_medium": [
                        "introduce endarterectomy",
                        "describe atherosclerosis",
                        "explain current risk prediction methods",
                        "highlight limitations of current methods"
                    ],
                    "outline_short": [
                        "motivate endarterectomy",
                        "limitations of conventional risk prediction methods"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention seeks to provide an improved method of performing profiling of one or more endarterectomy patients for reducing a risk of complications or mortality after endarterectomy treatment has been executed on the one or more patients.",
                        "Moreover, the present invention seeks to provide testing kits including necessary elements for implementing the improved method of performing profiling of one or more endarterectomy patients for reducing a risk of complications or mortality after endarterectomy treatment has been executed on the one or more patients.",
                        "According to a first aspect of the present invention, there is provided a method as defined in appended claim 1: there is provided a method of profiling endarterectomy patients for determining one or more post-operative risks, characterized in that the method includes:\n\n\n- - (a) obtaining a set of parameters which describe the patient, the\n    set of parameters including at least one of: age of patient, E;\n    smoking habits of patient, S; serum cholesterol concentration of\n    patient, C; diabetes status of patient, D; blood pressure of\n    patient, P;\n  - (b) obtaining one or more samples of plaque tissue from\n    endarterectomy treatment of the patient;\n  - (c) isolating genetic material from the one or more samples of\n    plaque tissue;\n  - (d) determining genetic expression activities of a plurality of\n    genes identified in the genetic material; and\n  - (e) computing from the set of parameters in combination with the\n    genetic expression activities one or more post-operative risks\n    indicative of potential events to which the patient is susceptible\n    as a consequence of the endarterectomy treatment.",
                        "The present invention is of advantage in that the method is capable of providing better prediction of one or more risks of ischemic events than conventional methods after endarterectomy treatment.",
                        "Optionally, the method is used for carotid endarterectomy and the method includes obtaining one or more samples of plaque tissue from carotid endarterectomy treatment of the patient.",
                        "Optionally, the method is implemented, so that the isolated genetic material corresponds to a total RNA content of the one or more samples of plaque tissue. Plaque tissue is of advantage because it is capable of providing a better indication of the one or more risk factors used for prediction of ischemic events in comparison to genetic material obtained from blood cells.",
                        "Optionally, the method is implemented, so that a step (e) of the method includes excluding from computation of the one or more risks gene expressions which lie below a threshold expression limit. Such a limit prevents irrelevant genes from influencing the assessment of the one or more risks. More optionally, the threshold expression limit is determined from an average expression exhibited by a plurality of genes obtained from the one or more samples of plaque tissue.",
                        "Optionally, the method includes excluding from computation of the one or more risk factors RNA material from one or more genes whose RNA purity is less than a purity threshold limit. Such a filtration prevents extraneous material from influencing computations of the one or more risks.",
                        "Optionally, the method in its step (e) involves performing a blinded cross-validation iterative computation for computing the one or more risks.",
                        "Optionally, for obtaining most pertinent material for analysis, the plurality of genes are derived from cytoplasm, plasma membranes and mitochondria included in the one or more samples of plaque tissue. More optionally, the genetic material includes a set of genes, wherein substantially 13.2% of the genes are localized to cytoplasm.",
                        "Optionally, substantially 14.9% of the genetic material is localized to plasma membranes, and substantially 3.5% of the genetic material is localized to mitochondria.",
                        "Optionally, the method includes in its step (e) of the method involves computing Cox regression coefficients for assigning a gene expression-based risk score to the patient.",
                        "Optionally, the method includes an additional step of designing a post-treatment care strategy based upon the computed one or more post-operative risk factors indicative of potential events.",
                        "According to a second aspect of the invention, there is provided a kit for use to implement a method pursuant to the first aspect of the invention.",
                        "According to a third aspect of the invention, there is provided a software product stored machine-readable data media, the software product being executable upon computing hardware for implementing a method pursuant to the first aspect of the invention.",
                        "It will be appreciated that features of the invention are susceptible to being combined in any combination without departing from the scope of the invention as defined by the appended claims.",
                        "In the accompanying diagrams, an underlined number is employed to represent an item over which the underlined number is positioned or an item to which the underlined number is adjacent. A non-underlined number relates to an item identified by a line linking the non-underlined number to the item. When a number is non-underlined and accompanied by an associated arrow, the non-underlined number is used to identify a general item at which the arrow is pointing."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce improved profiling method",
                        "describe testing kits",
                        "outline method steps",
                        "obtain patient parameters",
                        "obtain plaque tissue samples",
                        "isolate genetic material",
                        "determine genetic expression activities",
                        "compute post-operative risks",
                        "discuss advantages of method",
                        "introduce optional method variations"
                    ],
                    "num_characters": 5293,
                    "outline_medium": [
                        "introduce improved profiling method",
                        "describe testing kits",
                        "outline method steps",
                        "highlight advantages of method",
                        "mention optional implementations"
                    ],
                    "outline_short": [
                        "introduce improved profiling method",
                        "application of method"
                    ]
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS OF THE INVENTION",
                    "paragraphs": [
                        "It is potentially of considerable clinical interest to identify which patients have an excess risk of future events, e.g. in cardiovascular events, because it provides a first step in applying intensified preventative measures to assist the patients at excess risk to survive; it is thus an issue of life or death. Contemporarily considered risk factors, such as age, gender, smoking habits, diabetes status, hypercholesterolemia and hypertension are well documented and easily identifiable in practice by conducting simple tests on patients. However, it is desirable to improve associated method of assessing post-operative risk. The present invention is distinguished in that its methods involve obtaining, alternatively or additionally to aforementioned parameters of Equations 1 and 2 (Eq. 1 & Eq. 2), genotype and gene expression profiles from plaque material extracted during carotid endarterectomy. Optionally, blood samples obtained during carotid endarterectomy providing mononuclear cells are also subjected to genotype and gene expression profiling to provide additional information for guiding post-endarterectomy care of patients. However, as will be elucidated in further detail later, genetic analysis of multiple genes in plaque tissue provides most reliable indications of post-operative risk.",
                        "The methods of the present invention have been evolved from a sample of 126 patients who have undergone plaque tissue removal during carotid endarterectomy treatment, and 97 patients whose mononuclear blood cells were collected during endarterectomy treatment. The patients were followed for an average of 44 months during which 25 major adverse cardiovascular, cerebrovascular or vascular events (i.e. 18 ischemic strokes and 7 myocardial infarctions) were registered. Blinded “leave-one-out” cross-validation on Cox regression coefficients was used to assign a gene expression-based risk score to each patient in the study. It should be noted that the method of “leave-one-out” cross-validation is one of several methods which could be used to determine the risk factors. The person skilled in the art will be aware of other methods than “leave-one-out” cross-validation useful to perform the analysis as proposed in the following embodiments. When compared to risk factors computed using contemporary known methods, the method of the invention is capable of predicting future adverse post-operative events from an area-under-curve (AUC) basis by at least from 0.66 to 0.79, namely an improvement of 0.13 AUC units. It was found that information obtained from the carotid plaque was most reliable for improving accuracy of prediction of the risk. Better assessment of risk thus has an important benefit of potentially reducing patient mortality or injury through an improved treatment strategy for patients.",
                        "Methods of the invention will now be described in greater detail. The present invention was devised using materials supplied from the Karolinska Carotid Endarterectomy Biobank (BiKE) after all patients provided informed written consent, pursuant to the Declaration of Helsinki and the Karolinska Institute Ethics Committee (journal no. 02-147 and 2009/295-31/2). The study included 97 peripheral blood mononuclear cell (PBMC) samples and 126 atherosclerotic plaque tissue samples from Caucasian patients who were undergoing carotid endarterectomy at Karolinska University Hospital, Sweden. The PBMC and plaque samples had 97 common overlapping samples; in other words, the PBMC samples represented a subset of the plaque samples. An overview of the samples is provided in Tables 1 and 2:",
                        "Table 2 provides an indication of an “area under the curve” (AUC) at 300 days after a carotid endarterectomy operation being executed on the patients. The genotype score is based on a risk allele count in 25 previously published myocardial infarcation associated risk variants. The expression score is based on mRNA expression levels of a set of predictive genes associated with the studied plaque tissue. Classic risk scores in Table 2 are based upon known contemporary methods, namely are based upon a parameters indicative of age, gender, serum low-density lipoproteins (LDL) and smoking status. The combination score corresponds to an inclusion of all parameters in a multivariate model employed in methods pursuant to the present invention.",
                        "Methods pursuant to the present invention include a step of isolating total RNA from plaque samples and/or blood cell samples, for example by using a proprietary RNeasy Mini Kit manufactured by Qiagen; “RNeasy” is a trade mark of Qiagen. The isolated total RNA is then treated using a RNase-free DNase kit, also manufactured by Qiagen; “RNase” is a trade mark of Qiagen. A RNA sample thereby obtained is, pursuant to the present invention, then in a subsequent step analyzed for quality, for example using a proprietary Agilent 2100 bioanalyzer manufactured by Agilent Technologies Inc., Palo Alto, Calif.; RNA concentration pursuant to a step of the method is measured, for example using a NanoDrop apparatus manufactured by a company Thermo Scientific. The method thereby defines a threshold for RNA quality, such that RNA material not satisfying threshold criteria of quality is not used for determining risk and treatment strategies pursuant to the present invention. Such quality filtering is beneficially for improving reliability of methods pursuant to the present invention.",
                        "RNA samples pursuant to the present invention are thereafter hybridized and then scanned to determine their characteristics, for example at the Karolinska Institute Affymetrix core facility using Affymetrix HG-U133 plus 2.0 arrays. Resulting cel data files generated from such scanning, namely data collected from the arrays, are then processed, for using Robust Multichip Average (RMA) normalization, for example data processing functionality provided by execution of Affymetrix Power Tools 1.10.2 software on computing hardware, Beneficially, RMA normalization is performed using official Affymetrix chip definition files (CDFs) or custom CDF files. In the custom CDF file, a probe set corresponds to a gene, whereas in a standard CDF, there are 2.1 probe sets per gene. Beneficially, the custom CDF file is downloaded as a version 13.0.0 of HGU133Plus2_Hs_ENTREZG. As a part of RMA normalization, all expression measurements were log2-transformed. Low-expression probe sets whose average expression levels are less than a genome-wide median value for expression levels are omitted from analysis executed as a step of the method of the present invention; the measurements are thus subjected to an expression filter subject to a lower acceptable expression threshold, wherein the threshold is based upon a median expression exhibited by the genes in the sample.",
                        "The method of the invention involves a step of genotyping, wherein DNA samples, for example from the aforementioned BiKE patients, for example using proprietary Illumina Human 610W-Quad Beadarrays available at the SNP technology platform at Uppsala University. Beneficially, the method makes use of proprietary GenomeStudio (trade mark, TM) software purchasable from Illumina for use in genotype calling and quality control. When executing the method, it is practical to expect an average call rate per SNP of 99.84%. For example, the inventor found during development of the present invention that replication genotyping of 12 samples demonstrated an overall concordance of 99.99%. Of 29 SNPs, it was found that only 25 SNPs could be imputed to be of a satisfactory quality for use in determining proposed treatment strategy results from the method, namely Rsq-score >0.3, using a proprietary MACH algorithm. These SNPs investigated were rs10953541, rs11206510, rs1122608, rs11556924, rs12190287, rs12526453, rs12936587, rs1412444, rs17114036, rs17228212, rs1746048, rs17465637, rs17609940, rs216172, rs2505083, rs2943634, rs4380028, rs46522, rs4977574, rs579459, rs646776, rs6725887, rs6922269, rs964184, and rs974819 which had been found by other research groups.",
                        "Beneficially, the method involves comparing allele frequencies of risk SNPs with measured allele frequencies to ensure a more correct choice of risk allele. An overall genotype risk score is, pursuant to the method, computed as a sum of risk alleles for each patient. Further from the analysis performed it was seen that SNPs associated with early myocardial infarction add some predictive value through additional information on the risk of ischemic events in patients.",
                        "The method pursuant to the present invention beneficially employs a complete “leave-out-one” cross validation. For each iteration, all sample results from RNA analysis except a result from one analysis are used to select probe sets whose expression levels are predictive of future post-operative events. For each probe set, the cross validation is beneficially achieved using Cox regression calculation software. All probe sets preferably have a Cox regression significance of P<0.05 for predicting a risk score for the omitted sample. The risk score for the omitted sample is defined by Equation 3 (Eq. 3):",
                        "\\(\\begin{matrix}\n{{risk}_{i} = {\\sum\\limits_{j \\in A}^{j}{{coefficient}_{j} \\times \\left( {{expression}_{ji} - {expression}_{j}} \\right)}}} & {{Eq}.\\mspace{14mu} 3}\n\\end{matrix}\\)",
                        "wherein\n\n\n- - j=index identifying a probe set;\n  - A=a group of probe sets, for example with a Cox regression\n    significance P\\<0.05;\n  - coefficient=is a Cox coefficient of a probe set; and\n  - expression=is the probe set expression in the omitted sample; and\n  - expression_(j)=is a mean expression of the probe set in the\n    remaining samples.",
                        "The cross validation as an iterative procedure using Equation 3 (Eq. 3) is repeated until all samples have been assigned a risk score, based on gene selection and gene expression weights, namely selected independently of the expression profile in the sample. FIG. 1 illustrates steps of this analysis process beneficially used in the method of the invention.",
                        "Contemporary known risk markers, namely cross-validated gene expression risk scores, and the risk allele counts of genotypes are beneficially used as variables in the method of the present invention, for example as included in aforesaid Table 2. The proportional hazards assumption holds globally for all variables in both plaque and PBMC data sets. However, for specific variables, smoking may potentially violate the assumptions, generating a decreasing time-dependent effect. Pursuant to the present method, ROC curves are plotted, and areas under the curve (AUC) are calculated using, for example, a riskset ROC R-package software product.",
                        "The method of the invention may in an embodiment also utilize a characteristic of a gene expression profile that comprises multiple genes rather than a single gene expression is a more robust predictor of survivability, namely a risk indicator, for post-operative problems associated with carotid endarterectomy. E.g. a contemporary micro-array discovery in such an embodiment could be followed by, or replaced by, real-time PCR validation schemes used for determining individual gene expressions, the present invention would be concerned with methods of determining gene-wide expression associated with a multiplicity of genes, hence prompting adoption, for example, of leave-one-out cross-validation schemes as aforementioned.",
                        "In FIG. 1, steps of an algorithm are indicated generally by 10. The algorithm 10 includes a first step 20 of analyzing all samples, namely as aforementioned in respect of their total RNA content. Thereafter, from step 20, there are two parallel branches 30, 40. A first branch 30 includes a leave-one-out subset in a step 50 for providing a discovery set of samples. After the step 50 in the branch 30, a subsequent step 60 is concerned with identifying a set of genes A which are predicting survival at a Cox regression below a given threshold, for example a Cox regression factor P<0.05. After the step 60, the branch 30 includes a step 70 for computing an average expression of genes present in the gene set A. In the parallel branch 40, a step 80 is concerned with generating a validation sample i, wherein n=1. In a step 90 after the step 80 in the parallel branch 40, the step 90 is concerned with determining the expression of genes from the set A for n=1.",
                        "From the steps 70, 90 an iteration step 100 is implemented for computing multiplications by Cox-regression coefficients until all samples are considered for i. At a final step 120, a sum corresponding to a risk score for the validation sample i is computed. The computed risk score is then used for determining a most appropriate post-treatment care strategy for reducing a likelihood of post-treatment events'which could potentially cause patient injury or even death. The R-code for the scheme shown in FIG. 1 can be found in the Appendix as supplementary S3.",
                        "When implementing the algorithm in respect of samples obtained from the Karolinska University Hospital (BiKE), plaque gene expression profiles determined from a plurality of genes result in a risk score which differs significantly between patients with post-operative events after carotid endarterectomy, and those patients without such events. Thus, the method of the present invention is operable to identify patients potentially at risk of post-operative complications so that additional care activities can be undertaken to assist such patients at risk, for example in respect of administration of medication, retention in hospital facilities and so forth.",
                        "In FIG. 2, there is shown a series of graphs illustrating characteristic curves for different risk factors at 300 days post-operative to executing endarterectomy treatment. The analysis was also performed at 10 and 100 days, which results showed similar results to that seen at 300 days. Top plots, namely “expression score”, “age, gender, LDL and smoking”, “age, gender, LDL, smoking and expression score”, in FIG. 2 illustrate data from a plaque tissue data set. Bottom plots, namely from a “PBMC” data set, pertain correspondingly to peripheral blood monoculture cells data set. The plots are computed only from gene expression profiles (left), only for established risk factors including age, gender, LDL and smoking (left and middle), or from gene expression profiles and the four established risk factors (right). A straight diagonal line in each graph indicates a prediction from pure chance, wherein AUC=0.5. The curved lines in FIG. 2 denote a prediction which is possible with the predictive variables. For comparison, a curve following an upper left-hand periphery of the graphs would represent an excellent prediction of highly relevant post-treatment risk factor. It will be seen from FIG. 2 right-hand-side graphs that the present invention is capable of providing an improvement in prediction, particularly when gene analysis from collected plaque is employed, but potentially may not be capable of making a perfect prediction of risk. However, even a moderate increase in predictive performance can save patient lives.",
                        "FIG. 2 illustrates predictive power of three models: risk expression score only (left), contemporary risk factor profiling (middle), and a combination of conventional risk factor profiling and gene expression risk score (right). The right-hand-side graphs in FIG. 2 are illustrative of a method pursuant to the present invention. As illustrated in FIG. 2, plaque expression profiling predicts post-operative events more accurately than PBMC expression profiling. Thus, by using gene expression risk profiling in combination with contemporary known risk marker prediction, it is feasible to improve risk prediction of post-operative events occurring and is thereby capable of ensuring more appropriate treatment strategies based on the risk of post-operative events occurring.",
                        "The cross-validation risk-prediction score demonstrates the general utility of gene expression profile-based prediction. On account of cross-validation beneficially employed when implementing the present invention, the actual list of probe sets employed for profiling depends on the sample that is omitted. When developing practical embodiments of the present invention, on average, 192+/−38 probe sets were used to profile each leave-one-out iteration, see FIG. 1 for the iteration. The leave-one-out iteration approach was used to validate the method of the profiling of the plaque for prediction and can further be used to optimize different practical embodiments of the present invention depending on application. Moreover, 18.3% of the probe sets were present in more than 90% of the iterations, and 66.2% of the probe sets were present in less than 10% of the iterations. The 146 probe sets that were presented in more than 90% of the iterations are shown in Supplementary S1 in the Appendix pg. 18-19.",
                        "Tests made during development of the present invention identified that there are 146 genes which are best predictors of future post operative events after carotid endarterectomy has been implemented; optionally, the present invention involves the assessment of at least 100 most suitable genes. Of the genes quantities thereof were in the ranges of 10 to 30% range, more preferably in the range of 10 to 20% and most preferably substantially 13.2% are localized to cytoplasm, a range of 10 to 20%, more preferably in the range of 13% to 17% and most preferably substantially 14.9% are localized to plasma membranes, a range of 4 to 10%, more preferably in the range of 2% to 5%, and most preferably substantially 3.51% are localized to mitochondria, a range of 9% to 12.5% and more preferably substantially 11.4% are localized in the nucleus according to a cellular compartment library provided by Gene Ontology. This result clearly indicates that algorithms based upon characterization of individual gene expressions will not yield as reliable results as provided by the present invention which takes into consideration expression of a set of mutually different genes, most beneficially derived from plaque samples obtained when performing carotid endarterectomy.",
                        "According to the present invention, a method of using gene expression profiles from carotid endarterectomy samples is capable of providing an improved risk projection of future post-operative events. Such events have implications for clinical care required for patients, for example for identifying high risk patients who need an enhanced degree of care, for example aggressive risk factor interventions. For very high risk patients identified using the method of the present invention, there is an indication of advanced progress-rate of atherosclerosis and an individualized tailored pharmacological treatment is beneficially employed to avoid occurrence of secondary ischemic events. Such tailored treatment can include one or more of: medication for blood pressure regulation, blood thinning agents, cholesterol controlling medications (for example lipid lowering therapy), barometric treatment, exercise regimes (for example weight control), optimal diabetes treatment, smoking cessation and so forth. Further to the treatment, patients with higher risk factors than others beneficially return back to the physician/ambulatory clinic regularly, for example once every second week instead of once every second month as is often the case today. However, these patients might have to tolerate more side-effects of the medication and so forth.",
                        "According to methods pursuant to the present invention present invention, it is highly beneficial to use several genes in a combination profile, rather than focusing on individual genes. Plaque tissue dissected during a carotid endarterectomy treatment provides much better expression-based prediction of post-treatment events than predictable from circulating blood cells. When verifying benefits provided by methods of the invention, results were based on gene expression profiles in 126 patients who experienced 25 ischemic events. All gene selections and risk score calculations are beneficially performed in a blinded cross-validation iteration and therefore constitute a single risk score variable in prediction computations as illustrated in FIG. 2.",
                        "The present invention also concerns a kit for performing methods pursuant to the invention. The kit includes apparatus necessary for analyzing plaque tissue, for measuring gene expression of a plurality of genes present in the plaque sample and generating corresponding measurement data, and computer software products executable on computing hardware for receiving the measurement data, processing the data and providing an overall assessment of risk factor associated with post-operative events after carotid endarterectomy treatment. Optionally, the risk factor is linked to a computer-based expert system which proposes a preferred course of post-operative care which reduces a risk of patient degradation or mortality. The kit optionally includes one or more items of contemporary proprietary apparatus described in the foregoing or equivalently functional apparatus.",
                        "Modifications to embodiments of the invention described in the foregoing are possible without departing from the scope of the invention as defined by the accompanying claims. For example, the present invention is beneficially used for the profiling of all arteries in case of surgery/endarterectomy. Further plaques obtained from vascular surgery/endarterectomy surgery on e.g. iliaca arteries, femoral arteries, coronary arteries and/or internal mammary arteries would also benefit from the embodiments described. In vascular surgery of peripheral arteries, coronary arteries, carotid arteries and the genetic profile of each and every sample obtained provides information about atherosclerosis progress. This provides one or more risk factors from arteries retrieved through surgery and providing valuable information on the progress-rate of atherosclerosis.",
                        "Expressions such as “including”, “comprising”, “incorporating”, “consisting of”, “have”, “is” used to describe and claim the present invention are intended to be construed in a non-exclusive manner, namely allowing for items, components or elements not explicitly described also to be present. Reference to the singular is also to be construed to relate to the plural. Numerals included within parentheses in the accompanying claims are intended to assist understanding of the claims and should not be construed in any way to limit subject matter claimed by these claims.",
                        "Appendix: Example of Analysis",
                        "Prediction of ischemic events based on transcriptomic and genomic profiling in patients undergoing carotid endarterectomy",
                        "S1) Predictive Genes from Standard CDF",
                        "Probe sets that were present in more than 90% of the leave-one-out iterations. This expression signature represents the genes with the best predictive properties in this data set. Pg. 18-19",
                        "S2) Predictive Genes from Custom CDF",
                        "Probe sets that were present in more than 90% of the leave-one-out iterations when using alternative annotation from custom CDF files as described in the main text. The purpose of this investigation was to ensure that predictive power did not arise from annotation artifacts. Pg. 20",
                        "S3) R-Code for Calculating Expression Risk Scores",
                        "Given a bioconductor ExpressionSet and a text file with survival data, this script will calculate the expression risk score as described in the main text. The purpose of including this script is to give the complete details of the steps taken in the cross-validation procedure. Pg. 21-24"
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate clinical interest in identifying patients at excess risk of future events",
                        "introduce contemporary risk factors",
                        "describe limitations of contemporary risk factors",
                        "introduce method of assessing post-operative risk using genotype and gene expression profiles",
                        "describe sample of 126 patients who underwent plaque tissue removal",
                        "describe follow-up period and registered events",
                        "introduce \"leave-one-out\" cross-validation method",
                        "describe assignment of gene expression-based risk score to each patient",
                        "compare risk factors computed using contemporary known methods",
                        "describe improvement in prediction of future adverse post-operative events",
                        "motivate use of carotid plaque for improving accuracy of prediction",
                        "describe benefit of better assessment of risk",
                        "introduce methods of the invention in greater detail",
                        "describe materials supplied from the Karolinska Carotid Endarterectomy Biobank (BiKE)",
                        "describe study inclusion criteria",
                        "describe PBMC and plaque samples",
                        "provide overview of samples in Tables 1 and 2",
                        "describe genotype score and expression score",
                        "describe classic risk scores",
                        "describe combination score",
                        "introduce step of isolating total RNA from plaque samples and/or blood cell samples",
                        "describe treatment of isolated total RNA",
                        "describe analysis of RNA quality",
                        "describe hybridization and scanning of RNA samples",
                        "describe processing of resulting cel data files",
                        "describe RMA normalization",
                        "describe custom CDF file",
                        "describe expression filter",
                        "introduce step of genotyping",
                        "describe DNA samples and genotyping method",
                        "describe genotype calling and quality control",
                        "describe replication genotyping",
                        "describe imputation of SNPs",
                        "describe comparison of allele frequencies",
                        "describe computation of overall genotype risk score",
                        "describe \"leave-out-one\" cross validation",
                        "describe Cox regression calculation",
                        "describe risk score computation",
                        "describe iteration of cross validation",
                        "describe final step of computing risk score",
                        "describe use of risk score for determining post-treatment care strategy",
                        "describe contemporary known risk markers",
                        "describe plotting of ROC curves and calculation of AUC",
                        "describe characteristic of gene expression profile as a robust predictor of survivability",
                        "describe algorithm for determining gene-wide expression",
                        "describe steps of algorithm in FIG. 1",
                        "describe use of method for identifying patients at risk of post-operative complications"
                    ],
                    "num_characters": 23662,
                    "outline_medium": [
                        "motivate clinical interest in identifying patients at excess risk of future events",
                        "introduce contemporary risk factors",
                        "describe limitations of contemporary risk factors",
                        "introduce method of assessing post-operative risk using genotype and gene expression profiles",
                        "describe sample collection and patient follow-up",
                        "describe \"leave-one-out\" cross-validation method",
                        "compare risk factors computed using contemporary known methods",
                        "describe improvement in prediction of future adverse post-operative events",
                        "describe benefits of using carotid plaque tissue",
                        "describe RNA isolation and quality control",
                        "describe RNA hybridization and scanning",
                        "describe data processing and RMA normalization",
                        "describe expression filter and lower acceptable expression threshold",
                        "describe genotyping and genotype calling",
                        "describe quality control and concordance of genotype calling",
                        "describe selection of predictive genes using Cox regression",
                        "describe calculation of risk score using Equation 3",
                        "describe iterative procedure using Equation 3",
                        "describe use of ROC curves and areas under the curve (AUC)",
                        "describe method of determining gene-wide expression associated with multiple genes",
                        "describe algorithm for analyzing samples and computing risk scores",
                        "describe results of analysis and predictive power of method",
                        "describe potential applications and modifications of the invention"
                    ],
                    "outline_short": [
                        "motivate need for improved post-operative risk assessment",
                        "introduce method of assessing post-operative risk using genotype and gene expression profiles",
                        "describe sample collection and processing",
                        "outline RNA analysis and quality control",
                        "detail genotyping and genotype risk score calculation",
                        "describe cross-validation procedure for selecting predictive genes",
                        "outline calculation of risk score using Cox regression",
                        "discuss results of method, including improved predictive power",
                        "illustrate predictive power of method using ROC curves",
                        "describe potential applications of method in clinical care",
                        "outline kit for performing method, including apparatus and software"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of profiling endarterectomy patients for determining one or more post-operative risks, characterized in that said method includes:\n(a) obtaining a set of parameters which describe the patient, said set of parameters including at least one of: age of patient, E; smoking habits of patient, S; serum cholesterol concentration of patient, C; diabetes status of patient, D; blood pressure of patient, P;\n(b) obtaining one or more samples of plaque tissue from endarterectomy treatment of said patient;\n(c) isolating genetic material from said one or more samples of plaque tissue;\n(d) determining genetic expression activities of a plurality of genes identified in said genetic material; and\n(e) computing from said set of parameters in combination with said genetic expression activities one or more post-operative risks indicative of potential events to which the patient is susceptible as a consequence of said endarterectomy treatment.",
        "2. A method as claimed in claim 1, wherein said isolated genetic material corresponds to a total RNA content of said one or more samples of plaque tissue.",
        "3. A method as claimed in claim 1, wherein said profiling endarterectomy is performed for carotid enartecectomy, and wherein step (b) when obtaining one or more samples of plaque tissue it is from carotid endarterectomy treatment of said patient.",
        "4. A method as claimed in claim 1, wherein a step (e) includes excluding from computation of the one or more risks gene expressions which lie below a threshold expression limit.",
        "5. A method as claimed in claim 4, wherein said threshold expression limit is determined from an average expression exhibited by a plurality of genes obtained from said one or more samples of plaque tissue.",
        "6. A method as claimed in claim 3, wherein said method includes excluding from computation of the one or more risks RNA material whose RNA purity is less than a purity threshold limit.",
        "7. A method as claimed in claim 1, wherein, in a step (e), a blinded cross-validation iterative computation is performed for computing said one or more risks.",
        "8. A method as claimed in claim 1, wherein said plurality of genes are derived from cytoplasm, plasma membranes and mitochondria included in said one or more samples of plaque tissue.",
        "9. A method as claimed in claim 8, wherein the genetic material includes a set of genes, wherein substantially 13.2% of the genes are localized to cytoplasm.",
        "10. A method as claimed in claim 1, wherein a step (e) of the method involves computing Cox regression coefficients for assigning a gene expression-based risk score to said patient.",
        "11. A method as claimed in claim 1, including an additional step of designing a post-treatment care strategy based upon said computed one or more post-operative risks indicative of potential events.",
        "12. A kit for use to implement a method as claimed in claim 1.",
        "13. A software product stored machine-readable data media, said software product being executable upon computing hardware for implementing a method as claimed in claim 1."
    ]
}