{
    "id": "US20170360820",
    "authors": [
        "Andrew P. Capaldi",
        "James E. Hughes Hallett"
    ],
    "title": "METHODS AND COMPOSITIONS FOR TREATING EUKARYOTIC INFECTIONS VIA ALTERING AGGREGATION DYNAMICS OF RAPTOR/KOG1",
    "date": "2015-12-18 00:00:00",
    "abstract": "Methods and compositions for activating TORC1 aggregate formation in a fungi or a parasite, wherein TORC1 aggregate formation inhibits growth of the fungi or parasite. TORC1 aggregate formation may be activated using small molecules or other agents, and said agents may be used to treat or prevent a disease or condition associated with the fungi and parasite. The agent may target Kog1 of TORC1, e.g., the agent may directly or indirectly inhibit Kog1 leading to aggregation of the TORC1 complex.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to systems, methods, and compositions for treating or preventing diseases associated with eukaryotic organisms, more particularly to methods and compositions for directly or indirectly triggering and/or permitting, or inhibiting Raptor/Kog1 aggregation in specific eukaryotes."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 306,
                    "outline_medium": [
                        "define field of invention"
                    ],
                    "outline_short": [
                        "define field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "TOR Pathway",
                            "paragraphs": [
                                "The TOR Kinase (known as “mTOR” in mammals), as part of TOR Complex I (TORC1; or mTORC1 in mammals) controls cell growth and metabolism in all eukaryotes (See FIG. 1). When nutrient and growth factor levels are high, the TOR kinase is active, and drives growth by promoting anabolic processes such as protein synthesis and by inhibiting catabolic processes, such as autophagy. In contrast, when nutrient or growth factor levels are low, or cells are exposed to stress, TOR signaling is inhibited. As a result, mass accumulation is limited and catabolic and stress response pathways are up-regulated. If strong TOR inhibition persists, cells enter a quiescent state.",
                                "Growth regulation by the TOR kinase depends on its participation in the multi-protein complex TORC1 (FIG. 1a). Once activated, TORC1 affects cell growth through numerous downstream regulators. In S. cerevisiae, where TOR output is best understood, TORC1 acts on, and through, two well characterized effectors: (1) Sch9, an S6 kinase that coordinates protein synthesis through regulation of RNA polymerases I and III, ribosome synthesis and biogenesis, and protein translation and (2) TAP42, a regulatory subunit of protein phosphatase 2A (PP2A), that controls metabolic and stress responses (FIG. 1b). TORC1 also acts through Sfp1, a transcription factor that regulates ribosome synthesis, and the kinase Yak1 (FIG. 1b). The overall structure, and the molecular makeup of TORC1 and the TOR pathway are similar in humans and other eukaryotes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce TOR pathway",
                                "describe TORC1 function",
                                "outline downstream regulators"
                            ],
                            "num_characters": 1508,
                            "outline_medium": [
                                "describe TOR pathway"
                            ],
                            "outline_short": [
                                "describe TOR pathway"
                            ]
                        },
                        {
                            "title": "TORC1 Regulation",
                            "paragraphs": [
                                "Progress has been made towards identifying the pathways and mechanisms underlying TORC1 regulation. It has been shown that the TSC1 and 2 tumor suppressor proteins (which are absent in yeast) act to transmit signals from insulin, epidermal growth factor (EGF), AMP dependent kinase (AMPK), and other pathways, to TORC1. More recently, it was found that AMPK also regulates TORC1 activity independently of TSC1/2, by phosphorylating Kog1/Raptor (FIG. 1a) directly at two sites, one of which is conserved across eukaryotes. This activity ensures that cell growth is limited as cellular energy levels wane. Finally, a family of Ras related GTP binding proteins (Rag proteins) have been found to regulate TOR activity in response to amino acid availability, through direct binding to TORC1, in both yeast and human cells.",
                                "Stress also influences TOR pathway activity, although it is unclear whether this is due to direct regulation of TORC1 or regulation of one or a few downstream components of the TOR pathway. The pathways involved in stress dependent TOR regulation are also unknown. In human cells, it has been shown that osmotic stress leads to a rapid decrease in phosphorylation of S6 kinase 1 (S6K1) and 4EBP-1, resulting in reduced protein translation. These affects are independent of TSC1/2 and thus the underlying mechanism may be conserved in yeast. Down regulation of S6K1 activity has also been found in human cells in mechanical, ultraviolet radiation, and heat stress. In S. cerevisiae, similar effects have been seen. Most strikingly, osmotic, heat, and oxidative stress trigger a rapid decrease in Sch9 (the yeast S6K1) phosphorylation at the TORC1 target sites. These same stresses also cause the TORC1 regulated transcription factor Sfp1 to be exported from the nucleus."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "discuss TSC1 and 2 tumor suppressor proteins",
                                "describe AMPK regulation of TORC1",
                                "mention Rag proteins regulation of TOR activity"
                            ],
                            "num_characters": 1788,
                            "outline_medium": [
                                "discuss TORC1 regulation"
                            ],
                            "outline_short": [
                                "discuss TORC1 regulation"
                            ]
                        },
                        {
                            "title": "TOR Pathway Regulation in Salt Stress",
                            "paragraphs": [
                                "Previous studies of TOR pathway signaling in stress have been limited to measuring phosphorylation of a single substrate, Sch9. As a result it was not clear whether stress signals inhibit TORC1 activity directly or simply act on one or two TORC1 targets proteins. To help distinguish between these possibilities, the complete output of TORC1 pathway in osmotic stress was measured using DNA microarrays. To do this, the cellular response was monitored with and without the potent TORC1 inhibitor rapamycin in 0.4M KCl and three control conditions: amino acid starvation, nitrogen starvation and log growth conditions. As shown in FIG. 2, rapamycin treatment of rapidly growing cells, where TORC1 is active, led to widespread and dramatic reprogramming of gene expression (FIG. 2a). However, in KCl stress and starvation conditions, rapamycin had almost no influence on gene expression (FIG. 2a). These results suggest that TORC1 is inhibited in stress (as shown previously in starvation conditions) so that rapamycin has no additional effect.",
                                "Consistent with the hypothesis that TORC1 activity is inhibited in stress, genes involved in ribosome synthesis, biogenesis and tRNA synthesis are down-regulated in KCl to a level at or near that found in rapamycin (FIG. 2a, columns 1 and 5). This is not just due to down-regulation of Sch9 activity (which does occur, FIG. 2b) as blocking the activity or regulation of this kinase has a relatively small effect on ribosome protein and biogenesis gene expression (2-fold versus >20-fold in KCl stress). Thus, it could be concluded that TORC1 stops phosphorylating and activating all (or most) of the regulators in the Sch9 branch (blue/purple, FIG. 1b) of the TOR pathway (Sch9, Sfp1, Yak1 and likely others) in stress.",
                                "It was also found that the output of TORC1 pathway is different in salt stress than in rapamycin. Specifically, while both stimuli cause down-regulation of ribosome genes, only rapamycin triggers activation of the carbonic acid, amino acid and nitrogen metabolic pathways (FIG. 2a). These metabolic pathways are targets of TORC1 via TAP42/PP2A and the transcription factors Gat1, Gln3, Rtg1/3 (FIG. 1b). This data shows that salt stress inhibits growth by blocking activation of the Sch9 branch of the TOR pathway, but does not trigger TORC1 dependent reprogramming of metabolism through PP2A. This metabolic reprogramming is also known to occur due to TORC1 inhibition in starvation conditions. Therefore, these results suggest that the output of the TOR pathway is stimuli specific. This has important implications for future studies examining the role TOR pathway in cell growth and metabolism and in drug development.",
                                "An interpretation of the microarray data is that stress alters the conformation of TORC1 such that phosporylation of the Sch9 branch of the pathway, but not Tap42-PP2A, is blocked and the allosteric inhibitor rapamycin-Fpr1 (rapamycin-Fkb12 in mammals) can no longer bind/repress TORC1. Alternatively, TORC1 activity may be completely inhibited in stress, so that addition of rapamycin has no further effect, but an additional modification to the Tap42/PP2A complex keeps it from being activated by dephosphorylation at the TORC1 target sites. Models that do not include direct regulation of TORC1 in stress are also possible, but they may have to invoke a stress specific modification to the Tap42-PP2A branch of the pathway that has no affect on gene expression (as these genes are not regulated by stress) but blocks activation of the pathway by rapamycin.",
                                "In osmotic stress, Hog1/p38, the terminal kinase in the HOG pathway, is known to regulate many aspects of the stress response including transcription, chromatin remodeling, cell cycle check-points, and ion and glycerol channel regulation. Therefore, it was tested whether Hog1/p38 plays a role transmitting stress signals to TORC1 by comparing expression in hog1Δ and wild-type cells both with and without rapamycin (e.g., with and without TORC1 activity) using DNA microarrays. These analyses revealed that Hog1 does in fact repress TORC1 in salt stress conditions. This repression is manifest as approximately 3-fold less ribosome gene repression in hog1Δ than wild-type cells in 0.4M KCl (FIG. 2c, column 5). The hog1Δ strain is also far more sensitive to rapamycin in salt stress that the wild-type strain (4 fold more repression in hog1Δ than wt, FIG. 2c), indicating that TORC1 is partially active in stress in the absence of Hog1.",
                                "TOR pathway activity was measured in the hog1Δ strain by following TORC1 dependent phosphorylation of Sch9 (FIG. 2d). Consistent with the microarray results, 40% more phosphorylation was found at the six TORC1 dependent C-terminal sites (after 10 min) in KCl stress when Hog1 is deleted (FIG. 2d).",
                                "Together, this data shows that the MAPK Hog1/p38, plays a role in repressing TORC1 signaling through Sch9, and possibly other regulators in the Sch9 branch of the pathway, in salt stress conditions."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce salt stress study",
                                "describe microarray analysis",
                                "discuss rapamycin treatment",
                                "analyze gene expression data",
                                "conclude TORC1 inhibition in stress",
                                "discuss metabolic reprogramming",
                                "interpret microarray data",
                                "test Hog1/p38 role in stress",
                                "analyze Hog1/p38 regulation of TORC1"
                            ],
                            "num_characters": 4985,
                            "outline_medium": [
                                "describe TOR pathway regulation in salt stress",
                                "present microarray data",
                                "analyze microarray data",
                                "discuss implications of microarray data"
                            ],
                            "outline_short": [
                                "describe TOR pathway regulation in salt stress",
                                "analyze microarray data"
                            ]
                        },
                        {
                            "title": "TORC1 and Kog1",
                            "paragraphs": [
                                "It was recently discovered that glucose and energy control the total amount of TORC1 activity in each cell in budding yeast (see Hughes Hallett, Luo, and Capaldi, 2014, the disclosure of which is incorporated in its entirety herein by reference). Glucose and energy levels control TORC1 activity via AMP activated protein kinase (AMPK or Snf1). When adequate energy levels are present, Snf1/AMPK is inactive and TORC1 is localized to the vacuolar (lysosomal) membrane, where it interacts with activator proteins such as the Rags and Rho1. Under stress, e.g., when glucose/energy levels fall, Snf1/AMPK is activated, leading to TORC1 inhibition.",
                                "When this happens, the key regulatory component of TORC1, known as Kog1 in yeast (Raptor in humans), relocalizes and aggregates in each cell (see FIG. 3a). Examination of the Kog1 peptide sequence revealed two glutamine repeat sequences. Glutamine rich sequences are predicted to drive assembly of the protein into a prion-like aggregate (see FIG. 4). Mutating either glutamine repeat region reduces the formation of the aggregates (Kog1 bodies) (see FIG. 3b). Mutants that cannot form Kog1 bodies activate the TORC1 complex following starvation more quickly than wild type cells (see FIG. 5). In other words, sequestration of Kog1 bodies helps cells remain in a state with TORC1/Sch9 inhibited until the cell experiences ideal conditions for an extend time. Without the Kog1 bodies, TORC1 is immediately activated even after long periods of starvation; this makes the cell more susceptible to stress (including drug treatment) and subsequent starvation.",
                                "Alternatively, mutants or drug treatments driving the aggregation of Kog1 would inhibit the growth and replication of these cells via inhibition of the TORC1 pathway.",
                                "Examination of Kog1/Raptor in other organisms reveals that many microbes, including pathogenic fungi and worms, e.g., parasites, also have glutamine repeats, suggesting that formation of Kog1 aggregates is a common strategy used to survive long-term stress and starvation. However, the mammalian and plant forms of Kog1 (i.e., Raptor) do not contain glutamine repeats or prion-like domains. Therefore compositions, agents, or drugs that either block or trigger/permit Kog1 aggregation may help fight infections in humans, animals, and plants.",
                                "A model using a tagged Kog1 (e.g., Kog1-YFP (Yellow Fluorescent Protein) (e.g., YFP-tagged Kog1) or other appropriate tags, e.g., green fluorescent protein, red fluorescent protein, quantum dots, immunohistochemistry agents, etc.) may be used to screen for these drugs. In addition, other genetic regulators or other components involved in the pathways may be discovered, which may provide additional targets for drugs."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Kog1/Raptor",
                                "describe glucose and energy control of TORC1",
                                "discuss Kog1 aggregation",
                                "analyze Kog1 mutants",
                                "discuss implications for disease treatment"
                            ],
                            "num_characters": 2733,
                            "outline_medium": [
                                "describe Kog1/Raptor and TORC1",
                                "discuss role of Kog1/Raptor in TORC1 regulation"
                            ],
                            "outline_short": [
                                "discuss Kog1 aggregation"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention features methods (and compositions) for inhibiting fungal or parasitic survival or replication (e.g., in an animal, plant, in vitro, etc.) in a subject in need thereof. In some embodiments, the method comprises introducing to a cell, an animal, or a plant an agent that activates TORC1 aggregate formation, wherein the TORC1 aggregate formation inhibits growth of the fungi or parasite. In some embodiments, the subject has been identified as having a condition associated with a fungi or parasite.",
                        "The present invention also features methods (and compositions) for treating or preventing a disease or a condition associated with a fungi or a parasite. In some embodiments, the method comprising administering to a subject (in need thereof) an agent that activates TORC1 aggregate formation, wherein the TORC1 aggregate formation inhibits growth of the fungi or parasite. In some embodiments, the subject includes a human, an animal, or a plant. In some embodiments, the subject has been identified as having a disease or condition associated with a fungi or parasite.",
                        "In some embodiments, the agent that activates TORC1 aggregate formation targets Kog1 of TORC1. In some embodiments, the agent binds to Kog1. In some embodiments, the agent inhibits Kog1 indirectly. In some embodiments, the disease or condition associated with the fungi or the parasites is parasitic worms, malaria, leishmaniasis, giardia infection, or a candidiasis infection.",
                        "In some embodiments, the agent comprises a small molecule. In some embodiments, the small molecule comprises metformin, PT 1, salicylsalicylic acid, Phenformin, AICAR, A-769662, Acadesine, orsomorphin, 1,1-Dimethylbiguanide hydrochloride, or BML-275. In some embodiments, the agent comprises an antibody or a fragment thereof. In some embodiments, the antibody or fragment thereof is monoclonal or polyclonal, nanobody. In some embodiments, the parasite is selected from the group consisting of Helminths, Plasmodium, Leishmania, and Giardia.",
                        "In some embodiments, the method further comprises co-treating the subject with an antifungal drug or an anti-parasitic drug.",
                        "The present invention also features methods for screening in vitro for a compound that activates TORC1 aggregate formation. In some embodiments, the method comprises introducing a test compound to a first cell system and a second cell system, the first cell system comprising test cells expressing Kog1 labeled with a tag, the second cell system comprising control cells expressing Kog1 labeled with a tag; subjecting the cell systems to a stress; visualizing the tags of the cell systems; and calculating the amount of Kog1 aggregates formed in the cell systems by calculating the number of foci of the tags, wherein if the amount of Kog1 aggregates formed is more in the first cell system than in the second cell system, the compound activates TORC1 aggregate formation. In some embodiments, the tag comprises a fluorescent protein. In some embodiments, the tag comprises YFP, GFP, or RFP. In some embodiments, the stress comprises glucose starvation.",
                        "See also Hughes Hallet et al., Snf1/AMPK promotes the formation of Kog1/Raptor-bodies to increase the activation threshold of TORC1 in budding yeast (2015) Elife 6:4, the disclosure of which is incorporated herein in its entirety.",
                        "Any feature or combination of features described herein are included within the scope of the present invention provided that the features included in any such combination are not mutually inconsistent as will be apparent from the context, this specification, and the knowledge of one of ordinary skill in the art. Additional advantages and aspects of the present invention are apparent in the following detailed description and claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for inhibiting fungal or parasitic survival",
                        "describe agent that activates TORC1 aggregate formation",
                        "outline method for treating or preventing disease",
                        "discuss targeting Kog1",
                        "describe agent binding to Kog1",
                        "list diseases or conditions associated with fungi or parasites",
                        "discuss co-treating with antifungal or anti-parasitic drugs"
                    ],
                    "num_characters": 3764,
                    "outline_medium": [
                        "introduce methods for inhibiting fungal or parasitic survival",
                        "describe methods for treating or preventing diseases associated with fungi or parasites",
                        "outline features of the invention"
                    ],
                    "outline_short": [
                        "summarize invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "Referring now to FIG. 1-12, the present invention features methods and compositions or agents for treating or preventing diseases or conditions associated with eukaryotic organisms, e.g., fungi, parasites. Without wishing to limit the present invention to any theory or mechanism, the methods of the present invention may feature (a) directly or indirectly triggering/permitting Kog1 aggregation so as to inhibit TOR1 function, (b) directly or indirectly inhibiting Kog1 formation, or (c) another appropriate mechanism. The present invention also features methods for screening for such compositions or agents. The compositions may be used to directly or indirectly trigger/permit Kog1 aggregation to inhibit TORC1 function, or to inhibit Kog1 aggregation rendering the cells more susceptible to stress and starvation. The compositions may be used alone or in combination with other drugs/treatments to fight infection. Without wishing to limit the present invention to any theory or mechanism, it is believed that because the features of the signaling pathway that is the functional basis for these compositions (e.g., Kog1 aggregation determinants) is not present in human cells, it is expected that these compositions may have a low side effect profile and may be safe to use in conjunction with existing treatments.",
                        "Non-limiting examples of human diseases caused by eukaryotes include fungal infections (e.g. diseases caused by candida albicans, candida glabrata and other species) and parasitic diseases (e.g., diseases caused by helminths (parasitic worms), diseases caused by protozoans such as Plasmodium (e.g., malaria), diseases caused by Leishmania (e.g., leishmaniasis), giardia, etc.).",
                        "Non-limiting examples of other formulations that may be used in combination with compositions of the present invention include but are not limited to azoles, echinocandins and polyenes. Azole antifungals include but are not limited to fluconazole (Diflucan), itraconazole (Sporanox, Sporanox PulsePak), clotrimazole (Mycelex Troche), ketoconazole (Nizoral), posaconazole (Noxafil), voriconazole (Vfend), butoconazole (Femstat, Femstat 3, Gynazole-1) efinaconazole (Jublia), luliconazole 1% cream (Luzu), econazole, miconazole, oxiconazole, sulconazole, terconazole and tioconazole. Echinocandins include but are not limited to Caspofungin (Cancidas), anidulafungin (Eraxis) and micafungin (Mycamine). Polyenes include but are not limited to AMB lipid complex (Abelcet), AMB liposomal (AmBisome), AMB cholesteryl sulfate (Amphotec), nystatin (Bio-Statin, Mycostatin, Mycostatin Pastilles), AMB (Fungizone) and pimaricin. Allylamines include but are not limited to Amorolfine, Butenafine, Naftifine and Terbinafine (Lamisil). Other antifungals include but are not limited to Griseofulvin (Fulvicin U/F, Gris-Peg, Fulvicin P/G, Grifulvin V, Grisactin 250, Grisactin 500, Grisactin Ultra), flucytosine (Ancobon), ciprofloxacin 0.3%+dexamethasone 0.1% (Ciprodex), sertaconazole nitrate (Eratczo), ciclopirox (Loprox), Pentamidine isethionate (Nebupent, pentacarinat, pentam), haloprogin, tolnaftate and undecylenate. Other antifungal therapeutics include but are not limited to chitan synthase inhibitors, and drugs that disrupt mitotic spindle (e.g., griseofulvin).",
                        "The present invention features methods and systems (e.g., compositions) for treating or preventing a disease or a condition associated with a fungus/yeast or a parasite (e.g., in an animal such as a human or other animal). Or the methods and systems may inhibit fungal or parasitic survival or replication in an animal or a plant, or the methods and systems may inhibit fungal or parasitic survival or replication in vitro. In some embodiments, the method comprises administering to an animal, e.g., a human, mouse, rat, fish, etc.), or a plant or other appropriate system, an agent that sensitizes the TORC1 pathway to stress/starvation/treatment via inhibition of Kog1 aggregate formation or inhibits the TORC1 pathway (and growth) by triggering Kog1 aggregate formation.",
                        "In some embodiments, the agent comprises a small molecule. Small molecules may include but are not limited to AMPK activators and repressors such as metformin, PT 1, salicylsalicylic acid, Phenformin, AICAR, A-769662, Acadesine, orsomorphin, 1,1-Dimethylbiguanide hydrochloride, BML-275, etc. In some embodiments, the agent binds to Kog1 to inhibit Kog1/TORC1 function. In some embodiments, the agent inhibits Kog1 or Kog1 aggregate formation indirectly. For example, in some embodiments, the agent functions to hyperactive Snf1. In some embodiments, the agent functions to inactivate Snf1.",
                        "In some embodiments, the dose of metformin is from 50 mg to 5 g. In some embodiments, the dose of metformin is from 0.1 mg to 10 g. In some embodiments, the dose of metformin is from 1 mg to 100 mg. In some embodiments, the dose of metformin is from 100 mg to 2 g.",
                        "In some embodiments, the dose of phenformin is from 50 mg to 5 g. In some embodiments, the dose of phenformin is from 0.1 mg to 10 g. In some embodiments, the dose of phenformin is from 1 mg to 100 mg. In some embodiments, the dose of phenformin is from 100 mg to 2 g.",
                        "In some embodiments, the dose of PT1 is from 50 mg to 5 g. In some embodiments, the dose of PT1 is from 0.1 mg to 10 g. In some embodiments, the dose of PT1 is from 1 mg to 100 mg. In some embodiments, the dose of PT1 is from 100 mg to 2 g.",
                        "In some embodiments, the dose of salicylsalicylic acid is from 50 mg to 5 g. In some embodiments, the dose of salicylsalicylic acid is from 0.1 mg to 10 g. In some embodiments, the dose of salicylsalicylic acid is from 1 mg to 100 mg. In some embodiments, the dose of salicylsalicylic acid is from 100 mg to 2 g.",
                        "In some embodiments, the dose of AICAR is from 50 mg to 5 g. In some embodiments, the dose of AICAR is from 0.1 mg to 10 g. In some embodiments, the dose of AICAR is from 1 mg to 100 mg. In some embodiments, the dose of AICAR is from 100 mg to 2 g.",
                        "In some embodiments, the dose of A-769662 is from 50 mg to 5 g. In some embodiments, the dose of A-769662 is from 0.1 mg to 10 g. In some embodiments, the dose of A-769662 is from 1 mg to 100 mg. In some embodiments, the dose of A-769662 is from 100 mg to 2 g.",
                        "In some embodiments, the dose of Acadesine is from 50 mg to 5 g. In some embodiments, the dose of Acadesine is from 0.1 mg to 10 g. In some embodiments, the dose of Acadesine is from 1 mg to 100 mg. In some embodiments, the dose of Acadesine is from 100 mg to 2 g.",
                        "In some embodiments, the dose of 1,1-Dimethylbiguanide hydrochloride is from 50 mg to 5 g. In some embodiments, the dose of 1,1-Dimethylbiguanide hydrochloride is from 0.1 mg to 10 g. In some embodiments, the dose of 1,1-Dimethylbiguanide hydrochloride is from 1 mg to 100 mg. In some embodiments, the dose of 1,1-Dimethylbiguanide hydrochloride is from 100 mg to 2 g.",
                        "In some embodiments, the dose of BML-275 is from 50 mg to 5 g. In some embodiments, the dose of BML-275 is from 0.1 mg to 10 g. In some embodiments, the dose of BML-275 is from 1 mg to 100 mg. In some embodiments, the dose of BML-275 is from 100 mg to 2 g.",
                        "In some embodiments, the dose of orsomorphin is from 50 mg to 5 g. In some embodiments, the dose of orsomorphin is from 0.1 mg to 10 g. In some embodiments, the dose of orsomorphin is from 1 mg to 100 mg. In some embodiments, the dose of orsomorphin is from 100 mg to 2 g.",
                        "In some embodiments, the agent comprises an antibody or a fragment thereof (e.g., monoclonal, polyclonal antibody/fragment, etc.). The present invention is not limited to the aforementioned agents (e.g., small molecules, drugs, antibodies or antibody fragments).",
                        "In some embodiments, the agent comprises a polypeptide adapted to prevent Kog1 aggregate formation. The agent could be a non-antibody peptide that terminally participates in the Kog1 aggregate to block or inhibit aggregate formation (e.g., blocks templating or aggregate extension thus limiting loss of the functional TORC1 complex).",
                        "The methods and compositions of the present invention may further comprise the administration of a secondary drug or compound, e.g., an anti-fungal drug, an anti-parasitic drug, or any other appropriate drug or compound. For example, cells that cannot accommodate proper Kog1 aggregation are likely more susceptible to stress, e.g., drug treatments.",
                        "The present invention also features methods of screening in vitro for a compound that inhibits Kog1 aggregate formation. In some embodiments, the method comprises introducing a test compound to a first cell system and a second cell system, wherein the first cell system comprising test cells expressing Kog1 labeled with a tag, and the second cell system comprising control cells expressing Kog1 labeled with a tag. The cell systems may then be subjected to a particular stress (e.g., glucose starvation, nitrogen starvation or oxidative stress, etc.). The tags of the cell systems may then be visualized, and the amount of Kog1 aggregates (e.g., the number of foci of the tags (Kog1 bodies), or the size of the foci (signal intensity)) may then be calculated. In some embodiments, if the amount of Kog1 aggregates formed is less in the first cell system than in the second cell system, the compound inhibits Kog1 aggregate formation. If the amount of Kog1 aggregates formed is more in the first cell system than in the second cell system, the compound promotes Kog1 aggregate formation. The tag may comprise a fluorescent protein tag including but not limited to yellow fluorescent protein (YFP), green fluorescent protein (GFP), or red fluorescent protein (RFP). Immunohistochemistry may be used to visualize the Kog1 (e.g., via the tag). In some embodiments, the tag could be an epitope or the native protein and visualized via immunohistochemistry."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "A 40 year old woman (height of 158 cm, weight of 50 kg) presents to the emergency department exhibiting the following symptoms: difficulty swallowing and sore throat. The physician notes the presence of white plaques on the patient's tongue. The physician diagnoses esophageal candidiasis. The physician administers an oral pharmaceutical containing 200 mg of phenformin, an agent that activates TORC1 aggregate formation. After one day of treatment, the patient shows signs of improvement with the absence of white plaques on the tongue and no difficulty swallowing. By two days of treatment, her sore throat is gone."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe treatment of esophageal candidiasis with phenformin"
                            ],
                            "num_characters": 618,
                            "outline_medium": [
                                "illustrate the administration of an oral pharmaceutical containing phenformin to treat esophageal candidiasis"
                            ],
                            "outline_short": [
                                "illustrate treatment of esophageal candidiasis with phenformin"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "A 15 year old boy (height of 165 cm, weight of 55 kg) presents to his primary care physician with a red and itchy rash on his forearm. The rash is in a circular pattern. The physician diagnoses the patient with ringworm. The physician administers a dose of a topical pharmaceutical containing 3 g of AICAR, an agent that activates TORC1 aggregate formation. After two days of treatment, the patient shows signs of improvement with the absence of itch on his forearm. By four days of treatment, the rash is gone.",
                                "Various modifications of the invention, in addition to those described herein, will be apparent to those skilled in the art from the foregoing description. Such modifications are also intended to fall within the scope of the appended claims. Each reference cited in the present application is incorporated herein by reference in its entirety.",
                                "Although there has been shown and described the preferred embodiment of the present invention, it will be readily apparent to those skilled in the art that modifications may be made thereto which do not exceed the scope of the appended claims. For example, the present compositions and methods may be effectively used on termites. Therefore, the scope of the invention is only to be limited by the following claims. Reference numbers recited in the claims are exemplary and for ease of review by the patent office only, and are not limiting in any way. In some embodiments, the figures presented in this patent application are drawn to scale, including the angles, ratios of dimensions, etc. In some embodiments, the figures are representative only and the claims are not limited by the dimensions of the figures. In some embodiments, descriptions of the inventions described herein using the phrase “comprising” includes embodiments that could be described as “consisting of”, and as such the written description requirement for claiming one or more embodiments of the present invention using the phrase “consisting of” is met.",
                                "The reference numbers recited in the below claims are solely for ease of examination of this patent application, and are exemplary, and are not intended in any way to limit the scope of the claims to the particular features having the corresponding reference numbers in the drawings."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe diagnosis of ringworm",
                                "describe treatment of ringworm with AICAR",
                                "describe signs of improvement after two days of treatment",
                                "describe complete recovery after four days of treatment"
                            ],
                            "num_characters": 2270,
                            "outline_medium": [
                                "illustrate the administration of a topical pharmaceutical containing AICAR to treat ringworm",
                                "describe the patient's signs of improvement"
                            ],
                            "outline_short": [
                                "illustrate treatment of ringworm with AICAR"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce methods and compositions for treating diseases associated with eukaryotic organisms",
                        "describe mechanism of triggering Kog1 aggregation to inhibit TOR1 function",
                        "list non-limiting examples of human diseases caused by eukaryotes",
                        "describe non-limiting examples of other formulations that may be used in combination with compositions",
                        "introduce methods and systems for treating or preventing diseases associated with fungi/yeast or parasites",
                        "describe administering agents that sensitize TORC1 pathway to stress/starvation/treatment",
                        "introduce small molecules as agents, including AMPK activators and repressors",
                        "describe agents that bind to Kog1 to inhibit Kog1/TORC1 function",
                        "describe agents that inhibit Kog1 or Kog1 aggregate formation indirectly",
                        "list specific doses of metformin",
                        "list specific doses of phenformin",
                        "list specific doses of PT1",
                        "list specific doses of salicylsalicylic acid",
                        "list specific doses of AICAR",
                        "list specific doses of A-769662",
                        "list specific doses of Acadesine",
                        "list specific doses of 1,1-Dimethylbiguanide hydrochloride",
                        "list specific doses of BML-275",
                        "list specific doses of orsomorphin"
                    ],
                    "num_characters": 9805,
                    "outline_medium": [
                        "introduce methods and compositions for treating diseases associated with eukaryotic organisms",
                        "describe non-limiting examples of human diseases caused by eukaryotes",
                        "list non-limiting examples of other formulations that may be used in combination with compositions of the present invention",
                        "describe methods and systems for treating or preventing a disease or condition associated with a fungus/yeast or a parasite",
                        "detail embodiments of the agent, including small molecules and antibodies",
                        "provide dosage ranges for various agents",
                        "describe methods of screening in vitro for a compound that inhibits Kog1 aggregate formation",
                        "outline the administration of a secondary drug or compound",
                        "discuss various modifications of the invention"
                    ],
                    "outline_short": [
                        "introduce methods and compositions for treating diseases associated with eukaryotic organisms",
                        "describe non-limiting examples of human diseases caused by eukaryotes",
                        "outline non-limiting examples of other formulations that may be used in combination with compositions of the present invention",
                        "detail methods and systems for treating or preventing diseases associated with fungi/yeast or parasites"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of treating or preventing a disease or a condition associated with a fungi or a parasite in a subject in need thereof, said method comprising administering an agent that activates TORC1 aggregate formation to the subject that has been identified as having a disease or condition associated with a fungi or parasite, the TORC1 aggregate formation inhibits growth of the fungi or parasite.",
        "2. The method of claim 1, wherein the subject includes a human, an animal or a plant.",
        "3. The method of claim 1, wherein the agent that activates TORC1 aggregate formation targets Kog1 of TORC1.",
        "4. The method of claim 3, wherein the agent binds to Kog1.",
        "5. The method of claim 3, wherein the agent inhibits Kog1 indirectly.",
        "6. The method of claim 1, wherein the disease or condition associated with the fungi or the parasites is parasitic worms, malaria, leishmaniasis, giardia infection, or a candidiasis infection.",
        "7. The method of any one of claim 1, wherein the agent comprises a small molecule.",
        "8. The method of claim 7, wherein the small molecule comprises metformin, PT 1, salicylsalicylic acid, Phenformin, AICAR, A-769662, Acadesine, orsomorphin, 1,1-Dimethylbiguanide hydrochloride, or BML-275.",
        "9. The method of claim 1, wherein the agent comprises an antibody or a fragment thereof.",
        "10. The method of claim 9, wherein the antibody or fragment thereof is monoclonal or polyclonal, nanobody.",
        "11. The method of claim 1, wherein the parasite is selected from the group consisting of Helminths, Plasmodium, Leishmania, and Giardia.",
        "12. The method of claim 1, wherein the method further comprises co-treating the subject with an antifungal drug or an anti-parasitic drug.",
        "13. A method of inhibiting fungal or parasitic survival or replication in vitro, said method comprising applying to a cell or an in vitro system an agent that activates TORC1 aggregate formation, the TORC1 aggregate formation inhibits growth of the fungi or parasite.",
        "14. A method of inhibiting fungal or parasitic survival or replication in an animal or a plant in need thereof, said method comprising administering to the animal or applying to the plant an agent that activates TORC1 aggregate formation, the TORC1 aggregate formation inhibits growth of the fungi or parasite.",
        "15-19. (canceled)",
        "20. The method of claim 13, wherein the agent comprises a small molecule that activates TORC1 aggregate formation by binding to and inhibiting Kog1.",
        "21. The method of claim 16, wherein the small molecule comprises metformin, PT 1, salicylsalicylic acid, Phenformin, AICAR, A-769662, Acadesine, orsomorphin, 1,1-Dimethylbiguanide hydrochloride, or BML-275.",
        "22. The method of claim 13, wherein the agent comprises an antibody or a fragment thereof.",
        "23. The method of claim 14, wherein the agent comprises a small molecule that activates TORC1 aggregate formation by binding to and inhibiting Kog1.",
        "24. The method of claim 19, wherein the small molecule comprises metformin, PT 1, salicylsalicylic acid, Phenformin, AICAR, A-769662, Acadesine, orsomorphin, 1,1-Dimethylbiguanide hydrochloride, or BML-275.",
        "25. The method of claim 14, wherein the agent comprises an antibody or a fragment thereof."
    ]
}