{
    "id": "US20100162436",
    "authors": [
        "Saverio Carl Falco",
        "Zhongsen Li"
    ],
    "title": "SITE-SPECIFIC INTEGRATION AND STACKING OF TRANSGENES IN SOYBEAN VIA DNA RECOMBINASE MEDIATED CASSETTE EXCHANGE",
    "date": "2009-12-10 00:00:00",
    "abstract": "A targeting method is described that allows precise cassette replacement at a previously characterized genetic locus. A target DNA construct containing a pair of incompatible FRT sites flanking a target cassette was introduced into soybean by regular biolistic transformation. Transgenic events containing a single complete copy of the target site were then selected and retransformed with a donor DNA construct containing the identical pair of incompatible FRT sites flanking a donor cassette. Precise DNA cassette exchange happened between the target cassette and the donor cassette via recombinase mediated cassette exchange (RMCE) so that the donor cassette was introduced at the exact genomic site previously occupied by the target cassette. Through repeated RMCE using additional incompatible FRT sites, multiple groups of transgenes can be stacked at the same genomic locus.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to the field of plant molecular biology, more particularly to site-specific integration and stacking of transgenes in soybean."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to plant molecular biology"
                    ],
                    "num_characters": 156,
                    "outline_medium": [
                        "relate to plant molecular biology"
                    ],
                    "outline_short": [
                        "introduce plant molecular biology"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Current transformation methods using Agrobacterium or biolistic bombardment have challenges such as random integration, multiple transgene copies, and unpredicted integration sites. Acting alone or combined, these challenges could lead to unpredictable expression or silencing of introduced transgenes. Though homologous recombination can be explored to address these challenges (lida and Terada, (2005) Plant Mol. Biol. 59:205-219; Wright et al. (2005) Plant J. 44:693-705), site-specific integration (SSI) mediated by DNA recombinase is practically a more promising approach to eliminate random integration of unpredictable copies of a transgene by placing single copy transgene into a pre-characterized site in plant genome.",
                        "Several site-specific DNA recombination systems, such as the Cre/lox of bacteriophage P1, the FLP/FRT of Sacchromyces cerevisiae, and the R/RS of Zygosacchromyces rouxii have been used in site-specific gene integration studies (Groth and Calos, (2003) J. Mol. Biol. 335:667-678; Ow, (2003) Plant Mol. Biol. 48:183-200). A common feature of these systems is that each system consists of a single polypeptide recombinase Cre, FLP, or R, and two identical or almost identical palindromic recognition sites lox, FRT, or RS. Each recognition site contains a short asymmetric spacer sequence where DNA strand exchange takes place, flanked on each side by an inverted repeat sequence where the corresponding recombinase specifically binds. If two recognitions sites are located in cis on the same DNA molecule, DNA segment flanked by the two sites can be excised if the two sites are in the same orientation, or be inverted if the two sites are in opposite orientations. If two recognitions sites are each located in trans on two different DNA molecules, a reciprocal translocation can happen between the two linear DNA molecules, or the two molecules can integrate if at least one of them is a circular DNA (Groth and Calos, J. Mol. Biol. 335:667-678 (2003); Ow, Plant Mol. Biol. 48:183-200 (2003)).",
                        "A simple SSI can target DNA into single recombination site previously placed in a plant genome. Improvement of the single site integration approach involved transient Cre expression and the use of mutant lox sites to recreate two less compatible lox sites after integration to reduce subsequent excision of the integrated gene in tobacco (Albert et al. (1995) Plant J. 7:649-659; Day et al. (2000) Genes Dev. 14:2869-2880). Similar approach was used to produce SSI events in rice by biolistic bombardment transformation method and the transgene was proven to be stable and consistently expressed over generations (Srivastava and Ow, (2001) Mol. Breed. 8:345-350; Srivastava et al. (2004) Plant Biotechnol. J. 2:169-179). Using Agrobacterium T-DNA for donor DNA delivery and a promoter trap to activate selectable marker gene and to displace Cre expression upon DNA recombination, ˜2% single lox site SSI was achieved in Arabidopsis (Vergunst et al. (1998) Nucleic Acids Res. 26:2729-2734). The process of SSI is basically irreversible and thus the genomic site can not be recovered for repeated use. Additionally, since SSI will integrate the entire circular DNA, unwanted components such as the vector backbone is also integrated unless the integration DNA can be circulated by Cre recombinase to remove unwanted DNA prior to SSI (Srivastava et al. (2004) Plant Biotechnol J. 2:169-179; Chawla et al. (2006) Plant Biotechnol. J. 4:209-218; Vergunst et al. (1998) Nucleic Acids Res. 26:2729-2734). To achieve marker-free site-specific gene integration, a two-step approach was proposed to combine gene integration using one recombinase system such as Cre/lox followed by gene excision using another system such as FLP/FRT that is also conditionally controlled by an inducible promoter (Srivastava and Ow, (2004) Trends Biotech. 22:627-629).",
                        "If two incompatible recognition sites, which are similar enough to be recognized by the same recombinase but also different enough to prevent DNA recombination from happening between them, are located on a linear DNA molecule, DNA segment between the two sites will not be either excised or inverted. When a circular DNA molecule carrying an identical pair of the incompatible sites is introduced, the circular DNA can integrate by the corresponding recombinase at either site on the linear DNA to create a collinear DNA molecule with four recognition sites, two from the original linear DNA and two from the circular DNA. DNA excision can subsequently happen between any pair of compatible sites and result in the restoration of the original two DNA molecules or the exchange of the intervening DNA segments between the two DNA molecules. The latter process termed recombinase mediated cassette exchange (RMCE) can be employed to integrate transgenes directionally into predefined genome sites (Baer and Bode, (2001) Curr. Opin. Biotechnol. 12:473-480; Trinh and Morrision, (2000) J. Immunol. Methods 244:185-193).",
                        "RMCE using two identical but oppositely orientated RS sites resulted in donor cassette exchange into the previously placed target site in tobacco (Nanto et al. (2005) Plant Biotechnol. J. 3:203-214). The donor vector containing the R recombinase gene and a third RS site to help eliminating random integration was delivered by Agrobacterium transformation. RMCE utilizing both the Cre/lox and FLP/FRT systems was used in animal cell cultures to improve RMCE frequency (Lauth et al. (2002) Nucleic Acids Res. 30:e115). RMCE using two directional incompatible FRT sites was used in Drosophila to achieve cassette exchange by transiently expressed FLP recombinase between a target DNA previously placed in the genome and a donor introduced as a circular DNA (Horn and Handler, (2005) Proc. Natl. Acad. Sci. 102:12483-12488). A complex gene conversion approach involving Cre/lox and FLP/FRT mediated site-specific integration, RMCE, and homologous recombination was explored in maize (Djukanovic et al. (2006) Plant Biotechnol. J. 4:345-357)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce transformation methods",
                        "describe challenges of current methods",
                        "motivate homologous recombination",
                        "describe site-specific integration",
                        "introduce DNA recombination systems",
                        "describe Cre/lox system",
                        "describe FLP/FRT system",
                        "describe R/RS system",
                        "describe single site integration approach",
                        "describe improvement of single site integration",
                        "describe recombinase mediated cassette exchange",
                        "describe gene conversion approach"
                    ],
                    "num_characters": 6021,
                    "outline_medium": [
                        "introduce transformation methods",
                        "describe challenges of current methods",
                        "motivate site-specific integration",
                        "summarize site-specific DNA recombination systems",
                        "describe single site integration approach",
                        "introduce recombinase mediated cassette exchange"
                    ],
                    "outline_short": [
                        "limitations of current transformation methods",
                        "site-specific integration approaches",
                        "recombinase mediated cassette exchange"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention includes:",
                        "In one embodiment, a method for stacking multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising: (a) transforming a first soybean cell with an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a first selectable marker protein-coding sequence, wherein the first selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site; (b) regenerating a transgenic plant from the transformed soybean cell of step (a); (c) introducing into a second soybean cell from the transgenic plant of step (b) a transfer cassette, wherein said transfer cassette comprises a second selectable marker protein-coding sequence, wherein the second selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination sites of the target site, and further wherein the transfer cassette further comprises at least one second expression cassette of interest, wherein the at least one second expression cassette of interest is bounded by the second selectable marker protein-coding sequence and the second non-identical recombination site; and (d) providing a recombinase that recognizes and implements recombination at the non-identical recombination sites.",
                        "In another embodiment, the transfer cassette of the method may further comprise a third non-identical recombination site bounded by the second selectable marker protein-coding sequence and the at least one second expression cassette of interest.",
                        "In another embodiment, the method may further comprise between steps (b) and (c), identifying a transgenic plant of step (b), wherein the transgenic plant has desirable levels of gene expression for the at least one first expression cassette of interest.",
                        "In another embodiment, the non-identical recombination sites of the method are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
                        "In another embodiment, the soybean cell of step (a) is transformed with the isolated nucleic acid fragment by gene bombardment and the transfer cassette of step (c) is introduced into the soybean cell by gene bombardment.",
                        "In another embodiment, providing of said recombinase in step (d) comprises transiently expressing within said soybean cell an expression cassette comprising a polynucleotide encoding said recombinase. The recombinase may be FLP. The FLP recombinase may be synthesized using maize preferred codons.",
                        "In another embodiment, the first selectable marker protein-coding sequence of the method encodes a protein selected from the group consisting of a hygromycin phosphotransferase, a sulfonylurea-tolerant acetolactate synthase, and a sulfonylurea-tolerant acetolactate synthase that has an amino acid sequence comprising SEQ ID NO:63 or SEQ ID NO:64.",
                        "In another embodiment, the target site of the method comprises a promoter operably linked to the first selectable marker protein-coding sequence, and the first recombination site is between the promoter and the first selectable marker protein-coding sequence.",
                        "In another embodiment, a soybean cell, plant or seed having stably incorporated in its genome a transfer cassette comprising at least three non-identical recombination sites, where the transfer cassette comprises a polynucleotide encoding a selectable marker protein-coding sequence bounded by a first recombination site and a second non-identical recombination site, wherein the transfer cassette further comprises a third non-identical recombination site bounded by the selectable marker protein-coding sequence and the second non-identical recombination site, wherein the transfer cassette further comprises at least one expression cassette of interest, wherein the at least one expression cassette of interest is bounded by the third non-identical recombination site and the second non-identical recombination site. The non-identical FRT recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54). The transfer cassette ma be genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
                        "In another embodiment, a method for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising: (a) obtaining a transgenic soybean cell comprising a target site, wherein said target site comprises a first selectable marker protein-coding sequence, wherein the first selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site; (b) introducing into the transgenic soybean cell of step (a) a transfer cassette, wherein said transfer cassette comprises a second selectable marker protein-coding sequence, wherein the second selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination site, and further wherein the transfer cassette further comprises at least one expression cassette of interest, wherein the at least one expression cassette of interest is bounded by the second selectable marker protein-coding sequence and the second non-identical recombination site; and (c) providing a recombinase that recognizes and implements recombination at the non-identical recombination sites. The transfer cassette may further comprise a third non-identical recombination site bounded by the second selectable marker gene and the at least one expression cassette of interest. The non-identical FRT recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54). The transfer cassette may be genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
                        "In another embodiment, a method for creating a transgenic soybean cell comprising a target site suitable for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising transforming a soybean cell with an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site. The non-identical recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
                        "In another embodiment, a soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site. The non-identical recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID N0:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
                        "In another embodiment, a soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising a target site, wherein said target site comprises a promoter operably linked to a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site, further wherein the first recombination site is between the promoter and the selectable marker protein-coding sequence. The target site may further comprise at least one additional non-identical recombination site, wherein the at least one additional non-identical recombination site is bounded by the selectable marker protein-coding sequence and the second non-identical recombination site. The non-identical recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for stacking expression cassettes",
                        "describe transforming soybean cell",
                        "describe regenerating transgenic plant",
                        "introduce transfer cassette",
                        "describe providing recombinase",
                        "describe non-identical recombination sites",
                        "describe selectable marker protein-coding sequence",
                        "describe expression cassette of interest",
                        "describe target site",
                        "describe promoter operably linked to selectable marker",
                        "describe third non-identical recombination site",
                        "describe method for stacking multiple expression cassettes",
                        "describe obtaining transgenic soybean cell",
                        "describe introducing transfer cassette",
                        "describe providing recombinase",
                        "describe method for creating transgenic soybean cell",
                        "describe soybean cell, plant or seed having stably incorporated nucleic acid fragment"
                    ],
                    "num_characters": 8843,
                    "outline_medium": [
                        "introduce method for stacking multiple expression cassettes",
                        "describe transforming soybean cell with isolated nucleic acid fragment",
                        "introduce transfer cassette with non-identical recombination sites",
                        "provide recombinase for recombination",
                        "describe optional steps for identifying transgenic plant",
                        "introduce non-identical recombination sites",
                        "describe soybean cell, plant or seed with stably incorporated transfer cassette",
                        "introduce method for creating transgenic soybean cell"
                    ],
                    "outline_short": [
                        "method for stacking multiple expression cassettes",
                        "transfer cassette design",
                        "recombinase mediated recombination",
                        "various embodiments of the invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The disclosure of each reference set forth herein is hereby incorporated by reference in its entirety.",
                        "As used herein and in the appended claims, the singular forms “a”, “an”, and “the” include plural reference unless the context clearly dictates otherwise. Thus, for example, reference to “a plant” includes a plurality of such plants, reference to “a cell” includes one or more cells and equivalents thereof known to those skilled in the art, and so forth.",
                        "As used herein:",
                        "A “target site” comprises a nucleotide sequence flanked by two non-identical recombination sites. A target site provides a “specific chromosomal site” for stacking multiple expression cassettes of interest.",
                        "A “transfer cassette” for use with a given target site comprises a nucleotide sequence flanked by the same two non-identical recombination sites present in the corresponding target site. The terms “transfer cassette”, “donor cassette” and “targeting cassette” are used interchangeably herein.",
                        "A target site and a transfer cassette may each comprise more than two non-identical recombination sites.",
                        "A “donor construct” is a recombinant construct that contains a transfer cassette. The terms “donor construct” and “donor vector” are used interchangeably herein.",
                        "“Transgenic” refers to any cell, cell line, callus, tissue, plant part or plant, the genome of which has been altered by the presence of a heterologous nucleic acid, such as a recombinant DNA construct, including those initial transgenic events as well as those created by sexual crosses or asexual propagation from the initial transgenic event. The term “transgenic” as used herein does not encompass the alteration of the genome (chromosomal or extra-chromosomal) by conventional plant breeding methods or by naturally occurring events such as random cross-fertilization, non-recombinant viral infection, non-recombinant bacterial transformation, non-recombinant transposition, or spontaneous mutation.",
                        "“Genome” as it applies to plant cells encompasses not only chromosomal DNA found within the nucleus, but organelle DNA found within subcellular components (e.g., mitochondrial, plastid) of the cell.",
                        "“Plant” includes reference to whole plants, plant organs, plant tissues, seeds and plant cells and progeny of same. Plant cells include, without limitation, cells from seeds, suspension cultures, embryos, meristematic regions, callus tissue, leaves, roots, shoots, gametophytes, sporophytes, pollen, and microspores.",
                        "“Progeny” comprises any subsequent generation of a plant.",
                        "“Transgenic plant” includes reference to a plant which comprises within its genome a heterologous polynucleotide. For example, the heterologous polynucleotide is stably integrated within the genome such that the polynucleotide is passed on to successive generations. The heterologous polynucleotide may be integrated into the genome alone or as part of a recombinant DNA construct.",
                        "“Heterologous” with respect to sequence means a sequence that originates from a foreign species, or, if from the same species, is substantially modified from its native form in composition and/or genomic locus by deliberate human intervention.",
                        "“Polynucleotide”, “nucleic acid sequence”, “nucleotide sequence”, or “nucleic acid fragment” are used interchangeably and is a polymer of RNA or DNA that is single- or double-stranded, optionally containing synthetic, non-natural or altered nucleotide bases. Nucleotides (usually found in their 5′-monophosphate form) are referred to by their single letter designation as follows: “A” for adenylate or deoxyadenylate (for RNA or DNA, respectively), “C” for cytidylate or deoxycytidylate, “G” for guanylate or deoxyguanylate, “U” for uridylate, “T” for deoxythymidylate, “R” for purines (A or G), “Y” for pyrimidines (C or T), “K” for G or T, “H” for A or C or T, “I” for inosine, and “N” for any nucleotide.",
                        "“Polypeptide”, “peptide”, “amino acid sequence” and “protein” are used interchangeably herein to refer to a polymer of amino acid residues. The terms apply to amino acid polymers in which one or more amino acid residue is an artificial chemical analogue of a corresponding naturally occurring amino acid, as well as to naturally occurring amino acid polymers. The terms “polypeptide”, “peptide”, “amino acid sequence”, and “protein” are also inclusive of modifications including, but not limited to, glycosylation, lipid attachment, sulfation, gamma-carboxylation of glutamic acid residues, hydroxylation and ADP-ribosylation.",
                        "“Messenger RNA (mRNA)” refers to the RNA that is without introns and that can be translated into protein by the cell.",
                        "“cDNA” refers to a DNA that is complementary to and synthesized from a mRNA template using the enzyme reverse transcriptase. The cDNA can be single-stranded or converted into the double-stranded form using the Klenow fragment of DNA polymerase I.",
                        "“Mature” protein refers to a post-translationally processed polypeptide; i.e., one from which any pre- or pro-peptides present in the primary translation product have been removed.",
                        "“Precursor” protein refers to the primary product of translation of mRNA; i.e., with pre- and pro-peptides still present. Pre- and pro-peptides may be and are not limited to intracellular localization signals.",
                        "“Isolated” refers to materials, such as nucleic acid molecules and/or proteins, which are substantially free or otherwise removed from components that normally accompany or interact with the materials in a naturally occurring environment. Isolated polynucleotides may be purified from a host cell in which they naturally occur. Conventional nucleic acid purification methods known to skilled artisans may be used to obtain isolated polynucleotides. The term also embraces recombinant polynucleotides and chemically synthesized polynucleotides.",
                        "“Recombinant” refers to an artificial combination of two otherwise separated segments of sequence, e.g., by chemical synthesis or by the manipulation of isolated segments of nucleic acids by genetic engineering techniques. “Recombinant” also includes reference to a cell or vector, that has been modified by the introduction of a heterologous nucleic acid or a cell derived from a cell so modified, but does not encompass the alteration of the cell or vector by naturally occurring events (e.g., spontaneous mutation, natural transformation/transduction/transposition) such as those occurring without deliberate human intervention.",
                        "“Recombinant DNA construct” refers to a combination of nucleic acid fragments that are not normally found together in nature. Accordingly, a recombinant DNA construct may comprise regulatory sequences and coding sequences that are derived from different sources, or regulatory sequences and coding sequences derived from the same source, but arranged in a manner different than that normally found in nature.",
                        "The terms “entry clone” and “entry vector” are used interchangeably herein.",
                        "“Regulatory sequences” refer to nucleotide sequences located upstream (5′ non-coding sequences), within, or downstream (3′ non-coding sequences) of a coding sequence, and which influence the transcription, RNA processing or stability, or translation of the associated coding sequence. Regulatory sequences may include, but are not limited to, promoters, translation leader sequences, introns, and polyadenylation recognition sequences. The terms “regulatory sequence” and “regulatory element” are used interchangeably herein.",
                        "“Promoter” refers to a nucleic acid fragment capable of controlling transcription of another nucleic acid fragment.",
                        "“Promoter functional in a plant” is a promoter capable of controlling transcription in plant cells whether or not its origin is from a plant cell.",
                        "“Tissue-specific promoter” and “tissue-preferred promoter” are used interchangeably, and refer to a promoter that is expressed predominantly but not necessarily exclusively in one tissue or organ, but that may also be expressed in one specific cell.",
                        "“Developmentally regulated promoter” refers to a promoter whose activity is determined by developmental events.",
                        "“Operably linked” refers to the association of nucleic acid fragments in a single fragment so that the function of one is regulated by the other. For example, a promoter is operably linked with a nucleic acid fragment when it is capable of regulating the transcription of that nucleic acid fragment.",
                        "“Expression” refers to the production of a functional product. For example, expression of a nucleic acid fragment may refer to transcription of the nucleic acid fragment (e.g., transcription resulting in mRNA or functional RNA) and/or translation of mRNA into a precursor or mature protein.",
                        "“Phenotype” means the detectable characteristics of a cell or organism.",
                        "“Introduced” in the context of inserting a nucleic acid fragment (e.g., a recombinant DNA construct) into a cell, means “transfection” or “transformation” or “transduction” and includes reference to the incorporation of a nucleic acid fragment into a eukaryotic or prokaryotic cell where the nucleic acid fragment may be incorporated into the genome of the cell (e.g., chromosome, plasmid, plastid or mitochondrial DNA), converted into an autonomous replicon, or transiently expressed (e.g., transfected mRNA).",
                        "A “transformed cell” is any cell into which a nucleic acid fragment (e.g., a recombinant DNA construct) has been introduced.",
                        "“Transformation” as used herein refers to both stable transformation and transient transformation.",
                        "“Stable transformation” refers to the introduction of a nucleic acid fragment into a genome of a host organism resulting in genetically stable inheritance. Once stably transformed, the nucleic acid fragment is stably integrated in the genome of the host organism and any subsequent generation.",
                        "“Transient transformation” refers to the introduction of a nucleic acid fragment into the nucleus, or DNA-containing organelle, of a host organism resulting in gene expression without genetically stable inheritance.",
                        "“Allele” is one of several alternative forms of a gene occupying a given locus on a chromosome. When the alleles present at a given locus on a pair of homologous chromosomes in a diploid plant are the same that plant is homozygous at that locus. If the alleles present at a given locus on a pair of homologous chromosomes in a diploid plant differ that plant is heterozygous at that locus. If a transgene is present on one of a pair of homologous chromosomes in a diploid plant that plant is hemizygous at that locus.",
                        "Sequence alignments and percent identity calculations may be determined using a variety of comparison methods designed to detect homologous sequences including, but not limited to, the MEGALIGN® program of the LASERGENE® bioinformatics computing suite (DNASTAR® Inc., Madison, Wis.). Unless stated otherwise, multiple alignment of the sequences provided herein were performed using the Clustal V method of alignment (Higgins and Sharp (1989) CABIOS. 5:151-153) with the default parameters (GAP PENALTY=10, GAP LENGTH PENALTY=10). Default parameters for pairwise alignments and calculation of percent identity of protein sequences using the Clustal V method are KTUPLE=1, GAP PENALTY=3, WINDOW=5 and DIAGONALS SAVED=5. For nucleic acids these parameters are KTUPLE=2, GAP PENALTY=5, WINDOW=4 and DIAGONALS SAVED=4. After alignment of the sequences, using the Clustal V program, it is possible to obtain “percent identity” and “divergence” values by viewing the “sequence distances” table on the same program; unless stated otherwise, percent identities and divergences provided and claimed herein were calculated in this manner.",
                        "Standard recombinant DNA and molecular cloning techniques used herein are well known in the art and are described more fully in Sambrook, J., Fritsch, E. F. and Maniatis, T. Molecular Cloning: A Laboratory Manual; Cold Spring Harbor Laboratory Press: Cold Spring Harbor, 1989 (hereinafter “Sambrook”).",
                        "“Antisense inhibition” refers to the production of antisense RNA transcripts capable of suppressing the expression of the target gene or gene product. “Antisense RNA” refers to an RNA transcript that is complementary to all or part of a target primary transcript or mRNA and that blocks the expression of a target isolated nucleic acid fragment (U.S. Pat. No. 5,107,065). The complementarity of an antisense RNA may be with any part of the specific gene transcript, i.e., at the 5′ non-coding sequence, 3′ non-coding sequence, introns, or the coding sequence.",
                        "“Cosuppression” refers to the production of sense RNA transcripts capable of suppressing the expression of the target gene or gene product. “Sense” RNA refers to RNA transcript that includes the mRNA and can be translated into protein within a cell or in vitro. Cosuppression constructs in plants have been previously designed by focusing on overexpression of a nucleic acid sequence having homology to a native mRNA, in the sense orientation, which results in the reduction of all RNA having homology to the overexpressed sequence (see Vaucheret et al. (1998) Plant J. 16:651-659; and Gura, (2000) Nature 404:804-808).",
                        "“Selection agent” refers to a compound which is toxic to non-transformed plant cells and which kills non-transformed tissues when it is incorporated in the culture medium in an “effective amount”, i.e., an amount equal to or greater than the minimal amount necessary to kill non-transformed tissues. Cells can be transformed with an appropriate gene, such that expression of that transgene confers resistance to the corresponding selection agent, via de-toxification or another mechanism, so that these cells continue to grow and are subsequently able to regenerate plants. The gene conferring resistance to the selection agent is termed the “selectable marker gene”, “selectable marker” or “resistance gene”. Transgenic cells that lack a functional selectable marker gene will be killed by the selection agent. Selectable marker genes include genes conferring resistance to herbicidal compounds. Herbicide resistance genes generally code for a modified target protein insensitive to the herbicide or for an enzyme that degrades or detoxifies the herbicide in the plant before it can act (DeBlock et al. (1987) EMBO J. 6:2513-2518, DeBlock et al. (1989) Plant Physiol., 91: 691-704). For example, resistance to glyphosate or sulfonylurea herbicides has been obtained by using genes coding for mutant versions of the target enzymes, 5-enolpyruvylshikimate-3-phosphate synthase (EPSPS) and acetolactate synthase (ALS), respectively. Resistance to glufosinate ammonium, bromoxynil and 2,4-dichlorophenoxyacetic acid (2,4-D) has been obtained by using bacterial genes encoding a phosphinothricin acetyltransferase, a nitrilase, or a 2,4-dichlorophenoxyacetate monooxygenase, respectively, which detoxify the respective herbicide. “Sulfonylurea herbicides” include but are not limited to chlorsulfuron, rimsulfuron, nicosulfuron, Classic®, and Oust®. A specific selection agent may have one or more corresponding selectable marker genes. Likewise, a specific selectable marker gene may have one or more corresponding selection agents. It is appreciated by one skilled in the art that a selection agent may not be toxic to all plant species or to all cell types within a given plant. For a plant species susceptible to a given selection agent, it is also appreciated that resistance cells, tissues or whole plants may be obtained independent of the transformation process, e.g., through chemical mutagenesis of the target gene or gene amplification of the target gene during tissue culture.",
                        "Examples of suitable selection agents, include but are not limited to, cytotoxic agents such as hygromycin, sulfonylurea herbicides such as chlorsulfuron, nicosulfuron and rimsulfuron, and other herbicides which act by inhibition of the enzyme acetolactate synthase (ALS), glyphosate, bialaphos and phosphinothricin (PPT). It is also possible to use positive selection marker systems such as phospho-mannose isomerase and similar systems which confer positive growth advantage to transgenic cells.",
                        "Any regenerable plant tissue can be used in accordance with the present invention. Regenerable plant tissue generally refers to tissue which can be regenerated into a differentiated plant. For example, such tissues can include calluses and/or somatic embryos derived from whole zygotic embryos, isolated scutella, anthers, inflorescences and leaf and meristematic tissues.",
                        "Many of the problems associated with random gene integration, such as multiple transgene copies, unknown integration sites, unpredicted transgene expression, may be overcome by site-specific integration transformation. Various position effects influencing the expression of randomly integrated transgenes may be eliminated and as a result, the effects of regulatory elements such as promoters, terminators, enhancers, and insulators on gene expression may be comparatively analyzed. Transgene integration sites may also be characterized and selected for different applications prior to retransformation.",
                        "The RMCE approach using two incompatible recombination sites for double crossover provides a more controlled way for gene targeting. The RMCE approach employs a transgenic plant which comprises a first sequence encoding a first recombination site and a second sequence comprising a second non-identical recombination site. A transfer cassette is then introduced into the transgenic plant, wherein the transfer cassette comprises the same first sequence encoding the same first recombination site and the same second sequence comprising the same second non-identical recombination site. Recombination is then accomplished by a recombinase that recognizes and implements recombination at the non-identical recombination sites. An advantage of the directional RMCE is that DNA cassette exchange is reversible so the RMCE product can be used as new target for next round RMCE using additional recombination sites to successively stack multiple transgenes at the same locus to generate allelic transgenes. Furthermore, since RMCE places only one copy of a transgene at a selected locus, only one transgenic event is needed for each locus. The cost associated with the production, maintenance, and characterization of large numbers of transgenic events with the transgene at unpredicted multiple loci can be eliminated.",
                        "Recently, single copy RMCE plants were obtained in Arabidopsis from the retransformation of target plants by T-DNA delivery of a donor cassette. Both the target and donor cassettes were flanked by two incompatible lox sites in inverted orientation. The Cre recombinase was provided on a co-transformed T-DNA (Louwerse, J. D., et al. (2007) Plant Physiol. 145:1282-1293).",
                        "To develop FLP/FRT mediated RMCE technology in soybean, we first created transgenic target lines containing a hygromycin selection gene flanked by two incompatible FRT sites via biolistic random integration transformation. Homozygous target lines were obtained and retransformed with a donor DNA containing a chlorsulfuron selection gene flanked by the same pair of FRT sites. A FLP expression DNA construct was co-bombarded with the donor DNA to transiently provide FLP recombinase required for DNA recombination between the target and donor DNA molecules. RMCE events were produced from multiple target lines and confirmed at both somatic embryo and plant stages by extensive molecular characterizations.",
                        "The success of the current invention opens new ways for transgenic product development and transgene expression research. Various target lines can be produced and selected with respect to parameters, such as gene silencing, tissue-specific expression, agronomic performance, etc. and maintained as production target lines to accept transgenes with different expression preferences. By engineering more FRT sites in specific arrangements in target or donor constructs, multiple genes can be stacked reversibly at the same genetic locus by repeated RMCE. Integration of large DNA molecules, such as bacterial artificial chromosomes, could be feasible via RMCE which relies only on the FLP recombinase catalyzed interactions between FRT sites.",
                        "Compositions and methods for the directional, targeted integration of exogenous nucleotides into a transformed soybean plant are provided. The methods use non-identical recombination sites in a gene targeting system which facilitates directional targeting of desired genes and nucleotide sequences into corresponding recombination sites previously introduced into the target plant genome.",
                        "In the methods of the invention, a nucleotide sequence flanked by two non-identical recombination sites is introduced into the target organism's genome establishing a target site for insertion of nucleotide sequences of interest. Once a stable plant or cultured tissue is established a second construct, or nucleotide sequence of interest, flanked by corresponding recombination sites as those flanking the target site, is introduced into the stably transformed plant or tissues in the presence of a recombinase protein. This process results in exchange of the nucleotide sequences between the non-identical recombination sites of the target site and the transfer cassette.",
                        "It is recognized that the transformed plant may comprise multiple target sites; i.e., sets of non-identical recombination sites. In this manner, multiple manipulations of the target site in the transformed plant are available. By target site in the transformed plant is intended a DNA sequence that has been inserted into the transformed plant's genome and comprises non-identical recombination sites.",
                        "The two-micron plasmid found in most naturally occurring strains of Saccharomyces cerevisiae, encodes a site-specific recombinase that promotes an inversion of the DNA between two inverted repeats. This inversion plays a central role in plasmid copy-number amplification. The protein, designated FLP protein, catalyzes site-specific recombination events. The minimal recombination site (FRT) has been defined and contains two inverted 13-base pair (bp) repeats surrounding an asymmetric 8-bp spacer. The FLP protein cleaves the site at the junctions of the repeats and the spacer and is covalently linked to the DNA via a 3′ phosphate.",
                        "Site specific recombinases like FLP cleave and religate DNA at specific target sequences, resulting in a precisely defined recombination between two identical sites. To function, the system needs the recombination sites and the recombinase. No auxiliary factors are needed. Thus, the entire system can be inserted into and function in plant cells.",
                        "The yeast FLP/FRT site specific recombination system has been shown to function in plants. Earlier, the system was utilized for excision of unwanted DNA. See, Lyznik et al. (1993) Nucleic Acid Res. 21:969-975. Subsequently, non-identical FRTs were used for the exchange, targeting, arrangement, insertion and control of expression of nucleotide sequences into the plant genome (PCT Publication No. WO1999025821; PCT Publication No. WO1999025840; PCT Publication No. WO1999025854; PCT Publication No. 1999025855; and PCT Publication No. WO2007011733; the contents of all are herein incorporated by reference).",
                        "To practice the methods of the invention, a transformed organism of interest, particularly a soybean plant, containing a target site integrated into its genome is needed. The target site is characterized by being flanked by non-identical recombination sites. A targeting cassette is additionally required containing a nucleotide sequence flanked by corresponding non-identical recombination sites as those sites contained in the target site of the transformed organism. A recombinase which recognizes the non-identical recombination sites and catalyzes site-specific recombination is required.",
                        "It is recognized that the recombinase can be provided by any means known in the art. That is, it can be provided in the organism or plant cell by transforming the organism with an expression cassette capable of expressing the recombinase in the organism, by transient expression; or by providing messenger RNA (mRNA) for the recombinase or the recombinase protein.",
                        "By “non-identical recombination sites” is intended that the flanking recombination sites are not identical in sequence and will not recombine or recombination between the non-identical sites will be reduced compared to recombination between identical sites. That is, one flanking recombination site may be a FRT site where the second recombination site may be a mutated FRT site. The non-identical recombination sites used in the methods of the invention prevent or greatly suppress recombination between the two flanking recombination sites and excision of the nucleotide sequence contained therein. Accordingly, it is recognized that any suitable non-identical recombination sites may be utilized in the invention, including FRT and mutant FRT sites, FRT and lox sites, 10× and mutant lox sites, as well as other recombination sites known in the art.",
                        "Suitable non-identical recombination site implies that in the presence of active recombinase, excision of sequences between two non-identical recombination sites occurs, if at all, with an efficiency considerably lower than the recombinationally-mediated cassette exchange targeting arrangement of nucleotide sequences into the plant genome. Thus, suitable non-identical sites for use in the invention include those sites where the efficiency of recombination between the sites is low; for example, where the efficiency is less than about 30 to about 50%, in another embodiment less than about 10 to about 30%, in another embodiment less than about 5 to about 10%. As noted above, the recombination sites in the targeting cassette correspond to those in the target site of the transformed plant. That is, if the target site of the transformed plant contains flanking non-identical recombination sites of FRTA and FRTB, the targeting cassette will contain the same FRTA and FRTB non-identical recombination sites.",
                        "Sequences of minimal and larger than minimal non-identical FRTs sites have been described for the exchange, targeting, arrangement, insertion and control of expression of nucleotide sequences into the plant genome (PCT Publication No. WO1999025821; PCT Publication No. WO1999025840; PCT Publication No. WO1999025854; PCT Publication No. 1999025855; and PCT Publication No. WO2007011733; the contents of all are herein incorporated by reference).",
                        "It is furthermore recognized that the recombinase, which is used in the invention, will depend upon the recombination sites in the target site of the transformed plant and the targeting cassette. That is, if FRT sites are utilized, the FLP recombinase will be needed. In the same manner, where lox sites are utilized, the Cre recombinase is required. If the non-identical recombination sites comprise both a FRT and a lox site, both the FLP and Cre recombinase will be required in the plant cell.",
                        "The FLP recombinase is a protein which catalyzes a site-specific reaction that is involved in amplifying the copy number of the two micron plasmid of S. cerevisiae during DNA replication. FLP protein has been cloned and expressed. See, for example, Cox (1993) Proc. Natl. Acad. Sci. U.S.A. 80:4223-4227. The FLP recombinase for use in the invention may be that derived from the genus Saccharomyces. The recombinase may be synthesized using plant preferred codons for optimum expression in a plant of interest. See, for example, U.S. application Ser. No. 08/972,258 filed Nov. 18, 1997, entitled “Novel Nucleic Acid Sequence Encoding FLP Recombinase”, herein incorporated by reference. The bacteriophage recombinase Cre catalyzes site-specific recombination between two lox sites. The Cre recombinase is known in the art. See, for example, Guo et al. (1997) Nature 389:40-46; Abremski et al. (1984) J. Biol. Chem. 259:1509-1514; Chen et al. (1996) Somat. Cell Mol. Genet. 22:477-488; and Shaikh et al. (1977) J. Biol. Chem. 272:5695-5702. All of which are herein incorporated by reference. Such Cre sequence may also be synthesized using plant preferred codons.",
                        "Where appropriate, the nucleotide sequences to be inserted in the plant genome may be optimized for increased expression in the transformed plant. Where mammalian, yeast, or bacterial genes are used in the invention, they can be synthesized using plant preferred codons for improved expression. It is recognized that for expression in monocots, dicot genes can also be synthesized using monocot preferred codons. Methods are available in the art for synthesizing plant preferred genes. See, for example, U.S. Pat. Nos. 5,380,831, 5,436,391, and Murray et al. (1989) Nucleic Acids Res. 17:477-498, herein incorporated by reference.",
                        "The plant preferred codons may be determined from the codons utilized more frequently in the proteins expressed in the plant of interest. It is recognized that monocot or dicot preferred sequences may be constructed as well as plant preferred sequences for particular plant species. See, for example, EPA 0359472; EPA 0385962; WO 91/16432; Perlak et al. (1991) Proc. Natl. Acad. Sci. USA, 88:3324-3328; and Murray et al. (1989) Nucleic Acids Research, 17: 477-498. U.S. Pat. No. 5,380,831; U.S. Pat. No. 5,436,391; and the like, herein incorporated by reference. It is further recognized that all or any part of the gene sequence may be optimized or synthetic. That is, fully optimized or partially optimized sequences may also be used. Additional sequence modifications are known to enhance gene expression in a cellular host and can be used in the invention. These include elimination of sequences encoding spurious polyadenylation signals, exon-intron splice site signals, transposon-like repeats, and other such well-characterized sequences, which may be deleterious to gene expression. The G-C content of the sequence may be adjusted to levels average for a given cellular host, as calculated by reference to known genes expressed in the host cell. When possible, the sequence is modified to avoid predicted hairpin secondary mRNA structures.",
                        "The present invention also encompasses novel FLP recombination target sites (FRT). The FRT has been identified as a minimal sequence comprising two 11 base pair inverted repeats, separated by an 8 base spacer, as follows (SEQ ID NO:50; PCT Publication No. WO2007011733):",
                        "The domains of the minimal FRT recombination site comprise a pair of 11 base pair symmetry elements which are the FLP binding sites (nucleotides 1-11 and 20-30 of SEQ ID NO:50); the 8 base pair core, or spacer, region (nucleotides 12-19 of SEQ ID NO:50); and the polypyrimidine tracts (nucleotides 3-14 and nucleotides 16-29 of SEQ ID NO:50). A modified or mutant FRT recombination site can comprise 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 or more alterations which include substitutions, additions, and/or deletions in one or more of these domains.",
                        "The eight base pair spacer is involved in DNA-DNA pairing during strand exchange. The asymmetry of the region determines the direction of site alignment in the recombination event, which will subsequently lead to either inversion or excision. Most of the spacer can be mutated without a loss of function. See, for example, Schlake and Bode (1994) Biochemistry 33:12746-12751, herein incorporated by reference.",
                        "Mutant FRT sites are provided for use in the practice of the methods of the present invention and have been described in PCT Publication No. WO2007011733, the contents of which are herein incorporated by reference. Such mutant sites may be constructed by PCR-based mutagenesis. While mutant FRT sites are provided herein, it is recognized that other mutant FRT sites may be used in the practice of the invention. The present invention is not the use of a particular FRT or recombination site, but rather that non-identical recombination sites or FRT sites can be utilized for targeted insertion and expression of nucleotide sequences in a plant genome. Thus, other mutant FRT sites can be constructed and utilized based upon the present disclosure.",
                        "As discussed above, bringing genomic DNA containing a target site with non-identical recombination sites together with a vector containing a transfer cassette with corresponding non-identical recombination sites, in the presence of the recombinase, results in recombination. The nucleotide sequence of the transfer cassette located between the flanking recombination sites is exchanged with the nucleotide sequence of the target site located between the flanking recombination sites. In this manner, nucleotide sequences of interest may be precisely incorporated into the genome of the host.",
                        "It is recognized that many variations of the invention can be practiced. For example, target sites can be constructed having multiple non-identical recombination sites. Thus, multiple genes or nucleotide sequences can be stacked or ordered at precise locations in the plant genome. Likewise, once a target site has been established within the genome, additional recombination sites may be introduced by incorporating such sites within the nucleotide sequence of the transfer cassette and the transfer of the sites to the target sequence. Thus, once a target site has been established, it is possible to subsequently add sites, or alter sites through recombination.",
                        "Another variation includes providing a promoter or transcription initiation region operably linked with the target site in an organism. For example, the promoter will be 5′ to the first recombination site. By transforming the organism with a transfer cassette comprising a coding region, expression of the coding region will occur upon integration of the transfer cassette into the target site. This embodiment provides for a method to select transformed cells, particularly plant cells, by providing a selectable marker sequence as the coding sequence.",
                        "Other advantages of the present system include the ability to reduce the complexity of integration of transgenes or transferred DNA in an organism by utilizing transfer cassettes as discussed above and selecting organisms with simple integration patterns. In the same manner, preferred sites within the genome can be identified by comparing several transformation events. A preferred site within the genome includes one that does not disrupt expression of essential sequences and provides for adequate expression of the transgene sequence.",
                        "The methods of the invention also provide for means to combine multiple cassettes at one location within the genome. Recombination sites may be added or deleted at target sites within the genome.",
                        "Any means known in the art for bringing the three components of the system together may be used in the invention. For example, a plant can be stably transformed to harbor the target site in its genome. Using the recombinase, either transiently or stably integrated into the genome of the plant, the transfer cassette flanked by corresponding non-identical recombination sites is inserted into the transformed plant's genome.",
                        "Alternatively, the components of the system may be brought together by sexually crossing transformed plants. In this embodiment, a transformed plant, parent one, containing a target site integrated in its genome can be sexually crossed with a second plant, parent two, that has been genetically transformed with a transfer cassette containing flanking non-identical recombination sites, which correspond to those in plant one. Either plant one or plant two contains within its genome a nucleotide sequence expressing recombinase. The recombinase may be under the control of a constitutive or inducible promoter.",
                        "Inducible promoters include heat-inducible promoters, estradiol-responsive promoters, chemical inducible promoters, and the like. Pathogen inducible promoters include those from pathogenesis-related proteins (PR proteins), which are induced following infection by a pathogen; e.g., PR proteins, SAR proteins, beta-1,3-glucanase, chitinase, etc. See, for example, Redolfi et al. (1983) Neth. J. Plant Pathol. 89:245-254; Uknes et al. (1992) The Plant Cell 4:645-656; and Van Loon (1985) Plant Mol. Virol. 4:111-116. In this manner, expression of recombinase and subsequent activity at the recombination sites can be controlled.",
                        "Suitable constitutive promoters for use in a plant host cell include, for example, the core promoter of the Rsyn7 promoter and other constitutive promoters disclosed in WO 99/43838 and U.S. Pat. No. 6,072,050; the core CaMV 35S promoter (Odell et al. (1985) Nature 313:810-812); rice actin (McElroy et al. (1990) Plant Cell 2:163-171); ubiquitin (Christensen et al. (1989) Plant Mol. Biol. 12:619-632 and Christensen et al. (1992) Plant Mol. Biol. 18:675-689); pEMU (Last et al. (1991) Theor. Appl. Genet. 81:581-588); MAS (Velten et al. (1984) EMBO J. 3:2723-2730); ALS promoter (U.S. Pat. No. 5,659,026), and the like. Other constitutive promoters include, for example, those discussed in U.S. Pat. Nos. 5,608,149; 5,608,144; 5,604,121; 5,569,597; 5,466,785; 5,399,680; 5,268,463; 5,608,142; and 6,177,611.",
                        "Promoters which are seed or embryo-specific and may be useful in the invention include soybean Kunitz trypsin inhibitor (Kti3) (Jofuku and Goldberg, (1989) Plant Cell 1:1079-1093), patatin (potato tubers) (Rocha-Sosa, M., et al. (1989) EMBO J. 8:23-29), convicilin, vicilin, and legumin (pea cotyledons) (Rerie, W. G., et al. (1991) Mol. Gen. Genet. 259:149-157; Newbigin, E. J., et al. (1990) Planta 180:461-470; Higgins, T. J. V., et al. (1988) Plant. Mol. Biol. 11:683-695), zein (maize endosperm) (Schemthaner, J. P., et al. (1988) EMBO J. 7:1249-1255), phaseolin (bean cotyledon) (Segupta-Gopalan, C., et al. (1985) Proc. Natl. Acad. Sci. U.S.A. 82:3320-3324), phytohemagglutinin (bean cotyledon) (Voelker, T. et al. (1987) EMBO J. 6:3571-3577), B-conglycinin and glycinin (soybean cotyledon) (Chen, Z-L, et al. (1988) EMBO J. 7:297-302), glutelin (rice endosperm), hordein (barley endosperm) (Marris, C., et al. (1988) Plant Mol. Biol. 10:359-366), glutenin and gliadin (wheat endosperm) (Colot, V., et al. (1987) EMBO J. 6:3559-3564), and sporamin (sweet potato tuberous root) (Hattori, T., et al. (1990) Plant Mol. Biol. 14:595-604). Promoters of seed-specific genes operably linked to heterologous coding regions in chimeric gene constructions maintain their temporal and spatial expression pattern in transgenic plants. Such examples include Arabidopsis thaliana 2S seed storage protein gene promoter to express enkephalin peptides in Arabidopsis and Brassica napus seeds (Vanderkerckhove et al. (1989) Bio/Technology 7:L929-932), bean lectin and bean beta-phaseolin promoters to express luciferase (Riggs et al. (1989) Plant Sci. 63:47-57), and wheat glutenin promoters to express chloramphenicol acetyl transferase (Colot et al. (1987) EMBO J. 6:3559-3564).",
                        "The compositions and methods of the invention are useful in targeting the integration of transferred nucleotide sequences to a specific chromosomal site. The nucleotide sequence may encode any nucleotide sequence of interest. Particular genes of interest include those which provide a readily analyzable functional feature to the host cell and/or organism, such as marker genes, as well as other genes that alter the phenotype of the recipient cells, and the like. Thus, genes effecting plant growth, height, susceptibility to disease or insects, nutritional value, and the like may be utilized in the invention. The nucleotide sequence also may encode an antisense sequence to turn off or modify gene expression.",
                        "It is recognized that the nucleotide sequences will be utilized in a functional expression unit or cassette. By functional expression unit or cassette is intended, the nucleotide sequence of interest with a functional promoter, and in most instances a termination region. There are various ways to achieve the functional expression unit within the practice of the invention. In one embodiment of the invention, the nucleic acid of interest is transferred or inserted into the genome as a functional expression unit. Alternatively, the nucleotide sequence may be inserted into a site within the genome which is 3′ to a promoter region. In this latter instance, the insertion of the coding sequence 3′ to the promoter region is such that a functional expression unit is achieved upon integration.",
                        "For convenience, for expression in plants, the nucleic acid encoding target sites and the transfer cassettes, including the nucleotide sequences of interest, can be contained within expression cassettes. An “expression cassette” will comprise a transcriptional initiation region, or promoter, operably linked to the nucleic acid fragment encoding the RNA of interest. Such an expression cassette may be provided with a plurality of restriction sites for insertion of the gene or genes of interest to be under the transcriptional regulation of the regulatory regions.",
                        "The transcriptional initiation region, the promoter, may be native or homologous or foreign or heterologous to the host, or could be the natural sequence or a synthetic sequence. By foreign is intended that the transcriptional initiation region is not found in the wild-type host into which the transcriptional initiation region is introduced.",
                        "For protein expression, the expression cassette will include in the 5-prime to 3-prime direction of transcription, a transcriptional and translational initiation region, a DNA sequence of interest, and a transcriptional and translational termination region functional in plants. The termination region may be native with the transcriptional initiation region, may be native with the DNA sequence of interest, or may be derived from another source. Convenient termination regions are available from the potato proteinase inhibitor (PinII) gene or from Ti-plasmid of A. tumefaciens, such as the octopine synthase and nopaline synthase termination regions. See also, Guerineau et al. (1991) Mol. Gen. Genet. 262:141-144; Proudfoot (1991) Cell 64:671-674; Sanfacon et al. (1991) Genes Dev. 5:141-149; Mogen et al. (1990) Plant Cell 2:1261-1272; Munroe et al. (1990) Gene 91:151-158; Ballas et al. (1989) Nucleic Acids Res. 17:7891-7903; Joshi et al. (1987) Nucleic Acid Res. 15:9627-9639.",
                        "The expression cassettes may additionally contain 5′ leader sequences in the expression cassette construct. Such leader sequences can act to enhance translation. Translation leaders are known in the art and include: picornavirus leaders, for example, EMCV leader (Encephalomyocarditis 5′ noncoding region) (Elroy-Stein, O., Fuerst, T. R., and Moss, B. (1989) PNAS USA, 86:6126-6130); potyvirus leaders, for example, TEV leader (Tobacco Etch Virus) (Allison et al. (1986); MDMV leader (Maize Dwarf Mosaic Virus); Virology, 154:9-20), and human immunoglobulin heavy-chain binding protein (BiP), (Macejak, D. G., and P. Sarnow (1991) Nature, 353:90-94; untranslated leader from the coat protein mRNA of alfalfa mosaic virus (AMV RNA 4), (Jobling, S. A., and Gehrke, L., (1987) Nature, 325:622-625; tobacco mosaic virus leader (TMV), (Gallie et al. (1989) Molecular Biology of RNA, pages 237-256, Gallie et al. (1987) Nucl. Acids Res. 15:3257-3273; and maize chlorotic mottle virus leader (MCMV) (Lommel, S. A. et al. (1991) Virology, 81:382-385). See also, Della-Cioppa et al. (1987) Plant Physiology, 84:965-968. Other methods known to enhance translation can also be utilized, for example, introns, and the like.",
                        "The expression cassettes may contain one or more than one gene or nucleic acid sequence to be transferred and expressed in the transformed plant. Thus, each nucleic acid sequence will be operably linked to 5′ and 3′ regulatory sequences. Alternatively, multiple expression cassettes may be provided.",
                        "Generally, the expression cassette will comprise a selectable marker gene for the selection of transformed cells. Selectable marker genes are utilized for the selection of transformed cells or tissues.",
                        "See generally, G. T. Yarranton (1992) Curr. Opin. Biotech., 3:506-511; Christopherson et al. (1992) Proc. Natl. Acad. Sci. USA, 89:6314-6318; Yao et al. (1992) Cell, 71:63-72; W. S. Reznikoff (1992) Mol. Microbiol., 6:2419-2422; Barkley et al. (1980) The Operon, pp. 177-220; Hu et al. (1987) Cell, 48:555-566; Brown et al. (1987) Cell, 49:603-612; Figge et al. (1988) Cell, 52:713-722; Deuschle et al. (1989) Proc. Natl. Acad. Aci. USA, 86:5400-5404; Fuerst et al. (1989) Proc. Natl. Acad. Sci. USA, 86:2549-2553; Deuschle et al. (1990) Science, 248:480-483; M. Gossen (1993) PhD Thesis, University of Heidelberg; Reines et al. (1993) Proc. Natl. Acad. Sci. USA, 90:1917-1921; Labow et al. (1990) Mol. Cell. Bio., 10:3343-3356; Zambretti et al. (1992) Proc. Natl. Acad. Sci. USA, 89:3952-3956; Baim et al. (1991) Proc. Natl. Acad. Sci. USA, 88:5072-5076; Wyborski et al. (1991) Nuc. Acids Res., 19:4647-4653; A. Hillenand-Wissman (1989) Topics in Mol. and Struc. Biol., 10:143-162; Degenkolb et al. (1991) Antimicrob. Agents Chemother., 35:1591-1595; Kleinschnidt et al. (1988) Biochemistry, 27:1094-1104; Gatz et al. (1992) Plant J., 2:397-404; A. L. Bonin (1993) PhD Thesis, University of Heidelberg; Gossen et al. (1992) Proc. Natl. Acad. Sci. USA, 89:5547-5551; Oliva et al. (1992) Antimicrob. Agents Chemother., 36:913-919; Hlavka et al. (1985) Handbook of Exp. Pharmacology, 78; Gill et al. (1988) Nature 334:721-724. Such disclosures are herein incorporated by reference.",
                        "The methods of the invention can also be utilized to find optimal integration sites within a plant genome. In this manner, a plant is transformed with an expression cassette comprising a selectable marker gene. The expression cassette is a target site as the marker gene is flanked by non-identical recombination sites. Transformed protoplast, tissues, or whole plants can be tested to determine the levels of activity of the inserted gene. By comparison of cellular activities of the gene in different insertion sites, preferred integration sites may be found wherein the gene is expressed at high or acceptable levels. These plants can then be utilized with subsequent retargeting techniques to replace the marker gene with other genes or nucleotide sequences of interest. In the same manner, multiple genes may be inserted at the optimal site for expression.",
                        "Alternatively, the process of creating a target line can be combined with the development of a trait-containing transgenic product line. In this scheme, a target site will be obtained as a by-product once the transgenic product line is selected and well characterized. Since a trait gene or a group of genes responsible for the trait is already placed at a particular locus, that site is convenient for stacking of additional new traits through RMCE. A common selectable marker gene cassette is usually used for plant transformation to facilitate the selection of transformed events, such as the 35S:hpt and sams:als cassettes used in soybean transformation (US patent publication WO 00/37662) and the 35S:BAR and UBIQ:GAT cassettes used in maize transformation. Consequently, two incompatible recombinase recognition sites can be incorporated in the selectable marker gene cassette which can then be linked to any trait gene of interest for transformation. Once integrated in a plant genome the incorporated incompatible recombinase sites can be used for RMCE.",
                        "Methods for transformation of plants are known in the art. Suitable methods of transforming plant cells include microinjection (Crossway et al. (1986) Biotechniques 4:320-334), electroporation (Riggs et al. (1986) Proc. Natl. Acad. Sci. USA, 83:5602-5606), Agrobacterium mediated transformation (Hinchee et al. (1988) Biotechnology, 6:915-921), direct gene transfer (Paszkowski et al. (1984) EMBO J., 3:2717-2722), and ballistic particle acceleration (see, for example, Sanford et al., U.S. Pat. No. 4,945,050; WO91/10725 and McCabe et al. (1988) Biotechnology, 6:923-926). Also see, Weissinger et al. (1988) Annual Rev. Genet., 22:421-477; Sanford et al. (1987) Particulate Science and Technology, 5:27-37 (onion); Christou et al. (1988) Plant Physiol. 87:671-674 (soybean); McCabe et al. (1988) Bio/Technology, 6:923-926 (soybean); Datta et al. (1990) Biotechnology, 8:736-740 (rice); Klein et al. (1988) Proc. Natl. Acad. Sci. USA, 85:4305-4309 (maize); Klein et al. (1988) Biotechnology, 6:559-563 (maize); WO91/10725 (maize); Klein et al. (1988) Plant Physiol., 91:440-444(maize); Fromm et al. (1990) Biotechnology, 8:833-839; and Gordon-Kamm et al. (1990) Plant Cell, 2:603-618 (maize); Hooydaas-Van Slogteren & Hooykaas (1984) Nature (London), 311:763-764; Bytebier et al. (1987) Proc. Natl. Acad. Sci. USA, 84:5345-5349 (Liliaceae); De Wet et al. (1985) In The Experimental Manipulation of Ovule Tissues, ed. G. P. Chapman et al., pp. 197-209. Longman, N.Y. (pollen); Kaeppler et al. (1990) Plant Cell Reports, 9:415-418; and Kaeppler et al. (1992) Theor. Appl. Genet., 84:560-566 (whisker-mediated transformation); D'Halluin et al. (1992) Plant Cell, 4:1495-1505 (electroporation); Li et al. (1993)Plant Cell Reports, 12:250-255 and Christou and Ford (1995) Annals of Botany, 75:407-413 (rice); Osjoda et al. (1996) Nature Biotechnology, 14:745-750 (maize via Agrobacterium tumefaciens); all of which are herein incorporated by reference.",
                        "The cells which have been transformed may be grown into plants in accordance with conventional approaches. See, for example, McCormick et al. (1986) Plant Cell Reports, 5:81-84. These regenerated plants may then be pollinated with either the same transformed strain or different strains, and the resulting hybrid having the desired phenotypic characteristic identified. Two or more generations may be grown to ensure that the subject phenotypic characteristic is stably maintained and inherited and then seeds harvested to ensure the desired phenotype or other property has been achieved.",
                        "Embodiments of the invention include the following:",
                        "In one embodiment, a soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site. The target site may be genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
                        "In another embodiment, a soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising a target site, wherein said target site comprises a promoter operably linked to a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site, further wherein the first recombination site is between the promoter and the selectable marker protein-coding sequence. The target site may further comprise at least one additional non-identical recombination site, wherein the at least one additional non-identical recombination site is bounded by the selectable marker protein-coding sequence and the second non-identical recombination site. The target site may be genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
                        "In another embodiment, a soybean cell, plant or seed having stably incorporated in its genome a transfer cassette comprising at least three non-identical recombination sites, where the transfer cassette comprises a polynucleotide encoding a selectable marker protein-coding sequence bounded by a first recombination site and a second non-identical recombination site, wherein the transfer cassette further comprises a third non-identical recombination site bounded by the selectable marker protein-coding sequence and the second non-identical recombination site, wherein the transfer cassette further comprises at least one expression cassette of interest, wherein the at least one expression cassette of interest is bounded by the third non-identical recombination site and the second non-identical recombination site. The transfer cassette may be genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
                        "In another embodiment, a method for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising: (a) transforming a first soybean cell with an isolated nucleic acid fragment comprising at least a first expression cassette of interest adjacent to a target site, wherein said target site comprises a first selectable marker protein-coding sequence, wherein the first selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site; (b) regenerating a transgenic plant from the transformed soybean cell of step (a); (c) introducing into a second soybean cell from the transgenic plant of step (b) a transfer cassette, wherein said transfer cassette comprises a second selectable marker protein-coding sequence, wherein the second selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination sites of the target site; and (d) providing a recombinase that recognizes and implements recombination at the non-identical recombination sites. Optionally, the method may further comprise, between steps (b) and (c), identifying a transgenic plant of step (b), wherein the transgenic plant has desirable levels of gene expression for the at least one first expression cassette of interest.",
                        "In another embodiment, a second method for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising: (a) obtaining a transgenic soybean cell comprising a target site, wherein said target site comprises a first recombination site and a second non-identical recombination site; (b) introducing into the transgenic soybean cell of step (a) a transfer cassette, wherein said transfer cassette comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination site; and (c) providing a recombinase that recognizes and implements recombination at the non-identical recombination sites.",
                        "In another embodiment, a method for creating a transgenic soybean cell comprising a target site suitable for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising transforming a soybean cell with an isolated nucleic acid fragment comprising at least a first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site.",
                        "In one or more of the embodiments, the transfer cassette may further comprise a third non-identical recombination site bounded by the second selectable marker protein-coding sequence and the second non-identical recombination site.",
                        "In one or more of the embodiments, the transfer cassette may further comprise at least one second expression cassette of interest, wherein the at least one second expression cassette of interest is bounded by the third non-identical recombination site and the second non-identical recombination site.",
                        "In one or more of the embodiments, the non-identical recombination sites may be selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
                        "In one or more of the embodiments, the soybean cell may be transformed with the isolated nucleic acid fragment by gene bombardment.",
                        "In one or more of the embodiments, the transfer cassette may be introduced into the soybean cell by gene bombardment.",
                        "In one or more of the embodiments, providing the recombinase comprises transiently expressing within the soybean cell an expression cassette comprising a polynucleotide encoding the recombinase. In another embodiment, the recombinase is FLP. In another embodiment, the FLP has been synthesized using maize preferred codons.",
                        "In one or more or the embodiments, the first selectable marker protein-coding sequence encodes a protein selected from the group consisting of a hygromycin phosphotransferase and a sulfonylurea-tolerant acetolactate synthase. For example, the sulfonylurea-tolerant acetolactate synthase may have an amino acid sequence comprising SEQ ID NO:63 or SEQ ID NO:64.",
                        "In one or more of the embodiments, the target site comprises a promoter operably linked to the first selectable marker protein-coding sequence, wherein the first recombination site is between the promoter and the first selectable marker protein-coding sequence.",
                        "A recombinant DNA construct of the present invention may comprise at least one regulatory sequence.",
                        "A regulatory sequence may be a promoter.",
                        "A number of promoters can be used in recombinant DNA constructs of the present invention. The promoters can be selected based on the desired outcome, and may include constitutive, tissue-specific, inducible, or other promoters for expression in the host organism.",
                        "A composition of the present invention is a plant comprising in its genome any of the recombinant DNA constructs of the present invention. Compositions also may include any progeny of the plant, and any seed obtained from the plant or its progeny, wherein the progeny or seed comprises within its genome the recombinant DNA construct (or suppression DNA construct). Progeny includes subsequent generations obtained by self-pollination or out-crossing of a plant.",
                        "A method of producing seed (for example, seed that can be sold as a trait-containing product offering) comprising any of the preceding methods, and further comprising obtaining seeds from said progeny plant, wherein said seeds comprise in their genome said recombinant DNA construct.",
                        "The development or regeneration of plants containing the foreign, exogenous isolated nucleic acid fragment that encodes a protein of interest is well known in the art. The regenerated plants may be self-pollinated to provide homozygous transgenic plants. Otherwise, pollen obtained from the regenerated plants is crossed to seed-grown plants of agronomically important lines. Conversely, pollen from plants of these important lines is used to pollinate regenerated plants. A transgenic plant of the present invention containing a desired polypeptide is cultivated using methods well known to one skilled in the art.",
                        "The following examples are offered by way of illustration and not by way of limitation."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define singular forms",
                        "define target site",
                        "define transfer cassette",
                        "define donor construct",
                        "define transgenic",
                        "define genome",
                        "define plant",
                        "define progeny",
                        "define transgenic plant",
                        "define heterologous",
                        "define polynucleotide",
                        "define polypeptide",
                        "define messenger RNA",
                        "define cDNA",
                        "define mature protein",
                        "define precursor protein",
                        "define isolated",
                        "define recombinant",
                        "define recombinant DNA construct",
                        "define entry clone",
                        "define regulatory sequences",
                        "define promoter",
                        "define promoter functional in a plant",
                        "define tissue-specific promoter",
                        "define developmentally regulated promoter",
                        "define operably linked",
                        "define expression",
                        "define phenotype",
                        "define introduced",
                        "define transformed cell",
                        "define transformation",
                        "define stable transformation",
                        "define transient transformation",
                        "define allele",
                        "describe sequence alignments",
                        "describe percent identity calculations",
                        "describe standard recombinant DNA techniques",
                        "define antisense inhibition",
                        "define antisense RNA",
                        "define cosuppression",
                        "define sense RNA",
                        "define selection agent",
                        "describe regenerable plant tissue",
                        "describe site-specific integration transformation",
                        "describe RMCE approach",
                        "describe directional RMCE",
                        "describe compositions and methods for targeted integration",
                        "introduce recombinase",
                        "provide recombinase sources",
                        "define non-identical recombination sites",
                        "describe FRT and mutant FRT sites",
                        "discuss recombination site efficiency",
                        "describe plant preferred codons",
                        "optimize gene expression",
                        "eliminate deleterious sequences",
                        "describe FLP recombination target sites",
                        "define minimal FRT recombination site",
                        "describe modified or mutant FRT recombination site",
                        "discuss spacer region mutations",
                        "provide mutant FRT sites",
                        "describe targeted insertion and expression",
                        "discuss variations of the invention",
                        "describe multiple non-identical recombination sites",
                        "discuss adding recombination sites",
                        "describe promoter or transcription initiation region",
                        "discuss expression of coding region",
                        "describe selectable marker sequence",
                        "discuss reducing complexity of integration",
                        "identify preferred sites within the genome",
                        "combine multiple cassettes at one location",
                        "add or delete recombination sites",
                        "bring components together",
                        "describe sexual crossing of transformed plants",
                        "discuss inducible promoters",
                        "describe constitutive promoters",
                        "discuss seed or embryo-specific promoters",
                        "describe promoters of seed-specific genes",
                        "discuss functional expression unit or cassette",
                        "describe expression cassette",
                        "discuss transcriptional initiation region",
                        "describe DNA sequence of interest",
                        "discuss transcriptional and translational termination region",
                        "describe 5' leader sequences",
                        "discuss translation leaders",
                        "describe untranslated leader from AMV RNA 4",
                        "discuss other methods to enhance translation",
                        "describe expression cassettes",
                        "introduce selectable marker genes",
                        "cite prior art references",
                        "describe methods for finding optimal integration sites",
                        "describe process of creating target line",
                        "describe methods for transformation of plants",
                        "cite prior art references for transformation methods",
                        "describe regeneration of transformed plants",
                        "describe identification of desired phenotypic characteristics",
                        "introduce embodiments of the invention",
                        "describe soybean cell, plant, or seed with stably incorporated nucleic acid fragment",
                        "describe target site with selectable marker protein-coding sequence",
                        "describe additional non-identical recombination site",
                        "describe transfer cassette with three non-identical recombination sites",
                        "describe method for stacking multiple expression cassettes",
                        "describe transformation of soybean cell with isolated nucleic acid fragment",
                        "describe regeneration of transgenic plant",
                        "describe introduction of transfer cassette",
                        "describe provision of recombinase",
                        "describe optional identification of transgenic plant",
                        "describe second method for stacking multiple expression cassettes",
                        "describe obtaining transgenic soybean cell with target site",
                        "describe introduction of transfer cassette",
                        "describe provision of recombinase",
                        "describe method for creating transgenic soybean cell with target site",
                        "describe transformation of soybean cell with isolated nucleic acid fragment",
                        "describe optional features of transfer cassette",
                        "describe non-identical recombination sites",
                        "describe transformation methods",
                        "describe provision of recombinase",
                        "describe compositions and methods for producing seed"
                    ],
                    "num_characters": 59504,
                    "outline_medium": [
                        "define terms used in the application",
                        "describe singular and plural forms of words",
                        "define target site and its components",
                        "define transfer cassette and its components",
                        "define donor construct and its components",
                        "define transgenic and its implications",
                        "describe genome and its components",
                        "define plant and its components",
                        "define progeny and its implications",
                        "define transgenic plant and its characteristics",
                        "describe heterologous polynucleotide and its implications",
                        "define polynucleotide and its components",
                        "define polypeptide and its components",
                        "describe messenger RNA and its functions",
                        "define cDNA and its synthesis",
                        "define mature protein and its characteristics",
                        "define precursor protein and its characteristics",
                        "describe isolated materials and their characteristics",
                        "define recombinant and its implications",
                        "describe recombinant DNA construct and its components",
                        "define regulatory sequences and their functions",
                        "describe promoter and its functions",
                        "describe transformation and its implications",
                        "introduce recombinase",
                        "describe non-identical recombination sites",
                        "discuss suitable non-identical recombination sites",
                        "describe FLP recombinase",
                        "describe Cre recombinase",
                        "discuss optimizing nucleotide sequences for expression",
                        "describe plant preferred codons",
                        "discuss modifying gene sequences for expression",
                        "describe FLP recombination target sites",
                        "discuss mutant FRT sites",
                        "describe targeted insertion and expression of nucleotide sequences",
                        "discuss variations of the invention",
                        "describe providing a promoter or transcription initiation region",
                        "discuss advantages of the present system",
                        "describe combining multiple cassettes at one location",
                        "discuss bringing components of the system together",
                        "describe inducible and constitutive promoters",
                        "discuss seed or embryo-specific promoters",
                        "describe functional expression units or cassettes",
                        "describe expression cassettes",
                        "introduce selectable marker genes",
                        "cite prior art references",
                        "explain method for finding optimal integration sites",
                        "describe process of creating target line",
                        "discuss methods for plant transformation",
                        "describe regeneration of transformed plants",
                        "outline embodiments of the invention",
                        "describe soybean cell, plant, or seed with stably incorporated nucleic acid fragment",
                        "outline method for stacking multiple expression cassettes",
                        "describe method for creating transgenic soybean cell",
                        "specify characteristics of transfer cassette",
                        "describe transformation methods",
                        "outline embodiments of recombinase and selectable marker protein-coding sequences",
                        "describe compositions and methods of producing seed"
                    ],
                    "outline_short": [
                        "define key terms",
                        "describe recombinant DNA constructs",
                        "explain regulatory sequences",
                        "introduce promoters and their functions",
                        "describe expression and phenotype",
                        "explain transformation and stable transformation",
                        "introduce selection agents and selectable marker genes",
                        "describe regenerable plant tissue",
                        "explain site-specific integration transformation",
                        "introduce RMCE approach using two incompatible recombination sites",
                        "describe compositions and methods for directional targeted integration of exogenous nucleotides",
                        "define recombinase",
                        "describe non-identical recombination sites",
                        "discuss FLP recombinase",
                        "describe FRT recombination target sites",
                        "outline methods for targeted insertion and expression of nucleotide sequences",
                        "discuss variations of the invention",
                        "describe means for bringing components of the system together",
                        "outline promoters for use in the invention",
                        "describe expression cassettes",
                        "describe expression cassettes",
                        "discuss selectable marker genes",
                        "outline methods for plant transformation",
                        "describe embodiments of the invention",
                        "detail methods for stacking multiple expression cassettes",
                        "provide additional embodiments and variations",
                        "discuss compositions and methods for producing seed"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "Aspects of the present invention are exemplified in the following Examples. It should be understood that these Examples, while indicating embodiments of the invention, are given by way of illustration only. From the above discussion and these Examples, one skilled in the art can ascertain the essential characteristics of this invention, and without departing from the spirit and scope thereof, can make various changes and modifications of the invention to adapt it to various usages and conditions. Thus, various modifications of the invention in addition to those shown and described herein will be apparent to those skilled in the art from the foregoing description. Such modifications are also intended to fall within the scope of the appended claims.",
                        "In the discussion below, parts and percentages are by weight and degrees are Celsius, unless otherwise stated. Sequences of promoters, cDNA, adaptors, and primers listed herein are in the 5′ to 3′ orientation unless described otherwise. Routine techniques in molecular biology are described in Ausubel et al. Current Protocols in Molecular Biology; John Wiley & Sons: New York, 1990 and Sambrook et al. Molecular Cloning: A Laboratory Manual; Cold Spring Harbor Laboratory Press: Cold Spring Harbor, 1989."
                    ],
                    "subsections": [
                        {
                            "title": "FLP/FRT Mediated RMCE Experimental Design and DNA Construction",
                            "paragraphs": [
                                "The target QC288A and donor QC329 constructs were designed each containing a FRT1 site (solid triangle) and a FRT87 site (open triangle) in the same orientation (FIG. 1A, FIG. 2A, FIG. 1B, FIG. 2B). FRT1 is the wild-type recombination site for FLP recombinase and FRT87 is a modified recombination site (PCT Publication No. WO2007011733 published on Jan. 25, 2007). The circular QC329 DNA could integrate into the linear QC288A DNA previously placed in soybean genome by FLP recombinase mediated DNA recombination at either the FRT1 site or the FRT87 site to form collinear intermediates that contained two FRT1 sites and two FRT87 sites. FLP recombinase mediated excision could occur to excise the intervening fragment either between the two FRT1 sites or between the FRT87 sites. The net result of the integration via recombination between one identical pair of FRT sites and subsequent excision via recombination between the other pair of FRT sites would be the replacement the target DNA with the recombined RMCE DNA QC288A329 (FIG. 1C, FIG. 3A). If the gene excision step failed to occur, the intermediates would remain as SSI events containing all the components of both the target and donor constructs (FIG. 3B, FIG. 3C).",
                                "The target construct QC288A contained a selectable marker gene hpt driven by a constitutive promoter scp1 and transgenic events were selected with hygromycin. The donor construct QC329 contained a promoter-less selectable marker gene als that would not be expressed unless a promoter was placed in front of it. During retransformation the promoter-less als gene of QC329 could be brought downstream of the scp1 promoter by RMCE and the resulted QC288A329 DNA would enable retransformation events to be selected with chlorsulfuron due to the als gene activation. SSI events with QC329 integrated at the FRT1 site would also be similarly selected. However, random integration events of QC329 would not be able to survive chlorsulfuron selection unless the promoter-less als gene happened to insert downstream of a native promoter. A yellow fluorescent reporter gene cassette ubiq10:yfp was included in QC288A and a cyan fluorescent reporter gene cassette ubq:cfp was included in QC329 to facilitate transgenic events characterization (FIG. 1A, FIG. 1B, FIG. 2A, FIG. 2B).",
                                "The target DNA construct QC288 was made through multiple cloning steps using components from existing DNA constructs (Li et al, (2007) Plant Mol. Biol. 65:329-341). Restriction enzymes and DNA modifying enzymes such as DNA polymerase Klenow fragment and DNA ligase were used according to manufacturers' recommendations (New England Biolabs, Beverly, Mass., USA; Promega, Madison, Wis., USA; or Invitrogen, Carlsbad, Calif., USA). The FRT87 recombination site DNA fragment was released from construct PHP20234 with BamHI/SmaI digestion and cloned into BamHI/PvuII sites of pZSL141 to make QC278 consisted of als-FRT87. The FRT1 recombination site was made by annealing two 92 by complementary oligos SEQ ID NO:6 and 7 engineered with multiple cloning sites (Sigma-Genosys, The Woodlands, Tex., USA). The BamHI/HpaI FRT1 DNA fragment was cloned into the BamHI/SmaI sites of construct pZSL90 to make QC280 consisted of scp1-FRT1:yfp:nos. The DNA fragment containing hpt coding sequence and nos terminator was release from pZSL93 with SpeI/XmaI digestion and cloned into the SpeI/XmaI sites of QC280 to make QC282 consisted of scp1-FRT1:hpt:nos+yfp:nos. The scp1-FRT1:hpt:nos+yfp:nos fragment was released from QC282 with Hind III/EcoRV digestion and cloned into the HindIII/BamHI sites of QC278 (the BamHI site was completely filled in with Klenow DNA polymerase) to make QC284 consisted of scp1-FRT1:hpt:nos+yfp:nos-FRT87. The ubiq10 promoter fragment was released from construct QC257i with BamHI/XmaI digestion and cloned into the BamHI/XmaI sites of QC282 to make QC286 consisted of scp1-FRT1:hpt:nos+ubiq10:yfp:nos. The final target construct QC288 consisted of scp1-FRT1:hpt:nos+ubiq10:yfp:nos-FRT87 was made by cloning BamHI/SphI fragment from QC286 into the BamHI/SphI sites of QC284 (FIG. 2A).",
                                "The donor construct QC329 was made by first cloning the BamHI/HindIII FRT1 DNA fragment into the BamHI/HindIII sites of construct pSMamCyan to make QC281 consisted of FRT1:cfp:nos. The FRT87 site was added by cloning the AflII SpeI fragment of the above QC284 (the SpeI site was completely filled with Klenow DNA polymerase) into the AflII/EcoRI sites of QC281 (the EcoRI site was completely filled in with Klenow DNA polymerase) to make QC283 consisted of FRT1:cfp:nos-FRT87. The ubiq10 promoter fragment was released from QC257i with BamHI/XmaI digestion and cloned into the BamHI/XmaI sites of QC283 to make QC285 consisted of FRT1-ubiq10:cfp:nos-FRT87. Separately, the als:pinII fragment was released from QC257i with BglII/KpnI digestion (the BglII site was completely filled in with Klenow DNA polymerase) and cloned into the EcoCRI/KpnI sites of pZSL81 to make QC279 consisted of als:pinII. The SpeI/XmaI fragment of QC279 was then cloned into the SpeI/Xmal sites of QC285 to make QC287 consisted of FRT1-als:pinII+ubiq10:cfp:nos-FRT87. The ubiq10 promoter was later replaced with a soybean ubiquitin promoter ubq by cloning the XmaI/NcoI ubq promoter fragment from QC319 into the XmaI/NcoI sites of QC287 to make the final donor vector QC329 consisted of FRT1-als:pinII+ubq:cfp:nos-FRT87 (FIG. 2B).",
                                "The FLP expression construct QC292 containing scp1:flp:pinII was made by simply cloning the BamHI/HindIII scp1 promoter fragment from pZSL90 into the BamHI/HindIII sites of construct PHP5096 (FIG. 2C)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "design target QC288A and donor QC329 constructs with FRT1 and FRT87 sites",
                                "describe FLP recombinase mediated DNA recombination and excision",
                                "introduce selectable marker genes hpt and als",
                                "describe construction of target QC288A with scp1 promoter and FRT1/FRT87 sites",
                                "describe construction of donor QC329 with FRT1/FRT87 sites and als gene",
                                "describe construction of FLP expression construct QC292",
                                "describe DNA fragment release and purification",
                                "describe cloning of DNA fragments into plasmids",
                                "describe restriction enzyme digestion and ligation",
                                "describe DNA fragment assembly and verification",
                                "describe final construct verification"
                            ],
                            "num_characters": 5611,
                            "outline_medium": [
                                "design FLP/FRT mediated RMCE system",
                                "construct target DNA QC288A",
                                "construct donor DNA QC329",
                                "construct FLP expression vector QC292",
                                "describe DNA construction process"
                            ],
                            "outline_short": [
                                "design FLP/FRT mediated RMCE system",
                                "construct target and donor DNA vectors"
                            ]
                        },
                        {
                            "title": "Target Event Creation and Characterization",
                            "paragraphs": [
                                "The scp1-FRT1:hpt:nos+ubiq10:yfp:nos-FRT87 cassette of QC288 was released as a 4544 by DNA fragment QC288A with AscI digestion, resolved by agarose gel electrophoresis, and purified using a Qiagen gel extraction kit (Qiagen, Valencia, Calif., USA). Soybean embryogenic suspension cultures were transformed with QC288A DNA following the biolistic bombardment transformation protocol using 30 μg/ml hygromycin for transgenic events selection (Li et al, (2007) Plant Mol. Biol. 65:329-341; Klein et al. (1987) Nature 327:70-73; U.S. Pat. No. 4,945,050)).",
                                "Soybean somatic embryos from the Jack cultivar were induced as follows. Cotyledons (smaller than 3 mm in length) were dissected from surface-sterilized, immature seeds and were cultured for 6-10 weeks under fluorescent light at 26° C. on a Murashige and Skoog media (“MS media”) containing 0.7% agar and supplemented with 10 mg/ml 2,4-dichlorophenoxyacetic acid (2,4-D). Globular stage somatic embryos, which produced secondary embryos, were then excised and placed into flasks containing liquid MS medium supplemented with 2,4-D (10 mg/ml) and cultured in the light on a rotary shaker. After repeated selection for clusters of somatic embryos that multiplied as early, globular staged embryos, the soybean embryogenic suspension cultures were maintained in 35 ml liquid media on a rotary shaker, 150 rpm, at 26° C. with fluorescent lights on a 16:8 hour day/night schedule. Cultures were subcultured every two weeks by inoculating approximately 35 mg of tissue into 35 ml of the same fresh liquid MS medium.",
                                "Soybean embryogenic suspension cultures were then transformed by the method of particle gun bombardment using a DuPont™ Biolistic™ PDS1000/HE instrument (helium retrofit) (Bio-Rad Laboratories, Hercules, Calif.). To 50 μl of a 60 mg/ml 1.0 mm gold particle suspension were added (in order): 30 μl of 10 ng/μl QC288A DNA fragment, 20 μl of 0.1 M spermidine, and 25 μl of 5 M CaCl2. The particle preparation was then agitated for 3 minutes, spun in a centrifuge for 10 seconds and the supernatant removed. The DNA-coated particles were then washed once in 400 μl 100% ethanol and resuspended in 45 μl of 100% ethanol. The DNA/particle suspension was sonicated three times for one second each. 5 μl of the DNA-coated gold particles was then loaded on each macro carrier disk.",
                                "Approximately 300-400 mg of a two-week-old suspension culture was placed in an empty 60×15 mm Petri dish and the residual liquid removed from the tissue with a pipette. For each transformation experiment, approximately 5 to 10 plates of tissue were bombarded. Membrane rupture pressure was set at 1100 psi and the chamber was evacuated to a vacuum of 28 inches mercury. The tissue was placed approximately 3.5 inches away from the retaining screen and bombarded once. Following bombardment, the tissue was divided in half and placed back into liquid media and cultured as described above.",
                                "Five to seven days post bombardment, the liquid media was exchanged with fresh media containing 30 μg/ml hygromycin as selection agent. This selective media was refreshed weekly. Seven to eight weeks post bombardment, green, transformed tissue was observed growing from untransformed, necrotic embryogenic clusters. Isolated green tissue was removed and inoculated into individual flasks to generate new, clonally propagated, transformed embryogenic suspension cultures. Each clonally propagated culture was treated as an independent transformation event and subcultured in the same liquid MS media supplemented with 2,4-D (10 mg/ml) and 30 μg/ml hygromycin selection agent to increase mass. The embryogenic suspension cultures were then transferred to solid agar MS media plates without 2,4-D supplement to allow somatic embryos to develop. A sample of each event was collected at this stage for PCR and quantitative PCR analysis.",
                                "Cotyledon stage somatic embryos were dried-down (by transferring them into an empty small Petri dish that was seated on top of a 10 cm Petri dish to allow slow dry down) to mimic the last stages of soybean seed development. Dried-down embryos were placed on germination solid media, and transgenic soybean plantlets were regenerated. The transgenic plants were then transferred to soil and maintained in growth chambers for seed production.",
                                "Eighty two putative transgenic events were produced from transformation experiments with the target DNA fragment QC288A. Somatic embryo samples of the events were analyzed by quantitative PCR (qPCR), regular PCR, and Southern to identify events with a single complete copy of the transgene. Since DNA could be fragmented during biolistic bombardment, three major components, scp1, hpt, and yfp of QC288A were checked by qPCR. Endogenous controls were used to normalize different samples and a calibrator containing single copy of the transgene component was included for calculating the relative transgene copy numbers of the samples by comparing their relative quantifications to that of the calibrator. Since the relative quantification values contained fractions, copy numbers were considered to be 0, 1, or 2 for values of <0.3, 0.4-1.4, or 1.5-2.4, respectively. Approximately 50% of the 82 events contained one copy of the QC288A transgene based on the qPCR analysis.",
                                "Genomic DNA samples of transgenic events were analyzed by qPCR using Taqman technology and the universal Taqman DNA polymerase reaction mixture in a 7500 real time PCR system (Applied Biosystems, Foster City, Calif.). Relative quantification methodology was applied in single tube duplex PCR reactions, one for the target gene and the other for an endogenous control gene to normalize the reactions across samples. After 2 minutes incubation at 50° C. to activate the Taq DNA polymerase and 10 minutes incubation at 95° C. to denature the DNA templates, 40 cycles of 15 seconds at 95° C. and 1 minute at 60° C. were performed. A soybean heat shock protein (hsp) gene was used as the endogenous control. A transgenic DNA sample known containing single copy of the transgene component was included as the calibrator. Three components including scp1 promoter, hpt, yfp of the target QC288A were analyzed. Primers used were SEQ ID NO:8, SEQ ID NO:9, and VIC labeled MGB probe SEQ ID NO:10 (Applied Biosystems) for the hsp control, SEQ ID NO:11, SEQ ID NO:12, and FAM labeled BHQ1 probe SEQ ID NO:13 (Sigma Genosis) for scp1, SEQ ID NO:14, SEQ ID NO:15, and FAM labeled BHQ1 probe SEQ ID NO:16 for hpt, SEQ ID NO:17, SEQ ID NO:18, and FAM labeled BHQ1 probe SEQ ID NO:19 for yfp.",
                                "The intactness of QC288A transgene ends was checked by regular PCR. Soybean genomic DNA was prepared from leaf discs or somatic embryos using an extraction buffer containing 7 M urea, 1.5 M NaCl, 50 mM Tris, pH 8.0, 20 mM EDTA, and 1% N-lauroyl-sarcosine followed by phenol/chloroform extractions and isopropanol precipitations. A typical 25 μl PCR reaction consisted of 10 ng genomic DNA, 200 nM of each primer, 200 μM dNTPs, 1×PCR buffer, and 2.5 units of High Fidelity Taq DNA polymerase (Invitrogen). A typical PCR was done at 94° C. for 3 min followed by 40 cycles at 94° C. for 0.5 min denaturizing, 60° C. for 1 min annealing, 68° C. for 1-3 min extension (depending on the size of PCR amplicon), and then a final 5 min extension at 68° C. using a GeneAmp 9700 PCR system (Applied Biosystems). The 5′ end intactness of the QC288A transgene in target plants was analyzed with primers SEQ ID NO:23 and SEQ ID NO:24 to amplify a 657 by band. The 3′ end intactness of the QC288 transgene was analyzed with primers SEQ ID NO:25 and SEQ ID NO:26 to amplify a 441 by band. Only events positive for both the PCR analyses were selected.",
                                "Selected events were further analyzed by Southern with two probes hpt and yfp. Soybean genomic DNA was digested with EcoRV, resolved in 0.7% agarose gel, and blotted to a nylon membrane using a TurboBlotter (Schleicher & Schuell Bioscience, Germany) with 20×SSC (Invitrogen) and crosslinked by UV light. Digoxigenin labeled DNA probes were made by PCR from plasmid DNA templates using the PCR DIG probe synthesis kit (Roche Applied Science, Indianapolis, Ind., USA). The 794 by hpt probe was made with primers SEQ ID NO:28 and SEQ ID NO:29. The 693 by yfp probe was made with primers SEQ ID NO:30 and SEQ ID NO:31. Southern blots were hybridized in DIG EasyHyb solution and detected with CDP-Star according to the manufacturer (Roche Applied Science). Hybridization signals were captured on BioMax light films (Eastman Kodak, New Haven, Conn., USA).",
                                "The restriction enzyme EcoRV cuts QC288A twice in the middle at positions 2078 and 3246. To each copy of the transgene, the hpt probe would hybridize to a 2078 or larger band, and the yfp probe would hybridize to a 1299 by or larger band. The Southern analysis confirmed the copy numbers determined by qPCR for most events. Four events, each determined to contain a single intact copy of QC288A by qPCR, PCR, and Southern analyses, were selected for RMCE retransformation (Table 1).",
                                "Table 1 presents a summary of the analysis of single copy transgenic events selected at somatic embryo stage for RMCE retransformation. From a total of 82 events, four were selected as being single intact copy events as determined by the qPCR, Southern, and transgene end-specific PCR. Fraction values were produced by qPCR for transgene copy numbers. A value less than 0.3 was considered as zero copy and a value between 0.4 and 1.4 was considered as one copy. Due to the variations, different components of the same transgenic DNA were checked in order to make a copy number call. The intactness of FRT1 site was checked by PCR with primers Scp1-S/Hygro-A (SEQ ID NO:23/SEQ ID NO:24). The intactness of FRT87 site was checked with primers Yfp-3/Frt87-A (SEQ ID NO:25/SEQ ID NO:26)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe transformation of soybean embryogenic suspension cultures with QC288A DNA",
                                "describe biolistic bombardment transformation protocol",
                                "describe selection of transgenic events with hygromycin",
                                "describe somatic embryo induction and culture",
                                "describe transformation and selection of transgenic events",
                                "describe PCR analysis of transgenic events",
                                "describe qPCR analysis of transgenic events",
                                "describe Southern blot analysis of transgenic events",
                                "describe intactness analysis of QC288A transgene ends",
                                "describe selection of single copy transgenic events",
                                "describe summary of analysis of single copy transgenic events",
                                "describe qPCR analysis of transgene copy numbers",
                                "describe PCR analysis of transgene ends",
                                "describe Southern blot analysis of transgene copy numbers",
                                "describe selection of four single copy transgenic events for RMCE retransformation",
                                "describe maintenance of transgenic events as suspension cultures",
                                "describe retransformation with donor construct QC329 and FLP construct QC292",
                                "describe selection of retransformation events with chlorsulfuron",
                                "describe PCR screening of retransformation events"
                            ],
                            "num_characters": 9807,
                            "outline_medium": [
                                "create target DNA QC288A",
                                "transform soybean embryogenic suspension cultures with QC288A",
                                "select transgenic events with hygromycin",
                                "analyze transgenic events by qPCR",
                                "analyze transgenic events by PCR",
                                "analyze transgenic events by Southern blot",
                                "select single copy transgenic events",
                                "characterize transgenic events",
                                "summarize results of transgenic event analysis"
                            ],
                            "outline_short": [
                                "create target DNA construct QC288",
                                "transform soybean embryogenic suspension cultures with QC288",
                                "select and characterize transgenic events by PCR, qPCR, and Southern",
                                "identify single copy transgenic events for RMCE retransformation"
                            ]
                        },
                        {
                            "title": "Retransformation Event Creation and Characterization by PCR",
                            "paragraphs": [
                                "Four transgenic events containing a single complete copy of the target QC288A DNA were maintained as suspension cultures and retransformed with the donor construct QC329 and the FLP construct QC292 at 10:1 ratio following the same biolistic bombardment transformation protocol described in EXAMPLE 2 except that retransformation events were selected using 90 ng/ml chlorsulfuron (DuPont, Wilmington, Del., USA). RMCE would only occur in cells containing all three DNA QC288A, QC329, and QC292 and would bring the promoter-less als coding region of QC329 downstream of the scp1 promoter of QC288A previously placed in soybean genome for expression and thus chlorsulfuron resistance.",
                                "The somatic embryo samples of putative retransformation events were screened by PCR as described in EXAMPLE 2 using construct-specific primers as depicted in FIGS. 1A-1E. Plasmid DNA of constructs QC288, QC329, QC292 were included as positive controls. An unrelated construct QC165 was used as a positive control for RMCE DNA QC288A329 since they both contain the same scp1:als cassette (FIG. 1C, FIG. 1E). Wild-type DNA and no DNA template negative controls were also included (FIG. 4).",
                                "QC288A-specific PCR was done using primers SEQ ID NO:11 and SEQ ID NO:24 to give a 416 by band (FIG. 1A). Five events M-1, A-1, B-1, B-2, and N-1 were positive and two events M-2 and M-3 were negative (FIG. 4A). The results suggested that the two negative events no longer contained the hpt component of QC288A. Event B-1 produced a much weaker QC288A-specific PCR band suggesting that it contained less QC288A DNA than other positive events. QC288A329-specific PCR was done using primers SEQ ID NO:11 and SEQ ID NO:27 to give a 497 by band. The same primers would give a 426 by band to the RMCE positive control construct QC165 (FIG. 1E). The same two events M-2 and M-3, while negative for QC288A, were positive for QC288A329 suggesting that they were complete RMCE events. The weak QC288A positive event B-1 was also positive for QC288A329, suggesting that this event was a chimeric RMCE event that still contained some original target cells. The other four QC288A positive events M-1, A-1, B-2, and N-1 were negative for QC288A329, suggesting that they were the original target events that had escaped the chlorsulfuron selection as false retransformation events. As expected, a slightly smaller band was detected in the positive control QC165 (FIG. 4B). QC329-specific PCR was done with primers SEQ ID NO:36 and SEQ ID NO:27 to give a 1027 by band. The same primers would give a 982 by band to the RMCE positive control construct QC165 (FIG. 1B, FIG. 1E). A weak QC329-specific PCR band was detected in event M-1, suggesting that this event was likely a chimeric random integration event with a portion of cells harboring the QC329 DNA (FIG. 4C). QC292-specific PCR was done with primers SEQ ID NO:11 and SEQ ID NO:37 to give a 368 by band (FIG. 1D). A weak band was detected in event M-3, suggesting that this RMCE event might contain cells harboring the QC292 DNA (FIG. 4D). Overall, three putative RMCE events M-2, M-3, and B-1 were identified.",
                                "The three putative RMCE events M-2, M-3, and B-1 as well as their target parents M and B were analyzed by another PCR using primers SEQ ID NO:23 and SEQ ID NO:26 which would amplify a 5982 by band from QC288A329 and a smaller 4393 by band from QC288A (FIG. 1A, FIG. 1C). As expected, an approximately 5982 by band was detected in the three putative RMCE events M-2, M-3, and B-1; and an approximately 4393 by band was detected in their target parents M and B (FIG. 4E). More analyses as described below later confirmed that only M-2 and B-1 were true RMCE events while M-3 was indeed a SSI event with the donor DNA QC329 simply integrated at the FRT1 site of the target DNA QC288A."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe PCR screening of retransformation events",
                                "describe QC288A-specific PCR analysis",
                                "describe QC288A329-specific PCR analysis",
                                "describe QC329-specific PCR analysis",
                                "describe QC292-specific PCR analysis",
                                "describe additional PCR analysis of retransformation events",
                                "describe confirmation of true RMCE events"
                            ],
                            "num_characters": 3807,
                            "outline_medium": [
                                "retransform single copy transgenic events with QC329 and QC292",
                                "select retransformation events with chlorsulfuron",
                                "analyze retransformation events by PCR"
                            ],
                            "outline_short": [
                                "retransform single copy transgenic events with donor and FLP constructs and characterize by PCR"
                            ]
                        },
                        {
                            "title": "Retransformed T0 Plant Characterization by PCR and qPCR",
                            "paragraphs": [
                                "T0 plants were regenerated from events M-1, M-2, M-3, B-1, and B-2 and analyzed by PCR and qPCR as described in EXAMPLE 2. DNA recombination at the FRT1 site was checked by regular PCR with two sets of primers SEQ ID NO:11/SEQ ID NO:24 and SEQ ID NO:11/SEQ ID NO:27. The original QC288A would be positive for SEQ ID NO:11/SEQ ID NO:24 and negative for SEQ ID NO:11/SEQ ID NO:27 while the recombination DNA QC288A329 would be negative for SEQ ID NO:11/SEQ ID NO:24 and positive for SEQ ID NO:11/SEQ ID NO:27 (FIG. 1A, FIG. 1C).",
                                "DNA recombination was further evaluated by the presence or absence of QC288A and QC329 components checked by qPCR. Since the scp1 promoter is outside of the FRT1 and FRT87 and thus not directly affected by DNA recombination, all events should be positive for scp1 qPCR. If an event only contained QC288A, the event would be positive for the QC288A-specific hpt, yfp qPCR. If an event contained both QC288A and QC329 in the cases of random integration and SSI, the event would be positive for all the hpt, yfp, and cfp qPCR. A RMCE event, in which the segment between the FRT1 and FRT87 sites of QC288A was replaced by the corresponding segment of QC329, would be negative for the QC288A-specific hpt, yfp qPCR and positive for the QC329-specific cfp qPCR (FIG. 1A, FIG. 1B, FIG. 1C). Genomic DNA samples of the retransformation events were analyzed by qPCR for hpt, yfp as described in EXAMPLE 2. The qPCR for cfp was done similarly using primers SEQ ID NO:20, SEQ ID NO:21, and FAM labeled MGB probe SEQ ID NO:22.",
                                "Table 2 presents the results of both the regular PCR and qPCR analyses described above for T0 plants from the five retransformed lines M-1, M-2, M-3, B-1, and B-2 and for their target parent plants M and B as controls. The QC288A-specific PCR was done with primers 35S-277F (SEQ ID NO:11) and Hygro-A (SEQ ID NO:24) as a target DNA control. The QC28A329-specific PCR was done with primers 35S-277F (SEQ ID NO:11) and Als-3 (SEQ ID NO:27) to check for DNA recombination at the FRT1 site. The event identities were determined by comparing all the results to predictions based on the construct maps presented in FIGS. 1A-1E. A target parent event would be positive for 355-277F/Hygro-A (SEQ ID NO:11/SEQ ID NO:24) and negative for 355-277F/Als-3 (SEQ ID NO:11/SEQ ID NO:27) PCR, positive for scp1, hpt, yfp and negative for cfp qPCR. A false retransformation event would be identical to its target parent since it was the original target that had escaped retransformation selection. A random integration event would be positive for 355-277F/Hygro-A (SEQ ID NO:11/SEQ ID NO:24) and negative for 355-277F/Als-3 (SEQ ID NO:11/SEQ ID NO:27) PCR, and positive for all scp1, hpt, yfp, and cfp qPCR. An RMCE event would be negative for 35S-277F/Hygro-A (SEQ ID NO:11/SEQ ID NO:24) and positive for 355-277F/Als-3 (SEQ ID NO:11/SEQ ID NO:27) PCR, and negative for hpt and yfp qPCR, and positive for scp1, and cfp qPCR. A SSI event would be negative for 35S-277F/Hygro-A and positive for 35S-277F/Als-3 PCR, and positive for all scp1, hpt, yfp, and cfp qPCR.",
                                "In summary: M-2 and B-1 are two RMCE events derived from two independent target lines; M-1 is a random integration event; M-3 is a SSI event integrated at the FRT1 site; and B-2 is a false retransformation event."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce retransformation events",
                                "describe PCR analysis",
                                "describe qPCR analysis",
                                "present results in table",
                                "interpret results based on construct maps",
                                "summarize event identities"
                            ],
                            "num_characters": 3304,
                            "outline_medium": [
                                "perform PCR and qPCR analysis",
                                "interpret results using construct maps",
                                "classify events based on results"
                            ],
                            "outline_short": [
                                "characterize retransformed T0 plants"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Southern Analysis of Retransformed T0 Plants**",
                                "T0 plants from retransformed lines M-1, M-2, M-3, B-1, B-2 were analyzed by Southern side-by-side with their corresponding target parents M and B T1 plants with probes yfp and cfp. Soybean genomic DNA was digested with NdeI, resolved in 0.7% agarose gel, and blotted to a nylon membrane using a TurboBlotter™ (Schleicher & Schuell Bioscience, Germany) with 20×SSC (Invitrogen) and crosslinked by UV light. Digoxigenin-labeled DNA probes were made by PCR from plasmid DNA templates using the PCR DIG probe synthesis kit (Roche Applied Science, Indianapolis, Ind., USA). The 693 by yfp probe was made with primers SEQ ID NO:30 and SEQ ID NO:31. The 546 by cfp probe was made with primers SEQ ID NO:32 and SEQ ID NO:33. Southern blots were hybridized in DIG EasyHyb™ solution and detected with CDP-Star® according to the manufacturer (Roche Applied Science). Hybridization signals were captured on Kodak™ BioMax® light films (Eastman Kodak, New Haven, Conn., USA).",
                                "The restriction enzyme NdeI cuts the 4544 by QC288A DNA once at position 1119 into a 1188 by 5′ half and a 3356 by 3′ half, and also cuts the 8533 by QC288A329 DNA once at position 4395 into a 4394 by 5′ half and a 1739 by 3′ half (FIG. 1A, FIG. 1C). In addition to the transgene-specific NdeI site, the enzyme has to cut another nearby NdeI site in soybean genomic DNA in order to produce a Southern band of certain size to be hybridized by a transgene probe.",
                                "The yfp and cfp probes were used to analyze the 3′ half of the transgene locus. A target event would be positive for yfp and negative for cfp, a RMCE event would be negative for yfp and positive for cfp, and a random integration event or a SSI event would be positive for both yfp and cfp. More accurately, the cfp band in a RMCE sample would be 1617 by smaller than the corresponding yfp band in its target parent sample because the 1739 by 3′ half of QC288A329 is 1617 by shorter than the 3356 by 3′ half of QC288A. As expected, the yfp probe detected single band in the target events M, B, the random integration event M-1, the SSI event M-3, and the false event B-2 but not in the two RMCE events M-2 and B-1 (FIG. 5A). The cfp probe detected single band in the random integration event M-1, the SSI event M-3, and the RMCE events B-1, but three bands in another RMCE event M-2 (FIG. 5B). As expected, the middle cfp band in M-2 is approximately 1617 by smaller than the yfp band in M while the cfp band in B-1 is approximately 1617 by smaller than the yfp band in B. The two extra cfp bands in M-2 are of random sizes and are likely randomly integrated partial copies of the cfp gene that could not be detected by the qPCR (Table 2) that, with a 69 by PCR amplicon, would detect only a small part of what the 546 by cfp probe could detect in Southern.",
                                "**Confirmation of DNA Recombination by Sequencing**",
                                "To check if DNA recombination at FRT1 and FRT87 sites was accurate, the transgenic gene QC288A329 was cloned by PCR amplification from M-2, M-3, and B-1. The 5′ half was amplified as a 2730 by PCR fragment using primers SEQ ID NO:23 and SEQ ID NO:34 while the 3′ half was amplified as a 3351 by PCR fragment using primers SEQ ID NO:35 and SEQ ID NO:26 (FIG. 1C). A 99 by segment between the SEQ ID NO:35 and SEQ ID NO:34 primers overlaps the two fragments so that the entire transgene can be sequenced. The PCR fragments were cloned into pCR2.1-TOPO vector with TA cloning kit according to the manufacturer (Invitrogen). Plasmid DNA was prepared with Qiaprep plasmid DNA kit (Qiagen) and sequenced using Applied Biosystems 3700 capillary DNA analyzer and dye terminator cycle DNA sequencing kit. Sequence assembly and alignment were done using Vector NTI suite programs (Invitrogen). Sequence searches were done remotely using the NCBI advanced BLAST algorithm.",
                                "Since QC288A and QC288A329 sequences diverge downstream of the FRT1 site, with hpt in QC288A and als in QC288A329, and upstream of the nos terminator, with yfp in QC288A and cfp in QC288A329 (FIGS. 1A, C), alignment of the transgene sequences with the predicted QC288A and QC288A329 map sequences would confirm RMCE recombination at the sequence level. However, since the same 3351 by SEQ ID NO:35/SEQ ID NO:26 PCR band could be obtained entirely from the donor construct QC329, the PCR using SEQ ID NO:35 and SEQ ID NO:26 primers would not distinguish the FRT1 site SSI event M-3 from the RMCE events M-2 and B-1.",
                                "Both the predicted 5′ half 2730 by band and 3′ half 3551 by band were successfully amplified from the three events M-2, M-3, and B-1, and subsequently cloned and sequenced. Their sequences were identical to the predicted QC288A329 map sequence and thus confirmed that DNA recombination occurred at the FRT1 site was accurate for the two RMCE events M-2 and B-1 and also for the SSI event M-3.",
                                "**Analysis of T0 and T1 Plants from Selected Target Lines**",
                                "Transgenic target events were produced from transformation experiments with the target DNA fragment QC288A as described in EXAMPLE 2. Four target events selected at tissue culture stage were retransformed and RMCE retransformation events were obtained as described in EXAMPLES 3-6. Simultaneously, seventy-nine T0 transgenic target plants were produced from thirty-three target events by regenerating 1-3 plants per event. Leaf samples of all the T0 plants were analyzed by the same qPCR, PCR, and Southern analyses described above for copy number and gene intactness confirmation. Twenty single copy events (or lines) were selected based on the analyses and seed sets. Sixteen seeds from one T0 plant from each of ten lines selected from the twenty were planted to get T1 plants. Leaf samples of all the T1 plants were analyzed by three qPCR analyses specific to the scp1 promoter, ubq10 promoter, and yfp gene to check for segregation of the QC288A transgene. Homozygous T1 plants were obtained from eight lines. Three homozygous target lines A, B, and C were selected for RMCE retransformation experiments.",
                                "Table 3 presents the results of qPCR, PCR, and Southern analyses on T0 plants from three transgenic target lines. Fraction values were produced by qPCR for transgene copy numbers. A value less than 0.3 was considered as zero copy, a value between 0.4 and 1.3 was considered as one copy, and a value between 1.4 and 2.3 was considered as two copies. Multiple components of the target DNA (FIG. 1A) were checked in order to make a valid copy number call. The intactness of FRT1 site was checked by PCR with primers Scp1-S/Hygro-A (SEQ ID NO:23/SEQ ID NO:24) to give a 657 by band. The intactness of FRT87 site was checked with primers Yfp-3/Frt87-A (SEQ ID NO:25/SEQ ID NO:26) to give a 1441 by band. The full length transgene was checked with primers Scp1-S/Frt87-A (SEQ ID NO:23/SEQ ID NO:26) to give a 4393 by band (FIG. 1A). All three lines carry a complete single copy of the transgenic target DNA.",
                                "Table 4 presents the results of qPCR analyses on homozygous T1 plants from the three transgenic target lines. As above, a value less than 0.3 was considered as zero copy, a value between 0.4 and 1.3 was considered as one copy representing hemizygous plants, and a value between 1.4 and 2.3 was considered as two copies representing homozygous plants.",
                                "**Target Line Border Sequencing**",
                                "Genomic DNA fragments bordering the QC288A transgene on both the 5′ end and 3′ end of six target lines were obtained by PCR amplification and cloned for sequencing.",
                                "The GenomeWalker kit (ClonTech, Mountain View, Calif., USA) was used to acquire the genomic DNA sequences bordering the transgenic genes. DNA samples of each target line were digested separately with blunt end restriction enzymes EcoRV, DraI, HpaI, and StuI before adding the GenomeWalker™ DNA adaptors. The first round of PCR was done with the adaptor-specific primer AP1 (SEQ ID NO:65) provided in the kit and QC288A-specific primers, Scp1-A (SEQ ID NO:66) for the 5′ end border and Vec-S1 (SEQ ID NO:67) for the 3′ border, respectively. The second round of PCR was done with the adaptor-specific primer AP2 (SEQ ID NO:68) provided in the kit and QC288A-specific primers, Scp1-A4 (SEQ ID NO:69) for the 5′ end border and Vec-S2 (SEQ ID NO:70) for the 3′ border, respectively. Specific DNA fragments amplified by the second round PCR were cloned into pCR2.1-TOPO® vector with TA cloning kit according to the manufacturer (Invitrogen). Plasmid DNA was prepared with Qiaprep® plasmid DNA kit (Qiagen) and sequenced using Applied Biosystems 3700 capillary DNA analyzer and dye terminator cycle DNA sequencing kit. Sequence assembly and alignment were done using VECTOR NTI® suite programs (Invitrogen). Sequence searches were done remotely using the NCBI advanced BLAST algorithm.",
                                "The bordering genomic DNA sequences and truncations of the transgene ends were revealed by aligning the PCR clone sequences to QC288A map sequence. Various lengths of bordering genomic DNA sequences were obtained and the truncations of transgene ends were revealed to be minor for all the six target lines. Target lines A, B, C, and N lost 5, 17, 22, and 2 by of the 5′ end of the transgene, and 0, 49, 11, and 0 by of the 3′ end of the transgene, respectively. Genomic DNA sequences of 601 by (SEQ ID NO:55), 984 by (SEQ ID NO:57), 496 by (SEQ ID NO:61), and 452 by (SEQ ID NO:59) bordering the 5′ end of the transgene, and 2588 by (SEQ ID NO:56), 1305 by (SEQ ID NO:58), 543 by (SEQ ID NO:62), and 377 by (SEQ ID NO:60) bordering the 3′ end of the transgene were obtained for the three target lines A, B, C and N, respectively. The bordering genomic DNA sequences were used to search NCBI nucleotide collection (nr/nt) database by BLASTN to determine if any endogenous gene of importance was interrupted by the transgene insertion. No significant homology to any known gene was found for any of the three target lines. The bordering genomic DNA sequences were also used to design primers for border-specific PCR analysis of the target lines and RMCE events derived from the target lines in subsequent retransformation.",
                                "**RMCE Event Creation Using Suspension Cultures Derived from Homozygous T1 Target Plants**",
                                "Suspension cultures were initiated from developing embryos from homozygous T1 plants of the three target lines A, B, and C and retransformed by co-bombardments with the donor construct QC329 and FLP expression construct QC292 plasmid DNA.",
                                "The homozygous transgenic target line cultures were retransformed with the donor construct QC329 and the Flp construct QC292 at a 10:1 ratio following the biolistic bombardment transformation protocol except using 90 ng/ml chlorsulfuron (DuPont, Wilmington, Del., USA) as the selection agent. RMCE could only occur in cells containing all three DNAs, QC288A, QC329, and QC292, and would bring the promoter-less als coding region of QC329 downstream of the scp1 promoter of QC288A previously placed in soybean genome through DNA recombination for expression and thus chlorsulfuron resistance.",
                                "Putative retransformation events were selected by chlorsulfuron resistance and checked for reporter gene cfp expression under a fluorescent microscope. CFP positive events were sampled at somatic embryo stage and screened by a common PCR with primers 35S-277F (SEQ ID NO:11) and Als-3 (SEQ ID NO:27) to amplify a RMCE-specific 497 by band to check for DNA recombination around the FRT1 site. Then the events were analyzed by construct-specific qPCR to confirm DNA recombination at FRT1 site and to check for the presence of target, donor, and Flp DNA. RMCE, target, and donor-specific qPCR assays were designed around the FRT1 recombination site in each DNA construct. RMCE-specific qPCR employed 288A-1F (SEQ ID NO:71), Als-163R (SEQ ID NO:72) primers and FAM-labeled BHQ1 probe Als-110T (SEQ ID NO:73). Target-specific qPCR employed 288A-1F (SEQ ID NO:71), Hygro-116R (SEQ ID NO:74) primers and FAM-labeled BHQ1 probe Hygro-79T (SEQ ID NO:75). Donor-specific qPCR employed 329-1F (SEQ ID NO:76), Als-163R (SEQ ID NO:72) primers and FAM-labeled BHQ1 probe Als-110T (SEQ ID NO:73). Another qPCR assay specific to the Flp construct QC292 employed Ucp3-57F (SEQ ID NO:77), Flp-A (SEQ ID NO:78) primers and FAM-labeled BHQ1 probe OMEGA5UTR-87T (SEQ ID NO:79).",
                                "Border-specific PCR analyses specific to each target line 5′ end and 3′ end borders were done on corresponding events to check DNA recombination at FRT1 site, at FRT87 site, and also between FRT1 and FRT87 sites. The RMCE 5′ border-specific PCR employed the common antisense primer Als3 (SEQ ID NO:27) and a target line 5′ border sequence-specific sense primer, 53-151 (SEQ ID NO:80) for target line A, 70-1S (SEQ ID NO:81) for target line B, and 8H-ScaS1 (SEQ ID NO:82) for target line C. The RMCE 3′ border-specific PCR employed the common sense primer Cyan-1 (SEQ ID NO:83) and a target line 3′ border sequence-specific antisense primer, 53-1A (SEQ ID NO:84) for target line A, 70-1A (SEQ ID NO:85) for target line B, and 8H-VecA (SEQ ID NO:86) for target line C. The target 5′ border-specific PCR employed the same target line 5′ border sequence-specific sense primers but a target cassette-specific common antisense primer Hygro-A (SEQ ID NO:24). The target 3′ border-specific PCR employed the same target line 3′ border sequence-specific antisense primers but a target cassette-specific common sense primer Yfp-3 (SEQ ID NO:25). The full length PCR employed the same target line 5′ border sequence-specific sense primer and the same target line 3′ border sequence-specific antisense primer for each of the three target lines to simultaneously amplify a small excision band, the full target transgene band, and the full RMCE transgene band. Expected sizes of the RMCE 5′ end-specific, RMCE 3′ end-specific, Target 5′ end-specific, Target 3′ end-specific, full length Excision, full length Target, and full length RMCE PCR are 1117, 1351, 1036, 732, 1307, 5063, and 6652 by for target line A events; 967, 1180, 886, 561, 986, 4742, and 6331 by for target line B events; and 1018, 1294, 937, 675, 1151, 4907, and 6496 by for target line C events.",
                                "FIG. 6 presents the results of analyses of three retransformation events derived from target line A, including a CFP negative event A3 as a negative control, four retransformation events from target line B, and three retransformation events from target line C. For example, event A1 was positive for CFP expression and positive for DNA recombination at FRT1 site as determined by the common PCR. For construct-specific qPCR analyses, event A1 was positive for RMCE, contained one copy of donor DNA, and was free of either target or Flp DNA. For border-specific PCR analyses, event A1 was positive for both the 5′ end and 3′ end assays specific to RMCE, and negative for both the 5′ end and 3′ end assays specific to the target. Full length PCR from the 5′ end border to the 3′ end border amplified a small band specific to excision and failed to amplify any band specific to the target or RMCE. The excision was the outcome of DNA recombination between the FRT1 and FRT87 sites of either the target DNA QC288A, RMCE DNA QC288A329, or the intermediates SSI DNA QC288A329FRT1 and QC288A329FRT87 with all components flanked by the border FRT1 and FRT87 sites excised (FIG. 3D). The restored FRT site could be either FRT1 or FRT87 depending on the DNA strands crossing over position. Based on the above analyses, event A1 was a RMCE/Excision event contaminated with one randomly integrated copy of the donor DNA. Target DNA on two homologous chromosomes of the homozygous target line was replaced by RMCE on one chromosome and by excision on the other since target DNA was no longer detectable by either target-specific qPCR or target 5′ border, 3′ border, and full length border-specific PCR analyses.",
                                "Following similar analyses described above for event A1, the following conclusions were made for the other nine events listed in FIG. 6. Event A2 was a RMCE/Excision containing a randomly integrated copy of donor and a randomly integrated copy of Flp DNA. Event A3 was a homozygous Target escape carrying about five randomly integrated copies of the donor DNA. Events B1, B2, and B4 were all RMCE/Excision events with no randomly integrated copies of donor or Flp DNA. Event B3 was a RMCE/Excision containing randomly integrated donor DNA. Event C1 was an incomplete RMCE/Excision still containing the target DNA as detected by the 5′ end and 3′ end border-specific PCR analyses. The target-specific qPCR detected only 0.01 copy of target DNA for event C1. Events C2 and C3 were RMCE/RMCE (homozygous RMCE) with both the targets on homologous chromosomes being converted to RMCE since the RMCE-specific qPCR detected two copies while the target-specific qPCR as well as three border-specific PCR analyses failed to detect either any target-specific or excision-specific band. Both C2 and C3 events also contained randomly integrated donor DNA.",
                                "As examples, border-specific PCR analyses on events A1, A2, and A3 are shown in FIGS. 7A-7E. Genomic DNA samples extracted from somatic embryos of the three events were analyzed by RMCE-specific PCR specific to the 5′ end border (FIG. 7A), and specific to the 3′ end border (FIG. 7B). Events A1 and A2 were positive for the 1117 by RMCE 5′ end border-specific band and also positive for the 1351 by RMCE 3′ end border-specific band. Event A3 was negative for either the 5′ end border or 3′ end border band (FIG. 7A, FIG. 7B). When the same DNA samples were analyzed by Target-specific PCR specific to the 5′ end border (FIG. 7C), and specific to the 3′ end border (FIG. 7D), events A1 and A2 failed to produce any band. In contrast, event A3 was positive for the 1036 by Target 5′ end border-specific band and also positive for the 732 by Target 3′ end border-specific band (FIG. 7C, FIG. 7D). The full length 5′ end border to 3′ end border PCR amplified only the 1307 by Excision-specific band for events A1 and A2 but not for event A3 (FIG. 7E). The expected 6652 by RMCE-specific band that should exist in events A1 and A2 failed to be amplified due to the dominant competition advantage of the small Excision-specific products in the same PCR reactions. The same full length border-specific PCR amplified the 5063 by Target-specific band from event A3 (FIG. 7E). Wild type DNA and water templates were included as negative controls in all the analyses.",
                                "**Characterization of T0 Plants from RMCE Events**",
                                "T0 plants were regenerated from the RMCE events and their leaf samples were subjected to the same construct-specific qPCR and border-specific PCR analyses described in EXAMPLE 9. The analysis results of T0 plants of three independent events are listed in FIG. 8. Three plants A2-1, A2-2, and A2-3 of event A2, four plants C2-1, C2-2, C2-3, and C2-4 of event C2, and two plants C3-1, and C3-2 of event C3 all retained the same molecular signatures of their respective events A2, C2, and C3 that were revealed at the somatic embryo stage (FIG. 6). The differences of qPCR copy number values between the somatic embryo samples and the T0 plant samples were in the normal range of experimental variations.",
                                "Border-specific PCR analyses on plants listed in FIG. 8 are shown in FIGS. 9A-9E. Results of the RMCE-specific PCR specific to the 5′ end border (FIG. 3A), specific to the 3′ end border (FIG. 9B), the Target-specific PCR specific to the 5′ end border (FIG. 9C), specific to the 3′ end border (FIG. 9D), and the full length 5′ end border to 3′ end border PCR (FIG. 9E) for the T0 plant samples A2-1, A2-2, A2-3, A2-4, C2-1, C2-2, C2-3, C3-1, and C3-2 all matched the somatic embryo DNA A2, and C2 RMCE positive controls as well as the previous border-specific PCR analyses results (FIG. 6). Since A2 and its T0 plants A2-1, A2-2, A2-3, and A2-4 are all heterozygous RMCE/Excision, the full length PCR only amplified the small Excision-specific band but not the expected 6652 by large RMCE band, since PCR amplification favored the small band. In contrast, the full length PCR amplified the 6496 by RMCE band from homozygous RMCE events C2, C3 (not shown in FIGS. 9A-9E) and their T0 plants C2-1, C2-2, C2-3, C3-1, and C3-2 in the absence of the otherwise expected 1151 by Excision-band. The Target parent DNA samples A and C were included as positive controls for Target and negative controls for RMCE. Wild-type DNA (wt) and no DNA template (H2O) were included as negative controls.",
                                "Since the Target QC288A and the RMCE QC288A329 sequences diverge downstream of the FRT1 site, with hpt in QC288A and als in QC288A329, and upstream of the nos terminator, with yfp in QC288A and cfp in QC288A329, alignment of the transgene sequences with the predicted QC288A and QC288A329 map sequences should confirm RMCE recombination at the sequence level. The predicted sequences surrounding the FRT1 site were aligned to show the differences among Target, RMCE, and Excision downstream of the FRT1 site (FIG. 10A). Depending on the crossing-over position, Excision resulted from the recombination between FRT1 and FRT87 sites could restore either the FRT87 site or the FRT1 site (Groth, A. G. and Calos, M. P., J. Mol. Biol. 335:667-678 (2003)). The predicted sequences surrounding the FRT87 site were aligned to show the differences between Target and RMCE upstream of the nos terminator on the 5′ end of the FRT87 site (FIG. 10B). The sequences of the genomic DNA part upstream of the scp1 promoter on the 5′ end or downstream of the QC288A 3′ end, though not shown, were different between Target line A and line C and were included in the alignment analyses described below.",
                                "The 21 DNA fragments amplified from seven representative samples Target parents A, C, RMCE events A2, C2 somatic embryos, and RMCE T0 plants A2-1, C2-1, and C3-1 by the five border-specific PCR analyses were cloned and up to 4 clones derived from each fragment were sequenced to rule out sequence mutations caused by PCR (FIGS. 9A-9E). The transgenic gene sequences were aligned with predicted sequences of Target, RMCE, and Excision to confirm accurate DNA recombination around the FRT1 and FRT87 sites. Sequences obtained from the border-specific PCR DNA fragments were identical to their predicted corresponding sequences. The 5′ end border-specific PCR fragments sequences of RMCE samples A2-1, A2, C2-1, C3-1, and C2 (FIG. 9A) matched the RMCE sequences surrounding the FRT1 site (FIG. 10A). The 3′ end border-specific PCR fragments sequences of RMCE samples A2-1, A2, C2-1, C3-1, and C2 (FIG. 9B) matched the RMCE sequences surrounding the FRT87 site (FIG. 10B). The 5′ end border-specific PCR fragments sequences of target samples A and C (FIG. 9C) matched the target sequences surrounding the FRT1 site (FIG. 10A). The 3′ end border-specific PCR fragments sequences of target samples A and C (FIG. 9D) matched the target sequences surrounding the FRT87 site (FIG. 10B). The excision-specific PCR fragments sequences of A2-1, and A2 (FIG. 9E) matched one of the predicted excision-specific sequences containing the FRT1 site (FIG. 10A). Both the 5′ and 3′ ends of the full length Target fragment sequences of A and C or the full length RMCE sequences of C2-1, C3-1, and C2 (FIG. 9E) matched the ends of the original QC288A sequence or the predicted QC288A329 sequence, respectively (FIGS. 10A-10B).",
                                "**Characterization of T1 Plants from RMCE Events**",
                                "T1 seeds harvested from T0 plants A2-1, A2-2, A2-3, A2-4, C3-1, and C3-2 were germinated and the T1 plants were analyzed by the same construct-specific qPCR analyses done previously on their parents. Since the four T0 plants of event A2 were identical and the two T0 plants of event C3 were identical based on previous analyses (FIG. 8 and FIGS. 9A-9E), a total of 42 T1 plants derived from the four A2 T0 plants and a total of 48 T1 plants derived from the two C3 T0 plants were treated as two populations for segregation analysis. Since all four A2 T0 plants were confirmed to be heterozygous for RMCE/Excision and contaminated with Donor and Flp DNA (FIG. 8), the Excision should segregate away from RMCE, and the Donor and Flp should also segregate if they were in a different site that was not linked to the RMCE/Excision target site. The RMCE-specific qPCR would detect two copies, one copy, or null of RMCE for plants that are RMCE/RMCE, RMCE/Excision, and Excision/Excision, respectively. Similarly, Target-specific qPCR, Donor-specific qPCR, and Flp-specific qPCR would detect two copies, one copy, or null of Target, Donor, or Flp for homozygous (homo), hemizygous (hemi), or null of the Target, Donor, or Flp gene, respectively.",
                                "Of the forty-two A2 T1 plants, the RMCE/Excision site segregated as twelve RMCE/RMCE, eighteen RMCE/Excision, and twelve Excision/Excision. The Donor and Flp were apparently linked and segregated independently from the RMCE as fifteen homozygous, sixteen hemizygous, and eleven null. Seven plants were RMCE/Excision and free of any Donor or Flp. One plant was clean homozygous RMCE/RMCE and free of any Donor or Flp DNA. Consistent with previous analyses at T0 generation, all A2 T1 plants were free of the Target gene. All forty-eight C3 T1 plants were homozygous RMCE/RMCE and free of any Target or Flp consistent with the conclusion that the C3 T0 parent plants were homozygous RMCE/RMCE free of any Target or Flp (FIG. 8). The Donor was not linked to the RMCE site and segregated as twelve homozygous, twenty-four hemizygous, and twelve null. So twelve C3 T1 plants were clean homozygous RMCE/RMCE and free of any Donor or Flp DNA.",
                                "In summary, clean homozygous RMCE plants free of Donor, Target, or Flp DNA were obtained at the T1 generation from the retransformation of multiple Target lines by FLP/FRT recombinase mediated cassette exchange.",
                                "**Transgene Stacking Through Multiple Rounds of RMCE**",
                                "With the success of RMCE confirmed, one can design strategies involving repeated RMCE to place multiple transgenes at the same genomic site where the target DNA QC288A has inserted. Two groups of transgenes can be stacked through two rounds of RMCE as illustrated in FIG. 11A and FIG. 11B. Three incompatible FLP recognition sites FRT1, FRT12, and FRT87 as exemplified by QC422 in FIG. 11A are incorporated in a first donor construct designed for retransformation of selected target QC288A transgenic lines with chlorsulfuron selection. The group 1 of transgenic genes can be cloned between the FRT12, and FRT87 sites. RMCE will happen between the target QC288A in the genome and the first donor QC422 or its derivative through the FRT1 and FRT87 sites. The first round RMCE retransformation events will contain, in addition to group 1 transgenes, three FLP recognition sites FRT1, FRT12, and FRT87 (FIG. 12A). Selected first round RMCE retransformation events will be retransformed with a second donor construct containing two FLP recognition sites FRT1 and FRT12 as exemplified by QC429 in FIG. 11B with hygromycin selection. The group 2 transgenic genes can be cloned upstream of the FRT12 site. The second round of RMCE will happen between the first RMCE DNA in the genome and the second donor QC429 or its derivative through the FRT1 and FRT12 sites. The second RMCE DNA will contain both group1 and group2 transgenic genes and the three FLP recognition sites FRT1, FRT12, and FRT87 at the same genomic site (FIG. 12B). Since the three FLP recognition sites are not compatible to each other, the transgenes are stable.",
                                "A third group of transgenic genes can be similarly stacked at the same genomic site. The first round of RMCE and the first donor construct will be the same as described above. The second donor construct for the second RMCE will also contain three FLP recognition sites as exemplified by QC459 in FIG. 13A with one of the three FRT sites FRT1, FRT6 and FRT12 never being used before i.e. FRT6. The group 2 of transgenic genes can be cloned between the FRT6 and FRT12 sites. Selected first round RMCE retransformation events will be retransformed with the second donor DNA with hygromycin selection. The second RMCE will happen between the first RMCE DNA in the genome and the second donor DNA though the FRT1 and FRT12 sites. The second round RMCE DNA will contain both group1 and group2 transgenic genes and four FLP recognition sites FRT1, FRT6, FRT12, and FRT87 at the same genomic site (FIG. 14A). Since the four FLP recognition sites are not compatible to each other, the transgenes are stable.",
                                "A third RMCE retransformation will be required to stack the third group of transgenic genes. Selected second round RMCE retransformation events will be retransformed with a third donor construct as exemplified by QC428 in FIG. 13B with two FLP recognition sites FRT1 and FRT6 with chlorsulfuron selection. The group 3 of transgenic genes can be cloned upstream of the FRT6 site. The third round RMCE DNA will contain all group 1, group 2, and group 3 transgenic genes and four FLP recognition sites FRT1, FRT6, FRT12, and FRT87 at the same genomic site (FIG. 14B). Since the four FLP recognition sites are not compatible to each other, the transgenes are stable.",
                                "Following the same strategy described above, more groups of transgenes can be stacked at the same genomic site using more incompatible FRT sites by additional rounds of RMCE retransformation.",
                                "**Construction of Vectors for Multiple Rounds of RMCE**",
                                "The FRT12 recombination site was constructed by annealing two 106 by complementary oligos (SEQ ID NO:38 and SEQ ID NO:39) engineered with multiple cloning sites (MWG-Biotech AG, Bridgeport, Calif., USA). The XmaI/FseI FRT12 DNA fragment was cloned into the XmaI/FseI sites of construct QC408 to make QC422 (SEQ ID NO:42; FIG. 11A) containing FRT1:als:pinII:FRT12-FRT87. QC429 (SEQ ID NO:43; FIG. 11B) and its intermediates and derivatives were made via multiple steps using routine cloning techniques as described in EXAMPLE 1.",
                                "The FRT6 recombination site was made by annealing two 106 by complementary oligos (SEQ ID NO:40 and SEQ ID NO:41) engineered with multiple cloning sites (MWG-Biotech AG). The AscI/XmaI FRT6 DNA fragment was cloned into the AscI/XmaI sites of construct QC408 to make QC430 containing FRT1:als:pinII:FRT6-FRT87. QC459 (SEQ ID NO:44; FIG. 13A), QC428 (SEQ ID NO:45; FIG. 13B) and their intermediates and derivatives were made via multiple steps using routine cloning techniques as described in EXAMPLE 1.",
                                "**Creation of Target Sites During Development of Transgenic Product Lines**",
                                "Since target lines for RMCE are created using traditional transformation method, which will place the target DNA in the genome randomly, significant effort is required to produce and characterize multiple target events to identify a target line that meets desired criteria. The process may take several years and require as much effort as developing a trait-containing transgenic product line. If the process of creating a target line can be combined with the development of a trait-containing transgenic product line, a target site will be obtained as a by-product once the transgenic product line is selected and well characterized. Furthermore, a trait gene or a group of genes responsible for the trait is already placed at the site making it convenient to stack new traits through RMCE. A common selectable marker gene cassette is usually used for plant transformation to facilitate the selection of transformed events, such as the 35S:hpt and sams:als cassettes used in soybean transformation (US patent publication WO 00/37662) and the 35S:bar and ubiq:gat cassettes used in maize transformation. Consequently, two incompatible recombinase recognition sites such as FRT1 and FRT87 can be incorporated in the selectable marker gene cassette which can then be linked to any trait gene of interest for transformation. Once integrated in a plant genome the incorporated FRT1 and FRT87 sites can be used for RMCE.",
                                "Using the promoter trap design, the soybean transformation selectable marker gene cassette sams:als can be modified to include a FRT1 site between the sams promoter and the als coding region and a FRT87 site downstream of the als terminator exemplified by construct QC448 (FIG. 15A). Multiple restriction sites can be engineered upstream of the sams promoter and also downstream of the als terminator for the cloning of trait genes of interest. Once placed in soybean genome the sams-FRT1:als-FRT87 cassette can be used as a target site for RMCE with any donor construct containing a promoterless marker gene such as FRT1-hpt-FRT87. DNA construct QC448 (FIG. 15A) was made from constructs containing components such as FRT1, FRT87, sams promoter, als coding sequence etc. described in EXAMPLES 1 and 7 via multiple steps using routine molecular cloning techniques described in EXAMPLE 1. First, QC446 was made by cloning the 1283 by SphI/FseI fragment containing the als term from pZSL141 into the SphI/FseI sites of QC408. Then the 2790 by HpaI/NotI FRT1:als:als term-FRT87 fragment of QC446, the HpaI digestion was partial, was cloned into the NcoI/NotI sites of QC431 to make QC447 containing sams-FRT1:als:als term-FRT87, the NcoI site was filled in by Klenow polymerase. The sams-FRT1:als:als term-FRT87 cassette was released with XmaI/NotI from QC447 and moved to the XmaI/NotI sites pZSL141 to make the final plasmid QC448 from which the cassette could be conveniently released with AscI digestion for DNA fragment preparation.",
                                "The Gateway® cloning technology, which is based on the lambda phage site-specific recombination system (Invitrogen), can be utilized to link the sams-FRT1:als-FRT87 marker gene to trait genes. The construct QC448 (FIG. 15A) was cut at the 5′ end of the sams promoter with SmaI digestion. A Gateway® conversion DNA fragment containing the attR1 and attR2 recombination sites (Invitrogen) was inserted to the SmaI site of QC448 by blunt end ligation with T4 DNA ligase to make construct QC449 and QC449i, with the Gateway® DNA fragment inverted, as the destination vectors (FIG. 15B, FIG. 15C). Trait genes will need to be first cloned between two corresponding recombinase recognition sites attL1 and attL2 as an entry vector. In vitro recombination catalyzed by LR clonase between the attL sites on an entry vector and the attR sites on the destination vector will result in the linkage of the trait genes to the marker gene in tandem or diverse orientation depending on the relative orientations of the attL and attR sites.",
                                "An improved version of QC448 was made by adding stop codons in all open reading frames on each end of the sams:als cassette to form QC477 containing ORFSTOP-B-sams-FRT1:als:als term:FRT87-ORFSTOP-A (FIG. 16A). To remove a few extra base pairs between the FRT1 and the als gene, the 888 by KpnI/EcoRI fragment of pZSL91 was moved to the SpeI/EcoRI sites of QC446 to form QC474. Both the SpeI and KpnI sites were first treated with mung bean nuclease to become blunt. The sams-FRT1:als:als term:FRT87 fragment of QC474 was released with NotI complete digestion and HpaI partial digestion and cloned into the NcoI and NotI sites of QC431 to form QC475, the NcoI site was first blunted with mung bean nuclease. ORFSOPTA-B (SEQ ID NO:88), with stop codons in all open reading frames, was synthesized as an oligo duplex with appropriate cloning sites incorporated on the ends and in the middle (MWG-Biotech AG). The duplex was digested with XhoI/SpeI and cloned into the XhoI/XbaI sites of pZSL141 to form QC476. Finally, the 4128 by NotI/SpeI sams-FRT1:als:als term:FRT87 fragment of QC475 was moved to the NotI/SpeI sites of QC476 to form QC477 (FIG. 16A).",
                                "A Gateway® conversion DNA fragment containing the attR1 and attR2 recombination sites (Invitrogen) was inserted to the PmeI sites of QC477 by blunt end ligation with T4 DNA ligase to make construct QC478 and QC478i, with the Gateway® DNA fragment inverted, as the destination vectors (FIG. 16B, FIG. 16C). Another Gateway® conversion DNA fragment containing the attR3 and attR4 recombination sites (Invitrogen) was inserted into the PmeI sites of QC477 by blunt end ligation with T4 DNA ligase to make construct QC479 and QC479i, with the Gateway® DNA fragment inverted, as the destination vectors (FIG. 16D, FIG. 16E). The destination vectors QC479 and QC469i can accept DNA fragments previously cloned in entry vectors containing the attL3 and attL4 sites by LR clonase catalyzed in vitro DNA recombination.",
                                "**Stacking of Fatty Acid Modifying Genes and Amino Acid Modifying Genes at the Target B Site by Two Rounds of SSI**",
                                "A retransformation event designated “B-5”, produced from the retransformation of the target B culture with the donor DNA QC329 (EXAMPLE 3), was confirmed by multiple PCR and qPCR analyses to be a RMCE event. The B-5 event containing the QC288A329 (FIG. 1C) transgenes was regenerated into fertile T0 plants. Homozygous T1 plants of B-5 were identified by qPCR and their developing embryos were used to initiate new embryogenic cultures for gene stacking experiments using donor DNA QC436 for the first round of SSI. The QC436 construct contains a promoter-less selectable marker gene HPT between the FRT1 and FRT12 sites, and between the FRT12 and FRT87 sites inverted repeats of the soybean delta 9 desaturase gene fragment (GM-FAD2-1 (TR1)) and thioesterase gene fragment (GM-THIOESTERASE 2 (TR4)) controlled by a common promoter KTI3 (FIG. 17A). Since the target DNA QC288A329 does not contain a FRT12 site, RMCE between the target QC288A329 and the donor QC436 DNA can only happen between the two FRT1 sites and the two FRT87 sites. Consequently, all the components between the FRT1 and FRT87 sites of QC288A329 can be replaced by the components between the FRT1 and FRT87 sites of QC436. The third recombination site FRT12 of QC436 is simultaneously introduced into the target B locus. Multiple retransformation events were produced and confirmed to be RMCE events by PCR and qPCR analyses (similar to EXAMPLES 3 and 4). Fatty acid profiling on somatic embryos of the QC288A436 (FIG. 17C) retransformation events revealed significantly elevated oleic acid (18:1) content, which is the phenotype expected for suppression of the endogenous delta9 desaturase and thioesterase 2 genes. One QC288A436 RMCE event culture, designated “B-5-3”, was selected as the new target for next round SSI using the second donor DNA QC438.",
                                "The B-5-3 culture was directly retransformed with the donor DNA QC438 as similarly described in EXAMPLE 3. QC438 contains only two recombination sites, FRT1 and FRT12. The promoter-less selectable gene ALS and four other complete transgenes are flanked by the same FRT1 and FRT12 sites (FIG. 17B). The expression of the Yarrowia diacylglycerol acyltransferase gene (YL-DGAT1) is useful for the conversion of fatty acids to triacylglycerol to increase overall oil content. The expression of the other three genes, barley high lysine (BHL8), Corynebacterium glutamicum dihydrodipicolinate synthetase gene (CORYNE DAP A), and soybean cysteine synthase gene (GM-CGS (TR1)), are useful to increase the content of essential amino acids such as lysine and methionine. Retransformation events were selected by their resistance to chlorsulfuron and analyzed by multiple PCR and qPCR analyses (similar to EXAMPLES 3 and 4, with more gene-specific primers). One event, designated “B-5-3-2”, was confirmed to be a RMCE stacking event containing the ALS selectable marker gene and the four traits genes YL-DGAT1, BHL8, CORYNE DAP A, and GM-CGS (TR1) of the donor QC438. The FAD2-1 and thioesterase 2 cosuppression cassette delivered by donor QC436 during the previous SSI remained intact. Fatty acid profiling of somatic embryo samples of B-5-3-2 detected the expected phenotypes of high oleic acid and high oil contents. Western analysis of somatic embryo or T0 plant leaf samples indicated the expression of all three genes, BHL8, CORYNE DAP A, and GM-CGS (TR1), which are designed to improve lysine and methionine contents."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze Southern blots of T0 plants",
                                "describe restriction enzyme NdeI",
                                "explain expected Southern blot results",
                                "analyze yfp and cfp probes",
                                "describe expected yfp and cfp probe results",
                                "analyze Southern blot results",
                                "confirm DNA recombination by sequencing",
                                "describe PCR amplification of transgenic gene",
                                "clone and sequence PCR fragments",
                                "analyze sequence assembly and alignment",
                                "confirm RMCE recombination at sequence level",
                                "analyze T0 and T1 plants from selected target lines",
                                "describe qPCR, PCR, and Southern analyses",
                                "select single copy events",
                                "analyze T1 plants by qPCR",
                                "obtain homozygous T1 plants",
                                "select target lines for RMCE retransformation",
                                "analyze qPCR, PCR, and Southern results",
                                "describe target line border sequencing",
                                "obtain genomic DNA fragments",
                                "clone and sequence PCR fragments",
                                "analyze sequence assembly and alignment",
                                "reveal bordering genomic DNA sequences",
                                "analyze truncations of transgene ends",
                                "search NCBI nucleotide collection database",
                                "design primers for border-specific PCR analysis",
                                "create RMCE events using suspension cultures",
                                "describe biolistic bombardment transformation protocol",
                                "select putative retransformation events",
                                "analyze reporter gene cfp expression",
                                "screen events by PCR",
                                "analyze qPCR results",
                                "analyze border-specific PCR results",
                                "describe full length PCR analysis",
                                "analyze results of RMCE event creation",
                                "characterize T0 plants from RMCE events",
                                "introduce T0 plants",
                                "analyze qPCR and border-specific PCR",
                                "summarize results of RMCE-specific PCR",
                                "align sequences to confirm RMCE recombination",
                                "sequence analysis of border-specific PCR fragments",
                                "summarize results of sequence analysis",
                                "introduce T1 plants",
                                "analyze qPCR of T1 plants",
                                "summarize segregation analysis of T1 plants",
                                "introduce transgene stacking through RMCE",
                                "describe strategy for stacking multiple transgenes",
                                "illustrate first round of RMCE",
                                "illustrate second round of RMCE",
                                "describe third round of RMCE",
                                "introduce construction of vectors for RMCE",
                                "describe construction of QC422",
                                "describe construction of QC429",
                                "describe construction of QC459",
                                "describe construction of QC428",
                                "introduce creation of target sites during development of transgenic product lines",
                                "describe modification of selectable marker gene cassette",
                                "illustrate construct QC448",
                                "describe creation of destination vectors",
                                "illustrate construct QC449",
                                "illustrate construct QC449i",
                                "describe improved version of QC448",
                                "illustrate construct QC477",
                                "describe creation of destination vectors",
                                "illustrate construct QC478",
                                "illustrate construct QC478i",
                                "illustrate construct QC479",
                                "illustrate construct QC479i",
                                "introduce stacking of fatty acid modifying genes and amino acid modifying genes",
                                "describe retransformation event B-5",
                                "describe donor DNA QC436",
                                "describe retransformation events",
                                "describe fatty acid profiling",
                                "describe second round of SSI",
                                "describe donor DNA QC438",
                                "describe retransformation events",
                                "describe fatty acid profiling and Western analysis",
                                "summarize results of gene stacking"
                            ],
                            "num_characters": 40003,
                            "outline_medium": [
                                "analyze Southern blots of T0 plants",
                                "describe restriction enzyme NdeI",
                                "explain yfp and cfp probes",
                                "analyze yfp and cfp probe results",
                                "confirm DNA recombination by sequencing",
                                "describe PCR amplification and cloning",
                                "sequence assembly and alignment",
                                "analyze sequence results",
                                "analyze T0 and T1 plants from selected target lines",
                                "describe qPCR, PCR, and Southern analyses",
                                "present qPCR, PCR, and Southern results",
                                "describe target line border sequencing",
                                "obtain genomic DNA fragments",
                                "clone and sequence fragments",
                                "analyze border sequence results",
                                "create RMCE events using suspension cultures",
                                "analyze RMCE events by PCR and qPCR",
                                "characterize T0 plants from RMCE events",
                                "introduce T0 plants",
                                "analyze qPCR and border-specific PCR results",
                                "align transgene sequences with predicted sequences",
                                "clone and sequence DNA fragments",
                                "confirm accurate DNA recombination",
                                "analyze T1 plants by qPCR",
                                "segregate RMCE/Excision, Donor, and Flp",
                                "obtain clean homozygous RMCE plants",
                                "design strategy for transgene stacking",
                                "illustrate two rounds of RMCE",
                                "construct vectors for multiple rounds of RMCE",
                                "create target sites during development of transgenic product lines",
                                "modify selectable marker gene cassette",
                                "use Gateway cloning technology",
                                "add stop codons to sams:als cassette",
                                "create destination vectors",
                                "stack fatty acid modifying genes and amino acid modifying genes",
                                "retransform target B culture with donor DNA QC436",
                                "analyze retransformation events",
                                "retransform B-5-3 culture with donor DNA QC438",
                                "analyze retransformation events and confirm RMCE stacking event"
                            ],
                            "outline_short": [
                                "perform Southern analysis of retransformed T0 plants",
                                "analyze DNA recombination by sequencing",
                                "analyze T0 and T1 plants from selected target lines",
                                "perform target line border sequencing",
                                "create RMCE events using suspension cultures",
                                "analyze RMCE events by PCR and qPCR",
                                "perform border-specific PCR analyses",
                                "analyze full length PCR products",
                                "characterize T0 plants from RMCE events",
                                "characterize T0 plants",
                                "analyze T1 plants",
                                "describe transgene stacking strategy",
                                "construct vectors for multiple rounds of RMCE",
                                "create target sites during development of transgenic product lines",
                                "design promoter trap construct",
                                "utilize Gateway cloning technology",
                                "create improved version of QC448",
                                "stack fatty acid modifying genes and amino acid modifying genes",
                                "analyze retransformation events"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce examples of the present invention",
                        "describe essential characteristics of the invention"
                    ],
                    "num_characters": 1264,
                    "outline_medium": [
                        "introduce examples of the present invention"
                    ],
                    "outline_short": [
                        "exemplify aspects of the invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for stacking multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising:\na. transforming a first soybean cell with an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a first selectable marker protein-coding sequence, wherein the first selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site;\nb. regenerating a transgenic plant from the transformed soybean cell of step (a);\nc. introducing into a second soybean cell from the transgenic plant of step (b) a transfer cassette, wherein said transfer cassette comprises a second selectable marker protein-coding sequence, wherein the second selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination sites of the target site, and further wherein the transfer cassette further comprises at least one second expression cassette of interest, wherein the at least one second expression cassette of interest is bounded by the second selectable marker protein-coding sequence and the second non-identical recombination site; and\nd. providing a recombinase that recognizes and implements recombination at the non-identical recombination sites.",
        "2. The method of claim 1, wherein the transfer cassette further comprises a third non-identical recombination site bounded by the second selectable marker protein-coding sequence and the at least one second expression cassette of interest.",
        "3. The method of claim 1, further comprising between steps (b) and (c), identifying a transgenic plant of step (b), wherein the transgenic plant has desirable levels of gene expression for the at least one first expression cassette of interest.",
        "4. The method of claim 1, wherein said non-identical recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
        "5. The method of claim 1, wherein the soybean cell of step (a) is transformed with the isolated nucleic acid fragment by gene bombardment, and wherein the transfer cassette of step (c) is introduced into the soybean cell by gene bombardment.",
        "6. The method of claim 1, step (d), wherein providing said recombinase comprises transiently expressing within said soybean cell an expression cassette comprising a polynucleotide encoding said recombinase.",
        "7. The method of claim 6, wherein said recombinase is FLP.",
        "8. The method of claim 7, wherein said FLP has been synthesized using maize preferred codons.",
        "9. The method of claim 1, wherein said first selectable marker protein-coding sequence encodes a protein selected from the group consisting of a hygromycin phosphotransferase, a sulfonylurea-tolerant acetolactate synthase, and a sulfonylurea-tolerant acetolactate synthase that has an amino acid sequence comprising SEQ ID NO:63 or SEQ ID NO:64.",
        "10. The method of claim 1, wherein the target site comprises a promoter operably linked to the first selectable marker protein-coding sequence, further wherein the first recombination site is between the promoter and the first selectable marker protein-coding sequence.",
        "11. A soybean cell, plant or seed having stably incorporated in its genome a transfer cassette comprising at least three non-identical recombination sites, where the transfer cassette comprises a polynucleotide encoding a selectable marker protein-coding sequence bounded by a first recombination site and a second non-identical recombination site, wherein the transfer cassette further comprises a third non-identical recombination site bounded by the selectable marker protein-coding sequence and the second non-identical recombination site, wherein the transfer cassette further comprises at least one expression cassette of interest, wherein the at least one expression cassette of interest is bounded by the third non-identical recombination site and the second non-identical recombination site.",
        "12. The soybean cell, plant or seed of claim 11, wherein said non-identical FRT recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
        "13. The soybean cell, plant or seed of claim 12, wherein the transfer cassette is genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
        "14. A method for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising:\na. obtaining a transgenic soybean cell comprising a target site, wherein said target site comprises a first selectable marker protein-coding sequence, wherein the first selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site;\nb. introducing into the transgenic soybean cell of step (a) a transfer cassette, wherein said transfer cassette comprises a second selectable marker protein-coding sequence, wherein the second selectable marker protein-coding sequence is bounded by the first recombination site and the second non-identical recombination site, and further wherein the transfer cassette further comprises at least one expression cassette of interest, wherein the at least one expression cassette of interest is bounded by the second selectable marker protein-coding sequence and the second non-identical recombination site; and\nc. providing a recombinase that recognizes and implements recombination at the non-identical recombination sites.",
        "15. The method of claim 14, wherein the transfer cassette further comprises a third non-identical recombination site bounded by the second selectable marker gene and the at least one expression cassette of interest.",
        "16. The method of claim 14, wherein said non-identical FRT recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
        "17. The method of claim 16, wherein the transfer cassette is genetically linked to a chromosomal region comprising a sequence selected from the group consisting of SEQ ID NO:55, SEQ ID NO:56, SEQ ID NO:57, SEQ ID NO:58, SEQ ID NO:59, SEQ ID NO:60, SEQ ID NO:61 and SEQ ID NO:62.",
        "18. A method for creating a transgenic soybean cell comprising a target site suitable for stacking of multiple expression cassettes of interest into a specific chromosomal site in a soybean genome, said method comprising transforming a soybean cell with an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site.",
        "19. The method of claim 18, wherein said non-identical recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
        "20. A soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising at least one first expression cassette of interest adjacent to a target site, wherein said target site comprises a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site.",
        "21. The soybean cell, plant or seed of claim 20, wherein said non-identical recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54).",
        "22. A soybean cell, plant or seed having stably incorporated in its genome an isolated nucleic acid fragment comprising a target site, wherein said target site comprises a promoter operably linked to a selectable marker protein-coding sequence, wherein the selectable marker protein-coding sequence is bounded by a first recombination site and a second non-identical recombination site, further wherein the first recombination site is between the promoter and the selectable marker protein-coding sequence.",
        "23. The method of claim 22, wherein the target site further comprises at least one additional non-identical recombination site, wherein the at least one additional non-identical recombination site is bounded by the selectable marker protein-coding sequence and the second non-identical recombination site.",
        "24. The soybean cell, plant or seed of claim 22, wherein said non-identical recombination sites are selected from the group consisting of FRT1 (SEQ ID NO:50), FRT5 (SEQ ID NO:51), FRT6 (SEQ ID NO:52), FRT12 (SEQ ID NO:53) and FRT87 (SEQ ID NO:54)."
    ]
}