{
    "id": "US20140356443",
    "authors": [
        "Magnus Brisander",
        "Mustafa Demirbüker",
        "Gérald Jesson",
        "Martin Malmsten",
        "Helene Dérand"
    ],
    "title": "PHARMACEUTICAL COMPOSITION COMPRISING STABLE, AMORPHOUS, HYBRID NANOPARTICLES OF AT LEAST ONE PROTEIN KINASE INHIBITOR AND AT LEAST ONE POLYMERIC STABILIZING AND MATRIX-FORMING COMPONENT",
    "date": "2013-01-11 00:00:00",
    "abstract": "The present invention relates to the field of methods for providing pharmaceutical compositions comprising poorly water-soluble drugs. In particular the present invention relates to compositions comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, useful in pharmaceutical compositions and in therapy.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to the field of pharmaceutical compositions comprising poorly water-soluble drugs. In particular the present invention relates to pharmaceutical compositions comprising stable, amorphous hybrid nanoparticles of protein kinase inhibitors (PKIs) and polymeric stabilizing and matrix-forming components. Furthermore, the present invention relates to a method of treating proliferative disorders in a patient in need thereof, comprising administering a therapeutically effective amount of said compositions."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to pharmaceutical compositions"
                    ],
                    "num_characters": 533,
                    "outline_medium": [
                        "relate to pharmaceutical compositions"
                    ],
                    "outline_short": [
                        "relate to pharmaceutical compositions"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE AND INVENTION",
                    "paragraphs": [
                        "Components of cellular signal transduction pathways that regulate the growth and differentiation of normal cells can, when dysregulated, lead to the development of cellular proliferative disorders and cancer. Mutations in cellular signaling proteins may cause such proteins to become expressed or activated at inappropriate levels or at inappropriate times during the cell cycle, which in turn may lead to uncontrolled cellular growth or changes in cell-cell attachment properties.",
                        "Many proliferative disorders, such as tumors and cancers, have been shown to involve overexpresion or upregulation of protein kinase activity. Protein kinases are kinase enzymes that modify proteins by chemically adding phosphate groups (phosphorylation). Phosphorylation usually results in a functional change of the target protein by changing enzyme activity, cellular location, or association with other proteins. Protein kinases can be subdivided or characterised by the amino acids of the target protein whose phosphorylation they control: most kinases act on both serine and threonine, the tyrosine kinases act on tyrosine, and a number (dual-specificity kinases) act on all three. There are also protein kinases that phosphorylate other amino acids, including histidine kinases that phosphorylate histidine residues. The human genome contains about 500 protein kinase genes and up to 30% of all human proteins may be modified by protein kinases. Kinases are known to regulate the majority of cellular pathways, especially those involved in signal transduction. Dysregulation of protein kinases by mutation, gene rearrangement, gene amplification, and overexpression of both receptor and ligand has been implicated in the development and progression of human cancers. Protein kinase inhibiting compounds or protein kinase inhibitors (PKIs) are therefore useful for treating diseases caused by or exacerbated by overexpression or upregulation of protein kinases. For example, tyrosine kinase inhibitors (TKIs also known as tyrphostins) have been shown be effective anti-tumor agents and anti-leukemic agents (Lowery A et. al., Front Biosci. 2011 Jun. 1; 17:1996-2007).",
                        "A major objective of formulation chemistry is to improve drug efficiency and safety, by e.g. improving bioavailability and stability as well as convenience to the patient. Bioavailability means the rate and extent to which an active substance or therapeutic is absorbed from a pharmaceutical form and becomes available at the site of action. The most common and preferred method of delivery due to convenience, ease of ingestion, and high patient compliance to treatment is the oral route of drug delivery. However, for certain drugs, drug absorption from the gastrointestinal tract is limited by poor aqueous solubility and/or poor membrane permeability of the drug molecules.",
                        "PKIs are generally weak bases that dissolve only slightly at low pH (e.g. 100-1000 mg/L) and are practically insoluble at neutral pH (e.g. 0.1-10 mg/L). Therefore, enhancing the solubility and dissolution rate of PKI-based drugs is important for improving the bioavailabitity and efficacy of most of these drugs. Typical PKIs exhibit non-polypetide structure and have relatively low molecular weights, such as ≦10000 dalton or ≦5000 dalton.",
                        "Several methods to improve the dissolution characteristics of poorly water soluble drugs have been reported, including micronisation, formation of salts or solvates, complexes and microspheres. Additionally, attempts have been made to improve bioavailability provided by solid dosage forms by forming particles comprising the drug or by mixing the poorly water soluble drug with hydrophilic excipients. Traditionally, however, these methods carry inherent limitations concerning physical stabilities of the particles on storage, problems with grinding or difficulty of removal of the frequently toxic solvent. Furthermore, it is important that the drug released from the solid phase does not precitipitate in the gastrointestinal tract, or precipitates as little as possible, but remains water-soluble in the aqueous fluids of the gastrointestinal tract, since such precipitation results in low bioavailability (see e.g. Hervé J. et al. Pharm Dev Technol. 2011 June; 16(3):278-86).",
                        "pH-dependent solubility is a well-known issue for many oral formulations of poorly water-soluble substances, such as PKIs, since most of the absorption of the drug occurs in the small and large intestine, where pH is close to neutral. There is thus a continuing need to develop and improve the dissolution characteristics of oral solid dosage forms of PKI-based drugs. (Budha N R, Frymoyer A, Smelick G S, Jin J Y, Yago M R, Dresser M J, Holden S N, Benet L Z, Ware J A. Clin Pharmacol Ther. 2012 August; 92(2):203-13). Therefore, methods for improving dissolution of PKI-based drugs, as well as of other poorly water-soluble drugs, at neutral (intestinal) pH are highly desirable.",
                        "US20090203709 discloses a pharmaceutical dosage form comprising a solid dispersion product of at least one tyrosine kinase inhibitor, at least one pharmaceutically acceptable polymer and at least one pharmaceutically acceptable solubilizer. Further the reference discloses methods for preparing the above-mentioned pharmaceutical dosage form, comprising preparing the homogenous melt of at least one tyrosine kinase inhibitor, at least one pharmaceutically acceptable polymer and at least one pharmaceutically acceptable solubilizer, and allowing the melt to solidify to obtain a solid dispersion product.",
                        "EP2105130 discloses pharmaceutical formulations comprising a solid dispersion or solid solution, containing a polymer and an active agent in amorphous form. Further, the formulation comprises an external polymer to stabilize the solution, such that the % by weight of the external polymer is less than 20% of the total weight of the pharmaceutical formulation. Additionally, the reference discloses a hot melt extrusion method for production of the above-mentioned formulation."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate proliferative disorders",
                        "explain protein kinase activity",
                        "describe phosphorylation",
                        "classify protein kinases",
                        "discuss dysregulation of protein kinases",
                        "introduce protein kinase inhibitors",
                        "motivate formulation chemistry",
                        "explain bioavailability",
                        "describe limitations of PKIs",
                        "discuss methods to improve dissolution",
                        "motivate pH-dependent solubility",
                        "discuss prior art"
                    ],
                    "num_characters": 6029,
                    "outline_medium": [
                        "motivate proliferative disorders",
                        "explain protein kinase activity",
                        "describe limitations of PKIs",
                        "discuss formulation chemistry",
                        "summarize methods to improve dissolution",
                        "highlight need for improved dissolution"
                    ],
                    "outline_short": [
                        "motivate proliferative disorders",
                        "explain protein kinases",
                        "discuss limitations of prior art"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates pharmaceutical compositions comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component. Optionally, one or more solubilizers may be added to the particles, present separately from the particles, or within the particles."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce pharmaceutical compositions"
                    ],
                    "num_characters": 358,
                    "outline_medium": [
                        "introduce amorphous hybrid nanoparticles"
                    ],
                    "outline_short": [
                        "introduce amorphous hybrid nanoparticles"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "All patents, patent applications, and publications cited herein are hereby incorporated by reference in their entirety.",
                        "As used herein, the phrase “hybrid nanoparticles” refers to a group of particles, typically in the average size range of from 1 to 1000 nm, composed of at least two components, one of which is the PKI and the other a polymeric stabilizing and matrix-forming component. The particles can be either crystalline or amorphous, or a mixture thereof. Typically, in the sense of the present disclosure, the particles are “amorphous”, or “essentially amorphous”. This means that almost all, if not all, content of the particles comprise amorphous protein kinase inhibitor and polymeric stabilizing and matrix-forming component. The level or degree of amorphicity is at least 60%, such as 70%, such as 80% or 85%, preferably at least 90% and more preferably >95%, wherein 100% represents that all material is amorphous in the particles.",
                        "Quantification of crystalline PKI or absence of crystalline PKI may be measured by X-ray powder diffraction methods as described in Saleki-Gerhardt A et al. Int J Pharm. 1994; 101:237-247) or by water vapor sorption as described in Dash A K et al. J Pharm Sci. 2002 April; 91(4):983-90.",
                        "The term “solid dispersion particles” relates to “hybrid nanoparticles” as defined above, however, solid dispersion particles are typically larger or much larger in size (typically μm-mm, as described in Wu K. et al. J Pharm Sci. 2009 July; 98(7):2422-3). The smaller size of hybrid nanoparticles contributes to further stabilizing the PKI against crystallization. Typically, hybrid nanoparticles is in the average size range of from 1 to 1000 nm, such as below 500 nm, preferably below 250 nm.",
                        "The phrase “stable” refers to the level of stability of produced particles by the methods of the present invention and may be measured as the capability of the hybrid nanoparticles to remain in their physical state for 6-12 months storage at ambient temperature (e.g. 18-25° C.). The level of stability may be measured by AUC measurements of dissolution rate over for instance 80 minutes of the particles, after such storage.",
                        "By the phrase “protein kinase inhibitor” or “PKI” is meant a type of enzyme inhibitor that specifically blocks the action of one or more protein kinases. PKIs include, but are not limited, to protein kinase inhibitors and tyrosine kinase inhibitors, such as axitinib, afatinib, bosutinib, crizotinib, cediranib, dasatinib, erlotinib, fostamatinib, gefitinib, imatinib, lapatinib, lenvatinib, lestaurtinib, motesanib, mubritinib, nilotinib, pazopanib, pegaptanib, ruxolitinib, sorafenib, semaxanib, sunitinib, tandunitib, tipifamib, vandetanib and vemurafenib; or salts or hydrates or solvates thereof, or combinations thereof.",
                        "By the phrase “polymeric stabilizing and matrix-forming component” is meant the component present in the hybrid nanoparticles together with the PKI. Typically, said polymeric stabilizing and matrix-forming component exhibits a polymeric structure, such as, but not limited to, methyl cellulose, hydroxyethyl cellulose, hydroxypropyl cellulose (e.g. HPC ef, HPC If and HPC jf), hydroxypropyl methylcellulose (e.g. Methocel E3 and E15 and Pharmacoat), hydroxypropyl methylcellulose acetate succinate (HPMC AS), hydroxypropyl methylcellulose phthalate (e.g. HPMCP-HP55), polyvinylpyrrolidone (e.g. PVP 30K and PVP 90K), polyvinyl acetate phthalate (PVAP), copolyvidone (e.g. Kollidon VA 64), crospovidon (e.g. Kollidon CL), methacrylic acid and ethylacrylate copolymer (e.g. Kollicoat ME), methacrylate acid and methyl methacrylate copolymer (e.g. Eudragit L100), polyethylene glycol (PEG), DL lactide/glycolide copolymer, poly DL-lactide, cellulose acetate phthalate (CAP), aminoalkyl methacrylate copolymers (e.g. Eudragit RL100, RL PO or RS PO), carbomer homopolymer Type A (e.g. Carbopol 971P), carbomer homopolymer Type B (e.g. Carbopol 974P) and Poloxamers (e.g. Pluronics, Kolliphor).",
                        "The term “polymer” or “polymeric” is here used to mean a compound that is made of monomers connected together to form a larger molecule. A polymer generally consists of 20 or more monomers connected together, however less than 20 monomers connected together are here also referred to as polymers.",
                        "The term “solubilizer” is here used to mean a compound that increases the solubility of a substance, such as, but not limited to, polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus), d-α-tocopherol acid polyethylene glycol 1000 succinate (TPGS), PEG-40 hydrogenated castor oil (Cremophor RH40), PEG-35 castor oil (Cremophor EL), PEG-40 stearate (MYRJ 540), hard fat (e.g. Gelucire 33/01), polyoxylglycerides (e.g. Gelucire 44/14), stearoyl polyoxylglycerides (e.g. Gelucire 50/13), PEG-8 caprylic/capric glycerides (e.g. Labrasol) and Poloxamers (e.g. Pluronics, Kolliphor).",
                        "As used herein, the phrase “primary particles” refers to the smallest particulate entities formed during the precipitation process. The boundaries of the particles are analyzed by SEM microscopy. Depending on process parameters, the primary particles may build together a more or less dense and porous network forming larger, agglomerated or bridging particles. Parameters affecting the agglomeration are e.g. temperature that may modify the softness of the primary particles; ratio solvent/antisolvent affecting precipitation time, concentration of the PKI solution; and the nature of the polymeric stabilizing and matrix-forming agent(s). The average size of the primary particles is typically between 1 to 1000 nm, preferably below 500 nm, more preferably below 250 nm.",
                        "As used herein, the phrases “supercritical” and “supercritical fluid” refer to that a chemical substance that is set to both a temperature higher or equal than its critical temperature (Tc) and a pressure higher or equal than its critical pressure (Pc).",
                        "As used herein, the phrases “subcritical” and “subcritical fluid” refer here to that one of critical temperature (Tc) or critical pressure (Pc) is set to a temperature or pressure higher than its critical temperature (Tc) or critical pressure (Pc), respectively, and the other of critical temperature (Tc) or critical pressure (Pc) is set to a temperature or pressure lower than its critical temperature (Tc) or critical pressure (Pc), respectively.",
                        "By the phrase “area under the curve (AUC)” is meant the area under the concentration-time curve, where the x-axis represents time and the y-axis represents solubilized drug concentration.",
                        "By the phrase “apparent solubility” is meant the concentration of material at apparent equilibrium. See further in the Examples section.",
                        "The term “supersaturation” is here used to mean that a solution contains more of the dissolved substance than could be dissolved by the solvent or media under normal circumstances.",
                        "As used herein, the term “Soluplus” or “soluplus” refers to polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "As used herein, the term “TPGS” refers to d-α-tocopherol acid polyethylene glycol 1000 succinate.",
                        "As used herein, the term “Chremophor RH40” refers to PEG-40 hydrogenated castor oil.",
                        "As used herein, the term “PVAP” refers to polyvinyl acetate phthalate.",
                        "As used herein, the term “PVP 90K” refers to polyvinylpyrrolidone K-90.",
                        "As used herein, the term “PVP 30K” refers to polyvinylpyrrolidone K-30.",
                        "As used herein, the term “HPMC-AS” refers to hydroxypropyl methylcellulose acetate succinate.",
                        "As used herein, the term “HPMCP HP55” refers to hydroxypropyl methyl cellulose phthalate.",
                        "As used herein, the term “HPC” refers to hydroxypropyl cellulose, such as HPC EF and HPC LF.",
                        "As used herein, the term “Kollidon VA64” refers to copolyvidone.",
                        "As used herein, the term “CAP” refers to cellulose acetate phthalate.",
                        "The dissolution mediums used for purposes of testing hybrid nanoparticles of the present invention, includes Fasted State Stimulated Intestinal Fluid, referred to as FaSSIF, Fed State Stimulated Intestinal Fluid, referred to as FeSSIF, and Simulated Gastric Fluid, referred to as SGF. FaSSIF media is tailored to represent a fasting state and has a pH of about 6.5 as well as particular osmolaric properties. FeSSIF media is tailored to represent a fed state and has a pH of about 5 as well as specific osmolaric properties. SGF is tailored to represent gastric fluid and has a pH of about 1.4 as well as particular osmolaric properties. FaSSIF, FeSSIF and SGF media are generally used in in vitro models for dissolution of poorly water-soluble drugs. The choice of medium will be dependent of the where in the intestinal tract and under what conditions (fasted or fed) particles are desired to dissolve and be taken up. Further details regarding these fluids are described in e.g. Hervé J. et al. Pharm Dev Technol. 2011 June; 16(3):278-86 and Jantratid, E., and Dressman, J. Dissolut. Technol. 2009 8, 21-25.",
                        "By the phrase “amorphous form” is meant non-crystalline solid form. The ease of dissolution may at least in part be attributed to the amount of energy required for dissolution of the components from a crystalline or amorphous solid phase. Amorphous particles require less energy for dissolution as compared to crystalline particles of the same compound.",
                        "The inventive compositions comprise particles with a PKI or a combination of two or more PKIs. However, the particles may comprise a combination of one or more PKIs and at least one further active ingredient, such as one or more drugs. Various kinds of PKIs can be effectively utilized.",
                        "The term PKIs (protein kinase inhibitors) as used herein, is intended to include also the hydrates, solvates (alcoholates), pharmaceutically acceptable acid salts, base salts or co-crystals of such protein kinase inhibiting compounds.",
                        "As used herein, the term water-insoluble or poorly water soluble (or hydrophobic) compounds, refers to compounds whose solubility in water at 25° C. is less than 1 g/100 ml, especially less than 0.1 g/100 ml in pure water at neutral pH.",
                        "The stable, amorphous hybrid nanoparticles comprised in the compositions of the present invention are typically in the form of particles as described elsewhere in this specification. There are a number of different methods for the formation of larger particles, e.g. granulation, melt extrusion, spray drying, precipitation etc. all of which typically encompass starting with formation of a mixture between the Active Pharmaceutical Ingredient (API) and the polymeric stabilizing and matrix-forming component. The particles comprised in the compositions of the present invention are produced with continuos processes for generating hybrid nanoparticles. Continuous processes in this context means that particle formation is continuously ongoing while at the same time continuously withdrawing/collecting/retaining hybrid nanoparticles from the mixture after their formation. In the preferred methods, i.e. precipitation methods, this means that a fluid which is a solution of the PKI, preferably in the form of a fluid stream, is mixed with an antisolvent fluid, preferably in the form of an antisolvent fluid stream. The polymeric stabilizing and matrix-forming component may be present in either one or both of the two fluids depending on its solubility characteristics. The mixing of the two fluids is taking place in a mixing function, e.g. a mixing chamber. In the case the process is continuous, i.e. the two fluids are fluid streams, the mixing function typically is associated with a particle formation and separation function wherein the mixed fluid stream may pass through while retaining the hybrid nanoparticles. Agents modifying the particle characteristics without being incorporated into the particles may be added to either one or both of the two fluids before the mixing step. The fluids typically are conventional liquids or supercritical fluids, where supercritical fluids also include subcritical fluids (i.e. fluids for which only one of pressure and temperature is above its supercritical value). Typical combinations are, a) conventional (i.e., non-supercritical) liquids for both the API solution and the antisolvent, b) supercritical solution of the API combined with conventional liquid for the antisolvent, c) conventional liquid for the API solution combined with supercritical fluid for the antisolvent, and d) supercitical fluids for both of the two fluids. In certain variants the antisolvent may be omitted. A fluid stream, preferably supercritical, containing both the API and the polymeric stabilizing and matrix-forming component is then allowed to expand into the particle formation function. It is preferred that at least one of the fluids is in a supercritical state in the precipitation methods described above. These kinds of precipitation methods are discussed in WO 2005061090 (Censdelivery AB), WO 2009072950 (XSpray Microparticles AB), WO 2009072953 (XSpray Microparticles AB), WO 2011159218 (XSpray Microparticles AB) and references cited in these publications.",
                        "The term “solution” encompasses that the solute is either a true solute or minute particles of colloidial dimensions (typically 1-1000 nm) and less than the particles to be produced.",
                        "A preferred particle formation system is the “Right Size system” developed by XSpray Microparticles AB, Sweden. A detailed description of the technology can be found in the WO-publications given in the preceding paragraph. An important characteristic of the system is that the two fluid streams should merge within a nozzle at an angle in the interval 45°-135°, with preference for about 90° and sprayed into a particle formation/separation function. In principle the system allows for producing particles of predetermined size and/or morphology. Here the Right Size system and apparatus will be described using the non-limiting example of a PKI as the drug and CO2 as a supercrititcal fluid antisolvent.",
                        "The system consists of one pumping set-up for the PKI dissolved in a liquid solvent, referred to as the API solution, and one pumping set-up for an antisolvent, for example CO2, however also other antisolvents may be used when suitable. Each pumping set-up includes instruments such as a flow meter and a pressure meter that are used to control the process conditions. These two pumping set-ups are fluidically connected at a spray nozzle.",
                        "A stream of liquid API solution is mixed with a stream of CO2 under flow conditions within the spray nozzle. The polymeric stabilizing and matrix-forming component is present in either the API solution or in the stream of CO2. These streams are sprayed at the outlet of the nozzle into a precipitation vessel under controlled conditions (typically pressure and temperature). CO2 acts as an antisolvent and makes the API to precipitate together with the polymeric stabilizing and matrix-forming component into fine particles. Particles are retained in the vessel by a filtering set-up. A back pressure regulator is typically used to control the pressure inside the precipitation vessel.",
                        "For preparing hybrid nanoparticles of certain drugs, for example but not limited to pazopanib and erlotinib, it may be advantageous to have an extra pumping set-up for injecting an additional solvent, referred to as a modifier, into the CO2. Here a pumping set-up control is set up for the modifier and the modifier is mixed with the CO2 in a mixer before entering the nozzle.",
                        "When using the system, the system operator typically starts by equilibrating the system by pumping CO2, an “PKI like solution” (a solution similar in composition to the PKI solution but containing no PKI and no excipient) and the modifier (if used) through the system until flow rates, pressure and temperature have reached a desired steady state. Critical parameters for setting up the system are PKI solution composition, PKI solution flow rate, CO2 flow rate, CO2 pressure and temperature, nature of the modifier and modifier flow rate, if such is used.",
                        "Next, the “PKI like solution” is exchanged for the PKI solution and particles are produced and retained downstream of the mixing, e.g. downstream of the outlet of the nozzle. Afterwards, the system is typically cleaned by pumping the “PKI like solution” through the system. The particles are dried by flushing CO2 through the retained particles in order to extract any remaining solvent. The precipitation vessel is then depressurized and the particles can be collected.",
                        "The solution/solvent and the antisolvent are typically miscible with each other. The pressure and temperature in the particle formation function, and/or upstream of this function, such as in the mixing function, provide supercritical or subcritical conditions in relation to the antisolvent.",
                        "The concentration of the PKI in the solution is typically below its saturation concentration, such as ≦50%, such as ≦60%, such as ≦75%, such as ≦85% or such as ≦95% of the saturation concentration. Suitable concentrations are typically found in the interval ≦20%, such as ≦10% or ≦5% or ≦3% with lower limits being ≦005% or 0.1% (all in w/v-%). The term “volatile” for solvents typically means boiling points of ≦200° C., such as ≦150° C. or ≦100° C., at atmospheric pressure. Examples are inorganic solvents and organic solvents with particular emphasis of dimethyl sulfoxide and trifluoroethanol and mixtures thereof. The term solvent includes mixtures of liquids which are miscible with each other. The solutions may contain agents that enhance or diminish the solubility of the PKI, e.g. acidic, alkaline, buffer components and/or other organic solvents.",
                        "Illustrative fluids which can be used as an antisolvent are\n\n\n- - a) gaseous at room temperature and atmospheric pressures, or\n  - b) liquid at room temperature and atmospheric pressure.",
                        "The antisolvent is typically selected for its ability to be readily dispersed into small droplets and for its ability to act as an atomizing agent and antisolvent against the PKI present in the solution.",
                        "Compounds/elements according to group (a) may be selected from carbon dioxide (Pc=74 bar and Tc=31° C.) (preferred), nitrous oxide (Pc=72 bar and Tc=36° C.), sulphur hexafluoride (Pc=37 bar and Tc=45° C.), ethane (Pc=48 bar and Tc=32° C.), ethylene (Pc=51 bar and Tc=10° C.), xenon (Pc=58 bar and Tc=16° C.), trifluoromethane (Pc=47 bar and Tc=26° C.), chlorotrifluoromethane (Pc=39 bar and Tc=29° C.) and nitrogen (Pc=34 bar and Tc=−147° C.) and mixtures containing these compounds/elements. Pc stands for critical pressure and Tc for critical temperature. Compounds according to group (b) are typically selected amongst conventional liquids of the same general types as discussed for solvents above but with the difference that the PKI present in the solution must be poorly soluble in the antisolvent. Particular liquids of group (b) comprise methanol, ethanol, acetone water and mixtures containing one or more of these fluids.",
                        "The antisolvents of group (a) above are typically used at pressures and temperatures providing i) supercritical conditions (supercritical fluid) or ii) a subcritical conditions (subcritical fluid) in the particle formation function and/or upstream of this function, such as in the mixing function and upstream of this latter function.",
                        "Variant (i) means pressures and temperatures which are typically above the critical pressure Pc and critical temperature Tc of the antisolvent used. For the pressure this typically means pressures in the interval (1.0-7.0)×Pc or in the interval ≧10 bar, suitably ≧20 bar with preference for ≧30 bar, higher than Pc with illustrative upper limits being 100 bar, 200 bar and 300 bar higher than Pc. For the temperature this typically means temperatures within (1.0-4.0)×Tc or in the interval of ≧5° C., suitably ≧10° C. with preference for ≧15° C. above Tc with illustrative upper limits being 10° C., 40° C. and 50° C. above Tc.",
                        "Variant (ii) means that at least one of temperature and pressure, with preference for only the temperature, is/are below the critical value. (Tc and Pc, respectively). Thus the temperature may be in the interval of (0.1-1)×Tc, such as (0.5-1)×Tc, or lower. Further, the temperature may be low, such as −10° C. or −30° C. These temperatures may be combined with pressures as defined in the preceding paragraph or with pressures lower than the Pc of the used antisolvent. For carbon dioxide this means that the temperature in the particle formation function is <+31° C., such as about +25° C. or lower combined with a pressure above or below 74 bar.",
                        "The antisolvents of group (b) above are typically used in the subcritical state, i.e. as a subcritical fluid.",
                        "In one aspect of the invention, there is provided a pharmaceutical composition comprising stable, amorphous hybrid nanoparticles of at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component; which composition optionally further comprises at least one pharmaceutically acceptable solubilizer.",
                        "In one embodiment of this aspect, there is provided a pharmaceutical composition comprising stable, amorphous hybrid nanoparticles of at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component; which composition further comprises at least one pharmaceutically acceptable solubilizer. Typically, said solubilizer is present separated from the hybrid nanoparticles in the composition. Or, typically, said solubilizer is distributed to the surface of the hybrid nanoparticles. Said solubilizer may be selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer, d-α-tocopherol acid polyethylene glycol 1000 succinate and a hydrogenated castor oil, such as PEG-40 hydrogenated castor oil or PEG-35 hydrogenated castor oil. Furthermore, said solubilizer may be a poloxamer.",
                        "The compositions comprising stable, amorphous hybrid nanoparticles comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, display increased dissolution rate.",
                        "Consequently, in another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, wherein said hybrid nanoparticles display an increased dissolution rate of said protein kinase inhibitor, compared to the dissolution rate of said protein kinase inhibitor in raw, crystalline form.",
                        "Typically, said dissolution rate is measured by a flow through cell system in sink conditions, e.g., according to the US Pharmacopea (USP4). Dissolution measurement in sink conditions of hybrid nanoparticles may be measured in a method consisting of adding the wished amount of powder into a flow through cell system (SOTAX, Allschwill, Switzerland), mounting the cell onto its apparatus and then pumping the appropriate medium (typically FaSSIF, FeSSIF, SGF) through the powder. The temperature of the apparatus is typically set to 37° C. The amount of powder added into the cell depends on drug load of the powder: The exact amount of powder can be calculated from results obtained from drug load analysis of the powders. The PKI may be added into the flow through cell and a flow rate between 5 and 25 ml medium/min is pumped through the powder. One ml samples of the medium passing through the cell is collected at predetermined times and subsequently analyzed by HPLC (e.g. C18 column Eclipse, 4.6 mm×15 cm, 1 ml/min, detection 254 to 400 nm). Samples are typically taken after 0, 0.5, 1, 1.5, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 25, 30, 35 and 40 min from the moment the medium comes out from the flow through cell. The accumulated % solubilized of the amount of active substance added into the flow through cell can be calculated and plotted against time (min). The initial slope (“initial dissolution rate”, representing 0-10 minutes) of the graph may be estimated and taken as the dissolution rate of the material in sink condition at 37° C. in the given dissolution medium.",
                        "Preferably, the dissolution rate is measured within the initial 0 to 10 minutes of dissolution.",
                        "The increased dissolution rate is preferably measured in a solution as a dissolution rate ratio of said stable, amorphous hybrid nanoparticles and said protein kinase inhibitor in raw, crystalline form. Preferably said ratio is from about 1.5:1 to about 500:1, such as from about 10:1 to about 30:1.",
                        "Preferably, the dissolution rate is measured in a solution with intestinal pH, such as FaSSIF or FeSSIF or in a solution with gastric pH, such as SGF.",
                        "Typically, said dissolution rate is measured by a flow through cell system, for instance in sink conditions. Dissolution measurement in sink conditions of stable, amorphous hybrid nanoparticles may be measured in a method consisting of adding the wished amount of powder into a flow through cell system (SOTAX, Allschwill, Switzerland), mounting the cell onto its apparatus and then pumping the appropriate medium (typically FaSSIF, FeSSIF, SGF) through the powder. The temperature of the apparatus is typically set to 37° C. The amount of powder added into the cell depends on drug load of the powder: The exact amount of powder can be calculated from results obtained from drug load analysis of the powders. The PKI may be added into the flow through cell and a flow rate between 5 and 25 ml medium/min is pumped through the powder. One ml samples of the medium passing through the cell is collected at predetermined times and subsequently analyzed by HPLC (e.g. C18 column Eclipse, 4.6 mm×15 cm, 1 ml/min, detection 254 to 400 nm). Samples are typically taken after 0, 0.5, 1, 1.5, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 25, 30, 35 and 40 min from the moment the medium comes out from the flow through cell. The accumulated % solubilized of the amount of active substance added into the flow through cell, can be calculated and plotted against time (min). The initial slope (“initial dissolution rate”, representing 0-10 minutes) of the graph can be estimated and taken as the dissolution rate of the material in sink condition at 37° C. in the given dissolution medium.",
                        "In another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, which provides a solubility increase of inhibitor in a solution, said increase measured as the area under the curve (AUC) during about from 40 minutes to about 90 minutes, in said solution as compared with the AUC of inhibitor in raw, crystalline form. Typically, said increase is from about 2:1 to about 10 000:1, wherein 1 represents AUC of inhibitor in raw, crystalline form. The increase may be measured in a solution with intestinal pH, such as FaSSIF or FeSSIF, or in a solution with gastric pH, such as SGF.",
                        "The polymeric stabilizing and matrix-forming component of the present invention includes, but not limited to, methyl cellulose, hydroxyethyl cellulose, hydroxypropyl cellulose (e.g. HPC ef, HPC If and HPC jf), hydroxypropyl methylcellulose (e.g. Methocel E3 and E15 and Pharmacoat), hydroxypropyl methylcellulose acetate succinate (HPMC AS), hydroxypropyl methylcellulose phthalate (e.g. HPMCP HP55), polyvinylpyrrolidone (e.g. PVP 30K and PVP 90K), polyvinyl acetate phthalate (PVAP), copolyvidone (e.g. Kollidon VA 64), crospovidon (e.g. Kollidon CL), methacrylic acid and ethylacrylate copolymer (e.g. Kollicoat ME), methacrylate acid and methyl methacrylate copolymer (e.g. Eudragit L100), polyethylene glycol (PEG), DL lactide/glycolide copolymer, poly DL-lactide, cellulose acetate phthalate (CAP), carbomer homopolymer Type A (Carbopol 971P), carbomer homopolymer Type B (Carbopol 974P), aminoalkyl methacrylate copolymers (e.g. Eudragit RL100, RL PO or RS PO) and Poloxamers (e.g. Pluronics, Kolliphor).",
                        "Consequently, in another embodiment of this aspect, said polymeric stabilizing and matrix-forming component is selected from methyl cellulose, hydroxyethyl cellulose, hydroxypropyl cellulose, hydroxypropyl methylcellulose, hydroxypropyl methylcellulose acetate succinate, hydroxypropyl methylcellulose phthalate, polyvinylpyrrolidone, polyvinyl acetate phthalate, copolyvidone, crospovidon, methacrylic acid and ethylacrylate copolymer, methacrylate acid and methyl methacrylate copolymer, polyethylene glycol, DL lactide/glycolide copolymer, poly DL-lactide, cellulose acetate phthalate, carbomer homopolymer Type A, carbomer homopolymer Type B, aminoalkyl methacrylate copolymers and polaxamers. Preferably, said polymeric stabilizing and matrix-forming component is selected from hydroxypropyl methylcellulose phthalate, hydroxypropyl cellulose, copolyvidon, hydroxypropyl methylcellulose acetate succinate, polyvinyl acetate phthalate, cellulose acetate phthalate and polyvinylpyrrolidone.",
                        "In another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, characterized by providing an amorphous powder X-ray diffraction pattern.",
                        "In another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, wherein the dissolution rate of said stable, amorphous hybrid nanoparticles remain stable to at least about 90%, after 6 months of storage or more, at room temperature.",
                        "In another embodiment of this aspect, said protein kinase inhibitor is a tyrosine kinase inhibitor selected from the group consisting of lapatinib, pazopanib, nilotinib, erlotinib, dasatinib, gefitinib, sorafenib, crizotinib, vemurafenib and axitinib; or salts or hydrates or solvates thereof, or combinations thereof. In some embodiments it may be advantageous to use other PKIs. Examples of PKI include, but are not limited to afatinib, bosutinib, cediranib, fostamatinib, imatinib, lenvatinib, lestaurtinib, motesanib, mubritinib, pegaptanib, ruxolitinib, semaxanib, sunitinib, tandunitib, tipifamib and vandetanib; or salts or hydrates or solvates thereof, or combinations thereof.",
                        "In another embodiment of this aspect, said stable, amorphous hybrid nanoparticles has an average particle diameter size of less than about 1000 nm, such as less than about 500 nm, preferably less than 250 nm.",
                        "In another embodiment of this aspect, said solvent is an organic solvent selected from DMSO and trifluoroethanol, or a mixture of these solvents, or mixture of these solvents with other organic solvent such as DMSO/acetone, DMSO/tetrahydrofurane or trifluoroethanol/ethyl acetate.",
                        "The compositions of the present invention may also dissolve and the protein kinase inhibitor may be systemically absorbed independently of the pH in the surrounding environment, and typically approximately in equal amounts, especially at both a gastric pH, such as from about pH 1.2 to about pH 2.1, preferably about 1.7 and at a intestinal pH such as from about pH 4.5 to about pH 8, preferably at a pH of about 6. With systemically absorbed, is meant that the protein kinase inhibitor is released from the stable, amorphous hybrid nanoparticles and taken up by the systemic blood stream. Therefore, in another embodiment of this aspect, there is provided a composition, wherein said protein kinase inhibitor is systemically absorbed independently of the pH. Typically, said protein kinase inhibitor is systemically absorbed with approximately equal amounts at both a gastric pH and at an intestinal pH. Preferably, said acid pH is about pH 1.4 and preferably said neutral pH is about pH 6.5.",
                        "With approximately equal amounts is meant that the concentration of protein kinase inhibitor in the blood stream, after exposure is approximately similar. This may be illustrated by a ratio, wherein the concentration of protein kinase inhibitor in the blood stream is measured after administration in gastric pH conditions (A) and compared with the concentration of protein kinase inhibitor in the blood stream is measured after administration in intestinal pH conditions (N). Typically, the ratio A:N is from about 0.75:1 to about 1.5:1 and preferably from about 1:1 to about 1.25:1. The concentration measurement of protein kinase inhibitor in the blood stream may be carried out as an area under the curve (AUC) during 0-24 hours, the maximum concentration (Cmax) or as bioavailability.",
                        "Consequently, in another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, wherein the concentration of systemically absorbed protein kinase inhibitor in gastric pH conditions compared with the concentration of systemically absorbed protein kinase inhibitor in intestinal pH conditions is in a ratio of from about 0.75:1 to about 1.5:1, preferably of from about 1:1 to about 1.25:1. Typically said gastric pH condition represents a pH of about 1.4 and said intestinal pH condition represents a pH of about 6. Typically, the concentration is measured as area under the curve (AUC) during 0-24 hours of exposure of the composition or as the maximum concentration (Cmax).",
                        "The amounts of systemically absorbed protein kinase inhibitor may be measured in various ways. There is provided, in Example 14 in the present disclosure, a method for measurement of systemically absorbed protein kinase inhibitors at various pHs, i.e. under both acid and neutral conditions.",
                        "In another embodiment of this aspect, there is provided a composition comprising stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, which produces a solubility increase of inhibitor in a solution up to supersaturation, said increase measured as the area under the curve (AUC) during about 90 minutes, in said solution and compared with the AUC of inhibitor in crystalline form. Said increase may be from to about 2:1 to about 1000:1, wherein 1 represents AUC of inhibitor in crystalline form.",
                        "For understanding how the hybrid nanoparticles in the compositons of the invention will dissolve in vivo in the different environments of the stomach, small intestine, large intestine and colon, it is important to choose an appropriate solution for in vitro dissolution testing. It is critical that the in vitro test conditions mimic the in vivo environment as closely as possible, for example pH and osmolarity. Typically, for intestinal uptake, the pH is between 6 and 7. Therefore, the solution may hold a pH from about pH 6 to about pH 7, such as about pH 6.5.",
                        "Therefore, in embodiments of the invention, the solution for testing has a pH from about pH 4.5 to about pH 8, such as about pH 6.5 or such as about pH 5. The solutions may represent Fasted Simulated State Intestinal Fluid (FaSSIF) or Fed Simulated State Intestinal Fluid (FeSSIF).",
                        "Typically, for gastric uptake, the pH is between 1 and 2. Therefore, the solution may hold a pH from about pH 1 to about pH 2, such as about pH 1.4. Therefore, in embodiments of the invention, the solution for testing may represent Simulated Gastric Fluid (SGF).",
                        "The choice of solution will be dependent on where in the intestinal tract and under what conditions (fasted or fed) the composition is desired to dissolve and be taken up. Recipes and preparation of these solutions are obtainable from the manufacturer (Biorelevant, Croydon, U.K.). Further details are also disclosed in Jantratid, E., and Dressman, J. (2009) Dissolut. Technol. 8, 21-25).",
                        "The amount of PKI in the hybrid nanoparticles in the compositions of the present invention may be less or more, such as wherein the amount of PKI in the hybrid nanoparticles is from about 0.01% by weight to about 99.9% by weight.",
                        "In another embodiment of this aspect, there is provided compositions comprising stable, amorphous hybrid nanoparticles of the present invention, wherein the amount of PKI in the hybrid nanoparticles is from about 10% by weight to about 70% by weight.",
                        "In another embodiment of this aspect, there is provided provided compositions comprising stable, amorphous hybrid nanoparticles of the present invention, wherein the amount of PKI in the hybrid nanoparticles is from about 10% by weight to about 50% by weight.",
                        "In some embodiments, it may be advantageous that the amount of PKI in the stable, amorphous hybrid nanoparticles is from 5% by weight to about 50% by weight, from 10% by weight to about 40% by weight, from about 10% by weight to about 30% by weight, or from about 10% by weight to about 20% by weight.",
                        "Control of the characteristics of the particles may be convenient for specific applications. Particle size, particle agglomeration, particles porosity and the choice and ratio of the polymeric stabilizing and matrix-forming agent could be modified in order to increase or decrease the surface area to volume ratio of the particle or behaviour of the particles in a gastroinstestinal fluids, leading to an increase or decrease of the dissolution rate. Dependent on the desired dissolution characteristics such particles characteristics may be adapted. Furthermore, particles with differents characteristics may be present in the same pharmaceutical composition to provide an initial dose and a prolonged or delayed dose of active ingredient. Additionally, it may be advantageous to provide different PKIs and/or other active ingredient(s) in different primary particles with different characteristics adapted to provide desired dissolution rates for each active ingredient(s).",
                        "Other embodiments of the invention provide pharmaceutical compositions comprising the stable, amorphous hybrid nanoparticles. Such compositions may further comprise at least one pharmaceutically acceptable solubilizer. Said solubilizer may be present separated from the stable, amorphous hybrid nanoparticles (i.e. physically mixed with pre-prepared solid nanoparticles) in the composition or be randomly intermixed within the stable, amorphous hybrid nanoparticles in the pharmaceutical composition. The pharmaceutical composition may also be in a dosage form consisting of several layers, for example laminated or multilayered tablets, such that the hybrid nanoparticles are separated from the solubilizer. The solubilizer may be selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer, d-α-tocopherol acid polyethylene glycol 1000 succinate and a hydrogenated castor oil, such as PEG-40 hydrogenated castor oil or PEG-35 hydrogenated castor oil. Said solubilizer may also be a poloxamer.",
                        "In another embodiment of this aspect, said inhibitor is a tyrosine kinase inhibitor selected from the group consisting of lapatinib, pazopanib, nilotinib, erlotinib, dasatinib, gefitinib, sorafenib axitinib, crizotinib and vemurafenib; or salts or hydrates or solvates thereof, or combinations thereof.",
                        "In another embodiment of this aspect, said inhibitor is nilotinib; and said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate.",
                        "In another embodiment of this aspect, said inhibitor is nilotinib; said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
                        "In another embodiment of this aspect, said inhibitor is erlotinib, and said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose acetate succinate.",
                        "In another embodiment of this aspect, said inhibitor is erlotinib; said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose acetate succinate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
                        "In another embodiment of this aspect, said inhibitor is pazopanib; and said polymeric stabilizing and matrix-forming component is polyvinylpyrrolidone.",
                        "In another embodiment of this aspect, said inhibitor is pazopanib; said polymeric stabilizing and matrix-forming component is polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
                        "In another embodiment of this aspect, said inhibitor is lapatinib; and said polymeric stabilizing and matrix-forming component is hydroxypropyl cellulose.",
                        "In another embodiment of this aspect, said inhibitor is lapatinib; said polymeric stabilizing and matrix-forming component is hydroxypropyl cellulose; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
                        "In another embodiment of this aspect, said inhibitor is gefitinib; and said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate or polyvinylpyrrolidone.",
                        "In another embodiment of this aspect, said inhibitor is gefitinib; said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate or polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "In another embodiment of this aspect, said inhibitor is dasatinib; and said polymeric stabilizing and matrix-forming component is copolyvidone.",
                        "In another embodiment of this aspect, said inhibitor is dasatinib; said polymeric stabilizing and matrix-forming component is copolyvidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "In another embodiment of this aspect, said inhibitor is sorafenib; and said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate.",
                        "In another embodiment of this aspect, said inhibitor is sorafenib; said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "In another embodiment of this aspect, said inhibitor is nilotinib base; and said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate.",
                        "In another embodiment of this aspect, said inhibitor is nilotinib base; said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "In another embodiment of this aspect, said inhibitor is axitinib; and said polymeric stabilizing and matrix-forming component is copolyvidone or hydroxypropyl methylcellulose acetate succinate.",
                        "In another embodiment of this aspect, said inhibitor is axitinib; said polymeric stabilizing and matrix-forming component is copolyvidone or hydroxypropyl methylcellulose acetate succinate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
                        "In another embodiment of this aspect, said inhibitor is crizotinib; and said polymeric stabilizing and matrix-forming component is copolyvidone or polyvinylpyrrolidone.",
                        "In another embodiment of this aspect, said inhibitor is crizotinib; said polymeric stabilizing and matrix-forming component is copolyvidone or polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or PEG-40 hydrogenated castor oil.",
                        "In another embodiment of this aspect, said inhibitor is vemurafenib; and said polymeric stabilizing and matrix-forming component is copolyvidone or cellulose acetate phthalate.",
                        "In another embodiment of this aspect, said inhibitor is vemurafenib; said polymeric stabilizing and matrix-forming component is copolyvidone or cellulose acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol.",
                        "In another embodiment of this aspect, said protein kinase inhibitor is partially released from the composition, at a pH of from about 1 to about 2, preferably at about pH 1.4.",
                        "In another aspect of the invention, there is provided stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, as defined in the present disclosure.",
                        "In another embodiment of this aspect, there is provided a composition of the invention, for use in therapy.",
                        "In another embodiment of this aspect, there is provided a composition of the invention, for use in the treatment of proliferative disorders. Typically, said proliferative disorder is selected from tumours and cancers, including, but not limited to, neurofibromatosis, tuberous sclerosis, hemangiomas and lymphangiogenesis, cervical, anal and oral cancers, eye or ocular cancer, stomach cancer, colon cancer, bladder cancer, rectal cancer, liver cancer, pancreas cancer, lung cancer, breast cancer, cervix uteri cancer, corpus uteri cancer, ovary cancer, prostate cancer, testis cancer, renal cancer, brain cancer, cancer of the central nervous system, head and neck cancer, throat cancer, skin melanoma, acute lymphocytic leukemia, acute myelogenous leukemia, Ewing's Sarcoma, Kaposi's Sarcoma, basal cell carcinoma and squamous cell carcinoma, small cell lung cancer, choriocarcinoma, rhabdomyosarcoma, angiosarcoma, hemangioendothelioma, Wilms Tumor, neuroblastoma, mouth/pharynx cancer, esophageal cancer, larynx cancer, lymphoma, multiple myeloma; cardiac hypertrophy, age-related macular degeneration and diabetic retinopathy.",
                        "In another embodiment of this aspect, there is provided a composition of the invention, said composition is provided during food intake.",
                        "In another aspect of the invention, there is provided a method of treating proliferative disorder in a patient in need thereof, comprising administering a therapeutically effective amount of a composition according to the present invention. Said proliferative disorder is typically selected from tumours and cancers including, but not limited to, neurofibromatosis, tuberous sclerosis, hemangiomas and lymphangiogenesis, cervical, anal and oral cancers, eye or ocular cancer, stomach cancer, colon cancer, bladder cancer, rectal cancer, liver cancer, pancreas cancer, lung cancer, breast cancer, cervix uteri cancer, corpus uteri cancer, ovary cancer, prostate cancer, testis cancer, renal cancer, brain cancer, cancer of the central nervous system, head and neck cancer, throat cancer, skin melanoma, acute lymphocytic leukemia, acute myelogenous leukemia, Ewing's Sarcoma, Kaposi's Sarcoma, basal cell carcinoma and squamous cell carcinoma, small cell lung cancer, choriocarcinoma, rhabdomyosarcoma, angiosarcoma, hemangioendothelioma, Wilms Tumor, neuroblastoma, mouth/pharynx cancer, esophageal cancer, larynx cancer, lymphoma, multiple myeloma; cardiac hypertrophy, age-related macular degeneration and diabetic retinopathy.",
                        "It will be appreciated that the amount of a protein kinase inhibitor in the stable, amorphous hybrid nanoparticles of the present invention required for use in treatment will vary not only with the particular inhibitor selected but also with the route of administration, the nature of the condition for which treatment is required and the age, weight and condition of the patient and will be ultimately at the discretion of the attendant physician. In general however a suitable dose may be in the range of from about 0.005 to about 30 mg/kg of body weight per day, preferably in the range of 0.05 to 10 mg/kg/day.",
                        "The desired dose is conveniently presented in a single dose or as a divided dose administered at appropriate intervals, for example as two, three, four or more doses per day. Dependent on the need of the treatment and/or prevention, the desired dose may also be, for example, once every two days, once every three days, or even once a week.",
                        "The composition is conveniently administered in unit dosage form; for example containing 0.5 to 1500 mg, conveniently 1 to 1000 mg, most conveniently 5 to 700 mg of active ingredient per unit dosage form. The compositions of the invention will normally be administrated via the oral, parenteral, intravenous, intramuscular, subcutaneous or other injectable ways, buccal, rectal, vaginal, transdermal and/or nasal route and/or via inhalation, in a pharmaceutically acceptable dosage form. Depending upon the disorder and patient to be treated and the route of administration, the compositions may be administered at varying doses.",
                        "Pharmaceutical compositions include but are not limited to those suitable for oral, rectal, nasal, topical (including buccal and sub-lingual), transdermal, vaginal or parenteral (including intramuscular, subcutaneous and intravenous) administration or in a form suitable for administration by inhalation or insufflation. The compositions may, where appropriate, be conveniently presented in discrete dosage units and may be prepared by any of the methods well known in the art of pharmacy. Pharmaceutical compositions suitable for oral administration are conveniently presented as discrete units such as capsules, cachets or tablets, each containing a predetermined amount of the active substance.",
                        "Tablets and capsules for oral administration may contain conventional excipients such as binding agents, fillers, lubricants, disintegrants, or wetting agents. The tablets may be coated according to methods well known in the art.",
                        "The compositions may be formulated for parenteral administration (e.g. by injection, for example bolus injection or continuous infusion) and may be presented in unit dose form in ampoules, pre-filled syringes, small volume infusion or in multi-dose containers with an added preservative. The compositions may take such forms as suspensions, solutions, or emulsions in oily or aqueous vehicles, and may contain formulation agents such as suspending, stabilizing and/or dispersing agents.",
                        "The above described compositions may be adapted to give sustained release of the active inhibitor.",
                        "The following examples are provided to illustrate various embodiments of the present invention and shall not be considered as limiting in scope."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "incorporate references",
                        "define hybrid nanoparticles",
                        "quantify crystalline PKI",
                        "define solid dispersion particles",
                        "define stability",
                        "define protein kinase inhibitor",
                        "define polymeric stabilizing and matrix-forming component",
                        "define polymer",
                        "define solubilizer",
                        "define primary particles",
                        "define supercritical fluid",
                        "define subcritical fluid",
                        "define area under the curve",
                        "define apparent solubility",
                        "define supersaturation",
                        "define specific terms (Soluplus, TPGS, etc.)",
                        "describe dissolution mediums (FaSSIF, FeSSIF, SGF)",
                        "describe amorphous form",
                        "describe inventive compositions",
                        "define PKIs and related terms",
                        "define water-insoluble compounds",
                        "describe formation of hybrid nanoparticles",
                        "describe continuous processes for generating hybrid nanoparticles",
                        "describe precipitation methods",
                        "describe the \"Right Size system\"",
                        "describe the system components",
                        "describe the process of producing hybrid nanoparticles",
                        "describe the role of the polymeric stabilizing and matrix-forming component",
                        "describe the use of modifiers",
                        "describe the system setup and operation",
                        "describe the particle formation function",
                        "describe the role of pressure and temperature",
                        "describe the concentration of PKI in the solution",
                        "describe the properties of solvents",
                        "describe the properties of antisolvents",
                        "describe the selection of antisolvents",
                        "describe the use of supercritical and subcritical fluids",
                        "describe the conditions for supercritical and subcritical fluids",
                        "describe the pharmaceutical composition",
                        "describe the optional inclusion of solubilizers",
                        "describe the distribution of solubilizers",
                        "describe the increased dissolution rate",
                        "describe the measurement of dissolution rate",
                        "describe the flow through cell system",
                        "describe the calculation of dissolution rate ratio",
                        "describe the preferred dissolution rate ratio",
                        "describe the measurement of dissolution rate in different solutions",
                        "describe the solubility increase of inhibitor",
                        "describe the measurement of solubility increase",
                        "describe the preferred solubility increase",
                        "describe the measurement of solubility increase in different solutions",
                        "summarize the pharmaceutical composition",
                        "summarize the advantages of the invention",
                        "list polymeric stabilizing and matrix-forming components",
                        "specify polymeric stabilizing and matrix-forming components",
                        "provide composition with stable, amorphous hybrid nanoparticles",
                        "characterize dissolution rate of stable, amorphous hybrid nanoparticles",
                        "specify protein kinase inhibitor",
                        "provide composition with stable, amorphous hybrid nanoparticles and protein kinase inhibitor",
                        "characterize dissolution rate of stable, amorphous hybrid nanoparticles in gastric pH conditions",
                        "characterize dissolution rate of stable, amorphous hybrid nanoparticles in intestinal pH conditions",
                        "compare dissolution rates in gastric and intestinal pH conditions",
                        "provide method for measuring systemically absorbed protein kinase inhibitor",
                        "specify solubility increase of inhibitor in solution",
                        "describe in vitro dissolution testing conditions",
                        "specify pH range for in vitro dissolution testing",
                        "specify solubilizer for pharmaceutical composition",
                        "describe pharmaceutical composition with solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component",
                        "specify inhibitor, polymeric stabilizing and matrix-forming component, and solubilizer",
                        "provide composition for use in therapy",
                        "provide composition for use in treatment of proliferative disorders",
                        "provide composition for administration during food intake",
                        "provide method of treating proliferative disorder",
                        "specify dose of protein kinase inhibitor",
                        "specify administration route",
                        "specify pharmaceutical dosage form",
                        "specify unit dosage form",
                        "describe oral administration",
                        "describe parenteral administration",
                        "describe other administration routes",
                        "provide examples of the invention"
                    ],
                    "num_characters": 50835,
                    "outline_medium": [
                        "define hybrid nanoparticles",
                        "describe properties of hybrid nanoparticles",
                        "define solid dispersion particles",
                        "explain stability of hybrid nanoparticles",
                        "define protein kinase inhibitor (PKI)",
                        "describe polymeric stabilizing and matrix-forming component",
                        "define solubilizer",
                        "explain primary particles and agglomeration",
                        "define various terms related to solubility and dissolution",
                        "define PKIs and related terms",
                        "define water-insoluble compounds",
                        "describe formation of hybrid nanoparticles",
                        "describe continuous processes for generating hybrid nanoparticles",
                        "describe precipitation methods",
                        "describe the \"Right Size system\"",
                        "describe the system components and operation",
                        "describe particle formation and separation",
                        "describe system setup and operation",
                        "describe particle collection and drying",
                        "describe solution and antisolvent properties",
                        "describe antisolvent selection and properties",
                        "describe pharmaceutical composition",
                        "describe solubilizer properties and distribution",
                        "describe increased dissolution rate",
                        "describe dissolution rate measurement",
                        "describe solubility increase",
                        "list polymeric stabilizing and matrix-forming components",
                        "specify polymeric stabilizing and matrix-forming components",
                        "describe composition with stable, amorphous hybrid nanoparticles",
                        "specify protein kinase inhibitor",
                        "describe dissolution rate of stable, amorphous hybrid nanoparticles",
                        "specify average particle diameter size",
                        "describe solvent selection",
                        "describe systemic absorption of protein kinase inhibitor",
                        "specify pH conditions for systemic absorption",
                        "describe measurement of systemically absorbed protein kinase inhibitor",
                        "describe solubility increase of inhibitor",
                        "specify pH range for in vitro dissolution testing",
                        "describe solution preparation for in vitro dissolution testing",
                        "specify amount of PKI in hybrid nanoparticles",
                        "describe control of particle characteristics",
                        "describe pharmaceutical compositions comprising stable, amorphous hybrid nanoparticles",
                        "specify solubilizer selection",
                        "describe pharmaceutical composition with multiple layers",
                        "specify inhibitor and polymeric stabilizing and matrix-forming component combinations",
                        "describe pharmaceutical composition for therapy",
                        "describe pharmaceutical composition for treating proliferative disorders",
                        "describe method of treating proliferative disorder",
                        "describe dosage and administration of pharmaceutical composition"
                    ],
                    "outline_short": [
                        "define hybrid nanoparticles",
                        "describe properties of solid dispersion particles",
                        "explain terminology for protein kinase inhibitors and polymeric stabilizing components",
                        "define dissolution mediums and amorphous form",
                        "define PKIs and water-insoluble compounds",
                        "describe formation of hybrid nanoparticles",
                        "detail particle formation system",
                        "explain operation of Right Size system",
                        "describe properties of solutions and antisolvents",
                        "specify antisolvent selection and conditions",
                        "describe pharmaceutical composition and its properties",
                        "detail dissolution rate measurement",
                        "list polymeric stabilizing and matrix-forming components",
                        "describe embodiments of polymeric stabilizing and matrix-forming components",
                        "describe composition with stable, amorphous hybrid nanoparticles",
                        "describe dissolution rate of stable, amorphous hybrid nanoparticles",
                        "describe protein kinase inhibitors",
                        "describe particle size of stable, amorphous hybrid nanoparticles",
                        "describe solvent for in vitro dissolution testing",
                        "describe amount of PKI in hybrid nanoparticles",
                        "describe control of particle characteristics",
                        "describe pharmaceutical compositions with solubilizers",
                        "describe embodiments of inhibitors and polymeric stabilizing and matrix-forming components"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "Below follows a number of non-limiting examples of compositions comprising stable, amorphous hybrid nanoparticles. In the tables, the following abbreviations to “compositions” apply:",
                        "“I” represents the protein kinase inhibitor (PKI);\n\n“P” represents the polymeric stabilizing and matrix-forming component;\n\n“S” represents the solubilizer;\n\n“I+P” represents a physical mix of the inhibitor with the polymeric stabilizing and matrix-forming component, i.e. without further processing;\n\n“I+S” represents a physical mix of the inhibitor with the solubilizer;\n\n“I+P+S” represents a physical mix of the inhibitor, the polymeric stabilizing and matrix-forming component and the solubilizer;\n\n“I/P” represents stable, amorphous hybrid nanoparticles with the inhibitor and the polymeric stabilizing and matrix-forming component;\n\n“I/P+S” represents stable, amorphous hybrid nanoparticles with the inhibitor and the polymeric stabilizing and matrix-forming component and a separate solubilizer added;\n\n“I/P/S” represents stable, amorphous hybrid nanoparticles with the inhibitor, the polymeric stabilizing and matrix-forming component and the solubilizer.\n\n“Exp” represents the experiment number.",
                        "The stable, amorphous hybrid nanoparticles were produced with exemplary PKIs, polymeric stabilizing and matrix-forming components (“Polymers”), solubilizers, solution concentrations, ratios, solvents, antisolvents, temperatures and pressures as set out below and in Table A.",
                        "A 3-6% w/v PKI/polymer solution in solvent, with a ratio PKI/polymer of about 20-70% w/w, was pumped through XSpray's RightSize nozzle at the flow rate of 1 ml/min using a high-performance liquid chromatography pump, together with a 100 g/min CO2 (super- or subcritical) stream. The pressure in the precipitation chamber was set to about 100-175 bar and the temperature was set to about 10 to 50° C. Both streams contact within the nozzle and the hybrid nanoparticles were formed and subsequently collected in the particle in the collecting chamber. The CO2 and solvent passed through the filtering system of the collecting chamber and were drained via the back pressure regulator outlet which maintains the pressure within the precipitation and collecting chambers. After pumping of the PKI/polymer solution and cleaning of the tubing with the same solvent used to prepare the PKI/polymer solution, residual solvents left within both the precipitation and collecting chambers were removed by flushing these chambers with pure scCO2. After the flushing process, the CO2 was slowly drained off from the collecting chamber. Once the CO2 had been completely removed, the particles on the filtering system were collected for analysis.",
                        "For I/P/S type particles, a defined amount of solubilizer is added and dissolved into the PKI/polymer solution before pumping the solution through the nozzle for precipitation according to the methods described above.",
                        "For I/P+S type particles, a defined amount of solubilizer is added to the stable, amorphous hybrid nanoparticles in a glass vial. The glass vial is slowly rotated for mixing of the solubilizer with the hybrid nanoparticles."
                    ],
                    "subsections": [
                        {
                            "title": "General Description of Dissolution Measurement Assay",
                            "paragraphs": [
                                "The method consists of adding the wished amount of powder of stable, amorphous hybrid nanoparticles into a glass vial and then pouring in it the appropriate medium (typically FaSSIF, FeSSIF or SGF). The medium was prepared in accordance with the manufacturer's instructions. The amount of powder added depends on the wished “total PKI concentration”. For some experiments where powders with high drug loads were tested and compared, the real amount of PKI in the stable, amorphous hybrid nanoparticles was not taken in account. For other experiments, the drug load was first estimated by HPLC and the amount of powder to obtain the drug concentration was calculated.",
                                "Typically, the powder was added in a 8 mL glass bottle and 7 mL of solution was added (typically FaSSIF, FeSSIF or SGF). The glass bottle was put on a shaker (approximately 1 rotation per minute) for dissolution. Samples of 500 μl where taken after different times, and subsequently centrifuged at approximately 15000 g for 3 minutes. The resulting supernatant was then analyzed by HPLC (C18 column Eclipse, 4.6 mm×15 cm, 1 mL/min, detection at 254-400 nM. Generally samples were taken after 5, 30 and 90 min and eventually 150 min."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe dissolution measurement assay method",
                                "outline sample preparation and analysis"
                            ],
                            "num_characters": 1200,
                            "outline_medium": [
                                "describe dissolution measurement assay"
                            ],
                            "outline_short": [
                                "outline dissolution measurement assay method"
                            ]
                        },
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Solubility at pH 6.5 and pH 5**",
                                "A number of experiments were carried out, wherein nilotinib base or nilotinib HCl represented the protein kinase inhibitor. The experiments were carried out by measuring concentration of solubilized PKI (mg/L) after 5, 30 and 90 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Further, experiments were carried out in an alternative solution at about pH 5, namely FeSSIF (Fed State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of protein kinase inhibitor was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 1 and 2, where Table 1 provides data of concentration of nilotinib HCl (mg/L) after 5, 30 and 90 minutes dissolution, whereas Table 2 provides data of % solubilized nilotinib HCl after 30 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 90 minutes dissolution and the AUC increase of stable, amorphous hybrid nanoparticles, compared to nilotinib HCl in raw, crystalline form added to the solution (experiments 1-40). In Tables 3 and 4, there is provided dissolution data in FeSSIF solution, presented similarly as Table 1 and 2 (experiments 41-55). Table 5 provides data from a comparative experiment with similar stable, amorphous hybrid nanoparticles, carried out in FaSSIF and FeSSIF, respectively (experiments 56-57). Table 6 presents further comparative data for experiments carried out in FaSSIF and FeSSIF, respectively.",
                                "**Conclusions Example 1**",
                                "Experiments 17-23 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles with nilotinib HCl and a polymeric stabilizing and matrix-forming component. Particular improvements are achieved with the polymeric stabilizing and matrix-forming components hydroxypropyl methylcellulose phthalate (HPMCP HP55) and polyvinyl acetate phthalate (PVAP). These improvements are not obtained when physically mixing nilotinib HCl with a polymeric stabilizing and matrix-forming component. Experiments 24-36 clearly shows that a further solubility increase is obtained with stable, amorphous hybrid nanoparticles with nilotinib HCl and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added. Particular improvements are achieved by the addition of a separate solubilizer such as polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus) or d-α-tocopherol acid polyethylene glycol 1000 succinate (TPGS). These improvements were not obtained when physically mixing nilotinib HCl, solubilizer and/or polymeric stabilizing and matrix-forming component (I+S or I+P+S). No particular improvements were obtained with stable, amorphous hybrid nanoparticles with nilotinib HCl, a polymeric stabilizing and matrix-forming and a solubilizer (I/P/S).",
                                "The results carried out in FaSSIF and FeSSIF, respectively, indicate that the stable, amorphous hybrid nanoparticles of the invention provide a similar increase in solubility. One issue with PKI formulation is the food effect. Several of the PKIs are labeled for administration in fasted state despite the fact that food in most cases increases their bioavailability. Low bioavailability might partly explain the digestive problems that are associated with the PKIs. The similar dissolution rate in FaSSIF and FeSSIF indicates that the stable, amorphous hybrid nanoparticles of the invention (e.g. experiments 56/57) may reduce food effect and patient digestive problems by its solubility improvement that allows reducing dosage. Thus stable, amorphous hybrid nanoparticles of the invention may be given in conjunction with food intake."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce nilotinib base or nilotinib HCl as protein kinase inhibitor",
                                "describe experiments in FaSSIF and FeSSIF solutions",
                                "present results in tables",
                                "show solubility increase with stable, amorphous hybrid nanoparticles",
                                "highlight improvements with polymeric stabilizing and matrix-forming components",
                                "highlight improvements with separate solubilizer added",
                                "discuss food effect and potential benefits"
                            ],
                            "num_characters": 3801,
                            "outline_medium": [
                                "describe experiments with nilotinib base or nilotinib HCl",
                                "present results in FaSSIF and FeSSIF solutions",
                                "conclude solubility increase with stable, amorphous hybrid nanoparticles"
                            ],
                            "outline_short": [
                                "present solubility results of nilotinib HCl in FaSSIF and FeSSIF solutions"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**Solubility at pH 6.5 and pH 5**",
                                "A number of experiments were carried out, wherein erlotinib HCl represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 5, 30 and 90 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Further, experiments were carried out in an alternative solution at about pH 5, namely FeSSIF (Fed State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 7 and 8, where Table 7 provides data of concentration of erlotinib HCl (mg/L) after 5, 30 and 90 minutes dissolution, whereas Table 8 provides data of % solubilized erlotinib HCl after 30 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 90 minutes dissolution and the AUC increase of stable, amorphous hybrid nanoparticles, compared to erlotinib HCl in raw, crystalline form added to the solution (experiments 58-68). In Tables 9 and 10, there is provided dissolution data in FeSSIF solution, presented similarly as Table 7 and 8 (experiments 69-73). In Table 11, data from a comparative experiment with similar stable, amorphous hybrid nanoparticles, carried out in FaSSIF and FeSSIF, respectively (experiments 74-83). Table 12 presents further comparative data for experiments carried out in FaSSIF and FeSSIF, respectively.",
                                "**Conclusions Example 2**",
                                "The experiments show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles with erlotinib HCl and a polymeric stabilizing and matrix-forming component. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component hydroxypropyl methylcellulose acetate succinate (HPMC-AS). Experiments 65-66 and 72 show that a further solubility increase is obtained with stable, amorphous hybrid nanoparticles with erlotinib HCl and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added. Particular improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus) and d-α-tocopherol acid polyethylene glycol 1000 succinate (TPGS). This improvement was not observed when the solubilizer was incorporated into the stable, amorphous hybrid nanoparticles.",
                                "Physical mixes of erlotinib HCl with a solubilizer and/or HPMC AS improve also the solubility in FaSSIF (experiments 59, 60-61, 62-63) but not in FeSSIF (experiment 69-72). One issue with PKI formulation is the food effect. Several of the PKIs are labeled for administration in fasted state despite the fact that food in most cases increases their bioavailability. Low bioavailability might partly explain the digestive problems that are associated with the PKIs. The data indicates that the stable, amorphous hybrid nanoparticles may reduce food effect and patient digestive problems by its equal solubility improvement in both FaSSIF and FeSSIF (experiment 76/77 and 82/83) that moreover potentially may allow reducing of dosage. Thus, compositions comprising these stable, amorphous hybrid nanoparticles may be given in conjunction with food intake."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce erlotinib HCl as protein kinase inhibitor",
                                "describe experiments in FaSSIF and FeSSIF solutions",
                                "present results in tables",
                                "show solubility increase with stable, amorphous hybrid nanoparticles",
                                "highlight improvements with polymeric stabilizing and matrix-forming components",
                                "discuss food effect and potential benefits"
                            ],
                            "num_characters": 3400,
                            "outline_medium": [
                                "describe experiments with erlotinib HCl",
                                "present results in FaSSIF and FeSSIF solutions",
                                "conclude solubility increase with stable, amorphous hybrid nanoparticles"
                            ],
                            "outline_short": [
                                "present solubility results of erlotinib HCl in FaSSIF and FeSSIF solutions"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Solubility at pH 6.5 and pH 5**",
                                "A number of experiments were carried out, wherein pazopanib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 5, 30 and 90 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Further, experiments were carried out in an alternative solution at about pH 5, namely FeSSIF (Fed State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 13 and 14, where Table 13 provides data of concentration of pazopanib (mg/L) after 5, 30 and 90 minutes dissolution, whereas Table 14 provides data of % solubilized pazopanib after 30 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 90 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles, compared to pazopanib in raw, crystalline form added to the solution (experiments 84-93). In Tables 15 and 16, there is provided dissolution data in FeSSIF solution, presented similarly as Table 13 and 14 (experiments 94-101). In Table 17, data from a comparative experiment with similar stable, amorphous hybrid nanoparticles, carried out in FaSSIF and FeSSIF, respectively (experiments 102-109). Table 18 presents further comparative data for experiments carried out in FaSSIF and FeSSIF, respectively, with stable, amorphous hybrid nanoparticles.",
                                "**Conclusions Example 3**",
                                "The experiments show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles with pazopanib and a polymeric stabilizing and matrix-forming component. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component polyvinylpyrrolidone K-90 (PVP 90K). Experiments 91-92 show that a further solubility increase is obtained with stable, amorphous hybrid nanoparticles with pazopanib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added. Particular improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus) and d-α-tocopherol acid polyethylene glycol 1000 succinate (TPGS). This improvement was not observed when the solubilizer was incorporated into the stable, amorphous hybrid nanoparticles of the invention.",
                                "The results carried out in FaSSIF and FeSSIF, respectively, indicates that the stable, amorphous hybrid nanoparticles of the invention provide a similar increase in solubility. One issue with PKI formulation is the food effect. Several of the PKIs are labeled for administration in fasted state despite the fact that food in most cases increases their bioavailability. Low bioavailability might partly explain the digestive problems that are associated with the PKIs. The similar dissolution rate in FaSSIF and FeSSIF indicates that the stable, amorphous hybrid nanoparticles may reduce food effect and patient digestive problems by its equal solubility improvement in both FaSSIF and FeSSIF (experiments 89/100 and 104/105) that moreover allows reducing dosage. Thus stable, amorphous hybrid nanoparticles of the invention may be given in conjunction with food intake."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce pazopanib as protein kinase inhibitor",
                                "describe experiments in FaSSIF and FeSSIF solutions",
                                "present results in tables",
                                "show solubility increase with stable, amorphous hybrid nanoparticles",
                                "highlight improvements with polymeric stabilizing and matrix-forming components",
                                "discuss food effect and potential benefits"
                            ],
                            "num_characters": 3438,
                            "outline_medium": [
                                "describe experiments with pazopanib",
                                "present results in FaSSIF and FeSSIF solutions",
                                "conclude solubility increase with stable, amorphous hybrid nanoparticles"
                            ],
                            "outline_short": [
                                "present solubility results of pazopanib in FaSSIF and FeSSIF solutions"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein lapatinib base or lapatinib ditosylate salt represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 5, 30 and 90 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 19 and 20, where Table 19 provides data of concentration of lapatinib (mg/L) after 5, 30 and 90 minutes dissolution, whereas Table 20 provides data of % solubilized lapatinib after 30 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 90 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated lapatinib ditosylate salt added to the solution (experiments 110-126).",
                                "**Conclusions Example 4**",
                                "The experiments 122-125 clearly shows that a solubility increase is obtained with stable, amorphous hybrid nanoparticles of the invention, with lapatinib, in particular lapatinib base and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component hydroxypropyl cellulose EF and hydroxypropyl cellulose LF. Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus) and d-α-tocopherol acid polyethylene glycol 1000 succinate (TPGS)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce lapatinib base or lapatinib ditosylate salt as protein kinase inhibitor",
                                "describe experiments in FaSSIF solution",
                                "present results in tables and discuss conclusions"
                            ],
                            "num_characters": 1778,
                            "outline_medium": [
                                "describe experiments with lapatinib base or lapatinib ditosylate salt"
                            ],
                            "outline_short": [
                                "present solubility results of lapatinib in FaSSIF solution"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Solubility at pH 1.4**",
                                "A number of experiments were carried out, wherein nilotinib HCl represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 5, 30 and 90 minutes dissolution in a solution at about pH 1.4, namely SGF (Simulated Gastric Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in SGF solution are provided below in Table 21, which provides percentage of solubilized nilotinib HCl from both a physical mix with nilotinib HCl in raw, crystalline form and stable, amorphous hybrid nanoparticles of the invention after 5, 30 and 90 minutes dissolution. Nilotinib present in the physical mix of nilotinib HCl raw with the polymeric stabilizing and matrix-forming component PVAP and the solubilizer Soluplus (Exp. 129) is dissolved completely within 5 minutes in SGF while nilotinib is only partially dissolved after 90 min in SGF with stable, amorphous hybrid nanoparticles of the invention, wherein the components are comprised as stable, amorphous hybrid nanoparticles, with the addition of a solubilizer (Exp. 128) or without the addition of a solubilizer (Exp. 127).",
                                "**Conclusions Example 5**",
                                "The experiments 127-129 shows that a nilotinib HCl, in stable, amorphous hybrid nanoparticles of the invention (exp 127 and 128) are partially solubilized at pH 1.4. The stable, amorphous hybrid nanoparticles with a polymeric stabilizing and matrix-forming component such as PVAP is partially protected from the acidic environment."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce nilotinib HCl as protein kinase inhibitor",
                                "describe experiments in SGF solution",
                                "present results in tables and discuss conclusions"
                            ],
                            "num_characters": 1615,
                            "outline_medium": [
                                "describe experiments with nilotinib HCl in SGF solution"
                            ],
                            "outline_short": [
                                "present solubility results of nilotinib HCl in SGF solution"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein gefitinib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 22 and 23, where Table 22 provides data of concentration of gefitinib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 23 provides data of % solubilized gefitinib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated gefitinib added to the solution (experiments 131-137).",
                                "The experiments 131-137 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with gefitinib, in particular gefitinib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component polyvinylpyrrolidone K-30 (PVP 30K) and hydroxy propyl methyl cellulose phthalate (HPMCP HP55). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce gefitinib as protein kinase inhibitor",
                                "describe experiments in FaSSIF solution",
                                "present results in tables and discuss conclusions"
                            ],
                            "num_characters": 1668,
                            "outline_medium": [
                                "describe experiments with gefitinib"
                            ],
                            "outline_short": [
                                "present solubility results of gefitinib in FaSSIF solution"
                            ]
                        },
                        {
                            "title": "Example 7",
                            "paragraphs": [
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein dasatinib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 24 and 25, where Table 24 provides data of concentration of dasatinib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 25 provides data of % solubilized dasatinib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated dasatinib added to the solution (experiments 138-141).",
                                "Experiments 138-141 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with dasatinib, in particular dasatinib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component copolyvidone (Kollidon VA64). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce dasatinib as protein kinase inhibitor",
                                "describe experiments in FaSSIF solution",
                                "present results in tables and discuss conclusions"
                            ],
                            "num_characters": 1598,
                            "outline_medium": [
                                "describe experiments with dasatinib"
                            ],
                            "outline_short": [
                                "present solubility results of dasatinib in FaSSIF solution"
                            ]
                        },
                        {
                            "title": "Example 8",
                            "paragraphs": [
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein sorafenib tosylate represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 26 and 27, where Table 26 provides data of concentration of sorafenib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 27 provides data of % solubilized sorafenib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase of compositions, compared to non-formulated sorafenib tosylate added to the solution (experiments 142-145).",
                                "Experiments 138-141 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with dasatinib, in particular dasatinib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component hydroxy propyl methyl cellulose phthalate (HPMCP HP55). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus).",
                                "**Example 9**",
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein nilotinib base represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above.",
                                "Representative results in FaSSIF solution are provided below in Table 28 and 29, where Table 28 provides data of concentration of nilotinib base (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 29 provides data of % solubilized nilotinib base after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase of compositions, compared to non-formulated nilotinib base added to the solution (experiments 146-149).",
                                "**Example 10**",
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein crizotinib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above. Representative results in FaSSIF solution are provided below in Table 30 and 31, where Table 30 provides data of concentration of crizotinib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 31 provides data of % solubilized crizotinib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated crizotinib added to the solution (experiments 150-156).",
                                "Experiments 150-156 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with crizotinib, in particular crizotinib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component polyvinylpyrrolidone K-30 (PVP 30K) and copolyvidone (Kollidon VA64). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus) and PEG-40 hydrogenated castor oil (Cremophor RH40).",
                                "**Example 11**",
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein axitinib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above. Representative results in FaSSIF solution are provided below in Table 32 and 33, where Table 32 provides data of concentration of axitinib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 33 provides data of % solubilized axitinib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated axitinib added to the solution (experiments 157-163).",
                                "Experiments 157-163 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with axitinib, in particular axitinib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component copolyvidone (Kollidon VA64) and hydroxypropyl methylcellulose acetate succinate (HPMC AS). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus).",
                                "**Example 12**",
                                "**Solubility at pH 6.5**",
                                "A number of experiments were carried out, wherein vemurafenib represented the PKI. The experiments were carried out by measuring concentration of PKI (mg/L) after 3, 40 and 80 minutes dissolution in a solution at about pH 6.5, namely FaSSIF (Fasted State Simulated Intestinal Fluid). Samples of the solution were taken at various time intervals and the amount of PKI was measured by the dissolution measurement assay described above",
                                "Representative results in FaSSIF solution are provided below in Table 34 and 35, where Table 34 provides data of concentration of vemurafenib (mg/L) after 3, 40 and 80 minutes dissolution, whereas Table 35 provides data of % solubilized vemurafenib after 40 minutes dissolution, the Area Under the Curve (AUC-mg/min/L) during 80 minutes dissolution and the AUC increase with stable, amorphous hybrid nanoparticles of the invention, compared to non-formulated vemurafenib added to the solution (experiments 164-170).",
                                "Experiments 164-170 show that a solubility increase is obtained with compositions comprising stable, amorphous hybrid nanoparticles of the invention, with vemurafenib, in particular vemurafenib and a polymeric stabilizing and matrix-forming component, wherein a separate solubilizer is added to the composition. Particular improvements are achieved with the polymeric stabilizing and matrix-forming component copolyvidone (Kollidon VA64) and cellulose acetate phthalate (CAP). Further, improvements are achieved by the addition of a separate solubilizer added, wherein said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer (Soluplus).",
                                "**Example 13**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention**",
                                "Dissolution measurement in sink conditions of compositions of the invention were measured in a method consisting of adding the wished amount of powder into a flow through cell system (SOTAX, Allschwill, Switzerland), mounting the cell onto its apparatus and then pumping the appropriate medium (typically FaSSIF, FeSSIF, SGF) through the powder. The temperature of the apparatus was set to 37° C. The amount of powder added into the cell depends on drug load of the powder: The exact amount of powder was calculated from results obtained from drug load analysis of the powders.",
                                "Typically, 3.5 to 7 mg PKI was added into the flow through cell and a flow rate between 8 and 16 ml medium/min (preferably about 8 ml medium/min) was pumped through the powder. One ml samples of the medium passing through the cell were collected at predetermined times. These samples were analyzed by HPLC (e.g. C18 column Eclipse, 4.6 mm×15 cm, 1 ml/min, detection 254-400 nm). Samples were taken after 0, 0.5, 1, 1.5, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 25, 30, 35 and 40 min from the moment the medium comes out from the flow through cell. The accumulated % solubilized of the amount of active substance added into the flow through cell was calculated and plotted against time (min). The initial slope (“initial dissolution rate”) of the graph was estimated, as measured during 0 to 10 minutes, and taken as the dissolution rate of the material in sink condition at 37° C. in the given dissolution medium.",
                                "Each experiment comprises a comparison between the PKI in raw form with compositions comprising stable, amorphous hybrid particles of the invention with the inhibitor and a representative polymeric stabilizing and matrix-forming component.",
                                "**Example 13.1**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention, Comprising Nilotinib HCl**",
                                "In experiments with nilotinib HCl, 4 mg was weighed in the flow through cell (experiment 500) and compared with stable, amorphous hybrid nanoparticles of the invention with nilotinib base and the polymeric stabilizing and matrix-forming component HPMCP HP55 (experiment 501). The results are depicted in Table 36 below.",
                                "Experiments 500-501 show that the initial dissolution rate of the stable, amorphous hybrid nanoparticles of the invention, with nilotinib base, is superior to the initial dissolution rate of nilotinib HCl in raw, crystalline form.",
                                "**Example 13.2**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Erlotinib HCl**",
                                "In experiments with erlotinib HCl, 3.5 mg was weighed in the flow through cell (experiment 510) and compared with stable, amorphous hybrid nanoparticles of the invention with erlotinib HCl and the polymeric stabilizing and matrix-forming component HPMC AS (experiment 511). The results are depicted in Table 37 below.",
                                "Experiments 510-511 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with erlotinib HCl and the polymeric stabilizing and matrix-forming component HPMC AS, is superior to the initial dissolution rate of erlotinib HCl in raw, crystalline form.",
                                "**Example 13.3**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Pazopanib HCl**",
                                "In experiments with pazopanib HCl, 3.5 mg was weighed in the flow through cell (experiment 520) and compared with stable, amorphous hybrid nanoparticles of the invention with pazopanib HCl and the polymeric stabilizing and matrix-forming component PVP90K (experiment 521). The results are depicted in Table 38 below.",
                                "Experiments 520-521 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with pazopanib HCl and the polymeric stabilizing and matrix-forming component PVP90K, is superior to the initial dissolution rate of pazopanib HCl in raw, crystalline form.",
                                "**Example 13.4**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Lapatinib Ditosylate**",
                                "In experiments with lapatinib ditosylate, 4 mg was weighed in the flow through cell (experiment 530) and compared with stable, amorphous hybrid nanoparticles of the invention with lapatinib base and the polymeric stabilizing and matrix-forming component HPC If (experiment 531). The results are depicted in Table 39 below.",
                                "Experiments 530-531 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with lapatinib base and the polymeric stabilizing and matrix-forming component HPC If, is superior to the initial dissolution rate of lapatinib ditosylate in raw, crystalline form.",
                                "**Example 13.5**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Gefitinib**",
                                "In experiments with gefitinib, 3.5 mg was weighed in the flow through cell (experiment 540) and compared with stable, amorphous hybrid nanoparticles of the invention with gefitinib and the polymeric stabilizing and matrix-forming component HPMCP HP55 (experiment 541). The results are depicted in Table 40 below.",
                                "Experiments 540-541 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with gefitinib and the polymeric stabilizing and matrix-forming component HPMCP HP55, is superior to the initial dissolution rate of the gefinib in raw, crystalline form.",
                                "**Example 13.6**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Dasatinib**",
                                "In experiments with dasatinib, 3.5 mg was weighed in the flow through cell (experiment 550) and compared with stable, amorphous hybrid nanoparticles of the invention with dasatinib and the polymeric stabilizing and matrix-forming component copolyvidon-Kollidon VA64 (experiment 551). The results are depicted in Table 41 below.",
                                "Experiments 550-551 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid of the invention, with dasatinib and the polymeric stabilizing and matrix-forming component copolyvidon (Kollidon VA64), is superior to the initial dissolution rate of the dasatinib raw, crystalline form.",
                                "**Example 13.7**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions the Invention Comprising Sorafenib Tosylate**",
                                "In experiments with sorafenib tosylate, 3.5 mg was weighed in the flow through cell (experiment 560) and compared with stable, amorphous hybrid nanoparticles of the invention with sorafenib tosylate and the polymeric stabilizing and matrix-forming component HPMCP HP55 (experiment 561). The results are depicted in Table 42 below.",
                                "Experiments 560-561 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with sorafenib tosylate and the polymeric stabilizing and matrix-forming component HPMCP HP55, is superior to the initial dissolution rate of sorafenib tosylate in raw, crystalline form.",
                                "**Example 13.8**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Crizotinib**",
                                "In experiments with crizotinib, 3.5 mg was weighed in the flow through cell (experiment 570) and compared with stable, amorphous hybrid nanoparticles of the invention with crizotinib and the polymeric stabilizing and matrix-forming component PVP 30K (experiment 571). The results are depicted in Table 43 below.",
                                "Experiments 570-571 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with crizotinib and the polymeric stabilizing and matrix-forming component PVP 30K, is superior to the initial dissolution rate of crizotinib in raw, crystalline form.",
                                "**Example 13.9**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Axitinib**",
                                "In experiments with axitinib, 3.5 mg was weighed in the flow through cell (experiment 580) and compared with stable, amorphous hybrid nanoparticles of the invention with axitinib and the polymeric stabilizing and matrix-forming component Kollidon VA64 (experiment 581) or HPMC AS (experiment 582). The results are depicted in Table 44 below.",
                                "Experiments 580-582 show that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with axitinib and the polymeric stabilizing and matrix-forming component Kollidon VA64 or HPMC AS, is superior to the initial dissolution rate of axitinib in raw, crystalline form.",
                                "**Example 13.10**",
                                "**Dissolution Rate Measurement in Sink Conditions of Compositions of the Invention Comprising Vemurafenib**",
                                "In experiments with vemurafenib, 3.5 mg was weighed in the flow through cell (experiment 590) and compared with stable, amorphous hybrid nanoparticles of the invention with vemurafenib and the polymeric stabilizing and matrix-forming component Kollidon VA64 (experiment 591) or CAP (experiment 592). The results are depicted in Table 45 below.",
                                "Experiments 590-592 clearly shows that the initial dissolution rate of the compositions comprising stable, amorphous hybrid nanoparticles of the invention, with vemurafenib and the polymeric stabilizing and matrix-forming component Kollidon VA64 or CAP, is superior to the initial dissolution rate of vemurafenib in raw, crystalline form.",
                                "**Example 14**",
                                "**In Vivo Measurement of Plasma Levels after Oral Administration of Compositions of the Invention**",
                                "Groups of four beagle dogs received single oral doses (5 mg/kg) of capsule compositions comprising stable, amorphous hybrid nanoparticles of the invention with nilotinib base and either of the polymeric stabilizing and matrix-forming components PVAP or HPMCP HP55, optionally with addition of the solubilizer polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer, and compared with a marketed formulation comprising nilotinib HCl. The stable, amorphous hybrid nanoparticles tested are as set out in experiments 146-149, in Example 9. The stomach contents of the dogs were either neutralized with a sodium bicarbonate solution 5 min prior to capsule dosing or acidified with an HCl-KCl buffer 10 min prior to dose. One group of dogs also received a single iv dose (1 mg/kg) of nilotinib. Plasma levels of nilotinib were determined with a selective LC-MS/MS method. There were no side-effects observed in any animal studied.",
                                "**Results and Conclusions**",
                                "Mean±SEM plasma concentration-time profiles of nilotinib base are shown in FIGS. 22-25, and pharmacokinetic parameters and results are displayed in Tables 46A and 46B.",
                                "Outliers were calculated and excluded based on if one value is a significant outlier from the rest at 95% confidence intervals (alpha=5%) according to Grubb's test. The critical Z value for the Grubb's test at the 95% confidence interval with n=4 is 1.48. Z=(Mean-Questionable value)/SD",
                                "Values are given as Mean±SD, except for T ½ of the Marketed nilotinib formulation given too acid stomach where only two values were obtained.",
                                "Intravenous (IV) data were obtained by constant rate IV infusion of 1 mg/kg, of a solution of Nilotinib at 0.2 mg/mL, in a 10% HPβCD, pH adjustment to pH 3.3 to 3.5. Co: 511±46 ng/mL; T ½:3.3±1.8 hr; AUC0-24 hr: 1000±300 ng*hr/mL",
                                "**Values are Given as Mean±SD**",
                                "Intravenous (IV) data were obtained by constant rate IV infusion of 1 mg/kg, of a solution of Nilotinib at 0.2 mg/mL, in a 10% HPβCD, pH adjustment to pH 3.3 to 3.5. Co: 511±46 ng/mL; T ½:3.3±1.8 hr; AUC0-24 hr: 1000±300 ng*hr/mL.",
                                "The marketed nilotinib formulation administrated to an acidified stomach showed plasma levels about 2 times higher than those after the same formulation administered to a neutralized stomach. Both formulations comprising stable, amorphous hybrid nanoparticles of the invention with nilotinib base with PVAP and HPMCP HP55 as polymeric stabilizing and matrix-forming components showed significant improvements in plasma exposure, with plasma levels about 2-fold higher than those of the marketed formulation given to an acidified stomach. In addition, combining stable, amorphous hybrid nanoparticles produced by the methods of the invention could give a plasma exposure that is be more or less independent of stomach pH.",
                                "Further improvements in oral availability were observed when formulations with stable, amorphous hybrid nanoparticles of the invention were combined with the solubilizer polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer. Thus, compositions of the invention with nilotinib base with PVAP and HPMCP HP55 as polymeric stabilizing and matrix-forming components, where the solubilizer polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer was added and administered to an acidified stomach resulted in plasma levels 2.3- to 3.1-fold higher than those of the marketed formulation. In this study, high oral bioavailability was achieved with stable, amorphous hybrid nanoparticles of the invention with nilotinib base with HPMCP HP55 as polymeric stabilizing and matrix-forming components, where the solubilizer polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer was added (I/P+S) and administrated to neutralized stomach contents. In this case the exposure increased about 7-fold over that of the marketed oral formulation administered under the same neutralized conditions. Highest bioavalability, 36±24%, in this study was achieved when stable, amorphous hybrid nanoparticles of the invention with nilotinib base with PVAP as polymeric stabilizing and matrix-forming component was administered to a neutralized stomach. However, this study leg was also accompanied with the highest standard deviation in the study.",
                                "There was an improvement in the in vivo performance of the compositions of the present invention with of nilotinib stable, amorphous hybrid nanoparticles, that are based on improving absorption and bioavailability by optimization of the solid state properties of the dosage form. The results of the in vivo study in dogs may predict similar absorption properties of stable, amorphous hybrid nanoparticles of the invention, in patients, as there appears to be a close correlation in dog-human gastrointestinal drug absorption processes (Persson, E. M. et al. Pharm. Res. 2005, 22, 2141-2151). The stable, amorphous hybrid nanoparticles of the invention, with advantageous absorption properties, also predict that the oral doses used in clinical practice today may be lowered. Furthermore, the stable, amorphous hybrid nanoparticles of the invention may cause less pH-dependency in the absorption and bioavailability of PKIs.",
                                "**Example 15**",
                                "**Measurement of Degree/Level of Stability of Compositions with Hybrid Nanoparticles of the Invention**",
                                "In stability tests of compositions comprising hybrid nanoparticles of the invention, it was shown that particles were stable over at least 11 months at room temperature (18-25° C.), as measured by X-Ray powder diffraction and dissolution rate by measurement of AUC.",
                                "In series of experiments with stable, amorphous hybrid nanoparticles comprising nilotinib and HPMCP HP55 produced by the methods of the invention, the resulting particles provided stable, amorphous hybrid nanoparticles at 40% drug load (I/P nilotinib base/HPMCP HP55: exp 146), as measured by XRPD as well as dissolution rate by measurement of AUC. The material showed one glass transition temperature at ca 127° C., which indicate a single amorphous phase with inherent stability. Partially crystalline batches also processed similar inherent stability. 6 months storage at room temperature (18-25° C.) of partly crystalline hybrid nanoparticles at 40% drug load, I/P nilotinib base/HPMCP HP55, did not show any signs of physical instability.",
                                "Thermalgravimetric analysis provided a mass loss of 1.7% from ambient temperature to 120° C.",
                                "Dynamic vapor absorption analysis at 25° C. gave a relative mass increase of ca 7% from 0 to 90% RH (Three cycles from 0 to 90% RH, did not induce a phase change).",
                                "The high glass transition temperature, 1.7% mass loss from ambient temperature to 120° C. and moderate hygrospopicity propose an inherent stability. This is supported by stability testing of several batches at various conditions. The longest stability point is 12 months at room temperature (18-25° C.). No batches or conditions have shown any signs of physical instability (FIG. 27).",
                                "Modulated Differential Scanning Calorimetry (mDSC)",
                                "Modulated Differential Scanning Calorimetry (mDSC) analysis was run on a TA Instruments Model Q200 (New Castle, USA), equipped with a RC90 refrigerated cooling system (Home Automation, New Orleans, USA). Samples were weighed to 7±2 mg in Tzero Low-mass aluminum pans and sealed with Tzero lids. They were then heated at a heating rate of 3° C./min from 0 to 170° C. with conventional modulation temperature amplitude of 1° C. and a modulation period of 40 seconds. Ultra-high purity nitrogen was used as purge gas at a flow rate of 50 mL/min. All data analyses were performed using TA Universal Analysis software, version 4.7A. Cell constant and temperature calibrations were conducted with the use of an indium standard prior to instrument operation. DSC results were evaluated in terms of both forward and reverse components of heat flow.",
                                "Thermogravimetry (TG) was performed on a Seiko TG/DTA 6200 and open 90 μl Pt-pans with ca 10 to 20 mg of sample and a nitrogen flow of 200 mL/min. The temperature program was ambient (20° C.) to 400° C. with a heating rate of 10° C./min. A blank was subtracted and the TG data was normalized with respect to sample size and analyzed using the Muse Standard Analysis software, version 6.1 U.",
                                "**Dynamic Vapour Sorption (DVS)**",
                                "The hygroscopicity of the samples was studied by Dynamic Vapor Sorption Gravimetry (DVS), using a DVS-1 (Surface Measurement Ltd., UK). Approximately 10 mg of the substance was weighed into a glass cup. The relative weight was recorded at 20 second interval when the target relative humidity (RH) over the sample was increased stepwise from 0% to 90%, and then similarly decreased back to 0% RH, with 10% RH per step. Each sample was run in three consecutive full cycles. The condition to proceed to the next level of RH was a weight change below or equal to 0.002% within 15 minutes, with a maximum total time per step of 24 hours. Due to slow equilibration in experiments of this type, the numbers obtained should be regarded as lower estimates of water uptake. The temperature was kept at 25° C.",
                                "**X-Ray Powder Diffraction (XRPD)**",
                                "XRD experiments were run on an X'Pert Pro diffractometer (PANanalytical, Almelo, Netherlands) set in Bragg-Brentano geometry. The diffractometer was equipped with 20 μm nickel filter and an X'Celerator RTMS detector with an active length of 2.122° 2θ. A representative sample was placed on a zero background quarts single crystal specimen support (Siltronix, Archamps, France). Experiments were run using Cu Kα radiation (45 kV and 40 mA) at ambient temperature and humidity. Scans were run in continuous mode in the range 4.5-40° 2θ using automatic divergence and anti-scatter slits with observed length of 10 mm, a common counting time of 299.72 seconds, and step size of 0.0167° 2θ. Data collection was done using the application software X'Pert Data Collector V.2.2j and instrument control software V.2.1E, while pattern analysis was done using X'Pert Data Viewer V.1.2c (all software being from PANanalytical, Almelo, Netherlands).",
                                "**Dissolution Rate by Measurement of AUC**",
                                "The stable hybrid nanoparticles described in Exp 171 & Exp172 (I/P) as set out below, were produced according to Exp 148, with nilotinib base, HPMCP HP55 and stored at room temperature for 11 months. The non-sink dissolution rate was tested at different different time points and the results are presented in Table 47 and FIG. 26. Polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer was added to enhance solubility. A comparison of the AUC over 80 minutes show clearly that the dissolution rate profile of the particles is practically unchanged after 11 months storage, e.g. the ratio between the AUC of particles produced and tested, compared to particles produced, tested and stored for 11 months is over 97%."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "conduct experiments with sorafenib tosylate",
                                "measure concentration of PKI after 3, 40, and 80 minutes dissolution",
                                "describe dissolution measurement assay",
                                "provide results in FaSSIF solution",
                                "show solubility increase with compositions",
                                "describe polymeric stabilizing and matrix-forming component",
                                "add separate solubilizer to composition",
                                "provide data of concentration of sorafenib",
                                "provide data of % solubilized sorafenib",
                                "provide data of AUC-mg/min/L during 80 minutes dissolution",
                                "provide data of AUC increase of compositions",
                                "describe experiments 138-141",
                                "show solubility increase with dasatinib",
                                "describe polymeric stabilizing and matrix-forming component HPMCP HP55",
                                "add separate solubilizer Soluplus",
                                "describe experiments 142-145",
                                "conduct experiments with nilotinib base",
                                "measure concentration of PKI after 3, 40, and 80 minutes dissolution",
                                "provide results in FaSSIF solution",
                                "show solubility increase with compositions",
                                "describe polymeric stabilizing and matrix-forming component",
                                "add separate solubilizer to composition",
                                "conduct experiments with crizotinib",
                                "measure concentration of PKI after 3, 40, and 80 minutes dissolution",
                                "provide results in FaSSIF solution",
                                "show solubility increase with compositions",
                                "introduce dissolution rate measurement",
                                "compare dasatinib with hybrid nanoparticles",
                                "show superior dissolution rate",
                                "introduce sorafenib tosylate measurement",
                                "compare sorafenib tosylate with hybrid nanoparticles",
                                "show superior dissolution rate",
                                "introduce crizotinib measurement",
                                "compare crizotinib with hybrid nanoparticles",
                                "show superior dissolution rate",
                                "introduce axitinib measurement",
                                "compare axitinib with hybrid nanoparticles",
                                "show superior dissolution rate",
                                "introduce vemurafenib measurement",
                                "compare vemurafenib with hybrid nanoparticles",
                                "show superior dissolution rate",
                                "introduce in vivo measurement",
                                "describe oral administration",
                                "describe plasma level measurement",
                                "present results",
                                "calculate outliers",
                                "present pharmacokinetic parameters",
                                "compare formulations",
                                "show improved bioavailability",
                                "introduce stability measurement",
                                "describe X-ray powder diffraction",
                                "describe thermalgravimetric analysis",
                                "describe dynamic vapor sorption",
                                "describe modulated differential scanning calorimetry",
                                "describe X-ray powder diffraction"
                            ],
                            "num_characters": 28101,
                            "outline_medium": [
                                "conduct experiments with sorafenib tosylate",
                                "measure concentration of PKI after 3, 40, and 80 minutes dissolution",
                                "provide representative results in FaSSIF solution",
                                "show solubility increase with compositions comprising stable, amorphous hybrid nanoparticles",
                                "achieve particular improvements with HPMCP HP55",
                                "achieve further improvements with Soluplus",
                                "conduct experiments with nilotinib base",
                                "measure concentration of PKI after 3, 40, and 80 minutes dissolution",
                                "provide representative results in FaSSIF solution",
                                "show solubility increase with compositions comprising stable, amorphous hybrid nanoparticles",
                                "achieve particular improvements with PVP 30K and Kollidon VA64",
                                "achieve further improvements with Soluplus and Cremophor RH40",
                                "conduct experiments with crizotinib, axitinib, vemurafenib, and other PKIs",
                                "introduce dissolution rate measurement",
                                "compare dasatinib raw form with hybrid nanoparticles",
                                "compare sorafenib tosylate raw form with hybrid nanoparticles",
                                "compare crizotinib raw form with hybrid nanoparticles",
                                "compare axitinib raw form with hybrid nanoparticles",
                                "compare vemurafenib raw form with hybrid nanoparticles",
                                "describe in vivo measurement of plasma levels",
                                "present results and conclusions of in vivo study",
                                "describe measurement of degree of stability of compositions",
                                "present results of stability tests",
                                "describe modulated differential scanning calorimetry",
                                "describe thermogravimetry",
                                "describe dynamic vapor sorption",
                                "describe X-ray powder diffraction and dissolution rate measurement"
                            ],
                            "outline_short": [
                                "conduct experiments with sorafenib tosylate",
                                "measure concentration of PKI after dissolution",
                                "provide results in FaSSIF solution",
                                "show solubility increase with compositions",
                                "achieve improvements with HPMCP HP55 and Soluplus",
                                "compare to non-formulated sorafenib tosylate",
                                "present dissolution rate measurements",
                                "compare dissolution rates of compositions with different components",
                                "describe in vivo measurement of plasma levels",
                                "present results and conclusions of in vivo study",
                                "measure stability of compositions with hybrid nanoparticles",
                                "describe methods for measuring stability",
                                "present results of stability tests"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce compositions comprising stable, amorphous hybrid nanoparticles",
                        "describe production method of stable, amorphous hybrid nanoparticles",
                        "describe dissolution measurement assay",
                        "provide examples of experiments with different protein kinase inhibitors",
                        "present results of experiments in tables",
                        "draw conclusions from experiments"
                    ],
                    "num_characters": 3139,
                    "outline_medium": [
                        "introduce compositions comprising stable, amorphous hybrid nanoparticles",
                        "describe production method of stable, amorphous hybrid nanoparticles",
                        "outline dissolution measurement assay"
                    ],
                    "outline_short": [
                        "describe compositions of stable, amorphous hybrid nanoparticles"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A pharmaceutical composition comprising stable, amorphous hybrid nanoparticles of at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component; which composition optionally further comprises at least one pharmaceutically acceptable solubilizer.",
        "2. The composition of claim 1, which composition further comprises at least one pharmaceutically acceptable solubilizer.",
        "3. The composition of claim 1, wherein said solubilizer is present separated from the hybrid nanoparticles in the composition.",
        "4. The composition according to claim 1, wherein said solubilizer is distributed to the surface of the hybrid nanoparticles.",
        "5. The composition according to claim 1, wherein said composition provides an increased dissolution rate, compared to the dissolution rate of said protein kinase inhibitor in raw, crystalline form.",
        "6. The composition of claim 5, wherein said dissolution rate is measured by a flow through cell system.",
        "7. The composition of claim 5, wherein said dissolution rate is measured within the initial 0 to 10 minutes of dissolution.",
        "8. The composition according to claim 5, wherein said increased dissolution rate is measured in a solution as dissolution rate ratio of said hybrid nanoparticles comprising said protein kinase inhibitor; and said protein kinase inhibitor in raw, crystalline form.",
        "9. The composition of claim 8, wherein said ratio is from about 1.5:1 to about 500:1, such as from about 10:1 to about 30:1.",
        "10. The composition according to claim 5, wherein said dissolution rate is measured in a solution with intestinal pH, such as FaSSIF or FeSSIF.",
        "11. The composition according to claim 5, wherein said dissolution rate is measured in a solution with gastric pH, such as SGF.",
        "12. The composition according to claim 1, which provides a solubility increase of inhibitor in a solution, said increase measured as the area under the curve (AUC) during about from 40 minutes to about 90 minutes, in said solution as compared with the AUC of inhibitor in raw, crystalline form.",
        "13. The composition of claim 12, wherein said increase is from about 2:1 to about 10 000:1, wherein 1 represents AUC of inhibitor in raw, crystalline form.",
        "14. The composition according to claim 12, wherein said increase is measured in a solution with intestinal pH, such as FaSSIF or FeSSIF.",
        "15. The composition of claim 12, wherein said increase is measured in a solution with gastric pH, such as SGF.",
        "16. The composition according to claim 1, wherein said stable, amorphous hybrid nanoparticles are characterized by providing an amorphous powder X-ray diffraction pattern.",
        "17. The composition according to claim 1, wherein the dissolution rate of said stable, amorphous hybrid nanoparticles remain stable to at least about 90%, after 9 months of storage or more, at room temperature.",
        "18. The composition according to claim 1, wherein said polymeric stabilizing and matrix-forming component is selected from methyl cellulose, hydroxyethyl cellulose, hydroxypropyl cellulose, hydroxypropyl methylcellulose, hydroxypropyl methylcellulose acetate succinate, hydroxypropyl methylcellulose phthalate, polyvinylpyrrolidone, polyvinyl acetate phthalate, copolyvidone, crospovidon, methacrylic acid and ethylacrylate copolymer, methacrylate acid and methyl methacrylate copolymer, polyethylene glycol, DL lactide/glycolide copolymer, poly DL-lactide, cellulose acetate phthalate, carbomer homopolymer Type A, carbomer homopolymer Type B, aminoalkyl methacrylate copolymers and poloxamers.",
        "19. The composition according to claim 1, wherein said polymeric stabilizing and matrix-forming component is selected from hydroxypropyl methylcellulose phthalate, hydroxypropyl cellulose, copolyvidon, hydroxypropyl methylcellulose acetate succinate, polyvinyl acetate phthalate, cellulose acetate phthalate and polyvinylpyrrolidone.",
        "20. The composition according to claim 1, wherein said solubilizer is selected from polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer, d-α-tocopherol acid polyethylene glycol 1000 succinate and a hydrogenated castor oil, such as PEG-40 hydrogenated castor oil or PEG-35 hydrogenated castor oil.",
        "21. The composition according to claim 1, wherein, said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "22. The composition according to claim 1, wherein said inhibitor is a tyrosine kinase inhibitor selected from the group consisting of lapatinib, pazopanib, nilotinib, erlotinib, dasatinib, gefitinib, sorafenib axitinib, crizotinib and vemurafenib; or salts or hydrates or solvates thereof, or combinations thereof.",
        "23. The composition according to claim 1, wherein said inhibitor is nilotinib; and said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate or polyvinyl acetate phthalate.",
        "24. The composition according to claim 1, wherein said inhibitor is nilotinib; said polymeric stabilizing and matrix-forming component is hydroxy propyl methyl cellulose phthalate or polyvinyl acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
        "25. The composition according to claim 1, wherein said inhibitor is erlotinib, and said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose acetate succinate.",
        "26. The composition according to claim 1, wherein said inhibitor is erlotinib; said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose acetate succinate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
        "27. The composition according to claim 1, wherein said inhibitor is pazopanib; and said polymeric stabilizing and matrix-forming component is polyvinylpyrrolidone.",
        "28. The composition according to claim 1, wherein said inhibitor is pazopanib; said polymeric stabilizing and matrix-forming component is polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
        "29. The composition according to claim 1, wherein said inhibitor is lapatinib; and said polymeric stabilizing and matrix-forming component is hydroxypropyl cellulose.",
        "30. The composition according to claim 1, wherein said inhibitor is lapatinib; said polymeric stabilizing and matrix-forming component is hydroxypropyl cellulose; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or d-α-tocopherol acid polyethylene glycol 1000 succinate.",
        "31. The composition according to claim 1, wherein said inhibitor is gefitinib; and said polymeric stabilizing and matrix-forming component is hydroxy propyl methylcellulose phthalate or polyvinyl acetate phthalate or polyvinylpyrrolidone.",
        "32. The composition according to claim 1, wherein said inhibitor is gefitinib; said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate or polyvinyl acetate phthalate or polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "33. The composition according to claim 1, wherein said inhibitor is dasatinib; and said polymeric stabilizing and matrix-forming component is copolyvidone.",
        "34. The composition according to claim 1, wherein said inhibitor is dasatinib; said polymeric stabilizing and matrix-forming component is copolyvidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "35. The composition according to claim 1, wherein said inhibitor is sorafenib; and said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate.",
        "36. The composition according to claim 1, wherein said inhibitor is sorafenib; said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "37. The composition according to claim 1, wherein said inhibitor is nilotinib base; and said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate or polyvinyl acetate phthalate.",
        "38. The composition according to claim 1, wherein said inhibitor is nilotinib base; said polymeric stabilizing and matrix-forming component is hydroxypropyl methylcellulose phthalate or polyvinyl acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "39. The composition according to claim 1, wherein said inhibitor is axitinib; and said polymeric stabilizing and matrix-forming component is copolyvidone or hydroxypropyl methylcellulose acetate succinate.",
        "40. The composition according to claim 1, wherein said inhibitor is axitinib; said polymeric stabilizing and matrix-forming component is copolyvidone or hydroxypropyl methylcellulose acetate succinate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer.",
        "41. The composition according to claim 1, wherein said inhibitor is crizotinib; and said polymeric stabilizing and matrix-forming component is copolyvidone or polyvinylpyrrolidone.",
        "42. The composition according to claim 1, wherein said inhibitor is crizotinib; said polymeric stabilizing and matrix-forming component is copolyvidone or polyvinylpyrrolidone; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol copolymer or PEG-40 hydrogenated castor oil.",
        "43. The composition according to claim 1, wherein said inhibitor is vemurafenib; and said polymeric stabilizing and matrix-forming component is copolyvidone or cellulose acetate phthalate.",
        "44. The composition according to claim 1, wherein said inhibitor is vemurafenib; said polymeric stabilizing and matrix-forming component is copolyvidone or cellulose acetate phthalate; and said solubilizer is polyvinyl caprolactam-polyvinyl acetate-polyethylene glycol.",
        "45. The composition according to claim 1, wherein said stable, amorphous hybrid nanoparticles has an average particle diameter size of less than about 1000 nm.",
        "46. The composition of claim 45, wherein said particle diameter size is less than about 500 nm, preferably less than 250 nm.",
        "47. The composition according to claim 1, wherein said protein kinase inhibitor is partially released from the composition, at a pH of from about 1 to about 2, preferably at about pH 1.4.",
        "48. A composition according to claim 1, for use in therapy.",
        "49. A composition according to claim 1, for use in the treatment of proliferative disorders.",
        "50. The composition for use, according to claim 49, wherein said proliferative disorder is selected from tumours and cancers.",
        "51. The composition for use, according to claim 49, wherein said proliferative disorder is selected from neurofibromatosis, tuberous sclerosis, hemangiomas and lymphangiogenesis, cervical, anal and oral cancers, eye or ocular cancer, stomach cancer, colon cancer, bladder cancer, rectal cancer, liver cancer, pancreas cancer, lung cancer, breast cancer, cervix uteri cancer, corpus uteri cancer, ovary cancer, prostate cancer, testis cancer, renal cancer, brain cancer, cancer of the central nervous system, head and neck cancer, throat cancer, skin melanoma, acute lymphocytic leukemia, acute myelogenous leukemia, Ewing's Sarcoma, Kaposi's Sarcoma, basal cell carcinoma and squamous cell carcinoma, small cell lung cancer, choriocarcinoma, rhabdomyosarcoma, angiosarcoma, hemangioendothelioma, Wilms Tumor, neuroblastoma, mouth/pharynx cancer, esophageal cancer, larynx cancer, lymphoma, multiple myeloma; cardiac hypertrophy, age-related macular degeneration and diabetic retinopathy.",
        "52. The composition for use, according to claim 49, wherein said composition is provided during food intake.",
        "53. A method of treating proliferative disorder in a patient in need thereof, comprising administering a therapeutically effective amount of a composition according to claim 1.",
        "54. The method of claim 53, wherein said proliferative disorder is selected from tumours and cancers.",
        "55. The method of claim 53, wherein said proliferative disorder is selected from neurofibromatosis, tuberous sclerosis, hemangiomas and lymphangiogenesis, cervical, anal and oral cancers, eye or ocular cancer, stomach cancer, colon cancer, bladder cancer, rectal cancer, liver cancer, pancreas cancer, lung cancer, breast cancer, cervix uteri cancer, corpus uteri cancer, ovary cancer, prostate cancer, testis cancer, renal cancer, brain cancer, cancer of the central nervous system, head and neck cancer, throat cancer, skin melanoma, acute lymphocytic leukemia, acute myelogenous leukemia, Ewing's Sarcoma, Kaposi's Sarcoma, basal cell carcinoma and squamous cell carcinoma, small cell lung cancer, choriocarcinoma, rhabdomyosarcoma, angiosarcoma, hemangioendothelioma, Wilms Tumor, neuroblastoma, mouth/pharynx cancer, esophageal cancer, larynx cancer, lymphoma, multiple myeloma; cardiac hypertrophy, age-related macular degeneration and diabetic retinopathy.",
        "56. The method of claim 54, wherein said composition is provided during food intake.",
        "57. Stable, amorphous hybrid nanoparticles, comprising at least one protein kinase inhibitor and at least one polymeric stabilizing and matrix-forming component, as defined in claim 1."
    ]
}