{
    "id": "US20070292847",
    "authors": [
        "Thomas Seebeck",
        "Andrea Johner",
        "Yasmin Shakur"
    ],
    "title": "Cyclic Nucleotide-Specific Phosphodiesterases from Leishmania and Uses Thereof",
    "date": "2004-09-03 00:00:00",
    "abstract": "The present invention relates to novel amino acid and nucleic acid sequences of cyclic nucleotide-specific phosphodiesterases from the parasite Leishmania major. The invention also relates to nucleic acid constructs, vectors, and host cells comprising the nucleic acid sequences as well as methods for producing and using the amino acid and nucleic acid sequences. The invention further relates to the use of these sequences, and of antibodies directed against these sequences, in the diagnosis and treatment of disorders related to the infection of Leishmania major, including the identification of compounds that form complexes with the polypeptides and nucleic acids of the present invention.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "We claim priority to U.S. Provisional Application Nos. 60/500,244 (filed Sep. 5, 2003), 60/504,070 (filed Sep. 19, 2003), and 60/582,584 (filed Jun. 25, 2004), which are incorporated herein by reference."
            ],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to novel amino acid and nucleic acid sequences of cyclic nucleotide-specific phosphodiesterases from a parasite in the Leishmania family, such as Leishmania major. The invention also relates to nucleic acid constructs, vectors, and host cells comprising the nucleic acid sequences as well as methods for producing and using the amino acid and nucleic acid sequences. The invention further relates to the use of these sequences, and of antibodies directed against these sequences, in the diagnosis and treatment of disorders related to the infection of Leishmania, such as Leishmania major, including the identification of compounds that form complexes with the polypeptides and nucleic acids of the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to novel amino acid and nucleic acid sequences of cyclic nucleotide-specific phosphodiesterases"
                    ],
                    "num_characters": 747,
                    "outline_medium": [
                        "relate to novel amino acid and nucleic acid sequences of cyclic nucleotide-specific phosphodiesterases"
                    ],
                    "outline_short": [
                        "relate to novel amino acid and nucleic acid sequences of cyclic nucleotide-specific phosphodiesterases"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Leishmania major is one of several Leishmania parasites that, when introduced into a host organism, is the causative agent of leishmaniasis. Leishmania major is a species of the Leishmania tropica complex. Other complexes (comprising species and subspecies) include Leishmania donovani, Leishmania mexicana, and Leishmania viannia. According to the World Health Organization, leishmaniasis is among the most infectious diseases worldwide and is endemic in 88 countries in Africa, Asia, Europe, and in North and South America. It has been estimated that over 12 million people suffer from Leishmanial infections worldwide, where serious public health problems exist particularly in countries such as Iran, Iraq, Afghanistan, Algeria, Brazil, India, Peru, and Syria. Leishmaniasis most commonly manifests itself as either cutaneous (i.e. skin) leishmaniasis (CL) or visceral (i.e. internal organs) leishmaniasis (VL). CL is the most common form of leishmaniasis and is the result of transmission of the parasite Leishmania major via the bite of an infected female phlebotomine sandfly. Symptoms of CL include large skin legions or ulcers on exposed parts of the body, which cause serious disability and permanent scarring.",
                        "Methods of treating leishmaniasis have typically been limited to administering pentavalent antimony (SbV) (Sundar et al. (2002) Curr. Opin. Infec. Dis. 15, 593-598). Due to the recent emergence of large-scale resistance to SbV, however, the effectiveness of this treatment is becoming increasingly limited. Furthermore, SbV treatment has several side effects including nausea, vomiting, diarrhea, and convulsions. In addition, HIV co-infection with Leishmania species presents further challenges since such co-infection can dramatically alter the epidemiology, diagnosis, and response of leishmaniasis to therapy (Lee et al. (2003) Int. J. Infect. Dis. 7, 86-93)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Leishmania major and leishmaniasis",
                        "describe current treatments and limitations",
                        "highlight need for new treatments"
                    ],
                    "num_characters": 1885,
                    "outline_medium": [
                        "describe Leishmania major and leishmaniasis"
                    ],
                    "outline_short": [
                        "describe Leishmania major and leishmaniasis"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The invention provides novel Leishmania cyclic nucleotide-specific phosphodiesterase (LmPDE) polypeptides and nucleic acid molecules thereof that are useful in the diagnosis and treatment of leishmaniasis. The polypeptides of the present invention also include antibodies that recognize and bind to LmPDE polypeptides. The nucleic acid molecules of the invention also include peptide nucleic acids (PNA), and antisense molecules that react with the nucleic acid molecules of the invention.",
                        "In one embodiment, the invention provides full-length, novel phosphodiesterases (PDEs) from the parasite Leishmania major, designated LmPDE-A, LmPDE-B1, and LmPDE-B2, including the polypeptide molecules, corresponding nucleic acid molecules, and fragments thereof.",
                        "The present invention also encompasses various nucleotide and amino acid sequences that represent different forms and fragments of the LmPDE genes, transcripts, and proteins, such as conservatively mutated proteins, different allelic forms, polymorphic forms, alternative precursor transcripts and mature transcripts. Additionally, recombinant nucleic acid molecules that are codon usage variants of the novel LmPDE sequences are provided. The invention encompasses LmPDE from Leishmania major, as well as other Leishmania species and subspecies of the complexes Leishmania tropica, Leishmania donovani, Leishmania mexicana, and Leishmania viannia.",
                        "The present invention further provides recombinant nucleic acid molecules that encode wild type or mutant sequences of LmPDE polypeptides that maintain PDE biological activity. These include naturally-occurring and synthetic mutants, as well as semi-synthetic and recombinant polypeptides.",
                        "The present invention also includes the polynucleotides encoding LmPDEs in recombinant expression vectors and host-vector systems that include the expression vectors. One embodiment provides various host cells transformed with recombinant vectors that include the LmPDE nucleotide sequences of the invention. The invention also provides genetically modified organisms comprising a vector containing a recombinant LmPDE sequence wherein at least one endogenous LmPDE gene has been disabled.",
                        "The present invention further provides methods for using substantially purified LmPDE polypeptides to identify compounds that modulate the expression or activity of LmPDEs.",
                        "The present invention also provides methods for using LmPDE nucleotide sequences as nucleic acid probes and primers, and for using LmPDE polypeptides as antigens for the production of novel anti-LmPDE antibodies. The LmPDE probes and primers, and the anti-LmPDE antibodies are useful in diagnostic assays and kits for the detection of naturally occurring LmPDE nucleotide and protein sequences present in biological samples.",
                        "Additional objects and advantages of the invention will be set forth in part in the description which follows, and in part will be obvious from the description, or may be learned by practice of the invention. The objects and advantages of the invention will be realized and attained by means of the elements and combinations particularly pointed out in the appended claims. Moreover, advantages described in the body of the specification, if not included in the claims, are not per se limitations to the claimed invention.",
                        "The publications discussed herein are provided solely for their disclosure prior to the filing date of the present application. Nothing herein is to be construed as an admission that the present invention is not entitled to antedate such publication by virtue of prior invention. Further, the dates of publication provided may be different from the actual publication dates which may need to be independently confirmed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "provide novel Leishmania cyclic nucleotide-specific phosphodiesterase polypeptides and nucleic acid molecules",
                        "describe antibodies that recognize and bind to LmPDE polypeptides",
                        "provide full-length, novel phosphodiesterases from Leishmania major",
                        "describe conservatively mutated proteins, different allelic forms, and polymorphic forms",
                        "provide recombinant nucleic acid molecules that are codon usage variants",
                        "describe recombinant nucleic acid molecules that encode wild type or mutant sequences",
                        "provide methods for using LmPDE polypeptides and nucleic acid molecules"
                    ],
                    "num_characters": 3732,
                    "outline_medium": [
                        "provide novel Leishmania cyclic nucleotide-specific phosphodiesterase polypeptides and nucleic acid molecules",
                        "include antibodies that recognize and bind to LmPDE polypeptides",
                        "encompass various nucleotide and amino acid sequences"
                    ],
                    "outline_short": [
                        "provide novel Leishmania cyclic nucleotide-specific phosphodiesterase polypeptides and nucleic acid molecules"
                    ]
                },
                {
                    "title": "BRIEF DESCRIPTION OF THE DRAWINGS",
                    "paragraphs": [
                        "FIG. 1 shows the deduced amino acid sequence of a full-length LmPDE-A polypeptide (SEQ ID NO: 1).",
                        "FIGS. 2A-2S show the DNA sequence (SEQ ID NO: 2) for the full-length gene of LmPDE-A. The open reading frame begins with adenine at position 530 and ends with guanine at position 2425.",
                        "FIGS. 3A-3B show the deduced amino acid sequence of a full-length LmPDE-B1 polypeptide (SEQ ID NO: 3).",
                        "FIGS. 4A-4L show the DNA sequence (SEQ ID NO: 4) for the full-length gene of LmPDE-B1. The open reading frame begins with adenine at position 1267 and ends with adenine at position 4059.",
                        "FIGS. 5A-B show the deduced amino acid sequence of a full-length LmPDE-B2 polypeptide (SEQ ID NO: 5).",
                        "FIGS. 6A-6L show the DNA sequence (SEQ ID NO: 6) for the full-length gene of LmPDE-B2. The open reading frame begins with adenine at position 2182 and ends with adenine at position 5004.",
                        "FIGS. 7A, 7B, and 7C show the location of conserved domains that are found in the LmPDE-A, LmPDE-B1, and LmPDE-B2 polypeptide sequences, respectively.",
                        "FIG. 8 shows the results of a Southern blot analysis for LmPDE-B1 using a conserved region of the LmPDE-B1 sequence as the hybridization probe.",
                        "FIG. 9 shows the results of a Southern blot analysis for LmPDE-B2 using a conserved region of the LmPDE-B2 sequence as the hybridization probe.",
                        "FIG. 10 shows the results of a Southern blot analysis using a conserved region that was specific to both LmPDE-B1 and LmPDE-B2 as the hybridization probe.",
                        "FIG. 11 shows a schematic drawing of the location of the LmPDE-B1 and LmPDE-B2 loci and their approximate relative locations on chromosome 15.",
                        "FIGS. 12A, 12B, 12C, and 12D show the heat-shock test results of PDE-deficient Saccharomyces cerevisiae cells that have been transfected with LmPDE-B1 and LmPDE-A.",
                        "FIGS. 13A, 13B, and 13C show the Michaelis-Menten kinetics of recombinant LmPDE-B1-mediated hydrolysis of cAMP. FIGS. 13A and 13B show the hydrolysis of cAMP in the absence and presence of a 100-fold excess of cGMP, respectively. FIG. 13C shows the effect of a 50-fold excess of AMP. The figure insets depict the corresponding Eadie-Hofstee plots.",
                        "FIGS. 14A and 14B show the effect of various PDE inhibitors on LmPDE-B1 and LmPDE-B2, respectively, in the presence of 1 μM cAMP and 100 μM of cilostamide (A), zaprinast (B), etazolate (C), dipyridamole (D), Ro-20-1724 (E), rolipram (F), isobutylmethylxanthine (IBMX) (G), 8-methoxymethyl-IBMX (H), trequinsin (I), papaverine (K), milrinone (L), petoxifylline (M), and erythro-9-(2-hydroxy-3-nonyl)adenine (EHNA) (N).",
                        "FIGS. 14C and 14D show representative dose-response profiles of trequinsin against LmPDE-B1 and LmPDE-B2, respectively.",
                        "FIG. 15 shows the inhibition of L. major promastigote proliferation in the presence of increasing concentrations of dipyridamole (A), etazolate (B), and trequinsin (C)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe FIG. 1, deduced amino acid sequence of LmPDE-A",
                        "describe FIGS. 2A-2S, DNA sequence of LmPDE-A",
                        "describe FIGS. 3A-3B, deduced amino acid sequence of LmPDE-B1",
                        "describe FIGS. 4A-4L, DNA sequence of LmPDE-B1",
                        "describe additional figures, including Southern blot analysis and heat-shock test results"
                    ],
                    "num_characters": 2832,
                    "outline_medium": [
                        "show deduced amino acid sequences of LmPDE-A, LmPDE-B1, and LmPDE-B2 polypeptides",
                        "show DNA sequences for full-length genes of LmPDE-A, LmPDE-B1, and LmPDE-B2"
                    ],
                    "outline_short": [
                        "describe figures showing deduced amino acid sequences and DNA sequences of LmPDE-A, LmPDE-B1, and LmPDE"
                    ]
                },
                {
                    "title": "DEFINITIONS",
                    "paragraphs": [
                        "The term “amino acid sequence” refers to amino acids encoding an oligopeptide, peptide, polypeptide, or protein sequence, and fragments thereof, and includes naturally occurring or synthetic molecules.",
                        "The term “antibody” refers to intact molecules as well as fragments thereof (e.g., Fab), which can bind an antigenic determinant on an antigen (e.g., an antigenic determinant(s) on a LmPDE). The antibody can be “polyclonal”, “monoclonal”, “chimeric”, “humanized”, or human.",
                        "The term “antigenic determinant” refers to that fragment of a molecule (i.e., an epitope) that induces an antibody and which thereafter makes contact with a particular antibody. When a protein or fragment of a protein is used to immunize a host animal, numerous regions of the protein may induce the production of antibodies which bind specifically to a given region or three-dimensional structure on the protein; these regions or structures are referred to as antigenic determinants. An antigenic determinant may compete with the intact antigen (i.e., the immunogen used to elicit the immune response) for binding to an antibody.",
                        "The term “antisense” refers to any composition containing nucleotide sequences which are complementary to a specific DNA or RNA sequence.",
                        "The term “antisense strand” is used in reference to a nucleic acid strand that is complementary to the “sense” strand. Antisense molecules include nucleic acids (that can include modified nucleotide base and modified sugar moieties) and may be produced by any method including synthesis or transcription. Once introduced into a cell, the complementary nucleotides combine with natural sequences produced by the cell to form duplexes and block either transcription or translation of the sequences.",
                        "The term “biological sample” is used in its broadest sense. A biological sample is suspected of containing LmPDE nucleic acid molecules, or fragments thereof, or a LmPDE polypeptide. The suitable biological sample can be from an animal or a human. The sample can be a cell sample or a tissue sample, including samples from spleen, lymph node, thymus, bone marrow, liver, heart, testis, brain, placenta, lung, skeletal muscle, kidney, and pancreas. The sample can be a biological fluid, including urine, blood sera, blood plasma, phlegm, or lavage fluid. Alternatively, the sample can be a swab from the nose, ear, or throat.",
                        "The term “biologically active” refers to a polypeptide having structural, regulatory, or biochemical functions of a naturally occurring molecule. Likewise, “immunologically active” refers to the capability of the natural, recombinant, or synthetic LmPDEs of the invention, or any fragment thereof, to induce a specific immune response in appropriate animals or cells and to bind with specific antibodies. For example, the polypeptides of the invention can elicit antibodies that specifically bind an epitope associated with a LmPDE polypeptide of the invention. Accordingly, a LmPDE polypeptide is capable of inducing a specific immune response in appropriate animals or cells, and/or binding with ligands such as specific antibodies.",
                        "The term “catalytic domain” refers to a conserved subset of amino acids within a PDE sequence that is responsible for catalyzing the hydrolysis reaction of the bound substrate.",
                        "The term “chimeric antibody” refers to an antibody in which the variable regions derived from one species are combined with the constant regions of an antibody derived from a different species. Chimeric antibodies are useful, as they are less likely to be antigenic to a human subject than antibodies with non-human constant regions and variable regions. The antigen combining region (variable region) of a chimeric antibody can be derived from a non-human source (e.g. murine) and the constant region of the chimeric antibody, which confers biological effector function to the immunoglobulin, can be derived from a human source (Morrison et al. (1985) Proc. Natl. Acad. Sci. U.S.A. 81, 6851; Takeda et al. (1985) Nature 314, 452; Cabilly et al., U.S. Pat. No. 4,816,567; Boss et al;, U.S. Pat. No. 4,816,397). The chimeric antibody may have the antigen binding specificity of the nonhuman antibody molecule and the effector function conferred by the human antibody molecule.",
                        "The term “complementary” refers to nucleic acid molecules having purine and pyrimidine nucleotides which have the capacity to associate through hydrogen bonding to form double stranded nucleic acid molecules. The following base pairs are related by complementarity: guanine and cytosine; adenine and thymine; and adenine and uracil. The term “complementary” applies to all base pairs comprising two single-stranded nucleic acid molecules, or to all base pairs comprising a single-stranded nucleic acid molecule folded upon itself. Complementarity between two single-stranded molecules may be partial, in which only some of the nucleic acids bind, or it may be complete when total complementarity exists between the single stranded molecules. The degree of complementarity between nucleic acid strands has significant effects on the efficiency and strength of hybridization between nucleic acid strands.",
                        "The term “control cell” is a cell that is generally the same, e.g., genotypically and phenotypically, as the cell to which it is being compared (e.g., the cells can be sister cells), but which is not exposed to a test compound.",
                        "The term “expression control sequence” or “expression control element” refers to a regulatory polynucleotide sequence that can direct the transcription and translation of an open reading frame. Expression control elements are known in the art and include, but are not limited to, inducible promoters, constitutive promoters, splice donor and acceptor sites, secretion signals, enhancers, transcription terminators, and other transcriptional regulatory elements. Other expression control elements that are involved in translation are known in the art, and include the Shine-Dalgarno sequence, and initiation and termination codons.",
                        "The term “fragment” of a LmPDE polypeptide refers to a portion of a LmPDE polypeptide. For example, a LmPDE fragment can be a polypeptide with fewer amino acids than a full-length LmPDE, but having the biological activity of a full-length LmPDE-A, LmPDE-B1, or LmPDE-B2 polypeptide, e.g., the ability to hydrolyze cAMP. A fragment can also be a portion of a LmPDE polypeptide that elicits an immune response, or that possesses any other biological or diagnostic property of the full-length LmPDEs of the invention.",
                        "The term “fragment” of a LmPDE nucleic acid molecule refers to a portion of a full-length LmPDE nucleotide sequence. For example, such a nucleic acid fragment can encode a LmPDE polypeptide fragment that maintains the biological activity of a full-length LmPDE-A, LmPDE-B1, or LmPDE-B2 polypeptide, e.g., the ability to hydrolyze cAMP (as determined by methods known in the art, e.g., Schilling et al. (1994) Anal. Biochem. 216, 154-158).",
                        "The term “GAF domain” refers to a highly conserved domain that binds small molecular weight ligands. The GAF domain in some PDEs is known to bind cGMP.",
                        "The term “humanized antibody” refers to an antibody molecule in which amino acids have been replaced in the non-antigen binding regions in order to more closely resemble a human antibody, while still retaining the original binding ability. As used herein, a humanized LmPDE antibody is an immunoglobulin molecule that is capable of binding to a LmPDE polypeptide and has variable regions with substantially the same amino acid sequence as a human immunoglobulin, and has a hyper-variable region with substantially the same amino acid sequence as a non-human immunoglobulin.",
                        "The term “hybridization” or “hybridize” refers to any process by which a sequence of nucleic acids binds with a complementary strand through base pairing.",
                        "The term “hydrolyze” refers to a chemical reaction wherein a chemical bond is cleaved via a water molecule. The catalytic function of LmPDEs of the invention, as with all PDEs, involves the hydrolysis of cAMP (as determined by methods known in the art, e.g., Schilling et al. (1994) Anal. Biochem. 216, 154-158).",
                        "As used herein, a first amino acid or nucleotide sequence is said to be “identical” to a second reference amino acid or nucleotide sequence, respectively, when a comparison of the first and the second sequences are exactly alike. Two sequences are said to be “X % identical” when a comparison of the first and second sequences have X % of nucleotides or amino acids that are exactly alike. Percent identity can be determined electronically, e.g., by using the MEGALIGN program (DNASTAR) which creates alignments between two or more sequences according to methods selected by the user, e.g., the clustal method (e.g., Higgins et al. (1988) Gene 73:237-244). Percent identity between sequences can also be counted or calculated by other methods known in the art (e.g., Hein (1990) Methods Enzymol. 183:626-645). Identity between sequences can also be determined by other methods known in the art, e.g., by varying hybridization conditions.",
                        "The term “incubate” refers to a process of contacting a cell or a cell culture with the compound of interest, or otherwise introducing the compound of interest into a cell.",
                        "The term “inhibitor” refers to an agent which, when bound to a LmPDE, or to some other polypeptide or nucleic acid, decreases the amount (expression) or the biological activity of a LmPDE. Inhibitors may include proteins, nucleic acids, carbohydrates, antibodies or any other molecules which decrease the amount (expression) or biological activity of LmPDEs present in a sample. The preferred inhibitor will selectively inhibit the biological activity of a LmPDE, while not affecting any other cellular proteins.",
                        "The term “isolated” or “purified” refers to a specific nucleic acid, protein, or polypeptide, or a fragment thereof, in which contaminants (i.e., substances that differ from the specific nucleic acid, protein, or polypeptide molecule) have been separated or substantially separated from the specific nucleic acid, protein, or polypeptide.",
                        "The term “LmPDE” means any of LmPDE-A, LmPDE-B1, or LmPDE-B2, and can refer to the polypeptide or nucleic acid sequences. LmPDE polypeptides can be natural, synthetic, semi-synthetic, or recombinant. LmPDE includes polypeptides from Leishmania major, as well as other Leishmania species and subspecies from the complexes Leishmania fropica, Leishmania donovani, Leishmania mexicana, and Leishmania viannia including Leishmania aethiopica, Leishmania brasiliensis, Leishmania d. donovani, Leishmania d. infantum, Leishmania d. chagasi, Leishmania garnhami, Leishmania m. mexicana, Leishmania m. amazonensis, and Leishmania pifanoi.",
                        "The term “LmPDE-A nucleic acid molecule” refers to a nucleic acid molecule that encodes a LmPDE-A polypeptide.",
                        "The term “LmPDE-B1 nucleic acid molecule” refers to a nucleic acid molecule that encodes a LmPDE-B1 polypeptide.",
                        "The term “LmPDE-B2 nucleic acid molecule” refers to a nucleic acid molecule that encodes a LmPDE-B2 polypeptide.",
                        "The term “LmPDE expression” refers to the process whereby a RNA transcript or translated polypeptide is produced from a LmPDE nucleotide sequence.",
                        "The term “modulates” refers to a change in the activity of the LmPDEs of the present invention. For example, modulation may cause an increase or a decrease in protein amount (expression) or activity, binding characteristics, or any other biological, functional or immunological properties of the LmPDEs of the invention.",
                        "The term “nucleic acid sequence” or “nucleic acid molecule” refers to an oligonucleotide, nucleotide, or polynucleotide, and fragments thereof; to DNA or RNA of genomic or synthetic origin, which may be single- or double-stranded; and represents the sense or antisense strand.",
                        "The term “operably linked” refers to functionally related nucleic acid sequences. For example, a promoter is operably linked with a coding sequence if the promoter controls the translation of the encoded polypeptide. While operably linked nucleic acid sequences can be contiguous and in the same reading frame, certain genetic elements, e.g., repressor genes, are not contiguously linked to the sequence encoding the polypeptide but still bind to operator sequences that control expression of the polypeptide.",
                        "The term “PDEase domain” refers to the conserved catalytic domain of PDEs.",
                        "The term “stringent conditions” refers to conditions which permit hybridization between complementary polynucleotide sequences. Suitably-stringent conditions can be defined by, for example, the concentrations of salt and/or formamide in the pre-hybridization and hybridization solutions, or by the hybridization temperature, which are well known in the art. In particular, stringency can be increased by reducing the concentration of salt, increasing the concentration of formamide, or raising the hybridization temperature.",
                        "The term “substantially purified” refers to nucleic acid or polypeptide sequences that are removed from their natural environment and are isolated or separated, and are at least 60% free, 65% free, 70% free, 75% free, 80% free, 85% free, 90% free, 95% free, 96% free, 97% free, 98% free, or 99% free from other components with which they are naturally associated.",
                        "The term “variants and mutants” refers to changes in a polypeptide or nucleic acid sequence such as amino acid or nucleotide substitutions, insertions, deletions, conservative amino acid changes, polymorphic changes, allelic changes, frame shift changes, truncations, or the like, wherein the variant or mutant protein maintains its native function (here, at least the hydrolysis of cAMP) and wherein the variant or mutant nucleic acid molecule encodes a protein that maintains its native function.",
                        "The term “vector” includes, but is not limited to, plasmids, cosmids, and phagemids."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define amino acid sequence",
                        "define antibody",
                        "define antigenic determinant",
                        "define antisense",
                        "define antisense strand",
                        "define biological sample",
                        "define biologically active",
                        "define catalytic domain",
                        "define chimeric antibody",
                        "define complementary",
                        "define control cell",
                        "define expression control sequence",
                        "define fragment of LmPDE polypeptide",
                        "define fragment of LmPDE nucleic acid molecule",
                        "define GAF domain",
                        "define humanized antibody",
                        "define hybridization",
                        "define hydrolyze",
                        "define identical",
                        "define incubate",
                        "define inhibitor",
                        "define isolated or purified",
                        "define LmPDE",
                        "define LmPDE-A nucleic acid molecule",
                        "define LmPDE-B1 nucleic acid molecule",
                        "define LmPDE-B2 nucleic acid molecule",
                        "define modulates"
                    ],
                    "num_characters": 13932,
                    "outline_medium": [
                        "define amino acid sequence",
                        "define antibody",
                        "define antigenic determinant",
                        "define antisense",
                        "define biological sample",
                        "define biologically active",
                        "define catalytic domain",
                        "define chimeric antibody",
                        "define complementary",
                        "define control cell",
                        "define expression control sequence",
                        "define fragment",
                        "define humanized antibody"
                    ],
                    "outline_short": [
                        "define amino acid sequence",
                        "define antibody",
                        "define antisense",
                        "define biological sample",
                        "define biologically active",
                        "define catalytic domain"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "Second messengers such as cyclic adenosine mono-phosphate (cAMP) and cyclic guanosine mono-phosphate (cGMP) play important biological roles in modulating the effects of a wide variety of first messengers. For example, cAMP and cGMP are involved in the propagation of a variety of extracellular signals that originate from first messengers such as hormones, light, and neurotransmitters. The steady state intracellular levels of cAMP and cGMP are controlled by their rates of synthesis by cyclases and by their rate of degradation by cyclic nucleotide-specific phosphodiesterases (PDEs).",
                        "PDEs are typically composed of a catalytic domain (approximately 270 amino acids), an N-terminal regulatory domain responsible for binding cofactors, and, in some cases, a C-terminal domain of unknown function. A conserved motif, HDXXHXGXXN, has been found in the catalytic domain of all PDEs. Several families of PDEs have been identified (Beavo (1995) Physiol. Rev. 75, 725-748; Soderling et al. (1998) J. Biol. Chem. 273, 15553-15558; and Fisher et al. (1998) J. Biol. Chem. 273, 15559-15564). PDE families display roughly 35% amino acid sequence identity within their catalytic domain. Isozymes within the same family typically display 75-95% sequence identity in this region. Within a family, there is often greater than 60% sequence identity outside the catalytic domain, whereas across different PDE families, there is little or no sequence similarity.",
                        "In eukaryotes, two distinct classes of PDEs have been identified. Class I enzymes all show significant amino acid sequence conservation within their catalytic domains. Class I PDEs include all currently known families of mammalian PDEs as well as several PDEs from lower eukaryotes such as PDE2 from Saccharomyces cerevisiae and the regA gene product from Dictyostelium discoideum. Class II PDEs, however, share very little amino acid sequence identity with class I PDEs, and thus likely have a different evolutionary origin. Furthermore, class II PDEs are often distinguished by their generally higher KM values (Zoraghi et al. (2001) J. Biol. Chem. 276, 11559-11566). Class II PDEs have been identified in yeast (Nikawa et al. (1987) Mol. Cell. Biol. 7, 3629-3636), the slime mold Dictyostelium discoideum (Lacombe et al. (1986) J. Biol. Chem. 261, 16811-16817), Vibrio fisheri (Dunlap et al. (1993) J. Bacteriol. 175, 4615-4624), and Candida albicans (Hoyer et al. (1994) Microbiology 140, 1533-1542).",
                        "A variety of diseases are thought to result from decreased levels of cyclic nucleotides due to increased PDE activity. Accordingly, PDEs have become highly attractive drug targets over the last several years. A growing number of family-specific and subtype-specific PDE inhibitors are being developed as therapeutic agents for a wide range of-diseases such as autoimmune disease (Bielekova et al. (2000) J. Immunol. 164, 1117-1124), arthritis (Kiely et al. (1995) Eur. J. Immunol. 25, 2899-2906), asthma (Barnette (1999) Prog. Drug Res. 53, 193-229), inflammatory diseases (Barnes (2001) Novartis Found. Symp. 234, 255-267) impotency (Langtry et al. (1999) Drugs 57, 967-989) and cancer (Marko et al. (2000) Chem. Res. Toxicol. 10, 944-948). So far, there is limited information about PDEs in kinetoplastids such as Leishmania major."
                    ],
                    "subsections": [
                        {
                            "title": "Polypeptides of the Invention",
                            "paragraphs": [
                                "One aspect of the present invention is directed to novel, isolated PDE polypeptides from the parasite Leishmania major, designated LmPDE-A (SEQ ID NO: 1), LmPDE-B1 (SEQ ID NO: 3), and LmPDE-B2 (SEQ ID NO: 5). Particular embodiments of the LmPDE polypeptides of the invention include full-length LmPDE-A, LmPDE-B1, and LmPDE-B2 from Leishmania major. In another aspect, the invention relates to fragments of LmPDEs. The invention also provides polypeptides comprising biologically and/or immunologically active fragments of LmPDEs.",
                                "The present invention also relates to variants and mutants of LmPDEs. Mutant alleles of LmPDEs encode mutant forms of LmPDE polypeptides having at least one amino acid substitution, insertion, deletion, truncation, or frame shift. Such mutant forms of polypeptides may not exhibit the same biological activity as wild-type proteins (e.g., they may have less PDE activity or an activity not normally found in LmPDE polypeptides, such as, for example, not functioning as a PDE).",
                                "Another variant of LmPDE polypeptides may have amino acid sequences that differ by one or more amino acid substitutions. The variant may have conservative amino acid changes, where a substituted amino acid has similar structural or chemical properties. Amino acid residues that can be conservatively substituted for one another include, but are not limited to: glycine/alanine; valine/isoleucine/leucine; asparagine/glutamine; aspartic acid/glutamic acid; serine/threonine; lysine/arginine; and phenylalanine/tyrosine. Other substitutions can also be considered conservative, depending on the environment of the particular amino acid and its role in the three-dimensional structure of the protein. For example, methionine, which is relatively hydrophobic, can frequently be interchanged with leucine and isoleucine, and sometimes with valine.",
                                "Alternatively, a variant may have nonconservative amino acid changes, such as, for example, replacement of a glycine with a tryptophan, or alanine with lysine. Similar minor variations may also include amino acid deletions and insertions. Any amino acid substitution that does not significantly affect the biological and/or chemical properties of LmPDE polypeptides is encompassed by the present invention. Guidance in determining which and how many amino acid residues may be substituted, inserted and deleted may be found using computer programs well known in the art such as the DNASTAR software package.",
                                "The present invention also encompasses various amino acid sequences that represent different forms and fragments of the LmPDE polypeptides such as polypeptides with conservative mutations and fragments containing the PDEase domain. The LmPDE polypeptides may be from Leishmania major, or other Leishmania species and subspecies of the complexes Leishmania tropica, Leishmania donovani, Leishmania mexicana, and Leishmania viannia including Leishmania aethiopica, Leishmania brasiliensis, Leishmania d. donovani, Leishmania d. infantum, Leishmania d. chagasi, Leishmania garnhami, Leishmania m. mexicana, Leishmania m. amazonensis, and Leishmania pifanoi.",
                                "The LmPDEs of this invention may be embodied in many forms, such as in isolated form or in purified form. A skilled artisan can readily employ standard isolation and purification methods to obtain isolated LmPDE polypeptides (see, e.g., Marchak et al. (1996) Strategies for Protein Purification and Characterization, Cold Spring Harbor Press, Plainview, N.Y.). The nature and degree of isolation and purification will depend on the intended use. For example, purified LmPDE protein molecules will be substantially free of other proteins or molecules that impair the binding of LmPDE proteins to antibodies or other ligands. Embodiments of LmPDE polypeptides include purified LmPDE polypeptides having the biological activity of a LmPDE protein. In one form, such purified LmPDE polypeptides retain the ability to bind antibody or other ligand.",
                                "Various forms of a particular LmPDE polypeptide of the invention may be produced as a result of processes such as post-translational modifications. For example, various forms of isolated LmPDE polypeptides may include precursor forms and different mature forms of a LmPDE protein or polypeptide that result from posttranslational events, such as glycosylation, phosphorylation, and intramolecular cleavage.",
                                "The present invention provides isolated and purified polypeptides having an amino acid sequence identical to the predicted LmPDE polypeptide sequences disclosed herein. Accordingly, the amino acid sequences of the present invention may be identical to LmPDE-A (SEQ ID NO: 1), LmPDE-B1 (SEQ ID NO: 3) or LmPDE-B2 (SEQ ID NO: 5). LmPDE polypeptides of the invention may also comprise at least one sequence that is identical to a fragment of a full-length LmPDE polypeptide sequence. The present invention also provides isolated and purified polypeptides with at least about 60%, 65%, 70%, 75%, 80%, 85%, 90%, 95%, 96%, 97%, 98%, or 99% identity to the sequences disclosed herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce LmPDE polypeptides",
                                "describe full-length LmPDE polypeptides",
                                "describe fragments of LmPDE polypeptides",
                                "introduce variants and mutants of LmPDE polypeptides",
                                "describe conservative amino acid changes",
                                "describe nonconservative amino acid changes",
                                "discuss post-translational modifications",
                                "describe isolated and purified LmPDE polypeptides",
                                "describe LmPDE polypeptides with varying degrees of identity",
                                "discuss forms and fragments of LmPDE polypeptides"
                            ],
                            "num_characters": 5049,
                            "outline_medium": [
                                "introduce LmPDE polypeptides from Leishmania major",
                                "describe full-length and fragment forms of LmPDE polypeptides",
                                "discuss variants and mutants of LmPDE polypeptides",
                                "describe post-translational modifications of LmPDE polypeptides",
                                "provide examples of isolated and purified LmPDE polypeptides"
                            ],
                            "outline_short": [
                                "introduce LmPDE polypeptides from Leishmania major",
                                "describe variants and mutants of LmPDE polypeptides"
                            ]
                        },
                        {
                            "title": "Nucleic Acid Molecules of the Invention",
                            "paragraphs": [
                                "The present invention provides LmPDE nucleic acid molecules corresponding to the full length genes of LmPDE-A (SEQ ID NO: 2), LmPDE-B1 (SEQ ID NO: 4), and LmPDE-B2 (SEQ ID NO: 6). The present invention also provides nucleic acid molecules that encode the LmPDE polypeptides discussed previously. The present invention also encompasses various nucleotide sequences that represent different forms and fragments of LmPDE genes and transcripts, such as different allelic forms, polymorphic forms, alternative precursor transcripts, and mature transcripts. Additionally, recombinant nucleic acid molecules that are codon usage variants of novel LmPDE sequences are provided.",
                                "In one embodiment, the present invention provides a nucleic acid encoding a LmPDE-A polypeptide of the present invention comprising the nucleotide sequence shown in SEQ ID NO: 2, beginning with adenine at position 530 and ending with guanine at position 2425 (which corresponds to amino acids 1-631 of SEQ ID NO: 1). Another embodiment comprises a nucleotide sequence found in SEQ ID NO: 2, beginning with thymine at position 1679 and ending with cytosine at position 2356, which corresponds to the PDEase domain of a LmPDE-A polypeptide (amino acids 384-609 of SEQ ID NO:1). Due to the degeneracy of the genetic code, the present invention also provides any nucleic acid molecule that encodes a polypeptide comprising the LmPDE-A polypeptide sequence set forth in SEQ ID NO: 1, beginning with methionine at amino acid position 1 and ending with serine at amino acid position 631. The invention also provides nucleic acids that encode fragments of a LmPDE-A, for example a nucleic acid that encodes the PDEase domain comprising amino acids 384-609 as set forth in SEQ ID NO: 1.",
                                "A specific embodiment of a nucleic acid encoding a LmPDE-B1 polypeptide of the present invention comprises the nucleotide sequence of SEQ ID NO: 4, beginning with adenine at position 1267 and ending with adenine at position 4059 (which corresponds to amino acids 1-930 of SEQ ID NO: 3). Another embodiment comprises a nucleotide sequence found in SEQ ID NO: 4, beginning with thymine at position 3205 and ending with cytosine at position 3906, which corresponds to the PDEase domain of LmPDE-B1 (amino acids 647-880 of SEQ ID NO: 3). Due to the degeneracy of the genetic code, the present invention also provides any nucleic acid molecule that encodes a polypeptide comprising the LmPDE-B1 polypeptide sequence set forth in SEQ ID NO: 3, beginning with methionine at amino acid position 1 and ending with valine at amino acid position 930. The invention also provides nucleic acids that encode fragments of a LmPDE-B1 polypeptide, for example a nucleic acid that encodes the PDEase domain comprising amino acids 647-880 as set forth in SEQ ID NO: 3.",
                                "A specific embodiment of a nucleic acid encoding a LmPDE-B2 polypeptide of the present invention comprises the nucleotide sequence of SEQ ID NO: 6, beginning with adenine at position 2182 and ending with adenine at position 5004 (which corresponds to amino acids 1-940 of SEQ ID NO: 5). Another embodiment comprises a nucleotide sequence found in SEQ ID NO: 6, beginning with thymine at position 4150 and ending with cytosine at position 4851, which corresponds to the PDEase domain of LmPDE-B2 (amino acids 657-890 of SEQ ID NO: 5). Due to the degeneracy of the genetic code, the present invention also provides any nucleic acid molecule that encodes a polypeptide comprising the LmPDE-B2 polypeptide sequence set forth in SEQ ID NO: 5, beginning with methionine at amino acid position 1 and ending with valine at amino acid position 940. The invention also provides nucleic acids that encode fragments of a LmPDE-B2 polypeptide, for example a nucleic acid that encodes the PDEase domain comprising amino acids 657-890as set forth in SEQ ID NO: 5.",
                                "One of skill in the art will appreciate that nucleic acids of the present invention can encode domains or portions of LmPDE polypeptides other than those specifically mentioned above.",
                                "The present invention contemplates alternative allelic forms of LmPDE nucleotide sequences that are isolated from different subjects of the same species. Typically, isolated allelic forms of naturally-occurring gene sequences include wild-type and mutant alleles. A wild-type LmPDE gene sequence will encode a LmPDE protein having normal PDE biological activity, such as, for example, a phosphodiesterase function. A mutant of a LmPDE gene sequence may encode a LmPDE polypeptide having an activity not normally found in LmPDE polypeptides, such as, for example, not functioning as a phosphodiesterase. Alternatively, a mutant of a LmPDE gene sequence may encode a LmPDE polypeptide having normal activity. Accordingly, the present invention provides wild-type and mutant allelic forms of LmPDE nucleotide sequences.",
                                "The present invention further contemplates polymorphic forms of LmPDE nucleotide sequences. Typically, isolated polymorphic forms of naturally-occurring gene sequences are isolated from different subjects of the same species. The polymorphic forms include sequences having one or more nucleotide substitutions that may or may not result in changes in the amino acid codon sequence. These substitutions may result in a wild-type LmPDE gene that encodes a protein having the biological activity of wild-type LmPDE proteins, or encodes a mutant polymorphic form of the LmPDE protein having a different or null activity.",
                                "The present invention further provides isolated codon-usage variants (see Table 1) that differ from the disclosed LmPDE nucleotide sequences, yet do not alter the predicted LmPDE protein sequence or biological activity. The codon-usage variants may be generated by recombinant DNA technology. Codons may be selected to optimize the level of production of the LmPDE transcript or LmPDE protein in a particular prokaryotic or eukaryotic expression host, in accordance with the frequency of codons utilized by the host cell. Alternative reasons for altering the nucleotide sequence encoding a LmPDE protein include the production of RNA transcripts having more desirable properties, such as an extended half-life or increased stability.",
                                "The present invention further provides novel purified and isolated polynucleotides (i.e. DNA sequences and fragments thereof), which can be in isolated form, including DNA and RNA transcripts (both sense and complementary antisense strands) encoding LmPDEs, DNA/RNA hybrids, and related molecules. The nucleic acid molecules of the present invention include nucleotide sequences substantially identical to or complementary to the LmPDE nucleotide sequences disclosed herein.",
                                "The invention encompasses genomic, cDNA, ribozyme, and antisense molecules, as well as nucleic acids based on alternative backbone and including alternative bases and modified sugar moieties, whether derived from natural sources or wholly or partially synthesized. As used herein, “wholly” synthesized DNA means that the DNA is produced entirely by chemical means, and “partially” synthesized means that only portions of the resulting DNA are produced by chemical synthesis. Antisense molecules can be RNAs or other molecules, including peptide nucleic acids (PNAs) or non-nucleic acid molecules such as phosphorothioate derivatives (described in greater detail below) that specifically bind DNA or RNA in a base-pair dependent manner. A skilled artisan can readily obtain these classes of nucleic acid molecules using the sequences described herein.",
                                "The present invention further provides nucleotide sequences that selectively hybridize to LmPDE nucleotide sequences under high stringency hybridization conditions. Typically, hybridization under standard high stringency conditions will occur between two complementary nucleic acid molecules that differ in sequence complementarity by about 70% to about 100%. It is readily apparent to one skilled in the art that the high stringency hybridization between nucleic acid molecules depends upon, for example, the degree of identity, the stringency of hybridization, and the length of the hybridizing strands. The methods and formulas for conducting high stringency hybridizations are well known in the art, and can be found, for example, in Sambrook, et al. (2001) Molecular Cloning: A Laboratory Manual (Cold Spring Harbor Laboratory, Cold Spring Harbor, N.Y.).",
                                "In general, stringent hybridization conditions are those that: (1) employ low ionic strength and high temperature for washing, for example, 0.015 M NaCl, 0.0015 M sodium citrate, and 0.1% SDS at 50° C.; or (2) employ a denaturing agent during hybridization such as formamide, for example, 50% (vol/vol) formamide with 0.1% bovine serum albumin, 0.1% Ficoll, 0.1% polyvinylpyrrolidone, 50 mM sodium phosphate buffer at pH 6.5 with 750 mM NaCl, and 75 mM sodium citrate at 42° C.",
                                "Another example of stringent conditions is the use of 50% formamide, 5×SSC (0.75 M NaCl, 0.075 M sodium citrate), 50 mM sodium phosphate (pH 6.8), 0.1% sodium pyrophosphate, 5×Denhardt's solution, sonicated salmon sperm DNA (50 mg/ml), 0.1% SDS, and 10% dextran sulfate at 42° C., with washes at 42° C. in 0.2×SSC and 0.1% SDS. A skilled artisan can readily determine and vary the stringency conditions appropriately to obtain a clear and detectable hybridization signal. Typical ranges of stringency conditions include: (1) low stringency (2×SSC/0.1% (w/v) SDS, room temperature), (2) moderate stringency (0.2×SSC/0.1% (w/v) SDS, 42° C.), and (3) high stringency (0.1×SSC/0.1% (w/v) SDS, 68° C.).",
                                "The present invention provides RNA molecules that encode LmPDE polypeptides. In particular, the RNA molecules of the invention may be isolated full-length or partial mRNA molecules or RNA oligomers that encode a LmPDE polypeptide.",
                                "The nucleic acid molecules of the invention also include derivative nucleic acid molecules which differ from DNA or RNA molecules, and anti-sense molecules. Derivative molecules include peptide nucleic acids (PNAs), and non-nucleic acid molecules including phosphorothioate, phosphotriester, phosphoramidate, and methylphosphonate molecules, that bind to single-stranded DNA or RNA in a base pair-dependent manner (Zamecnik et al. (1978) Proc. Natl. Acad. Sci. USA 75, 280-284; Goodchild et al. (1986) Proc. Natl. Acad. Sci. USA 83, 4143-4146).",
                                "Peptide nucleic acid molecules comprise a nucleic acid oligomer to which an amino acid residue, such as lysine, and an amino group have been added. These small molecules (also known as anti-gene agents) stop transcript elongation by binding to their complementary (template) strand of nucleic acid (Nielsen et al., (1993) Anticancer Drug Des. 8, 53-63). Reviews of methods for synthesis of DNA, RNA, and their analogues can be found in Oligonucleotides and Analogues (ed. F. Eckstein (1991) IRL Press, New York) and Oligonucleotide Synthesis (ed. M. J. Gait (1984) IRL Press, Oxford, England). Additionally, methods for antisense RNA technology are described in U.S. Pat. Nos. 5,194,428 and 5,110,802. A skilled artisan can readily obtain these classes of nucleic acid molecules using the LmPDE nucleotide sequences described herein (see, for example, Innovative and Perspectives in Solid Phase Synthesis (1992) Egholm, et al. pp. 325-328, or U.S. Pat. No. 5,539,082).",
                                "Embodiments of the LmPDE nucleic acid molecules of the invention include DNA and RNA primers, which allow the specific amplification of LmPDE sequences, or of any fragments thereof, and probes that selectively or specifically hybridize to LmPDE sequences or to any fragments thereof. As used herein, amplification refers to the production of additional copies of a nucleic acid sequence and is generally carried out using polymerase chain reaction (PCR) technologies that are well known in the art (Dieffenbach et al. (1995) PCR Primer, a Laboratory Manual, Cold Spring Harbor Press, Plainview, N.Y.). The nucleic acid probes can be labeled with a detectable marker. Examples of a detectable marker include, but are not limited to, a radioisotope, a fluorescent compound, a bioluminescent compound, a chemiluminescent compound, a metal chelator, or an enzyme. Technologies for generating labeled DNA and RNA probes are well known in the art (see, for example, Sambrook et al. (1989) in Molecular Cloning)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce LmPDE nucleic acid molecules",
                                "describe full-length LmPDE genes",
                                "describe nucleic acid molecules encoding LmPDE polypeptides",
                                "introduce alternative allelic forms",
                                "describe polymorphic forms",
                                "introduce codon-usage variants",
                                "describe isolated and purified polynucleotides",
                                "introduce genomic, cDNA, ribozyme, and antisense molecules",
                                "describe nucleic acid molecules with alternative backbones",
                                "introduce nucleic acid molecules with modified sugar moieties",
                                "describe antisense molecules",
                                "introduce peptide nucleic acids",
                                "describe phosphorothioate, phosphotriester, phosphoramidate, and methylphosphonate molecules",
                                "describe RNA molecules encoding LmPDE polypeptides",
                                "introduce derivative nucleic acid molecules",
                                "describe DNA and RNA primers",
                                "introduce probes that selectively hybridize to LmPDE sequences",
                                "describe labeled DNA and RNA probes",
                                "introduce recombinant nucleic acid molecules",
                                "describe rDNA molecules",
                                "introduce expression control sequences",
                                "describe vector sequences",
                                "discuss methods for generating rDNA molecules",
                                "describe LmPDE nucleic acid molecules with varying degrees of identity"
                            ],
                            "num_characters": 12327,
                            "outline_medium": [
                                "introduce LmPDE nucleic acid molecules",
                                "describe full-length genes of LmPDE-A, LmPDE-B1, and LmPDE-B2",
                                "provide nucleic acid molecules encoding LmPDE polypeptides",
                                "discuss allelic forms of LmPDE nucleotide sequences",
                                "describe polymorphic forms of LmPDE nucleotide sequences",
                                "introduce codon-usage variants of LmPDE nucleotide sequences",
                                "provide isolated and purified polynucleotides",
                                "describe genomic, cDNA, ribozyme, and antisense molecules",
                                "introduce nucleotide sequences that selectively hybridize to LmPDE nucleotide sequences",
                                "discuss stringent hybridization conditions",
                                "provide RNA molecules that encode LmPDE polypeptides",
                                "describe derivative nucleic acid molecules"
                            ],
                            "outline_short": [
                                "introduce LmPDE nucleic acid molecules",
                                "describe nucleic acid molecules encoding LmPDE-A, LmPDE-B1, and LmPDE-B2",
                                "provide nucleic acid molecules with at least 60% identity to LmPDE sequences",
                                "describe alternative allelic forms of LmPDE nucleotide sequences",
                                "provide polymorphic forms of LmPDE nucleotide sequences",
                                "introduce codon-usage variants of LmPDE nucleotide sequences"
                            ]
                        },
                        {
                            "title": "Recombinant Nucleic Acid Molecules Encoding LmPDEs",
                            "paragraphs": [
                                "The invention also includes recombinant nucleic acid molecules encoding LmPDE polypeptides. Such molecules may have regulatory sequences operatively linked to the LmPDE nucleotide sequences of the invention.",
                                "The present invention also encompasses recombinant nucleic acid molecules, such as recombinant DNA molecules (rDNAs) that comprise nucleotide sequences encoding LmPDE polypeptides. As used herein, a rDNA molecule is a DNA molecule that has been subjected to molecular manipulation in vitro. Methods for generating rDNA molecules are well known in the art (see, for example, Sambrook et al. (1989) Molecular Cloning, supra). In one embodiment of the present invention, the rDNA sequences that encode a LmPDE polypeptide, or fragments thereof, are operably linked to one or more expression control sequences and/or vector sequences."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce recombinant nucleic acid molecules encoding LmPDE polypeptides"
                            ],
                            "num_characters": 839,
                            "outline_medium": [
                                "introduce recombinant nucleic acid molecules encoding LmPDE polypeptides"
                            ],
                            "outline_short": [
                                "introduce recombinant nucleic acid molecules encoding LmPDE polypeptides"
                            ]
                        },
                        {
                            "title": "Vectors Comprising Novel LmPDEs",
                            "paragraphs": [
                                "The nucleic acid molecules of the present invention may be recombinant molecules, each comprising the sequence, or portion thereof, of a LmPDE nucleotide sequence linked to a non-LmPDE nucleotide sequence. For example, the LmPDE sequence may be operatively linked to a vector to generate a recombinant molecule.",
                                "One possible vector for expression is an autonomously replicating vector comprising a replicon that directs the replication of the rDNA within the appropriate host cell. Alternatively, the vector directs integration of the recombinant vector into a host cell. Various viral vectors may also be used, such as a number of well known retroviral, adenoviral, and adeno-associated viral (MV) vectors (Berkner (1988) Biotechniques 6, 616-629).",
                                "Vectors of the present invention may permit expression of a LmPDE transcript or polypeptide sequence in prokaryotic or eukaryotic host cells. Such vectors include expression vectors comprising an expression control element, described above. Vectors used for expression of the LmPDE nucleotide sequences in eukaryotic host cells can include expression control elements, such as the baculovirus polyhedrin promoter for expression in insect cells. Other possible expression control elements include promoters or enhancers derived from the genomes of plant cells (e.g., heat shock, RUBISCO, storage protein genes), viral promoters or leader sequences from plant viruses, and promoters or enhancers from the mammalian genes or from mammalian viruses.",
                                "Specific initiation signals may also be required for efficient translation of LmPDE nucleotide sequences. These signals include the ATG-initiation codon and adjacent sequences. In cases where a LmPDE initiation codon and upstream sequences are inserted into the appropriate expression vector, no additional translation control signals may be needed. However, in cases where only the coding sequence (or a portion thereof) is inserted, exogenous translational control signals including the ATG-initiation codon must be provided. Furthermore, the initiation codon must be in the correct reading frame to ensure translation of the entire insert. Exogenous translational elements and initiation codons can be of various origins, both natural and synthetic. The efficiency of expression may be enhanced by the inclusion of enhancers appropriate to the cell system in use (Scharf et al (1994) Results ProbL Cell. Differ. 20, 125-162; Bittner et al. (1987) Methods in Enzymol. 153, 516-544).",
                                "One possible vector includes at least one selectable marker gene that encodes a gene product that confers drug resistance such as resistance to ampicillin or tetracyline. The vector may also comprise multiple endonuclease restriction sites that enable convenient insertion of exogenous DNA sequences. Methods for generating a recombinant expression vector encoding a LmPDE protein of the invention are well known in the art (see, for example, Sambrook et al. (2001) Molecular Cloning, A Laboratory Manual, Cold Spring Harbor Laboratory, Cold Spring Harbor, N.Y. and Ausubel (1989) Current Protocols in Molecular Biology, John Wiley & Sons, New York N.Y.).",
                                "Vectors of the present invention for generating LmPDE transcripts and/or the encoded LmPDE polypeptides can be expression vectors that are compatible with prokaryotic host cells. Prokaryotic cell expression vectors are well known in the art and are available from several commercial sources. For example, pET vectors (e.g., pET-21, Novagen Corp.), pQE vectors (Qiagen, Chatsworth, Calif.), BLUESCRIPT phagemid (Stratagene, LaJolla, Calif.), pSPORT (Gibco BRL), or ptrp-lac hybrids may be used to express LmPDE polypeptides in bacterial host cells.",
                                "Alternatively, the expression vectors of the present invention for generating LmPDE transcripts and/or the encoded LmPDE polypeptides can be expression vectors which are compatible with eukaryotic host cells, such as vertebrate cells. Eukaryotic cell expression vectors are well known in the art and are available from several commercial sources. Such vectors can contain convenient restriction sites for insertion of the desired DNA segment. Typical of such vectors are PSVL and pKSV-10 (Pharmacia), pBPV-1/pML2d (International Biotechnologies, Inc.), pTDT1 (ATCC, #31255), and similar eukaryotic expression vectors."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define recombinant molecules",
                                "describe vector for expression",
                                "list viral vectors",
                                "describe expression control elements",
                                "discuss initiation signals",
                                "describe exogenous translational control signals",
                                "discuss enhancers",
                                "describe methods for generating recombinant expression vector"
                            ],
                            "num_characters": 4308,
                            "outline_medium": [
                                "define recombinant molecules",
                                "describe vector types for expression",
                                "outline expression control elements",
                                "discuss initiation signals for translation"
                            ],
                            "outline_short": [
                                "describe recombinant molecule structure",
                                "list various vector types and their characteristics"
                            ]
                        },
                        {
                            "title": "Host-Vector Systems Comprising LmPDEs",
                            "paragraphs": [
                                "The invention further provides a host-vector system comprising a vector, plasmid, phagemid, or cosmid comprising a LmPDE nucleotide sequence, or a fragment thereof, introduced into a suitable host cell. A variety of expression vector/host systems may be utilized to carry and express LmPDE nucleotide sequences. The host-vector system can be used to express (e.g., produce) LmPDE polypeptides encoded by LmPDE nucleotide sequences. The host cell can be either prokaryotic or eukaryotic. Examples of suitable prokaryotic host cells include bacterial strains from genera such as Escherichia, Bacillus, Pseudomonas, Streptococcus, and Streptomyces. Examples of suitable eukaryotic host cells include yeast cells, plant cells, or animal cells such as mammalian cells and insect cells. Several possible embodiments provide a host-vector system comprising the pcDNA3 vector (Invitrogen, Carlsbad, Calif.) in COS-7 mammalian cells, pGEX vector (Promega, Madison, Wis.) in bacterial cells, pLT1 vector (S. Kunz, unpublished) in Saccharomyces cerevisiae cells, or pFastBac HT baculovirus vector (Gibco/BRL) in Sf9 insect cells (ATCC, Manassas, Va.).",
                                "The introduction of the recombinant DNA molecules of the present invention into an appropriate host cell may be accomplished by well-known methods that depend on the type of vector and host system employed. For example, prokaryotic host cells are introduced (e.g., transformed) with nucleic acid molecules by electroporation or salt treatment methods (see, for example, Cohen et al. (1972) Proc Natl Acad Sci USA 69, 2110; Sambrook et al. (1989) Molecular Cloning supra). Vertebrate cells can be transformed with vectors containing recombinant DNAs by various methods, including electroporation, or cationic lipid or salt treatment (Graham et al. (1973) Virol. 52, 456; Wigler et al. (1979) Proc. Natl. Acad. Sci. USA 76, 1373-1376).",
                                "Successfully transformed cells, i.e., cells that contain a rDNA molecule of the present invention, can be identified by techniques well known in the art. For example, cells resulting from the introduction of recombinant DNA of the present invention are selected and cloned to produce single colonies. Cells from those colonies are harvested, lysed and their DNA content examined for the presence of the rDNA using a method such as that described by Southern (1975) J. Mol. Biol. 98, 503, or Berent et al. (1985) Biotech. 3, 208. The proteins produced from the cell may also be assayed via a biochemical assay or immunological method.",
                                "In bacterial systems, a number of expression vectors may be selected depending upon the use intended for the LmPDE polypeptides. For example, when large quantities of LmPDEs are needed for the induction of antibodies, vectors that direct high level expression of fusion proteins that are soluble and readily purified may be desirable. Such vectors include, but are not limited to, the multifunctional E. coli cloning and expression vectors such as BLUESCRIPT (Stratagene, San Diego, Calif.), into which a LmPDE nucleotide sequence may be ligated in-frame with sequences for the amino-terminal Met and the subsequent 7 residues of β-galactosidase so that a hybrid protein is produced; pIN vectors (Van Heeke & Schuster (1989) J. Biol. Chem. 264, 5503-5509); and the like. The pGEX vectors (Promega, Madison, Wis.) may also be used to express LmPDE polypeptides as fusion proteins with glutathione S-transferase (GST). In general, such fusion proteins are soluble and can easily be purified from lysed cells by adsorption to glutathione-agarose beads followed by elution in the presence of free glutathione. Proteins made in such systems are designed to include heparin, thrombin, or factor XA protease cleavage sites so that the cloned protein of interest can be released from the GST moiety at will.",
                                "In yeast (Saccharomyces cerevisiae) a number of vectors containing constitutive or inducible promoters such as beta-factor, alcohol oxidase and PGH may be used. For reviews, see Ausubel et al. (supra) and Grant et al. (1987) Methods in Enzymology 153, 516-544.",
                                "In cases where plant expression vectors are used, the expression of a sequence encoding a LmPDE polypeptide can be driven by several different promoters. For example, viral promoters such as the 35S and 19S promoters of CaMV (Brisson et al. (1984) Nature 310, 511-514) may be used alone or in combination with the omega leader sequence from TMV (Takamatsu et al. (1987) EMBO J. 6, 307-311). Alternatively, plant promoters such as the small subunit of RUBISCO (Coruzzi et al (1984) EMBO J. 3, 1671-1680; Broglie et al. (1984) Science 224, 838-843), or heat shock promoters (Winter et al. (1991) Results ProbL. Cell Differ. 17, 85-105) may be used. These constructs can be introduced into plant cells by direct DNA transformation or pathogen-mediated transfection. For reviews of such techniques, see Hobbs (1992) McGraw Yearbook of Science and Technology, McGraw Hill New York N.Y., pp. 191-196, or Weissbach and Weissbach (1988) Methods for Plant Molecular Biology, Academic Press, New York N.Y., pp. 421-463.",
                                "An alternative expression system that can be used to express LmPDE polypeptides is an insect system. In one such system, Autographa californica nuclear polyhedrosis virus (AcNPV) is used as a vector to express foreign genes in Spodoptera frugiperda cells or in Trichoplusia larvae (Smith et al. (1983) J. Virol. 46, 584; Engelhard et al. (1994) Proc. Nat. Acad. Sci. USA 91, 32a-4-3227). The sequence encoding a LmPDE polypeptide may be cloned into a nonessential region of the virus, such as the polyhedrin gene, and placed under control of the polyhedrin promoter. Successful insertion of a LmPDE nucleotide sequence will render the polyhedrin gene inactive and produce recombinant virus lacking coat protein. The recombinant viruses are then used to infect S. frugiperda cells or Trichoplusia larvae in which a LmPDE polypeptide is expressed.",
                                "In mammalian host cells, a number of viral-based expression systems are utilized. In cases where an adenovirus is used as an expression vector, a LmPDE nucleotide sequence is ligated into an adenovirus transcription/translation vector consisting of the late promoter and tripartite leader sequence. Insertion in a nonessential E1 or E3 region of the viral genome results in a viable virus (Logan et al. (1984) Proc Natl. Acad. Sci. USA 81, 3655-3659) capable of expressing a LmPDE protein in infected host cells. In addition, transcription enhancers, such as the rous sarcoma virus (RSV) enhancer, can be used to increase expression in mammalian host cells.",
                                "A host cell strain may also be chosen for its ability to modulate the expression of the inserted LmPDE nucleotide sequences or to process the expressed LmPDE polypeptide in a particular manner. Such modifications of LmPDE polypeptides include, but are not limited to, acetylation, carboxylation, glycosylation, phosphorylation, lipidation and acylation. Post-translational processing which cleaves a precursor form of the protein may also be important for correct insertion, folding and/or function. Different host cells such as CHO, HeLa, MDCK, 293, WI38, etc. have specific cellular machinery and characteristic mechanisms for such post-translational activities and may be chosen to ensure the correct modification and processing of the introduced, foreign protein.",
                                "For long-term, high-yield production of recombinant proteins, stable expression is preferred. For example, cell lines that stably express LmPDE polypeptides are transformed using expression vectors that contain viral origins of replication or endogenous expression elements and a selectable marker gene. Following the introduction of the vector, cells are grown in an enriched media before they are switched to selective media. The purpose of the selectable marker is to confer resistance to selection, and its presence allows growth and recovery of cells which successfully express the introduced sequences. Resistant clumps of stably transformed cells can be proliferated using tissue culture techniques appropriate for the cell type used.",
                                "Any number of selection systems may be used to recover transformed cell lines. These include, but are not limited to, the herpes simplex virus thymidine kinase (tk) (Wigler et al. (1977) Cell 11, 223-232) and adenine phosphoribosyltransferase (aprt) (Lowy et al. (1980) Cell 22, 817-823) genes which can be employed in tk-minus or aprt-minus cells, respectively. Also, antimetabolite, antibiotic or herbicide resistance can be used as the basis for selection. Examples include: dhfr which confers resistance to methotrexate (Wigler et al. (1980) Proc Natl Acad Sci USA 77, 3567-3570); npt, which confers resistance to the aminoglycosides neomycin and G-418 (Colbere-Garapin et al. (1981) J. Mol. Biol. 150, 1-14) and als or pat, which confer resistance to chlorsulfaron and phosphinotricin acetyltransferase, respectively (Murry, supra).",
                                "Additional selectable genes have been described, for example, UpB, which allows cells to utilize indole in place of tryptophan, or hisD, which allows cells to utilize histinol in place of histidine (Hartman et al. (1988) Proc. Natl. Acad. Sci. USA 85, 8047-8051). Recently, the use of visible markers has gained popularity. Such markers include anthocyanins, β-glucuronidase and its substrate, GUS, and luciferase and its substrate, luciferin. These markers are widely used not only to identify transformants, but also to quantify the amount of transient or stable protein expression attributable to a specific vector system (Rhodes et al. (1995) Methods Mol. Biol. 55, 121-131)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe host-vector system",
                                "list prokaryotic host cells",
                                "list eukaryotic host cells",
                                "describe introduction of recombinant DNA molecules",
                                "describe transformation of vertebrate cells",
                                "identify successfully transformed cells",
                                "describe selection and cloning",
                                "describe biochemical assay or immunological method",
                                "describe bacterial systems",
                                "describe expression vectors for bacterial systems",
                                "describe pGEX vectors",
                                "describe yeast systems",
                                "describe plant expression vectors",
                                "describe viral promoters",
                                "describe plant promoters",
                                "describe insect systems",
                                "describe mammalian host cells",
                                "describe post-translational processing",
                                "describe selection systems"
                            ],
                            "num_characters": 9622,
                            "outline_medium": [
                                "introduce host-vector systems",
                                "describe prokaryotic host cells",
                                "describe eukaryotic host cells",
                                "outline transformation methods",
                                "discuss identification of transformed cells",
                                "describe bacterial expression vectors",
                                "outline yeast expression vectors",
                                "describe plant expression vectors",
                                "discuss insect and mammalian expression systems"
                            ],
                            "outline_short": [
                                "introduce host-vector system concept",
                                "describe prokaryotic and eukaryotic host cells",
                                "explain transformation and selection methods",
                                "discuss post-translational processing and stable expression"
                            ]
                        },
                        {
                            "title": "Antibodies Reactive Against LmPDE Polypeptides",
                            "paragraphs": [
                                "The present invention also provides antibodies that bind to the LmPDEs of the invention. These antibodies may be used for both diagnostic and therapeutic purposes.",
                                "The invention provides antibodies, such as polyclonal, monoclonal, chimeric, humanized, and human antibodies, as well as fragments thereof (e.g., Fab), that bind to LmPDE polypeptides. Such antibodies may selectively bind to a LmPDE polypeptide but will not bind (or will bind weakly) to a non-LmPDE protein. These antibodies can be from any source, e.g., rabbit, sheep, rat, dog, cat, pig, horse, mouse and human.",
                                "As will be understood by those skilled in the art, the epitopes of a LmPDE polypeptide to which an antibody is directed may vary with the intended application. LmPDE polypeptides may be targets for therapeutic methods such as targeted antibody therapy and immunotherapy to treat conditions associated with the presence or absence of a LmPDE of the invention. Additionally, some of the antibodies of the invention may be internalizing antibodies, which internalize (e.g., enter) into the cell upon or after binding. Internalizing antibodies are useful for inhibiting cell growth and/or inducing cell death and for detecting or targeting LmPDEs within damaged or dying cells.",
                                "The invention also encompasses antibody fragments that specifically recognize a LmPDE polypeptide. As used herein, an antibody fragment is defined as at least a portion of the variable region of the immunoglobulin molecule that binds to its target, i.e., the antigen-binding region. Some of the constant region of the immunoglobulin may be included. Fragments of the monoclonal antibodies or the polyclonal antisera include Fab, F(ab′)2, Fv fragments, single-chain antibodies, and fusion proteins which include the immunologically significant portion (i.e., a portion that recognizes and binds a LmPDE).",
                                "The chimeric antibodies of the invention may be immunoglobulin molecules that comprise at least two antibody portions from different species, for example a human and non-human portion. The invention also provides chimeric antibodies having different effector functions (Neuberger et al. (1984) Nature 312, 604), immunoglobulin constant regions from another species, and constant regions of another immunoglobulin chain (Sharon et al. (1984) Nature 309, 364; Tan et al. (1985) J. Immunol. 135, 3565-3567). Additional procedures for modifying antibody molecules and for producing chimeric antibody molecules using homologous recombination to target gene modification have been described (Fell et al. (1989) Proc. Natl. Acad. Sci. USA 86, 8507-8511).",
                                "Humanized antibodies directed against LmPDE polypeptides are also useful. Humanized antibodies can be made according to several methods known in the art (Teng et al. (1983) Proc. Natl. Acad. Sci. USA 80, 7308-7312; Kozbor et al. (1983) Immunology Today 4, 7279; Olsson et al. (1982) Meth. Enzymol. 92, 3-16).",
                                "Various methods for the preparation of antibodies are well known in the art. For example, antibodies may be prepared by immunizing a suitable mammalian host with an immunogen such as an isolated LmPDE polypeptide (Harlow (1989) Antibodies, Cold Spring Harbor Press, NY). In addition, fusion proteins of LmPDEs may also be used as immunogens, such as a LmPDE fused to GST, human Ig, or His-tagged fusion proteins. Cells expressing or over-expressing LmPDE polypeptides-may also be used for immunizations. This strategy may result in the production of monoclonal antibodies with enhanced capacities for recognizing endogenous LmPDE polypeptides (Harlow et al. (1988) Antibodies: A Laboratory Manual, Cold Spring Harbor Press).",
                                "The invention also provides for human antibodies. There are a number of well-known strategies one of ordinary skill in the art may use to produce human recombinant antibodies. One is the generation of antibodies using phage display technologies (Low et al. (1996). J Mol Biol 260(3):359-368; Winter et al. (1994). Annu Rev Immunol 12:433-455). Specifically, human RNA is used to produce a cDNA library of antibody heavy and light chain fragments expressed on the surface of bacteriophage. These libraries can be used to probe against the antigen of interest. The phage that bind, because of the antibody expressed on the surface, can then be isolated. The DNA encoding the variable regions is sequenced and cloned for antibody expression.",
                                "Another method of producing human antibodies employs “humanized” mice. These transgenic mice have had their own antibody genes replaced with a portion of the human antibody gene complex so that upon inoculation with antigen, they produce human antibodies (Green et al. (1994) Nat. Genet. 7:13-21; Low et al. (1996). J Mol Biol 260(3):359-368; Wagner et al. (1994) Eur. J. Immunol. 24(11):2672-2681; Wagner et al. (1994) Nuc. Acids Res. 22(8): 1389-1393; Winter et al. (1994) Annu Rev. Immunol. 12:433-455). The antibody producing cells that result can then be incorporated into the standard hybridoma technology for the establishment of specific monoclonal antibody producing cell lines.",
                                "Recombinant human antibodies are also produced by isolating antibody-producing B cells from human volunteers that have a robust response against the antigen of interest. Using fluorescence activated cell sorting (FACS) and fluorescently labeled antigen, cells producing the antibodies directed against the antigen can be separated from the other cells. The RNA can then be extracted and the sequence of the reactive antibody variable regions determined (Kantor et al. (1995) Ann. N.Y. Acad. Sci. 764:224-227, Wang et al. (2000) J. Immunol. Methods 244:217-225). The DNA sequence of the functional variable regions can be synthesized or cloned into mammalian expression vectors for large-scale human recombinant antibody production.",
                                "The amino acid sequence of LmPDE polypeptides may be used to select specific regions of a LmPDE protein for generating antibodies. For example, hydrophobicity and hydrophilicity analyses of a LmPDE amino acid sequence may be used to identify hydrophilic regions in a LmPDE protein structure. Regions of a LmPDE polypeptide that show immunogenic structure, as well as other regions and domains, can readily be identified using various other methods known in the art such as Chou-Fasman, Garnier-Robson, Kyte-Doolittle, Eisenberg, Karplus-Schultz or Jameson-Wolf analysis (Rost et al. (1994) Protein 19, 55-72).",
                                "Methods for preparing a protein for use as an immunogen and for preparing immunogenic conjugates of a protein with a carrier such as BSA, KLH, or other carrier proteins are well known in the art. Techniques for conjugating or joining therapeutic agents to antibodies are well known (Amon et al. (1985) “Monoclonal Antibodies For Immunotargeting Of Drugs In Cancer Therapy”, Monoclonal Antibodies And Cancer Therapy, Reisfeld et al. (eds.) pp. 243-56, Alan R. Liss, Inc; Hellstrom et al. (1987) “Antibodies For Drug Delivery”, Controlled Drug Delivery (2nd Ed.), Robinson et al. (eds.) pp. 623-53, Marcel Dekker, Inc.; Thorpe (1985) “Antibody Carriers Of Cytotoxic Agents In Cancer Therapy: A Review”, Monoclonal Antibodies '84-Biological And Clinical Applications, Pinchera et al. (eds.) pp. 475-506; Thorpe et al. (1982) “The Preparation And Cytotoxic Properties Of Antibody-Toxin Conjugates”, Immunol. Rev. 62, 119-158; and Sodee et al. (1997), Clin. Nuc. Med. 21, 759-766). In some circumstances, for example, direct conjugation using carbodiimide reagents may be used; in other instances linking reagents such as those supplied by Pierce Chemical Co., Rockford, Ill., may be effective.",
                                "Administration of a LmPDE immunogen is conducted generally by injection over a suitable time period and with use of a suitable adjuvant, as is generally understood in the art. (Harlow et al. (1988) Antibodies: A Laboratory Manual, Cold Spring Harbor Press). During the immunization schedule, titers of antibodies can be taken to determine the adequacy of antibody formation.",
                                "While the polyclonal antisera produced in this way may be satisfactory for some applications, monoclonal antibody preparations are preferred for pharmaceutical compositions. Immortalized cell lines which secrete a desired monoclonal antibody may be prepared using the standard method of Kohler and Milstein (Nature 256, 495-497) or modifications which effect immortalization of lymphocytes or spleen cells, as is generally known in the art. The immortalized cell lines secreting the desired antibodies are screened by immunoassay in which the antigen is a LmPDE polypeptide. When the appropriate immortalized cell culture secreting the desired antibody is identified, the cells can be cultured either in vitro or by production in ascites fluid. The desired monoclonal antibodies are then recovered from the culture supernatant or from the ascites supernatant.",
                                "The antibodies or fragments may also be produced by recombinant means. The antibody regions that bind specifically to the desired regions of a LmPDE polypeptide can also be produced in the context of chimeric antibodies of multiple species origin.",
                                "The antibodies of the invention can bind specifically to LmPDE polypeptides. In one embodiment, the LmPDE antibodies may specifically bind to the GAF domain of a LmPDE protein. In another embodiment, the antibodies of the invention may specifically bind to the C-terminal domain of a LmPDE protein. In a further embodiment, the antibodies may specifically bind to the PDE catalytic domain of a LmPDE polypeptide. In other embodiments, the antibodies of this invention may bind to other domains of a LmPDE polypeptide, for example the antibodies may bind to the N-terminal domain of a LmPDE polypeptide."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide antibodies that bind to LmPDEs",
                                "describe types of antibodies (polyclonal, monoclonal, chimeric, humanized, human)",
                                "specify epitopes of LmPDE polypeptides",
                                "describe therapeutic methods using antibodies",
                                "define antibody fragments",
                                "describe chimeric antibodies",
                                "describe humanized antibodies",
                                "describe methods for preparing antibodies",
                                "describe immunization strategies",
                                "describe phage display technologies",
                                "describe \"humanized\" mice",
                                "describe recombinant human antibodies",
                                "describe isolating antibody-producing B cells",
                                "describe selecting specific regions of LmPDE protein for generating antibodies",
                                "describe methods for preparing protein for use as immunogen",
                                "describe conjugating therapeutic agents to antibodies",
                                "describe administration of LmPDE immunogen",
                                "describe screening for monoclonal antibodies",
                                "describe producing antibodies by recombinant means"
                            ],
                            "num_characters": 9698,
                            "outline_medium": [
                                "provide antibodies that bind to LmPDEs",
                                "describe types of antibodies (polyclonal, monoclonal, chimeric, humanized)",
                                "motivate therapeutic and diagnostic uses of antibodies",
                                "define antibody fragments (Fab, F(ab′)2, Fv, single-chain antibodies)",
                                "describe chimeric antibodies (human and non-human portions)",
                                "describe humanized antibodies",
                                "outline methods for preparing antibodies (immunization, fusion proteins, phage display)",
                                "describe selection of specific regions of LmPDE protein for generating antibodies",
                                "outline methods for conjugating therapeutic agents to antibodies"
                            ],
                            "outline_short": [
                                "introduce antibodies against LmPDE polypeptides",
                                "describe types of antibodies",
                                "discuss methods for preparing antibodies",
                                "outline uses of antibodies against LmPDEs"
                            ]
                        },
                        {
                            "title": "Use of Antibodies Against LmPDEs",
                            "paragraphs": [
                                "LmPDE polypeptides can be used to elicit the generation of antibodies, including fragments, that specifically bind an epitope associated with a LmPDE polypeptide, using methods described herein (Kohler et al. supra). The antibodies which are immunoreactive with selected domains or regions of a LmPDE polypeptide are particularly useful. In one embodiment, LmPDE antibodies are used to screen expression libraries in order to obtain polypeptides related to LmPDE polypeptides (e.g., homologues).",
                                "In another embodiment, LmPDE antibodies are used to enrich or purify LmPDE polypeptides from a sample having a heterologous population of polypeptides. The enrichment and purifying methods include conventional techniques, such as immuno-affinity methods. In general, the immuno-affinity methods include the following steps: preparing an affinity matrix by linking a solid support matrix with a LmPDE antibody, wherein the linked affinity matrix specifically binds with a LmPDE polypeptide; contacting the linked affinity matrix with the sample under conditions that permit a LmPDE polypeptide in the sample to bind to the linked affinity matrix; removing the non-LmPDE polypeptides that did not bind to the linked affinity matrix, thereby enriching for or purifying a LmPDE polypeptide. A further step may include eluting a LmPDE polypeptide from the affinity matrix. The general steps and conditions for affinity enrichment for a desired protein or protein complex can be found in Antibodies: A Laboratory Manual (Harlow et al. (1988) CSHL, Cold Spring, N.Y.).",
                                "Furthermore, there are multiple diagnostic uses of the antibodies of the invention. The invention provides methods for diagnosing in a subject, e.g., an animal or human subject, a disease associated with the presence or deficiency of at least one LmPDE polypeptide. In one embodiment, the method comprises quantitatively determining the amount of at least one LmPDE polypeptide in the sample (e.g., cell or biological fluid sample) using any one or a combination of the antibodies of the invention. The amount so determined can then be compared with the amount in a sample from a normal subject. The presence of a measurably different amount in the sample (i.e., the amount of a LmPDE polypeptide in the test sample exceeds or is reduced from the amount of a LmPDE polypeptide in a normal sample) indicates the presence of the disease.",
                                "The anti-LmPDE antibodies of the invention may also be useful in diagnostic imaging methodologies, where the antibodies have a detectable label. The invention provides various immunological assays useful for the detection of LmPDE polypeptides in a suitable biological sample. Suitable detectable markers include, but are not limited to, a radioisotope, a fluorescent compound, a bioluminescent compound, a chemiluminescent compound, a chromophore, a metal chelator, biotin, or an enzyme. Such assays generally comprise one or more labeled LmPDE antibodies that recognize and bind a LmPDE polypeptide, and include various immunological assay formats well known in the art, including but not limited to various types of precipitation, agglutination, complement fixation, radioimmunoassays (RIA), enzyme-linked immunosorbent assays (ELISA), enzyme-linked immunofluorescent assays (ELIFA) (H. Liu et al. (1998) Cancer Research 58, 4055-4060), immunohistochemical analyses, and the like."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe using antibodies to screen expression libraries",
                                "describe using antibodies to enrich or purify LmPDE polypeptides",
                                "describe diagnostic uses of antibodies",
                                "describe method for diagnosing disease associated with LmPDE polypeptides",
                                "describe diagnostic imaging methodologies",
                                "describe various immunological assays"
                            ],
                            "num_characters": 3380,
                            "outline_medium": [
                                "describe use of antibodies to screen expression libraries",
                                "describe use of antibodies to enrich or purify LmPDE polypeptides",
                                "outline diagnostic uses of antibodies (quantitative determination, diagnostic imaging)"
                            ],
                            "outline_short": [
                                "describe uses of antibodies against LmPDEs"
                            ]
                        },
                        {
                            "title": "Methods for Generating LmPDE Polypeptides",
                            "paragraphs": [
                                "The LmPDE polypeptides of the present invention may be generated by chemical synthesis or by recombinant methods. If a high yield is desired, recombinant methods may be used, as set forth above. The LmPDE polypeptides of the invention can also be generated by chemical synthetic methods. The principles of solid phase chemical synthesis of polypeptides are well known in the art and may be found in general texts relating to this area (see, e.g., Dugas et al. (1981) Bioorganic Chemistry, pp. 54-92, Springer-Verlag, New York).",
                                "The present invention also provides derivative polypeptide molecules, such as chemically modified LmPDE polypeptides. Illustrative of such modifications is replacement of hydrogen by an alkyl, acyl, or amino group. The LmPDE polypeptide derivatives retain the biological activities of naturally occurring LmPDEs."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe methods for generating LmPDE polypeptides (chemical synthesis or recombinant methods)"
                            ],
                            "num_characters": 841,
                            "outline_medium": [
                                "describe methods for generating LmPDE polypeptides (chemical synthesis, recombinant methods)"
                            ],
                            "outline_short": [
                                "describe methods for generating LmPDE polypeptides"
                            ]
                        },
                        {
                            "title": "Screening for Compounds that Modulate LmPDE Activity/Expression",
                            "paragraphs": [
                                "The LmPDE polypeptides of the present invention are phosphodiesterases from Leishmania, such as Leishmania major, that function as key components in the regulation of intracellular levels of cAMP by catalyzing its hydrolysis. Together with the adenylyl cyclases, these phosphodiesterases ultimately control the biological responses mediated by the messenger cAMP. Regulation of intracellular levels of cAMP is crucial in the processes of cell transformation and proliferation. Thus, LmPDE polypeptides are important targets for compounds that modulate their biological activity, or that modulate their expression. Compounds that effectively modulate the biological functions of LmPDEs may serve as important therapeutics for the treatment of parasitic diseases such as leishmaniasis. The invention also provides a method for obtaining compounds that modulate either the activity or the expression of LmPDEs.",
                                "The present invention relates to screening methods for identifying compounds that bind to LmPDE polypeptides (e.g., ligands) and modulate the biological activity of LmPDE polypeptides. These screening methods may also identify compounds that do not necessarily bind directly to LmPDEs, but nevertheless modulate LmPDE activity. Such screening methods can also be used to identify compounds that modulate the expression of LmPDE polypeptides.",
                                "Typically, the goal of screening methods is to identify compounds that bind to the target LmPDEs and cause changes in the biological activity of the target polypeptide or nucleic acid molecule. The compounds of interest are identified from a population of candidate compounds. For example, a compound that effectively binds the target nucleic acid molecule can decrease expression of the LmPDE polypeptide, and thereby decrease proliferation of cells that express LmPDE polypeptides. Decreasing the proliferation of cells that express LmPDE polypeptides can be an effective method of treating diseases associated with the infection of parasites such as Leishmania major.",
                                "Several assays and screens can be used to identify compounds that modulate LmPDE activity and/or expression. The compounds identified in the assays and screens may modulate the activity of LmPDEs in a variety of ways. For example, the compounds may bind directly to a LmPDE polypeptide or it may bind to intracellular proteins that bind to a LmPDE. The compounds may also modulate the activity of a LmPDE gene, or modulate the expression of a LmPDE gene or a LmPDE polypeptide. For example, such compounds may bind to a LmPDE regulatory sequence and thus modulate gene expression (see, e.g. Platt (1994) J. Biol. Chem. 269, 28558-28562).",
                                "Compounds that can be screened by the methods described in the present invention include, but are not limited to, peptides and derivatives thereof (e.g. peptidomimetics) that bind to a LmPDE polypeptide or otherwise modulate its activity in any way. Such compounds may include peptides, such as soluble peptides, including members of random peptide libraries (Lam et al. (1991) Nature 354, 82-84; Houghten et al. (1991) Nature 354, 84-86), and combinatorial chemistry-derived molecular libraries made of D- and/or L-amino acids, phosphopeptides (including, but not limited to, members of random or partially degenerate, directed phosphopeptide libraries; see, e.g., Songyang et al. (1993) Cell 72, 767-778), carbohydrates, and small organic or inorganic molecules. Compounds that can be screened include, but are not limited to, natural and synthetic products. A skilled artisan can readily recognize that there is no limit as to the structural nature of the compounds tested for binding to LmPDE polypeptides.",
                                "Candidate compounds that are tested for binding with LmPDE polypeptides and/or modulating the activity of LmPDE polypeptides can be randomly selected or rationally selected. As used herein, a compound is said to be randomly selected when the compound is chosen randomly without considering the specific sequences of the LmPDE polypeptide or nucleic acid. Examples of randomly selected agents are members of a chemical library, a peptide combinatorial library, a growth broth of an organism, or plant extract.",
                                "As used herein, a compound is said to be rationally selected when the compound is chosen on a nonrandom basis that is based on the sequence of the target site and/or its conformation in connection with the compound's action. Compounds can be rationally selected by utilizing the peptide sequences that make up the LmPDE polypeptide or by analyzing the nucleotide sequence that encodes a LmPDE polypeptide.",
                                "Methods for rationally selecting a compound that modulates the activity and/or expression of a LmPDE polypeptide include computer modeling or searching techniques. For example, compounds likely to interact with the active site of a LmPDE polypeptide are identified. The active site of a LmPDE polypeptide can be identified using methods known in the art including, for example, analysis of the amino acid sequence of a molecule, and from a study of complexes formed by a LmPDE polypeptide and a native substrate (e.g. cAMP), Methods such as X-ray crystallography and NMR can be used to solve the three-dimensional structure of a protein in order to identify possible binding sites, including the active site of the natural substrate.",
                                "Computer-based modeling can be used to complete an incomplete or insufficiently accurate structure. Modeling methods that can be used are, for example, parameterized models specific to particular biopolymers such as proteins or nucleic acids, molecular dynamics modeling based on computing molecular motions, statistical mechanics models based on thermal ensembles, or combined models. For most types of models, standard molecular force fields, representing the forces between constituent atoms and groups are necessary, and can be selected from force fields known in the art. Information on incomplete or less accurate structures determined as above can be incorporated as constraints on the structures computed by these modeling methods.",
                                "Once the structure of the active site of a LmPDE polypeptide has been determined, candidate modulating compounds can be identified by searching databases containing compounds along with information on their molecular structure. The compounds identified in such a search are those that have structures that match the active site structure, fit into the active site, or interact with groups defining the active site. The compounds identified by the search are potential LmPDE modulating compounds.",
                                "These methods may be used to identify improved modulating compounds based on compounds that are known to modulate other PDEs. The structure of the known compound is modified and modulating effects are determined using experimental and computational methods as described herein. The altered structure is compared to the active site structure of a LmPDE polypeptide to determine or predict how a particular modification to the compound will effect its interaction with that protein. Systematic variations in composition, such as by varying side groups, can be evaluated to obtain modified modulating compounds of preferred specificity or activity.",
                                "Examples of molecular modeling systems are the QUANTA programs, e.g., CHARMm, MCSS/HOOK, and X-LIGAND (Molecular Simulations, Inc., San Diego, Calif.). QUANTA provides a modeling environment for simulation and analysis of macromolecules and small organic molecules.",
                                "The process of using experimental or predicted structural information in a computer simulation to predict the interactions of potential modulating compounds is well known in the art. For example, see Rotivinen et al. (1988) Acta Pharm. Fenn. 97, 159-166; and McKinaly et al. (1989) Ann. Rev. Pharmacol. Toxicol. 29, 111-122. Computer programs designed to screen and depict chemicals are available from companies such as MSI, Allelix, Inc., and Hypercube, Inc. These applications are largely designed for drugs specific to particular proteins; however, they may be adapted to the design of drugs specific to identified regions of DNA or RNA. Commercial sources of chemical libraries can be used as sources of candidate compounds. Such chemical libraries can be obtained from, for example, ArQule, Inc.",
                                "Compounds that modulate the activity and/or expression of a LmPDE polypeptide may also be based on antisense constructs. Therapeutic techniques based on an antisense approach involve the design of oligonucleotides that are complementary to LmPDE mRNAs. These oligonucleotides bind the complementary transcripts and prevent translation. Absolute (or total) complementarity is not required. An oligonucleotide may function as an effective antisense construct as long as its sequence is sufficiently complementary to be able to hybridize with RNA and form a stable duplex. In the case of a double-stranded antisense nucleic acid molecule, a single strand of the duplex may be tested, or triplex formation may be assayed. The ability to hybridize will depend on both the degree of complementarity and the length of the antisense nucleic acid. In general, the longer the hybridizing nucleic acid, the more base mismatches with an RNA it may contain and still form a stable duplex (or triplex, as the case may be). One skilled in the art can determine a tolerable degree of mismatch by use of standard procedures to determine the melting point of the hybridized complex.",
                                "Furthermore, several in vitro assays can be used to identify compounds that modulate the expression and/or the activity of a LmPDE polypeptide. Such assays typically involve preparation of a reaction mixture comprising a LmPDE polypeptide and a test compound under conditions sufficient to allow the two components to interact and bind, thus forming a complex that can be detected and/or isolated. The binding of a compound with a LmPDE polypeptide can be assayed using a shift in the molecular weight or a change in biological activity of the unbound LmPDE polypeptide, or the expression of a reporter gene in a yeast two-hybrid system (Fields et al. (1989) Nature 340, 245-246). The method used to identify whether a compound binds to a LmPDE polypeptide will be based primarily on the nature of the LmPDE polypeptide used. For example, a gel retardation assay can be used to determine whether a compound binds to a LmPDE polypeptide. Alternatively, immunodetection and biochip (e.g., U.S. Pat. No. 4,777,019) technologies can be adopted for use with a LmPDE polypeptide. An alternative method for identifying compounds that bind with a LmPDE polypeptide employs TLC overlay assays using glycolipid extracts from immune-type cells (Abdullah et al. (1992) Infect. Immunol. 60, 56-62). Furthermore, a decrease in LmPDE cAMP hydrolytic activity can be measured to determine whether or not a particular compound is inhibiting a LmPDE. A skilled artisan can readily employ numerous techniques known in the art for determining whether a particular compound binds to a LmPDE polypeptide of the invention. Such assays will typically make use of a control cell.",
                                "It is also possible to use cell-based assays to identify compounds that interact with LmPDE polypeptides. Cell lines that naturally express LmPDEs or that have been genetically engineered to express LmPDEs can be used. For example, test compounds may be added to cell cultures after which the hydrolysis of cAMP can be measured using standard techniques known in the art. A decrease in the amount of hydrolysis in the presence of a test compound compared to control cells that do not contain the test compound indicates that the test compound is an inhibitor of LmPDE activity.",
                                "Inhibitors of LmPDE expression may be identified by using a chimeric gene in which a LmPDE nucleotide sequence is fused with a reporter, such as firefly luciferase. Cultured cells that have been transformed with the chimeric gene can be screened for the expression of luciferase activity in the presence of test compounds. Compounds that inhibit luciferase activity in this high throughput assay can also be confirmed by direct measurement for the presence of the endogenous LmPDE polypeptide (e.g. by Western blotting) and LmPDE mRNA (e.g. by Northern blotting) using methods that are well known in the art (see, e.g., Ausubel et al. (1994) Current Protocols in Molecular Biology, John Wiley & Sons). Candidate compounds can be further tested in cell or tissue cultures as well as in animal models. Cells expressing a LmPDE polypeptide, for example, can be incubated with a test compound, after which cell lysates are prepared and probed for the presence of the LmPDE polypeptide (e.g. using Western blotting techniques). A decrease in the amount of LmPDE expression in cultures treated with the test compound compared to control cultures without the test compound indicates that the test compound is an inhibitor of LmPDE expression.",
                                "In vivo assays can also be used to test these compounds in animal models of Leishmania infection. Test compounds predicted to inhibit LmPDE activity and/or expression are administered to the animals. The treated animals can then be assayed for inhibition of LmPDE activity. Such assays may be indirect or inferential. Improved health, for example, may indicate the efficacy of a test compound. Direct assays may also be performed where a decrease in LmPDE expression can be measured by a Northern blotting analysis. A decrease in the amount of LmPDE mRNA present in the sample from treated animals compared to untreated control animals indicates that the test compound inhibits LmPDE expression. A direct assay may also be performed that measures the hydrolytic activity of a LmPDE on cAMP. A decrease in hydrolysis of cAMP in the sample from treated animals compared to the untreated control animals indicates that the test compound inhibits LmPDE activity.",
                                "LmPDE polypeptides which are used in the screening assays described herein include, but are not limited to, an isolated LmPDE polypeptide, a host cell that expresses a LmPDE polypeptide, or a fraction of a host cell that expresses a LmPDE polypeptide.",
                                "The cellular extracts to be tested for binding with LmPDE polypeptides and or modulating the activity of LmPDE polypeptides can be, as examples, aqueous extracts of cells or tissues, organic extracts of cells or tissues or partially purified cellular fractions. A skilled artisan can readily recognize that there is no limit as to the source of the cellular extracts used in the screening methods of the present invention.",
                                "Compounds that are identified as candidates for inhibiting the activity and/or expression of a LmPDE polypeptide, when administered in a therapeutically effective amount, may be useful for treating diseases and reducing symptoms associated with the infection of Leishmania, such as leishmaniasis. Toxicity and therapeutic efficacy of identified compounds that modulate the activity and/or expression of a LmPDE polypeptide can be determined by standard pharmaceutical procedures. For example, using either cells in culture or experimental animals, the dose lethal to 50% of the population (LD50) can be determined. The dose ratio between toxic and therapeutic effects is the therapeutic index and can be expressed as the ratio LD50/ED50. Compounds with a large therapeutic index are preferred. While compounds that have toxic side effects may be used, care should be taken to design a delivery system that targets such compounds to the site of affected tissue to minimize potential damage to uninfected cells and thus reduce side effects.",
                                "The data obtained from cell culture assays and animal studies can be used in formulating a range of dosage for use in humans. The dosage of such compounds lies preferably within a range of circulating concentrations that include the ED50 with little or no toxicity. The dosage may vary within this range depending upon the dosage form employed and the route of administrations used. For any compound used in the method of the present invention, the therapeutically effective dose can be estimated initially from cell culture assays. A dose may be formulated in animal models to achieve a circulating plasma concentration range that includes the IC50 as determined in cell culture. Such information can be used to more accurately determine useful doses in humans. Levels in plasma can be measured, for example, by high performance liquid chromatography.",
                                "**Generation of Transgenic Organisms**",
                                "Another aspect of the invention provides transgenic organisms comprising LmPDE nucleic acids. As used herein, a genetically modified organism refers to an organism that has been altered from its natural state by manipulation of the native nucleic acid sequences. For example, in one application, PDE-deficient organisms can be generated using standard knock-out procedures to inactivate an endogenous PDE. Alternatively, inducible PDE anti-sense molecules can be used to regulate the activity and/or expression of the endogenous PDE. An organism can also be produced so as to contain a LmPDE-encoding nucleic acid molecule or an antisense-LmPDE expression unit that directs the expression of a LmPDE polypeptide or the antisense molecule. In such cases, an organism is generated in which the expression of the endogenous PDE gene is altered by inactivation and/or replaced by a LmPDE gene. This can be accomplished using a variety of procedures known in the art such as targeted recombination. Once generated, the endogenous PDE-deficient organism that expresses a LmPDE polypeptide can be used to (1) identify biological and pathological processes mediated by LmPDE polypeptides, (2) identify proteins and other genes that interact with LmPDE polypeptides, (3) identify compounds that can be exogenously supplied to inhibit a LmPDE polypeptide, and (4) serve as an appropriate screen for identifying mutations within LmPDE genes that increase or decrease activity.",
                                "For example, in one embodiment, the endogenous PDE genes in S. cerevisiae can be deleted, which results in intracellular accumulation of cAMP. Organisms that accumulate high levels of intracellular cAMP cease to grow when exposed to a heat shock. LmPDE nucleic acid molecules can then be cloned into a yeast expression vector and transfected into the PDE-deficient strain of S. cerevisiae. Restoration of heat-insensitive growth is thus a marker for LmPDE activity. Observing whether or not heat-insensitive growth is restored to the transfected strain under various conditions can indicate the effects these conditions have on LmPDE activity.",
                                "**Uses of LmPDE Polypeptides**",
                                "As discussed previously, the present invention provides cAMP-specific PDEs from Leishmania, such as Leishmania major, including LmPDE-A, LmPDE-B1, and LmPDE-B2 and fragments, variants, and mutants thereof. It is known that cAMP plays a key role in cell growth and differentiation in this parasite and that PDEs are responsible for the hydrolysis of this messenger. Therefore, as discussed above, LmPDEs are targets for drug screening assays and are useful in accomplishing selective drug design.",
                                "Additionally, the invention provides methods for monitoring the course of disease or disorders associated with the presence of LmPDEs in a test subject by measuring the amount of a LmPDE polypeptide in a sample from the test subject at various points in time. This is done for purposes of determining a change in the amount of a LmPDE in the sample over time. Monitoring the course of a disease or disorder over time may optimize the timing, dosage, and type of treatment. In one embodiment, the method comprises quantitatively determining in a first sample from the subject the presence of a LmPDE polypeptide and comparing the amount so determined with the amount present in a second sample from the same subject taken at a different point in time, a difference in the amounts determined being indicative of the course of the disease. Measuring the amount of LmPDE polypeptide present in a sample can be performed using a variety of techniques well known in the art, for example by using immunoassays as discussed below.",
                                "The present invention further provides methods for using isolated and substantially purified LmPDE polypeptides as antigens for the production of novel anti-LmPDE antibodies, and for using LmPDE polypeptides for obtaining and detecting novel LmPDE ligands. The anti-LmPDE antibodies are useful in diagnostic assays and kits for the detection of naturally occurring LmPDE protein sequences present in biological samples.",
                                "**Uses Of Nucleic Acid Molecules Encoding LmPDEs**",
                                "The nucleic acid molecules encoding LmPDE polypeptides of the invention are useful for a variety of purposes, including their use in diagnosis and/or prognostic methods. The nucleic acid molecules and polypeptides of the invention may be used to test for the presence and/or amount of LmPDE nucleotide sequences and LmPDE polypeptides in a suitable biological sample.",
                                "The nucleic acid molecules of this invention can be used in various hybridization methods to identify and/or isolate nucleotide sequences related to LmPDE nucleotide sequences, such as different polymorphic forms and genomic sequences. Sequences related to a LmPDE nucleotide sequence are useful for developing additional ligands and antibodies. The hybridization methods are used to identify/isolate DNA and RNA sequences that are at least about 60%, 65%, 70%, 75%, 80%, 85%, 90%, 95%, 96%, 97%, 98%, or 99% identical to LmPDE nucleotide sequences, such as novel LmPDE homologues, allelic variants, and mutant forms.",
                                "Nucleotide sequences that encode LmPDE polypeptides described herein can be used as nucleic acid probes to retrieve nucleic acid molecules having sequences related to LmPDEs.",
                                "In one embodiment, a LmPDE nucleic acid probe is used to screen genomic libraries, such as libraries constructed in lambda phage or BACs (bacterial artificial chromosomes) or YACs (yeast artificial chromosomes), to isolate a genomic clone of a LmPDE gene. The LmPDE nucleotide sequences from genomic libraries are useful for isolating upstream or downstream non-coding sequences, such as promoter, enhancer, and transcription termination sequences. The upstream sequences from a LmPDE gene may be joined to non-LmPDE sequences in order to construct a recombinant DNA molecule that expresses the non-LmPDE sequence upon introduction into an appropriate host cell. In another embodiment, a LmPDE probe is used to screen cDNA libraries to isolate cDNA clones expressed in certain tissues or cell types.",
                                "Additionally, pairs of oligonucleotide primers can be prepared for use in a polymerase chain reaction (PCR) to selectively amplify or clone nucleic acid molecules encoding LmPDE proteins, or fragments thereof. PCR methods (U.S. Pat. No. 4,965,188) that include numerous cycles of denature/anneal/polymerize steps are well known in the art and can be readily adapted for use in isolating LmPDE-encoding nucleic acid molecules.",
                                "In addition, the nucleic acid molecules of the invention may also be employed in diagnostic embodiments, using LmPDE nucleic acid probes to determine the presence and/or the amount of LmPDE sequences present in a biological sample. One embodiment encompasses determining the amount of LmPDE nucleotide sequences present within the suitable biological sample such as in specific cell types, tissues, or body fluids, using a LmPDE probe in a hybridization procedure. The amount of LmPDE nucleic acid molecules in the test sample can be compared with the amount of LmPDE nucleic acid molecules in a reference sample from a normal subject. The presence of a measurably different amount of LmPDE nucleic acid molecules between the test and reference samples may correlate with the presence or with the severity of a disease associated with abnormal levels (high or low) of LmPDE nucleic acid molecules as compared to normal levels.",
                                "In another embodiment, monitoring the amount of LmPDE RNA transcripts over time is effected by quantitatively determining the amount of LmPDE RNA transcripts in test samples taken at different points in time. A difference in the amounts of LmPDE RNA transcripts in the various samples is indicative of the course of the disease associated with expression of a LmPDE transcript.",
                                "To conduct such diagnostic methods, a suitable biological sample from a test subject is contacted with a labeled LmPDE probe, under conditions effective to allow hybridization between the sample nucleic acid molecules and the probe. In a similar manner, a biological sample from a normal subject is contacted with a LmPDE probe and hybridized under similar conditions. The presence of the nucleic acid molecules hybridized to the probe is detected. The relative and/or quantified amount of the hybridized molecules may be compared between the test and reference samples. The LmPDE probes can be labeled with any of several known detectable labels, including radioactive, enzymatic, fluorescent, or chemiluminescent labels.",
                                "Many suitable variations of hybridization technology are available for use in the detection of nucleic acids that encode LmPDE polypeptides. These include, for example, Southern and Northern procedures. Other hybridization techniques and systems are known that can be used in connection with the detection aspects of the invention, including diagnostic assays such as those described in Falkow et al. (U.S. Pat. No. 4,358,535). Another hybridization procedure includes in situ hybridization, where the target nucleic acids are located within one or more cells and are contacted with the LmPDE probes. As is well known in the art, the cells are prepared for hybridization by fixation, e.g. chemical fixation, and placed in conditions that permit hybridization of a LmPDE probe with nucleic acids located within the fixed cell.",
                                "The nucleic acid molecules of this invention further provide anti sense molecules that recognize and hybridize to a LmPDE nucleic acid. Antisense polynucleotides are particularly useful in regulating the expression of a LmPDE protein in those cells expressing a LmPDE mRNA. One embodiment useful for this approach is an anti-sense molecule corresponding to the N-terminal sequence of the gene. The present invention includes such full length and fragment anti-sense polynucleotides.",
                                "The polynucleotides of this invention further provide reagents to develop animal models using “knock-out” strategies through homologous recombination. Methods for generating knock-out animals that fail to express a functional protein molecule are well known in the art (Capecchi (1989) Science 244, 1288-1292), and may be used in studying the in vivo functions of LmPDEs.",
                                "It is to be understood that both the foregoing general description and the following examples are exemplary and explanatory only and are not restrictive of the invention, as claimed. Moreover, it must be understood that the invention is not limited to the particular embodiments described. Further, the terminology used to describe particular embodiments is not intended to be limiting, since the scope of the present invention will be limited only by its claims.",
                                "The following examples are presented to illustrate the present invention and to assist one of ordinary skill in making and using the same. The methodology and results may vary depending on the intended goal of treatment and the procedures employed. The examples are not intended in any way to otherwise limit the scope of the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce LmPDE polypeptides",
                                "describe biological function of LmPDEs",
                                "motivate modulation of LmPDE activity/expression",
                                "introduce screening methods for identifying compounds",
                                "describe goal of screening methods",
                                "explain identification of compounds that bind to LmPDEs",
                                "explain identification of compounds that modulate LmPDE activity/expression",
                                "list types of compounds that can be screened",
                                "define randomly selected compounds",
                                "define rationally selected compounds",
                                "describe methods for rationally selecting compounds",
                                "explain computer modeling and searching techniques",
                                "describe identification of active site of LmPDE polypeptide",
                                "explain searching databases for candidate compounds",
                                "describe modification of known compounds to improve modulating effects",
                                "introduce molecular modeling systems",
                                "describe use of experimental or predicted structural information",
                                "explain computer simulation to predict interactions of potential modulating compounds",
                                "describe use of antisense constructs",
                                "explain design of oligonucleotides complementary to LmPDE mRNAs",
                                "describe in vitro assays for identifying compounds",
                                "explain preparation of reaction mixture for in vitro assays",
                                "describe detection of binding of compound to LmPDE polypeptide",
                                "introduce cell-based assays",
                                "describe use of chimeric gene with reporter",
                                "explain measurement of luciferase activity",
                                "describe confirmation of inhibition of LmPDE expression",
                                "introduce in vivo assays",
                                "describe administration of test compounds to animals",
                                "explain measurement of inhibition of LmPDE activity/expression",
                                "describe potential therapeutic use of identified compounds",
                                "formulate dosage for humans",
                                "estimate therapeutically effective dose",
                                "measure plasma levels",
                                "generate transgenic organisms",
                                "define genetically modified organism",
                                "generate PDE-deficient organisms",
                                "regulate PDE activity/expression",
                                "generate LmPDE-encoding nucleic acid molecule",
                                "identify biological/pathological processes",
                                "identify interacting proteins/genes",
                                "identify inhibiting compounds",
                                "serve as screen for mutations",
                                "use in yeast expression vector",
                                "restore heat-insensitive growth",
                                "indicate effects on LmPDE activity",
                                "provide cAMP-specific PDEs",
                                "target for drug screening assays",
                                "monitor disease/disorder course",
                                "measure LmPDE polypeptide amount",
                                "compare amounts over time",
                                "use isolated LmPDE polypeptides as antigens",
                                "obtain/detect novel LmPDE ligands",
                                "use nucleic acid molecules in diagnosis/prognosis"
                            ],
                            "num_characters": 27536,
                            "outline_medium": [
                                "introduce LmPDE polypeptides and their role in regulating cAMP levels",
                                "motivate modulation of LmPDE activity and expression for therapeutic purposes",
                                "describe screening methods for identifying compounds that bind to LmPDE polypeptides",
                                "outline types of compounds that can be screened, including peptides and small organic molecules",
                                "distinguish between randomly and rationally selected compounds",
                                "describe rational selection methods, including computer modeling and searching techniques",
                                "outline methods for identifying active site structures of LmPDE polypeptides",
                                "describe computer-based modeling methods for identifying candidate modulating compounds",
                                "outline methods for modifying known compounds to improve modulating effects",
                                "describe in vitro assays for identifying compounds that modulate LmPDE activity and expression",
                                "outline cell-based assays for identifying compounds that interact with LmPDE polypeptides",
                                "describe in vivo assays for testing compounds in animal models of Leishmania infection",
                                "outline types of LmPDE polypeptides that can be used in screening assays",
                                "describe sources of cellular extracts that can be tested for binding with LmPDE polypeptides",
                                "outline therapeutic potential of identified compounds for treating diseases associated with Leishmania infection",
                                "formulate dosage for human use",
                                "estimate therapeutically effective dose",
                                "generate transgenic organisms",
                                "produce PDE-deficient organisms",
                                "generate organisms with LmPDE-encoding nucleic acid",
                                "use transgenic organisms for various purposes",
                                "discuss uses of LmPDE polypeptides",
                                "monitor course of disease or disorder",
                                "use nucleic acid molecules for diagnosis",
                                "use nucleic acid molecules for isolating related sequences",
                                "discuss various hybridization methods"
                            ],
                            "outline_short": [
                                "introduce LmPDE polypeptides and their role in regulating cAMP levels",
                                "motivate screening methods for identifying compounds that modulate LmPDE activity and/or expression",
                                "describe various assays and screens for identifying compounds that modulate LmPDE activity and/or expression",
                                "outline methods for rationally selecting compounds that modulate LmPDE activity and/or expression",
                                "describe in vitro and cell-based assays for identifying compounds that interact with LmPDE polypeptides",
                                "outline in vivo assays for testing compounds in animal models of Leishmania infection",
                                "discuss therapeutic potential of identified compounds for treating diseases associated with Leishmania infection",
                                "formulate dosage for human use",
                                "generate transgenic organisms with LmPDE nucleic acids",
                                "identify uses of LmPDE polypeptides",
                                "utilize nucleic acid molecules encoding LmPDEs",
                                "describe diagnostic methods using LmPDE probes"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce second messengers",
                        "describe PDEs",
                        "classify PDEs",
                        "discuss PDEs in kinetoplastids",
                        "describe diseases related to PDEs",
                        "discuss PDEs as therapeutic targets"
                    ],
                    "num_characters": 3288,
                    "outline_medium": [
                        "introduce second messengers and their biological roles",
                        "describe PDEs and their functions",
                        "discuss diseases related to PDE activity"
                    ],
                    "outline_short": [
                        "describe PDEs and their biological roles"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "The following example provides the methods used to identify three cyclic nucleotide-specific phosphodiesterases from Leishmania major.",
                                "Two families of cAMP-specific PDEs from the protozoal parasite Trypanosoma brucei had been previously characterized and identified (Zoraghi et al. (2001) J. Biol. Chem. 276, 11559-11566; Zoraghi et al. (2002) Proc. Natl. Acad. Sci. USA 99, 4343-4348; Gong et al. (2001) Mol. Biochem. Parasitol. 116, 229-232); and Rascon et al. (2002) Proc. Natl. Acad. Sci. U.S.A. 99, 4714-4719. Sequences representing each family were then used to screen the Leishmania genome database (http://www.genedb.org/genedb/leish). A BLAST search was performed using the nucleotide sequence corresponding to the trypanosomal enzyme TbPDE1, which identified a nucleotide sequence in Leishmania major that shares 45.1% amino acid sequence identity (determined using the BESTFIT utility of the GCG program suite with default parameters). This novel sequence was labeled LmPDE-A. The gene for LmPDE-A is located within a sequence cluster consisting of chromosomes 18, 20, and 22. A BLAST search was also performed using the nucleotide sequence corresponding to the trypanosomal enzyme TbPDE2C, which identified two closely related sequences that were subsequently labeled LmPDE-B1 and LmPDE-B2. LmPDE-BI shares 70.2% amino acid identity with the query sequence TbPDE2C, while LmPDE-B2 shares 69.8% overall sequence identity with TbPDE2C. Overall amino acid sequence identity between LmPDE-B1 and LmPDE-B2 is 84.5%. According to the Leishmania genome database, the identified LmPDE-B1 and LmPDE-B2 loci are located on chromosome 15."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "identify phosphodiesterases",
                                "screen Leishmania genome database",
                                "characterize LmPDE-A, LmPDE-B1, and LmPDE-B2"
                            ],
                            "num_characters": 1640,
                            "outline_medium": [
                                "identify cyclic nucleotide-specific phosphodiesterases"
                            ],
                            "outline_short": [
                                "identify cyclic nucleotide-specific phosphodiesterases"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "The following example provides the methods used to clone and sequence the novel sequences identified in the Leishmania genome database.",
                                "Based on the sequences identified in the Leishmania genome database (as discussed in Example 1), PCR-primers were designed to amplify all three full-length genes from the genomic DNA of Leishmania major. PCR primers were also designed to amplify only the open reading frame portion of the three full-length genes. The primers were designed to contain a Sall site for in-frame cloning into the pLT1 vector (where the ATG-initiation codon is provided by the vector) and to code for a C-terminal hemagglutinin tag. For LmPDE-A, the forward and reverse primers were designed as follows: forward—5′-gtggtcgactcgactttcttgagcag-3′ (nucleotides 4-21 of the open reading frame, which correspond to nucleotides 533-550 in FIG. 2); reverse—5′-ptgggaatcctaagcataatctggaacatcatatggatacgagtcgtcgtggttgg-3′ (nucleotides 1896-1877 of the open reading frame—which correspond to nucleotides 2425-2406 in FIG. 2—and HA-tag). For LmPDE-B1, the forward and reverse primers were designed as follows: forward—5′-gatgtcga ctggcatatttcacggcca-3′ (nucleotides 2-19 of the open reading frame, which correspond to nucleotides 1268-1286 in FIG. 4); reverse—5′-ctgggaatccta agcataatctggaacatcatatggataaacaatcgagggtcggatg-3′ (nucleotides 2792-2772 of the open reading frame—which correspond to nucleotides 4058-4038 in FIG. 4—and HA-tag). For LmPDE-B2 the forward and reverse primers were designed as follows: forward—5′-gatgtcgacattcagcggtcttttcc-3′ (nucleotides 3-21 of the open reading frame, which correspond to nucleotides 2184-2202 in FIG. 6); reverse—5′-ctgggaatcctaagcataatctggaacatcatatggat aaacaatcgaggatcggatg-3′ (nucleotides 2822-2803 of the open reading frame—which correspond to nucleotides 5003-4984 in FIG. 6—and HA tag). The genes of Leishmania major, as with other kinetoplastids, do not contain introns. Accordingly, amplification of open reading frames directly from genomic DNA is routinely performed (Beverley (2003) Nat. Rev. Genet. 4, 11 19). Both strands of all three PCR fragments (LmPDE-A, LmPDE-B1, and LmPDE-B2) were then cloned via the TA-overhang into the vector pCR2.1-TOPO following the instructions of the kit supplied by Invitrogen. The clones were then sequenced using the ABI PRISM Big Dye Terminator v3.0 Cycle Sequencing Ready Reaction Kit (Applied Biosystems). Both strands of each clone were sequenced at least two times for verification.",
                                "The full-length LmPDE-A nucleotide sequence, with a length of 10,966 nucleotides, is shown in FIG. 2 where the open reading frame begins with adenine at position 530 and ends with guanine at position 2425. The corresponding amino acid sequence is set forth in FIG. 1. The full-length nucleotide sequence of LmPDE-B1, which is 7,095 nucleotides in length, is shown in FIG. 4, where the open reading frame begins with adenine at position 1267 and ends with adenine at position 4059, and the corresponding amino acid sequence is set forth in FIG. 3. The full-length nucleotide sequence of LmPDE-B2, which is 6,945 nucleotides in length, is shown in FIG. 6, where the open reading frame begins with adenine at position 2182 and ends with adenine at position 5004. The amino acid sequence that corresponds to this sequence is set forth in FIG. 5.",
                                "The sequence of the cloned LmPDE-A coincided 100% with the sequence present in the Leishmania database. The predicted amino acid sequence of LmPDE-A (FIG. 1) shares 45.1% overall sequence identity with the amino acid sequence of trypanosomal TbPDE1. The predicted amino acid sequence of LmPDE-B1 (FIG. 3) shares 70.2% overall sequence identity with the trypanosomal TbPDE2C amino acid sequence, while the predicted amino acid sequence of LmPDE-B2 (FIG. 5) shares 69.8% overall sequence identity with TbPDE2C. Using the Conserved Domain Search Service provided by NCBI (see http://www.ncbi.nlm.nih.gov/Structure/ccd/cdd.shtml) several conserved domains were identified in the LmPDE amino acid sequences. As indicated in FIG. 7, LmPDE-A contains a highly conserved catalytic domain (PDEase) beginning with tyrosine at amino acid position 384, and ending with proline at amino acid position 609. LmPDE-BI and LmPDE-B2 also each contain a highly conserved PDEase domain, beginning with phenylalanine at amino acid position 647, and ending with phenylalanine at amino acid position 880 (LmPDE-B1) and beginning with phenylalanine at amino acid position 657, and ending with phenylalanine at amino acid position 890 (LmPDE-B2). In addition to the PDEase domain, LmPDE-B1 and LmPDE-B2 both have two GAF domains as shown in FIGS. 7B and 7C."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "design PCR primers",
                                "amplify full-length genes",
                                "clone and sequence genes",
                                "analyze sequences",
                                "identify open reading frames",
                                "determine amino acid sequences",
                                "identify conserved domains",
                                "analyze sequence identity",
                                "confirm sequence assembly"
                            ],
                            "num_characters": 4662,
                            "outline_medium": [
                                "design PCR primers",
                                "clone and sequence novel genes",
                                "analyze sequence identity",
                                "identify conserved domains"
                            ],
                            "outline_short": [
                                "clone and sequence novel sequences",
                                "verify cloned sequences"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "The following example describes the methods used to evaluate the genomic organization of LmPDE-B1 and LmPDE-B2.",
                                "When the nucleotide sequences of the cloned LmPDE-B1 and LmPDE-B2 genes were compared to the sequences present in the Leishmania genome database, it was evident that the sequences in the database had been assembled incorrectly. The 3′-untranslated regions of the two genes had inadvertently been swapped. The correct organization of these two genes was then established by Southern blot analysis of a series of restriction digests of L. major genomic DNA (as shown in FIGS. 8 and 9). Lane 8 of each hybridization (Notl/Scal double digest) shall be used as an example for the analytical reasoning. If the sequence assembly in the database were correct, a Notl/Scal double digest should yield a fragment of at least 8 kb when hybridized with a LmPDE-B2-specific probe (since no Scal restriction site is present in the immediate 3′-region of LmPDE-B2 gene). In contrast to this prediction, the data show a 4 kb fragment is generated, demonstrating the presence of a Scal restriction site close to the 3′-end of the LmPDE-B2 gene. All additional digests shown in FIGS. 8 and 9 support, or are compatible with this conclusion. In addition to establishing the genomic organization of the LmPDE-B1 and LmPDE-B2 genes, these experiments demonstrated that each is a single-copy gene. The hybridization probes used in the Southern blotting analysis were as follows: LmPDE-A-specific: nucleotides 462-910 of the open reading frame (corresponding to nucleotides 991-1439 in FIG. 2); LmPDE-B1-specific: nucleotides 96489 of the open reading frame (corresponding to nucleotides 1362-1755 in FIG. 4); LmPDE-B2-specific: 106-417 of the open reading frame (corresponding to 2287-3936 in FIG. 6). This analysis also confirmed that LmPDE-B1 and LmPDE-B2 are tandemly arranged and separated by about 5 kb on chromosome 15 as shown in FIG. 11."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "compare nucleotide sequences",
                                "perform Southern blot analysis",
                                "establish genomic organization"
                            ],
                            "num_characters": 1935,
                            "outline_medium": [
                                "evaluate genomic organization"
                            ],
                            "outline_short": [
                                "evaluate genomic organization of LmPDE-B1 and LmPDE-B2"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "The following example provides the methods used to produce a transgenic yeast strain, containing a LmPDE-A and a LmPDE-B1, wherein the endogenous PDE activity was deleted.",
                                "The verified open reading frames of LmPDE-A and LmPDE-B1 were cloned into a yeast expression vector (pLT1, S. Kunz, unpublished) and transfected into a Saccharomyces cerevisiae strain wherein both endogenous PDE genes had previously been deleted (strain PP5: MATa leu2-3 leu2-112 ura3-52 his3-532 his4 cam pdel::URA3 pde2::HIS3; Colicelli et al. (1993) Proc. Natl. Acad. Sci. U.S.A. 90, 11970-11974). The pLT1 expression vector is a 2μ-based yeast vector carrying a LEU2 selector gene. The cloning site is flanked by a strong TEF2 promotor followed by an optimized Kozak box, and by a Cyc1 terminator. PDE-deficient S. cerevisiae accumulate intracellular cAMP, which results in a heat-sensitive phenotype. In particular, no growth is observed after a 15 minute heat shock at 55° C. As shown in FIG. 12, both LmPDE-A and LmPDE-B1 fully complemented this phenotype and restored heat-shock insensitive growth. For a heat-shock assay, patches were streaked onto SC-met-ura plates and grown for 2 days at 30° C. The patches were then replicated onto a plate pre-warmed to 55° C. The plate was incubated for an additional 15 min at 55° C., let cool to room temperature and was then incubated for 1-2 days at 30° C. These findings demonstrate that both LmPDE-A and LmPDE-B1 constructs produce active enzymes and that both enzymes are capable of hydrolyzing cAMP. Subsequent experiments demonstrated that LmPDE-B2 also fully complemented the heat-sensitive phenotype and restored heat-shock resistance (Johner et al. (submitted) J. Biol. Chem.).",
                                "The open reading frames of LmPDE-A, LmPDE-B1, and LmPDE-B2 were cloned independently into a yeast expression vector (pLT1, S. Kunz, unpublished) and transfected into a Saccharomyces cerevisiae strain wherein the endogenous PDE genes had previously been deleted (strain PP5: MATa leu2-3 leu2-112 ura3-52 his3-532 his4 cam pdel::URA3 pde2::HIS3; Colicelli et al. (1993) Proc. Natl. Acad. Sci. U.S.A. 90, 11970-11974). These strains were deposited at the American Type Culture Collection (ATCC) on Aug. 25, 2004, and have been assigned numbers PTA-6167, ______ and ______,respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "clone LmPDE-A and LmPDE-B1",
                                "transfect into yeast strain",
                                "evaluate PDE activity",
                                "deposit yeast strains at ATCC"
                            ],
                            "num_characters": 2294,
                            "outline_medium": [
                                "produce transgenic yeast strain",
                                "evaluate PDE activity"
                            ],
                            "outline_short": [
                                "produce transgenic yeast strain with LmPDE-A and LmPDE-B1"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "The following example provides the methods used to characterize the catalytic activities of recombinant LmPDE-A, LmPDE-B1, and LmPDE-B2. The example also provides the methods used to evaluate the sensitivity of recombinant LmPDE-B1 and LmPDE-B2 to commercially available PDE inhibitors.",
                                "**Preparation of Yeast Lysates**",
                                "PP5 yeast cells expressing LmPDE-A, LmPDE-B1, and LmPDE-B2, were lysed as described previously (Zoraghi et al. (2001) J. Biol. Chem. 276, 11559-11566). The cells were grown to mid-log to end-log phase in SC-leu medium, collected, resuspended in the original volume of prewarmed YPD medium, and incubated for an additional 3.5 hours at 30° C. to maximize protein expression. The cells were then harvested, washed twice in H2O, pelleted by centrifugation, and stored overnight at −70° C. The cell pellet was thawed on ice and resuspended in ice-cold extraction buffer (50 mM Hepes pH 7.5, 100 mM NaCl, 1× Complete® protease inhibitor cocktail without EDTA (Roche)). Cells were lysed by grinding with glass beads (0.45-0.50 mm) in 2 ml Sarstedt tubes using a FastPrep FP120 cell disrupter (3×45 seconds at setting 4). The lysed cells were centrifuged and glycerol was added to the resulting supernatant to a final concentration of 15% (v/v). Aliquots were snap-frozen in liquid nitrogen and were stored at −70° C.",
                                "**Assay of PDE Activity in Yeast Lysates**",
                                "PDE activity was determined in 50 mM HEPES, pH 7.5, 0.5 mM EDTA, 10 mM MgCl2, and 50 mg/ml BSA in a final assay volume of 100 μl. Each assay contained 50,000 cpm of 3H-labeled cAMP, with unlabeled cAMP added to adjust the desired total substrate concentration. Reactions were performed at 30° C. and were linear for at least 60 minutes. The standard reaction time was set to 15 minutes, and the amount of enzyme was always chosen so that no more than 15% of the substrate was hydrolyzed. Inhibitor studies were done at a cAMP concentration of 1 μM. Inhibitors were dissolved in DMSO, but the final DMSO concentration in the assays never exceeded 1%. Control reactions with DMSO alone were always included. Reactions were stopped by the addition of 25 μl of 0.5 N HCl. For the subsequent dephosphorylation of the AMP, the stopped reactions were neutralized with 20 μl of 1 M Tris base, followed by the addition of 10 μl of alkaline phosphatase (Roche Diagnostics; 1 unit/10 μl). The dephosphorylation reactions were incubated for 15 minutes at 37° C. and were then applied to 1 ml columns of QAE-Sephadex A25 in 30 mM ammonium formiate, pH 6.0. The 3H-adenosine formed as a reaction product was eluted with 1.6 ml of 30 mM ammonium formiate, pH 6.0 and was collected into 3.5 ml of water-soluble scintillation fluid (Packard Ultima Flo). Assays were performed in triplicate, and data were analyzed using the Graph Pad Prism software package.",
                                "**Activity and Specificity of LmPDEs**",
                                "Lysates prepared from yeast expressing LmPDE-A consistently showed no measurable PDE activity. This observation is consistent with the finding that LmPDE-A is less efficient than LmPDE-B1 and LmPDE-B2 at complementing the PDE deficiency of the host strain PP5. In addition, these findings are very similar to the observations made with the trypanosomal homologue TbPDE1. For example, TbPDE1 complemented the PDE deficiency of PP5 cells but its effect was less than that of other trypanosomal or human PDEs, and no enzymatic activity was detectable in the corresponding yeast cell lysates (Kunz et al. (2004) Eur. J. Biochem. 271, 637-647).",
                                "In contrast to lysates from LmPDE-A expressing cells, lysates from yeast strains expressing LmPDE-B1 and LmPDE-B2 showed strong PDE activities. Both enzymes exhibited very similar KM values for cAMP that were within the range of other class I PDEs (Zoraghi et al. (2001) J. Biol. Chem. 276, 11559-11566; Rascon et al. (2002) Proc. Natl. Acad. Sci. USA 99, 471-44719; Zoraghi et al. (2002) Proc. Natl. Acad. Sci. USA 99, 4343-4348; Francis et al. (2001) Prog. Nucleic Acid Res. Mol. Biol. 65, 1-52; Mou and Cote (2001) J. Biol. Chem. 276, 27527-27534). In addition, the presence of a 100-fold excess of cGMP did not affect the rate of hydrolysis of cAMP by LmPDE-B1 (compare FIG. 13B with FIG. 13A). A 50-fold excess of the reaction product 5′-AMP also had no effect on KM (nor Kcat) (FIG. 13C). Similar results were obtained with LmPDE-B2 (data not shown). Therefore, LmPDE-B1 and LmPDE-B2 are cAMP-specific PDEs.",
                                "These data are in good agreement with the finding that no cGMP-hydrolyzing activity is detectable in whole cell extracts from Leishmania major (data not shown). Because PDE-catalyzed hydrolysis is the only mechanism by which a cell can dispose of its cyclic nucleotides (except for possible export mechanisms; Guo et al. (2003) J. Biol. Chem. 278, 29509-29514), the absence of a cGMP-hydrolyzing PDE activity from Leishmanial cells suggests that cGMP signaling may not exist in Leishmania major.",
                                "**Activity of LmPDEs in the Presence of PDE Inhibitors**",
                                "FIG. 14 shows the effects of several commercially available PDE inhibitors (100 μM) on LmPDE-B1 and LmPDE-B2 activity in the presence of 1 μM cAMP. Both enzymes were insensitive to the broad spectrum PDE inhibitor IBMX but were partly sensitive to trequinsin, dipyridamole, and etazolate. Trequinsin and dipyridamole inhibited LmPDE-B1 activity with IC50 values of 96.6 and 22.6 μM, respectively.",
                                "The observed inhibitor profile, including the fact that dipyridamole and trequinsin were the most potent compounds, closely corresponds to that reported previously for trypanosomal PDEs (Zoraghi et al. (2001) J. Biol. Chem. 276, 11559-11566; Zoraghi et al. (2002) Proc. Natl. Acad. Sci. USA 99, 4343-4348; Rascon et al. (2002) Proc. Natl. Acad. Sci. USA 99, 4714-4719). The fact that several potent and specific inhibitors of different human PDEs had no effect on the Leishmanial PDEs strongly suggests that the development of Leishmania-specific PDE inhibitors is feasible."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare yeast lysates",
                                "assay PDE activity",
                                "evaluate inhibitor sensitivity",
                                "determine KM values",
                                "analyze substrate specificity",
                                "evaluate cGMP hydrolysis",
                                "test PDE inhibitors",
                                "determine IC50 values",
                                "compare inhibitor profiles",
                                "discuss feasibility of Leishmania-specific PDE inhibitors",
                                "summarize results"
                            ],
                            "num_characters": 5943,
                            "outline_medium": [
                                "prepare yeast lysates",
                                "assay PDE activity",
                                "evaluate inhibitor sensitivity",
                                "determine KM values",
                                "analyze specificity"
                            ],
                            "outline_short": [
                                "characterize catalytic activities of recombinant LmPDE-A, LmPDE-B1, and LmPDE-B2",
                                "evaluate sensitivity of recombinant LmPDE-B1 and LmPDE-B2 to PDE inhibitors"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "The following example describes the methods used to determine the effect of the PDE inhibitors dipyridamole, etazolate, and trequinsin on the proliferation of L. major promastigotes in vitro.",
                                "L. major MHRO/IR/75/ER or LV39 promastigote forms were cultured at 27° C. in SDM medium containing 5% heat-inactivated fetal bovine serum (R. Brun and M. Schonenberger (1979) Acta Trop. 36, 289-292). Cell proliferation was assayed in 5 ml cultures containing various concentrations of dipyridamole, etazolate, or trequinsin dissolved in DMSO (final concentration of 1% v/v) or 1% v/v DMSO as a control. At various times, 150 μaliquots were withdrawn and absorbance was measured at 600 nm in a microtiter plate reader. The correlation between OD600 and cell number was strictly linear over at least the range of 3×105 to 4×107 cells/ml.",
                                "As shown in FIG. 15, all three PDE inhibitors strongly inhibited promastigote proliferation with IC50 values of about 50 μM. The extent of inhibition was independent of cell density, and the effect of the inhibitors was not reduced by prolonged incubation of the cultures.",
                                "These results are consistent with the ability of dipyridamole, etazolate, and trequinsin to inhibit the activity of recombinant LmPDE-B1 (see, e.g., FIG. 14). In addition, the data strongly suggest that LmPDE-B1 and LmPDE-B2 are involved in the growth of L. major, and they further support the development of Leishmania-specific PDE inhibitors for the therapy of leishmaniasis.",
                                "With respect to ranges of values, the invention encompasses each intervening value between the upper and lower limits of the range to at least a tenth of the lower limit's unit, unless the context clearly indicates otherwise. Further, the invention encompasses any other stated intervening values. Moreover, the invention also encompasses ranges excluding either or both of the upper and lower limits of the range, unless specifically included in the stated range.",
                                "Unless defined otherwise, the meanings of all technical and scientific terms used herein are those commonly understood by one of ordinary skill in the art to which this invention belongs. One of ordinary skill in the art will also appreciate that any methods and materials similar or equivalent to those described herein can also be used to practice or test the invention. Further, all publications mentioned herein are incorporated by reference.",
                                "It must be noted that, as used herein and in the appended claims, the singular forms “a,” “or,” and “the” include plural referents unless the context clearly dictates otherwise. Thus, for example, reference to “a subject polypeptide” includes a plurality of such polypeptides and reference to “the agent” includes reference to one or more agents and equivalents thereof known to those skilled in the art, and so forth.",
                                "Further, all numbers expressing quantities of ingredients, reaction conditions, % purity, polypeptide and polynucleotide lengths, and so forth, used in the specification and claims, are modified by the term “about,” unless otherwise indicated. Accordingly, the numerical parameters set forth in the specification and claims are approximations that may vary depending upon the desired properties of the present invention. At the very least, and not as an attempt to limit the application of the doctrine of equivalents to the scope of the claims, each numerical parameter should at least be construed in light of the number of reported significant digits, applying ordinary rounding techniques. Nonetheless, the numerical values set forth in the specific examples are reported as precisely as possible. Any numerical value, however, inherently contains certain errors from the standard deviation of its experimental measurement.",
                                "Although the foregoing invention has been described in some detail by way of illustrations and examples for purposes of clarity of understanding, it will be apparent to those skilled in the art that certain changes and modification may be practiced. Therefore, the description and examples of the disclosure should not be considered as limiting the scope of the invention, which is defined by the scope of the appended claims. Other aspects, advantages, and modifications are within the scope of the following claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "culture L. major promastigotes",
                                "evaluate PDE inhibitor effects",
                                "determine IC50 values",
                                "analyze cell proliferation",
                                "discuss inhibitor effects",
                                "relate to LmPDE-B1 inhibition",
                                "support development of Leishmania-specific PDE inhibitors",
                                "summarize results"
                            ],
                            "num_characters": 4263,
                            "outline_medium": [
                                "determine effect of PDE inhibitors",
                                "evaluate IC50 values",
                                "analyze cell proliferation",
                                "support development of Leishmania-specific PDE inhibitors"
                            ],
                            "outline_short": [
                                "determine effect of PDE inhibitors on proliferation of L. major promastigotes",
                                "show inhibition of promastigote proliferation by PDE inhibitors"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [
                "claim priority to provisional applications"
            ],
            "num_characters": 203,
            "outline_medium": [
                "claim priority to provisional applications"
            ],
            "outline_short": [
                "claim priority to provisional applications"
            ]
        }
    ],
    "claims": [
        "1. A substantially purified protein comprising the amino acid sequence set forth in SEQ ID NO: 1 or variants and mutants thereof that are at least 80% identical to SEQ ID NO: 1 and that hydrolyze cAMP.",
        "2. A substantially purified nucleic acid molecule comprising a nucleic acid sequence that encodes a protein of claim 1.",
        "3. A nucleic acid molecule according to claim 2 wherein the nucleic acid molecule comprises the nucleotide sequence set forth in SEQ ID NO: 2 beginning with adenine at position 530 and ending with guanine at position 2425.",
        "4. A substantially purified protein comprising the amino acid sequence set forth in SEQ ID NO: 3 or variants and mutants thereof that are at least 80% identical to SEQ ID NO: 3 and that hydrolyze cAMP.",
        "5. A substantially purified nucleic acid molecule comprising a nucleic acid-sequence that encodes a protein of claim 4.",
        "6. A nucleic acid molecule according to claim 5 wherein the nucleic acid molecule comprises the nucleotide sequence set forth in SEQ ID NO: 4 beginning with adenine at position 1267 and ending with adenine at position 4059.",
        "7. A substantially purified protein comprising the amino acid sequence set forth in SEQ ID NO: 5 or variants and mutants thereof that are at least 80% identical to SEQ ID NO: 5 and that hydrolyze cAMP.",
        "8. A substantially purified nucleic acid molecule comprising a nucleic acid sequence that encodes a protein of claim 7.",
        "9. A nucleic acid molecule according to claim 8 wherein the nucleic acid molecule comprises the nucleotide sequence set forth in SEQ ID NO: 6 beginning with adenine at position 2182 and ending with adenine at position 5004.",
        "10. The nucleic acid molecule of claim 2, 5, or 8, wherein the nucleic acid molecule is a DNA molecule.",
        "11. A nucleic acid molecule that hybridizes to the nucleic acid molecule of claim 2, 5, or 8, or to any fragments thereof.",
        "12. A nucleic acid molecule according to claim 11 wherein the nucleic acid hybridizes under stringent conditions.",
        "13. A substantially purified protein comprising a PDE catalytic domain of LmPDE-A comprising amino acids 384-609 as set forth in SEQ ID NO: 1 or variants and mutants of the catalytic domain that are at least 80% identical to amino acids 384-609 of SEQ ID NO: 1 and that hydrolyze cAMP.",
        "14. A substantially purified nucleic acid molecule comprising a nucleic acid sequence that encodes a protein of claim 13.",
        "15. A substantially purified protein comprising a PDE catalytic domain of LmPDE-B1 comprising amino acids 647-880 as set forth in SEQ ID NO: 3 or variants and mutants of the catalytic domain that are at least 80% identical to amino acids 647-880 of SEQ ID NO: 3 and that hydrolyze cAMP.",
        "16. A substantially purified nucleic acid molecule comprising a nucleic acid sequence that encodes a protein of claim 15.",
        "17. A substantially purified protein comprising a PDE catalytic domain of LmPDE-B2 comprising amino acids 657-890 as set forth in SEQ ID NO: 5 or variants and mutants of the catalytic domain that are at least 80% identical to amino acids 657-890 of SEQ ID NO: 5 and that hydrolyze cAMP.",
        "18. A substantially purified nucleic acid molecule comprising a nucleic acid sequence that encodes a protein of claim 17.",
        "19. A vector comprising the nucleic acid molecule of claim 2, 5, or 8.",
        "20. The vector of claim 19 wherein the nucleic acid molecule is operably linked to at least one expression control sequence.",
        "21. A host vector system comprising the vector of claim 19 in a suitable host cell.",
        "22. The host vector system of claim 21 wherein the suitable host cell is a bacterial cell.",
        "23. The host vector system of claim 21 wherein the suitable host cell is a eukaryotic cell.",
        "24. The host vector system of claim 23 wherein the eukaryotic cell is Saccharomyces cerevisiae.",
        "25. An antibody, or antibody fragment comprising an antigen-binding site that recognizes and binds a protein of claim 1, 4, 7, 13, 15, or 17.",
        "26. An antibody of claim 25, wherein the antibody is a monoclonal antibody or a polyclonal antibody.",
        "27. An antibody of claim 26, wherein the antibody is chimeric, humanized, or human.",
        "28. A method of producing a LmPDE protein comprising culturing the host vector system of claim 21 under suitable conditions so as to produce the LmPDE protein in the host and recovering the LmPDE protein so produced.",
        "29. A method for identifying a compound that modulates LmPDE expression, the method comprising: \na) incubating a cell that can express a LmPDE protein with a compound under conditions and for a time sufficient for the cell to express a LmPDE protein absent the compound; \nb) incubating a control cell under the same conditions and for the same time absent the compound; \nc) measuring LmPDE expression in the cell in the presence of the compound; \nd) measuring LmPDE expression in the control cell; and \ne) comparing the amount of LmPDE expression in the presence and absence of the compound, wherein a difference in the level of expression indicates that the compound modulates LmPDE expression.",
        "30. The method of claim 29 wherein the compound decreases the expression of LmPDE.",
        "31. A method of identifying a compound that modulates LmPDE activity, the method comprising: \na) contacting a sample that has LmPDE activity with a compound under conditions and for a time sufficient for the sample to express LmPDE activity absent the compound; \nb) incubating a control sample under the same conditions and for the same time absent the compound; \nc) measuring LmPDE activity in the cell in the presence of the compound; \nd) measuring LmPDE activity in the control sample; and \ne) comparing the amount of LmPDE activity in the presence and absence of the compound, wherein a difference in the level of activity indicates that the compound modulates LmPDE activity.",
        "32. The method of claim 31, wherein the compound decreases LmPDE activity.",
        "33. A method of treating at least one disease associated with infection of the Leishmania major parasite comprising administering to a subject in need thereof a therapeutically effective amount of a compound that modulates the activity and/or expression of a protein of claim 1, 4, or 7.",
        "34. A method of treating at least one disease associated with infection of the Leishmania parasite comprising administering to a subject in need thereof a therapeutically effective amount of a compound that modulates the activity and/or expression of a protein of claim 1, 4, or 7.",
        "35. A genetically modified organism comprising the vector of claim 19 and wherein at least one endogenous LmPDE gene has been disabled.",
        "36. A method of detecting infection by the Leishmania major parasite comprising determining the amount present in a subject of at least one protein chosen from the sequences set forth in SEQ ID NO: 1, SEQ ID NO: 3, and SEQ ID NO: 5, and variants, mutants, and fragments thereof.",
        "37. A method of detecting infection by the Leishmania parasite comprising determining the amount present in a subject of at least one protein chosen from the sequences set forth in SEQ ID NO: 1, SEQ ID NO: 3, and SEQ ID NO: 5, and variants, mutants, and fragments thereof.",
        "38. A method of detecting infection by the Leishmania major parasite comprising determining the amount present in a subject of at least one nucleic acid molecule chosen from the sequences set forth in SEQ ID NO: 2, SEQ ID NO: 4, and SEQ ID NO: 6, and variants, mutants, and fragments thereof.",
        "39. A method of detecting infection by the Leishmania parasite comprising determining the amount present in a subject of at least one nucleic acid molecule chosen from the sequences set forth in SEQ ID NO: 2, SEQ ID NO: 4, and SEQ ID NO: 6, and variants, mutants, and fragments thereof.",
        "40. The protein of claim 4 or 7, wherein the protein has a KM value of about 1 to 2 μM for cAMP.",
        "41. The protein of claim 4 or 7, wherein the protein does not hydrolyze cGMP.",
        "42. The protein of claim 4 or 7, wherein the protein substantially hydrolyzes cAMP in the presence of up to about 100 μM of a phosphodiesterase inhibitor chosen from cilostamide, zaprinast, etazolate, Ro-20-1724, rolipram, isobutylmethylxanthine (IBMX), 8-methoxymethyl-IBMX, papaverine, milrinone, petoxifylline, and erythro-9-(2-hydroxy-3-nonyl)adenine.",
        "43. The nucleic acid of claim 5 or 8, wherein the protein has a KM value from 1 to 2 μM for cAMP.",
        "44. The nucleic acid of claim 5 or 8, wherein the protein does not hydrolyze cGMP.",
        "45. The nucleic acid of claim 5 or 8, wherein the protein substantially hydrolyzes cAMP in the presence of up to about 100 μM of a phosphodiesterase inhibitor chosen from cilostamide, zaprinast, etazolate, Ro-20-1724, rolipram, isobutylmethylxanthine (IBMX), 8-methoxymethyl-IBMX, papaverine, milrinone, petoxifylline, and erythro-9-(2-hydroxy-3-nonyl)adenine."
    ]
}