{
    "id": "US20150004623",
    "authors": [
        "Abdul Rani Bahaman",
        "Arivudainambi Seenichamy"
    ],
    "title": "DIAGNOSTIC KIT FOR THE DETECTION OF EARLY ACUTE LEPTOSPIROSIS",
    "date": "2012-07-02 00:00:00",
    "abstract": "The present invention relates to a diagnostic method for the detection of acute leptospirosis. The method of the invention allows for a quick, specific and sensitive detection of the disease caused by pathogenic Leptospira. The described method is based on the immunological detection of the protein LipL21, a membrane protein expressed specifically by pathogenic strains of Leptospira. Furthermore, the present invention relates to the development of a diagnostic device that allows positive diagnosis to be conducted in the early and critical stage of the infection. The preferred diagnostic device of the invention is a lateral flow test, which as a hand-held assay, is easy to use and facilitates diagnosis of leptospirosis in the first 5 days of infection. Further disclosed is the antibody raised against the LipL21 protein as well as its respective uses in the diagnostic methods and devices. Finally, a diagnostic kit is disclosed containing the inventive materials described herein to conduct diagnosis of acute leptospirosis during the critical early stage of infection. The first 5 days of the infection is where the subject or patient could succumb to the disease. Diagnosis of the disease at this critical stage of infection would then advise the affected patient to have immediate systemic antibiotic treatment and thereby, avoid succumbing to the disease.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a diagnostic method for the detection of acute leptospirosis. The method of the invention allows for a quick, specific and sensitive detection of the disease which is caused by pathogenic Leptospira. The described method is based on the immunological detection of the protein LipL21, a membrane protein expressed specifically in pathogenic strains of Leptospira. Furthermore, the present invention relates to a diagnostic device that allows to conduct the inventive method in a simple and quick approach. The preferred diagnostic device of the invention is the lateral flow test, which as a hand held assay is easy to use and further allows diagnosis of leptospirosis to be performed as early as the first 5 days of infection. It also disclosed the antibody raised against the LipL21 protein as well as its use in the diagnostic methods and devices. Finally a diagnostic kit is disclosed containing the inventive materials described herein for conducting a diagnosis of leptospirosis."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to diagnostic method for acute leptospirosis",
                        "relate to diagnostic device for detecting Leptospira"
                    ],
                    "num_characters": 1017,
                    "outline_medium": [
                        "introduce diagnostic method for acute leptospirosis"
                    ],
                    "outline_short": [
                        "introduce diagnostic method for acute leptospirosis"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Leptospirosis or Weil's Disease is a bacterial infection caused by Leptospira, which is pathogenic for a wide range of animal species including humans. The pathogen was discovered for the first time in 1886 by Adolf Weil who reported an acute infection with enlargement of spleen, jaundice and nephritis. It occurs in the western countries, like the United States and Canada, specifically in dogs, as well as in tropical countries, for example in Asia. Incident rates range in temperate countries from 0.02 per 100,000 to 10 to 100 in 100,000 in warm/tropical countries. Leptospirosis outbreaks were observed during the wet and warm months in the year, particularly during the monsoon season.",
                        "The Leptospira organism is transmitted through the urine of an infected animal. The most important primary host of the pathogen are rodents, particularly mice and rats, however, there are also a wide range of animals that are able to carry and transmit the disease. Humans get infected mainly from their pets or when working in close proximity to infected animals, like for example in slaughterhouse. The route of infection in humans is mainly through contact with contaminated water, food or soil.",
                        "Usually the disease symptoms begin with typical signs of flu, like fever, chills and headache. When this first phase of the disease resolves, the patient is for a short period of time asymptomatic until the second phase of the disease begins. The second phase is characterized by meningitis, liver damage and renal failure, and can induce severe damage when left untreated. Symptoms in humans usually occur in Day 4 to 14 following infection. Because of this wide range of different symptoms, the disease is often misdiagnosed. Thus, recorded cases of Leptospira infection are estimated to be below the actual incident rate.",
                        "Leptospirosis is confirmed with serological tests such as the microscopic agglutination test (MAT) and the enzyme-linked immunosorbent assay (ELISA). However, the serological techniques that are used in detecting leptospiral antibodies are very tedious, time consuming and often neither specific nor sensitive. The serological results were difficult to interpret and making them unsuitable for routine testing particularly on large number of samples. These serological methods detect either IgM or IgG antibodies to Leptospira.",
                        "The detection of leptospires in the form of culture isolation is also not preferable due to the slow growth of the bacterium and therefore provides a limited use in laboratory investigation. Nizamuddin et. al., (2006) suggested that antigen detection is useful in the diagnosis of acute cases of leptospirosis. However, to date, no diagnostic kit is available to detect antigen(s) in acute leptospiremia, specifically not during the first week of infection.",
                        "Available diagnostic tests, which are based on the use of the whole leptospiral cell extracts or semi purified fractions of proteins of the native non-infective form, can detect antibodies against leptospirosis with increased sensitivity and specificity in the late acute phase (Eller et al., 2002).",
                        "Lateral flow tests (LFT), also known as Lateral Flow Immunochromatographic Assays are simple diagnostic test devices used to detect the presence (or absence) of a target analyte, e.g. a pathogen, in a sample. Most commonly, these tests are used in medicine to provide an easy diagnosis either for use in the clinic or in the laboratory. Often produced in a dipstick format or as a strip, the lateral flow tests are a form of immuno-based assays in which the test sample moves along a solid substrate via capillary force.",
                        "After the sample is applied to the test it encounters a coloured reagent which mixes with the sample and transits to the substrate encountering lines which have been pre-treated with an antibody or antigen. Depending upon the analyte's presence in the sample the coloured reagent can become bound at the test line. Lateral Flow Tests can operate as either competitive or sandwich assays.",
                        "The diagnostic techniques of immunological assays are mostly based on detecting the antibody or antigen using a variety of methods. Labelled-antigens or antibodies are playing a prominent role in many of the currently available diagnostic kits. The label may consist of an enzyme, colloidal gold, radioisotope or fluorescent probe. The extremely high selectivity and affinity of the host antibody molecules to specific antigens have widely been used for immune detection methods. IgM antibody-based immune assays are used for early detection of many infectious diseases. However, serious infectious diseases like leptospirosis could kill the infected subject before the host could muster a significant immune response and produces enough antibodies to allow detection in the diagnostic method.",
                        "In view of the available diagnostic assays for leptospirosis it was the objective of the present invention to provide an improved diagnostic test system which allows for an easy, rapid and specific detection of the pathogenic Leptospira organisms. Specifically, the objective of the invention was to provide a diagnostic test that allows for the diagnosis of leptospirosis in the very early stage of infection, specifically in the first 10 days, or even within the first 1 to 4 days of infection.",
                        "The above problem is solved in a first aspect by a method for the detection of the presence of Leptospira in a sample, comprising the steps of",
                        "a) providing a sample to be analyzed,\n\nb) detecting the presence of LipL21 antigen in the said sample,\n\nc) optionally, detecting the presence of LipL21 antigen in a control sample,\n\nwherein the presence of LipL21 in the said sample is indicative for the presence of Leptospira.",
                        "In the context of the present invention a sample usable in the methods and devices described herein is a sample from a subject suspected to suffer from a Leptospira infection. Such a sample is preferably a biopsy, preferably a kidney biopsy, or a liquid sample, preferably selected from the group comprising urine, blood, serum or blood plasma. However, the present invention shall not be restricted to this exemplary listing of types of samples.",
                        "In a further embodiment of the invention the subject suspected to suffer from a Leptospira infection could be a bird, amphibian, reptile or mammal, preferably wherein the mammal is a rodent or a human. Most preferred samples for the methods of the invention are samples which originate from humans.",
                        "Preferably LipL21 is detected in step b) of the present invention by immunological means, such as the use of an antibody specific for the LipL21 protein. LipL21 is an outer membrane protein of pathogenic leptospires. It plays an important role in the infection process by acting as an adhesin, or as a target of specific antibodies, as porins, and as a receptor for soluble molecules and complement proteins. For the present invention, other leptospiral specific proteins can be used and are encompassed, for example LipL32.",
                        "Yet one additional preferred embodiment of the invention relates to antibodies for the detection of leptospires. Specifically it is preferred that the antibody is a monoclonal or polyclonal antibody, preferably wherein the antibody is a rabbit polyclonal antibody.",
                        "In a preferred embodiment of the invention the detection in step b) in the above method is performed using a lateral flow test (LFT), for example using a competitive or non-competitive LFT. In a competitive LFT assay, the sample first encounters detectable particles which are labelled with an analogue of the analyte. In context of the present invention, the preferred analyte is the leptospiral cell, or fragments thereof, or more specifically, the LipL21 protein. The sample then encounters a test line containing antibodies specific to the analyte, e.g. LipL21. Thus the unlabelled analyte in the sample and the detectably labelled analogue compete for binding with the immobilized antibodies in the test line. The antibody used for a competitive LFT within the test line is usually a monoclonal antibody. In competitive LFTs the test line (or capture line) will be detectable in the event that the sample is negative for the analyte.",
                        "In non-competitive LFTs there is no binding-competition between unlabelled and labelled analyte. In this embodiment the analyte is first labelled with a detectable particle and then is brought into contact with an antibody specific for the analyte at the test line. Thus, in a non competitive LFT a detectable test line is indicative for the presence of the analyte in the sample.",
                        "In a specific embodiment the test or control lines in the assay of the invention can be detected by eye observation. In this regard, the detectable particle is preferably a colloidal gold particle.",
                        "In context of the present invention it is preferred that the LFT is a non-competitive LFT. Preferably the LFT comprises a test line and/or a control line for confirming the correct operation of the LFT. Such a control line contains antibodies directed to the detection antibody in the LFT and is located distal to the test line. At the control line any detectable particle coupled to an detection antibody is immobilized. In this way it is confirmed that the LFT contained undamaged detection particles. A detectable control line therefore confirms correct operation of the LFT.",
                        "In a second aspect the object of the present invention is solved by a diagnostic device for detecting the presence of Leptospira in a sample. The diagnostic device comprises:\n\n\n- a) a sample addition zone,\n- b) a conjugation zone, comprising an antibody-indicator complex,\n- c) a detection zone, comprising a zone of immobilized detection\n  antibodies (capture line) and, optionally, a control zone of\n  immobilized control antibodies,\n- d) optionally, an absorbance zone for absorbing excess sample fluid.",
                        "According to one embodiment of the present invention, the diagnostic device comprises a sample addition zone, preferably in the form of a pad (sample pad) that allows the introduction of the sample to be analysed onto the diagnostic device. Usually the sample is a liquid sample which is added onto the sample pad in order to start the assay. The sample pad preferably is made of a material that allows for a movement of the sample fluid by capillary forces and which therefore transports the analyte in the sample through the zones of the inventive diagnostic device.",
                        "In a preferred embodiment, the sample pad material is a non woven cotton fibre, like cellulose fibre. It is further preferred that the sample pad for the purpose of the present invention permits the release of the analyte by high efficiency. To this end, the sample pad of the present invention is pre-treated with salt buffer and a blocking agent, such as bovine serum albumin (BSA). In the preferred embodiment of the invention the pre-treatment is carried out using 20 mM phosphate buffer (pH 7.4) containing 0.1% (v/v) Tween 20, and 1% (w/v) BSA, and subsequent drying at 60° C. The sample pad is thereafter treated again with 20 mM phosphate buffer (pH 7.4) containing 2% (w/v) BSA, 0.1% (v/v) Tween 20, 3% (w/v) sucrose and 0.02% sodium azide and dried at 37° C.",
                        "The conjugation zone of the diagnostic device of the present invention has the function to allow the analyte to react with the antibody-indicator complex of the present invention. The conjugation zone is dried before usage of the diagnostic device. The structure of the antibody-indicator complex with respect to the present invention is described herein below in more detail. When running the assay, the analyte within the sample liquid moves by capillary forces from the sample addition zone to the conjugation zone, wherein the analyte is exposed to the antibody-indicator complex. If analyte is present in the sample, the analyte may bind to the antibody-indicator complex. In any case the antibody-indicator complex is mobilized by the liquid in the sample and transported by capillary forces from the conjugation zone to the detection zone.",
                        "Preferred in the context of the present invention is, that the conjugation zone is in form of a pad (conjugation pad). A preferred material for the conjugation pad is glass fibre, e.g. MilliporeGlass FiberConjugatePadswith Lot Number-92090602; 20×300 mm Millipore, Mass., USA. Like the sample pad, the conjugation pad is preferably pre-treated with salt buffers and blocking agent. In a specific embodiment the pre-treatment is as follows: The anti-rLipL21 antibody labeled colloidal gold conjugate (antibody-indicator complex, was diluted (1:1 v/v) with 20 mM phosphate buffer (pH 7.4) containing 1% (w/v) BSA, 6% (w/v) sucrose. The conjugate pad pre-treated with 0.1% (v/v) Tween 20 for 24 hrs and dried for 45 minutes at 60° C. was immersed into conjugate solution, then lyophilized and store in a desiccator at 4° C. until use.",
                        "The detection zone of the diagnostic device according to the invention contains in a preferred embodiment the test and optionally control zones which allow to detect the absence or presence of the analyte. In one preferred embodiment the detection zone is made of a material that allows the liquid sample to move by capillary forces and on which the detection or control antibodies can be immobilized. Preferably is the use of a nitrocellulose membrane. For the purpose of the present invention, the zone of immobilized detection antibodies (capture line or test line) and, optionally, the control zone of immobilized control antibodies (control line) is arranged such that the sample liquid while the assay is run moves via capillary forces through the detection and/or control zone. The detection and/or control zone may be formed in any convenient way, such as sports, lines or likewise shaped zones.",
                        "Preferred is that the detection and/or control zone are formed as lines which are placed distant to each other to allow to distinguish their respective signals.",
                        "The absorbance zone is in a preferred embodiment composed of high-density cellulose material to allow the take up of excess sample fluid during the assay.",
                        "A preferred detection device according to the invention is exemplarily depicted in FIG. 2.",
                        "For the purpose of the present invention zones a) to d) are in one embodiment arranged in successive sequence from the proximal to distal end of the device, preferably on a strip. The zones are preferably interconnected such that the sample fluid can move from zone a) to zone d) via capillary forces.",
                        "In another embodiment of the invention the diagnostic device comprises an anti-LipL21 antibody within the antibody-indicator complex, preferably a polyclonal rabbit anti-LipL21 antibody, conjugated to an indicator, preferably wherein the indicator is a gold particle. Although gold particles are the preferred detectable labels in context of the present invention, any of a wide range of detectable markers/labels known in the art may be used.",
                        "Examples of detectable markers include, but are not limited to particles, luminescent labels; colorimetric labels, fluorescent labels; chemical labels; enzymes; radioactive labels; or radio frequency labels; metal colloids; and chemiluminescent labels.",
                        "Examples of common detection methodologies include, but are not limited to, optical methods, such as measuring light scattering, simple reflectance, luminometer or photomultiplier tube; radioactivity (measured with a Geiger counter, etc.); electrical conductivity or dielectric (capacitance); electrochemical detection of released electro-active agents, such as indium, bismuth, gallium or tellurium ions, or ferrocyanide.",
                        "The herein preferred use of colloidal gold particles allows for a visual inspection of the diagnostic device. In case the gold particles accumulate at the test line or control line, it shows as a red line. The signal is detectable by visual inspection.",
                        "In a next embodiment, the diagnostic device according to the invention comprises detection antibodies which are anti-LipL21 antibodies, preferably polyclonal rabbit anti-LipL21 antibodies. Preferably the antibodies as described herein below.",
                        "The diagnostic device according to the invention further contains control antibodies which are anti-rabbit antibodies, preferably goat anti-rabbit antibodies.",
                        "The diagnostic device is preferred in one embodiment of the invention, wherein the line of immobilized detection antibodies (capture line or test line) contains the antibody in a concentration of between 500 μg/ml to 10000 μg/ml, preferably 1000 μg/ml, 1500 μg/ml, 2000 μg/ml, 2500 μg/ml, 3000 μg/ml, 3500 μg/ml, 4000 μg/ml, 4500 μg/ml or 5000 μg/ml, most preferably the concentration of the antibody is 2000 μg/ml. Most preferred is that the line of immobilized detection antibodies (capture line or test line) contains 5 μg of rabbit anti-LipL21 antibody and/or wherein the control line contains 1 μg of goat anti-rabbit antibody.",
                        "For the purpose of the present invention the person of skill in the art is familiar with choosing different classes and origins of the detection and control antibodies. Antibodies raised in other species than rabbit, for example in goat, mouse or rat are also usable in the context of the present invention.",
                        "A further embodiment of the invention relates to the diagnostic device, wherein the distance between the capture zone and the control zone is about 5 mm. The control zone is arranged such that it is placed on the device behind the test zone with respect to the capillary flow direction. The distance between both lines should be large enough to allow for an easy distinction between the test zone and the control zone. In this way the control zone allows to confirm the correct operation of the test system.",
                        "Yet another embodiment of the invention relates to the diagnostic device, wherein the diagnostic device can detect 104 cells/ml of Leptospira in the sample to be analyzed. It is preferred that the diagnostic device of the present invention does not detect any one of the pathogens selected from the group comprising Klebsiella pneumoniae, Pasteurella multocida, Proteus sp, Rhodococcus sp, Bacillussubtilis, Streptococcus mutans, Staphylococcus aureus, Salmonella typhi or Pseudomonas aeruginosa. Most preferred is that the diagnostic device of the present invention detects specifically pathogenic Leptospira and not non-pathogenic Leptospira, such as saprophytic Leptospira biflexa.",
                        "In this way the present invention further provides methods and devices for the distinction of pathogenic Leptospira from non-pathogenic Leptospira.",
                        "In a further aspect of the present invention the object is solved by a method for diagnosing a Leptospira infection, the method comprising the steps of providing a sample from a subject to be diagnosed, adding the sample to a diagnostic device according to the invention as described herein above, and wherein the visual appearance of the testzone is indicative for a Leptospira infection. Only in context of a non-competitive LFT assay, the appearance or positive detection of the test zone is indicative for the presence of the analyte and therefore indicative for the Leptospira infection. In case a competitive LFT assay is used in context of the invention, the above is similarly preferred, however, in such a test the appearance, or positive detection at the test zone, is indicative for the absence of the analyte and therefore is indicative for the absence of a Leptospira infection.",
                        "The test and/or control zones may be formed in any convenient way, such as sports, lines or likewise shaped zones. Further preferred is that instead of only one test and/or control zone a multitude of test and/or control zones are used in order to further specify the assay result. In the context of the present invention the terms “capture zone” or “test zone” are used interchangeably.",
                        "The method of diagnosis according to the invention is in a preferred embodiment a method, wherein the sample is a biopsy, preferably a kidney biopsy, or a liquid sample, preferably selected from the group consisting of urine, blood or serum. In general any body fluid or tissue that is, or can be, infected by the Leptospira cells in the subject suspected to suffer from such an infection can be the source of the samples usable in the methods and/or devices of the present invention.",
                        "The subject suspected to suffer from a Leptospira infection in one preferred embodiment is a bird, amphibian, reptile or mammal, preferably wherein the mammal is a rodent or a human.",
                        "Due to the surprising effectiveness of the methods and devices described herein, the method according to the invention is preferably a method, wherein the subject to be diagnosed is in the early stage of Leptospira infection, preferably within Day 1 to Day 7 of Leptospira infection, more preferably within Day 1 to Day 5 of Leptospira infection, more preferred the subject to be diagnosed is in Day 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 after the infection, or in a later stage.",
                        "In a preferred embodiment of the method according to the invention, the sample is added to the sample addition zone of the diagnostic device.",
                        "In another embodiment, a method is preferred wherein the appearance of a control zone is indicative for the correct operation of the assay. In one embodiment it is preferred that the diagnostic device is a competitive lateral flow test (LFT). In a competitive lateral flow test it is preferred that the appearance of a test zone indicates the absence of a Leptospira infection.",
                        "In a third aspect the object of the present invention is solved by an antibody which is specific for Leptospira, preferably wherein the antibody binds specifically to the membrane protein LipL21. In one embodiment the antibody of the invention is a polyclonal rabbit anti-LipL21 antibody or a polyclonal rabbit anti-r (recombinant) LipL21 antibody. A polyclonal antibody provides that the antigen is detected via multiple epitopes.",
                        "A fourth aspect of the invention relates to a diagnostic kit, comprising a diagnostic device as described above, and/or an antibody as described above, optionally together with written instructions.",
                        "Written descriptions in context of the present invention contain information for a user of the diagnostic test how to conduct the assay step by step and further how to interpret the test result.",
                        "In one embodiment the diagnostic kit of the invention is for use in a method for the detection of the presence of Leptospira as described herein, or a method for diagnosing a Leptospira infection as described herein.",
                        "In a fifth aspect the object of the present invention is solved by the use of a diagnostic device according to the herein described invention, or an antibody according to the invention, or a diagnostic kit according to the invention for the diagnosis of leptospirosis, preferably acute leptospirosis.",
                        "It is preferred in the context of the above described embodiments of the present invention that the LFT assay is run for 20 minutes starting from sample addition until the signals of the capture and/or control zones are analysed.",
                        "While the present invention has been described with specificity in accordance with certain of its preferred embodiments, the following examples serve only to illustrate the invention and are not intended to limit the invention within the principles and scope of the broadest interpretations and equivalent configurations thereof."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Leptospirosis or Weil's Disease",
                        "describe pathogen Leptospira",
                        "describe incident rates of Leptospirosis",
                        "describe transmission of Leptospira",
                        "describe symptoms of Leptospirosis",
                        "describe diagnosis of Leptospirosis",
                        "describe limitations of serological tests",
                        "describe limitations of culture isolation",
                        "describe antigen detection",
                        "describe lateral flow tests (LFT)",
                        "describe immunological assays",
                        "describe labelled-antigens or antibodies",
                        "describe IgM antibody-based immune assays",
                        "describe limitations of diagnostic assays",
                        "describe objective of the invention",
                        "describe detection of LipL21 antigen",
                        "describe detection of LipL21 antigen in control sample",
                        "describe sample types",
                        "describe subject types",
                        "describe LipL21 protein",
                        "describe detection of LipL21 by immunological means",
                        "describe antibody types",
                        "describe lateral flow test (LFT) embodiments",
                        "describe competitive LFT assay",
                        "describe non-competitive LFT assay",
                        "describe test line and control line",
                        "describe detection of control line",
                        "describe sample pad material",
                        "describe pre-treatment of sample pad",
                        "describe conjugation zone",
                        "describe conjugation pad material",
                        "describe pre-treatment of conjugation pad",
                        "describe detection zone",
                        "describe test line and control line",
                        "describe absorbance zone",
                        "describe diagnostic device embodiment",
                        "describe antibody-indicator complex",
                        "describe indicator types",
                        "describe detection methodologies",
                        "describe visual inspection of diagnostic device",
                        "describe detection antibodies",
                        "describe control antibodies",
                        "describe concentration of detection antibodies",
                        "describe distance between capture zone and control zone",
                        "describe specificity of diagnostic device",
                        "describe sensitivity of diagnostic device"
                    ],
                    "num_characters": 23447,
                    "outline_medium": [
                        "describe leptospirosis",
                        "discuss pathogen transmission",
                        "describe disease symptoms",
                        "discuss diagnosis challenges",
                        "introduce serological tests",
                        "discuss limitations of serological tests",
                        "introduce antigen detection",
                        "discuss lateral flow tests",
                        "describe immunological assays",
                        "discuss labelled-antigens or antibodies",
                        "introduce IgM antibody-based immune assays",
                        "discuss limitations of current diagnostic assays",
                        "state objective of the invention",
                        "describe LipL21 antigen",
                        "discuss importance of LipL21 in infection process",
                        "introduce other leptospiral specific proteins",
                        "discuss antibodies for leptospires detection",
                        "describe competitive and non-competitive LFT",
                        "discuss test and control lines in LFT",
                        "introduce colloidal gold particles as detectable labels",
                        "discuss detection methodologies",
                        "describe visual inspection of diagnostic device",
                        "discuss control antibodies"
                    ],
                    "outline_short": [
                        "describe leptospirosis disease",
                        "discuss transmission of Leptospira",
                        "outline symptoms of leptospirosis",
                        "describe limitations of current diagnostic tests",
                        "introduce lateral flow tests (LFT)",
                        "explain immunological assays",
                        "discuss importance of early detection",
                        "highlight need for improved diagnostic test",
                        "describe current diagnostic methods",
                        "discuss limitations of current diagnostic methods",
                        "summarize need for improved diagnostic test"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Immunization**",
                                "Antiserum to LipL21 was prepared by immunizing a rabbit with the purified rLipL21 protein as described previously (Shang et al., 1996). In this study, two rabbits were immunized using 100 μg of purified rLipL21. Purified rLipL21 protein was loaded onto SDS-12% polyacrylamide gel and allowed to migrate into the separating gel during electrophoresis. An rLipL21 containing band was excised from the gel and desiccated. Desiccated gel containing recombinant protein were ground to a powder, dissolved in 1 ml of water and mixed with 1 ml of complete Freund's adjuvant (Merck, USA). (Merck). Pre-immune serum was collected before immunization and used as a control in neutralization experiments. The mixture of rLipL21 and complete adjuvant were injected both subcutaneously and intramuscularly on Day 1 into leptospiral antibodies free New Zealand White rabbits. Additional immunizations with the same dosage of the rLipL21 with incomplete Freund's adjuvant (Merck) were done on Day 15 and Day 29. On Day 36 the rabbits were bled by heart puncture and the serum was collected to detect antibodies against LipL21. The LipL21-antiserum was stored in small aliquots at −20° C. until use. Animals were housed in accordance with the ethical principles and experimental procedures with animals were approved by Animal Care and Use Committee of the Faculty of Veterinary Medicine, University Putra Malaysia (AUP No: 09R57/Mac 09-Feb10).",
                                "Purification of IgG from Rabbit Polyclonal Antibody Serum",
                                "These methods effectively purify the main classes of antibodies (IgG, IgM, and IgA). A protocol for affinity chromatography purification of polyclonal antibodies with immunoglobulin class is also provided. However the ion-exchange chromatography is indicated for purifying intact monoclonal and polyclonal antibodies and antibody fragments from different sources. IgG purification from whole serum by using ammonium sulfate precipitation effectively removes other protein contaminations, but they still contain both the specific (to the desired antigen) and non-specific IgG molecules. These nonspecific contaminations can be removed by size-exclusion or ion exchange chromatography. Instead, Protein A, protein G or one of the newer commercial proprietary affinity chromatography columns can be used (Grodzki and Berenstein, 2010).",
                                "To obtain polyclonal purified immunoglobulin, whole serum supernatant was used in Montage Antibody Purification Kits with PROSEP-A (LSK2 ABA 20, Millipore). A schematic representation of the anti-body generation is found in FIG. 1. Immunized rabbit antiserum containing, IgG were purified according to the manufacturer's instructions to Brief, The PROSEP-A media was Pre equilibrated with 10 ml Binding Buffer A by centrifuged the spin column at 500×g for 5 minutes. The serum sample to be loaded to the spin column was prefiltered through a 0.22 μm Steriflip-GP device to remove any debris immediately before loading the sample. The filtered serum sample was diluted with 1:1 v/v in Binding Buffer A. (For example, 10 ml filtered sample was added to 10 ml binding buffer) 20 ml of the sample was allowed to flow through the spin column. The column was spun at 150×g for 20 minutes, unbound contaminants were removed by adding 10 ml Binding Buffer A and the spin column was spun for 2 minutes at 500×g. Above wash procedure was carried out once again. The unbound wash contained non-immunoglobulin components. Finally the rabbit IgG was eluted by adding 10 ml Elution Buffer B2 directly into a fresh centrifuge tube containing 1.3 ml Neutralization Buffer C to bring the sample to neutral pH, by spinning the column for 5 minutes at 500×g. The purified IgG was analyzed for the quality by SDS-PAGE followed by CBB staining. The total immunoglobulin was quantified spectrophotometrically, and ELISA was performed to confirmed reactivity of the IgG towards rLipL21 (FIG. 3). Two micrograms of purified IgG proteins was analyzed for reactivity against rLipL21 and leptospiral OMPs by Western blotting (FIG. 4). The purified IgG proteins were stored at −70° C. for further analysis.",
                                "**Localization of LipL21 Via Detection of Anti-rLipL21IgG:**",
                                "For the investigation of LipL21-localization in Leptospira spp, the leptospiral outer membrane was extracted by the nonionic detergent Triton X-114 phase separation. LipL21 protein was observed in the detergent phase, but not observed in soluble phase (FIG. 5). When 20 mM CaCl2 was added, LipL21 was exclusively in the detergent-phase. LipL21 was found to partition exclusively into the detergent phase. This is in contrast to the results of the immunoblot, where the anti-rLipL21 IgG reacted specifically to the protein having a size corresponding with the molecular mass predicted for LipL21 on detergent phase (FIG. 5). The detergent phase of leptospiral OMP interaction with anti-rLipL21 IgG indeed originated from interactions with leptospiral LipL21. No reactivity was evident at the membrane fractions from non-pathogenic strains.",
                                "**Specificity of Anti-rLipL21 IgG Against Leptospiral LipL21 in Immunoblot:**",
                                "The specificity of antibodies purified from antisera generated in rabbits was first evaluated by immunoblotting against the rLipL21 fusion protein. The purified anti-rLipL21 IgG showed high specificity to their corresponding recombinant antigens. The specificity of the antibodies against each individual leptospiral serovar protein was further evaluated by immunoblotting analyses of Triton X 114 fractionation-separated OMP (FIG. 5). Similarly, antiserum raised against rLipL21 in the rabbit was tested against leptospiral OMP fractions obtained by Triton X 114 method. More importantly, LipL21 from OMP detergent fractions were detected in the tested Leptospira strains by immunoblot, which could be observed at approximately predicted molecular weight 19.6 kDa (FIG. 6), and similarly the lipL21 gene of these strains could be detected by PCR amplification. Pre immune serum (prior to rabbit immunization with purified, recombinant protein) was tested and found not to be reactive with any leptospiral antigens. In immunoblotting analyses, the anti-rLipL21 detects LipL21 from pathogenic Leptospira spp without cross reactivity of particular importance was the fact that anti-rLipL21 IgG did not cross-react with the other bacterial antigens tested. This specificity reduces the possibility of a false positive result in diagnostic kit of the present invention.",
                                "Although the anti-rLipL21 IgG was detected from each of the LipL21 pathogenic Leptospira spp, the intensity of band differed between culture passages. Weak cross-reactions were observed with 3 strains of related serovars (Canicola, Pyrogenes and Grippotyphosa), demonstrating the specificity of the LipL21 antiserum (FIG. 6). LipL21 has strong sequence conservation as is observed in the lipL21 genes of Leptospira spp. The OMP separation used relatively the same amount of leptospiral pathogens for immunoblot. However, the present results of immunoblot showed the anti-rLipL21 IgG, detected a very strong band on the low passage (LP) of Leptospira spp and low intensity band with the high passage (HP) of Leptospira spp.",
                                "However, antibodies against rLipL21 proteins clearly detected leptospiral antigens with anti-rLipL21 being the most sensitive. The anti-rLipL21 IgG reacted very similarly with all pathogenic leptospiral OMP containing detergent fractions, but selectively detecting LipL21 indicating that they may have affinity to the same leptospiral epitope. The polyclonal antibodies can be highly sensitive but less specific then monoclonal antibodies while monoclonal antibodies can be highly specific with less sensitivity (Varma et. al., 2002). Usage of highly sensitive antibody like anti-rLipL21 IgG will give potentially good results in diagnostic kits."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare antiserum to LipL21",
                                "describe immunization protocol",
                                "detail purification of IgG from rabbit polyclonal antibody serum",
                                "outline antibody purification protocol",
                                "describe localization of LipL21 via detection of anti-rLipL21 IgG",
                                "detail detergent phase separation of leptospiral outer membrane",
                                "describe immunoblot analysis of detergent phase",
                                "evaluate specificity of anti-rLipL21 IgG against leptospiral LipL21",
                                "describe immunoblot analysis of Triton X 114 fractionation-separated OMP",
                                "test antiserum against leptospiral OMP fractions",
                                "evaluate cross-reactivity of anti-rLipL21 IgG",
                                "describe differences in band intensity between culture passages",
                                "discuss sensitivity and specificity of anti-rLipL21 IgG",
                                "compare anti-rLipL21 IgG with other antibodies",
                                "discuss potential applications of anti-rLipL21 IgG"
                            ],
                            "num_characters": 7839,
                            "outline_medium": [
                                "prepare antiserum to LipL21",
                                "purify IgG from rabbit polyclonal antibody serum",
                                "localize LipL21 via detection of anti-rLipL21 IgG",
                                "evaluate specificity of anti-rLipL21 IgG against leptospiral LipL21",
                                "detect LipL21 from pathogenic Leptospira spp",
                                "analyze immunoblotting results",
                                "discuss specificity of anti-rLipL21 IgG"
                            ],
                            "outline_short": [
                                "prepare antiserum to LipL21",
                                "purify IgG from rabbit polyclonal antibody serum",
                                "localize LipL21 via detection of anti-rLipL21 IgG"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**Development of Lateral Flow Test Strips**",
                                "**Optimization of Conjugation Between Anti-rLipL21 IgG Antibody and Colloidal Gold**",
                                "Colloidal gold particles were conjugated with polyclonal antibodies and used as detector reagents. The main advantage of using colloidal gold particle is it provides the opportunity to improve LFT strips sensitivity and is less susceptible to aggregation during the preparation of the LFT strips (Chiao et al., 2004). In this rapid test, the colloidal gold particle (40 nm) was conjugated with anti-rLipL21 IgG. The conjugated antibody was directly absorbed on colloidal gold particle surface, mediated by London-Van der Waals force and hydrophobic interaction (Hermanson et al., 1992). Optimal concentration of antibody (0.08-0.1 mg/ml) for the conjugation with colloidal gold was determined by comparing the absorption between 520-580 nm (FIG. 7).",
                                "**Conjugation of Anti-rLipL21 IgG—Colloidal Gold Complexes**",
                                "For conjugation, each purified anti-rLipL21 IgG solution was used in 10% excess of the minimal amount. 100 ml of colloidal gold (pH 9.0) was swiftly added to 10 ml of the abovementioned purified anti-rLipL21 IgG solution with gentle stirring. Then the solution was incubated for 1 hour, and then non specific binding area was blocked with BSA (final concentration 1%) and PEG (final concentration 0.01%) for mixed for 30 minutes to incubate another 1 hour. The mixture was centrifuged (15,000 rpm) at 4° C. for 45 minutes, and the colorless supernatant was carefully aspirated and discarded. Subsequently, the loose sediment of gold-labelled antibody was resuspended with 20 ml of 20 mM PBS, pH adjusted to 9.0 containing 1% BSA and 0.01% PEG, followed by another centrifugation. This procedure was repeated twice to ensure clean up of the free (unlabelled) purified anti-rLipL21 IgG. Finally, the liquid droplet of purified anti-rLipL21 IgG—gold complex was dissolved in 10 ml of 20 mM PBS (pH adjusted to 9.0) involving 10% sucrose, 1% BSA, and 0.01% sodium azide. The gold labelled purified anti-rLipL21 IgG was stored at 4° C. for the next use.",
                                "**Preparation of the Sample Pad**",
                                "The Cellulose Fibre sample pad is a non woven cotton fibre is used as a sample and absorbent pad (Millipore Cellulose Fiber Sample Pads with Lot Number-92090602; 20×300 mm Millipore, Mass., USA) in LFT kit. The properly treated sample pad is compatible with the assay, and releases the analyte very efficiently. The sample pad pre-treatment was carried out using 20 mM phosphate buffer (pH 7.4) containing 0.1% (v/v) Tween 20, and 1% (w/v) BSA was dried at 60° C. and kept in desiccators until use. Sample pad was again treated with 20 mM phosphate buffer (pH 7.4) containing 2% (w/v) BSA, 0.1% (v/v) Tween 20, 3% (w/v) sucrose and 0.02% sodium azide and dried at 37° C.",
                                "**Preparation of the Conjugated Pad**",
                                "The role of the conjugate pad (Millipore Glass Fiber Conjugate Pads with Lot Number-92090602; 20×300 mm Millipore, Mass., USA) in LFT is to allow the conjugate, hold it stable over its entire shelf life, and release it efficiently and reproducibly when the assay is run. The colloidal gold conjugated anti-rLipL21 antibody containing conjugate pad was prepared for immobilization. The anti-rLipL21 antibody labeled colloidal gold conjugate was diluted (1:1 v/v) with 20 mM phosphate buffer (pH 7.4) containing 1% (w/v) BSA, 6% (w/v) sucrose. The conjugate pad pre-treated with 0.1% (v/v) Tween 20 for 24 hrs and dried for 45 minutes at 600 C was immersed into conjugate solution, then lyophilized and store in a desiccator at 40 C until use.",
                                "**Preparation of the Absorbent Pad**",
                                "The high-density cellulose material (Millipore Cellulose Fiber absorbent Pads with Lot Number-92090602; 20×300 mm Millipore, Mass., USA) is used as an absorbent pad. This is designed to absorb the excessive fluid added to the LFT.",
                                "**Preparation of Lateral-Flow Immunoassay Strip**",
                                "The composition of the lateral-flow immunoassay device is shown in FIG. 2. The test device was prepared as follows: The control line of goat anti-rabbit IgG (1 μg) and test line of rabbit anti-rLipL21 IgG (5 μg) (in 50 mM sodium phosphate-buffered saline, pH 7.4) were separately applied near to one end of nitrocellulose membrane (High-Flow plus 180 membrane card 60 mm×301 mm Millipore, Mass., USA) with the help of a micro pipette. The distance between the test line and control line was about 5 mm. The test strips were dried at 37° C. for 30 minutes. Then nitrocellulose membrane was blocked by immersing the strips in PBS containing 1% BSA for 30 minutes at RT. The test strips were washed and dried, and then stored in a desiccator at 4° C.",
                                "The pre-treated sample pad, colloidal gold antibody saturated conjugate pad, nitrocellulose membrane (containing anti-rLipL21 antibody for test line and goat anti-rabbit IgG for control line) and absorption pad were assembled and attached to a plastic backing. The conjugate pad was attached to the top of the membrane with 1-2 mm overlapping on the membrane, and then the sample pad was attached to the top of the conjugate pad in a similar manner. The absorbent pad was attached to the bottom of the membrane with 1-2 mm overlapping on the membrane also. The LFT kit were then enclosed in the plastic box and sealed in the aluminum foil bag containing desiccant gel. The LFT kit was ready for use in the assay and stored under dry conditions at room temperature until use."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "develop lateral flow test strips",
                                "optimize conjugation between anti-rLipL21 IgG antibody and colloidal gold",
                                "describe conjugation protocol",
                                "prepare sample pad",
                                "prepare conjugated pad",
                                "prepare absorbent pad",
                                "assemble and attach components to plastic backing",
                                "describe composition of lateral-flow immunoassay device",
                                "detail preparation of test strips",
                                "store test strips for later use"
                            ],
                            "num_characters": 5427,
                            "outline_medium": [
                                "develop lateral flow test strips",
                                "optimize conjugation between anti-rLipL21 IgG antibody and colloidal gold",
                                "conjugate anti-rLipL21 IgG—colloidal gold complexes",
                                "prepare sample pad, conjugated pad, and absorbent pad",
                                "assemble and attach lateral flow test strips"
                            ],
                            "outline_short": [
                                "develop lateral flow test strips",
                                "optimize conjugation between anti-rLipL21 IgG antibody and colloidal gold"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Use of the LFT Strip**",
                                "The LFT device detection zone containing the rabbit anti-LipL21 IgG and goat anti-rabbit IgG are separately stripped onto test line and control line. The purified anti-LipL21 IgG coated colloidal gold particles react with goat anti-rabbit antibody and can be immobilized in control region, while the LipL21 or leptospires bound purified anti-LipL21 IgG-coated colloidal gold particles react with anti-LipL21 antibody and can be immobilized in test region to form a mobile sandwich complex. The sample was absorbed by the sample pad. Due to capillary forces this mixture moved towards the absorbent pad. In doing so, all remaining active sites of the cellulose nitrate membrane were blocked by BSA and/or Tween-20. If detectable LipL21 was present, a positive test result was achieved, which was visible by the appearance of a coloured test line and control line. The negative result is determined by the appearance of only single line in control region. The visible colour intensity of the test line correlated with the antigen concentration present in the sample. Excess sample that flows beyond the test and control line was taken up by the absorbent pad.",
                                "A portion of blood/serum sample was transferred directly onto the sample pad. The LFT was incubated laterally for 10-15 minutes, and the sample solutions absorbed and immediately dissolved the colloidal gold conjugate, the reaction between the conjugate antibody and LipL21 antigen took place, and this complex was carried forward onto the nitrocellulose membrane containing the capture lines (Test line containing anti-LipL21 IgG and control line containing anti-rabbit IgG). The nitrocellulose membrane containing the second antibody interaction with leptospiral LipL21-conjugated antibody complex would take place. This immune complex observed on the nitrocellulose membrane solid surface and the unbound reagent was subsequently adsorbed by the absorbent pad. When two dark red lines were observed after incubation at test line and the control line, sample evaluation was defined as positive. In the case of observation of only one dark red line at the control line, sample evaluation was defined as negative."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "use LFT strip to detect LipL21",
                                "describe detection zone of LFT strip",
                                "outline procedure for using LFT strip",
                                "interpret results of LFT strip"
                            ],
                            "num_characters": 2198,
                            "outline_medium": [
                                "use LFT strip to detect LipL21",
                                "describe LFT strip detection mechanism"
                            ],
                            "outline_short": [
                                "use of the LFT strip"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Optimization of the LFT Strip**",
                                "**Temperature:**",
                                "The effects of various temperatures on the naked eye values were evaluated. In comparison with 4° C., the values at 26° C., and 37° C. were slightly changed, however, with no significant difference. No obvious changes could be observed at various examined temperatures compared to the test's performance at 4° C. The results indicated that the determination of results of test assay with the naked eye may be affected at the higher temperature.",
                                "**Reading Time:**",
                                "The time for appearance of a dark red color on the test lines was optimized for both positive control and for samples with low concentrations of antigens (FIG. 8). The results were observed after 15-25 minutes. The colloidal gold-labelled antibodies bind to the leptospiral OMP of LipL21 in the capture line (anti-rLipL21 IgG) on the nitrocellulose membrane. If the leptospires levels in the blood samples are negative or below the particular level, the time for the LFT strip to develop a color was 20 minutes. The difference between positive and negative samples could easily be distinguished with the naked eyes. Thus, the LFT strip assay time was standardized to 20 min.",
                                "**Sensitivity:**",
                                "In the present study, the leptospires number and concentration of rLipL21 and capture antibody (anti-rLipL21 IgG) were optimized (FIG. 9). The capture line contains anti-rLipL21 IgG in different concentrations, such as 500 μg/ml 1000 μg/ml, 1500 μg/ml, 3000 μg/ml, 4000 μg/ml, and 5000 μg/ml of anti-rLipL21 IgG (Table 1). The colloidal gold based LFT strips should provide a rapid visual qualitative test which gave a simple reactive or non reactive response to the levels of the target antigens. The cut-off value with the naked eye was defined here as the amount of leptospires and capture antibodies (anti-rLipL21 IgG) in the standard samples that resulted in dark red colour development at the test lines. In accordance with visual evaluation, the cut-off value of capture antibodies (anti-rLipL21 IgG) showed 2000 μg/ml (Table 1).",
                                "The preparation of leptospiral cells comprised centrifugation of cell culture suspensions (>107 cells/ml) at 8000×g for 10 min at 4° C., which was followed by dilution in PBS. Then 200 μl of 106, 105, 104, 103, 102 and 101 dilutions of leptospires were used to determine the copy number of the leptospires in LFT strips (Table 2). In the LFT analyses, the samples containing copy number of leptospires was 104 cells/ml or more displayed positive, similar results were observed by repeating the test using different samples 5 times, indicating the high reproducibility of this experimental system.",
                                "**Specificity:**",
                                "The LFT strips were based on the non-competitive principle, the direct relationship between concentrations of antigens and antibodies in sample and development of dark red colour on the test lines. Therefore, the detection limits of the test strips should be determined by testing the leptospires number in the standard laboratory cultures, minimal concentration of rLipL21 (50 μg, 20 μg, 10 μg, 5 μg, 2 μg, 1 μg) and anti-rLipL21 IgG in the LFT strips (FIG. 9). The intensities of the bands for various concentrations of leptospires on the test lines gradually declined from the strongest band observed at above 10 μg rLipL21.",
                                "To determine the specificity of the LFT strips with standard antigens of Leptospira spp and other bacteria, they were characterized using the LFT strips simultaneously. Clearly, among all of the tested pathogens, leptospires showed strong band on the test and control line, which was not observed on non-pathogenic leptospires (FIG. 10). This suggests that the LFT strips can specifically detect pathogenic leptospira but not others tested, such as K. pneumoniae, P. multocida, Proteus sp, Rhodococcus sp, B. subtilis, S. mutans, S. aureus, S. typhi, P. aeruginosa, and non-pathogenic L. biflexa (Table 1 and 2)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "optimize temperature for LFT strip",
                                "evaluate effect of temperature on LFT strip",
                                "optimize reading time for LFT strip",
                                "evaluate effect of reading time on LFT strip",
                                "optimize sensitivity of LFT strip",
                                "evaluate specificity of LFT strip",
                                "discuss results of optimization experiments"
                            ],
                            "num_characters": 3907,
                            "outline_medium": [
                                "optimize LFT strip conditions (temperature, reading time)",
                                "evaluate sensitivity of LFT strip",
                                "evaluate specificity of LFT strip"
                            ],
                            "outline_short": [
                                "optimize the LFT strip"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Experimental Verification**",
                                "Evaluation of the LFT Strips for Testing Samples from Experimental Infected Hamsters",
                                "The LFT strips were evaluated with blood culture and PCR was performed in the infected hamster's experimental model (Table 3). This animal model condition is as close as possible to those in a natural infection and is infected with serovar Icterohaemorrhagiae, which was isolated from field rat from Malaysia. These kinds of rodents could be one of the animals responsible for the leptospirosis as reported by Vedhagiri et al., (2010) in India. The in vivo efficiency of LFT strips sensitivity revealed that they could detect rLipL21 protein as low as 2 μg within 15 minutes, which was similar to that of Leptospira isolation in infected animal model. Fifteen leptospirosis infected animal models and five uninfected animals as control were tested for the presence of the corresponding leptospires by Leptospira isolation and PCR using lipL21 gene specific primers. The absence of infection was also confirmed by Leptospira isolation. All the LFT strip-positive samples were positive by Leptospira isolation on Day 1 to Day 5 post infections, when no clinical sign was observed in all experimental hamsters (Table 3). During these animal experiments, there were no false positive results with all three methods. With the LFT strips, all infected blood samples were tested positive with the exception of false negative results. Following the hamster infection, their blood samples were longitudinally collected and tested using the LFT strips described in Table 4. Control hamsters did not show positivity for leptospirosis infection throughout the observation period. There were no false positive LFT strips results with control animals.",
                                "The overall sensitivity and specificity of each test results are shown in Table 4. Although the sensitivity of the LFT strips was 73.3% (55/77), it had 100% specificity with infected animal blood samples. Similarly the isolation of leptospires from infected animal model shows 100% specificity with 74.7% (56/75) sensitivity. The LFT strips and the Leptospira isolation both had high sensitivities and specificities. The PCR was the least sensitive of the assays, and the results may be varied by using different primers. Because LipL21 gene specific Leptospira isolation is considered the “gold standard,” all of the infections identified by antigen detection were confirmed to be Leptospira spp by this method.",
                                "**Detection of Leptospires in Blood Using LFT Strips**",
                                "Although leptospirosis is an endemic disease in many countries including Malaysia, cases of leptospirosis often remain underestimated and were treated as fever of unknown causes (El Jalii, et al., 2002). Culture isolation still represents the gold standard of laboratory diagnosis. The sensitivity of culture method could be enhanced by using blood or urine sample from Leptospira infected cases, but making media and maintaining culture still remains an invasive, tedious and time consuming technique, therefore diagnostic kit is generally preferred for acute leptospirosis.",
                                "The LFT strips could effectively detect leptospirosis by Day 1 to Day 4 post infection in hamster model (Table 5 and FIG. 11). The early detection was possible because leptospires grows faster and circulates rapidly in infected animal's blood (Truccolo et al., 2002). The LFT strips specificities and negative predictive values were observed at 100% in the infected animal models. The LFT strips have thus proven to be a useful method for diagnosis of acute leptospirosis. Leptospiral infection is difficult to diagnose by presence of symptoms alone. The overall sensitivity of the LFT strips was 73.3% (Table 4). This percentage is higher than any other diagnostic kit response of early stage of infection as reported by Effler et al., (2002).",
                                "Leptospira Isolation from Infected Animals",
                                "Culture of blood is the most frequent means of diagnosing leptospiremia. Analyses of Leptospira isolation revealed that leptospires identification is proof of infection. In this study, use of blood culture in EMJH medium for the leptospires presence in the blood is compared with the relative sensitivity, specificity and efficiency of LFT strips. All infected animal blood samples were inoculated into the EMJH medium, incubated aerobically and protected from light, at room temperature (25°-30° C.) for two months, and examined weekly for 45 days, then every five days for a further 30 days. Examination of the cultures was done by placing one drop of culture onto a microscopic glass slide and observe under dark-field microscopy at 200× magnification. The results are considered positive if leptospires are observed under the darkfield microscopy (Table 6).",
                                "Detection of Leptospires (or DNA) in Blood Using lipL21 Gene Specific Primer-Based PCR",
                                "Since the culture of Leptospira is difficult and not done in most of the research and clinical laboratories, determination of this bacterium in blood has been widely performed using the PCR technique even though there is no standardized PCR method for detection of Leptospira. PCR analysis of leptospirosis, which was considered as one of confirmatory methods for identification and quantification of leptospires, was performed with fifteen infected hamster animal models in, parallel with the LFT strips. The observed results were conformed to three repeated tests. The PCR assay using infected animal blood samples was done with lipL21 gene specific primers. An amplified leptospiral DNA was found in some infected animal models (Table 7). The results of PCR in the detection of leptospires in blood samples was considered as positive when the amplified product was observed on agarose gel visualized under UV light (FIG. 13).",
                                "**Sensitivity, Specificity and Accuracy Values (PPV and NPV) and Efficiency of LFT Strips**",
                                "An evaluation of LFT strip method for the diagnosis of acute leptospirosis was undertaken by comparison with laboratory-produced techniques employing Leptospira isolation and PCR on leptospires infected animal model. Culturing Leptospira is the traditional method for isolation and identification of leptospires. The results of LFT and PCR in the detection of leptospires from infected animal model were compared to the growth of leptospires in EMJH semi-solid medium. Results were either positive or negative leptospiral infection and were observed on Day 1, Day 2, Day 3, Day 4 and Day 5 (Table 4).",
                                "The LFT strips were compared with the other tests: Leptospira isolation and PCR. The LFT strips did not show any false positive results. From these results, the sensitivity and specificity of LFT strips were compared with the other tests (Table 8 and Table 9).",
                                "The performance of LFT versus culture isolation is shown in Table 8. Fifteen samples from infected animal models were positive for Leptospira on isolation by cultures and were positive by LFT. Compared with culture isolation, sensitivities for LFT were 100% on Day 1 to Day 5. All samples negative on Leptospira cultures were negative by LFT for 5 days. However, specificity was 83.3% on Day 1, 71.4% on Day 2, 62.5% on Day 3, 38.5% on Day 4, and 100% on Day 5. The PPV, NPV and efficiency were all significantly higher when compared with the respective values of PCR (Table 9). In all 15 samples that showed positive reaction for Leptospira by LFT strips were also positive by blood culture was for leptospirosis. Furthermore, the Leptospira infection not detected by PCR, not all had low leptospiremia. The PCR application to blood samples has many potential drawbacks due to the susceptibility of PCR to inhibitors, contamination and experimental conditions. For instance, it is known that the sensitivity and specificity of a PCR assay is dependent on target genes, primer sequences, PCR techniques, DNA extraction procedures, and PCR product detection methods.",
                                "The result of Leptospira isolation in the detection of leptospires in animal models was considered as positive when the leptospires were visualized under dark field microscope. The relative sensitivity, specificity and predictive values of LFT strips with Leptospira isolation were compared for Day 1-5 post infection (Table 5 and FIG. 12). The sensitivity of LFT strips increased from 60% in the first day to 100% during next 3-4 days. FIG. 13 shows the positivity rates (sensitivity) of lateral flow at different durations post infection: it was 60% on Day 1, 80% on Day 2, 93.3% on Day 3, 100% on Day 4 and 33.3% on Day 5. The test was done to detect leptospires on the same day of collection of the blood samples. The specificity did not show large variations between Day 2-4. LFT sensitivity decreased to 33.3% on the Day 5. The high sensitivity results were observed on Day 1-4 after infection of the hamster model. The high agreement between LFT and culture methods suggests that LFT strips can be particularly important in acute leptospirosis where there were clinical signs and symptoms but absence of antibodies (negative serological results), and thereby allowing early and rapid confirmation of the disease.",
                                "There were also significant discrepancies between antigen detection in LFT and between Leptospira isolation. Hence, the LFT strip can detect early leptospiral infection in hamsters. Notably, the positive rates of the detection of leptospires in this experimental model gradually declined with time. On Day 5 post infection, this may reflect specific antibody-mediated leptospires clearance to respond to the humoral immunity (Guerreiro et al., 2001).",
                                "**Reproducibility of LFT Strips Detection Method**",
                                "Leptospira isolation and PCR analysis, which were considered as important confirmatory methods for identification of leptospires, were performed to identify the leptospires from 15 Leptospira infected animal models in parallel with the LFT strips.",
                                "In all countries except the US & Malaysia a patent application must be filed before the first public disclosure or offer for sale of the invention. However in US & Malaysia, a patent application may be filed within one year of the first public disclosure or offer for sale of the invention"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "evaluate LFT strips with infected hamster model",
                                "describe experimental design",
                                "introduce Leptospira isolation method",
                                "describe PCR analysis",
                                "present results of LFT strips evaluation",
                                "discuss sensitivity and specificity of LFT strips",
                                "compare LFT strips with Leptospira isolation",
                                "compare LFT strips with PCR analysis",
                                "discuss advantages of LFT strips",
                                "describe detection of leptospires in blood using LFT strips",
                                "discuss limitations of culture isolation",
                                "introduce LFT strips as diagnostic kit",
                                "describe Leptospira isolation from infected animals",
                                "describe detection of leptospires (or DNA) in blood using PCR",
                                "present sensitivity, specificity, and accuracy values of LFT strips",
                                "compare performance of LFT strips with culture isolation",
                                "compare performance of LFT strips with PCR",
                                "discuss reproducibility of LFT strips detection method",
                                "discuss importance of early detection of leptospirosis",
                                "note patent application requirements"
                            ],
                            "num_characters": 10161,
                            "outline_medium": [
                                "evaluate LFT strips with infected hamster model",
                                "describe experimental design and methods",
                                "present results of LFT strips evaluation",
                                "compare LFT strips with Leptospira isolation and PCR",
                                "discuss sensitivity and specificity of LFT strips",
                                "describe detection of leptospires in blood using LFT strips",
                                "discuss Leptospira isolation from infected animals",
                                "describe detection of leptospires (or DNA) in blood using PCR",
                                "present sensitivity, specificity, and accuracy values of LFT strips",
                                "discuss reproducibility of LFT strips detection method"
                            ],
                            "outline_short": [
                                "evaluate LFT strips with infected hamster model",
                                "compare LFT strips with Leptospira isolation and PCR",
                                "determine sensitivity and specificity of LFT strips",
                                "discuss advantages of LFT strips over other diagnostic methods",
                                "note patent application requirements"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for the detection of the presence of Leptospira in a sample, comprising the steps of\na) providing a sample to be analyzed,\nb) detecting the presence of LipL21 in the said sample,\nc) optionally, detecting the presence of LipL21 in a control sample, wherein the presence of LipL21 in the said sample is indicative for the presence of Leptospira.",
        "2. (canceled)",
        "3. The method according to claim 2, wherein the sample is a biopsy or a liquid sample.",
        "4. The method according to claim 1, wherein the sample is from a bird, amphibian, reptile or mammal.",
        "5. The method according to claim 1, wherein LipL21 is detected in step b) by immunological means.",
        "6. (canceled)",
        "7. The method according to claim 1, wherein the detection in step b) is performed using a lateral flow test (LFT).",
        "8. The method according to claim 7, wherein the LFT is a non-competitive LFT.",
        "9. (canceled)",
        "10. A diagnostic device for detecting the presence of Leptospira in a sample, wherein the diagnostic device comprises:\na) a sample addition zone,\nb) a conjugation zone, comprising an antibody-indicator complex,\nc) a detection zone, comprising a zone of immobilized detection antibodies (capture line) and, optionally, a control zone of immobilized control antibodies, wherein the detection antibodies are anti-LipL21 antibodies,\nd) optionally, an absorbance zone for absorbing excess sample fluid.",
        "11. The diagnostic device according to claim 10, wherein zones a) to d) are arranged successively from proximal to distal, on a strip, wherein the sample fluid can move from zone a) to zone d) by capillary forces.",
        "12. The diagnostic device according to claim 10, wherein the antibody-indicator complex is an anti-LipL21 antibody.",
        "13-14. (canceled)",
        "15. The diagnostic device according to claim 10, wherein the zone of immobilized detection antibodies (capture line) contains the antibody in a concentration of between 500 μg/ml to 10000 μg/ml.",
        "16. (canceled)",
        "17. The diagnostic device according to claim 10, wherein the distance between the capture zone and the control zone is about 5 mm.",
        "18. The diagnostic device according to claim 10, wherein the diagnostic device can detect 104 cells/ml of Leptospira in the sample to be analyzed.",
        "19. The diagnostic device according to claim 10, wherein the diagnostic device detects specifically Leptospira.",
        "20. The diagnostic device according to claim 10, wherein the diagnostic device detects specifically pathogenic Leptospira and not non-pathogenic Leptospira.",
        "21. A method for diagnosing a Leptospira infection, the method comprising the steps of providing a sample from a subject to be diagnosed, and adding the sample to a diagnostic device according to claim 10, wherein the visual appearance of the capture line is indicative for a Leptospira infection.",
        "22-23. (canceled)",
        "24. The method according to claim 21, wherein the subject to be diagnosed is within Day 1 to Day 7 of Leptospira infection.",
        "25-28. (canceled)",
        "29. An antibody specific for Leptospira, wherein the antibody binds specifically to the protein LipL21.",
        "30. The antibody according to claim 30, wherein the antibody is polyclonal rabbit antibody.",
        "31. (canceled)",
        "32. A diagnostic kit, comprising a diagnostic device according to claim 10, optionally together with written instructions.",
        "33-34. (canceled)",
        "35. The device according to claim 10, wherein the diagnostic device detects specifically Leptospira and wherein the diagnostic device does not detect any one of the pathogens selected from the group consisting of Klebsiella. pneumoniae, Pasteurella multocida, Proteus sp, Rhodococcus sp, Bacillus subtilis, Streptococcus mutans, Staphylococcus aureus, Salmonella typhi and Pseudomonas. aeruginosa."
    ]
}