{
    "id": "https://semopenalex.org/work/W1985898684",
    "authors": [
        "Jun Chen",
        "Mei Sun",
        "Gerold Bepler",
        "Saı̈d M. Sebti",
        "Donghwa Kim",
        "Lili He",
        "Qinghua Zhou",
        "Jin Q. Cheng",
        "X. F. Sun"
    ],
    "title": "A Small Molecule Inhibits Akt through Direct Binding to Akt and Preventing Akt Membrane Translocation",
    "date": "2010-03-01",
    "abstract": "The Akt pathway is frequently hyperactivated in human cancer and functions as a cardinal nodal point for transducing extracellular and intracellular oncogenic signals and, thus, presents an exciting target for molecular therapeutics. Here we report the identification of a small molecule Akt/protein kinase B inhibitor, API-1. Although API-1 is neither an ATP competitor nor substrate mimetic, it binds to pleckstrin homology domain of Akt and blocks Akt membrane translocation. Furthermore, API-1 treatment of cancer cells results in inhibition of the kinase activities and phosphorylation levels of the three members of the Akt family. In contrast, API-1 had no effects on the activities of the upstream Akt activators, phosphatidylinositol 3-kinase, phosphatidylinositol-dependent kinase-1, and mTORC2. Notably, the kinase activity and phosphorylation (e.g. Thr(P)308 and Ser(P)473) levels of constitutively active Akt, including a naturally occurring mutant AKT1-E17K, were inhibited by API-1. API-1 is selective for Akt and does not inhibit the activation of protein kinase C, serum and glucocorticoid-inducible kinase, protein kinase A, STAT3, ERK1/2, or JNK. The inhibition of Akt by API-1 resulted in induction of cell growth arrest and apoptosis selectively in human cancer cells that harbor constitutively activated Akt. Furthermore, API-1 inhibited tumor growth in nude mice of human cancer cells in which Akt is elevated but not of those cancer cells in which it is not. These data indicate that API-1 directly inhibits Akt through binding to the Akt pleckstrin homology domain and blocking Akt membrane translocation and that API-1 has anti-tumor activity in vitro and in vivo and could be a potential anti-cancer agent for patients whose tumors express hyperactivated Akt.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Cell Lines, Compounds, and Plasmids-All cell lines used in this study were either purchased from the ATCC or described previously (19 -21). All 2300 compounds were from the NCI/ DTP Open Chemical Repository (nci.nih.gov). HA-tagged Akt1, AKT2, and AKT3 expression plasmids have been described previously (21). Wild-type human AKT1 construct was created by reverse transcription-PCR using MCF10A RNA as the template. The PCR products were cloned to BamH1-EcoRI sites of pCMV-Myc-Tag2 vector (Stratagene). The AKT1 primers used for PCR were: forward, 5Ј-ATGAGC-GACGTGGCTATTGTGAAGG-3Ј, and reverse, 5Ј-CTCGC-CCCCGTTGGCGTACTCC-3Ј. AKT1-E17K plasmid was obtained by converting G to A at nucleotide 49 of wild-type AKT1 using the QuikChange site-directed mutagenesis kit (Stratagene). GFP-Akt and GFP-PH domain expression plasmids were created by ligation of Akt and Akt-PH cDNAs into pEGFP-C1 vector (Clontech).",
                "Screening for Inhibition of Akt-transformed Cell Growth-AKT2-transformed NIH3T3 cells or LXSN vector-transfected NIH3T3 control cells (19) were plated into a 96-well tissue culture plate. After treatment with 5 M concentrations of each compound, cell growth was detected with a CellTier 96 One Solution Cell Proliferation kit (Promega). Compounds that inhibit growth in AKT2-transformed but not LXSN-transfected NIH3T3 cells were considered as candidates of Akt inhibitors and subjected to further analysis.",
                "In Vitro Protein Kinase and Apoptosis Assays-In vitro kinase was performed as previously described (20,21). Apoptosis was detected with annexin V (BD Biosciences), which was performed according to manufacturer's instruction. Recombinant Akt and PDK1 were purchased from Upstate Biotechnology, Inc. API-1 and Akt Protein Binding Assay-The assay for API-1 binding to Akt was performed essentially as previously described for other kinase inhibitors that contain an amino group (22)(23)(24). API-1 was immobilized on Sepharose beads (GE Healthcare) through covalent linkage using its amino group (Fig. 1A). Briefly, NHS-activated Sepharose (1 ml) was equilibrated in DMSO and then incubated with 1 mM API-1 and 100 mM triethylamine (the ratio of volumes for coupling solution/ Sepharose beads is 0.5:1). The coupling reaction was allowed to proceed on an end-over-end shaker for 16 h. Free NHS groups were blocked with 0.8 M aminoethanol and then alternated washing with two buffers (0.1 M Tris-HCl, pH 8.0, and 0.1 M acetate, 0.5 M NaCl, pH 4.0) (22,23). The coupled affinity Sepharose beads were incubated with 400 ng of recombinant Akt1 (Upstate Biotechnology) or GST fusion proteins (e.g. GST-PH, GST-KD (kinase domain), or GST-CT (C terminus) of Akt) overnight at 4 °C in buffer containing 50 mM Tris-HCl, pH 7.5, 50, 100, or 150 mM NaCl, 0.2% Nonidet P-40, 5% glycerol, 1.5 mM MgCl 2 , 25 mM NaF, 1 mM Na3VO4, 1 mM phenylmethylsulfonyl fluoride, 1 mM dithiothreitol, 2 g/ml leupeptin, 2 g/ml aprotinin. Subsequently, the beads were washed with the same buffer for 4 times and eluted by heat-denaturing with the sample buffer. Binding protein was separated by 10% SDS-PAGE and immunoblotted with anti-Akt1 and -GST antibodies. NHS-activated Sepharose beads coupling with unrelated compound (BMS-354825) was used as a negative control and compound E (a pan-kinase inhibitor) as a positive control. Both compounds contain an amino group.",
                "Anti-tumor Activity in the Nude Mouse Tumor Xenograft Model-Tumor cells were harvested, resuspended in phosphate-buffered saline, and injected subcutaneously into the right and left flanks (2 ϫ 10 6 cells/flank) of 8-week-old female nude mice as reported previously (21). When tumors reached about 100 mm 3 , animals were randomized and dosed intraperitoneal with vehicle or drug daily. Control animals received DMSO (20%), and treated animals were injected intraperitoneal with API-1 (10 mg/kg/day) in 20% DMSO."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS AND DISCUSSIONS",
            "paragraphs": [
                "Identification of a Small Molecule Akt/PKB Inhibitor-1 (API-1)-The fact that aberrant activation of the Akt pathway occurs in almost 50% all the human malignancy (15,16) and inhibition of Akt induces cell growth arrest and apoptosis prompted industry and academia to develop Akt inhibitors as anti-cancer drugs (25,26). Although several Akt inhibitors have been reported, many lack anti-tumor activity in vivo. A lipidbased non-selective Akt inhibitor, perifosine, has been evalu-ated in phase I and II studies (27,28). However, in neither study was modulation of Akt assessed. A recent phase II study of perifosine in pancreatic cancer was terminated as a result of unacceptable adverse events during the first stage (29). Therefore, there is an unmet need to develop potent and selective Akt inhibitors that are void of inhibiting other kinase activities with minimal adverse effect. To identify small a molecule inhibitor(s) of Akt, we have evaluated 2300 compounds from the NCI/DTP Open Chemical Repository for agents capable of inhibition of growth of AKT2-transformed but not empty vector LXSN-transfected NIH3T3 cells as described under \"Experimental Procedures.\" Triple experiments showed that 32 compounds inhibited growth only in AKT2-transformed cells. We previously characterized one of them, named API-2/triciribine, which is a pan-FIGURE 3. API-1 does not interfere with PI3K, PDK1, and mTORC1/2 complexes. A, an in vitro PI3K kinase assay is shown. HEK293 cells were serum-starved and treated with API-1 (10 M) or wortmannin (1 nM) for 30 min before EGF stimulation. Cells were lysed and immunoprecipitated with anti-p110␣ antibody. The immunoprecipitates were subjected to an in vitro kinase assay using phosphatidylinositol 4-phosphate as substrate. PI 3,4-P2, phosphatidylinositol 3,4-diphosphate; PI kinase, PI3K. B, the effect of API-1 on PDK1 activation is shown. An in vitro kinase assay was performed with PDK1 kinase kit (Upstate Biotechnology) according to the manufacturer's instructions in the presence of the indicated compounds. C, API-1 does not affect p-PDK1-Ser 241 . OVCAR3 cells were treated with PDK1 inhibitor (UCN-01) or API-1 and immunoblotted with indicated antibodies. D, mTORC1/2 complexes were not affected by API-1. OVCAR3 cells were treated with API-1 for 1 h and immunoprecipitated (IP) with anti-mTOR antibody. The immunoprecipitates were immunoblotted (IB) with anti-Rictor, -Raptor, and -mTOR antibodies (panels 1-3). Panels 4 and 5 are immunoblots of total cell lysate with anti-pmTOR and -pAkt antibodies.",
                "Akt inhibitor, with anti-tumor activity in vitro and in vivo and currently in phase I clinic trial (21).",
                "In the present study we characterized a second Akt inhibitor, API-1. API-1 specifically inhibits the kinase activity and phosphorylation (Thr(P) 308 and Ser(P) 473 ) levels of Akt in living cells. Fig. 1A shows the chemical structure of API-1 (Cancer Chemotherapy National Service Center (NSC) 177223; pyrido[2,3-d]pyrimidines), which is structurally related to the antibiotic sangivamycin (30). Although the sangivamycin has been shown to have anti-tumor activity (31)(32)(33), NSC 177223/ API-1 has not been tested in cancer cells including NCI 60 cell lines (nih.gov). Because API-1 inhibited AKT2-transformed cells over untransformed parental cells, we first examined whether API-1 is an inhibitor of AKT2 kinase and whether it also inhibits the other two members of Akt family. HEK293 cells, which are commonly used to robustly express the protein of interest, were transfected with HA-tagged wild-type Akt1, AKT2, and AKT3. After serum starvation overnight, cells were treated with API-1 for 60 min before EGF stimulation and immunoprecipitated with anti-HA antibody. The immunoprecipitates were subjected to in vitro kinase assay. Fig. 1B shows that API-1 inhibited EGF-induced kinase activity of Akt1, AKT2, and AKT3.",
                "We next examined if API-1 decreases phospho-Akt levels in living cells. OVCAR3 cells, which express elevated levels of phospho-Akt, were treated with different doses of API-1 for 3 h. Immunoblotting analysis with anti-phospho-Akt-S473 antibody showed that API-1 efficiently reduced the phosphorylation levels of Akt with an IC 50 of ϳ0.8 M. However, total Akt levels were not changed (Fig. 1C). Furthermore, we examined if API-1 directly inhibits Akt kinase activity in vitro. Recombinant constitutively active Akt protein was incubated with Akt/SGK substrate peptide (Upstate Biotechnology) in a kinase buffer containing different amounts of API-1 and compound E, a pankinase ATP-competitive inhibitor as positive control. Triple experiments showed that API-1 did not reduce in vitro Akt kinase activity at concentrations that inhibit pAkt in cell culture, whereas a high dose (e.g. 50 M) of API-1 decreased Akt activity about 20% (Fig. 1D), suggesting that API-1 functions neither as ATP nor substrate competitor.",
                "API-1 Directly Binds to Akt Protein and Inhibits Akt Membrane Translocation-To explore the mechanism by which API-1 inhibits Akt, we performed a protein kinase-compound binding assay because API-1 contains an amino group that has been shown to bind to NHS-activated Sepharose (22)(23)(24). After immobilization, compound-bound Sepharose beads were incubated with recombinant Akt protein. After washing and elution, the products were immunoblotted with an anti-Akt antibody. Fig. 2A shows that API-1 and compound E (positive control), but not BMS-354825 (negative control), pulled down Akt. To define the domain(s) of Akt that interacts with API-1, we generated GST-PH, -KD, and -CT fusion proteins and incubated them with API-1. Immunoblotting analysis of the eluted products revealed that the PH domain of Akt bound to API-1 in a buffer containing 50, 100, or 150 mM NaCl (Fig. 2B).",
                "Because Akt activation is initiated by PH domain binding to phosphatidylinositol 3,4,5-trisphosphate in the cell membrane, we reasoned that API-1 inhibits Akt through blockage of its membrane translocation. To this end, HeLa cells, which are commonly used for immunofluorescence staining, were transfected with Myc-Akt and then treated with or without API-1 for 30 min before stimulation with IGF1. Immunofluorescence staining revealed that Akt membrane translocation induced by IGF1 was abrogated by API-1 (Fig. 2C). To further demonstrate API-1 inhibition of Akt through targeting the PH domain, we transfected HeLa cells with the GFP-Akt and GFP-PH domain of Akt. Before stimulation with IGF1, cells were treated with and without API-1 for 1 h and examined under a fluorescence microscope. Fig. 2D shows that IGF1-induced GFP-Akt, and GFP-PH membrane translocation was largely attenuated by API-1. Moreover, endogenous AKT2 membrane translocation induced by EGF was also inhibited by API-1 (supplemental Fig. S1). Collectively, these findings indicate API-1 inhibition of Akt through binding to the Akt-PH domain and blocking Akt membrane translocation.",
                "API-1 Does Not Inhibit Upstream Activators of Akt-Akt is activated by extracellular stimuli and intracellular signal molecules through a PI3K-dependent manner. Activation of PI3K will activate PDK1 leading to induction of Akt kinase activity. Therefore, API-1 inhibition of Akt could result from targeting upstream regulators of Akt, such as PI3K and PDK1. To this end, we examined if API-1 inhibits PI3K and/or PDK1. HEK293 cells were serum-starved and then treated with API-1 or PI3K inhibitor, wortmannin, for 1 h before EGF stimulation. PI3K was immunoprecipitated with anti-p110␣ antibody. The immunoprecipitates were subjected to in vitro PI3K kinase assay using phosphatidylinositol 4-phosphate as a substrate. As shown in Fig. 3A, the EGF-induced PI3K activity was inhibited by wortmannin but not by API-1.",
                "To evaluate the effect of API-1 on PDK1, we performed an in vitro PDK1 kinase assay using SGK as a readout (Upstate Biotechnology). Unlike PDK1 inhibitor UCN-01 (34), API-1 had no effect on in vitro PDK1 kinase activity (Fig. 3B). To further evaluate the effect of API-1 on PDK1 activation in living cells, we examined the phosphorylation level of PDK1-Ser 241 , a residue that is autophosphorylated and is critical for its activation (35). After API-1 treatment of OVCAR3 cells, immunoblotting analysis shows that phosphorylation levels of PDK1 were inhibited by UCN-01 but not API-1 (Fig. 3C).",
                "In addition to PDK1, Rictor-mTOR (mTORC2) complex activates Akt by phosphorylation of Ser 473 , whereas Raptor-mTOR (mTORC1) negatively regulates Akt by phosphorylation of IRS1 (10,37). Because API-1 did not inhibit PDK1, we next examined whether mTORC1 and mTORC2 complexes are affected by API-1. Co-immunoprecipitation and immunoblotting experiments show that API-1 had no effects on the interaction of Rictor-mTOR and Raptor-mTOR, whereas it inhibits phospho-mTOR-S2841 (Fig. 3D), which is resulted from inhibition of Akt-TSC2-Rheb-mTOR cascade (11). These finding further suggest that API-1 directly inhibits Akt.",
                "API-1 Is Selective for the Akt over the AGC Kinase Members PKA, PKC, and SGK and Other Signaling Molecules ERK, JNK, p38, and STAT3-In addition to Akt, the AGC (PKA/PKG/ PKC) kinase family also includes PKA, PKC, SGK, p90 ribosomal S6 kinase, p70 S6K , mitogen-and stress-activated protein kinase, and PKC-related kinase. The protein structures of PKA, PKC, and SGK are much closer to Akt kinase than other members. Therefore, we next examined the effects of API-1 on the enzymatic activities of these three kinases. In vitro PKA and SGK kinase assays were performed by preincubation of increasing doses of API-1 or the indicated PKA and SGK inhibitors with recombinant PKA or SGK protein for 30 min before adding Kemptide (Leu-Arg-Arg-Ala-Ser-Leu-Gly) or SGK substrate peptide and [␥-32 P]ATP. Fig. 4, A and B, show that the kinase activities of PKA and SGK were inhibited by PKAI and compound E, respectively, but not by API-1. In addition, we carried out an in vitro SGK kinase assay in HEK293 cells, which were transfected with HA-tagged SGK, which showed that EGF-induced SGK kinase activity was attenuated by wortmannin but not API-1 (Fig. 4C). To evaluate the effect of API-1 on the PKC and PKA activation in living cells, OVCAR3 cells were treated with the indicated doses of API-1 or a specific inhibitor of PKC and PKA, and immunoblotting analysis revealed that phosphorylation levels of PKC and PKA were not inhibited by API-1 (Fig. 4D).",
                "To determine whether API-1 has effects on other oncogenic survival pathways, OVCAR3 cells were treated with API-1 (10 M) for different times and immunoblotted with commercially available anti-phospho-antibodies. We did not observe detectable changes of phosphorylation levels of Stat3, JNK, p38, and ERK1/2 after API-1 treatment (Fig. 4E). These data suggest that API-1 is a specific Akt inhibitor."
            ],
            "subsections": [
                {
                    "title": "FIGURE 5. API-1 inhibits constitutively active Akt and its downstream targets.",
                    "paragraphs": [
                        "A, API-1 inhibited constitutively active Akt. HEK293 cells were transfected with HA-myr-Akt1, HA-Akt1-E40K, and HA-myr-AKT2. After treatment with API-1 for 1 h, cells were lysed and immunoprecipitated with anti-HA antibody. The immunoprecipitates were subjected to in vitro kinase assay (top) and immunoblotting with the indicated antibodies (middle and bottom panels). Note that the second lane from the left (lane 2) shows no significant change of pAkt as compared with lane 1 (middle panel), which is due to higher expression of myr-Akt1 in the transfection (bottom panel). B, kinase activity and phospho-Thr 308 and -Ser 473 of AKT1-E17K were inhibited by API-1. Myc-tagged human WT AKT1 and AKT1-E17K were introduced into HEK293 cells. After serum starvation overnight, the cells were treated with API-1 at indicated concentration for 1 h. After EGF stimulation of WT-AKT1-transfected cells for 30 min, the cells were subjected in vitro kinase and immunoblotting analysis as described in panel A. C and D, API-1 inhibited downstream targets of Akt. OVCAR3 and H661 cells were treated with API-1 (10 M) and immunoblotted with the indicated antibodies. GSK3␤, glycogen synthase kinase 3. E-G, API-1 is more potent than API-2. HEK293 cells were transfected with wild-type Myc-AKT1 (E) and constitutively active myc-AKT1-E17K (F). After 36 h incubation, cells were serum-starved overnight. WT-AKT1-transfected cells were treated with API-1 (left) or API-2 (right) for 30 min and subsequently stimulated with EGF for 15 min. Immunoprecipitation was carried out with anti-myc antibody, and the immunoprecipitates were subjected to in vitro kinase assay (top). Akt kinase activity was quantified (middle). The bottom panels show expression of transfected plasmids. The experiments were repeated three times. Shown is a Western blot analysis of pAkt (G) in HEK293 cells that were transfected with Myc-AKT1 and Myc-AKT1-E17K and treated with or without API-1 or API-2 at the indicated doses for 1 h. API-1 Inhibits Constitutively Active Akt, Including Naturally Occurring Mutant AKT1-E17K and Its Downstream Targets-Because API-1 abrogates kinase activity and phosphorylation of Akt in living cells and binds to the PH domain of Akt, we assumed API-1 may inhibit Akt1E40K and Akt1E17K but not Myr-Akt as Glu 40 and Glu 17 locate in the PH domain, whereas myristoylation (myr) could directly bind to membrane. To this end we transfected HEK293 cells with HA-tagged myr-Akt1, myr-AKT2, and Akt1E40K and myc-tagged AKT1E17K. After serum starvation overnight, cells were treated with or without API-1. Akts were immunoprecipitated with anti-HA or antimyc antibody. The immunoprecipitates were subjected to in vitro kinase assay and immunoblotting analysis with anti-phospho-Akt-Thr 308 antibody. Unexpectedly, API-1 inhibited all four forms of constitutively active Akt (Fig. 5, A and B), suggesting that API-1 also interferes with myristoylation signal by binding to Akt. Nevertheless, API-1 inhibition of AKT1-E17K is clinically significant because the E17K mutation, which was detected in human tumors, leads to constitutively activation of AKT1 through aberrant pathological localization to the plasma membrane (18). An allosteric Akt kinase inhibitor AKT1/2 inhibitor VIII (22) could not efficiently inhibit AKT1-E17K (18)."
                    ],
                    "subsections": []
                },
                {
                    "title": "API-1 Inhibits Tumor Growth in Vitro and in Vivo",
                    "paragraphs": [
                        "Akt exerts its cellular function through phosphorylation of a number of proteins (6,14). Thus, we next examined whether API-1 inhibits downstream targets of Akt. Because glycogen synthase kinase 3␤, mTOR/p70 S6K , Bad, and FOXO3a are major Akt targets, we treated OVCAR3 and H661 cells and evaluated the effects of API-1 on phosphorylation levels of these targets. After treatment with API-1, immunoblotting analysis revealed that API-1 inhibited their phosphorylation (Fig. 5, C andD).",
                        "We previously reported an Akt inhibitor, API-2/triciribine (21), which is currently in clinical trial (38). We next compared the potency of API-1 and API-2 in inhibition of Akt. HEK293 cells were transfected with wild-type (WT)-AKT1 and constitutively active AKT-E17K. After treatment with or without API-1 or API-2 and EGF, in vitro kinase and immunoblotting analyses revealed that API-1 is more potent than API-2 in inhibition of both growth factor-induced Akt and constitutively active Akt (Fig. 5, E-G).",
                        "API-1 Suppresses Cell Growth and Induces Apoptosis Selectively in Akt-overexpressing/activating Human Cancer Cell Lines-Accumulated studies have shown that cancer cells with an elevated Akt exhibit more resistance to chemotherapeutic drug-induced apoptosis, whereas knockdown of Akt sensitizes cells to the programmed cell death (39 -41). The ability of API-1 to selectively inhibit the Akt suggests that it should inhibit cell survival and growth preferentially in those tumor cells with aberrant expression/activation of Akt. To test this, API-1 was used to treat the cells that express constitutively active Akt, caused by overexpression of Akt (OVCAR3, OVCAR8, MCF7, and PANC1) or mutations of the PTEN gene (MDA-MB-468) and cells that do not contain hyperactivated Akt (OVCAR5, MDA-MB-435s, and COLO357). Immunoblotting analysis shows that phosphorylation levels of Akt were significantly inhibited by API-1 in the cells expressing elevated Akt, whereas phospho-Akt was also reduced by API-1 in the cell lines exhibiting low levels of Akt (Fig. 6A and data not shown). However, API-1 induces poly(ADP-ribose) polymerase (PARP) cleavage and inhibits cell growth to a much higher degree in cells with hyperactivated Akt as compared with those with low levels of activated Akt (Fig. 6, A and B). API-1 (10 M) treatment inhibited cell proliferation by approximate 50 -70% in Aktoverexpressing/activating cell lines, OVCAR3, OVCAR8, MDA-MB-468, and MCF7 but only by about 10 -30% in OVCAR5 and MDA-MB-435s cells (Fig. 6B). Moreover, API-1 induces apoptosis by 9-and 4.3-fold in OVACAR3 and MDA-MB-468, respectively, whereas much less apoptosis was observed in API-1-treated OVCAR5 and MDA-MB-435s cells (Fig. 6C). In addition, we have introduced wild-type Akt1 and active mutant AKT1-E17K into Akt1-knock out mouse embryonic fibroblasts. After treatment with API-1, the AKT1-E17K cells underwent apoptosis more than the mouse embryonic fibroblasts transfected with WT-Akt1 (Fig. 6D). These results indicate that API-1 inhibits cell growth and induces apoptosis preferentially in the cells that express aberrant Akt.",
                        "API-1 Inhibits the Growth in Nude Mice of Tumors with Hyperactivated Akt-We and others have previously shown that aberrant activation and overexpression of Akt are frequently detected in human cancer (2,15,16) and that antisense of Akt significantly inhibits tumor cell growth (42). Furthermore, inhibition of Akt pathway by inhibitors of PI3K, HSP70, Src, and farnesyltransferase resulted in cell growth arrest and induction of apoptosis (20,39,40). Because API-1 inhibits Akt signaling and induces apoptosis and cell growth arrest in cancer cells with elevated levels of Akt (Fig. 6), we reasoned that the growth of tumors with elevated levels of Akt should be more sensitive to API-1 than that of tumors with low levels of Akt in nude mice. To this end, we subcutaneously implanted tumors with hyperactivated Akt (OVCAR3 and PANC-1) into the left flank and those tumors that express low levels of activated Akt (OVCAR5 and COLO357) into the right flank of mice. When the tumors reached an average size of about 100 mm 3 , the animals were randomized and treated intraperitoneal with either vehicle or API-1 (10 mg/kg/day). As illustrated in Fig. 7, A-C, OVCAR3 and PANC1 tumors treated with vehicle control continued to grow. API-1 inhibited OVCAR3 and PANC1 tumor growth by 70 and 50%, respectively (Fig. 7, B andC). In contrast, API-1 had little effect on the growth of OVCAR5 and COLO357 cells in nude mice (Fig. 7, A-C). At FIGURE 6. API-1 inhibits Akt activity and cell growth and induces apoptosis in the cells with hyperactivated Akt. A, a Western blot is shown. After treatment with API-1, phosphorylation levels of Akt and poly(ADP-ribose) polymerase (PARP) cleavage were detected with anti-pAkt-Thr 308 and cleaved PARP antibodies, respectively, in the indicated human cancer cell lines (top and middle panels). The blots were reprobed with anti-actin antibody (bottom panel). B, a cell proliferation assay is shown. The indicated cell lines were treated with different doses of API-1 for 24 h and then analyzed with CellTier96 One Solution Cell Proliferation kit (Promega). C, shown is an apoptosis analysis. Cells were treated with API-1 and stained with annexin V and propidium iodide and analyzed by FACScan. D, Akt1-knock-out mouse embryonic fibroblasts were transfected with wild-type Akt1, constitutively active AKT1-E17K, or vector alone (left). After treatment with API-1 for 24 h, cells were assayed with annexin V labeling and FACScan (middle). The right panel shows inhibition of AKT1-E17K by API-1. MARCH 12, 2010  a dose of 10 mg/kg/day, API-1 had no effects on blood glucose level, body weight, activity, and food intake of mice (data not shown). In treated tumor samples, phosphorylation levels of Akt were reduced by API-1 about 70% without a change of total Akt content (Fig. 7D). Taken together, these results indicate that API-1 selectively inhibits the growth of tumors with hyperactivated Akt."
                    ],
                    "subsections": []
                },
                {
                    "title": "API-1 Inhibits Tumor Growth in Vitro and in Vivo",
                    "paragraphs": [
                        "In the last several years, through combinatorial chemistry, high throughput and virtual screening, and traditional medicinal chemistry, several inhibitors of the Akt pathway have been identified (25,26). Lipid-based inhibitors of Akt were the first to be developed, including perifosine (43), PX-316 (44), and phosphatidylinositol ether lipid analogues (45), which were designed to interact with the PH domain of Akt. In addition, several Akt antagonists have been identified using high throughput screening of chemical libraries and rational design. These inhibitors include 9-methoxy-2-methylellipticinium acetate (46), the indazole-pyridine A-443654 (47), isoform-specific allosteric kinase inhibitors (48), and Akt/PKB signaling inhibitor-2 (API-2), also called triciribine/TCN (21). TCN is a tricyclic nucleoside that has previously been evaluated clinically and showed antitumor activity in some patients, but toxicities precluded further development (36,49). These clinical studies were performed before the TCN inhibition of Akt activity was discovered. Our recent discovery of the TCN ability to inhibit Akt activities (21) prompted new interest in studying this drug and raises the possibility that lower doses that inhibit Akt may result in a clinical response with less toxicity in those patients whose tumors have hyperactivated Akt (21,26). Presently, TCN is undergoing phase I trials in patients with solid tumors and leukemia. Unlike API-2/TCN, API-1 is a new small molecule inhibitor of Akt and has not been studied previously. It inhibits not only activated wild-type Akt, which results from alterations of upstream regulators such as PTEN mutations, but also constitutively active Akt mutants including myr-Akt1, myr-AKT2, and E40K-Akt1 as well as naturally occurring mutant AKT1-E17K.",
                        "In summary, we have identified an Akt inhibitor, API-1, that inhibits Akt by binding to the PH domain of Akt and blocking Akt membrane translocation. As a result, API-1 selectively induces apoptosis and inhibits cell growth. The ability of API-1 to inhibit growth of human tumor xenografts in nude mice provides validation for the development of drugs targeting Akt to treat cancers displaying hyperactivated Akt. Further investigation is needed to evaluate whether API-1 is clinically useful in this setting. In addition, API-1 could be further chemically modified and optimized to develop it into a more effectively therapeutic agent. "
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}