{
    "id": "US20100009367",
    "authors": [
        "Steve S. Sommer",
        "John J. Rossi"
    ],
    "title": "MICRO RNAS AND THEIR METHODS OF USE FOR THE TREATMENT AND DIAGNOSIS OF  SCHIZOPHRENIA AND SCHIZOPHRENIA SPECTRUM DISORDERS",
    "date": "2009-06-12 00:00:00",
    "abstract": "A method of diagnosing, assessing susceptibility, and/or treating schizophrenia involving the identification and/or observation of microRNAs (miRNA) and variant miRNA are provided. Micro RNAs alleles associated with schizophrenia and schizophrenia spectrum disorders were identified and ultra-rare variants in the precursor or mature miRNA were identified. Functional analyses of ectopically expressed copies of the variant miRNA precursors demonstrate loss of function, gain of function and altered expression levels. The present invention also provides methods for selecting a preferred therapy for a particular subject or group of subjects or individuals at risk for or suffering from schizophrenia or psychosis by use of miRNAs.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The present invention relates generally to neurological and psychiatric diseases diagnosed by and/or caused in whole or in part by microRNAs and, more specifically, to the use of individual microRNAs for the diagnosis and treatment of schizophrenia.",
                        "Schizophrenia is a chronic, severe and disabling brain disease. Approximately one percent of the population develops schizophrenia during their lifetime—more than two million Americans suffer from the illness in a given year. Schizophrenia typically presents in early adulthood or late adolescence. The illness is characterized by positive symptoms (delusions or hallucinations), negative symptoms (blunted emotions and lack of interest) and disorganized symptoms (confused thinking and speech or disorganized behavior and perception). Additionally, cognitive deficits are also frequently observed, particularly in elderly schizophrenia patients. For some patients, the disorder is life-long, while others may have periodic episodes of psychosis. Men have an earlier age of onset than women, and also tend to experience a more serious form of the illness with more negative symptoms, poorer chances of a full recovery, and a generally worse outcome [Jablensky, 2000]. Systematic reviews show that schizophrenia is 1.4 times more likely to occur in men than in women.",
                        "MicroRNAs (miRNAs) are a large family of small, non-coding RNAs that negatively regulate gene expression at the post-transcriptional level [Ambros, 2003; Lai, 2003; Bartel, 2004]. In animals, miRNAs bind to complementary sites in target mRNAs 3′ untranslated regions (UTRs) to create imperfectly paired RNA heteroduplexes that inhibit translation of the target RNAs. Many microRNAs are conserved in sequence and function between distantly related organisms.",
                        "miRNAs regulate various biological functions including developmental processes, developmental timing, cell proliferation, neuronal gene expression and cell fate [Klein et al., 2005], apoptosis [reviewed in [Mattick and Makunin, 2005; Croce and Calin, 2005], tissue growth, viral pathogenesis, brain morphogenesis [Giraldez et al., 2005], muscle differentiation [Naguibneva et al., 2006], stem cell division [Hatfield et al., 2005] and progression of human diseases [Ambros, 2003; Palatnik et al., 2003]. Condition-specific, time-specific, and individual-specific levels of gene expression may be due to the interactions of different miRNAs accounting for more accurate genetic expression of various traits [Ying and Lin, 2004].",
                        "The large number of miRNA genes, the diverse expression patterns and the abundance of potential miRNA targets suggest that miRNAs may be a significant but unrecognized source of human genetic disease, including neuropsychiatric disorders. A sequence variant in the binding site for the miRNA miR-189 in the SLITRK1 mRNA has been shown to be associated with Tourette's syndrome [Abelson et al., 2005]. In addition, components required for miRNA processing and/or function have also been implicated in fragile X mental retardation [Jin et al., 2004], DiGeorge syndrome [Landthaler et al., 2004] and cancer [Karube et al., 2005], pointing to the wide ranging involvement of miRNAs in disease.",
                        "A number of animal models have been developed for schizophrenia, utilizing both non-primate (rat) and primate (monkey) animals. In one commonly used animal model of schizophrenia, phencyclidene (PCP) is chronically administered to the animal subjects, resulting in dysfunctions similar to those seen in schizophrenic humans (Jentsch et al., 1997, Science 277:953 955; Piercey et al., 1988, Life Sci. 43(4):375 385).",
                        "The causes of schizophrenia are essentially unknown. Although it is believed to have a genetic component, environmental factors appear to influence the onset and severity of the disease. Neuropathological changes in schizophrenics may include enlargement of the lateral ventricles, cavities in the brain which are part of the cerebrospinal fluid system. Sometimes, there is a decrease in overall brain mass. Several different theories have been developed regarding the etiology of schizophrenia, including the dopaminergic, glutamatergic, and cholinergic theories of schizophrenia. The dopamine hypothesis posits that positive symptoms result from excess function of the neurotransmitter dopamine in the mesolimbic area of the brain. This hypothesis is based largely on indirect, pharmacological evidence that (1) dopamine-antagonizing drugs are effective antipsychotic agents; (2) dopamine-mimicking drug exacerbate schizophrenic symptoms and (3) certain symptoms of acute paranoid schizophrenia can be elicited in non-schizophrenics by amphetamine, a drug that activates dopamine systems. However, negative symptoms have been associated with regionally localized dopamine deficits in the prefrontal cortex. Thus, there is a need for a more effective diagnosis and treatment of this disease. Additionally, there is a need for an earlier detection method for schizophrenia, such as prior to the presentation or onset of noticeable symptoms. The present invention satisfies this need and provides related advantages as well."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce schizophrenia",
                        "describe symptoms of schizophrenia",
                        "discuss prevalence of schizophrenia",
                        "introduce microRNAs",
                        "describe function of microRNAs",
                        "discuss regulation of biological functions by microRNAs",
                        "mention association of microRNAs with diseases",
                        "describe animal models of schizophrenia",
                        "discuss unknown causes of schizophrenia",
                        "highlight need for effective diagnosis and treatment"
                    ],
                    "num_characters": 5138,
                    "outline_medium": [
                        "introduce schizophrenia",
                        "describe microRNAs",
                        "discuss miRNA regulation",
                        "relate miRNAs to disease",
                        "motivate need for diagnosis and treatment"
                    ],
                    "outline_short": [
                        "introduce schizophrenia",
                        "motivate miRNA role in diagnosis and treatment"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "In accordance with one embodiment, there is provided a system and method for diagnosing and determining the susceptibility to schizophrenia.",
                        "In another embodiment, a method for determining the susceptibility to schizophrenia comprises obtaining a nucleic acid containing sample from a patient and detecting mutant miRNA alleles indicating schizophrenia.",
                        "In another embodiment, a method for diagnosing or identifying schizophrenia comprises obtaining a nucleic acid containing sample from a patient and detecting mutant miRNA alleles indicating schizophrenia.",
                        "A further embodiment includes a method for diagnosing schizophrenia which comprises determining the magnitude of expression of a miRNA gene or allele selected from the group consisting of those disclosed in Table 1 in a sample and comparing the magnitude of expression to a baseline magnitude of expression of the gene or allele in persons without schizophrenia, wherein elevated or depressed levels of the gene or allele (as compared to the baseline magnitude) indicate the presence of schizophrenia. This diagnostic assay may be performed examining one or a combination of more than one miRNA gene or allele associated with schizophrenia.",
                        "In another embodiment, a method for diagnosing schizophrenia comprises obtaining a nucleic acid containing sample from a patient and detecting one or more variant miRNA alleles.",
                        "Another aspect is a functional screen for testing new variants for likely contribution to schizophrenia. Variants in nucleic acid, such as in miRNA, include but are not limited to point mutations, deletions, insertions, and translocations.",
                        "In another embodiment, schizophrenia is treated or prevented by modifying the miRNA of a mammal affected or potentially affected by schizophrenia or a schizophrenia spectrum disorder using gene therapy techniques.",
                        "In another embodiment, schizophrenia is treated or prevented by administering agents to antagonize the function of the RNA, and particularly miRNA genes or alleles if such genes or alleles are upregulated, or to agonize the function of the miRNA genes or alleles if such genes or alleles are downregulated, which miRNA genes or alleles contribute to or cause schizophrenia.",
                        "Such miRNA genes or alleles referenced in these embodiments include let-7f-2, mir-18b, mir-505, mir-502, mir-188, mir-325, mir-660, mir-509-3, mir-510, mir-421, mir-934, and mir-450a-2",
                        "Table 1a represents the results from an exemplary analysis of ultra-rare miRNA cohort-specific variants.",
                        "Table 1b represents the results from an exemplary analysis of miRNA cohort-specific sequence variants in a gene pool analysis.",
                        "Table 2 lists exemplary miRNA primers useful in identifying X chromosome variants (SEQ ID NOS: 97-215).",
                        "Table 3 lists variants identified in cases and controls.",
                        "Table 4 lists variants with 509-2.",
                        "Table 5 lists variants without 509-2.",
                        "Table 6 lists target genes of miRNAs having ultra-rare cohort-specific variants.",
                        "Table 7 lists oligonucleotides useful for cloning pri-miRNA and probes for northern blots (SEQ ID NOS: 216-337).",
                        "Table 8 lists all the miRNA gene variants that were found in the control population or the patient samples."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce system and method for diagnosing schizophrenia",
                        "describe method for determining susceptibility to schizophrenia",
                        "describe method for diagnosing schizophrenia",
                        "introduce functional screen for testing variants",
                        "describe treatment or prevention of schizophrenia using gene therapy",
                        "describe treatment or prevention of schizophrenia using agents"
                    ],
                    "num_characters": 3175,
                    "outline_medium": [
                        "introduce diagnostic system",
                        "describe method for determining susceptibility",
                        "outline various embodiments"
                    ],
                    "outline_short": [
                        "summarize embodiments of diagnosis and treatment methods"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The present invention relates to the involvement of microRNAs (miRNAs) in development, onset and expression of symptoms associated with schizophrenia and using the understanding of such miRNA expression and activity to diagnose and treat schizophrenia or to diagnose risk of developing schizophrenia and the development of functional assays to assist the search for schizophrenia therapies.",
                        "A first aspect is a method of diagnosing schizophrenia or a schizophrenia spectrum disorder in an individual by determining the presence of a variant of a miRNA gene or allele. The miRNA may be any miRNA known or found to affect or influence schizophrenia and such activity may be determined via the functional assay described herein, which was used to determine the function of miRNAs disclosed here, or by another method that allows determination of the function of miRNA as it relates to schizophrenia. The miRNAs may be one or a combination of more than one of the following: miRNA alleles consisting of let-7f-2, mir-18b, mir-505, mir-502, mir-188, mir-325, mir-660, mir-509-3, mir-510, mir-421, mir-934, and mir-450a-2.",
                        "Generally, the method, which can be used to either determine an increased risk for schizophrenia or propensity thereto in a subject or to diagnose schizophrenia existing in a subject, comprising the steps of analyzing the miRNA in a sample obtained from the subject and determining the presence of a variant of the miRNA wherein the presence of said variant is indicative of an increased risk for developing schizophrenia or propensity thereto in the subject. Certain variants that the present invention has determined influence on schizophrenia are let-7f-2, mir-18b, mir-505, mir-502, mir-188, mir-325, mir-660, mir-509-3, mir-510, mir-421, mir-934, and mir-450a-2. The biological samples may be any sample from a subject containing mRNA, including blood, serum, plasma, saliva, urine, or tissue samples. The mRNA is isolated using any method, including the method using RNA STAT-60 described herein. The presence of RNA may be determined via any reliable method, including the use of Northern blots.",
                        "The term “miRNA” includes miRNA molecules, variants, and analogs thereof, miRNA precursor molecules, and DNA molecules encoding miRNA or miRNA precursor molecules.",
                        "Further, therapeutic applications of the miRNA described herein may be used as modulators or targets of schizophrenia and related spectrum disorders. In general, the nucleic acid molecules may be used as a modulator of the expression of genes which are at least partially complementary to said nucleic acid and are sufficient to agonize or antagonize the activity as desired. miRNA may be used as raw materials for the manufacture of sequence-modified miRNA molecules to adjust target specificity or target binding efficacy. miRNA may also be used in an attempt to alter a differentiated cell line back into a stem cell or another cell type to avoid the onset or symptoms of schizophrenia. For therapeutic applications, miRNA may be administered alone or as part of a composition, which comprises the miRNA (or different miRNAs) and a pharmaceutically acceptable carrier. The therapeutic methods may be carried out by known methods, wherein a nucleic acid is introduced into a desired target cell in vitro or in vivo using gene transfer techniques include calcium phosphate, DEAE-dextran, electroporation, microinjection, viral vectors, and commercial liposomes. The composition may be in any suitable form such as an injectable solution, a cream, ointment, tablet, suspension, or pill and may be administered in any therapeutically effective manner, such as parenterally, intravenously, orally, or nasally.",
                        "Methods of screening and tests for the bioactivity of a miRNA are disclosed. The test determines altered functionality of a miRNA gene or allele variant. The test uses functionality activity comparisons. In one embodiment, polyadenylated RNA polymerase II transcripts, termed “primary miRNAs” (pri-miRNA) is and variant or putative variant miRNA is isolated. Then, the pri-miRNA and variant miRNA are co-transfected with an si target and an mi target. Preferably, each target has its own reporter. Then, the functionality of the variant is determined using miRNA and siRNA assays. Changes in the level of expected repression of the si and mi reporters (either reduced or enhanced repression) in transient transfection assays indicates altered functionality of the miRNA gene or allele variant. The variants may be the result of one or more of a SNP, point mutation, deletion, insertion, frameshift, or translocation. The screen may be used to test whether the miRNA variant indicates predisposition to or incidence of schizophrenia.",
                        "For the methods of diagnosing, assessing susceptibility, and/or treating schizophrenia involving the identification and/or observation of microRNAs (miRNA) and preferably, variant miRNA are provided and identified as follows: Individual microRNAs (miRNAs) effect moderate down-regulation of gene expression, typically by two- to four-fold. Micro RNAs alleles associated with schizophrenia and schizophrenia spectrum disorders were identified. The miRNA genes were amplified in patients and controls. Ultra-rare variants in the precursor or mature miRNA were identified in distinct miRNA genes in males with schizophrenia and one ultra-rare variant was identified in a control sample (8/193 versus 1/191, p=0.019). These variants were not found in an additional 7,197 control X-chromosomes. Functional analyses of ectopically expressed copies of the variant miRNA precursors demonstrate loss of function, gain of function and altered expression levels. The present invention also provides methods for selecting a preferred therapy for a particular subject or group of subjects or individuals at risk for or suffering from schizophrenia or psychosis by use of miRNAs.",
                        "miRNA genes are scattered among all the chromosomes in humans except for the Y chromosome. They primarily derive from intronic or exonic capped, polyadenylated RNA polymerase II transcripts, termed “primary miRNAs” (pri-miRNA). It is estimated that approximately one-third of human protein coding genes are post-transcriptionally controlled by miRNAs. The mature miRNAs are used to guide miRNA-induced silencing complex (“RISC”) to the complementary sequences in the 3′UTR of targeted transcripts. The result is site specific mRNA cleavage when the pairing is nearly complete (mostly in plants, rare in animals) or translational inhibition when imperfect base-pairing occurs (mostly in animals).",
                        "Translational suppression and mRNA degradation, modes by which mammalian miRNAs regulate gene expression, do not require complete complementarity between the miRNA and target. All that is required to reduce protein levels of the target is Watson-Crick base pairing between seven consecutive nucleotides in the target mRNAs 3′ UTR and nucleotides 2-7 or 2-8 (the “seed sequence”) at the miRNA's 5′ end. The critical role played by the “seed sequence” in the majority of miRNA/mRNA interactions implies that a single nucleotide change in the seed sequence, or shift of the processing sites during biogenesis of the miRNA/miRNA* duplex could result in a novel miRNA with alternated target-spectra. Therefore, both the 5′end of the mature miRNA that is generated from the 5′ arm of the pre-miRNA (5p) by Drosha, and the 5′ end of the mature miRNA that is produced by Dicer from the 3′ arm of the premiRNA (3p), will be under strong selective pressure to be highly conserved. (Drosha is an RNase III enzyme that initiates miRNA processing. Dicer is an RNase III endoribonuclease that cleaves miRNA into small interfering RNA (siRNA)). The sequence preceding the 5′ end or trailing the 3′ end of the pre-miRNAs form an ˜11 bp long imperfect stem which is recognized by DGCR-8 as part the required structure for Drosha cutting. For most miRNAs/target combinations, a single nucleotide change in the seed sequence or any base shift during the Drosha/DGCR8 or Dicer/TRBP processing step can result in altered function or creation of a novel miRNA. The terminal loop is also important for Dicer/TRBP complex binding as well as for other protein binding. Sequences outside the seed in the mature miRNA sequence can also impact the strength of inhibition as well as the spectra of targeted transcripts.",
                        "Mature miRNAs are generated by a two-step processing mechanism (FIG. 1). PrimiRNAs are first processed to “hairpin-like” partially duplexed precursor miRNAs (premiRNA) in the nucleus. Aside from a small group of pre-miRNAs that are generated through mRNA splicing/debranching machinery termed the “miRtron pathway”, most pre-miRNAs are processed from pri-miRNAs by the nuclear RNase (ribonuclease) III Drosha which partners with the RNA binding protein DGCR8 (the DiGeorge syndrome critical region gene 8). Pre-miRNAs are typically 55-80 nt in length and are exported to the cytoplasm by exportin-5/RAN-GTP. The pre-miRNAs are processed into ˜21-22 nt long miRNA/miRNA* duplexes by RNase III Dicer, which partners with the RNA binding protein TRBP (TAR RNA binding protein). The production of miRNA/miRNA* duplexes is an essential step in miRNA biogenesis and precisely defines the ends of the mature miRNAs for preferential loading of the guide strand. The choice of the guide strand is dependent in part on the thermodynamic end properties of the duplex, with the least thermodynamically stable 5′ end usually being chosen as the guide strand while the other strand, labeled miRNA*, is usually degraded. Most recently, the fates of the miRNA guide and miRNA* strands have been shown to be tissue dependent with both strands being functionally active under specific conditions. Argonaute-mediated loading into the processing complex can increase the bias of strand loading, and RNA binding proteins can selectively block the processing of primiRNAs.",
                        "The mature miRNAs are incorporated into a ribonucleoprotein complex, the RNA-induced silencing complex (RISC), which contains at least Dicer, TRBP and Ago2 [Hammond et al., 2000; Mourelatos et al., 2002; Hutvagner and Zamore, 2002]. In RISC, miRNAs can mediate down regulation of target gene activity by translational inhibition in animals [Zeng et al., 2002]. RISC can cleave, degrade or suppress translation of target mRNAs depending on the position and extent of the complementarity between miRNAs and target mRNAs. Given the complexity of protein interactions and the number of processing steps required to produce a functional miRNA, point mutations affecting any of these steps could dramatically impact the downstream function of these miRNAs.",
                        "The hairpin structure guided miRNA processing, the thermodynamic influences on strand loading, and the base pairing requirements for miRNA/mRNA interaction indicate that single nucleotide polymorphisms (“SNPs”) in miRNA genes affect miRNA biogenesis and function. Similarly, SNPs in the miRNA target also affect miRNA function. To clarify possible confusions in terminology with respect to SNPs, the terms “miR-SNP” refers to the variation that occurs in the miRNA gene sequence, and “miR-TS-SNP” refers to SNPs that occur in the miRNA target site (TS) or binding site. Since one miRNA can have multiple targets, miR-SNPs would exhibit more profound and broader biological effects than miR-TS-SNPs.",
                        "The roles that sequences flanking the pre-miRNA play in miRNA processing has been thoroughly studied. MiR-SNPs in miR-125a and Kaposi's sarcoma-associated herpes virus encoded miR-K5 impaired miRNA processing by the Drosha/DGCR8 complex. MiR-196a2-SNP (rs11614913) in the mature miR-196a2 was associated with a significantly decreased rate of survival in individuals with non-small cell lung cancer, and an association of rs11614913 with enhanced processing of mature miR-196a. MiR-146a-SNP (rs2910164) within the pre-miR-146a sequence reduced both the amount of pre- and mature miR-146a, and affected the Drosha/DGCR8 processing step. MiR-196a2-SNP, miR-146a-SNP, miR-149-SNP (rs2292832) and miR-499-SNP (rs3746444) are each associated with increased breast cancer risk. MiR-146a-SNP was associated with papillary thyroid carcinoma, breast/ovarian cancer, and hepatocellular carcinoma. Each of the above are examples of SNPs created by changes in DNA coding sequences, but miRNAs can also be post transcriptionally modified, such as by RNA editing via ADAR. A to I edited pre-miR-151 blocks its processing by Dicer/TRBP. ADAR edited pri-miR-142 was more easily degraded by Tudor-SN. Edited miR-376a-5p within the middle of the “seed” region alters the set of targets regulated by this miRNA. A survey of RNA editing of miRNAs from ten human tissues implies RNA editing of miRNA happens quite often and it is a mechanism to increase the diversity of miRNAs and their targets.",
                        "Mutant or post transcriptionally edited miRNAs can result in alterations of processing and function. Hence, SNPs that occur in sequences downstream or upstream of the pre-miRNA, sequences in the terminal loop of premiRNA, and sequences in the miRNA and miRNA* duplexes may also play important roles in miRNA biogenesis and function (FIG. 1).",
                        "In the present experiments, X-linked miRNA genes from patients with diagnosed schizophrenia or autism were analyzed and compared with a gene pool analysis consisting of over 7,000 chromosomes from normal individuals (i.e., individuals without schizophrenia or autism). Twenty-four different point mutations have been determined in either the mature miRNA sequences or the precursor regions for sixteen different X-linked miRNA genes. The present invention addresses the effects on miRNA generation and function generated by SNPs in X-linked miRNAs.",
                        "Of the tested miRNA-SNPs, one variant results in elevated levels of the mature miRNA sequence relative to the wild type, several variants result in reduced levels of the mature miRNA sequence relative to wild type, and another variant results in the generation of a novel miRNA due to an alteration in the Drosha and/or Dicer processing sites. This latter miRNA-SNP also has an alteration the strand loading bias relative to the wild type version. A single base alteration even outside of the mature miRNA sequence can have profound consequences on miRNA generation and function.",
                        "Most miR-SNPs are located in clusters and some of them, such as mir-510 and miR-509, rapidly evolved in primates. Table 4 shows variants with 509-2 and Table 5 shows variants without 509-2. One clear example is the generation of miR-509-3-5p by the deletion of an ‘A’ from miR-509-5p, which is processed from miR-509-1 or 2 (FIG. 2; SEQ ID NOS: 1-43). There are three copies of miR-509, miR-509-1 and miR-509-2 that produce the same mature miRNAs, while miR-509-3 produces a different 5p product. Most likely, the miR-509-3-5p was created by the deletion of an ‘A’ from miR-509-5p. A high percentage of an ATG insertion was also observed in the 5′ end of miR-509-1-3p. This insertion may affect both 5p and 3p processing. Eventually, under the selective pressure to target different mRNAs or to target with different specificities, the three copies of miR-509 may have developed into different family members with the same seed, like the let-7 family, or different miRNAs in the same cluster, like the miR-25-93-106b cluster. The miR-509 structure is more flexible, as there are no significant differences in the processing or function among three different miR-509-3 variants (FIG. 3, SEQ ID NOS: 44-47).",
                        "Many factors contribute to differences in miRNA expression profiles, including transcriptional regulation, post transcriptional miRNA processing, the stability of the pri-miRNA or pre-miRNA, and pre-miRNA export. The existence of miRNA targets may also result in miRNA stabilization because of engagement in miRISC. Different miRNA profiles are a consequence of subtle genetic changes in pre-miRNAs and their immediate flanking sequences.",
                        "Previous in silico studies from Bentwitck and Zhang show that miRNA family expansion during primate evolution may have occurred through tandem duplications. Copy number variations and high rates of gene conversion in the newly emerged miRNAs in primates may have resulted in production of novel miRNAs with more specialized functions. As a result, gene conversion may be a major mechanism in the biogenesis of miRNAs during evolution, especially in clusters of miRNAs, homologues, or miRNA families. Finally, some of the SNPs characterized by altered processing or abundance may play significant roles in disease development and progression.",
                        "The present invention is based on the novel finding that structural variants in the microRNA genes can predispose an individual to schizophrenia. In particular, microRNA mutant alleles associated with schizophrenia were identified.",
                        "Genomic sequence information of DNAs derived from patients diagnosed with schizophrenia was compared to that of large sets of normal patient samples. In certain experiments, the comparison focused on X-linked genes in male patients. From these analyses, several mutations in microRNA precursor and mature coding sequences were identified, some of which exhibit functional impairments in our cell culture based testing system. miRNA genes are transcribed by RNA polymerase II as long primary transcripts (pri-miRNA) containing stem-loop or “hairpin” structures ˜60 nt in length.",
                        "The present invention identifies ultra-rare variants in the precursor or mature miRNA, each in distinct miRNA genes in males with schizophrenia and one ultra-rare variant was identified in a control (8/193 versus 1/191, p=0.019). These variants were not found in additional 7,197 control X-chromosome alleles using gene pool analyses. Functional analyses indicated that some of these variants display altered regulatory function consistent with dominant inheritance. The altered functions or defects in processing of the pre-miRNAs in the mutant alleles detected in our analyses indicate that these microRNAs may contribute to the development of schizophrenia. It is relevant to note that each microRNA can potentially regulate dozens, and perhaps even hundreds of different transcripts during development, so even subtle defects in activity can have profound effects on development of the nervous system.",
                        "Identified targets of the miRNAs in which ultra-rare variants were found are listed in Table 6. Such targets include neuregulin 1 (NGR1), Disrupted in schizophrenia 1 (DISC1) and Regulator of G-protein signaling 4 (RGS4). Defects in miRNAs altering the interactions between miRNAs and their mRNA targets thus likely contribute to schizophrenia.",
                        "To explore the role of miRNAs in schizophrenia, 59 microRNA genes on the X chromosome were analyzed in 193 males with schizophrenia spectrum disorders. The miRNA genes were amplified in patients and controls. Ultra-rare variants in the precursor or mature miRNA were identified in distinct miRNA genes in males with schizophrenia and one ultra-rare variant was identified in a control sample (8/193 versus 1/191, p=0.019). These variants were not found in an additional 7,197 control X-chromosomes. Functional analyses of ectopically expressed copies of the variant miRNA precursors demonstrate loss of function, gain of function and altered expression levels. These results provide the first statistically significant data linking microRNA gene dysfunction with schizophrenia."
                    ],
                    "subsections": [
                        {
                            "title": "Examples",
                            "paragraphs": [
                                "Materials and Methods",
                                "Samples",
                                "All 193 male Caucasian schizophrenic patients met criteria for the disease as defined by the Diagnostic and Statistical Manual, Fourth Edition, Revised (DSM-IV-R). The majority of patients were ascertained through state mental institutions in Minnesota. The male controls were Midwest Caucasians with no known history of psychiatric illness.",
                                "PCR Amplification and Sequencing",
                                "The genomic sequence and adjacent flanking sequences of the precursors of 59 X-linked microRNA genes (miRBase 10.1, http://microrna.sanger.ac.uk/sequences/) were amplified and sequenced with the ABI model 3730 sequencer. Sequences of the primers are listed in Table 2 (SEQ ID NOS: 97-215). The nucleotide alterations were analyzed with Sequencher software™ (Gene Codes, Ann Arbor, Mich.). Mutations were confirmed by reamplifying from genomic DNA and sequencing in the opposite direction.",
                                "Gene Pool Analysis",
                                "Genomic DNA samples from 7,197 control X-chromosomes were ascertained from a Midwest population-based sample of overwhelmingly Caucasian individuals from Minnesota and a more ethnically and geographically diverse sample of hemophilia families.",
                                "The concentration of individual DNA samples was estimated by both UV spectrophotometry and agarose gel electrophoresis with diluted quantitation standards. Samples were diluted to 200 ng/μl and combined into pools of 10, 30 and 100 samples. The concentration of each sample per μl in the pool is 20 ng, 6.7 ng and 2 ng, respectively.",
                                "Allele-specific amplification assays were developed for each case or control cohort-specific variant. The specificity and selectivity of each assay were determined utilizing negative and positive controls spiked within gene pool samples.",
                                "Cell Lines and Plasmids",
                                "HEK293, Hela, NIH-3T3 cells were purchased from ATCC and maintained in high glucose (4.5 g/l) DMEM supplemented with 2 mM glutamine, 10% FBS, and 2 mM Penicillin/Streptomycin. Transfections to HEK293, NIH-3T3 and Hela cells were performed with Lipofectamine 2000 (Invitrogen) in duplicate in 24-well plate formats when cells are at 70-80% confluency.",
                                "Cell Based miRNA Processing Test",
                                "Primary miRNA expression plasmids and reporters bearing either fully complementary or seed sequence complements to the miRNAs were co-transfected into HEK293 cells. Dual-reporters (expressing both Firefly and Renilla luciferase) carrying the miRNA fully complementary sequences (si reporter) in the 3′ UTR of the Renilla transcript were used to validate the ability of cloned primary miRNA expression plasmids to produce functional, mature miRNAs. Dual-reporters carrying the partially complementary sequence (mi reporter: mis-matched at position 11 to 13 and the last two nts in miRNA/mRNA duplex) of a miRNA in the Renilla 3′UTR were used to measure the strength of translational repression from the corresponding miRNA.",
                                "In order to express the pri-miRNAs, the stem-loop sequences were retrieved from miRBase 10. The stem-loop sequence, plus flanking sequences extending over 100 bases in both directions, was PCR amplified from genomic DNA. A miRNA expression vector was constructed by first cloning the human Pol II U1 promoter upstream of a multiple cloning site in the Bluescript SK plasmid to create SK-U1. Secondly, the U1 transcriptional termination sequence was cloned downstream of the MCS of SK-UL to create the fU1-miR miRNA expression vector. The primary miRNA was cloned into the Xho I and BamH1 sites of fU1-miR. miRNA variants were cloned in the same manner as the wild type miRNAs from patient DNA when available. If samples were no longer available, the QuikChange II site-directed mutagenesis kit was used to create mutants within the wildtype expression constructs. All clones were sequenced to confirm the normal miRNA and mutant forms.",
                                "For si reporters, all miRNAs and their homologous mutant target sequences were designed as fully complementary to the mature miRNA sequence. The oligos for the two strands were inserted into the psiCHECK Xho I/Spe I or XhoI/Not I digested reporter 3′ UTR of the Renilla luciferase gene. All target clones were verified by sequencing. For mi reporters, all the inserted sequences in the reporter 3′ UTR of the Renilla luciferase gene were designed with bulges at positions 11 to 13 and were unpaired for two nucleotides at the 3′ end of the miRNA.",
                                "About 1×104 HEK293 cells per well in 500 microliters of growth media were plated in 24 well plates one day prior to transfection. The cells were at 70-80% confluency at the time of transfection. Each well was transfected with 5 ng reporter, 100 ng miRNA expression constructs (1:20 ratio, 1:5 ratio was used if the knockdown of the si target was >95%, then 25 ng of miRNA expression plasmid and 75 ng stuffer Blue-script SK were used) and 1 ul Lipofectomine 2000. Forty eight hours post transfection, the cells were lysed with 100 μl Passive lysis buffer (Promega) and luciferase levels were analyzed from 20 μl lysates using the Dual Luciferase reporter assay (50 μl of each substrate reagent, Promega) on a Veritas Microplate Luminometer (Turner Biosystems). Changes in expression of Renilla luciferase (target) were calculated relative to Firefly luciferase (internal control) and normalized to the miRNA expression vector control fU1-miR.",
                                "Point mutations were created with the QuikChange site-directed mutagenesis kit II (Stratagene) following the protocol included in the kit. Mutations were confirmed by sequencing.",
                                "RNA Isolation",
                                "RNA was isolated with RNA STAT-60 (Tel-Test Inc.) and 20 μg total RNA was loaded into a denaturing 12.5% SDS-PAGE gel. A DNA oligonucleotide probe complementary to the mature miRNA sequence was labeled with γ-32P-ATP.",
                                "Northern Blot",
                                "Two different transfections were performed in HEK 293 cells to detect processing of expressed pri-miRNA in vivo. One transfection contained pri-miRNA expression constructs alone, while the other was co-transfected with 25/27-mer synthesized siRNA duplex. Northern blots were performed with RNAs from both transfections. U2A or U6 snoRNA were used as the RNA loading controls and co-transfected S1 siRNA was used as the transfection control. 20 μg total RNA was loaded on a 12.5% PAGE-8M urea denatured gel. Gels were transferred to a Hybond-N+ (Amersham Pharmacia biotech, positive charged) membrane. DNA probes were used for all Northern blots, and hybridizations were carried out in PerfectHyb™ Plus hybridization buffer (Sigma) for 16 hours (Table 7; SEQ ID NOS: 216-337). The blots were washed once for 10-30 minutes with 6×SSPE/0.1% SDS, followed by two washings with 6×SSC/0.1% SDS for 10-30 minutes each.",
                                "Mature miRNA Cloning",
                                "For small RNA cloning, small RNAs below 40 nt were fractionized by a flashPAGE™ Fractionator System. Small RNAs were first polyadenylated, then ligated with a 5′ RNA adaptor. The 5′-adaptor-added polyadenylated small RNAs were RT-PCR amplified and the products cloned. Dot-blot hybridizations were used to identify positive clones. The positively hybridizing clones were sequenced to verify the processed mature miRNA sequences.",
                                "Dot-Blotting",
                                "Bio-Rad membranes were cut to the same size as the bottom of Petri-Dish plates. The membranes were laid on the colonies for 20 seconds or until they were wet, then lifted and washed twice in 0.5N NaOH for 5 minutes each (The plates were put back into the 37° C. incubator for 5-6 hours to preserve the colonies). Next, the membranes were washed twice in 0.5M Tris-HCl, pH 7.5 for 5 minutes each. Then, the membranes were washed twice in 6×SSC/0.1% SDS for 5 minutes each. Finally, the membranes were washed in 95% EtOH for 5 minutes and dried between two sheets of Whatman paper. All washings were performed at room temperature. Just before hybridization, membranes were soaked in 6×SSPE/0.1% SDS twice for 5 minutes each. The probe and the temperature of hybridization, and the washing condition were the same as those for the Northern blots above. The only difference was that the hybridization duration was one hour. Usually the signal is strong enough to detect after the blots are exposed to film for 5-6 hours. Positive colonies were located and plasmid DNAs were made for sequencing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define patient population",
                                "describe PCR amplification and sequencing",
                                "motivate gene pool analysis",
                                "describe gene pool analysis",
                                "prepare DNA samples",
                                "develop allele-specific amplification assays",
                                "introduce cell lines and plasmids",
                                "describe cell transfection",
                                "motivate cell-based miRNA processing test",
                                "describe cell-based miRNA processing test",
                                "construct miRNA expression vector",
                                "describe si and mi reporters",
                                "perform transfection and luciferase assay",
                                "create point mutations",
                                "isolate RNA and perform northern blot",
                                "clone and verify mature miRNA sequences"
                            ],
                            "num_characters": 8200,
                            "outline_medium": [
                                "define patient population",
                                "describe PCR amplification and sequencing",
                                "summarize gene pool analysis",
                                "introduce cell lines and plasmids",
                                "describe cell-based miRNA processing test",
                                "outline RNA isolation and northern blot",
                                "detail mature miRNA cloning",
                                "describe dot-blotting"
                            ],
                            "outline_short": [
                                "define patient and control populations",
                                "describe PCR amplification and sequencing",
                                "outline gene pool analysis and cell-based miRNA processing test",
                                "detail RNA isolation, northern blot, mature miRNA cloning, and dot-blotting"
                            ]
                        },
                        {
                            "title": "Results",
                            "paragraphs": [
                                "Fifty-nine microRNA genes on the X chromosome were analyzed in 193 males with schizophrenia as well as 191 controls. Ultra-rare variants in the precursor or mature miRNA were identified, each in a distinct miRNA gene, in males with schizophrenia and one ultra-rare variant was identified in a control sample (8/193 versus 1/191, p=0.019, Fisher's exact test) (Table 1a). These variants were not found in an additional 7,197 control X-chromosomes using gene pool analyses.",
                                "Five cohort-specific variants, one in a patient and four in controls, were found in the gene pool analyses at a frequency greater than 0.02% (p=0.21, Fisher's exact test) (Table 1b). The schizophrenia patient's variant occurred in the mature miRNA mir509-3-5p. Of the four cohort-specific variants identified in control samples, three were found in the mature miRNAs, while one was found in the precursor.",
                                "Five common variants in miRNA precursors were found in both patients and controls with similar frequency (Table 3).",
                                "Twenty-four variants within pre-miRNAs and the immediate flanking regions were identified (Table 8). They are further characterized into four groups based on the location within the hairpin structure (FIG. 1): SNPs in the basal segment (miR-421-G/A, miR-888-A/C ), SNPs in the lower stem (miR-421-G/A, miR-502-C/G, miR-505-C/T, miR-509-2-G/T, miR-510-G/A), SNPs in the miRNA/miRNA* (let-7f-2-5p-G/A, miR-188-3p-C/T, miR-325-3p-G/A, miR-450a-2-T/C, an ‘A’ deletion in miR-509-2-5p, miR-509-3-5p-G/A, miR-509-3-5p-C/G, miR-509-3-3p-C/T, miR -510-T/C, miR-660-5p-C/T, miR-890-3p-G/C, miR-892b-3p-T/C, miR-934-T/G), SNPs in the terminal loop (miR-18b-A/G, -G/A, a TGA insertion in the terminal loop of miR-509-1, miR-891 b-C/G).",
                                "To assess the functional consequences of the point mutations, pri-miRNAs and mutant versions of each miRNA were co-transfected with their corresponding si and mi targets (using materials and methods described above). Three or more transfections were performed, with duplicates in each transfection. At least four of the variants identified, each having a point mutation in the mature coding region, have altered function (miRNA let-7f-2, miR-188, miR-660, and miR-509-3). The novel, ultra-rare variants in the mature miRNAs were predicted to have altered target specificity.",
                                "In order to evaluate the consequences of these point mutations, a novel assay was developed to monitor the processing and function of both strands of the miRNAs by employing both miRNA (seed sequence complementarity) and siRNA (fully complementary) assays. The functional assays were carried out in transient cotransfections of expressed pri-miRNA with target sequences in the 3′UTR of the Renilla luciferase encoding transcripts. At least six of the variants, miR-502-C/G (FIGS. 2 & 4, rare variant and associated with schizophrenia), miR-510-G/A (FIGS. 2 & 5), miR-510-T/C (FIGS. 2 & 6, rare variant and associated with schizophrenia), miR-890-C/G (FIGS. 2 & 8), miR-892b-T/C (FIGS. 2 & 9) and miR-934-T/G (FIGS. 2 & 10), showed reduced or enhanced repression of the ‘si’ and ‘mi’ reporters in transient transfection assays. For each of these variants, Northern blotting was performed to detect the effects of the SNP on processing of the pre and mature miRNAs. Mature miRNA cloning was performed on miR-510-G/A, miR-890-C/G and miR-934-T/G to study affect of the SNP on the maturation of the miRNAs. While all three SNPs apparently affect the miRNA processing, only the miR-934-T/G transversion also altered the Drosha or Dicer excision sites which also resulted in changing the strand bias for RISC loading relative to the wild type miRNA (FIG. 16).",
                                "Several examples in which miR-SNPs resulted in reduced processing were observed. Four of the six observed miR-SNPs, miR-502-C/G, miR-510-T/C, miR-890-C/G and miR-892b-T/C, produced less mature miRNA. While the 502-G/C SNP occurs two nts before the 5′end of 502-5p, the other three SNPs all occur in the mature 3p product.",
                                "Let-7f-2/7f-2*",
                                "A single base substitution G>A was identified in the mature miRNA of let-7f-2 at position 11. This site is highly conserved from C. elegans through human. This variant is not present in 7,197 control X-chromosomes (Table 1a). To examine the possible functional consequences of this mutation, the wild type and mutant variants were tested against its corresponding si and mi target sequence. The results obtained with these analyses demonstrate that the mutant sequence can down regulate its si sequence (FIG. 12, bar #6), but its knockdown of the let-7f si sequence was dramatically reduced (FIG. 12, bar #3). On the other hand, the let-7f knockdown of the mutant si-target remained unperturbed (FIG. 12, bar #5). These results demonstrate that the mutant produces a stronger siRNA phenotype than the wild type miRNA with the cognate complementary targets. On the other hand, the variant elicits a weaker miRNA phenotype than the wild type.",
                                "miR-18b/18b*",
                                "Variant miR-18b/18b*-m has an A to G mutation at the 5th nucleotide following the last base of the mature sequence, which is also in the predicted loop structure (FIG. 13, SEQ ID NO: 96). This sequence difference may affect processing and/or stability since there is a reduction in the level of target knockdown activity when compared to wild type in the si-target (FIG. 13, bar #2 vs #3) and the mi-target assays (FIG. 13, bar #5 vs #6). In contrast, the function of the miR-18* strand does not appear to be affected by this mutation (FIG. 13 bar #7 vs 8 and Bar #9 vs 10).",
                                "miR-502-5p/3p",
                                "Variant miR-502-5p/3p-m has a C to G transversion at the 3rd nucleotide (“nt”) upstream of the mature miR-502-5p sequence (FIG. 4, SEQ ID NOS: 44-47). This mutation will produce a bulge which changes the structure of the stem of the precursor miRNA (FIG. 2). Most likely, this structural change will affect the site of Drosha cleavage in producing pre-miR-502, therefore, both the 5p and 3p products should be affected. Reduced target knockdowns were observed in transfection assays (FIG. 4, bar #2 vs 3, #5 vs 6 and #8 vs 9). The impaired functional activity of the variant was supported by Northern blot analyses, as the production of pre-miR-502 and mature 502-5p/3p was both reduced. (FIG. 4).",
                                "miR-188-5p/3p",
                                "Variant miR-188-5p/3p-m has a C to T (U) transition at the 7th nt of the mature miR-188-3p within the seed sequence (FIG. 14). This variant results in a change of G:C to G:U pairing in the seed sequence. In our assay system, the effect of the variant is not dramatic (FIG. 14). Nevertheless, this variant will create a seed sequence where this position can pair with an A, thus potentially affecting the expression of new target sequences with a matched seed sequence.",
                                "miR-505/505*",
                                "Variant miR-505/505*-m has a C to T (U) transition at the 6th nt (relative to the 5′ end of the upper strand of the mature miR-505). This variant is distal to both Drosha and Dicer cleavage sites. Functional testing of this mutant (FIG. 15) revealed little difference when compared with the wild type miRNA.",
                                "miR-510",
                                "Variant miR-510-m has a T (U) to C transition in the seed of the predicted miR-510* (3p) (FIG. 6, SEQ ID NOS: 56-65). Transfection assays show processing of the miR-510-3p product and its ability to knockdown the corresponding si target sequence (FIG. 6, bar #8). The T (U)/C mutation produces a pre-miR-510 with much less activity for both 5p and 3p products (FIG. 6, Bar #2 vs 3, bar #5 vs 6 and bar #7 vs 8). This mutation most likely affects the structure of the pre-miR-510, as it affects the function of mature miR-510 on both strands. Northern blot analyses confirm that the production of both pre-miR510 and miR-510-5p/3p were reduced (FIG. 7).",
                                "miR-509-3",
                                "This miRNA variant has a C to T (U) transition at the 13th nucleotide of the mature miRNA (FIG. 3, SEQ ID NOS: 44-47). Our functional assays show that this mutation has a weak effect on the processing of the mature miRNA (FIG. 3). This base change could affect the endogenous targets down regulation as the 13th position is important for 3′end base pairing of miRNAs and mRNAs.",
                                "miR-660",
                                "Variant miR-660 has a C to T (U) transition at the 15th position of the mature miRNA (FIG. 11). The functional assay data shows it has little effect on the processing of the miRNA (FIG. 11). The base change could affect the natural targeting functions of the miRNA since this position affects the 3′ end base pairing of miRNA/mRNA.",
                                "miR-325",
                                "Variant miR-325-m has a G to A transition on the miR-325* strand. Interestingly, functional assays with the wild type and mutant variants did not generate knockdowns of the si target. This miRNA was originally cloned in a murine system and therefore there is no data demonstrating that the human homologue can be expressed and processed in HEK293 cells.",
                                "miR-890-C/G",
                                "miR-890 3p reporter transfection assays show its ability to knockdown the corresponding ‘si’ target sequence. Transfection and Northern blotting data show that the C/G transversion in miR-890 affects the production of the 3p strand, but not the 5p strand (FIG. 8, SEQ ID NOS: 66-77), with the production of 3p being reduced. Because the C/G transversion may be at the Drosha cleavage site, the exact sequence of its 3p products by miRNA cloning was defined. These data show that the cutting sites for both the 5p and 3p products were not altered by this miR-SNP. The 5p and 3p mature sequences were the same for both the wild type and mutant. Dot blotting analyses (FIG. 16) also show that more clones of the miR-890 than miR-890-C/G for the 3p probe were obtained, which is consistent with the transfection and Northern blot data (FIG. 8).",
                                "miR-892b-T/C",
                                "Like miR-510-T/C and miR-890-C/G, this SNP occurs in the 3p of miR-892b, but miR-892b-3p is listed in miRBase. Although there are currently no published data which support the existence of miR-892b 5p products, our 5p reporter transfection assays show its ability to knockdown the corresponding ‘si’ target sequence. Transfection and Northern blotting data show that the T/C transition in miR-892b affects the production of both 5p and 3p strands (FIG. 9, SEQ ID NOS: 78-87).",
                                "miR-510-G/A",
                                "A G/A transition in pri-miR-510 enhanced the production of miR-510-5p and -3p (-3p is miR-510*) (FIG. 5). The G to A transition occurs at the 4th nt upstream of the 5′ end of the mature miR-510-5p (FIG. 2). Variants at this position may affect Drosha processing of this substrate since it may provide a more stable stem preceding the mature miRNA sequence. The reporter transfection assay data show that the siRNA activity of the mutant is markedly higher than the wild type (FIG. 5A). Northern blot data show that the production of both pre-miR-510 and mature miR-510-5p/3p are increased (FIG. 5B). Dot blotting data also revealed more clones of the miR-510-G/A than miR-510 (FIG. 16A). The miRNA cloning data show that the generation of the 5p product is the same for both the wild type and mutant, and apparently this SNP does not affect the Drosha cutting sites. However, colonies hybridizing to the 3p probe were not observed in either the wild type or SNP blots.",
                                "miR-934-T/G",
                                "SNPs could alternate Drosha or Dicer excision sites since their cutting sites are structure based and not sequence based. Variant miR-934-T/G occurs at the first nucleotide of the miR-934-5p (FIG. 2), which is also the Drosha processing site. Because the variant occurs at the 5′ end and the base of the 5′end plays an important role in strand selection into miRISC, the T/G transversion of this variant is particularly significant. Transfection and Northern blot results show that this SNP affects the production of both strands (FIG. 10, SEQ ID NOS: 88-95).",
                                "First, the transfection assay shows that repression of the 5p reporter is reduced by the SNP, and Northern blots confirmed the reporter assay results (FIG. 10A). Second, the length of the 5p product seems to be increased in the Northern blot. The most dramatic changes are in the 3p product. Transfections show that repression of the 3p reporter by the SNP is increased, and Northern blots show that the variant produces more 3p than wild type. Thus, the guide strand and passenger strand in miRISC are inverted in the wild type versus mutant miRNAs. Cloning also yielded more 5p wild type clones and more mutant 3p clones. The cloning data also show that the production of 3p is altered, with both the Drosha and Dicer cutting sites being offset by one nucleotide from the wild type, resulting in a different 3p product. This not only produced a novel miRNA, but it also affected the strand selection in miR-934/miR-934*. The wild type miR-934-5p starts with a U and is most likely selected as the predominant guide strand due to the lower thermodynamic stability of the 5′ end. The U/G transversion changes the first nucleotide of the 5p product to ‘G’, which affected the Dicer cutting site, moving it back one nucleotide from the original ‘G’ to an ‘A’. Thus the 3p product in the mutant has a lower 5′ end thermodynamic stability and this is probably responsible for altered guide strand selectivity, which is consistent with the reported requirements for asymmetric strand loading.",
                                "The foregoing examples and methods of the invention are illustrative only and are not intended to be limiting of the invention in any way. Those of ordinary skill in the art will recognize that various modifications of the foregoing are within the intended scope of the invention.",
                                "All references cited are incorporated in their entirety as though fully set forth herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze microRNA genes on X chromosome",
                                "identify ultra-rare variants in precursor or mature miRNA",
                                "compare variants in schizophrenia patients and controls",
                                "analyze gene pool for cohort-specific variants",
                                "identify common variants in miRNA precursors",
                                "characterize variants within pre-miRNAs and flanking regions",
                                "categorize SNPs by location within hairpin structure",
                                "assess functional consequences of point mutations",
                                "develop novel assay to monitor miRNA processing and function",
                                "evaluate consequences of point mutations using functional assays",
                                "analyze effects of SNPs on miRNA processing",
                                "study affect of SNPs on maturation of miRNAs",
                                "examine miR-SNPs resulting in reduced processing",
                                "analyze let-7f-2/7f-2* variant",
                                "examine functional consequences of let-7f-2/7f-2* mutation",
                                "analyze miR-18b/18b* variant",
                                "examine functional consequences of miR-18b/18b* mutation",
                                "analyze miR-502-5p/3p variant",
                                "examine functional consequences of miR-502-5p/3p mutation",
                                "analyze miR-188-5p/3p variant",
                                "examine functional consequences of miR-188-5p/3p mutation",
                                "analyze miR-505/505* variant",
                                "examine functional consequences of miR-505/505* mutation",
                                "analyze miR-510 variant",
                                "examine functional consequences of miR-510 mutation",
                                "discuss implications of miR-SNPs on miRNA function and target specificity"
                            ],
                            "num_characters": 13569,
                            "outline_medium": [
                                "analyze microRNA genes on X chromosome",
                                "identify ultra-rare variants in precursor or mature miRNA",
                                "compare variants in schizophrenia patients and controls",
                                "analyze gene pool for cohort-specific variants",
                                "identify common variants in miRNA precursors",
                                "characterize variants within pre-miRNAs and flanking regions",
                                "assess functional consequences of point mutations",
                                "develop novel assay to monitor miRNA processing and function",
                                "evaluate consequences of point mutations on miRNA function",
                                "analyze effects of SNPs on miRNA processing and function",
                                "study effects of SNPs on Drosha or Dicer excision sites",
                                "examine effects of SNPs on strand selection into miRISC",
                                "discuss implications of findings for miRNA function and disease"
                            ],
                            "outline_short": [
                                "analyze microRNA genes on X chromosome",
                                "identify ultra-rare variants in precursor or mature miRNA",
                                "evaluate functional consequences of point mutations",
                                "develop novel assay to monitor processing and function of miRNAs",
                                "analyze effects of SNPs on miRNA processing and function",
                                "discuss implications of results for miRNA biology and disease"
                            ]
                        }
                    ],
                    "outline_long": [
                        "relate invention to schizophrenia diagnosis and treatment",
                        "introduce miRNA gene variant diagnosis method",
                        "describe miRNA gene variant analysis steps",
                        "define miRNA term",
                        "discuss therapeutic applications of miRNAs",
                        "describe miRNA administration methods",
                        "introduce miRNA bioactivity screening method",
                        "describe miRNA variant functionality test",
                        "discuss miRNA variant effects on gene expression",
                        "describe miRNA gene amplification in patients and controls",
                        "identify ultra-rare variants in miRNA genes",
                        "discuss functional analyses of variant miRNA precursors",
                        "describe miRNA biogenesis mechanism",
                        "discuss Drosha and Dicer roles in miRNA processing",
                        "describe miRNA/miRNA* duplex formation",
                        "discuss miRNA strand loading and RISC complex",
                        "describe miRNA-mediated gene regulation",
                        "discuss miRNA target recognition and binding",
                        "describe miRNA seed sequence importance",
                        "discuss miRNA processing and function regulation",
                        "introduce miR-SNP and miR-TS-SNP terms",
                        "discuss miR-SNP effects on miRNA biogenesis and function",
                        "describe miR-SNP associations with diseases",
                        "discuss post-transcriptional miRNA modifications",
                        "describe RNA editing of miRNAs",
                        "discuss edited miRNA effects on target regulation",
                        "describe miRNA gene analysis in patients with schizophrenia",
                        "identify point mutations in X-linked miRNA genes",
                        "discuss effects of miR-SNPs on miRNA generation and function",
                        "describe miR-509-3-5p generation by deletion",
                        "discuss miR-509 structure and function flexibility",
                        "describe factors contributing to miRNA expression profile differences",
                        "discuss miRNA family expansion during primate evolution",
                        "describe gene conversion in miRNA biogenesis",
                        "discuss disease development and progression roles of miR-SNPs",
                        "introduce novel finding of miRNA gene structural variants in schizophrenia",
                        "describe genomic sequence analysis of schizophrenia patients",
                        "discuss identified targets of miRNAs with ultra-rare variants"
                    ],
                    "num_characters": 19474,
                    "outline_medium": [
                        "relate miRNAs to schizophrenia",
                        "describe method of diagnosing schizophrenia using miRNA gene variants",
                        "specify miRNA alleles associated with schizophrenia",
                        "outline steps for analyzing miRNA in biological samples",
                        "define term \"miRNA\"",
                        "discuss therapeutic applications of miRNAs",
                        "describe method of screening for bioactivity of miRNAs",
                        "explain functionality activity comparisons",
                        "identify miRNA genes associated with schizophrenia",
                        "describe miRNA biogenesis and function",
                        "explain importance of \"seed sequence\" in miRNA/mRNA interactions",
                        "describe two-step processing mechanism of mature miRNAs",
                        "discuss role of Drosha and Dicer in miRNA processing",
                        "explain how SNPs in miRNA genes affect miRNA biogenesis and function",
                        "provide examples of miR-SNPs associated with diseases",
                        "discuss post-transcriptional modification of miRNAs",
                        "analyze X-linked miRNA genes from patients with schizophrenia",
                        "identify ultra-rare variants in precursor or mature miRNA",
                        "discuss implications of findings for understanding schizophrenia"
                    ],
                    "outline_short": [
                        "introduce miRNA involvement in schizophrenia",
                        "describe method of diagnosing schizophrenia using miRNA gene variants",
                        "explain therapeutic applications of miRNAs in schizophrenia treatment",
                        "outline method of screening for bioactivity of miRNA variants",
                        "describe miRNA biogenesis and function",
                        "discuss impact of SNPs on miRNA biogenesis and function",
                        "present results of experiments analyzing X-linked miRNA genes in patients with schizophrenia",
                        "identify ultra-rare variants in miRNA genes associated with schizophrenia",
                        "discuss implications of miRNA gene dysfunction in schizophrenia development"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of diagnosing schizophrenia or a schizophrenia spectrum disorder in an individual by determining the presence of a variant of a miRNA gene or allele.",
        "2. The method of claim 1, wherein the miRNA is selected from the group consisting of let-7f-2, mir-18b, mir-505, mir-502, mir-188, mir-325, mir-660, mir-509-3, mir-510, mir-421, mir-934, mir-890, mir-892, and mir-450a-2.",
        "3. The method of claim 2, wherein the diagnosis determines the presence of more than one variant of miRNA that indicates schizophrenia or a schizophrenia spectrum disorder.",
        "4. The method of claim 1, wherein determining the presence of a variant of a miRNA gene or allele comprises:\na) isolating miRNA from a sample taken from an individual; and\nb) comparing the miRNA from the individual to known variants of miRNA, which variants indicate schizophrenia or a schizophrenia spectrum disorder.",
        "5. A method of determining an increased risk for a schizophrenia or propensity thereto in a subject comprising the steps of:\na) analyzing the miRNA in a sample obtained from the subject; and\nb) determining the presence of a variant of the miRNA wherein the presence of said variant is indicative of an increased risk for developing schizophrenia or propensity thereto in the subject.",
        "6. The method of claim 5, wherein the miRNA is selected from the group consisting of let-7f-2, mir-18b, mir-505, mir-502, mir-188, mir-325, mir-660, mir-509-3, mir-510, mir-421, mir-934, mir-890, mir-892, and mir-450a-2.",
        "7. A method of determining altered functionality of a miRNA gene or allele variant, comprising:\na) isolating pri-miRNA and variant miRNA;\nb) co-transfecting pri-miRNA and variant miRNA with a corresponding si target and a corresponding mi target with reporters;\nc) determining whether the variant has altered function of the target by running both miRNA and siRNA assays, wherein\nreduced or enhanced repression of the si and mi reporters in transient transfection assays indicates altered functionality of the miRNA gene or allele variant.",
        "8. The method of claim 7, wherein the variant is a point mutation.",
        "9. The method of claim 7, wherein the variant is a deletion, insertion, or translocation.",
        "10. The method of claim 7, wherein the miRNA gene or allele variant indicates the condition of schizophrenia."
    ]
}