{
    "id": "https://semopenalex.org/work/W2065942320",
    "authors": [
        "Subbiah Nagarajan",
        "George John",
        "Kent D. Chapman",
        "Elison B. Blancaflor",
        "Bibi Rafeiza Khan",
        "Lionel Faure",
        "Peter Koulen",
        "Christa Montgomery",
        "Hyeondo Hwang"
    ],
    "title": "Synthesis of Phenoxyacyl-Ethanolamides and Their Effects on Fatty Acid Amide Hydrolase Activity",
    "date": "2014-03-01",
    "abstract": "N-Acylethanolamines (NAEs) are involved in numerous biological activities in plant and animal systems. The metabolism of these lipids by fatty acid amide hydrolase (FAAH) is a key regulatory point in NAE signaling activity. Several active site-directed inhibitors of FAAH have been identified, but few compounds have been described that enhance FAAH activity. Here we synthesized two sets of phenoxyacyl-ethanolamides from natural products, 3-n-pentadecylphenolethanolamide and cardanolethanolamide, with structural similarity to NAEs and characterized their effects on the hydrolytic activity of FAAH. Both compounds increased the apparent Vmax of recombinant FAAH proteins from both plant (Arabidopsis) and mammalian (Rattus) sources. These NAE-like compounds appeared to act by reducing the negative feedback regulation of FAAH activity by free ethanolamine. Both compounds added to seedlings relieved, in part, the negative growth effects of exogenous NAE12:0. Cardanolethanolamide reduced neuronal viability and exacerbated oxidative stress-mediated cell death in primary cultured neurons at nanomolar concentrations. This was reversed by FAAH inhibitors or exogenous NAE substrate. Collectively, our data suggest that these phenoxyacyl-ethanolamides act to enhance the activity of FAAH and may stimulate the turnover of NAEs in vivo. Hence, these compounds might be useful pharmacological tools for manipulating FAAH-mediated regulation of NAE signaling in plants or animals.",
    "sections": [
        {
            "title": "Hence, these compounds might be useful pharmacological tools for manipulating FAAH-mediated regulation of NAE signaling in plants or animals.",
            "paragraphs": [
                "Fatty acid amide hydrolase (FAAH) 4 belongs to the superfamily of amidase signature proteins (1)(2)(3). FAAH enzymes are found in diverse groups of organisms, including both plants and animals. FAAH enzymes hydrolyze a broad range of N-acylethanolamines (NAEs) to corresponding free fatty acid and ethanolamine (4 -6) and can also act on primary acyl amides as well as acyl esters (3). In plants, one type of FAAH has been characterized (7), whereas two distinct FAAHs have been described in animal systems (2,8). The homology between plant (Arabidopsis) and mammalian (rat) FAAH proteins at the amino acid level is somewhat low over the full length of the proteins. However, the amidase signature sequences (with core catalytic residues) between plant and animal FAAH share up to 60% similarity at the amino acid level (1). The x-ray crystallography data of the rat protein provided new insights about the mode of action of this enzyme in NAE hydrolysis identifying a Ser-Ser-Lys catalytic triad (9,10). Although no tertiary structure has been determined yet for plant FAAH, a structural homology model was developed for the amidase domain of the Arabidopsis FAAH protein, and conserved catalytic residues were identified experimentally (10,11).",
                "The activity of FAAH is a key regulatory feature of the NAE signaling pathway. The regulated accumulation of NAEs influences numerous functions in plants and animals. The functional activities and physiological effects of NAEs are mostly terminated by their degradation to FFA and ethanolamine. In plants, NAEs are involved in seedling establishment and growth (6). Exogenously applied N-lauroylethanolamine (NAE 12:0) arrests seedling growth, and this is evident through marked changes in root architecture and elongation (12,13). This inhibitory effect of NAEs on seedling growth occurs in part through a complex interaction with ABA (abscisic acid) signaling machinery during the embryo-to-seedling transition that remains incompletely understood (14 -16). On the other hand, reductions of endogenous seed NAE levels through the overexpression of FAAH in Arabidopsis results in enhanced seedling growth and increased size of roots, cotyledons, and other plant organs (13). Other physiological processes have been attributed to FAAH-mediated alteration of NAE levels in plants, such as flowering time, which is induced by the expression and translocation of the FT (flowering locus T) protein from leaves to the vegetative meristem. FAAH-overexpressing plants exhibited an early flowering phenotype in both inductive and non-inductive growth conditions, and this was associated with lower NAE levels and higher expression of FT and other key flowering genes (16). Still other work has attributed changes in host susceptibility to pathogens (17,18) or changes in phytohormone signaling pathways (11,14,18) with altered FAAH expression.",
                "In animals, FAAH-mediated NAE changes are part of the so-called \"endocannabinoid signaling pathway,\" and this pathway plays a central regulatory role in many physiological and behavioral processes (19). The most widely studied NAE in animal systems is the N-arachidonylethanolamine, known also as anandamide (NAE 20:4) ( 20), but other NAE species with overlapping or unique functions are known as well. As an example, N-linoleoylethanolamine (NAE 18:2) and N-palmitoylethanolamine (NAE 16:0) are involved in neuron protection in the retinal ganglion cell layer against excessive extracellular glutamate and against oxidative stress for the HT22 cells, respectively (21,22). Anandamide was identified as the first endogenous ligand of the cannabinoid receptors (CB1 and CB2) and is involved in activating many of the important endocannabinoid pathways (20,23,24). Anandamide and other NAEs have been associated with different processes, such as pain modulation, memory, anxiety, appetite, etc. (25)(26)(27). Their levels are controlled largely through hydrolysis by FAAH. Thus, FAAH has become a major therapeutic target for many disorders that involve NAE signaling in situ.",
                "Several approaches have been employed to increase the level of NAEs in plants or animals, including the direct application of NAEs or pharmacological reagents that inhibit NAE degradation. Utilization of general serine protease inhibitors and/or specific inhibitors of FAAH activity, such as phenylmethylsulfonyl fluoride (PMSF), 5Z,8Z,11Z,14Z-eicosatetraenyl-methyl ester phosphonofluoridic acid (MAFP), and 3Ј-(aminocarbonyl)-[1,1Ј-biphenyl]-3-yl)-cyclohexylcarbamate (URB597), have been reported to elevate endogenous levels of NAE and to extend or amplify processes regulated by NAE signaling (28). Genetic approaches have been developed to reduce FAAH expression (FAAH knockouts) in mice and Arabidopsis (13,29), although this approach has shown limited success, especially in plants where it appears that there are redundant pathways for NAE catabolism and where it has been difficult to raise endogenous NAE levels dramatically in vivo. On the other hand, it has been possible to overexpress FAAH in plants and reduce NAE levels to some extent to influence several physiological processes, including growth, defense, and flowering (13,16,18). However, there is limited information on chemical compounds that reduce the NAE content in plant and animal systems via enhanced FAAH activity.",
                "Among the multitude of renewable resources, cashew nut shell liquid is an important by-product of the cashew nut industry that is currently used for green chemicals and technologies (30). More than 32% of the cashew shell is cashew nut shell liquid, the key constituent of cashew nut shell liquid being cardanol, a bio-based non-isoprene lipid, consisting of a rich mixture of phenolic lipids: 5% 3-(n-pentadecyl)-phenol (PDP), 50% 3-(8Z-pentadecenyl)phenol, 16% 3-(8Z,11Z-pentadecadienyl)phenol, and 29% 3-(8Z,11Z,14-pentadecatrienyl)phenol. Cardanol's unique properties stem from the varying degree of cisdouble bonds and an odd number of hydrocarbons with easily accessible saturated and unsaturated hydrocarbon chains (31).",
                "Here, we synthesized a new set of phenoxyacyl-ethanolamides from this cashew nut shell liquid renewable resource with structural similarity to NAEs to investigate their effects on FAAH activity and to explore the potential utility of natural mixtures in cardanol ethanolamide compared with the pure, saturated analog pentadecylphenoxy ethanolamide. These phenoxyacyl-ethanolamides were not substrates for FAAH; however, we measured a positive effect of these compounds on NAE hydrolysis by recombinant FAAH. The increase in enzyme turnover rate is probably through relief from product inhibition by ethanolamine, a property not previously appreciated for either plant or mammalian FAAH enzymes. It is possible that compounds like these phenoxyacyl-ethanolamides might prove useful in manipulating NAE levels in vivo through their actions on FAAH."
            ],
            "subsections": [
                {
                    "title": "EXPERIMENTAL PROCEDURES",
                    "paragraphs": [
                        "Materials-[1-14 C]Lauric acid was from Amersham Biosciences, [1-14 C]palmitic acid and [1-14 C]arachidonic acid were purchased from PerkinElmer Life Sciences. Ethanolamine, anandamide, isopropyl-␤-D-thiogalactopyranoside, and Triton X-100 were from Sigma. N-Dodecyl-␤-D-maltoside (DDM) was from Calbiochem. Sprague-Dawley rat embryonic day 18 cortical neurons, NeuroPapain, NeuroPrep medium, and Neuro-Pure plating medium were obtained from Genlantis (San Diego, CA). Neurobasal media, B27 supplement, B27 antioxidant-free supplement, GlutaMAX I, and calcein-AM were purchased from Invitrogen. BD PureCoat TM amine plates were obtained from BD Biosciences. DMSO and 2-hydroxypropyl-␤-cyclodextrin were purchased from Sigma. tert-Butyl hydroperoxide (tBHP) was obtained from Acros Organics (part of Thermo Fisher Scientific). PBS and penicillin/streptomycin were purchased from Lonza (Walkersville, MD). Palmitoylethanolamide (NAE 16:0) was from Best West Laboratories (Salt Lake City, UT), MAFP was from Tocris Biosciences, and URB597 was from EMD Millipore. Silica Gel G (60 A)-coated glass plates for thin layer chromatography (10 ϫ 20 cm or 20 ϫ 20 cm, 0.25-mm thickness) were from Whatman. Different species of N-[1-14 C]acylethanolamines (and non-radiolabeled NAEs) were synthesized from ethanolamine and corresponding 1-14 C-labeled fatty acids (and non-radiolabeled FFAs) by first producing the fatty acid chloride (32) and purifying by thin layer chromatography (TLC) as described elsewhere (33). The chemical compounds 3-n-pentadecylphenol-ethanolamide and cardanolethanolamide (cardanol-EA) were produced as described below.",
                        "Synthesis of PDP-EA and the More General Mixed Species Cardanol-EA-For the cardanol-EA, in a round bottom flask fixed with a magnetic stirrer, cardanol-methyl ester (3.74 g, 10 mmol) was added, followed by dichloromethane (25 ml) and triethylamine (1.4 ml, 10 mmol). The reaction mixture was stirred for 2 min, followed by the dropwise addition of ethanolamine (0.66 ml, 11 mmol) in an ice bath with constant stirring. The resultant mixture was stirred at room temperature for about 6 -8 h. After completion of the reaction, as identified using TLC, ice-cold water was added, and the lipids were extracted with ethyl acetate. The organic phase was separated and dried over anhydrous sodium sulfate, filtered, and concentrated. Pure product as a colorless liquid was obtained by column chromatographic purification. At 5 °C, the viscous liquid solidifies into a pale yellow solid. Yield ϭ 78%. 1  Plasmid Constructs-The recombinant plasmid, rat FAAH1-pTrcHis2 (NCBI accession number NP_077046), was provided by Dr. Benjamin Cravatt's laboratory (34), and the plasmid At-FAAH-pTrcHis2 (At5g64440, UniProt number Q7XJJ7) was constructed as described previously (7). The expression constructs were introduced into chemically competent Escherichia coli TOP10 cells as host as described in the manufacturer's instructions.",
                        "Protein Expression and Solubilization for Enzymatic Assays from Different Bacteria Cultures (E. coli)-The different cell lines were grown in 250 ml of LB medium with 100 g⅐ml Ϫ1 filtered ampicillin to an A 600 of 0.6 and induced with 1 mM isopropyl-␤-D-thiogalactopyranoside for 4 h at 37 °C. Each cul-ture was centrifuged at 5000 rpm for 10 min at 4 °C in a Beckman tabletop centrifuge (rotor, GH 3.7). The pelleted cells expressing rat FAAH1 or At-FAAH1 were resuspended in 10 ml of lysis buffer A (50 mM Tris-HCl, pH 8.0, 100 mM NaCl, 1% Triton X-100) or 10 ml of lysis buffer B (50 mM Tris-HCl, pH 8.0, 100 mM NaCl, 0.2 mM DDM). After incubation on ice for 30 min, resuspended cells were sonicated on ice with 10 30-s bursts at 50% intensity with 30-s cooling (ice) periods between bursts. Each crude lysate was centrifuged at 13,000 ϫ g for 20 min at 4 °C in a Sorvall RC 5C model ultracentrifuge (Sorvall rotor, SS-34). The supernatant was applied to a QiQexpress nickel-nitrilotriacetic acid fast start (Qiagen) column, and the proteins were purified according to the manufacturer's instructions. The purified fractions (2 ml) were concentrated, and imidazole was removed with buffer C (50 mM BisTris propane-HCl, pH 9.0, 0.2 mM DDM) by filtration-centrifugation using Centricon YM-30 (Millipore, Bedford, MA) devices. The protein concentration was estimated by Bradford reagent (Sigma) against a BSA standard curve, and the purity of the proteins was evaluated by SDS-PAGE and Western blotting. The rat or Arabidopsis thaliana FAAH (At-FAAH) proteins were aliquoted (20 l) and stored at Ϫ80 °C for up to several months and thawed once for use."
                    ],
                    "subsections": [
                        {
                            "title": "SDS-PAGE and Western",
                            "paragraphs": [
                                "Blotting of Purified FAAH Proteins-Each aliquot (rat or At-FAAH protein) was separated by SDS-PAGE (10% resolving gels) as described previously (7). The proteins were visualized in gels by Coomassie Blue staining, or proteins were electrophoretically transferred to polyvinylidene fluoride (PVDF) membranes (0.2 m; Bio-Rad) according to the protocol described elsewhere (10). The recombinant proteins expressing the His tag at the C terminus were detected by chemiluminescence using a 1:2000 dilution of mouse monoclonal anti-His antibodies (ABGENT, San Diego, CA) and a solution of 1:4000 dilution of goat anti-mouse IgG conjugated to a peroxidase (Bio-Rad).",
                                "FAAH Assays on Purified Proteins from Different E. coli Cell Lines-The NAE amidohydrolase assays were conducted as described previously (7,10,33) with few modifications. The reactions were conducted for 30 min at 30°C, 120 rpm, in 150 l of BTP buffer (50 mM BisTris propane-HCl, pH 9.0) containing different concentrations of radiolabeled NAEs, the new NAElike compounds, and different concentrations of purified protein (see figure legends for more details of the composition of each reaction mixture). Enzyme reactions were terminated by the addition of hot isopropyl alcohol (70 °C). The lipids were extracted, and the distribution of the radioactivity was evaluated by radiometric scanning of TLC plates as described elsewhere (10).",
                                "Ethanolamine Inhibition Assays on Purified FAAH Enzymes-Assays containing 0.3 g of purified protein were first incubated with 100 M PDP-EA or cardanol-EA and then with different concentrations of ethanolamine (0 -100 mM) (V f ϭ 150 l of buffer C). Reactions were initiated by adding 100 M radiolabeled NAE and terminated as described above. The lipids were extracted, and the total distribution of the radioactivity was calculated as above.",
                                "Plant Material and Cultures-Ten mg of A. thaliana (ecotype Col-0) seeds were surface-sterilized and then stratified in the dark for 2 days at 4 °C prior to sowing in liquid (75 ml) or solid Murashige and Skoog medium (14). Growth of seedlings was in a 16-h light/8-h dark cycle (60 mol⅐m Ϫ2 ⅐s Ϫ1 ) for 11 days at 20 °C.",
                                "Plant Protein Extraction-After 11 days in liquid culture, the plant material was rinsed with milliQ water and then blotted dry. With a mortar and pestle, the plant material (500 mg) was ground with liquid nitrogen and then with 2 ml of plant protein solubilization solution (0.1 M potassium phosphate buffer, pH 7.2, 400 mM sucrose, 10 mM KCl, 1 mM EDTA, 1 mM EGTA, 1 mM MgCl 2 ) with 0.2 mM DDM. The crude extract was centrifuged at 2000 rpm at 4 °C for 10 min in a Beckman (rotor, GH 3.7). The supernatant, containing the total solubilized proteins, was stored at 4 °C for up to 2 days.",
                                "Plant Amidohydrolase Assays-The reactions were conducted at 30 °C for 2 h in BTP buffer (50 mM BisTris propane-HCl, pH 9.0) with 300 M PDP-EA or cardanol-EA and 200 M radiolabeled NAE 12:0. Reactions were initiated by adding 5 g of total protein and terminated by the addition of hot isopropyl alcohol. Lipids were extracted and analyzed as above.",
                                "Primary Neuronal Culture-Commercially obtained Sprague-Dawley rat embryonic day 18 cortical tissue was allowed to settle for 5-10 min at room temperature, the shipping medium was removed (reserved at 37 °C), and the tissue was enzymatically treated with NeuroPapain dissolved in NeuroPrep medium (2 mg⅐ml Ϫ1 , 2.5 ml) for 28 min at 37 °C with gentle swirling every 7 min. Treated tissue was centrifuged for 1.5 min at 200 ϫ g, and the cells were dissociated by gentle trituration in 1 ml of the reserved shipping medium. Cells were collected by centrifugation as above and resuspended by gentle trituration in 1 ml of NeuroPure plating medium. Viable cells were counted (Nexcelom Auto T4; Nexcelom Bioscience LLC, Lawrence, MA), resuspended in 9 ml of NeuroPure plating medium plus enough neurobasal medium (supplemented with B27; GlutaMAX I (2 mM), penicillin (50 units/ml), and streptomycin (50 g⅐ml Ϫ1 )) to achieve a density of 250,000 cells/ml, and seeded in BD Pure-Coat TM black-walled amine-coated 96-well plates in a 100-l volume. Cultures were maintained at 37 °C, 5% CO 2 , 95% humidity for 7 days prior to experiments with a 50% medium exchange on day 3.",
                                "Effects of Cardanol-EA on Cultured Primary Neurons-One hundred millimolar cardanol-EA in DMSO was diluted 1:5 in warm 40% 2-hydroxypropyl-␤-cyclodextrin dissolved in DMSO and incubated for 10 min at 50 °C prior to serial dilution in warm neurobasal medium containing antioxidant-free B27 supplement, GlutaMAX I (2 mM), penicillin (50 units/ml), and streptomycin (50 g⅐ml Ϫ1 ). Growth medium was exchanged for 100 l of antioxidant-free medium containing serial dilutions of cardanol-EA or vehicle (0.6% DMSO, 0.2% 2-hydroxypropyl-␤-cyclodextrin), and plates were incubated as described above for 1-2 h. Oxidative stress was induced by the addition of concentrated tBHP to achieve a final concentration of 7.5 M. Controls were treated with an equivalent volume of PBS. After 16 -18 h, the cell culture medium was replaced with 100 l of prewarmed PBS containing 5 g⅐ml Ϫ1 calcein-AM, and plates were returned to the incubator for 30 min. Cell viability was determined by measuring calcein fluorescence on a FlexStation3 plate reader (Molecular Devices, Sunnyvale, CA) at 485/525 nm excitation/emission with a 515 nm emission cut-off, subtracting the background, and normalizing to the vehicle control. Three separate experiments obtained from different cultures (different animals) of primary neurons were performed. For each condition, six replicate wells were measured, and the mean value was used for statistical analyses. Data were analyzed and plotted using Prism version 5.0 (GraphPad Software Inc., La Jolla, CA).",
                                "Treatment of Cultured Primary Neurons with FAAH Inhibitors or Substrate-The FAAH substrate, NAE 16:0 (N-palmitoylethanolamine), was emulsified in 40% 2-hydroxypropyl-␤cyclodextrin dissolved in DMSO by sonication at 50 °C to a final concentration of 50 mM. The FAAH inhibitors MAFP and URB597 were dissolved in DMSO at a concentration of 100 mM. Growth medium was exchanged for 100 l of antioxidant-free medium or antioxidant-free medium containing vehicle or serial dilutions of substrate or inhibitor, and plates were incubated as above. After 1 h, 5 l of 2 ϫ 10 Ϫ8 M cardanol-EA in antioxidant-free medium prediluted as above was added to the conditions indicated, and plates were gently mixed and returned to the incubator. After another 1 h, oxidative stress was induced as described above. Viability assay, replicates, and analyses were performed as described above."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "RESULTS",
                    "paragraphs": [
                        "Phenoxyacyl-Ethanolamide Synthesis-We developed a simple method that proceeds by refluxing the mixture of phenolic lipids 3-PDP (Fig. 1,1) or cardanol (2) and methylbromoacetate in the presence of K 2 CO 3 as a base and 2-butanone as a solvent to generate the desired PDP-methylester (3) or cardanolmethylester (4), (35,36). Amide bond formation of methylester by chemoselective reaction with ethanolamine as N-nucleophile in dry dichloromethane and triethylamine as base yielded the desired phenoxyacyl ethanolamides (5 and 6) in good yield and purity. The products were separated by column chromatography and characterized by both NMR spectroscopy ( 1 H and 13 C NMR) and mass spectrometric analysis. 1 H NMR spectra of compounds 5 and 6 (Fig. 1) showed signals at ␦ 7.1 ppm for -NH proton and ␦ 2.7 ppm for -OH proton, respectively. The exchangeable nature of these protons was identified using D 2 O exchange studies. High resolution mass spectral analysis of PDP-EA and cardanol-EA showed a molecular ion peak (M ϩ H ϩ ) at m/z 406.3321 and m/z 404.3163, respectively, which exactly matches with the theoretically calculated value (PDP- Protein Purification and Amidohydrolase Assays-Enzymatic assays were performed with two different purified recombinant proteins: At-FAAH (UniProt number Q7XJJ7) and rat FAAH (NCB accession number NP_077046) (34). Expression and purification of these proteins were monitored by SDS-PAGE and Western blotting (Fig. 2). Bands observed in the SDS-polyacrylamide gel are consistent with the molecular masses calculated for each protein plus the His tag (C terminus of the protein), which are 70 kDa for At-FAAH and 66 kDa for rat FAAH. Both proteins were also detected by Western blot using an anti-His tag monoclonal antibody with some unavoidable proteolytic degradation evident (Fig. 2, lane 5). The inclusion of serine protease inhibitors was avoided so as not to influence FAAH activity.",
                        "Utilization of Triton X-100 during protein extraction is mandatory to recover the activity of the rat protein (34) but not for At-FAAH. However, amidohydrolase assays performed with At-FAAH extracted in presence of 1% (v/v) Triton X-100 showed an increase by a factor of about 10 for hydrolysis of NAE to FFA compared with assays performed with protein extracted in 0.2 mM DDM (data not shown). This increase of activity could be explained by improved solubilization of the protein, the lipophilic NAE substrate, and/or FFA product (34). For consistency and optimal activity, extraction of recombinant proteins in Triton X-100 was performed for all subsequent experiments.",
                        "Enhanced NAE Amidohydrolase Activity with the Plant or Rat FAAH in the Presence of PDP-EA and Cardanol-EA-Neither of the NAE-like compounds (PDP-EA and cardanol-EA) appeared to be hydrolyzed to their respective acid forms (PDPacid and cardanol-acid) and ethanolamine by either the plant or animal FAAH enzymes (2 g of protein and 100 -300 M substrate) (Fig. 3). Somewhat surprisingly, compared with NAE 12:0, the phenoxyacyl-ethanolamides were not suitable sub-strates for FAAH, as might be anticipated from the promiscuous nature of the FAAH enzymes (3).",
                        "To test whether these phenoxyacyl-ethanolamides might serve as inhibitors of NAE hydrolysis by the FAAH enzymes, we measured the hydrolysis of 100 M [1-14 C]NAE 12:0 with or without 100 M PDP-EA or cardanol-EA. Instead of reductions in FAAH activity as expected, the amidohydrolase activity of both FAAH enzymes toward NAE was increased in the presence of either phenoxyacyl-ethanolamide compound (Fig. 4). Non-enzymatic hydrolysis of NAE to free fatty acid by PDP-EA or cardanol-EA could be ruled out because no activity was measured in assays using heat-denatured enzyme (Fig. 4G). FAAH activities toward different NAEs, such as N-[1-14 C]palmitoylethanolamine (NAE 16:0) or N-[1-14 C]arachidonoylethanolamine (NAE 20:4, anandamide), showed a similar enhancement in the presence of the new NAE-like compounds (Fig. 5). An increase of activity by a factor of about 4 Ϯ 1.2 for the recombinant At-FAAH protein was measured in the presence of either PDP-EA or cardanol-EA, by a factor of about 5 Ϯ 2.2 for the rat FAAH protein for the unsaturated NAE (NAE 16:0 and NAE 12:0), and by up to a factor 7 Ϯ 1.1 for the rat FAAH protein and NAE 20:4 (Fig. 5).     Both apparent V max (V max app ) and apparent K m (K m app ) were calculated for each enzyme and summarized (Fig. 6). No statistical difference (t test, confidence level 95%) for the K m app values of the At-FAAH was observed with or without a 100 M concentration of either PDP-EA or cardanol-EA (Fig. 6). However, catalytic efficiency (K cat /K m ) of the At-FAAH enzyme increased in the presence of both phenoxyacyl-ethanolamides particularly for the cardanol-EA compounds (1.2 ϫ 10 5 M Ϫ1 / s Ϫ1 ) compared with solvent control of 5 ϫ 10 4 M Ϫ1 /s Ϫ1 ). The K m app obtained in our assays for the plant FAAH was similar to K m values determined elsewhere (17.6 M) (7)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Enhancers of Amidohydrolase Activity",
            "paragraphs": [
                "For the rat FAAH, there was a modest increase in the K m estimated in the presence of both phenoxyacyl-ethanolamide compounds (66 Ϯ 5.52 and 85 Ϯ 8 M) compared with that measured in solvent controls (55 Ϯ 6.12 M). Similar to At-FAAH, rat FAAH exhibited an increase in K cat in the presence of PDP-EA and cardanol-EA, indicating an increase in turnover rate of the recombinant protein with respect to NAE. An increase by a factor of 2-3 in the ratio K cat /K m was calculated for the rat FAAH with the phenoxyacyl-ethanolamides, suggesting an increase in the catalytic efficiency of the rat enzyme with these compounds. Although there is variation in the reported kinetic parameters for rat FAAH, those measured here were similar to those reported elsewhere (37)."
            ],
            "subsections": [
                {
                    "title": "Protection by Phenoxyacyl-Ethanolamides from Ethanolamine Product Inhibition for both At-FAAH and Rat FAAH-We",
                    "paragraphs": [
                        "noted a statistical dose-dependent reduction in NAE hydrolase activity at increasing ethanolamine concentrations (Fig. 7). Although enzyme regulation by product inhibition is not uncommon, feedback inhibition of FAAH by ethanolamine has not been described, neither for rat nor for At-FAAH. We demonstrated that this regulatory feature is evident for both At-FAAH and rat FAAH. Perhaps even more interestingly, both PDP-EA and cardanol-EA relieved this ethanolamine inhibition almost completely at concentrations up to 10 mM ethanolamine (Fig. 7). No dramatic change in pH of the reaction was measured following the addition of ethanolamine (up to 10 mM, pH 9.0; at 100 mM, pH 9.7; 25 °C), indicating the inhibitory effects of ethanolamine were not due to alterations in reaction pH.",
                        "Effects of PDP-EA and Cardanol-EA on Plant Growth-Negative effects on seedling growth by exogenous NAE 12:0 are well documented (13)(14)(15). PDP-EA and cardanol-EA were able to reverse partially these negative growth effects (Fig. 8). Representative images of Arabidopsis seedlings germinated and grown in medium containing NAE 12:0 alone or containing NAE 12:0 with PDP-EA or cardanol-EA are shown in Fig. 8  (A-C). Quantitative measurements of seedling growth (cotyledon size and primary root elongation) are summarized in Fig. 8, E and F. Despite a structure somewhat similar to that of NAE 12:0, PDP-EA alone and especially cardanol-EA alone showed a positive impact on seedling growth (cotyledon size, Fig. 8, D andE) opposite to the effects of NAE 12:0. And both compounds partially reversed the negative effects of NAE 12:0 with respect to cotyledon size. Cardanol-EA reversed negative growth effects of NAE 12:0 in primary roots. One potential explanation for these effects on seedling growth by PDP-EA and cardanol-EA is through their biochemical enhancement of At-FAAH activity in vivo. FAAH overexpression in transgenic Arabidopsis (with increased FAAH activity) conferred enhanced seedling growth as well as tolerance of the negative growth effects of NAE (13), with effects on cotyledon size and primary root length very similar to those observed here by adding these phenoxyacyl-ethanolamides to non-transgenic seedlings (Fig. 8). As expected, NAE amidohydrolase activity from crude seedling extracts showed an enhancement when assayed in the presence of PDP-EA or cardanol-EA and [1-14 C]NAE 12:0 (Fig. 8G). Therefore, it is possible that exogenous application of these phenoxyacyl-ethanolamides can stimulate FAAH activity in planta and positively influences plant growth.",
                        "Effects of Cardanol-EA on Viability of Cultured Primary Neurons-Treatment of cultured embryonic primary neurons with cardanol-EA exacerbated tBHP cell death (Fig. 9). Following overnight exposure to oxidative stress induced by treatment with 7.5 M tBHP, neuronal cultures pretreated with 1 M cardanol-EA contained 18% fewer viable cells than cultures pretreated with vehicle alone (Fig. 9A). Incubation of neurons with the exogenously administered FAAH substrate, NAE 16:0 (N-palmitoylethanolamine) (38) for 1 h prior to the addition of 1 nM cardanol-EA resulted in a dose-dependent reversal of cardanol-induced exacerbation of tBHP-mediated cell death (Fig. 9B). Primary neurons treated with cardanol-EA and incubated in antioxidant-free medium overnight demonstrated a signifi-cant reduction in viability compared with neurons incubated overnight in antioxidant free medium with vehicle or with the specific, irreversible FAAH inhibitors (26) MAFP and URB597 (Fig. 9, C and D, respectively). Additional experiments at different concentrations of vehicle confirmed these results (not shown). Incubation of neurons with these inhibitors for 1 h prior to the addition of cardanol-EA completely reversed cardanol-induced exacerbation of tBHP-mediated cell death, suggesting that this ex vivo effect of cardanol-EA is a result of FAAH activation."
                    ],
                    "subsections": []
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "Despite the structural similarity between the phenoxyacylethanolamide compounds synthesized for these studies (Fig. 1) and the naturally occurring NAE lipids that are present in essentially all multicellular eukaryotes, neither of the FAAH proteins (rat or Arabidopsis) were able, in our conditions, to utilize these compounds efficiently as substrates for hydrolysis (Fig. 3). This was somewhat surprising, given the broad range of acyl amides and acyl esters that can be hydrolyzed by FAAH (3). On the other hand, previous studies demonstrated that substitutions at the ␣-position of the acyl chain of primary amide or anandamide analogue compounds rendered the compound resistant to hydrolysis by FAAH (39,40). The incorporation of a bulky phenoxy-group near the amide moiety may serve a similar structural hindrance to the enzyme's active site and restrict hydrolysis. However, even if these newly synthesized lipids were not used as substrates by FAAH, we speculated that these compounds would act as inhibitors toward NAE hydrolysis. Instead, a rather unique characteristic was identified for these compounds; we found that these phenoxyacyl-ethanolamides functioned to stimulate hydrolysis of NAEs by FAAH (Figs. 456). These compounds stimulated the activity of FAAH from both plant and mammalian sources, suggesting a more general feature of FAAH, not specific to the type of organism. There were subtle differences between plant and mammalian FAAH, such as the impact of the phenoxyacyl-ethanolamides on the affinity of the enzyme toward NAEs (raised the K m for NAE 20:4 in rat FAAH substantially in the presence of the cardanol-EA and the K m for NAE 12:0 of At-FAAH in the presence of PDP-EA). On the other hand, in both plant and mammalian FAAH, the turnover number of the enzyme was increased by the addition of the phenoxyacyl-ethanolamides (Fig. 6). Moreover, a new negative feedback property of FAAH activity by ethanolamine was discovered for both FAAH proteins, and this was prevented to a substantial degree by the addition of the phenoxyacyl-ethanolamides (Fig. 7).",
                        "The detergent Triton X-100 has been used extensively for the solubilization and to enhance the recoverable activity of recombinant rat FAAH (2,34,41). This non-ionic detergent probably mimics somewhat the endogenous membrane environment of FAAH and maintains the functional amidase and esterase activities of the enzyme toward lipophilic substrates. In the case of At-FAAH, Triton X-100 appeared to be better than the alkylglycoside detergent, DDM, historically used for solubilizing active At-FAAH enzyme (7). However, K m values measured here were generally similar for At-FAAH solubilized in DDM (26 Ϯ 5.09 M (Fig. 6) versus 13-50 M (7)), and this procedural change allowed for more consistent comparisons between plant and animal FAAH enzymes for our comparative studies. Even so, both PDP-EA and cardanol-EA enhanced FAAH activities from both plant and animal sources (Figs. 456) and prevented product inhibition by ethanolamine at least up to 10 mM (Fig. 7). The increase in FAAH turnover number measured in Fig. 6 in the presence of phenoxyacyl-ethanolamides may be a direct result of prevention of product inhibition by ethanolamine, even in the case of rat FAAH, where the affinity for NAE substrate appeared to be reduced by the phenoxyacyl-ethanolamide analogues. It still remains to be clarified directly whether the effect of the phenoxyacyl-ethanolamides is via a specific binding site on FAAH or is more general in terms of influencing FAAH or substrate solubility/accessibility. PDP-EA or cardanol-EA could displace the NAE from micelles, making it more accessible to the enzyme. Alternatively, PDP-EA or cardanol-EA could influence the ratio ethanolamine/protein and alter the product inhibition of FAAH. Although unlikely, it is possible that another minor protein contaminates both the rat and At-FAAH protein preparations, influencing the results. Interestingly, there are some structural similarities between Triton X-100 and both phenoxyacyl ethanolamides. However, the rat-FAAH protein purified with a lysis buffer containing 15 mM PDP-EA or cardanol-EA instead of 15 mM Triton X-100 (0.1%) showed no recoverable activity (unlike protein purified with the original detergent; data not shown). Therefore, despite structural similarities between the phenoxyacyl ethanolamides and Triton X-100, they are insufficient to act as detergents and solubilize active FAAH on their own. On the other hand, the effects of these compounds on NAE-mediated inhibition of seedling growth or in the modulation of neuronal cell death would suggest that these compounds indeed act through a specific effect on the FAAH enzyme per se.",
                        "NAE 12:0 inhibits seedling growth when applied exogenously (see Fig. 8 and also Refs. 11, 13, and 15). Co-application of PDP-EA and especially cardanol-EA reversed these inhibitory growth effects of NAE 12:0 (Fig. 8). Similarly, the overexpression of FAAH in transgenic Arabidopsis seedlings also results in an NAE-tolerant phenotype (13). It is possible that the new phenoxyacyl-ethanolamides are able to enhance endogenous FAAH activity in wild-type seedlings, to confer some tolerance to the growth inhibition by NAE 12:0. Certainly there are other possible mechanisms by which these phenoxyacylethanolamides might be acting, and this area will require further experimentation, but to date, only increased activity of FAAH has been shown to confer tolerance toward NAE 12:0, and this is consistent with the in vitro action of PDP-EA and cardanol-EA on purified recombinant FAAH enzymes (Figs. 4567) and in crude seedling homogenates (Fig. 8G).",
                        "One intriguing aspect of these compounds is their growthpromoting properties in seedlings (Fig. 8). This is especially evident for cardanol-EA and its influence on cotyledon size (Fig. 8, D andE). This is the opposite of the effect of NAEs, which appear to retard growth and reduce cotyledon size. Besides their antagonistic effects on NAE treatment in seedlings, it seems that these compounds have their own inherent growth-regulating properties. Interestingly, seedlings overexpressing FAAH showed significant increases in cotyledon size (and other organs as well ( 13)), again suggesting that these phenoxyacyl-ethanolamides may be acting through modulation of endogenous FAAH activity.",
                        "The cardanol-EA-mediated reduction of cellular viability and exacerbation of oxidative stress-induced cell death in pri-mary neurons (Fig. 9) are potentially mediated by the depletion of neuroprotective NAEs (21,22,42,43) through an increase of FAAH activity (Fig. 5). The reversal of cardanol's sensitizing effect on neuronal cell death by NAE 16:0 begins well below its reported IC 50 of 5.1 M for anandamide hydrolysis by rat brain FAAH (44,45), which may indicate that cardanol-EA does not affect binding of NAE 16:0 to rat FAAH in the same way that it does with anandamide (3.1-fold increase in K m ; Fig. 6). The specificity of the pharmacological inhibitors of FAAH (26) used to reverse cardanol-induced exacerbation of tBHP-mediated cell death (Fig. 9, C and D) suggests FAAH activation as the underlying mechanism of action.",
                        "Cardanol-EA is a mixture of different phenoxyacyl-ethanolamides, all with 15 carbon alkyl chains (Fig. 1). Fifty percent of this mixture is composed of an alkyl chain with one double bond, 16% with two double bonds, 29% with three double bonds, and 5% of PDP-EA with no double bonds (saturated form). The PDP-EA compound is a single species with a 15-carbon saturated alkyl chain. There may be some slight differences in terms of action on FAAH between the two phenoxyacylethanolamide preparations, but generally, the stimulatory activity was observed for both compounds. The advantage of the cardanol-EA mixture is that it is synthesized from natural materials found in many plant sources. The starting materials for these phenoxyacyl-ethanolamides are derived from cardanol, which is a major constituent of cashew nut shell waste streams, and ethanolamides synthesized from these phenolic lipids may find many applications beyond their chemical properties as lipophilic hydrocarbon polymers. Given the plant growth-promoting properties, especially of cardanol-EA, there may be agricultural applications for these compounds, or based on their action on FAAH activity, these compounds may find therapeutic applications where manipulation of localized endogenous NAE levels might be desired.",
                        "Overall, the activities of these two new NAE-like compounds (PDP-EA and cardanol-EA) open a new interesting and unexplored approach for the in situ regulation of NAE metabolism in plant and animal systems. For example, these molecules might be used as pharmacological agents to modulate appetite by decreasing the endogenous levels of acylethanolamide agonists in animal systems (39), as chemo-sensitizing agents targeted at lipid-signaling pathways affected by disease processes, or as a modulator of endocannabinoid signaling in applications ranging from cytoprotection to cellular development and excitable cell function. In plants, NAE metabolism has been shown to be associated with biotic and abiotic stresses as well as seedling and reproductive growth and development. Hence, these compounds might find applications in agriculture. Further experiments will need to be done to define the utility of these FAAH enhancers in vivo to modulate the numerous effects of NAEs in plants and animals."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}