{
    "id": "US20190359667",
    "authors": [
        "Andrew Peterson Hinck",
        "Traian Sulea"
    ],
    "title": "ENGINEERED TGF-BETA MONOMERS AND THEIR USE FOR INHIBITING TGF-BETA SIGNALING",
    "date": "2017-11-17 00:00:00",
    "abstract": "Recombinant transforming growth factor (TGF)-β monomers modified to inhibit dimerization and block TGF-β signaling are described. The recombinant TGF-β monomers lack the ability to bind and recruit TGF-β type I receptor (TβR1), but retain the capacity to bind the high affinity TGF-β type II receptor (TβRII), and in some instances, include mutations that increase their affinity for TβRII. Nucleic acid molecules and vectors encoding the recombinant TGF-β monomers are also described. Isolated cells, such as T cells, can be re-programmed with a TGF-β monomer-encoding nucleic acid or vector to secrete the monomer. Use of the recombinant TGF-β monomers and/or cells producing the recombinant TGF-β monomers, to inhibit TGF-β signaling, such as to treat disorders associated with aberrant TGF-β signaling, are also described.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "ACKNOWLEDGMENT OF GOVERNMENT SUPPORT",
                    "paragraphs": [
                        "This invention was made with government support under grant number GM058670, awarded by the National Institutes of Health. The government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "acknowledge government support"
                    ],
                    "num_characters": 174,
                    "outline_medium": [
                        "acknowledge government support"
                    ],
                    "outline_short": [
                        "acknowledge government support"
                    ]
                },
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "This disclosure concerns recombinant transforming growth factor (TGF)-β monomers modified to inhibit dimerization while retaining the capacity to bind the high affinity TGF-β type II receptor (TβRII). This disclosure further concerns use of the recombinant TGF-β monomers to inhibit TGF-β signaling."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of disclosure"
                    ],
                    "num_characters": 299,
                    "outline_medium": [
                        "define TGF-β monomers"
                    ],
                    "outline_short": [
                        "define TGF-β monomers"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "TGF-β is a multifunctional cytokine with diverse biological effects on cellular processes, including cell proliferation, migration, differentiation, and apoptosis. The three mammalian TGF-β isoforms, TGF-β1, -β2 and -β3, exert their functions through a cell surface receptor complex composed of type I (TβRI) and type II (TβRII) serine/threonine kinase receptors. Receptor activation induces both SMAD proteins and other downstream targets, including Ras, RhoA, TAK1, MEKK1, PI3K, and PP2A, to produce the full spectrum of TGF-β responses (Roberts and Wakefield, Proc Natl Acad Sci USA 100:8621-8623, 2003; Derynck and Zhang, Nature 425:577-584, 2003; Massague, Cell 134:215-230, 2008).",
                        "TGF-β proteins are known to promote the progression of fibrotic disorders and certain types of cancer. In the context of fibrotic disorders, TGF-β potently stimulates the expression of extracellular matrix (ECM) proteins. Dysregulation of the ECM remodeling can lead to pathological fibrosis. The role of TGF-β in cancer is multi-faceted. TGF-β isoforms, TGF-β1, -β2 and -β3 are also known to suppress host immune surveillance and to stimulate epithelial-to-mesenchymal transitions, which drive cancer progression and metastasis."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe TGF-β functions",
                        "describe TGF-β role in diseases"
                    ],
                    "num_characters": 1217,
                    "outline_medium": [
                        "summarize TGF-β biology"
                    ],
                    "outline_short": [
                        "summarize TGF-β biology"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Described herein are engineered TGF-β monomers that are capable of blocking TGF-β signaling. The engineered monomers inhibit TGF-β signaling by preventing TGF-β dimerization and recruitment of MI.",
                        "Provided herein is a recombinant TGF-β monomer that includes a cysteine to serine substitution at amino acid residue 77; a deletion of amino acid residues 52-71; and at least one amino acid substitution that increases the net charge of the monomer. In some embodiments, the TGF-β monomer further includes at least one amino acid substitution that increases affinity of the TGF-β monomer for TGF-β type II receptor (TβRII). The TGF-β monomer can be, for example, a TGF-β2, TGF-β1 or TGF-β3 monomer, such as a human, rat, mouse or other mammalian TGF-β2, TGF-β1 or TGF-β3 monomer.",
                        "Fusion proteins that include a TGF-β monomer and a heterologous protein are also provided. Further provided are compositions that include a recombinant TGF-β monomer or fusion protein disclosed herein and a pharmaceutically acceptable carrier, diluent, or excipient.",
                        "Further provided are methods of inhibiting TGF-β signaling in a cell by contacting the cell with a recombinant TGF-β monomer, fusion protein or composition disclosed herein. In some embodiments, the method is an in vitro method. In other embodiments, the method is an in vivo method that includes administering the recombinant TGF-β monomer, fusion protein or composition to a subject having a disease or disorder associated with aberrant TGF-β signaling.",
                        "Also provided are nucleic acid molecules and vectors that encode a recombinant TGF-β monomer disclosed herein. Further provided are isolated cells, such as isolated T lymphocytes, that comprise the recombinant TGF-β monomer-encoding nucleic acid molecule or vector.",
                        "Methods of treating a disease or disorder associated with aberrant TGF-β signaling in a subject by administering to the subject an isolated cell (such as a T cell) comprising the disclosed nucleic acids or vectors are further provided.",
                        "The foregoing and other objects, features, and advantages of the invention will become more apparent from the following detailed description, which proceeds with reference to the accompanying figures."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce engineered TGF-β monomers",
                        "describe recombinant TGF-β monomer",
                        "describe fusion proteins and compositions",
                        "describe methods of inhibiting TGF-β signaling"
                    ],
                    "num_characters": 2207,
                    "outline_medium": [
                        "describe engineered TGF-β monomers",
                        "outline composition and methods"
                    ],
                    "outline_short": [
                        "describe engineered TGF-β monomers"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "I. Abbreviations",
                            "paragraphs": [
                                "- - AUC analytical ultracentrifugation\n  - BSA bovine serum albumin\n  - EC₅₀ effective concentration 50\n  - FBS fetal bovine serum\n  - ICso inhibitory concentration 50\n  - NMR nuclear magnetic resonance\n  - RU resonance unit\n  - SPR surface plasmon resonance\n  - TβRI transforming growth factor-β type I receptor\n  - TβRII transforming growth factor-β type II receptor\n  - TGF-β transforming growth factor-β\n  - TR-FRET time-resolved fluorescence resonance energy transfer"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define abbreviations"
                            ],
                            "num_characters": 472,
                            "outline_medium": [
                                "define abbreviations"
                            ],
                            "outline_short": [
                                "define abbreviations"
                            ]
                        },
                        {
                            "title": "II. Terms and Methods",
                            "paragraphs": [
                                "Unless otherwise noted, technical terms are used according to conventional usage. Definitions of common terms in molecular biology may be found in Benjamin Lewin, Genes V, published by Oxford University Press, 1994 (ISBN 0-19-854287-9); Kendrew et al. (eds.), The Encyclopedia of Molecular Biology, published by Blackwell Science Ltd., 1994 (ISBN 0-632-02182-9); and Robert A. Meyers (ed.), Molecular Biology and Biotechnology: a Comprehensive Desk Reference, published by VCH Publishers, Inc., 1995 (ISBN 1-56081-569-8).",
                                "In order to facilitate review of the various embodiments of the disclosure, the following explanations of specific terms are provided:",
                                "Aberrant (TGF-β signaling): Abnormal or dysregulated TGF-β signaling. In the context of the present disclosure, “aberrant TGF-β signaling” refers to excessive (pathological) activation of the TGF-β signaling pathway.",
                                "Administration: To provide or give a subject an agent, such as a therapeutic agent (e.g. a recombinant TGF-β), by any effective route. Exemplary routes of administration include, but are not limited to, injection or infusion (such as subcutaneous, intramuscular, intradermal, intraperitoneal, intrathecal, intravenous, intracerebroventricular, intrastriatal, intracranial and into the spinal cord), oral, intraductal, sublingual, rectal, transdermal, intranasal, vaginal and inhalation routes.",
                                "Contacting: Placement in direct physical association; includes both in solid and liquid form. When used in the context of an in vivo method, “contacting” also includes administering.",
                                "Fibrosis: The formation of excess fibrous connective tissue in an organ or tissue in a reparative or reactive process. Fibrosis can occur in many different tissues of the body (such as heart, lung and liver), typically as the result of inflammation or damage. Fibrotic disorders include, but are not limited to, pulmonary fibrosis, cystic fibrosis, idiopathic pulmonary fibrosis, interstitial lung disease, liver cirrhosis, kidney fibrosis (such as from damage caused by diabetes), atrial fibrosis, endomyocardial fibrosis, atherosclerosis, restenosis and scleroderma. Fibrosis can also occur as a result of surgical complications, chemotherapeutic drugs, radiation, injury or burns.",
                                "Fusion protein: A protein comprising at least a portion of two different (heterologous) proteins. In some embodiments herein, the fusion protein includes a TGF-β monomer fused to a protein tag, an Fc domain (such as a human Fc domain) or albumin",
                                "Glycosylation: The process of covalent attachment of carbohydrate moieties to an asparagine (N-glycosylation), or serine or threonine residue (O-glycosylation). The level and type of glycosylation can vary in different host organisms used for recombinant expression. Novel glycosylation site can be sequence engineered by introducing glycosylation sequons in solvent exposed regions of the protein. For example, the N-glycosylation sequon NX[S/T] can be introduced at one or more places within the sequence of certain embodiments disclosed herein. Varying the type and extent of glycosylation has practical application in modulating solubility, function and half-life, as well as enabling site-specific chemical conjugation.",
                                "Heterologous: Originating from a separate genetic source or species.",
                                "Isolated: An “isolated” biological component, such as a nucleic acid, protein (including antibodies) or organelle, has been substantially separated or purified away from other biological components in the environment (such as a cell) in which the component naturally occurs, i.e., other chromosomal and extra-chromosomal DNA and RNA, proteins and organelles. Nucleic acids and proteins that have been “isolated” include nucleic acids and proteins purified by standard purification methods. The term also embraces nucleic acids and proteins prepared by recombinant expression in a host cell as well as chemically synthesized nucleic acids.",
                                "Monomer: A single molecular unit (such as a protein) that is capable of binding to other molecular units to form dimers or polymers. In the context of the present disclosure, a “TGF-β monomer” is a single TGF-β polypeptide chain, the wild-type version of which can bind other TGF-β monomers to form dimers. In some embodiments herein, the recombinant TGF-β monomers have been engineered to prevent dimerization. In other embodiments herein, the recombinant TGF-β monomers which have been engineered to prevent their direct dimerization can be fused to heterologous proteins that are themselves capable of dimerization (e.g., an Fc domain of an IgG).",
                                "Neoplasia, malignancy, cancer or tumor: A neoplasm is an abnormal growth of tissue or cells that results from excessive cell division. Neoplastic growth can produce a tumor. The amount of a tumor in an individual is the “tumor burden” which can be measured as the number, volume, or weight of the tumor. A tumor that does not metastasize is referred to as “benign.” A tumor that invades the surrounding tissue and/or can metastasize is referred to as “malignant.”",
                                "PEGylation: The process of both covalent and non covalent attachment or amalgamation of polyethylene glycol (PEG) polymer chains to molecules and macrostructures, such as a drug, therapeutic protein or vesicle, which is then referred to as PEGylated (or pegylated). PEGylation is routinely achieved by incubation of a reactive derivative of PEG with the target molecule. The covalent attachment of PEG to a drug or therapeutic protein can mask the agent from the host's immune system (reduced immunogenicity and antigenicity), and increase the hydrodynamic size (size in solution) of the agent, which prolongs its circulatory time by reducing renal clearance. PEGylation can also provide water solubility to hydrophobic drugs and proteins.",
                                "Peptide or Polypeptide: A polymer in which the monomers are amino acid residues which are joined together through amide bonds. When the amino acids are alpha-amino acids, either the L-optical isomer or the D-optical isomer can be used, the L-isomers being preferred. The terms “peptide,” “polypeptide” or “protein” as used herein are intended to encompass any amino acid sequence and include modified sequences, including modified globin proteins. The terms “peptide” and “polypeptide” are specifically intended to cover naturally occurring proteins, as well as those which are recombinantly or synthetically produced.",
                                "Conservative amino acid substitutions are those substitutions that, when made, least interfere with the properties of the original protein, that is, the structure and especially the function of the protein is conserved and not significantly changed by such substitutions. Examples of conservative substitutions are shown below.",
                                "Conservative substitutions generally maintain (a) the structure of the polypeptide backbone in the area of the substitution, for example, as a sheet or helical conformation, (b) the charge or hydrophobicity of the molecule at the target site, or (c) the bulk of the side chain.",
                                "The substitutions which in general are expected to produce the greatest changes in protein properties will be non-conservative, for instance changes in which (a) a hydrophilic residue, for example, serine or threonine, is substituted for (or by) a hydrophobic residue, for example, leucine, isoleucine, phenylalanine, valine or alanine; (b) a cysteine or proline is substituted for (or by) any other residue; (c) a residue having an electropositive side chain, for example, lysine, arginine, or histidine, is substituted for (or by) an electronegative residue, for example, glutamine or aspartic acid; or (d) a residue having a bulky side chain, for example, phenylalanine, is substituted for (or by) one not having a side chain, for example, glycine.",
                                "Pharmaceutically acceptable carriers: The pharmaceutically acceptable carriers of use are conventional. Remington's Pharmaceutical Sciences, by E. W. Martin, Mack Publishing Co., Easton, Pa., 15th Edition, 1975, describes compositions and formulations suitable for pharmaceutical delivery of the compositions disclosed herein.",
                                "In general, the nature of the carrier will depend on the particular mode of administration being employed. In addition to biologically neutral carriers, pharmaceutical compositions to be administered can contain minor amounts of non-toxic auxiliary substances, such as wetting or emulsifying agents, preservatives, and pH buffering agents and the like, for example sodium acetate or sorbitan monolaurate.",
                                "Preventing, treating or ameliorating a disease: “Preventing” a disease refers to inhibiting the full development of a disease. “Treating” refers to a therapeutic intervention that ameliorates a sign or symptom of a disease or pathological condition after it has begun to develop, such as a reduction in tumor burden or a decrease in the number of size of metastases. “Ameliorating” refers to the reduction in the number or severity of signs or symptoms of a disease.",
                                "Recombinant: A recombinant nucleic acid or protein is one that has a sequence that is not naturally occurring or has a sequence that is made by an artificial combination of two otherwise separated segments of sequence. This artificial combination is often accomplished by chemical synthesis or by the artificial manipulation of isolated segments of nucleic acids, for example, by genetic engineering techniques. The term recombinant includes nucleic acids and proteins that have been altered by addition, substitution, or deletion of a portion of a natural nucleic acid molecule or protein.",
                                "Sequence identity/similarity: The identity between two or more nucleic acid sequences, or two or more amino acid sequences, is expressed in terms of the identity or similarity between the sequences. Sequence identity can be measured in terms of percentage identity; the higher the percentage, the more identical the sequences are. Sequence similarity can be measured in terms of percentage similarity (which takes into account conservative amino acid substitutions); the higher the percentage, the more similar the sequences are. Homologs or orthologs of nucleic acid or amino acid sequences possess a relatively high degree of sequence identity/similarity when aligned using standard methods. This homology is more significant when the orthologous proteins or cDNAs are derived from species which are more closely related (such as human and mouse sequences), compared to species more distantly related (such as human and C. elegans sequences).",
                                "Methods of alignment of sequences for comparison are well known in the art. Various programs and alignment algorithms are described in: Smith & Waterman, Adv. Appl. Math. 2:482, 1981; Needleman & Wunsch, J. Mol. Biol. 48:443, 1970; Pearson & Lipman, Proc. Natl. Acad. Sci. USA 85:2444, 1988; Higgins & Sharp, Gene, 73:237-44, 1988; Higgins & Sharp, CABIOS 5:151-3, 1989; Corpet et al., Nuc. Acids Res. 16:10881-90, 1988; Huang et al. Computer Appls. in the Biosciences 8, 155-65, 1992; and Pearson et al., Meth. Mol. Bio. 24:307-31, 1994. Altschul et al., J. Mol. Biol. 215:403-10, 1990, presents a detailed consideration of sequence alignment methods and homology calculations.",
                                "The NCBI Basic Local Alignment Search Tool (BLAST) (Altschul et al., J. Mol. Biol. 215:403-10, 1990) is available from several sources, including the National Center for Biological Information (NCBI) and on the internet, for use in connection with the sequence analysis programs blastp, blastn, blastx, tblastn and tblastx. Additional information can be found at the NCBI web site.",
                                "Subject: Living multi-cellular organisms, including vertebrate organisms, a category that includes both human and non-human mammals.",
                                "Tag: A molecule that can be attached to a protein or nucleic acid, such as for labeling, detection or purification purposes. In some embodiments, the tag is a protein tag. In some embodiments, the protein tag is an affinity tag (for example, Avitag, hexahistidine, chitin binding protein, maltose binding protein, or glutathione-S-transferase), an epitope tag (for example, V5, c-myc, HA or FLAG) or a fluorescent tag (e.g., GFP or another well-known fluorescent protein).",
                                "Therapeutically effective amount: A quantity of compound or composition, for instance, a recombinant TGF-β monomer, sufficient to achieve a desired effect in a subject being treated. For instance, this can be the amount necessary to inhibit or block TGF-β signaling in a cell.",
                                "Transforming growth factor-β (TGF-β): A secreted, multi-functional protein that regulates proliferation, cellular differentiation and a number of other cellular functions. Many cells synthesize TGF-β and nearly all cells express receptors for TGF-β. The term “TGF-β” refers to three different protein isoforms, TGF-β1, TGF-β2 and TGF-β3, encoded by the genes TGFB1, TGFB2, TGFB3, respectively.",
                                "TGF-βsignaling pathway: A signaling pathway involved in a number of cellular processes, such as cell proliferation, differentiation and apoptosis. Members of the TGF-β pathway include, but are not limited to, TGF-β1, TGF-β2, TGF-β3 and TGF-β receptor type I and TGF-β receptor type II.",
                                "TGF-βreceptor: The term “TGF-β receptor” includes TGF-β receptor type I (encoded by TGFBR1) and TGF-β receptor type II (encoded by TGFBR2). TGF-β receptors are serine/threonine protein kinases. The type I and type II TGF-β receptors form a heterodimeric complex when bound to TGF-β, transducing the TGF-β signal from the cell surface to the cytoplasm.",
                                "Unless otherwise explained, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this disclosure belongs. The singular terms “a,” “an,” and “the” include plural referents unless context clearly indicates otherwise. “Comprising A or B” means including A, or B, or A and B. It is further to be understood that all base sizes or amino acid sizes, and all molecular weight or molecular mass values, given for nucleic acids or polypeptides are approximate, and are provided for description. Although methods and materials similar or equivalent to those described herein can be used in the practice or testing of the present disclosure, suitable methods and materials are described below. All publications, patent applications, patents, and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the present specification, including explanations of terms, will control. In addition, the materials, methods, and examples are illustrative only and not intended to be limiting."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate terms and methods",
                                "define aberrant TGF-β signaling",
                                "define administration",
                                "define contacting",
                                "define fibrosis",
                                "define fusion protein",
                                "define glycosylation",
                                "define heterologous",
                                "define isolated",
                                "define monomer",
                                "define neoplasia",
                                "define PEGylation",
                                "define peptide or polypeptide",
                                "explain conservative amino acid substitutions",
                                "define pharmaceutically acceptable carriers",
                                "define preventing, treating or ameliorating a disease",
                                "define recombinant",
                                "explain sequence identity/similarity",
                                "describe methods of alignment of sequences",
                                "define subject",
                                "define tag",
                                "define therapeutically effective amount",
                                "define transforming growth factor-β (TGF-β)",
                                "define TGF-β signaling pathway",
                                "define TGF-β receptor",
                                "explain TGF-β receptors",
                                "clarify technical and scientific terms",
                                "explain singular and plural terms",
                                "provide general information on references and materials"
                            ],
                            "num_characters": 14587,
                            "outline_medium": [
                                "define terms and methods",
                                "motivate aberrant TGF-β signaling",
                                "explain administration",
                                "define contacting",
                                "describe fibrosis",
                                "introduce fusion protein",
                                "explain glycosylation",
                                "define heterologous",
                                "describe isolated",
                                "introduce monomer",
                                "explain neoplasia",
                                "describe PEGylation",
                                "define peptide or polypeptide",
                                "explain sequence identity/similarity"
                            ],
                            "outline_short": [
                                "define terms in molecular biology",
                                "explain aberrant TGF-β signaling",
                                "define administration",
                                "explain contacting",
                                "define fibrosis",
                                "explain fusion protein",
                                "define glycosylation"
                            ]
                        },
                        {
                            "title": "III. Overview of Several Embodiments",
                            "paragraphs": [
                                "Disclosed herein are recombinant transforming growth factor (TGF)-β monomers that are modified to inhibit dimerization and type I receptor binding, but retain the capacity to bind the high affinity TGF-β type II receptor (TβRII). The recombinant TGF-β monomers disclosed herein can be used to inhibit TGF-β signaling, such as for the treatment of diseases or disorders characterized by aberrant TGF-β signaling, for example fibrotic disorders, ocular diseases, certain types of cancer, or a genetic disorder of connective tissue. In addition, nucleic acid molecules encoding a recombinant TGF-β monomer can be used to reprogram T cells to overproduce the recombinant protein. T cells engineered to overexpress the recombinant TGF-β monomer can be used in gene therapy applications, such as for the treatment of diseases or disorders characterized by aberrant TGF-β signaling.",
                                "Provided herein is a recombinant TGF-β monomer that includes a cysteine to serine substitution at amino acid residue 77 (with reference to SEQ ID NO: 2); a deletion of amino acid residues 52-71 (with reference to SEQ ID NO: 2); and at least one amino acid substitution (for example, a substitution proximal to the deleted residues) relative to a wild-type TFG-β monomer that increases net charge of the monomer. The cysteine to serine substitution prevents disulfide bond formation between TGF-β monomers. The deletion of amino acid residues 52-71 removes the α-helical 3 (α3) region (the primary dimerization motif), as well as a few flanking residues (FIG. 1D). When residues 52-71 are removed, the remaining residues form a loop that contains polar and charged residues (FIGS. 1D and 2B).",
                                "In some embodiments, the TGF-β monomer is a human, mouse, rat or other mammalian TGF-β monomer.",
                                "In some embodiments, the TGF-β monomer further includes at least one amino acid substitution relative to a wild-type TFG-β2 monomer that increases affinity of the TGF-β monomer for MIL",
                                "In some embodiments, the TGF-β monomer is a human TGF-β2 monomer. In some examples, the at least one amino acid substitution that increases net charge of the human TGF-β2 monomer includes a leucine to arginine substitution at residue 51; an alanine to lysine substitution at residue 73; or both a leucine to arginine substitution at residue 51 and an alanine to lysine substitution at residue 73 (with reference to SEQ ID NO: 2).",
                                "In some embodiments, the at least one amino acid substitution that increases affinity of the human TGF-β2 monomer for TβRII includes a substitution at an amino acid residue corresponding to residue 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98 or 99 of SEQ ID NO: 2, or any combination of two or more residues thereof. In some examples, the at least one amino acid substitution that increases affinity of the monomer for TβRII comprises at least one substitution at residue 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36 or 37, and at least one substitution at residue 89, 90, 91, 92, 93, 94, 95, 96, 97, 98 or 99. In specific examples, the at least one amino acid substitution that increases affinity of the human TGF-β2 monomer for TβRII includes a lysine to arginine at residue 25, an arginine to lysine at residue 26, a leucine to valine at residue 89, an isoleucine to valine at residue 92, an asparagine to arginine at residue 94, a threonine to lysine at residue 95, an isoleucine to valine at residue 98, or any combination of two or more thereof, such as three or more, four or more, five or more, or six or more. In one non-limiting examples, the recombinant human TGF-β2 monomer includes a lysine to arginine at residue 25, an arginine to lysine at residue 26, a leucine to valine at residue 89, an isoleucine to valine at residue 92, an asparagine to arginine at residue 94, a threonine to lysine at residue 95, and an isoleucine to valine at residue 98.",
                                "In some examples, the amino acid sequence of the human TGF-β2 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 8 or SEQ ID NO: 10. In some instances, the human TGF-β2 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 8 or SEQ ID NO: 10 and contains only conservative amino acid substitutions. In particular non-limiting examples, the amino acid sequence of the human TGF-β2 monomer comprises or consists of SEQ ID NO: 8 or SEQ ID NO: 10.",
                                "In other embodiments, recombinant TGF-β monomer is a human TGF-β1 monomer. In some examples, the at least one amino acid substitution that increases net charge of the human TGF-β1 monomer includes an isoleucine to arginine substitution at residue 51; an alanine to lysine substitution at residue 74; an alanine to serine substitution at residue 75; or an isoleucine to arginine substitution at residue 51, an alanine to lysine substitution at residue 74 and an alanine to serine substitution at residue 75 (with reference to SEQ ID NO: 1).",
                                "In some examples, the amino acid sequence of the human TGF-β1 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 7. In some instances, the human TGF-β1 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 7 and contains only conservative amino acid substitutions. In particular non-limiting examples, the amino acid sequence of the human TGF-131 monomer comprises or consists of SEQ ID NO: 7.",
                                "In other embodiments, the recombinant TGF-β monomer is a human TGF-β3 monomer. In some examples, the at least one amino acid substitution that increases net charge of the human TGF-β3 monomer includes a leucine to glutamate substitution at residue 51; an alanine to glutamate substitution at residue 72; an alanine to aspartate substitution at residue 74; or a leucine to glutamate substitution at residue 51, an alanine to glutamate substitution at residue 72 and an alanine to aspartate substitution at residue 74 (with reference to SEQ ID NO: 3).",
                                "In some examples, the amino acid sequence of the human TGF-β3 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 9. In some instances, the human TGF-β3 monomer is at least 95%, at least 96%, at least 97%, at least 98%, or at least 99% identical to SEQ ID NO: 9 and contains only conservative amino acid substitutions. In particular non-limiting examples, the amino acid sequence of the human TGF-133 monomer comprises or consists of SEQ ID NO: 9.",
                                "In some embodiments herein, the recombinant TGF-β monomer is PEGylated, glycosylated, hyper-glycosylated, or includes another modification that prolongs circulatory time.",
                                "Also provided herein are fusion proteins that include a TGF-β monomer and a heterologous protein. In some embodiments, the heterologous protein is a protein tag. In some examples, the protein tag is an affinity tag (for example, Avitag, hexahistidine, chitin binding protein, maltose binding protein, or glutathione-S-transferase), an epitope tag (for example, V5, c-myc, HA or FLAG) or a fluorescent tag (e.g., GFP or another well-known fluorescent protein). In other embodiments, the heterologous protein comprises an Fc domain, such as a mouse or human Fc domain. In specific embodiments, the heterologous protein promotes intermolecular association into homodimeric (for example, Fc domain from human IgG1, IgG2, IgG3), heterodimeric (for example, an engineered Fc domain, E/K coiled-coil), or multimeric (for example, pentabodies, nanoparticles) states of the fusion protein. In other embodiments, the heterologous protein is albumin, an albumin-binding protein or agent, or another protein that increases circulatory time of the TGF-β monomer in vivo.",
                                "Also provided are recombinant TGF-β monomers or fusion proteins comprising a radiotherapy agent, a cytotoxic agent for chemotherapy, or a drug. Further provided are recombinant TGF-β monomers or fusion proteins comprising an imaging agent, a fluorescent dye, or a fluorescent protein tag.",
                                "Further provided herein is a composition, such as a pharmaceutical composition, that includes a recombinant TGF-β monomer or fusion protein disclosed herein, and a pharmaceutically acceptable carrier, diluent or excipient.",
                                "Also provided herein is a method of inhibiting TGF-β signaling in a cell. In some embodiments, the method includes contacting the cell with a recombinant TGF-β monomer, fusion protein or composition disclosed herein.",
                                "In some embodiments, the method is an in vitro method.",
                                "In other embodiments, the method is an in vivo method. In some examples, the in vivo method includes administering the recombinant TGF-β monomer, fusion protein or composition to a subject having a disease or disorder associated with aberrant TGF-β signaling. In some examples, the recombinant TGF-β monomer, fusion protein or composition is administered by injection, such as by subcutaneous, intramuscular, intradermal, intraperitoneal, intravenous or intratumoral injection.",
                                "Also provided is a method of treating a disease or disorder associated with aberrant TGF-β signaling. In some embodiments, the method includes administering a recombinant TGF-β monomer, fusion protein or composition disclosed herein to a subject.",
                                "In some embodiments, the disease or disorder associated with aberrant TGF-β signaling is a fibrotic disorder, such as but not limited to, pulmonary fibrosis, cystic fibrosis, idiopathic pulmonary fibrosis, interstitial lung disease, liver cirrhosis, kidney fibrosis (such as from damage caused by diabetes), atrial fibrosis, endomyocardial fibrosis, atherosclerosis, restenosis, scleroderma, or fibrosis caused by a surgical complication, chemotherapeutic drugs, radiation, injury or burns.",
                                "In other embodiments, the disease or disorder associated with aberrant TGF-β signaling is breast cancer, brain cancer, pancreatic cancer, prostate cancer, skin cancer, bladder cancer, liver cancer, ovarian cancer, renal cancer, endometrial cancer, colorectal cancer, gastric cancer, skin cancer (such as malignant melanoma), or thyroid cancer.",
                                "In other embodiments, the disease or disorder associated with aberrant TGF-β signaling is an ocular disease.",
                                "In other embodiments, the disease or disorder associated with aberrant TGF-β signaling is a genetic disorder of connective tissue.",
                                "Further provided are isolated nucleic acid molecules encoding a recombinant TGF-β monomer disclosed herein. In some embodiments, the nucleic acid molecule is operably linked to a promoter, such as a T cell specific promoter.",
                                "Also provided are vectors that include a TGF-β monomer-encoding nucleic acid molecule. In some embodiments, the vector is a viral vector, such as a lentiviral vector.",
                                "Isolated cells, such as, but not limited to, isolated T cells comprising a nucleic acid molecule or vector encoding a recombinant TGF-β monomer disclosed herein are further provided. The cells can be autologous to the subject, or they can be heterologous (allogeneic). Compositions that include the isolated cells and a pharmaceutically acceptable carrier are also provided.",
                                "Further provided are methods of treating a disease or disorder associated with aberrant TGF-β signaling in a subject. In some embodiments, the method includes administering to the subject a nucleic acid molecule, vector or isolated cell disclosed herein. In some examples, the disease or disorder associated with aberrant TGF-β signaling is a fibrotic disorder. In other examples, the disease or disorder associated with aberrant TGF-β signaling is breast cancer, brain cancer, pancreatic cancer, prostate cancer or skin cancer. In other examples, the disease or disorder associated with aberrant TGF-β signaling is an ocular disease. In yet other examples, the disease or disorder associated with aberrant TGF-β signaling is a genetic disorder of connective tissue."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce recombinant TGF-β monomers",
                                "describe inhibition of TGF-β signaling",
                                "specify use in treating diseases or disorders",
                                "detail cysteine to serine substitution",
                                "describe deletion of amino acid residues 52-71",
                                "explain effect of deletion on α-helical 3 region",
                                "specify at least one amino acid substitution",
                                "describe increase in net charge of monomer",
                                "specify human, mouse, rat or other mammalian TGF-β monomer",
                                "describe at least one amino acid substitution for MIL affinity",
                                "specify human TGF-β2 monomer",
                                "detail leucine to arginine substitution at residue 51",
                                "detail alanine to lysine substitution at residue 73",
                                "describe combination of substitutions",
                                "specify residues for TβRII affinity",
                                "describe lysine to arginine at residue 25",
                                "describe arginine to lysine at residue 26",
                                "describe leucine to valine at residue 89",
                                "describe isoleucine to valine at residue 92",
                                "describe asparagine to arginine at residue 94",
                                "describe threonine to lysine at residue 95",
                                "describe isoleucine to valine at residue 98",
                                "specify SEQ ID NO: 8 or SEQ ID NO: 10"
                            ],
                            "num_characters": 11928,
                            "outline_medium": [
                                "introduce recombinant TGF-β monomers",
                                "describe inhibition of TGF-β signaling",
                                "specify cysteine to serine substitution",
                                "describe deletion of amino acid residues 52-71",
                                "specify at least one amino acid substitution",
                                "describe human, mouse, rat or other mammalian TGF-β monomers",
                                "specify at least one amino acid substitution for MIL affinity",
                                "describe human TGF-β2 monomer embodiments",
                                "describe human TGF-β1 monomer embodiments",
                                "describe human TGF-β3 monomer embodiments",
                                "describe PEGylated, glycosylated, or modified TGF-β monomers"
                            ],
                            "outline_short": [
                                "introduce recombinant TGF-β monomers",
                                "describe modifications to inhibit dimerization and type I receptor binding",
                                "outline applications for treating diseases or disorders characterized by aberrant TGF-β signaling",
                                "specify embodiments of recombinant TGF-β monomers with increased net charge and affinity for TβRII",
                                "describe fusion proteins and compositions including recombinant TGF-β monomers"
                            ]
                        },
                        {
                            "title": "IV. Administration of Engineered TGF-β Monomers",
                            "paragraphs": [
                                "Compositions, such as pharmaceutical compositions, that include a recombinant human TGF-β monomer or fusion protein, are provided herein. Also provided are compositions that include an isolated cell, such as a T cell, comprising a vector encoding a recombinant human TGF-β monomer. In some embodiments, the composition includes a pharmaceutically acceptable carrier.",
                                "The pharmaceutically acceptable carriers and excipients useful in this disclosure are conventional. See, e.g., Remington: The Science and Practice of Pharmacy, The University of the Sciences in Philadelphia, Editor, Lippincott, Williams, & Wilkins, Philadelphia, Pa., 21st Edition (2005). For instance, parenteral formulations usually comprise injectable fluids that are pharmaceutically and physiologically acceptable fluid vehicles such as water, physiological saline, other balanced salt solutions, aqueous dextrose, glycerol or the like. For solid compositions (e.g., powder, pill, tablet, or capsule forms), conventional non-toxic solid carriers can include, for example, pharmaceutical grades of mannitol, lactose, starch, or magnesium stearate. In addition to biologically-neutral carriers, pharmaceutical compositions to be administered can contain minor amounts of non-toxic auxiliary substances, such as wetting or emulsifying agents, preservatives, pH buffering agents, or the like, for example sodium acetate or sorbitan monolaurate. Excipients that can be included are, for instance, other proteins, such as human serum albumin or plasma preparations.",
                                "With regard to administration of cells, a variety of aqueous carriers can be used, for example, buffered saline and the like, for introducing the cells. These solutions are sterile and generally free of undesirable matter. These compositions may be sterilized by conventional, well known sterilization techniques. The compositions may contain pharmaceutically acceptable auxiliary substances as required to approximate physiological conditions such as pH adjusting and buffering agents, toxicity adjusting agents and the like, for example, sodium acetate, sodium chloride, potassium chloride, calcium chloride, sodium lactate and the like. The concentration in these formulations can vary widely, and will be selected primarily based on fluid volumes, viscosities, body weight and the like in accordance with the particular mode of administration selected and the subject's needs.",
                                "The dosage form of the composition will be determined by the mode of administration chosen. For instance, in addition to injectable fluids, topical, inhalation, oral and suppository formulations can be employed. Topical preparations can include eye drops, ointments, sprays, patches and the like. Inhalation preparations can be liquid (e.g., solutions or suspensions) and include mists, sprays and the like. Oral formulations can be liquid (e.g., syrups, solutions or suspensions), or solid (e.g., powders, pills, tablets, or capsules). Suppository preparations can also be solid, gel, or in a suspension form. For solid compositions, conventional non-toxic solid carriers can include pharmaceutical grades of mannitol, lactose, starch, or magnesium stearate. Actual methods of preparing such dosage forms are known, or will be apparent, to those skilled in the art.",
                                "The compositions, such as pharmaceutical compositions, that include a recombinant human TGF-β monomer, can be formulated in unit dosage form, suitable for individual administration of precise dosages. The amount of TGF-β monomer administered will be dependent on the subject being treated, the severity of the affliction, and the manner of administration, and is best left to the judgment of the prescribing clinician. Within these bounds, the formulation to be administered will contain a quantity of the active component(s) in amounts effective to achieve the desired effect in the subject being treated.",
                                "The TGF-β monomers, or compositions thereof, can be administered to humans or other animals on whose tissues they are effective in various manners such as topically, orally, intravenously, intramuscularly, intraperitoneally, intranasally, intradermally, intrathecally, subcutaneously, via inhalation or via suppository. The particular mode of administration and the dosage regimen will be selected by the attending clinician, taking into account the particulars of the case (e.g. the subject, the disease, the disease state involved, and whether the treatment is prophylactic). Treatment can involve daily or multi-daily doses of compound(s) over a period of a few days to months, or even years.",
                                "The following examples are provided to illustrate certain particular features and/or embodiments. These examples should not be construed to limit the disclosure to the particular features or embodiments described."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce pharmaceutical compositions",
                                "describe isolated cell compositions",
                                "specify pharmaceutically acceptable carriers",
                                "detail parenteral formulations",
                                "describe solid compositions",
                                "specify auxiliary substances",
                                "describe administration methods",
                                "specify dosage forms",
                                "describe unit dosage form"
                            ],
                            "num_characters": 4802,
                            "outline_medium": [
                                "describe pharmaceutical compositions",
                                "specify isolated cells comprising a vector encoding a recombinant human TGF-β monomer",
                                "describe pharmaceutically acceptable carriers and excipients",
                                "outline administration methods and dosage forms"
                            ],
                            "outline_short": [
                                "describe pharmaceutical compositions and isolated cells comprising recombinant TGF-β monomers",
                                "outline administration methods and dosage forms for recombinant TGF-β monomers"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1: An Engineered TGF-β Monomer that Functions as a Dominant Negative to Block TGF-β Signaling",
                            "paragraphs": [
                                "This example describes an engineered TGF-β monomer that is capable of blocking TGF-β signaling. The engineered TGF-β monomer, referred to herein as mmTGF-β2-7M, has three changes relative to the monomer of wild type dimeric TGF-β2:",
                                "(1) The cysteine that normally forms the inter-chain disulfide (Cys77) was substituted with serine (FIG. 1D);",
                                "(2) The c 3 helix was eliminated and replaced with a short loop bearing polar and charged residues (FIG. 1D); and",
                                "(3) Seven residues were substituted relative to TGF-β2 that enabled high affinity TβRII binding (FIG. 1E).",
                                "The features of mmTGF-β2-7M and other engineered TGF-β variants disclosed herein are described below and listed in Table 1. The sequences of all engineered TGF-β variants are shown in FIG. 8 and set forth as SEQ ID NOs: 1-11."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe engineered TGF-β monomer"
                            ],
                            "num_characters": 792,
                            "outline_medium": [
                                "describe engineered TGF-β monomer"
                            ],
                            "outline_short": [
                                "describe engineered TGF-β monomer"
                            ]
                        },
                        {
                            "title": "BACKGROUND",
                            "paragraphs": [
                                "Previous studies showed that wild type TGF-β1 and TGF-β3 monomers (that is TGF-β1 and TGF-β3 monomers with the cysteine residue that normally forms the interchain disulfide, Cys77, substituted to serine) were about 10-15 fold less potent compared to the naturally occurring disulfide-linked homodimers, yet they nonetheless retained significant signaling activity, with midpoint stimulatory potencies (EC50s) of about 150 pM (Amatayakul-Chantler et al., J Biol Chem 269:27687-27691, 1994; Ztilliga et al., J Mol Biol 355:47-62, 2006).",
                                "Based on structural studies, it was not clear why TGF-β1 Cys77→Ser and TGF-β3 Cys77→Ser variants would retain such significant signaling activity since one of the two essential receptors that binds to the growth factor, the TGF-β type I receptor (MI) was shown to bind by straddling the TGF-β homodimer interface (FIG. 1A) (Groppe et al., Mol Cell 29:157-168, 2008).",
                                "It was hypothesized that the TGF-β monomers were signaling by non-covalently dimerizing and binding the receptors, which in turn stabilized the noncovalent dimers (by virtue of the fact that at least one of them, MI, binds across the dimer interface). To generate a TGF-13 monomer that would function as an inhibitor, rather than a stimulator of TGF-beta signaling, an engineered monomer was produced in which the primary dimerization motif, the interfacial α-helix, α3, was replaced with a flexible loop (FIGS. 1A and 1D). It was reasoned that this would interfere with the ability of TGF-β to dimerize and recruit MI by (a) limiting the potential of the monomers to non-covalently dimerize due to hydrophobic contacts (FIG. 1B) and (b) by eliminating a significant portion of the contact surface for the TGF-β type I receptor, MI, that binds by straddling the TGF-beta dimer interface (FIG. 1C).",
                                "Methods",
                                "Protein Expression and Purification",
                                "TGF-β1 was expressed as a secreted protein bound to its prodomain in stably transfected Chinese hamster ovary (CHO) cells. The cell line used to produce TGF-β1, and the accompanying procedure to isolate the mature disulfide-linked TGF-β1 homodimer from the conditioned medium has been previously described (Zou and Sun, Protein Expr Purif 37, 265-272, 2004). Human homodimeric TGF-β2 (TGF-β2), human homodimeric TGF-β3 (TGF-β3), and variants, including avi-tagged (Cull and Schatz, Methods Enzymol 326, 430-440, 2000) homodimeric TGF-β3 (TGF-β3-avi), monomeric TGF-β2 (mTGF-β2), monomeric TGF-β2 (mTGF-β3), mini monomeric TGF-β1 (mmTGF-β1), mini monomeric TGF-β2 (mmTGF-β2), mini monomeric TGF-β3 (mmTGF-β3), mini monomeric TGF-β2 with seven substitutions to enable high affinity TβRII binding (mmTGF-β2-7M), and avi-tagged (Cull and Schatz, Methods Enzymol 326, 430-440, 2000) mini monomeric TGF-β2 with seven substitutions to enable high affinity TβRII binding (mmTGF-β2-7M) were expressed in E. coli, refolded from inclusion bodies into native folded disulfide-linked homodimers (TGF-β2, TGF-β3, TGF-β3-avi) or monomers (mTGF-β1, mTGF-β2, mTGF-β3, mmTGF-β1, mmTGF-β2, mmTGF-β3, mmTGF-f32-7M, mmTGF-β2-7M-avi), and purified to homogeneity using high resolution cation exchange chromatography (Source Q, GE Healthcare, Piscataway, N.J.) as previously described (Huang and Hinck, Methods Mol Biol 1344, 63-92, 2016). The nomenclature and major features of the dimeric and monomeric TGF-β used in this study are summarized in Table 1, and the complete sequences are shown in FIG. 8.",
                                "The human MI ectodomain (TβRI), spanning residues 1-101 of the mature receptor, or a variant spanning residues 1-88 of the mature receptor with a 15 amino acid avitag (Cull and Schatz, Methods Enzymol 326, 430-440, 2000) appended to the C-terminus (TβRI-4C-Avi) was expressed in E. coli, refolded from inclusion bodies, and purified to homogeneity as previously described (Ztilliga et al., J Mol Biol 354, 1052-1068, 2005). The human TβRII ectodomain (TβRII), spanning residues 15-136 of the mature receptor, or the same but with a C-terminal hexahistidine tag (TβRII-His) was expressed in E. coli, refolded from inclusion bodies, and purified to homogeneity as previously described (Hinck et al., J Biomol NMR 18, 369-370, 2000).",
                                "Solubility Assays",
                                "TGF-β dimers and monomers were concentrated in 100 mM acetic acid to concentrations of 300 μM or higher and diluted to the desired concentration in either 100 mM acetic acid or phosphate buffered saline (PBS, 10 mM Na2HPO4, 1.8 mM KH2PO4, 137 mM NaCl, 2.7 mM KCl, pH 7.4). The pH of the samples diluted into PBS were adjusted with small aliquots of NaOH to ensure a final pH of 7.4. The light scattering at 340 nm of the samples were measured using a HP 8452 diode array spectrophotometer (HP, Palo Alto, Calif.). The samples were transferred to a microfuge tube, centrifuged at 20000×g for 5 minutes and the absorbance at 280 nm of the supernatant was measured using a NANODROP™ spectrophotometer (ThermoFisher, Waltham, Mass.). Results of solubility assays are shown in FIGS. 4A-4D.",
                                "Nuclear Magnetic Resonance (NMR) Spectroscopy",
                                "mmTGF-β2 and mmTGF-β2-7M samples isotopically labeled with 15N or 15N and 13C for NMR were prepared by growing bacterial cells in M9 media containing 0.1% (w/v)15NH4Cl or 0.1% (w/v)15NH4Cl and 0.03% (w/v)13C labeled glucose. All NMR samples were prepared in 10 mM sodium phosphate, 10 mM 3-[(3-choiamidopropyl)dirneihylarnmortio]-1-propanesuifonaie (CHAPS). 5% 2H2O, 0.02% w/v sodium azide at a protein concentration of 0.2 mM-0.4 mM, pH 4.7. All NMR data was acquired at a sample temperature of 37° C. at either 700 or 800 MHz. Backbone resonance assignments of mmTGF-β2 and mmTGF-β2-7M were obtained by collecting and analyzing sensitivity-enhanced HNCACB (Wittekind and Mueller, J Magn Reson Ser B 101:201-205, 1993), CBCA(CO)NH (Grzesiek et al., J Magn Reson Ser B 101:114-119, 1993), C(CO)NH (Grzesiek and Bax, J Biomol NMR 3:185-204, 1993), HNCO (Kay et al., J Magn Reson 89:496-514, 1990), data sets with 25% non-uniform sampling (NUS) of the points in the 13C, 15 N acquisition grid. Backbone amide 15N T2 relaxation parameters were measured in an interleaved manner at 300° K at a 15N frequency of 70.95 MHz using 1H-detected pulse schemes previously described (Kay et al., Biochemistry 28:8972-8979, 1989). The T2 data sets were each collected using 8-10 delay times, varying between 16-192 ms. The T2 relaxation times were obtained by fitting relative peak intensities as a function of the T2 delay time to a two parameter decaying exponential. Data was processed using NMRPipe (Delaglio et al., J Biomol NMR 6: 277-293, 1995), with the SMILE algorithm used for prediction of the missing points in the 13C and 15N dimensions of the NUS data sets (Ying et al., J. Biomol. NMR 2016). Data analysis was performed using NMRFAM-SPARKY (Lee et al., Bioinformatics 31:1325-1327, 2015).",
                                "SPR Binding Measurements",
                                "SPR measurements with TGF-β2 and mmTGF-β2 shown in FIGS. 3A-3B were performed using a BIACORE™ 3000 SPR (G.E. Healthcare, Piscataway, N.J.) instrument with direct immobilization of TGF-β2 or mmTGF-β2 on the surface of a CMS sensor chip (G.E. Healthcare, Piscataway, N.J.) using an amine (carbodiimide-based) coupling kit (G.E. Healthcare, Piscataway, N.J.). SPR experiments shown in FIGS. 3C, 3E and 3G and FIGS. 3D, 3F and 3H with TGF-β3 and mmTGF-β2-7m, respectively, were performed using a BIACORE™ X100 SPR instrument (G.E. Healthcare, Piscataway, N.J.) with biotinylated ligands captured at a moderate density (50-200 RU) onto a streptavidin-coated CMS sensor chip (GE Healthcare, Piscataway, N.J.). Biotinylated TGF-β3 or mmTGF-β2-7M was generated by expressing TGF-β3 or mmTGF-β2-7M with an N-terminal 15 amino acid avitag (Cull and Schatz, Methods Enzymol 326, 430-440, 2000). TGF-β3-avi or mmTGF-β2-7M-avi was bound to TβRII in 10 mM bicine at pH 8.0 and biotinylated by incubating with a catalytic amount of bacterially expressed BirA recombinase, biotin, and ATP at 37° C. for 2 hours as described (Huang and Hinck, Methods Mol Biol 1344, 63-92, 2016). Biotinylated avi-tagged TGF-β3 or avi-tagged TGF-β2-7m were bound to a C4 reverse phase column equilibrated with 94.9% water/5% acetonitrile/0.1% triflouroacetic acid and eluted with a linear acetonitrile gradient.",
                                "SPR measurements shown in FIGS. 3A-3E were performed in HBS-EP buffer (10 mM HEPES, pH 7.4, 150 mM NaCl, 3 mM EDTA, 0.005% surfactant P20; GE Healthcare, Piscataway, N.J.) with the receptor indicated injected over a series of two-fold dilutions over the concentration range shown. Injections were carried out in duplicate and included 10 buffer blank injections at the start of the experiment. Binding was allowed to associate for 2-3 minutes at a flow rate of 100 mL min−1, followed by dissociation for 1 minute or longer. Each cycle of injection was followed by 10 ml of regeneration with 4 M guanidine.HCl, 2 M NaCl. Data was processed by subtracting both the response from a blank flow cell and buffer blanks using the program Scrubber2 (Biologic software, Campbell, Australia). Kinetic fitting of the data was performed with Scrubber2 assuming a simple 1:1 binding model. SPR measurements shown in FIGS. 3G and 3H were performed similarly, except 2 μM TβRII was included in both the running buffer and the injected samples. The results of SPR measurements are shown in Table 2 and FIGS. 3A-3H.",
                                "Crystallization, Structure Determination and Refinement",
                                "Crystals of mmTGF-β2 were formed in sitting drops at 25° C. by combining 0.2 μL of a 7.9 mg mL−1 protein stock solution in 10 mM MES pH 5.5 with 0.2 μL of the precipitant from the well, 20% PEG 3350, 0.2 M sodium thiocyanate. Harvested crystals were mounted in undersized nylon loops with excess mother liquor wicked off, followed by flash-cooling in liquid nitrogen prior to data collection. Data were acquired at the Advanced Photon Source NE-CAT beamline 24-ID-C and integrated and scaled using XDS (Kabsch, Acta Crystallogr D Biol Crystallogr 66, 125-132, 2010). The structure was determined by the molecular replacement method implemented in PHASER (McCoy et al., J Appl Crystallogr 40, 658-674, 2007) using a truncated version of PDB entry 2TGI (Daopin et al., Science 257, 369-373, 1992) as the search model. Coordinates were refined using PHENIX (Adams et al., Acta Crystallogr D Biol Crystallogr 66, 213-221, 2010), including simulated annealing with torsion angle dynamics, and alternated with manual rebuilding using COOT (Emsley et al., Acta Crystallogr D Biol Crystallogr 66, 486-501, 2010). Data collection and refinement statistics are shown in Table 3.",
                                "Crystals of the mmTGF-β2-7M:TβRII complex were formed in hanging drops at 25° C. by combining 1.0 μL of a 7.4 mg mL−1 stock solution of the complex in 10 mM Tris, pH 7.4 with 1.0 μL of 0.1 M HEPES, pH 7.5, 60% v/v (+/−)-2-Methyl-2,4-pentanediol. Harvested crystals were mounted in nylon loops, followed by flash-cooling in liquid nitrogen prior to data collection. Data were acquired at the Advanced Photon Source 24-ID-C and integrated and scaled using HKL2000 (Otwinowski and Minor, Method Enzymol 276, 307-326, 1997). The structure was determined by the molecular replacement method implemented in PHASER (McCoy et al., J Appl Crystallogr 40, 658-674, 2007) using TβRII (PDB 1M9Z; Boesen et al., Structure 10, 913-919, 2002) and mmTGF-β2 as search models. Coordinates were refined using PHENIX (Adams et al., Acta Crystallogr D Biol Crystallogr 66, 213-221, 2010), alternated with manual rebuilding using COOT (Emsley et al., Acta Crystallogr D Biol Crystallogr 66, 486-501, 2010). Data collection and refinement statistics are shown in Table 3.",
                                "Crystals of mmTGF-β2-7M were formed in hanging drops at 25° C. by combining 1.0 μL of a 10 mg mL−1 protein stock solution in 20 mM acetic acid with 0.8 μL of the precipitant from the well, 100 mM sodium acetate dibasic trihydrate, pH 4.6, 25% 2-propanol, and 400 mM calcium chloride dehydrate, and 0.2 μL 5% n-ocyl-O-D-glucoside. Harvested crystals were mounted in nylon loops and cryoprotected in well buffer containing 20% glycerol and flash-cooled in a nitrogen stream. Data was collected at 100 K using a Rigaku FR-E Superbright generator equipped with a Saturn 944 CCD detector and processed using MOSFLM (Battye et al., Acta Crystallogr D 67, 271-281, 2011) in CCP4 (Winn et aL, Acta Crystallogr D 67, 235-242, 2011). The structure of mmTGF-β2-7M was solved via molecular replacement using the structure of mmTGF-β2-7M from its co-crystal structure with TβRII. Iterative model building and refinement were performed using COOT (Emsley et al., Acta Crystallogr D Biol Crystallogr 66, 486-501, 2010) and PHENIX, respectively. Data collection and refinement statistics are shown in Table 3.",
                                "Results of structural studies are shown in FIGS. 2A-2D, 5A-5E, 9A-9B and 10A-10B.",
                                "Luciferase Assays",
                                "Human embryonic kidney 293 (HEK293) cells stably transfected with the CAGA12 TGF-13 reporter were used for the luciferase reporter assays (Thies et al., Growth Factors 18:251-259, 2001). HEK293 cells containing the stably transfected CAGA12TGF-β reporter were maintained in Dulbecco's modified eagles medium (DMEM) containing 10% fetal bovine serum (PBS) and 1% penicillin/streptomycin. Cells were treated for 16 hours with a TGF-β (TGF-β1, mTGF-β3 or mmTGF-β2-7M) concentration series or an mmTGF-β2-7M concentration series in the presence of a constant sub-saturating concentration of TGF-β (TGF-β1, 8 pM; TGF-β2, 20 pM; TGF-β3, 10 pM). Proteins were diluted in DMEM containing 0.1% w/v BSA. After 16 hours, cells were lysed with Tropix lysis buffer (ThermoFisher, Waltham, Mass.) and luciferase activity was read with a Promega GloMax luminometer (Promega, Madison, Wis.). Luciferase activity was normalized to total protein levels determined by bicinchoninic acid (BCA) protein assay. Graphpad Prism 6 was used to fit the data to standard models for ligand activity (EC50) and ligand inhibitory activity (IC50) (Graphpad, La Jolla, Calif.). Results are shown in FIGS. 6A-6B.",
                                "Time-Resolved FRET Assays",
                                "The following purified proteins were used to address the ligand requirements for the formation of complexes containing TβRI and TβRII: TGF-β3, mTGF-β3, mmTGF-β2-7M, biotinylated TβRI-ΔC-Avi and TβRII-His. Initially 20 μM binary complexes of TGF-β3:TbRII-His (1:2), mTGF-β3:TβRII-His (1:1), and mmTGF-β2-7M:TβRII-His (1:1) were formed in a 50 mM Tris, pH 7.5 buffer and stored at 4° C. A time-resolved fluorescence resonance energy transfer (TR-FRET) assay based on the proximity-dependent transfer of fluorescence from the donor terbium cryptate labeled anti-His mAb (Tb-anti-His, CisBio, Bedford, Mass.) to the acceptor XL665 labeled streptavidin (SA-665, CisBio, Bedford, Mass.) was used to monitor the assembly of ternary ligand:TβRII-His:biotinylated TβRI-ΔC-Avi complexes. Fifty μL assays containing 100 nM or 250 nM TGF-β3:TβRII-His (1:2), mTGF-β3:TβRII-His (1:1), and mmTGF-β2-7M:TβRII-His (1:1) complexes were incubated with 50 nM biotinylated TβRI-4C-Avi. Each 50 μl ternary complex formation assay also contained 2 nM Tb-anti-His and 30 nM SA-665 and was incubated at room temperature for 2 hours. Each condition was tested in replicates of six. Buffer control (n=6) contained only 2 nM Tb-anti-His and 30 nM SA-XL665. The buffer conditions for each assay were 50 mM Tris, 50 mM NaCl, pH 7.5. The assays were performed in Corning black 384 well low flange microplates (ThermoFisher, Waltham, Mass.). After a 2-hour incubation, the assay plate was measured for terbium/XL-665 TR-FRET on a BMG Labtech Pherastar FS multimode plate reader (BMG Labtech Inc., Cary, N.C.). An optic module containing 337, 490 and 665 nm filters was used to monitor TR-FRET producing raw data for 337/490 (terbium emission) and 337/665 (XL-665) emission. The ratio of 665 emission/490 emission was determined for each condition and was subsequently used to calculate ΔF, which is a measure that reflects the signal of the sample versus the background. ΔF was calculated using the following equation: (Ratiosignal-Rationegative/Rationegative)×100. The Ratiosignal refers to the assays containing the trimeric complexes or buffer control. The Rationegative refers to two assays buffer control (2 nM Tb-anti-His and 30 nM SA-665). For the buffer control, 2 out of the 6 replicates were assigned as negative controls for the purpose of calculating ΔF. ΔF was calculated for the remaining 4 buffer control replicates. Results are shown in FIGS. 7A, 7B and 14.",
                                "Analytical Ultracentrifugation",
                                "mTGF-β3, mmTGF-β2, and mmTGF-β2-7M were analyzed by sedimentation velocity to establish equilibrium constants for self-association of monomeric TGF-βs to form homodimers. mTGF-β3, mmTGF-β2, and mmTGF-β2-7M were each measured at 280 nm in an epon two channel centerpiece fitted with quartz windows, and centrifuged at 20° C. and 42,000 rpm for 27 hours in a 15 mM sodium phosphate buffer adjusted to pH 3.8, containing 100 mM NaCl. Three hundred scans were collected in intensity mode on a Beckman Optima XL-I analytical ultracentrifuge at the CAUMA facility at the UTHSCSA. Data analysis was performed with UltraScan release 2130 (Demeler and Gorbet, Analytical ultracentrifugation data analysis with Ultrascan-III, In Analytical Ultracentrifugation: Instrumentation, Software, and Applications (Uchiyama, S., Stafford, W., and Laue, T., Eds.), pp 119-143, Springer, 2016; Demeler et al., A comprehensive data analysis package for analytical ultracentrifugation experiments, 2016), calculations were performed at the Texas Advanced Computing Center on Lonestar-5. The sedimentation velocity data were initially fitted with the two-dimensional spectrum analysis as described in (Demeler, Curr Protoc Protein Sci Chapter 7, Unit 7 13, 2010) to remove time- and radially invariant noise from the raw data, and to fit the meniscus position. Subsequently, the data were fitted to a discrete monomer-dimer model using the adaptive space-time finite element method (Cao and Demeler, Biophys J 95, 54-65, 2008) and genetic algorithms for the parameter optimization (Demeler et al., Macromol Biosci 10, 775-782, 2010). The monomer-dimer model accounts for mass action and the reversible association behavior, fitting the KD, hydrodynamic parameters, as well as the partial specific volume while assuming the predicted molar mass for either wildtype or mutant. A Monte Carlo analysis (Demeler and Brookes, Colloid Polym Sci 286, 129-137, 2008) with 100 iterations was performed for each dataset to obtain fitting statistics. Buffer density and viscosity were estimated with UltraScan based on buffer composition and all hydrodynamic values were corrected for standard conditions (20° C. and water). The fitting results provided an excellent fit with random residuals and very low RMSD values. All results are summarized in Table 4, and FIGS. 11-13.",
                                "Results",
                                "Design of Engineered Mini-Monomeric TGF-β (mmTGF-β)",
                                "The structures of the TGF-β receptor complexes (Groppe et al., Mol Cell 29, 157-168, 2008; Radaev et al., J Biol Chem 285:14806-14814, 2010), as well as accompanying binding and cross-linking studies with TGF-β3 C77S (Ztilliga et al., J Mol Biol 354, 1052-1068, 2005; Groppe et al., Mol Cell 29, 157-168, 2008; Huang et al., EMBO J 30:1263-1276, 2011), suggested that the signaling capacity of monomeric TGF-βs (TGF-β1 C77S or mTGF-β1 and TGF-β3 C77S or mTGF-β3) arise from their ability to non-covalently dimerize and in turn bind their receptors (FIGS. 1A and 1C). This led to the hypothesis that it should be possible to diminish or completely eliminate receptor complex assembly with monomeric TGF-βs by removing or altering residues responsible for dimer formation and binding of TβRI. The structural motif that likely contributes the greatest to self-association of the monomers is the “heel” α-helix, α-helix 3 (FIG. 1A). This helix is highly amphipathic and has numerous hydrophobic interactions with residues that line the “palm” of the opposing monomer (FIG. 1B). This helix also forms a large portion of the binding surface for TβRI (FIG. 1C). Thus, it was hypothesized that elimination of α-helix 3 would interfere with both self-association of the monomers and binding of TβRI, but would not impair TβRII binding as this occurs through the ligand fingertips far away from α-helix 3 (FIG. 1A).",
                                "To evaluate this hypothesis, bacterial expression constructs were generated for TGF-β1, TGF-β2, and TGF-β3 in which residues 52-71 were eliminated and Cys-77 was substituted with serine. This corresponds to deletion of all of α-helix 3, as well as five flanking residues on the N-terminal end and three flanking residues on the C-terminal end (FIG. 1D). The length of the deletion was chosen so as to leave a sufficient number of residues between the last residue of β-strand 4 (Gly-48) and the first residue of β-strand 5 (Cys-77/Ser-77) to form an unconstrained loop that bridges β-strands 4 and 5. Although a secondary consideration, either two (TGF-β2) or three (TGF-β1 and -β3) of the loop-forming residues were also substituted to increase the net overall charge at pH 7.0 for the full-length TGF-β1, -β2, and -β3 monomers from −0.9, +1.1, and +4.4 to −3.1, +3.9, and +6.1, respectively, for the constructs in which α-helix 3 was deleted (FIG. 1D). The rationale for this was that the solubility of the monomers, which like the homodimers are poor from pH 4.5 to 9.5 (see FIGS. 4A and 4B), might be improved by both removing hydrophobic α-helix 3 and by artificially increasing the net charge at pH 7.0.",
                                "Isolation and Physical Characterization of mmTGF-f32",
                                "The TGF-β1, -β2, and -β3 “mini-monomers” described above, designated mmTGF-β1, mmTGF-β2, and mmTGF-β3, were expressed in Escherichia coli and accumulated in the form of insoluble inclusion bodies. The inclusion bodies were isolated, and after reconstitution and purification in denaturant, the mini-monomers were renatured by dilution into CHAPS-containing buffer at pH 9.0 as described previously (Huang et al., Methods Mol Biol 1344:63-92, 2016). The folding of the mini-monomers differed greatly; a large portion of the mmTGF-β2 remained soluble during the folding and yielded large amounts of monomeric protein after purification by cation exchange chromatography, whereas only a small amount of mmTGF-β1 and mmTGF-β3 remained soluble during the folding, and either no monomeric protein (TGF-β1) or a very small amount of monomeric protein (TGF-β3) was obtained after purification by cation exchange chromatography. This pattern mirrors the pattern previously observed for the folding of TGF-β homodimers from full-length wild type monomers (Huang et al., Methods Mol Biol 1344:63-92, 2016) and likely reflects differences in the intrinsic propensity of the monomers to properly form the four intramolecular disulfides characteristic of each monomer. mmTGF-β2 was the least desired variant, due to the expected low affinity for binding TβRII. However, this was considered an addressable concern based on prior studies, which demonstrated that substitution of Lys-25, Ile-92, and Lys-94 in TGF-β2 with the corresponding residues in TGF-β1 and TGF-β3 engendered TGF-β2 with the ability to bind TβRII with high affinity (Baardsnes et al., Biochemistry 48:2146-2155, 2009; De Crescenzo et al., J Mol Biol 355:47-62, 2006).",
                                "To determine whether mmTGF-β2 was suitable for further development in the manner described above, it was characterized in terms of its folding, solubility, and receptor binding properties. To assess folding, a 15N-labeled sample of mmTGF-β2 was prepared and examined by recording a two-dimensional 11-15N shift correlation spectrum (FIG. 2A). This revealed a highly dispersed spectrum characteristic of natively folded protein. The spectrum could be fully assigned, and analysis of the assigned chemical shifts to identify secondary structure propensities showed that the protein had the expected secondary structure, particularly in the palm region formed by the cysteine knot and the finger region where TβRII binds (FIG. 9A). This analysis further showed that the newly created loop between residues 47 and 56 had near zero probability of forming either an α-helix or β-strand, suggesting that it is likely flexible as would be expected for a loop of this length connecting two antiparallel β-strands. This was directly confirmed by an analysis of backbone 15N T2 values. These values provide information about motions on fast (nanosecond-picosecond) and intermediate (microsecond-millisecond) time scales and were significantly elevated in the region corresponding to the newly created loop relative to the other parts of the protein (FIG. 9B), which, except for the N terminus and the short loop connecting α-helix 1 and β-strand 1, are expected to be structurally well-ordered.",
                                "To directly examine the three-dimensional structure, mmTGF-β2 was crystallized, and its structure was determined to a resolution of 1.8 Å using molecular replacement (Table 3). The overall fold of mmTGF-β2 was shown to be highly similar to that previously determined for TGF-β2, with the exception of the newly created loop, which was shown to take the place of α-helix 3 as anticipated (FIG. 2B). Superimposition of the mmTGF-β2 with the monomer from the structure of TGF-β2 shows that there is a systematic displacement of up to about 1.5 Å of the finger region of mmTGF-β2 relative to TGF-β2. Such differences appear to be the result of bending of the monomer near the center of the finger region and not a change in the structure of the finger region, as superimposition of the fingers alone show that they correspond closely, with a backbone root-mean-square deviation of under 0.2 Å and similar orientations of the side chains of several residues that pack and stabilize the fingers (FIG. 2D). Such bending is also supported by an overlay of the two molecules of mmTGF-β2 present in the crystallographic asymmetric unit, which also exhibit a smaller but still noticeable displacement of the finger regions relative to one another (FIG. 2C). Consistent with the NMR analysis, not only was the electron density noticeably weaker in the region corresponding to the newly created loop, but also it was shown to adopt different orientations for the two molecules from the asymmetric unit FIG. 2C).",
                                "The similar folding of mmTGF-β2 relative to TGF-β2, especially in the TβRII-binding finger region, suggested that it would also bind TβRII in a similar manner. To evaluate this, surface plasmon resonance (SPR) experiments were performed in which the same concentration series of TβRII was injected over TGF-β2 and mmTGF-β2 immobilized on separate flow cells (FIGS. 3A and 3B). Although it was not possible to quantitate affinity due to weak binding, the sensorgrams nonetheless showed similar shapes and concentration dependence. These sensorgrams showed that mmTGF-β2 binds TβRII weakly, consistent with earlier reports Baardsnes et al., Biochemistry 48:2146-2155, 2009), and that it did so in a manner qualitatively similar to TGF-β2.",
                                "The solubility of mmTGF-β2 appeared to be significantly better than that of TGF-β2 and the full-length TGF-β2 monomer, mTGF-β2, as samples of the former could be readily prepared at concentrations of 2-3 mg ml−1 without noticeable precipitation at pH 7.0, whereas samples of the latter two proteins were completely precipitated under these same conditions. To quantitate solubility, TGF-β2, mTGF-β2, and mmTGF-β2 were prepared as concentrated stocks in 100 mM acetic acid, pH 2.9, where they were readily soluble and then diluted into PBS, pH 7.4. The light scattering at 340 nM was measured to assess precipitation, and then the samples were centrifuged, and the absorbance at 280 nM was measured to assess the protein concentration. This demonstrated that TGF-β2 and mTGF-β2 were both effectively insoluble at neutral pH over the entire concentration range evaluated (7-100 μM) (FIGS. 4A and 4B). This is consistent with the known poor solubility of the TGF-β homodimers (Pellaud et al., J Biol Chem 274:7699-7704, 1999), but it shows that this property also extends to full-length monomeric TGF-βs. The mini-monomeric TGF-β2 (mmTGF-β2) in contrast, exhibited modest light scattering and a corresponding modest reduction in the amount of soluble protein relative to that expected when the protein concentration was 40 μM or higher, indicating that indeed mmTGF-β2 was reasonably soluble at neutral pH, although not perfectly so. This was reflected in NMR spectra, which showed that although 100-200 μM 15N mmTGF-β2 samples could be readily prepared, the spectrum was nonetheless poor, with the only detectable signals arising from residues in the flexible parts of the protein, namely the N terminus, the exposed loop between α-helix 1 and β-strand 1, and the newly created loop between β-strands 4 and 5. The fact that signals could only be detected from the flexible parts of the protein suggested that mmTGF-β2 forms large soluble aggregates under these conditions. Through trial and error, it was found that these soluble aggregates could be eliminated by addition of the zwitterionic detergent CHAPS, with the majority of the NMR signals appearing at the concentration of 5 mM CHAPS and all of the NMR signals appearing at 10 mM CHAPS. Thus, all NMR spectra, including that shown in FIG. 2A, were recorded in the presence of 10 mM CHAPS.",
                                "Isolation and Physical Characterization of mmTGF-β2-7M",
                                "The results presented above show that whereas mmTGF-β2 is natively folded, it nonetheless possesses low intrinsic affinity for binding TβRII. To confer mmTGF-β2 with the ability to bind TβRII with high affinity comparable with that of TGF-β1 and TGF-β3, the three residues in mouse TGF-β2 shown previously to differ in the interface with TβRII, Lys-25, Ile-92, and Asn-94 (De Crescenzo et al., J Mol Biol 355:47-62, 2006; Hart et al., Nat Struct Biol 9:203-208, 2002), were substituted with the corresponding residues from TGF-β1 and -β3, Arg-25, Val-92, and Arg-94 (FIGS. 1E and 1F). In previous studies, substitution of these three residues was shown to be sufficient to confer TGF-β2 with a TβRII binding affinity comparable with TGF-β1 and TGF-β3 (Baardsnes et al., Biochemistry 48:2146-2155, 2009; De Crescenzo et al., J Mol Biol 355:47-62, 2006). Despite this, four additional residues peripheral to the TβRII-binding site that differed in TGF-β2 relative to TGF-β1 were also substituted with the corresponding residues from TGF-β1 (R26K, L89V, T95K, and I98V) (FIGS. 1E and 1F). Although previous results suggested this was not strictly necessary, it was nonetheless done to ensure that the precise orientation of residues in the mmTGF-β2-binding site for TβRII matched as closely as possible with that in the high affinity TGF-β isoforms, TGF-β1 and TGF-β3. The resulting construct bearing these seven amino acid substitutions, designated mmTGF-β2-7M (FIG. 1E, FIG. 9 and Table 1), was expressed in E. coli in the form of insoluble inclusion bodies. As with mmTGF-β2, most of the protein remained in solution after reconstitution and dilution into native folding buffer, and large amounts of homogenous monomer could be isolated (4-5 mg/liter of E. coli culture medium).",
                                "The folding and homogeneity of the isolated mmTGF-β2-7M was evaluated by NMR, and as with mmTGF-β2, the protein was found to have the expected number of signals in a 2D 1H-15N shift correlation spectrum (FIG. 5A) as well as secondary structure, as determined by an analysis of the NMR secondary shifts (FIG. 10A). The solubility of mmTGF-β2-7M was evaluated as before, and as shown, its behavior was comparable or perhaps slightly better than that of mmTGF-β2 (FIGS. 4C and 4D). This slight improvement in the macroscopic solubility did not however change the microscopic solubility as NMR analysis showed that it was still necessary to include 10 mM CHAPS in the sample buffer to detect signals from all of the backbone amide resonances in the protein.",
                                "The three-dimensional structure of mmTGF-β2-7M was determined by crystallography to a resolution of 2.75 Å (Table 3), and as before the overall fold was preserved relative to TGF-β2, with the only difference being a slight hinge bending of the monomer as described for mmTGF-02 (FIGS. 5B and 5C). The increase in the 15N T2 relaxation times in the region corresponding to the newly formed loop in mmTGF-β2-7M was comparable with that in mmTGF-β2 (FIG. 10B). This suggested that the missing density in the region corresponding to the newly formed loop in mmTGF-β2-7M, which among the three molecules in the asymmetric unit was observed for part of chain A and most of chain C, was not due to increased dynamics, but other factors, most likely the lower resolution of the mmTGF-β2-7M structure compared with the mmTGF-β2 structure (Table 3).",
                                "To determine whether mmTGF-β2-7M bound TβRII with high affinity, variants of mmTGF-β2-7M and TGF-β3 were produced bearing an N-terminal avitag, and after biotinylation and immobilization onto a streptavidin-coated SPR sensor, their binding affinity for TβRII was measured by performing kinetic SPR experiments (FIGS. 3C and 3D). The sensorgrams obtained differed greatly from that previously obtained for mmTGF-β2 and TGF-β2, in that they exhibited a clear pattern of saturation. The sensorgrams were furthermore shown to have similar shapes as well as fitted parameters, including KD values (Table 2), which were within experimental error of one another and consistent, although on the high end, with KD values reported earlier for TβRII binding to TGF-β1 and TGF-β3 (Huang et al., EMBO J 30:1263-1276, 2011; Baardsnes et al., Biochemistry 48:2146-2155, 2009; De Crescenzo et al., J Mol Biol 355:47-62, 2006).",
                                "To determine whether the interactions that enabled high affinity TβRII binding were preserved in mmTGF-β2-7M compared with TGF-β1 and TGF-β3, the mmTGF-β2-7M·TβRII complex was crystallized, and its structure was determined to a resolution of 1.88 Å (Table 3). The overall structure of the mmTGF-β2-7M·TβRII complex was shown to be very similar to that of one of the TβRII-bound monomers from the structure of the TGF-β3 TβRI complex, with TβRII bound to the mmTGF-β2-7M fingertips in a manner that is essentially indistinguishable from that of TGF-β3 (FIG. 5D). The interactions known to contribute most significantly to high affinity binding are furthermore shown to be fully preserved in the mmTGF-β-7M·TβRII complex relative to TGF-β1.113RII and TGF-β3. TβRII complexes that have been previously determined (the TGF-β3TβRII complex determined to 1.8 Å (Hart et al., Nat Struct Biol 9:203-208, 2002) is shown as this is the highest resolution structure determined to date) (FIG. 5E). This includes the packing of Ile-53 from TβRII in the hydrophobic pocket between the TGF-β fingers, and the hydrogen-bonded ion pairs formed between TGF-β Arg-25 and Arg-94 on the tips of the loops connecting fingers ½ and ¾, respectively, and the carboxylate groups of Glu-119 and Asp-32 on TβRII (FIG. 5E).",
                                "Inhibitory Activity of mmTGF-β2-7M and the Underlying Mechanism",
                                "The results presented above show that mmTGF-β2-7M possesses one of the essential attributes required to function as a dominant negative inhibitor of TGF-β signaling, which is the ability to bind TβRII with high affinity comparable with that of TGF-β1 and TGF-β3. To directly assess whether mmTGF-β2-7M might signal and, if not, whether it might function as an inhibitor, TGF-β signaling was assessed by treating HEK293 cells stably transfected with a TGF-luciferase reporter under the control of a CAGA12 promoter (Thies et al., Growth Factors 18:251-259, 2001) with increasing concentrations of TGF-βs. The results showed that dimeric TGF-β1 (TGF-β1) and full-length monomeric TGF-β3 (mTGF-β3) resulted in a sigmoidal increase in the luciferase response, with concentrations of roughly 25 pM TGF-β1 and 250 pM mTGF-β3 leading to no further increase in the measured luciferase response. This is consistent with earlier reports that showed that (full-length) monomeric TGF-β1 and -β3 were 5-15-fold less potent than their dimeric counterparts (Ztilliga et al., J Mol Biol 354, 1052-1068, 2005; Amatayakul-Chantler et al., J Biol Chem 269:27687-27691, 1994). The normalized luciferase responses could be readily fitted to a standard model for ligand-dependent activation and yielded EC50 values of 12.4±1.5 pM for TGF-β1 and 182±16 pM for mTGF-β3. The values for TGF-β1 and mTGF-β3 were in close accord with the values previously reported by Amatayakul-Chantler et al. (J Biol Chem 269:27687-27691, 1994) for TGF-β1 and by Zúñiga et al. (J Mol Biol 354, 1052-1068, 2005) for mTGF-β3. The potent sub-nanomolar signaling activity observed for TGF-β1 and mTGF-β3 stands in contrast to that of mmTGF-β2-7M, which had no detectable signaling activity at the concentration that led to a saturating response for mTGF-β3 (ca. 200 pM) or at concentrations that were up to four orders of magnitude higher (FIG. 6A). Thus, mmTGF-β2-7M was either completely devoid of signaling activity or it possessed signaling activity, but with a potency more than a 10,000-fold less than that of mTGF-β3.",
                                "To further investigate the properties of mmTGF-β2-7M, a competition experiment was performed in which the same HEK293 luciferase reporter cell line was stimulated with a constant sub-EC50 concentration of dimeric TGF-β1 (8.0 pM) and increasing concentrations of mTGF-β3 or mmTGF-β2-7M. The results showed that mTGF-β3 further stimulated signaling with a midpoint concentration similar to that of mTGF-β3 alone (FIG. 6B). The fitted EC50 values confirm this, with an EC50 of 182±16 pM for the data shown in FIG. 6A and EC50 of 194±36 pM for the data shown in FIG. 6B. The behavior of mmTGF-β2-7M was very different, with no detectable change in the signaling activity when added up to concentrations of 10 nM, but with a sharp decrease to no detectable signaling activity when the concentration was increased to 100 nM (FIG. 6B). This shows that mmTGF-β2-7M indeed possesses no signaling activity and that it can function to completely block and inhibit TGF-β signaling. The normalized luciferase responses could be readily fitted to a standard model for ligand-dependent inhibition and yielded an IC50 value of 68±7 nM. Similar experiments showed that mmTGF-β2-7M also functioned as a potent competitive inhibitor against the other TGF-β isoforms, TGF-β2 and TGF-β3, with measured IC50 values (TGF-β2 IC50 19±3 nM and TGF-β3 IC50 21±8 nM) within a factor of 2-3 of that measured for TGF-β1 (FIGS. 15A and 15B). These IC50 values are on the lower end of the range of affinities that have been reported for binding of the high affinity TGF-β isoforms to TβRII, including mmTGF-β2-7M reported herein (Table 2). This suggests that mmTGF-β2-7M functions to inhibit TGF-β signaling by binding to and blocking endogenous TβRII. The fact that the measured potency is greater than the greatest affinity previously reported for TGF-β1 and TGF-β3 binding to TβRII (140 nM) (9), suggests that other factors, such as nonspecific association of mmTGF-β2-7M with the plasma membrane, may serve to potentiate its inhibitory activity.",
                                "The finding that mmTGF-β2-7M possesses no apparent signaling activity, and functions as a low nanomolar inhibitor of TGF-β signaling, suggests that the elimination of α-helix 3 diminished non-covalent association of the monomers and greatly attenuated or abrogated TβRI binding. To assess this directly, SPR experiments were performed to determine whether mmTGF-β2-7M could recruit TβRI in the presence of TβRII. To accomplish this, increasing concentrations of TβRI and the same concentration series of TβRI in the presence of near-saturating amounts of TβRII (2 μM) were injected over the same TGF-β3 and mmTGF-β2-7M SPR chip surfaces used for the TβRII binding measurements described above. This showed that TβRI alone binding is negligible to both TGF-β3 and mmTGF-β2-7M (FIGS. 3E and 3F), but unlike TGF-β3, TβRII-bound mmTGF-β2-7M is unable to recruit TβRI (FIGS. 3G and 3H). This is consistent with the earlier result reported by Huang et al. (EMBO J 30:1263-1276, 2011) that TβRII-bound mTGF-β3 was significantly or completely impaired in terms of its ability to bind and recruit TβRI. This also provides further evidence that TβRII-bound TGF-β monomers are incapable of binding and recruiting TβRI, but because the mmTGF-β2-7M was immobilized on the surface of the sensor, it alone does not provide any insight as to whether mmTGF-β2-7M might be capable of non-covalently dimerizing and binding and recruiting TβRI.",
                                "To address these questions directly, two solution-based techniques were used, analytical ultracentrifugation (AUC) and time-resolved fluorescence resonance energy transfer (TR-FRET). The AUC experiments were performed by measuring the total UV absorbance at 280 nm as a function of the radial position and time as mTGF-β3, mmTGF-β2, and mmTGF-β2-7M were sedimented under acidic conditions, pH 3.8, where the monomers are fully soluble. The AUC data revealed parabolically shaped van Holde-Weischet sedimentation coefficient distribution plots for all three monomers, consistent with each undergoing reversible self-association to form a dimer or other higher order oligomer. To determine more precisely which species might be present in solution, the data were fitted to the simplest model possible, a discrete monomer-dimer equilibrium, using finite element analysis. The fitting procedure resulted in near-perfect fits for all three monomers to the simple monomer-dimer model, as shown by (a) the close overlays between the fitted curves (red) with the raw data, after the time and radially-invariant noise was removed (black) and (b) the absence of any systemic deviations in the residuals (FIGS. 11-13). The fitted parameters further showed that KD for self-association was 1 order of magnitude greater for mTGF-β3 compared with mmTGF-β2 and mmTGF-β2-7M. Thus, the removal of the heel helix, a3, does diminish self-association of the monomers to form dimers, but it does not completely abrogate dimer formation.",
                                "TR-FRET was used to assess the ability of dimeric and monomeric TGF-βs to bind and bring TβRI and TβRII together. This was accomplished by generating differentially tagged forms of TβRII and TβRI and in turn binding to these tags with proteins labeled with fluorescent donors and acceptors. TβRII was tagged with a C-terminal His tag and was bound by a terbium cryptate-labeled anti-His monoclonal antibody fluorescent donor, and TβRI was tagged with an N-terminal avitag, which after enzymatic biotinylation was bound to a dye-labeled (XL-665) streptavidin fluorescent acceptor (FIG. 7A). The addition of TGF-β to the tagged receptors brings them together and leads to a large increase in the ΔF value, which is defined as the ratio of the acceptor and donor emission fluorescent intensities. The TR-FRET assay is demonstrated by the data presented in FIG. 14 and was used here to compare the ability of the TGF-β3 full-length monomer, mTGF-β3, and the TGF-β2 mini-monomer that binds TβRII with high affinity, mmTGF-β2-7M, to bind and bring TβRI and TβRII together. The TR-FRET signal for mTGF-β3 was shown to be comparable with that of TGF-β3, and this did not depend on whether the TGF-β concentration was 100 or 250 nM (FIG. 7B). The TR-FRET signal of mmTGF-β2-7M was, in contrast, within the error limits of the buffer control, and this did not depend on the TGF-β concentration (FIG. 7B). These results demonstrate that under these conditions, mTGF-β3 retains full capacity to assemble a non-covalent dimeric complex with TβRI and TβRII, but under these same conditions, mmTGF-β2-7M has no capacity to do so. These results, together with the AUC results, indicate that the removal of the heel helix had the effects hypothesized; its removal reduced, but did not eliminate, dimer formation, and even though dimers are still formed, they are unable to bind and recruit TβRI."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce TGF-β1 and TGF-β3 monomers",
                                "describe limitations of TGF-β1 and TGF-β3 monomers",
                                "hypothesize non-covalent dimerization of TGF-β monomers",
                                "design engineered monomer to inhibit TGF-beta signaling",
                                "replace interfacial α-helix with flexible loop",
                                "limit potential of monomers to non-covalently dimerize",
                                "eliminate contact surface for TGF-β type I receptor",
                                "summarize nomenclature and features of dimeric and monomeric TGF-β",
                                "show complete sequences of TGF-β variants",
                                "express and purify human MI ectodomain",
                                "express and purify human TβRII ectodomain",
                                "describe protein expression and purification methods",
                                "express and purify avi-tagged homodimeric TGF-β3",
                                "express and purify mini monomeric TGF-β1",
                                "express and purify mini monomeric TGF-β2",
                                "express and purify mini monomeric TGF-β3",
                                "express and purify mini monomeric TGF-β2 with seven substitutions",
                                "express and purify avi-tagged mini monomeric TGF-β2 with seven substitutions",
                                "describe solubility assays",
                                "measure light scattering and absorbance",
                                "describe NMR spectroscopy methods",
                                "prepare NMR samples",
                                "acquire and analyze NMR data",
                                "describe SPR binding measurements",
                                "immobilize TGF-β2 and mmTGF-β2 on sensor chip",
                                "perform SPR experiments with TGF-β3 and mmTGF-β2-7M",
                                "describe crystallization and structure determination methods",
                                "determine structure of mmTGF-β2",
                                "determine structure of mmTGF-β2-7M:TβRII complex",
                                "determine structure of mmTGF-β2-7M",
                                "describe luciferase assays",
                                "describe time-resolved FRET assays",
                                "introduce analytical ultracentrifugation",
                                "describe sedimentation velocity experiment",
                                "analyze data with UltraScan",
                                "summarize results in Table 4 and FIGS. 11-13",
                                "motivate design of engineered mini-monomeric TGF-β",
                                "describe structure of TGF-β receptor complexes",
                                "hypothesize role of α-helix 3 in self-association and receptor binding",
                                "design bacterial expression constructs for TGF-β1, -β2, and -β3",
                                "describe deletion of α-helix 3 and substitution of Cys-77 with serine",
                                "explain rationale for increasing net charge at pH 7.0",
                                "isolate and characterize mmTGF-β1, -β2, and -β3",
                                "describe folding and purification of mini-monomers",
                                "compare solubility of mmTGF-β1, -β2, and -β3",
                                "characterize mmTGF-β2 by NMR spectroscopy",
                                "analyze secondary structure propensities of mmTGF-β2",
                                "determine three-dimensional structure of mmTGF-β2 by X-ray crystallography",
                                "compare structure of mmTGF-β2 with TGF-β2",
                                "examine receptor binding properties of mmTGF-β2 by SPR",
                                "compare binding of mmTGF-β2 with TGF-β2",
                                "evaluate solubility of mmTGF-β2 at neutral pH",
                                "compare solubility of mmTGF-β2 with TGF-β2 and mTGF-β2",
                                "analyze NMR spectra of mmTGF-β2 in presence of CHAPS",
                                "eliminate soluble aggregates of mmTGF-β2 with CHAPS",
                                "record NMR spectra in presence of 10 mM CHAPS",
                                "summarize results of mmTGF-β2 characterization",
                                "introduce mmTGF-β2-7M",
                                "describe physical characterization",
                                "describe folding and homogeneity evaluation",
                                "describe solubility evaluation",
                                "describe three-dimensional structure determination",
                                "compare structure with TGF-β2",
                                "describe TβRII binding affinity measurement",
                                "describe mmTGF-β2-7M·TβRII complex structure determination",
                                "compare complex structure with TGF-β3·TβRII complex",
                                "describe inhibitory activity assessment",
                                "describe signaling activity measurement",
                                "describe competition experiment",
                                "describe IC50 value determination",
                                "describe inhibition of TGF-β signaling",
                                "describe mechanism of inhibition",
                                "describe TβRI recruitment experiment",
                                "describe SPR experiment",
                                "describe analytical ultracentrifugation experiment",
                                "describe time-resolved fluorescence resonance energy transfer experiment",
                                "describe TR-FRET assay demonstration",
                                "compare TR-FRET signals of mTGF-β3 and mmTGF-β2-7M",
                                "describe effect of heel helix removal on dimer formation",
                                "describe effect of heel helix removal on TβRI recruitment",
                                "summarize mmTGF-β2-7M properties",
                                "describe mmTGF-β2-7M as dominant negative inhibitor",
                                "describe potential applications of mmTGF-β2-7M",
                                "discuss advantages of mmTGF-β2-7M over other TGF-β isoforms",
                                "discuss potential limitations of mmTGF-β2-7M",
                                "conclude mmTGF-β2-7M as potent inhibitor of TGF-β signaling"
                            ],
                            "num_characters": 43961,
                            "outline_medium": [
                                "introduce TGF-β1 and TGF-β3 monomers",
                                "describe limitations of TGF-β1 and TGF-β3 monomers",
                                "hypothesize non-covalent dimerization of TGF-β monomers",
                                "design engineered monomer to inhibit TGF-beta signaling",
                                "replace interfacial α-helix with flexible loop",
                                "limit potential of monomers to non-covalently dimerize",
                                "eliminate contact surface for TGF-β type I receptor",
                                "summarize nomenclature and features of dimeric and monomeric TGF-β",
                                "show complete sequences of TGF-β variants",
                                "express and purify human MI ectodomain and TβRII ectodomain",
                                "describe protein expression and purification methods",
                                "express and purify avi-tagged homodimeric TGF-β3",
                                "express and purify mini monomeric TGF-β variants",
                                "describe solubility assays and light scattering measurements",
                                "describe NMR spectroscopy methods",
                                "describe SPR binding measurements",
                                "introduce analytical ultracentrifugation",
                                "describe sedimentation velocity experiment",
                                "analyze sedimentation velocity data",
                                "summarize results",
                                "motivate design of engineered mini-monomeric TGF-β",
                                "describe design of mmTGF-β",
                                "express and purify mmTGF-β",
                                "characterize mmTGF-β folding and solubility",
                                "analyze NMR spectrum of mmTGF-β",
                                "determine three-dimensional structure of mmTGF-β",
                                "evaluate receptor binding properties of mmTGF-β",
                                "summarize physical characterization of mmTGF-β",
                                "introduce mmTGF-β2-7M",
                                "describe physical characterization",
                                "describe TβRII binding affinity",
                                "describe crystal structure",
                                "compare with TGF-β1 and TGF-β3",
                                "describe inhibitory activity",
                                "describe signaling activity",
                                "describe competition experiment",
                                "describe IC50 values",
                                "describe SPR experiments",
                                "describe analytical ultracentrifugation",
                                "describe time-resolved fluorescence resonance energy transfer",
                                "compare mmTGF-β2-7M with mTGF-β3",
                                "summarize results"
                            ],
                            "outline_short": [
                                "describe TGF-β1 and TGF-β3 monomers",
                                "discuss limitations of TGF-β1 and TGF-β3 monomers",
                                "hypothesize non-covalent dimerization of TGF-β monomers",
                                "design engineered monomer to inhibit TGF-beta signaling",
                                "describe structure of engineered monomer",
                                "discuss limitations of engineered monomer",
                                "summarize previous studies on TGF-β",
                                "introduce goal of study",
                                "introduce analytical ultracentrifugation",
                                "motivate design of engineered mini-monomeric TGF-β",
                                "describe design of mmTGF-β",
                                "isolate and characterize mmTGF-β2",
                                "analyze folding and solubility of mmTGF-β2",
                                "evaluate receptor binding properties of mmTGF-β2",
                                "describe mmTGF-β2-7M isolation and characterization",
                                "describe mmTGF-β2-7M binding to TβRII",
                                "describe inhibitory activity of mmTGF-β2-7M",
                                "describe competition experiment with TGF-β1 and mmTGF-β2-7M",
                                "describe SPR experiment with TβRI and mmTGF-β2-7M",
                                "describe AUC and TR-FRET experiments with mmTGF-β2-7M",
                                "summarize mmTGF-β2-7M properties and function"
                            ]
                        },
                        {
                            "title": "Discussion",
                            "paragraphs": [
                                "The TGF-βs are responsible for promoting the progression of numerous human diseases (Dietz et al., Nature 352:337-339, 1991; Biernacka et al., Growth Factors 29:196-202, 2011; Massague, Cell 134:215-230, 2008; Loeys et al., Pediatr Endocrinol Rev 10:417-423, 2013), yet despite nearly two decades of preclinical studies and clinical trials, no inhibitors have been approved for use in humans. The results presented herein demonstrate that an engineered TGF-β monomer, lacking Cys-77 and the heel α-helix (a3), functions to potently block and inhibit signaling of the TGF-β1, -β2, and -β3 with IC50 values in the range of 20-70 nM (FIG. 6B and FIG. 15). This novel inhibitor has several attributes that overcome limitations that have been encountered with other classes of inhibitors, for example the natural high specificity of TGF-β and thus the inhibitor for TβRII may engender it with much greater specificity, and thus fewer undesirable side effects, compared with the much more promiscuous TGF-β kinase inhibitors. The small size of the inhibitor (˜10 kDa) further confers a much greater ability to penetrate tumors and other dense tissues where the TGF-βs drive disease progression, a distinct advantage compared with IgG antibodies, which are much larger (˜150 kDa) and tend to occupy only the vascular and interstitial space of well perfused organs (Meibohm (2012) in Therapeutic Proteins: Strategies to Modulate Their Plasma Half-Lives (Kontermann R., editor), pages 23-38, Wiley-Blackwell, Weinheim, Germany; Meibohm and Braeckman (2008), “Pharmacokinetics and Pharmacodynamics of Peptides and Protein Drugs,” in Pharmaceutical Biotechnology: Fundamentals and Applications (Crommelin D. J. A., Sindelar R. D., and Meibohm B., eds), pages 95-123, Informa Healthcare, New York). The other advantages of this novel inhibitor include its high intrinsic stability, because of the four intramolecular disulfide bonds that tie the four fingers together, and the fact that it is highly soluble in water at neutral pH, unlike native TGF-β dimers or full-length TGF-β monomers.",
                                "The structures of TGF-β receptor complexes, together with the previously published chemical cross-linking data, suggested that the potent signaling activity of TGF-β1 C77S and TGF-β3 C77S was due to the ability of the monomers to non-covalently dimerize and in turn assemble a (TβRI TβRII)2 heterotetramer. The results presented here, namely the AUC experiments that were used to assess non-covalent dimer formation and the TR-FRET experiments that were used to assess assembly of complexes with TβRI and TβRII, provided further evidence for this. The AUC data showed that full-length monomeric TGF-β3, mTGF-β3, self-associates to form dimers with a dimerization constant of 4.1 μM (Table 4). The TR-FRET data showed that at a concentration of 0.1 or 0.25 μM and in the presence of comparable concentrations of the TβRI and TβRII ectodomains, mTGF-β3 assembles TβRITβRII complexes to the same extent as dimeric TGF-β3 (FIG. 7B). That this occurs, even under conditions where the mTGF-β3 concentrations (0.1-0.25 μM, FIG. 7B) were more than an order of magnitude below the KD value for self-association (4.1 μM, Table 4), indicates that receptor binding also contributes significantly to assembly of TβRI·TβRII complexes. The assembly of TβRI·TβRII complexes with mTGF-β3, and presumably mTGF-β1 as well, therefore appears to be a cooperative process, much like protein folding, in which multiple weaker interactions, including monomer-monomer, non-covalent dimer-receptor, and receptor-receptor interactions, cooperate to enable formation of a thermodynamically stable TGF-β. TβRI TβRII complex. This manner of cooperative assembly is likely responsible for the ability of mTGF-β1 and mTGF-β3 to induce signaling at concentrations that are more than 4 orders of magnitude below the KD value for self-association of the monomers (EC50 values of about 0.1 nM versus KD values for self-association of 4.1 μM).",
                                "The elimination of the heel helix from the TGF-β monomer was shown to be very effective in terms of blocking the cooperative assembly of TβRI TβRII complexes as shown by the TR-FRET data (FIG. 7B) and the cell based signaling data (FIGS. 6A and 6B). The AUC data showed that elimination of the heel helix led to the weakening of the monomer-monomer interaction by one order of magnitude (Table 4). The SPR data shown in FIGS. 3G and 3H, further showed that the TβRII-bound form of mmTGF-β2-7M was incapable of binding and recruiting TβRI, which is expected based on published structures of TGF-β receptor complexes that show that TβRI binds to a composite interface formed by both chains of TGF-β, as well as TβRII (Groppe et al., Mol Cell 29, 157-168, 2008; Radaev et al., J Biol Chem 285:14806-14814, 2010). Thus, the data show that the reduced propensity of the engineered monomer to self-associate, together with what would be expected to be very weak binding of TβRI to any dimers that do form, is responsible for the inability of mmTGF-β2-7M to assemble a TβRI TβRII complex. This accounts for the lack of signaling activity, and this together with the retention of high affinity TβRII binding accounts for the inhibitory activity.",
                                "The other type II receptors of the family, activin type II receptor II, activin type IIB receptor, BMP type II receptor, and anti-Mtillerian hormone type II receptor, have either been shown or are predicted to bind the GF knuckle and not the GF fingertips, as does TβRII (Hinck et al., Cold Spring Harb Perspect Biol 8:a022103, 2016). Nonetheless, they share the same property as TβRII in that they bind only by contacting residues from a single GF monomer and not both monomers as has been shown or is predicted for all type I receptors of the family (Hinck et al., Cold Spring Harb Perspect Biol 8:a022103, 2016). This, together with the structures reported here that show that it is possible to remove α3 without affecting the overall structure of the monomer (FIGS. 2B-2D and FIGS. 5B-5E), suggests that it might be possible to generate monomers of other GFs of the family lacking the heel helix that function as inhibitors. These types of inhibitors have numerous potential applications, ranging from research tools for probing roles of specific ligands in vivo to clinically useful inhibitors for treating disease, which are driven by hyperactive signaling by other ligands of the family, such as cancer cachexia by activin (Coerver et al., Mol Endocrinol 10:534-543, 1996).",
                                "In view of the many possible embodiments to which the principles of the disclosed invention may be applied, it should be recognized that the illustrated embodiments are only preferred examples of the invention and should not be taken as limiting the scope of the invention. Rather, the scope of the invention is defined by the following claims. We therefore claim as our invention all that comes within the scope and spirit of these claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce TGF-βs and diseases",
                                "motivate need for inhibitors",
                                "describe engineered TGF-β monomer",
                                "summarize advantages of inhibitor",
                                "explain signaling activity of TGF-β1 C77S and TGF-β3 C77S",
                                "describe AUC experiments",
                                "describe TR-FRET experiments",
                                "explain cooperative assembly of TβRI·TβRII complexes",
                                "describe elimination of heel helix",
                                "summarize effects of heel helix elimination",
                                "discuss potential applications of inhibitors",
                                "discuss scope of invention",
                                "conclude with claims"
                            ],
                            "num_characters": 6948,
                            "outline_medium": [
                                "motivate TGF-β inhibitors",
                                "describe engineered TGF-β monomer",
                                "explain signaling activity of TGF-β1 C77S and TGF-β3 C77S",
                                "discuss elimination of heel helix",
                                "suggest potential applications of inhibitors",
                                "define scope of invention"
                            ],
                            "outline_short": [
                                "motivate TGF-β inhibitors",
                                "describe engineered TGF-β monomer",
                                "discuss potential applications"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A recombinant transforming growth factor (TGF)-β monomer, comprising:\na cysteine to serine substitution at an amino acid residue corresponding to residue 77 of SEQ ID NO: 2;\n(ii) a deletion of the α3 helix corresponding to amino acid residues 52-71 of SEQ ID NO: 2; and\n(iii) at least one amino acid substitution relative to a wild-type TFG-β monomer that increases net charge of the recombinant TFG-β monomer.",
        "2. The recombinant TGF-β monomer of claim 1, further comprising at least one amino acid substitution relative to a wild-type TFG-β2 monomer that increases affinity of the recombinant TGF-β monomer for TGF-β type II receptor (TβRII).",
        "3. The recombinant TGF-β monomer of claim 1, which is a human TGF-β2 monomer, a human TGF-β1 monomer, or a human TGF-β3 monomer.",
        "4. The recombinant human TGF-β2 monomer of claim 3, wherein the at least one amino acid substitution that increases net charge of the monomer comprises:\na leucine to arginine substitution at an amino acid residue corresponding to residue 51 of SEQ ID NO: 2;\nan alanine to lysine substitution at an amino acid residue corresponding to residue 73 of SEQ ID NO: 2; or\nboth a leucine to arginine substitution at an amino acid residue corresponding to residue 51 and an alanine to lysine substitution at an amino acid residue corresponding to residue 73 of SEQ ID NO: 2.",
        "5. The recombinant human TGF-β2 monomer of claim 4, wherein the at least one amino acid substitution that increases affinity of the monomer for TβRII comprises a substitution at an amino acid residue corresponding to residue 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98 or 99 of SEQ ID NO: 2, or any combination of two or more residues thereof.",
        "6. The recombinant human TGF-β2 monomer of claim 5, wherein the at least one amino acid substitution that increases affinity of the monomer for TβRII comprises at least one substitution at residue 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36 or 37, and at least one substitution at residue 89, 90, 91, 92, 93, 94, 95, 96, 97, 98 or 99.",
        "7. The recombinant human TGF-β2 monomer of claim 6, wherein the at least one amino acid substitution that increases affinity of the monomer for TβRII comprises a lysine to arginine at residue 25, an arginine to lysine at residue 26, a leucine to valine at residue 89, an isoleucine to valine at residue 92, an asparagine to arginine at residue 94, a threonine to lysine at residue 95, an isoleucine to valine at residue 98; or any combination of two or more thereof.",
        "8. The recombinant human TGF-β2 monomer of claim 7, comprising a lysine to arginine at residue 25, an arginine to lysine at residue 26, a leucine to valine at residue 89, an isoleucine to valine at residue 92, an asparagine to arginine at residue 94, a threonine to lysine at residue 95, and an isoleucine to valine at residue 98.",
        "9. The recombinant human TGF-β2 monomer of claim 3, comprising the amino acid sequence of SEQ ID NO: 8 or SEQ ID NO: 10.",
        "10. (canceled)",
        "11. The recombinant human TGF-β1 monomer of claim 3, wherein the at least one amino acid substitution that increases net charge of the monomer comprises:\nan isoleucine to arginine substitution at an amino acid residue corresponding to residue 51 of SEQ ID NO: 1;\nan alanine to lysine substitution at an amino acid residue corresponding to residue 74 of SEQ ID NO: 1;\nan alanine to serine substitution at an amino acid residue corresponding to residue 75 of SEQ ID NO: 1; or\nan isoleucine to arginine substitution at an amino acid residue corresponding to residue 51, an alanine to lysine substitution at an amino acid residue corresponding to residue 74 and an alanine to serine substitution at an amino acid residue corresponding to residue 75 of SEQ ID NO: 1.",
        "12. The recombinant human TGF-β1 monomer of claim 11, comprising the amino acid sequence of SEQ ID NO: 7.",
        "13. (canceled)",
        "14. The recombinant human TGF-β3 monomer of claim 3, wherein the at least one amino acid substitution that increases net charge of the monomer comprises:\na leucine to glutamate substitution at an amino acid residue corresponding to residue 51 of SEQ ID NO: 3;\nan alanine to glutamate substitution at an amino acid residue corresponding to residue 72 of SEQ ID NO: 3;\nan alanine to aspartate substitution at an amino acid residue corresponding to residue 74 of SEQ ID NO: 3; or\na leucine to glutamate substitution at an amino acid residue corresponding to residue 51, an alanine to glutamate substitution at an amino acid residue corresponding to residue 72 and an alanine to aspartate substitution at an amino acid residue corresponding to residue 74 of SEQ ID NO: 3.",
        "15. The recombinant human TGF-β3 monomer of claim 14, comprising the amino acid sequence of SEQ ID NO: 9.",
        "16. The recombinant TGF-β monomer of claim 1, which is PEGylated, glycosylated or hyper-glycosylated.",
        "17. (canceled)",
        "18. A fusion protein comprising the recombinant TGF-β monomer of claim 1 and a heterologous protein.",
        "19. The fusion protein of claim 18, wherein the heterologous protein comprises a protein tag, a Fc domain albumin, an albumin binding polypeptide, an antibody, antigen binding fragment of an antibody, or a targeting moiety.",
        "20-26. (canceled)",
        "27. The recombinant TGF-β monomer of claim 1, comprising a radiotherapy agent, a cytotoxic agent for chemotherapy, a drug, an imaging agent, a fluorescent dye, or a fluorescent protein tag.",
        "28. (canceled)",
        "29. A composition comprising the recombinant TGF-β monomer of claim 1, and a pharmaceutically acceptable carrier, diluent, or excipient.",
        "30. A method of inhibiting TGF-β signaling in a cell, comprising contacting the cell with the recombinant TGF-β monomer of claim 1.",
        "31-32. (canceled)",
        "33. A method of treating a disease or disorder associated with aberrant TGF-β signaling in a subject, comprising administering to the subject the recombinant TGF-β monomer claim 1.",
        "34. The method of claim 33, wherein the disease or disorder associated with aberrant TGF-β signaling is a fibrotic disorder, breast cancer, brain cancer, pancreatic cancer, prostate cancer, skin cancer, colorectal cancer, ovarian cancer, liver cancer, gastric cancer, bladder cancer, an ocular disease, or a genetic disorder of connective tissue.",
        "35-37. (canceled)",
        "38. An isolated nucleic acid molecule encoding the recombinant TGF-β monomer of claim 1.",
        "39. (canceled)",
        "40. A vector comprising the nucleic acid molecule of claim 38.",
        "41. An isolated cell comprising the vector of claim 40.",
        "42. (canceled)",
        "43. A method of treating a disease or disorder associated with aberrant TGF-β signaling in a subject, comprising administering to the subject the isolated cell of claim 41.",
        "44. The method of claim 43, wherein the disease or disorder associated with aberrant TGF-β signaling is a fibrotic disorder, breast cancer, brain cancer pancreatic cancer, prostate cancer, colorectal cancer, ovarian cancer, liver cancer, gastric cancer, bladder cancer, skin cancer, an ocular disease, or a genetic disorder of connective tissue.",
        "45-47. (canceled)"
    ]
}