{
    "id": "US20190379488",
    "authors": [
        "Ali Fatih Demir",
        "Huseyin Arslan"
    ],
    "title": "ADAPTIVE GUARDS FOR MIXED NUMEROLOGY SYSTEMS AND ASSOCIATED METHOD OF USE",
    "date": "2019-08-26 00:00:00",
    "abstract": "A system and method for reducing the OFDM out-of-band emissions (OOBE) and Inter-Numerology Interference (INI) in a mixed-numerology OFDM-based system by utilizing a transmitter windowing operation that smooths the inherent rectangular pulse shape of the OFDM signals. The technique retains the main design of the OFDM receivers and provides backward compatibility for the existing OFDM-based systems. The guard band and the multi-window parameters that control the guard duration are jointly optimized regarding the numerology, the use case and the power offset between the users. To fully exploit and further increase the potential of adaptive guards, an interference-based scheduling algorithm is proposed as well.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "The next generation wireless communication technologies are envisioned to support a diverse service variety under the same network. As a recent example, the International Telecommunications Union (ITU) has defined the main use cases that are going to be supported in the fifth generation (5G) mobile network as enhanced mobile broadband (eMBB), massive machine type communications (mMTC), and ultrareliable low-latency communications (URLLC) as shown in FIG. 1. The applications which demand high data rate and better spectral efficiency fall into the eMBB category, whereas the ones which require ultra-high connection density and low power consumption fall into the mMTC category. Commonly, the industrial sensors and medical implants should operate for many years without a maintenance need, and accordingly, high energy efficiency and low device complexity are important for these mMTC services. Moreover, the mission-critical applications such as remote surgery or self-driving vehicles are categorized in URLLC. A flexible air interface is needed to meet these demanding service requirements under various channel conditions and system scenarios. Hence, the waveform, which is the main component of any air interface, must be designed precisely to facilitate such flexibility.",
                        "Orthogonal frequency-division multiplexing (OFDM) is the most popular waveform that is currently being used in various standards such as 4G LTE and the IEEE 802.11 family. OFDM provides several tempting features such as efficient hardware implementation, low-complexity equalization, and easy multiple-input-multiple-output (MIMO) integration. On the other hand, OFDM seriously suffers from its high out-of-band emissions (OOBE), peak-to-average power ratio (PAPR), and strict synchronization requirement. In addition, 4G LTE adopted a uniform OFDM parameter configuration in pursuit of orthogonality and cannot serve different needs efficiently. Although numerous waveforms have been proposed considering all these disadvantages for the upcoming 5G standard, OFDM remains as the waveform of the new radio with a flexible waveform parametrization (a.k.a. numerology). The flexibility parameters include but are not limited to CP rate, subcarrier spacing, and window/filter parameters.",
                        "The channel conditions, use cases, and system scenarios are the most critical considerations for the numerology design. For instance, a time-localized pulse shape is preferable for time-dispersive channels (i.e., high delay spread scenario), while a frequency-localized pulse shape is more suitable for frequency-dispersive channels (i.e., high Doppler spread scenario). Particularly, the frequency domain localization is crucial for asynchronous transmissions across adjacent sub-bands. Another degree of freedom, the subcarrier spacing in OFDM systems, should be kept large to handle the Doppler spread in a highly mobile environment. On the other hand, a smaller subcarrier spacing provides a longer symbol duration and decreases the relative redundancy that is allocated for time dispersion. The reduced redundancy is especially important for the eMBB services. Furthermore, reliability and latency are vital for mission-critical communications where errors and retransmissions are less tolerable. Thus, a strict frequency localization and a short symbol duration (i.e., large subcarrier spacing) are more practical for the URLLC applications. Also, mMTC operates at a low power level to save energy and might seriously suffer from interference in an asynchronous heterogeneous network. Therefore, a more localized pulse shape in the frequency domain is more suitable in this case.",
                        "An efficient numerology design ensures better utilization of spectral resources and will be one of the core technologies to embrace diverse requirements in the new radio. However, managing the coexistence of multiple numerologies in the same network is challenging. Although OFDM numerologies are orthogonal in the time domain, any mismatch in parametrization, such as subcarrier spacing, leads to inter-numerology interference (INI) in the frequency domain. Typically, the interference level is managed by various windowing/filtering approaches along with the guard allocation. The windowing/filtering operations reduce the OOBE, but they need an extra period which extends the guard duration between the consecutive OFDM symbols. Also, additional guard bands are still required between adjacent channels to deal with the INI. In other words, better interference mitigation is realized with the cost of reduced spectral efficiency. Accordingly, the future communication systems have to optimize the guards in both time and frequency domains to improve the spectral efficiency.",
                        "Accordingly, what is needed in the art is an improved system and method for reducing inter-numerology interference (INI) in an OFDM-based communication system employing mixed numerology."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce 5G mobile network",
                        "describe eMBB, mMTC, and URLLC",
                        "motivate flexible air interface",
                        "describe limitations of OFDM",
                        "introduce flexible waveform parametrization",
                        "discuss channel conditions and use cases",
                        "describe importance of numerology design",
                        "discuss inter-numerology interference (INI)",
                        "motivate need for improved system and method"
                    ],
                    "num_characters": 4922,
                    "outline_medium": [
                        "introduce 5G mobile network use cases",
                        "describe limitations of OFDM",
                        "motivate flexible waveform design",
                        "highlight importance of numerology design"
                    ],
                    "outline_short": [
                        "introduce 5G wireless communication technologies",
                        "motivate limitations of OFDM waveform"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [
                        "In various embodiments, the present invention provides a system and method utilizing adaptive guards along with a multi-window operation to solve the INI issue that exists in mixed-numerology based OFDM-based communication systems.",
                        "This present invention also improves the spectral efficiency of a communication system which supports a variety of services operating asynchronously under the same network.",
                        "In one embodiment, the present invention provides a method for improved OFDM signal transmission in a multi-user OFDM communication system. The method includes, identifying a numerology of a plurality of users, identifying a power offset (PO) between a plurality of users operating in adjacent bands of an OFDM-based communication system, identifying a required signal-to-interference ratio (SIR) for the plurality of users. The method further includes, optimizing a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the identified numerology for each of the plurality of users. The method further includes optimizing a guard duration for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the identified numerology for each of the plurality of users and further generating an OFDM signal based using the optimized guard bands and optimized guard duration for each of the plurality of users.",
                        "In a particular embodiment, the method further includes utilizing a multi-window approach in an asymmetric interference scenario to manage each side of the spectrum independently, thereby further decreasing the require guards in time and frequency domains.",
                        "The method may further include, performing interference-based scheduling for each of the plurality of users prior to generating the OFDM signal, wherein performing interference-based scheduling for each of the plurality of users may further include grouping users with similar received power levels, similar signal-to-interference ratios (SR) and similar numerologies adjacent to each other.",
                        "In an additional embodiment, the present invention provides an apparatus comprising one or more integrated circuit devices which may be configured to receive a data symbol vector comprising data mapped to a subcarrier associated with one of a plurality of users operating in adjacent bands of an OFDM-based communication system. The integrated circuit devices may further be configured to identify a numerology of the plurality of users, to identify a power offset (PO) between the plurality of users operating in adjacent bands of the OFDM-based communication system, to identify a required signal-to-interference ratio (SIR) for the plurality of users. The integrated circuit devices may further be configured to optimize a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the identified numerology for each of the plurality of users, to optimize a guard duration for each of the plurality of users based upon the identified power offset the identified required signal-to-interference ratio (SIR) for each of the plurality of users and to generate an OFDM signal based using the optimized guard bands and optimized guard duration for each of the plurality of users.",
                        "The one or more integrated circuit devices of the apparatus may further be configured to perform interference-based scheduling for each of the plurality of users prior to generating the OFDM signal.",
                        "In another embodiment, the present invention provides a non-transitory computer readable storage medium having computer program instructions stored thereon that, when executed by one or more processors, cause the one or more processors to perform a method of generating an orthogonal frequency division multiplexing (OFDM) symbol for transmission in a communication channel using adaptive guard bands and adaptive guard durations. The method performed may include, receiving a data symbol vector comprising data of a plurality of users operating in adjacent bands of an OFDM-based communication system, identifying a numerology of the plurality of users, identifying a power offset (PO) between the plurality of users operating in the adjacent bands of the OFDM-based communication system, identifying a required signal-to-interference ratio (SIR) for each of the plurality of users, optimizing a guard band for each of the plurality of users based upon the identified power offset the identified required signal-to-interference ratio (SIR) for each of the plurality of users, optimizing a guard duration for each of the plurality of users based upon the identified numerology, identified power offset and the identified required signal-to-interference ratio (SIR) for each of the plurality of users and generating a first OFDM signal based using the optimized guard bands and optimized guard duration for each of the plurality of users.",
                        "The method implemented by the non-transitory computer readable storage medium may further include, grouping users with similar numerologies, similar received power levels and similar signal-to-interference ratios (SR) adjacent to each other to improve the spectral efficiency of the transmission.",
                        "Accordingly, the present invention provides an improved system and method for reducing the out-of-band emissions (OOBE) of the subcarriers (users) in a mixed-numerology OFDM-based communication system utilizing adaptive guard bands and guard duration, and interference-based scheduling.",
                        "In various embodiments, the present invention illustrates the significance of adaptive guards considering a windowed-OFDM system which supports a variety of services operating asynchronously under the same network. The windowing approach of the present invention requires a guard duration to suppress the out-of-band emissions (OOBE), and a guard band is required to handle the adjacent channel interference (ACI), along with the windowing. The guards in both time and frequency domains are optimized with respect to the use case and power offset between the users. To fully exploit and further increase the potential of adaptive guards, an interference-based scheduling algorithm is proposed as well.",
                        "The results show that the precise design that facilitates such flexibility reduce the guards significantly and boost the spectral efficiency."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce system and method for reducing INI",
                        "describe adaptive guards and multi-window operation",
                        "summarize method for improved OFDM signal transmission",
                        "identify numerology of users",
                        "identify power offset and required SIR",
                        "optimize guard band and duration",
                        "generate OFDM signal",
                        "describe multi-window approach",
                        "perform interference-based scheduling",
                        "describe apparatus with integrated circuit devices",
                        "describe non-transitory computer readable storage medium",
                        "summarize benefits of present invention"
                    ],
                    "num_characters": 6471,
                    "outline_medium": [
                        "introduce adaptive guard bands solution",
                        "describe method for improved OFDM signal transmission",
                        "optimize guard band and duration",
                        "utilize multi-window approach",
                        "perform interference-based scheduling",
                        "describe apparatus and computer readable storage medium"
                    ],
                    "outline_short": [
                        "introduce adaptive guards for INI reduction",
                        "summarize method for OFDM signal transmission",
                        "describe apparatus and computer readable storage medium"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "In various embodiments, the present invention addresses the significance of adaptive guards considering an OFDM-based system which supports a variety of numerologies operating asynchronously under the same network.",
                        "In the present invention, the OOBE is reduced with a transmitter windowing operation that smooths the inherent rectangular pulse shape of OFDM. The windowing approach preserves the essential structure of the OFDM receivers and provides backward compatibility for the current OFDM-based systems. The guard band and the window parameters that handle the guard band duration are optimized jointly regarding the subcarrier spacing, use case, and power offset between the numerologies. Also, the multi-window technique provides managing each side of the spectrum independently in the case of an asymmetric interference scenario. Since the allowed interference level depends upon the numerologies operating in the adjacent bands, the potential of adaptive guards is further increased and exploited with an interference-based scheduling algorithm. The propose approach allocates the numerologies to the available bands considering the INI and decreases the need for guards.",
                        "Although various windowing approaches have previously been proposed to provide better spectral concentration, the present invention improves the art by additionally: (1) identifying key parameters for guard allocation considering a mixed numerology system, (2) jointly optimizing guards in both time and frequency domains with respect to the subcarrier spacing, use case and power offset between the numerologies and (3) providing an interference based scheduling algorithm to decrease the need for guards.",
                        "Consider a multiuser pulse-shaped OFDM system where asynchronous numerologies operate in the same network. Each numerology can serve multiple synchronous user equipments (UEs). The numerologies, which have different subcarrier spacing, power level, and use case (i.e. service requirements), perform a transmitter windowing operation to reduce their OOBE level and manage interference to the numerologies operating in adjacent bands. The guard duration that is allocated for the time-dispersive channel (i.e., TCP-Ch) is fixed, and it is adequate to deal with the inter-symbol interference (ISI). Also, an extra guard duration is needed for windowing operation. Various windowing functions have been compared thoroughly in previous works, with different trade-offs between the main lobe width and the side lobe suppression. The optimal windowing function is outside the scope of the invention, and a raised-cosine (RC) window is utilized due to its low computational complexity and widespread use in the literature. The RC window function is formulated by the following equation:",
                        "\\(\\begin{matrix}\n{{g\\lbrack n\\rbrack} = \\left\\{ \\begin{matrix}\n{\\frac{1}{2} + {\\frac{1}{2}{\\cos \\left( {\\pi + \\frac{\\pi \\; n}{\\alpha \\; N_{T}}} \\right)}}} & {0 \\leq n \\leq {\\alpha \\; N_{T}}} \\\\\n1 & {{\\alpha \\; N_{T}} \\leq n \\leq N_{T}} \\\\\n{\\frac{1}{2} + {\\frac{1}{2}{\\cos \\left( {\\pi - \\frac{\\pi \\; n}{\\alpha \\; N_{T}}} \\right)}}} & {N_{T} \\leq n \\leq {\\left( {\\alpha + 1} \\right)N_{T}}}\n\\end{matrix} \\right.} & (1)\n\\end{matrix}\\)",
                        "Where α is the roll-off factor (0≤α≤1) and NT denote the symbol length. The roll-off factor (α) handles the taper duration of the RC window function. As α increases, the OOBE decreases with the cost of increased redundancy. The transmitter windowing operation is shown in FIG. 2. Initially, the cyclic prefix (CP) 200 that is designated to handle ISI (Inter Symbol Interference) is extended on both edges of the OFDM symbol 205, and afterwards, the extended part from the beginning of the symbol 210 is added to the end. The transition parts (i.e., ramp-ups and ramp-downs) of adjacent symbols are overlapped 215 to reduce the time-domain overhead emerging from the windowing operation.",
                        "However, the windowing operation is not enough to manage the inter-numerology interference (INI), and non-negligible guard bands are still required. However, the total amount of guard band (GB) or the length of guard duration (GD) which is needed for the windowing operation depends on the subcarrier spacing of the interference source, the required signal to interference ratio (SIR) level of the numerology in its adjacent bands, and the power offset (PO) between them.",
                        "In a particular embodiment, the adaptive guard concept of the present invention is represented with two numerologies, NUM-A 300 and NUM-B 305, as shown in FIG. 3, and can be generalized to multiple numerologies by considering one pair of numerologies at a time. The threshold for allowed interference level 320 on the adjacent band is represented by θ and it is expressed as follows:",
                        "θΔf,i=Pi−Pj+Sj  (2)",
                        "Where Pi represents the in-band power of the interference source, so, Pi−Pj represents the power offset 310 between the bands, Sj denotes the required SIR 315 in the adjacent band. OBW 330 is the occupied bandwidth of NUM-A 300 and ΔfA 335 and ΔfB 340 indicates the subcarrier spacing of the user NUM-A 300 and the interference source NUM-B 305, respectively. The guards in both the time and frequency domains are utilized regarding θΔf to achieve the desired SIR level of the numerology on the adjacent band. Throughout the numerical evaluations in this study GD (i.e. TCP-Win) and GB 325 are adaptive, and these guards are optimized, as will be described in additional detail below. Also, a multi-window operation is performed in the case of an asymmetric interference scenario, and each side of the spectrum is managed independently, as shown in FIG. 4A and FIG. 4B.",
                        "FIG. 4A illustrates an asymmetric interference scenario (θA 450, θB 455) in a mixed-numerology network. In the present invention, a left window function is utilized to optimize the guard for θA 450 and a right window function is utilized to optimize the guard for θB 455.",
                        "FIG. 4B is a block diagram illustrating the multi-window operation, in accordance with an embodiment of the present invention. As shown, an apparatus 400 comprising circuitry for performing the adaptive guard allocation in accordance with the present invention in a non-symmetrical, mixed-numerology system may include circuitry for performing a first Inverse Fast Fourier Transform (IFFT) 410 and a second IFFT 412 upon receiving a received data symbol vector 405. Additional circuitry 415 may be provided for adding a cyclic prefix and postfix to the time domain signal from the first IFFT 410 and circuitry 416 may be provided for adding a cyclic prefix and postfix to the time domain signal from the second IFFT 412. Additional circuitry 420 may be provided for performing parallel to serial (P/S) conversion of the signal 420 and for applying a left window function 425 to generate a guard band and guard duration that is optimized based upon the allowed interference θA 450 of the left side of the spectrum of the user. Additional circuitry 422 may also be provided for performing parallel to serial (P/S) conversion of the signal 422 and for applying a right window function 427 to generate a guard band and guard duration that is optimized based upon the allowed interference θB 455 of the left side of the spectrum of the user. The apparatus 400 may further include circuitry for combining the subcarriers 430 to generate the OFDM symbol 435. In one embodiment, the system of the present invention may be implemented in an OFDM transmitter.",
                        "The remaining parameters of the windowed-OFDM (W-OFDM) system are listed in Table I.",
                        "The potential of adaptive guards is increased further through the utilization of an interference-based scheduling algorithm. Considering frequency domain multiplex M asynchronous numerologies, as shown in FIG. 5, different channel conditions, use cases, and system scenarios result in a change in subcarrier spacing, power level and SIR requirements of the numerologies, as previously described. The power level and SIR requirement of each numerology are generated randomly in such a way that 0 changes from 0 dB to 60 dB. Also, Δf gets discrete values of {15, 30} kHz and {60, 120} kHz with an equal probability in the frequency range-1 (FR1, a.k.a. sub-6 GHz bands) and frequency range-2 (FR2, a.k.a. millimeter-wave bands), respectively. Assuming that the base station obtains all this necessary information perfectly, it allocates the numerologies to the available sub-bands (out of M! possible arrangements) considering the INI.",
                        "Assuming that the data at each subcarrier are statistically independent and mutually orthogonal, the power spectral density (PSD) of an OFDM signal is obtained by summing the power spectra of individual subcarriers, and it is expressed by the following equation:",
                        "\\(\\begin{matrix}\n{{P_{f}(x)} = {\\frac{\\sigma_{d}^{2}}{T}{\\sum_{k}{{G\\left\\lbrack {\\left( {f - {k\\; \\Delta \\; f}} \\right)T} \\right\\rbrack}}^{2}}}} & (3)\n\\end{matrix}\\)",
                        "Where σd2 represents the variance of the data symbols, T denotes the symbol duration, k stands for the number of subcarriers, Δf shows the subcarrier spacing and G is the frequency domain representation of pulse shaping window. An OFDM signal is well localized in the time domain with a rectangular pulse shape, which is equivalent to a sinc shape in the frequency domain. The sidelobes of the sincs result in serious OOBE issues, and they should be reduced to prevent interference. Particularly, the frequency domain localization is crucial for asynchronous transmissions across adjacent sub-bands and peaceful coexistence with other numerologies in the OFDM communication network. The sidelobes of the RC function are controlled with the parameter a as shown in the following relationship:",
                        "\\(\\begin{matrix}\n{G = {{\\frac{\\sin \\left( {\\pi \\; {fT}} \\right)}{\\pi \\; {fT}}\\frac{\\cos \\left( {\\pi \\; \\alpha \\; {FT}} \\right)}{1 - \\left( {2\\alpha \\; {fT}} \\right)^{2}}0} \\leq \\alpha \\leq 1}} & (4)\n\\end{matrix}\\)",
                        "Eq. 3 and Eq. 4 show that the parameters T (i.e., Δf=1/T) and α have an important effect on the PSD (Power Spectral Density) of W-OFDM. FIG. 6A and FIG. 6B illustrate the effect of these parameters on the PSD, separately. The effect of Δf on the FSD of the W-OFDM symbol is shown in FIG. 6A and the effect of α (Δf is fixed at 15 kHz) is shown in FIG. 6B.",
                        "In a mixed numerology network, the INI can be managed by windowing operations and by allocating guard band between adjacent numerologies as previously described. Since the windowing operation reduces the OOBE with a cost of extra guard duration, the INI management procedure boils down to the adaptive utilization of guard duration (GD) and guard band (GB) to achieve a desired interference threshold (θ). FIG. 7 demonstrates the required GB and GD amounts for selected θ values considering a W-OFDM signal with Δf=15 kHz. Each a value in the figure represents a GD allocation to carry out the windowing operation and a GB allocation to handle the rest of the interference for a given θ.",
                        "A tremendous time-frequency resource is required to deal with the INI issue only with GB or GD allocation. Hence, GB and GD have to be jointly optimized in order to improve the spectral efficiency, which is measured as the information rate that can be transmitted over a give bandwidth. This hyper-parameter optimization has been carried out by a grid search method through a manually designated subset of the hyper-parameter space. The spectral efficiency (η) is proportional to the multiplication of efficiencies in the time and frequency domains, which are calculated as follows:",
                        "\\(\\begin{matrix}\n{\\eta_{time} = \\frac{T_{OFDM}}{T_{OFDM} + T_{{CP} - {Ch}} + T_{{CP} - {Win}}}} & (5) \\\\\n{\\eta_{freq} = \\frac{O\\; B\\; W}{{O\\; B\\; W} + \\left( {{GB} \\times 2} \\right)}} & (6)\n\\end{matrix}\\)",
                        "Considering TOFDM, TCP-Ch, and occupied bandwidth (OBW) are fixed parameters for a given Δf, the degrees of freedom that can be selected independently becomes only GB and GC (i.e., TCP-Win). The optimization problem that looks for the optimal GB and GD pair can be defined as follows:",
                        "\\(\\begin{matrix}\n{{\\left( {{GB},{GD}} \\right) = {\\underset{{GB},{GD}}{\\arg \\; \\max}\\left( {\\eta_{time} \\times \\eta_{freq}} \\right)}},} & (7) \\\\\n{{{{Subject}\\mspace{14mu} {to}\\text{:}\\mspace{14mu} P_{i}} - P_{j} + S_{j}} \\leq {\\theta_{{\\Delta \\; f},i}.}} & (8)\n\\end{matrix}\\)",
                        "The spectral efficiencies for selected θ values are shown in FIG. 8. Each α value in the figure is equivalent to a GB-GD pair for a given θ, and the peak value of each curve determines the optimal pair. These optimal pairs are summarized in Table II, along with the related parameters for various Δf. The results reveal that the need for windowing diminishes as θ decreases, and accordingly, the desired interference level can be accomplished with only a few guard carriers. Also, the spectral efficiency increases with the decrease in θ. The change in required guards clearly confirms that the adaptive guard design enhances the spectral efficiency significantly compared to designing the mixed numerology system considering the worst case scenario (e.g., ηθ=45 dB=85.98% whereas ηθ=20 dB=92.53%).",
                        "As shown above, the total guard amount is reduced with the joint optimization of guard band (GB) and guard duration (GD) for a given interference threshold θΔf. The optimization results show that the spectral efficiency (η) decreases as θ increases. For example, the numerologies with larger subcarrier spacing (Δf) require more guards, and they lead to lower η values in a mixed numerology network. Since θ depends on the numerologies operating in the adjacent bands, the potential of adaptive guards can be enhanced further along with the utilization of an interference-based scheduling algorithm.",
                        "The proposed scheduling methodology of the present invention groups the numerologies and allocates them to the available sub-bands considering the inter-numerology interference (INI). Therefore, the need for guards in the available spectrum is reduced significantly. The steps of the proposed scheduling method include: (1) Sort the numerologies regarding their subcarrier spacing (Δf) value in an ascending/descending order, (2) Calculate the similarity metric for all numerologies as βj=SIRj−Pj, (3) Sort β in an ascending/descending order for the numerologies with the same subcarrier spacing (Δf), (4) If β value repeats, sort based on power in the adjacent band, and (5) Check P on both side of the available band. If P is the same as the numerology in its adjacent band, allocate the numerology with the higher SIR requirement to the edge.",
                        "When the numerologies with similar subcarrier spacing, power level, and SIR requirements are arranged together, the mean θ in the network decreases. Consequently, the need for guards is reduced and the spectral efficiency improves.",
                        "Consider an example scenario with eight numerologies, where the numerologies have various subcarrier spacing, power level and SIR requirements, as listed in Tables III and IV.",
                        "In this exemplary embodiment, the numerologies are allocated to the bands with two distinct approaches. In the first method, a random scheduling strategy is implemented (as shown in FIG. 4), whereas the interference based scheduling strategy of the present invention implemented in the second method, as shown in FIG. 9. As shown in FIG. 9, first the numerologies are sorted in descending order based upon their subcarrier spacing (Δf). Additionally, NUM-7 900 and NUM-4 905 are grouped together because they have a similar numerology (URLLC), NUM-1 910, NUM-5 915, NUM-2 920, NUM-3 925 and NUM-8 930 are also grouped together because they have a similar numerology (eMBB). Additionally, within the URLLC grouping, NUM-7 900 is placed before NUM-4 905 because similarity metric is larger for NUM-7 900 than for NUM-4 905. A similar process is following with the eMBB grouping to performed the interference-based scheduling in accordance with the present invention.",
                        "To compare and demonstrate the effect of the adaptive guards, a fixed guard assignment strategy is realized with the random scheduling method as well. In this embodiment, the guards are allocated assuming the worst case scenario (i.e., highest θΔf) in the fixed assignment strategy.",
                        "The numerical evaluation results for various guard assignment strategies, which include (1) the fixed guard assignment with random scheduling, (2) the adaptive guard assignment with random scheduling and (3) the adaptive guard assignment with interference-based scheduling of the present invention, are presented in Table V.",
                        "The results in Table V demonstrate that the GD and GB amounts are reduced by 43% and 34%, respectively when the fixed guards are changed with the adaptive guards in the frequency range-1 (FR1) case. Also, the GD and GB amounts are reduced further by 10% and 27%, respectively when the random scheduling strategy is replaced by the interference-based scheduling strategy of the present invention. It is worth noting that spectral efficiency (η) is lower in the frequency range-2 (FR2) case since more guards are required for the numerologies with higher Δf values. Although, it can be compensated for with an increased number of subcarriers (FR2 is suitable for wider bands), it is kept as fixed for a fair comparison with the FR1 case in the numerical evaluations.",
                        "The present invention provides a system and method for adaptive guard utilization combined with a multi-window operation that is proposed to solve the INI problem that exists in a mixed numerology communication system. In embodiments of the invention, the guards in both time and frequency domains are jointly optimized considering the numerology, use case (i.e., service requirement), and power offset between the numerologies. Moreover, the potential of adaptive guards is further increased with an interference-based scheduling algorithm. The proposed approach arranges the numerologies in such a way that the need for guards in the available spectrum decreases. The interference-based scheduling strategy is particularly important when there is a serious power imbalance between the numerologies. The current mobile networks adopted a power control mechanism to manage interference between neighboring bands. However, this solution restricts the UEs with better channel conditions to deploy higher order modulations. The proposed adaptive guard utilization may lead to relax the power control mechanism and improve the throughput.",
                        "The results show that the precise design that accommodates such flexibility reduces the guards significantly and improves the spectral efficiency of mixed numerology systems. Despite the fact that the computational complexity increases compared to traditional OFDM-based systems, the computation of the optimal GB-GD pairs is an offline action requiring a onetime calculation. Therefore, a lookup table procedure can be used to decrease complexity. Additionally, the proposed guard utilization is application to other pulse-shaped OFDM systems.",
                        "The computer readable medium described in the claims below may be a computer readable signal medium or a computer readable storage medium. A computer readable storage medium may be, for example, but not limited to, an electronic, magnetic, optical, electromagnetic, infrared, or semiconductor system, apparatus, or device, or any suitable combination of the foregoing. More specific examples (a non-exhaustive list) of the computer readable storage medium would include the following: an electrical connection having one or more wires, a portable computer diskette, a hard disk, a random access memory (RAM), a read-only memory (ROM), an erasable programmable read-only memory (EPROM or Flash memory), an optical fiber, a portable compact disc read-only memory (CD-ROM), an optical storage device, a magnetic storage device, or any suitable combination of the foregoing. In the context of this document, a computer readable storage medium may be any non-transitory, tangible medium that can contain, or store a program for use by or in connection with an instruction execution system, apparatus, or device.",
                        "A computer readable signal medium may include a propagated data signal with computer readable program code embodied therein, for example, in baseband or as part of a carrier wave. Such a propagated signal may take any of a variety of forms, including, but not limited to, electro-magnetic, optical, or any suitable combination thereof. A computer readable signal medium may be any computer readable medium that is not a computer readable storage medium and that can communicate, propagate, or transport a program for use by or in connection with an instruction execution system, apparatus, or device.",
                        "Program code embodied on a computer readable medium may be transmitted using any appropriate medium, including but not limited to wireless, wire-line, optical fiber cable, radio frequency, etc., or any suitable combination of the foregoing. Computer program code for carrying out operations for aspects of the present invention may be written in any combination of one or more programming languages, including an object-oriented programming language such as Java, C#, C++, Visual Basic or the like and conventional procedural programming languages, such as the “C” programming language or similar programming languages.",
                        "Aspects of the present invention are described below with reference to flowchart illustrations and/or block diagrams of methods, apparatus (systems) and computer program products according to embodiments of the invention. It will be understood that each block of the flowchart illustrations and/or block diagrams, and combinations of blocks in the flowchart illustrations and/or block diagrams, can be implemented by computer program instructions. These computer program instructions may be provided to a processor of a general-purpose computer, special purpose computer, or other programmable data processing apparatus to produce a machine, such that the instructions, which execute via the processor of the computer or other programmable data processing apparatus, create means for implementing the functions/acts specified in the flowchart and/or block diagram block or blocks.",
                        "These computer program instructions may also be stored in a computer readable medium that can direct a computer, other programmable data processing apparatus, or other devices to function in a particular manner, such that the instructions stored in the computer readable medium produce an article of manufacture including instructions which implement the function/act specified in the flowchart and/or block diagram block or blocks.",
                        "The computer program instructions may also be loaded onto a computer, other programmable data processing apparatus, or other devices to cause a series of operational steps to be performed on the computer, other programmable apparatus or other devices to produce a computer implemented process such that the instructions which execute on the computer or other programmable apparatus provide processes for implementing the functions/acts specified in the flowchart and/or block diagram block or blocks.",
                        "It should be noted that when referenced, an “end-user” is an operator of the software as opposed to a developer or author who modifies the underlying source code of the software. For security purposes, authentication means identifying the particular user while authorization defines what procedures and functions that user is permitted to execute.",
                        "It will be seen that the advantages set forth above, and those made apparent from the foregoing description, are efficiently attained and since certain changes may be made in the above construction without departing from the scope of the invention, it is intended that all matters contained in the foregoing description or shown in the accompanying drawings shall be interpreted as illustrative and not in a limiting sense.",
                        "It is also to be understood that the following claims are intended to cover all of the generic and specific features of the invention herein described, and all statements of the scope of the invention which, as a matter of language, might be said to fall therebetween. Now that the invention has been described,"
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce OFDM-based system",
                        "describe significance of adaptive guards",
                        "motivate transmitter windowing operation",
                        "describe windowing approach",
                        "define key parameters for guard allocation",
                        "jointly optimize guards in time and frequency domains",
                        "provide interference-based scheduling algorithm",
                        "describe multiuser pulse-shaped OFDM system",
                        "define numerologies and user equipments (UEs)",
                        "describe transmitter windowing operation",
                        "formulate RC window function",
                        "describe roll-off factor (α)",
                        "illustrate transmitter windowing operation",
                        "describe need for guard bands",
                        "define threshold for allowed interference level (θ)",
                        "describe adaptive guard concept",
                        "illustrate asymmetric interference scenario",
                        "describe multi-window operation",
                        "illustrate block diagram of apparatus",
                        "describe parallel to serial (P/S) conversion",
                        "apply left and right window functions",
                        "combine subcarriers to generate OFDM symbol",
                        "list remaining parameters of W-OFDM system",
                        "describe interference-based scheduling algorithm",
                        "generate power level and SIR requirements randomly",
                        "describe PSD of W-OFDM signal",
                        "illustrate effect of Δf on PSD",
                        "illustrate effect of α on PSD",
                        "describe INI management procedure",
                        "illustrate required GB and GD amounts for selected θ values",
                        "describe joint optimization of GB and GD",
                        "define spectral efficiency (η)",
                        "calculate efficiencies in time and frequency domains",
                        "define optimization problem",
                        "illustrate spectral efficiencies for selected θ values",
                        "summarize optimal GB-GD pairs",
                        "describe adaptive guard design",
                        "describe interference-based scheduling methodology",
                        "sort numerologies regarding subcarrier spacing (Δf)",
                        "calculate similarity metric (β)",
                        "sort β for numerologies with same subcarrier spacing",
                        "allocate numerology with higher SIR requirement to edge",
                        "describe example scenario with eight numerologies",
                        "implement random scheduling strategy",
                        "implement interference-based scheduling strategy",
                        "compare and demonstrate effect of adaptive guards",
                        "present numerical evaluation results",
                        "conclude adaptive guard utilization"
                    ],
                    "num_characters": 24303,
                    "outline_medium": [
                        "introduce OFDM-based system with multiple numerologies",
                        "motivate adaptive guard allocation",
                        "describe transmitter windowing operation",
                        "formulate RC window function",
                        "illustrate multi-window operation",
                        "describe apparatus for adaptive guard allocation",
                        "list parameters of W-OFDM system",
                        "describe interference-based scheduling algorithm",
                        "formulate PSD of OFDM signal",
                        "illustrate effect of Δf on PSD",
                        "illustrate effect of α on PSD",
                        "describe INI management procedure",
                        "formulate spectral efficiency",
                        "describe optimization problem for GB and GD",
                        "illustrate spectral efficiency for selected θ values",
                        "summarize optimal GB-GD pairs",
                        "describe scheduling methodology",
                        "sort numerologies by subcarrier spacing",
                        "calculate similarity metric",
                        "sort β values",
                        "allocate numerologies to available sub-bands",
                        "illustrate interference-based scheduling strategy",
                        "compare guard assignment strategies",
                        "conclude adaptive guard utilization"
                    ],
                    "outline_short": [
                        "introduce OFDM-based system with adaptive guards",
                        "motivate need for adaptive guards in mixed numerology systems",
                        "describe transmitter windowing operation for OOBE reduction",
                        "formulate RC window function for windowing operation",
                        "illustrate multi-window operation for asymmetric interference scenario",
                        "describe apparatus for performing adaptive guard allocation",
                        "derive equations for PSD of W-OFDM signal",
                        "illustrate effect of parameters on PSD",
                        "describe INI management procedure using adaptive guards",
                        "formulate optimization problem for joint GB and GD optimization",
                        "describe interference-based scheduling algorithm",
                        "summarize benefits of adaptive guard utilization and interference-based scheduling"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for improved OFDM signal transmission in a multi-user, mixed-numerology OFDM communication system, the method comprising:\nidentifying a power offset (PO) between a plurality of users operating in adjacent bands of an OFDM-based communication system;\nidentifying a required signal-to-interference ratio (SIR) for each of the plurality of users;\nidentifying a numerology associated with each of the plurality of users;\noptimizing a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users;\noptimizing a guard duration for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users; and\ngenerating an OFDM signal using the optimized guard bands and the optimized guard duration for each of the plurality of users to reduce interference caused by users operating in the adjacent bands of the OFDM-based communication system.",
        "2. The method of claim 1, wherein a first user operating in a first band adjacent to one of the plurality of users uses a first numerology and a second user operating in a second band adjacent to the user uses a second numerology, wherein the first numerology is different than the second numerology thereby resulting in asymmetric interference, the method further comprising, optimizing a first guard band and guard duration for the first band and optimizing a second guard band and guard duration for the second band to independently address the asymmetric interference.",
        "3. The method of claim 1, wherein optimizing a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the identified numerology for each of the plurality of users further comprises:\ndetermining an allowed interference level for each of the plurality of users; and\nmaximizing a spectral efficiency of the OFDM signal, wherein the spectral efficiency is maximized when the power offset (PO) of the user combined with the signal-to-interference ratio (SIR) of the user is less than the allowed interference level for the user relative to a subcarrier spacing from the identified numerology.",
        "4. The method of claim 1, wherein optimizing a guard duration for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology for each of the plurality of users further comprises:\ndetermining an allowed interference level for each of the plurality of users; and\nmaximizing a spectral efficiency of the OFDM signal, wherein the spectral efficiency is maximized when the power offset (PO) of the user combined with the signal-to-interference ratio (SIR) of the user is less than the allowed interference level for the user relative to a subcarrier spacing from the identified numerology.",
        "5. The method of claim 1, further comprising performing a windowing function for each of the plurality of users based upon the optimized guard band and the optimized guard duration.",
        "6. The method of claim 1, further comprising storing the guard band and the guard duration for each of the plurality of users in a lookup table.",
        "7. The method of claim 1, further comprising performing interference-based scheduling for each of the plurality of users prior to generating the OFDM signal.",
        "8. The method of claim 7, wherein performing interference-based scheduling for each of the plurality of users, further comprises:\ngrouping users with similar received power levels, similar signal-to-interference ratios (SIR) and similar numerologies adjacent to each other.",
        "9. The method of claim 8, wherein performing interference-based scheduling for each of the plurality of users, further comprises:\nordering the users in an ascending or descending order based upon a subcarrier spacing from their identified numerology;\ncalculating a similarity metric for each of the plurality of users, wherein the similarity metric for each user of the plurality of users is equal to a difference between the signal-to-interference ratio (SIR) of the user and the received power level of the user;\nordering the users in an ascending or descending order based upon the similarity metric for the same numerology, and in the case of matching similarity metrics, further ordering the users based upon the power level of adjacent users; and\ncomparing the received power level on both sides of the user and if the received power level on both sides of the user is the same, positioning the user with the higher signal-to-interference ratio (SIR) to a frame edge of the OFDM symbol.",
        "10. The method of claim 1, wherein the numerology of the user is selected from enhanced mobile broadband (eMBB), massive machine type communications (mMTC), and ultrareliable low-latency communications (URLLC).",
        "11. An apparatus, comprising one or more integrated circuit devices configured to:\nreceive a data symbol vector comprising data mapped to a subcarrier associated with one of a plurality of users operating in adjacent bands of an OFDM-based communication system;\nidentify a power offset (PO) between a plurality of users operating in adjacent bands of an OFDM-based communication system;\nidentify a required signal-to-interference ratio (SIR) for each of the plurality of users;\nidentify a numerology associated with each of the plurality of users;\noptimize a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users;\noptimize a guard duration for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users; and\ngenerate an OFDM signal using the optimized guard bands and the optimized guard duration for each of the plurality of users to reduce interference caused by users operating in the adjacent bands of the OFDM-based communication system.",
        "12. The apparatus of claim 11, wherein a first user operating in a first band adjacent to one of the plurality of users uses a first numerology and a second user operating in a second band adjacent to the user uses a second numerology, wherein the first numerology is different than the second numerology thereby resulting in asymmetric interference, wherein the one or more integrated circuit devices are further configured to, optimize a first guard band and guard duration for the first band and to optimize a second guard band and guard duration for the second band to independently address the asymmetric interference.",
        "13. The apparatus of claim 11, wherein the one or more integrated circuit devices are further configured to perform a windowing function for each of the plurality of users based upon the optimized guard band and the optimized guard duration.",
        "14. The apparatus of claim 11, wherein the one or more integrated circuit devices are further configured to perform interference-based scheduling for each of the plurality of users prior to generating the OFDM signal.",
        "15. The apparatus of claim 11, wherein the one or more integrated circuit devices are further configured to group users with similar received power levels, similar signal-to-interference ratios (SIR) and similar numerologies adjacent to each other.",
        "16. The apparatus of claim 11, wherein the one or more integrated circuit devices are further configured to:\norder the users in an ascending or descending order based upon a subcarrier spacing from their identified numerology;\ncalculate a similarity metric for each of the plurality of users, wherein the similarity metric for each user of the plurality of users is equal to a difference between the signal-to-interference ratio (SIR) of the user and the received power level of the user;\norder the users in an ascending or descending order based upon the similarity metric for the same numerology, and in the case of matching similarity metrics, further ordering the users based upon the power level of adjacent users; and\ncompare the received power level on both sides of the user and if the received power level on both sides of the user is the same, positioning the user with the higher signal-to-interference ratio (SIR) to a frame edge of the OFDM symbol.",
        "17. The apparatus of claim 11, wherein the numerology of the user is selected from enhanced mobile broadband (eMBB), massive machine type communications (mMTC), and ultrareliable low-latency communications (URLLC).",
        "18. A non-transitory computer readable storage medium having computer program instructions stored thereon that, when executed by one or more processors, cause the one or more processors to perform a method of generating an orthogonal frequency division multiplexing (OFDM) symbol for transmission in a communication channel using adaptive guard bands and adaptive guard durations, the method comprising:\nidentifying a power offset (PO) between a plurality of users operating in adjacent bands of an OFDM-based communication system;\nidentifying a required signal-to-interference ratio (SIR) for each of the plurality of users;\nidentifying a numerology associated with each of the plurality of users;\noptimizing a guard band for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users;\noptimizing a guard duration for each of the plurality of users based upon the identified power offset, the identified required signal-to-interference ratio (SIR) and the numerology associated with each of the plurality of users; and\ngenerating an OFDM signal using the optimized guard bands and the optimized guard duration for each of the plurality of users to reduce interference caused by users operating in the adjacent bands of the OFDM-based communication system.",
        "19. The non-transitory computer readable storage medium of claim 18, wherein the method further comprises, wherein a first user operating in a first band adjacent to one of the plurality of users uses a first numerology and a second user operating in a second band adjacent to the user uses a second numerology, wherein the first numerology is different than the second numerology thereby resulting in asymmetric interference, the method further comprising, optimizing a first guard band and guard duration for the first band and optimizing a second guard band and guard duration for the second band to independently address the asymmetric interference.",
        "20. The non-transitory computer readable storage medium of claim 18, wherein the method further comprises performing interference-based scheduling for each of the plurality of users prior to generating the OFDM signal."
    ]
}