{
    "id": "https://semopenalex.org/work/W2009434058",
    "authors": [
        "Joachim M. Buhmann",
        "Thomas Vogt",
        "Holger Moch",
        "Stefanie Meyer",
        "Volker Röth",
        "Peter J. Wild",
        "Thomas J. Fuchs",
        "Míchael Landthaler",
        "Ferdinand Hofstädter",
        "Johanna M. Brandner",
        "Ingrid Moll",
        "Kristian Ikenberg",
        "Armin Pauer",
        "Anja‐Katrin Bosserhoff",
        "Nikos Anagnostou"
    ],
    "title": "A Seven-Marker Signature and Clinical Outcome in Malignant Melanoma: A Large-Scale Tissue-Microarray Study with Two Independent Patient Cohorts",
    "date": "2012-06-07",
    "abstract": "Current staging methods such as tumor thickness, ulceration and invasion of the sentinel node are known to be prognostic parameters in patients with malignant melanoma (MM). However, predictive molecular marker profiles for risk stratification and therapy optimization are not yet available for routine clinical assessment.Using tissue microarrays, we retrospectively analyzed samples from 364 patients with primary MM. We investigated a panel of 70 immunohistochemical (IHC) antibodies for cell cycle, apoptosis, DNA mismatch repair, differentiation, proliferation, cell adhesion, signaling and metabolism. A marker selection procedure based on univariate Cox regression and multiple testing correction was employed to correlate the IHC expression data with the clinical follow-up (overall and recurrence-free survival). The model was thoroughly evaluated with two different cross validation experiments, a permutation test and a multivariate Cox regression analysis. In addition, the predictive power of the identified marker signature was validated on a second independent external test cohort (n=225). A signature of seven biomarkers (Bax, Bcl-X, PTEN, COX-2, loss of β-Catenin, loss of MTAP, and presence of CD20 positive B-lymphocytes) was found to be an independent negative predictor for overall and recurrence-free survival in patients with MM. The seven-marker signature could also predict a high risk of disease recurrence in patients with localized primary MM stage pT1-2 (tumor thickness ≤2.00 mm). In particular, three of these markers (MTAP, COX-2, Bcl-X) were shown to offer direct therapeutic implications.The seven-marker signature might serve as a prognostic tool enabling physicians to selectively triage, at the time of diagnosis, the subset of high recurrence risk stage I-II patients for adjuvant therapy. Selective treatment of those patients that are more likely to develop distant metastatic disease could potentially lower the burden of untreatable metastatic melanoma and revolutionize the therapeutic management of MM.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Cutaneous malignant melanoma (MM), represents the most common cause of death from skin cancer, and, apart from female lung cancer, it is the tumor entity with the highest increase in incidence worldwide [1]. MM is characterized by a multi-factorial etiology. Sun exposure and genetic susceptibility have been proposed as major etiological and predisposing factors and may explain the reported increase of incidence to some degree [2].",
                "De facto, the prognosis of patients with MM may only be conditionally derived from clinical and histological parameters. According to the AJCC 2009 classification [3], the findings of vertical tumor thickness [4], tumor ulceration [5], and sentinel node biopsy [6] represent the most dominant prognostic factors. In stage pT1 melanomas (≤1.00 thickness), the mitotic rate (histologically defined as mitoses/mm2) has to be considered as additional prognostic parameter [3].",
                "In MM, multiple cellular factors are known to be deregulated in the initiation and progression phase of the tumor; among these are protein regulators of the cell cycle, apoptosis, signal transduction, cell adhesion and matrix digestion. A plethora of single biomarkers have been evaluated for outcome prediction in melanoma patients; e.g. Weinlich and coworkers identified metallothionein expression as an independent negative marker of melanoma progression in thin primary tumours [7]. Despite the fact that hundreds of such studies sought to assess the potential prognostic value of molecular markers in predicting the course of cutaneous MM, there are only two prognostic models with potential for translation into the clinic. Gould-Rothberg et al. [8] published a genetic-algorithm based five-marker solution, and Kashani-Sabet et al. [9] reported a three-marker model. However, no predictive molecular profiles for therapy optimization applicable for routine clinical assessment of MM are available, according to the latest review meta-analyses [10], [11].",
                "To this end, we examined the immunohistochemical (IHC) expression of 70 candidate biomarkers of MM including regulating proteins of the cell cycle and apoptosis control, factors of signal-transduction, cell adhesion, transcription-factors, differentiation, and melanoma-specific antigens using tissue microarrays (TMAs). The study was based on extensive follow-up investigation of a total of 589 patients with primary MM from two independent cohorts, and was initiated to identify a clear set of reliable IHC markers for routine clinical assessment of patients with primary MM. Accordingly, this biomarker study aimed at identifying an independent prediction model for clinical outcome in patients with MM."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Ethics Statement",
                    "paragraphs": [
                        "The study for both cohorts was approved by the local scientific ethics committees (approval no.: 07/093 for Regensburg and MC-028/08 for Hamburg)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tissue Microarrays (Tmas)",
                    "paragraphs": [
                        "TMAs were constructed as described previously [12] and based on primary melanoma material, collected between 1994 and 2006. TMA 1, the primary cohort, contained single tissue punch samples from 364 consecutive (non-selected), formalin-fixed, paraffin-embedded MMs of 364 different patients and were from the Department of Dermatology, University Hospital of Regensburg, Germany. TMA 2, the secondary cohort (independent external validation cohort), consisted of consecutive (non-selected) MM samples from 235 patients of the Department of Dermatology, University Hospital Hamburg-Eppendorf, Germany. TMA 2 contained two tissue cores per melanoma specimen. For patients with multiple subsequent neoplasms, only initial and single primary MMs were included. H&E-stained slides of all MMs were evaluated by two histopathologists (TV, PJW). The clinicopathological characteristics of the two independent cohorts of melanoma patients are given in Table S1. Clinical follow-up data, provided by the local tumor registries, were available for all patients of the primary cohort (n = 364) and 231 patients of the secondary cohort. Patients were censored at 120 months, if their follow-up exceeded the 10-year scope of the study. The retrospective study implemented the REMARK guidelines [13]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Selection Of Candidate Biomarkers",
                    "paragraphs": [
                        "The primary antibodies used in this study were selected for reporting on key aspects of apoptosis, cell cycle, signal transduction, cell adhesion, differentiation and proliferation, and tumor metabolism (Table S2). The candidate markers were chosen because of their described role in MM in the literature [10], [11], [14] or on the basis of previous studies by our group [12], [15]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunohistochemical Analysis",
                    "paragraphs": [
                        "Paraffin-embedded preparations of melanoma tissues were screened for protein expression according to standardized IHC protocols as described previously [12], [15]. Immunohistochemical stainings were performed for 70 different primary antibodies (source and concentrations are listed in Table S2). Negative controls were obtained by omitting the primary antibody. Specificity of commercial antibodies of the seven-marker signature has been thoroughly tested by immunoblotting (Figures S1), immunohistochemical analysis of melanocytes and melanoma cell lines using a cell pellet microarray (Figure S2), and immunostaining of whole melanoma sections (Figures S3A–D). Nocito et al. [16] have already shown that intra-tumour heterogeneity does not significantly affect the ability to detect clinico-pathological correlations on tissue microarrays (TMAs), probably because of the large number of tumors that can be included in TMA studies. Figures S3A–D show whole tissue sections of primary malignant melanomas stained for our seven-marker signature. Only Bax and MTAP immunoreactivity was patchy in some cases (Figure S3A) but homogeneous in most of the remaining ones (S3B–D).",
                        "Two dermatohistopathologists (SM, ML) performed a blinded evaluation of the stained slides. In case of discordant scoring results a consensus score was assigned. Cytoplasmic and nuclear immunoreactivity were evaluated using a stepwise scoring system (0 to 4+): 0 (negative): no cytoplasmic staining or 0% of cell nuclei stained; 1+: weak cytoplasmic staining or less than 20% of cell nuclei stained; 2+: moderate cytoplasmic staining or 21 to 50% of cell nuclei stained; 3+: strong cytoplasmic staining or 51 to 90% of cell nuclei stained; 4+: very strong cytoplasmic staining or nuclear staining greater than 90%. This semiquantitative scoring system was consistently used for all 70 markers analyzed. TMA spots with a lack of tumor tissue or presence of necrosis or crush artifact were excluded from the analysis. For the validation cohort (TMA 2), a single score was assigned, taking the strongest immunoreactivity of the two spots into account."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "P-values lower than 0.05 were considered to indicate statistical significance. Statistical analyses were conducted using R version 2.11. A biomarker signature for prognosis of patients with melanoma was developed and validated in three major steps:"
                    ],
                    "subsections": [
                        {
                            "title": "A) Model Discovery",
                            "paragraphs": [
                                "First, the prognostic value for each of the of the 70 markers that met all quality-control steps was assayed by univariate Cox proportional hazards regarding overall survival, and those markers reaching significance at p = 0.05 with a false-discovery rate of 0.15 were included in subsequent model building. A risk score was calculated for each patient by a linear combination of the univariate Cox regression coefficients and the corresponding IHC measurements  where D is the number of markers in the signature. Single can be not available due to missing TMA spots. Finally, the score is normalized by the number of markers measured:",
                                "Based on this risk score, patients were assigned to a high risk group and a low risk group, split at the 50th percentile (median) of all scores. Thus, the final model consists of the coefficient vector β and the median threshold θ. Nonparametric Kaplan-Meier estimators [17] were used to analyze overall survival and recurrence-free survival. Differences between survival estimates were assessed with the log-rank test (LRT) [18]. Finally, a multivariable Cox regression model was adjusted, testing the independent prognostic relevance of our risk score. Besides the proposed biomarker signature, age, gender, tumor thickness, Clark level, and nodal status were included in the Cox model as covariates."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "B) Internal Model Validation",
                            "paragraphs": [
                                "The validity of the learning procedure and hence the accuracy of the signature was assessed in three different validation experiments. The cross validation experiments were conducted as follows:",
                                "First, leave-one-out cross validation was employed by excluding one patient at a time from the training set and subsequently scoring the left out patient with the signature learned from the rest of the patients. Repeating this procedure 364 times yields a leave-one-out score estimate for each patient in the study. Second, 10-fold cross validation was conducted by partitioning the dataset into 10 parts of equal size using 90% of the patients for learning and 10% for validation. The procedure was repeated 10 times resulting in a 10-fold cross validation score for each patient. The third validation experiment was conducted to assess, if the proposed marker selection procedure is prone to over fitting. To this end, the target variable was randomly permuted and a model was learned to predict the risk score based on this distorted data."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "C) External Model Validation",
                            "paragraphs": [
                                "Our marker signature was validated on an external test cohort from Hamburg, Germany. Again, a risk score was calculated for each patient by a linear combination of the univariate Cox regression coefficients β from the initial test cohort and the IHC measurements of the external cohort. Based on this risk score, patients were assigned to a high risk group and a low risk group, split at the 50th percentile (median) of all scores. Finally, a multivariable Cox proportional hazards model was adjusted, testing the independent prognostic relevance of our risk score. Besides the proposed biomarker signature, age, gender, tumor thickness, Clark level, and nodal status were included in the Cox model as covariates."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Discovery Of The Seven-Marker Signature",
                    "paragraphs": [
                        "Prognostic power of the 70 markers was assessed by calculating univariate proportional hazard models [19], yielding eleven markers significantly associated with overall survival (Table 1). To correct for multiple testing, the false discovery rate (FDR) procedure [20] was applied with a FDR of 0.15 reducing the set of significantly associated markers to nine (Figure 1) which were correlated with death from any cause: MTAP and β-Catenin were so called “protective markers”, where loss of expression was associated with worse outcome. The remaining other seven markers were assigned “risk markers”.",
                        "Finally, CD49d, an α4-integrin (ITGA4) participating in cell-surface mediated signaling and adhesion, was dropped because the antibody failed our validation processes due to generation of multiple bands on western blot using a panel of melanoma cell lines and melanocytes [21] (Figure S1). Exclusion of CD49d resulted in a final seven biomarker signature. Besides CD49d, Bcl-X, MTAP, and to a lesser extent CTNNB1 and Bax also displayed multiple bands (Figure S1). However, all antibodies except CD49d showed at least one main (strongest) western blot signal.",
                        "Among the 362 patients of the primary cohort, patients with a high-risk seven-marker signature had a shorter median overall survival than the patients with a low-risk seven-marker signature (88 months versus not reached) and the difference between the two patient groups was significant (p<0.00001) (Figure 2A). The high-risk seven-marker signature was associated with a median recurrence-free survival of 33 months, whereas the low-risk seven-marker signature was associated with a median recurrence-free survival of 88 months (p<0.001) (Figure 2B). The heatmap in Figure 2C shows the IHC expression profiles of these 362 tumor specimens from the primary cohort ordered by their predicted risk score, indicating no high correlation between the selected markers. Figure S4 depicts all correlations between the markers of interest. Having the same sign, risk markers are naturally slightly correlated, but the maximal correlation between Bcl-X and COX-2 is only 0.36.",
                        "Comparing high-risk with low-risk patients (Table 2) based on their seven-marker risk score showed a significant difference in tumor thickness (p<0.001) and Clark level (p<0.001) and no difference in nodal status (p = 0.08), sex (p = 1) and age (p = 0.26). Risk scores significantly increased with increasing Clark levels (Figures 3A and 3B). Patients with nodular malignant melanomas (NM) showed the highest risk scores. Dot blots of risk scores for the various histological subtypes of malignant melanoma as classified by the ICD-10 are given in Figure 4.",
                        "According to multivariate Cox regression analysis, the seven-marker risk score, age, Clark level, and sex, were significantly associated with death from any cause among the 320 patients (113 events, 44 observations were deleted due to missing values). Table 2 summarizes the characteristics of variables that were included in the multivariate Cox model.",
                        "A subgroup analysis of 253 patients with a tumor depth of ≤2 mm revealed that those 148 patients with a high-risk marker signature had a significantly (p<0.01) shorter overall survival (Figure 5A) and recurrence-free survival (p<0.01) than the 105 patients with a low-risk marker signature (Figure 5B)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Internal Statistical Validation Of The Seven-Marker Signature",
                    "paragraphs": [
                        "The cross validation experiments showed comparable results and demonstrated that learning a marker signature for overall and recurrence-free survival was feasible and reproducible (Figures 5C–F). For leave-one-out cross validation, patients with high risk scores had a median survival of 94 months whereas median survival for patients with low risk signature was not reached (Figure 5C). The difference in survival expectance between patients with high-risk score and low-risk score was highly significant (p<0.0001). Although 10-fold cross validation has lower bias and higher variance, the difference between the high risk and low risk group (94 month versus not reached) was still significant (p<0.001, Figure 5E). In contrast to the cross validation experiments it was not possible to learn a signature to predict permuted labels (p>0.5), which indicates that the proposed learning procedure is not over fitting (Figure 5G). All coefficients and confidence intervals of the seven-marker signature are reported in Figure 5H."
                    ],
                    "subsections": []
                },
                {
                    "title": "Model Validation Of The Seven-Marker Signature On An External Test Cohort",
                    "paragraphs": [
                        "The clinical characteristics of the 225 patients in the external test cohort are listed in Table S1. Patients with a high-risk marker signature had a significantly (p<0.0001) shorter median overall survival compared to patients with a low-risk signature (Figure 6A). Comparing high-risk patients (Table 3) with low-risk patients based on their seven-marker risk score showed a significant difference in tumor thickness (p<0.001) and Clark levels (p<0.001), but no difference in sex (p = 1), age (p = 0.27) and nodal status (p = 0.34).",
                        "According to multivariate Cox regression including the seven-marker risk score, sex, age, Clark level, nodal status, and tumor thickness, the seven-marker signature was significantly associated with overall survival (p<0.05, Table 3). Additionally, the recurrence-free survival differed significantly between the two risk groups (p<0.001; Figure 6B)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "In this retrospective study of 364 melanoma patients, we identified an independent seven-marker signature of prognosis. Notably, the predictive power of the signature was carefully validated and confirmed on a secondary independent external test cohort (n = 225). With a total of 27,055 specimens of primary MMs analyzed by IHC, this TMA study is unmatched in the literature. An individual patient’s risk score can easily be calculated given the immunoreactivity scores for the seven markers and the estimated coefficients (Figure 5H). Figure 7 shows stained TMA specimens illustrating the Seven-Marker Signature for a patient with a high-risk and another patient with a low-risk melanoma.",
                "One of the main statistical problems in large scale IHC studies are missing values in the design matrix due to missing or corrupt spots on the TMA. The more markers are investigated the higher the chance that at least one value is missing per patient. Frequently this problem is tackled by either sacrificing a larger number of patient records or by employing volatile multiple imputation techniques. In this study 9.3% of values were missing, reducing the set of patients with all IHC measurements from 364 to 170. Algorithms like random survival forests [22] and ensemble learning with gradient boosting [23] are capable of dealing with missing values, but lead to models that are not intuitively interpretable and difficult to implement in clinical practice. To overcome these problems we employed a learning procedure which is invariant to missing values and results in an easily interpretable and practically applicable linear model.",
                "In early disease stages, application of an IHC based test to examine a MM patient’s tumor tissue at a molecular level suggests itself. Even though melanoma was among the first cancers recognized as a target for practical application of microarray analysis starting in 1996 [24], the transition of gene expression results to diagnostic applications with clinical impact has not been shown yet in MM. Microarray studies produced a plethora of data and have provided useful insights into the molecular biology of melanoma (reviewed in [25]). However, analysis of different histological subtypes of melanoma, expression analysis of mainly melanoma metastases, and lack of homogeneity of patient cohorts hampered the interpretation of these data [25]. Furthermore, routine supply of fresh frozen MM tissue for microarray based assays seems virtually impossible. Also, use of RT-PCR based tests are complicated by the need for pure populations of neoplastic melanoma cells, and has not yet resulted in a breakthrough in melanoma diagnosis or management of melanoma patients. Our defined seven-marker signature was of independent prognostic relevance in two independent patient cohorts. For the practitioner, the assessment of this set of seven IHC markers promises to be a helpful tool to answer the crucial question “whom to treat, and how to treat”, especially in the adjuvant setting after surgical excision of early-stage and localized primary MM (Stage I to IIa). With MTAP, COX-2 and Bcl-X, three markers of the seven-marker signature offer direct therapeutic implications, since the corresponding drugs have already been approved by the FDA.",
                "Currently, in the adjuvant treatment of MM, interferon alpha is the only clinically accepted therapeutic agent providing a significant (recurrence-free) survival benefit for a small but distinct percentage of patients [26]. On account of the serious side effects and the high costs of the therapy, only those patients with a realistic chance to benefit from interferon should receive this treatment. We have recently shown that there is a clear association between MTAP expression in the primary melanoma and melanoma progression and, even more importantly, response to interferon treatment [12], [27]. This gives rise to the hypothesis that interferon response may be correlated with the expression of interferon response genes such as MTAP.",
                "Cyclooxygenase 2 (COX-2) may represent another promising therapeutic target. Cyclooxygenases catalyze the first rate-limiting step in the conversion of arachidonic acid to prostaglandins. COX-2 is expressed in various tumor types and levels of COX-2 expression have been shown to correlate with invasiveness and prognosis in some tumor entities, including epithelial and melanocytic skin cancer [15], [28]. So far the benefit of COX-2-inhibitors has not been studied in the adjuvant treatment of early-stage melanomas to prevent metastasis. In the second-line treatment of advanced metastatic melanoma disease, however, a survival benefit was shown for targeted combined therapy using COX-2 inhibitors and PPARG-agonists for anti-inflammatory treatment together with low-dose metronomic chemotherapy [29]. Considering this observation and the fact that melanoma patients with COX-2-positive primary tumors bear a significantly higher risk of tumor recurrence [15], introduction of COX-2 inhibitors for primary adjuvant treatment of these patients seems obvious.",
                "One additional marker, Bcl-X, has been targeted in preclinical tests and several targeting agents are in the clinical testing phase by now [30]: Bcl-X is related to the anti-apoptotic Bcl-2 protein family. Overexpression of these anti-apoptotic proteins protects cancer cells against death signals of apoptosis. Interestingly, tumors expressing high levels of Bcl-2 or Bcl-X are often found to be resistant to chemotherapeutic agents or radiation therapy [31]. In recent years, non-peptidic cell permeable “small molecule inhibitors” (SMIs) against antiapoptotic proteins like Bcl-2 or Bcl-X have been identified. SMIs inhibit distinct protein-protein interactions by blocking specific binding sites of the target molecule, thus supporting the apoptotic machinery [30]. Inhibition of Bcl-X may exert a synergistic effect with conventional treatments like chemo- or radiation therapy. Regarding MM therapy, this effect would be a decisive therapeutic success.",
                "Presence of CD20-positive B-lymphocytes within or adjacent to MM tissue (Figures 8A–D ) was among the top seven biomarkers. However, the role of B-lymphocyte infiltration in MM is unknown and needs further investigation. The CD20-antigen is known to be an effective therapeutic target in the treatment of patients with CD20-positive B-Cell-Non-Hodgkin-Lymphomas. The monoclonal chimeric antibody Rituximab is indicated for alternative immunotherapy [32]. In MM, several subpopulations - some with stem cell-like characteristics - have been described including one with expression of CD20 (reviewed in [33]). In our study, only very few cases showed infiltrating CD20 positive B-lymphocytes (Figure 2E), comprising a very narrow dynamic range of this marker. However, even a six-marker signature without CD20 was significantly associated with overall and recurrence-free survival (Figures 9A and 9B).",
                "The tumor-suppressor gene phosphatase and tensin homolog (PTEN) is one of the most commonly inactivated genes in human cancer and has been identified as lost or mutated in melanoma [34]. An established consequence of PTEN inactivation is the constitutive aberrant activation of the phosphatidylinositol-3-kinase (PI3K)-signaling pathway that drives uncontrolled cell growth, proliferation, and survival [35]. In general, prediction of PI3K-signaling pathway activation based on PTEN IHC expression status is unfeasible since inactivation of PTEN is achieved by either gene mutation or deletion [34]. Figure S5 shows that some melanoma cell lines show PTEN expression and concomitant activation of the PI3K/AKT cascade. Alterations of the tumor suppressor PTEN have already been linked with disease outcome in patients with MM: Mikhail et al. have shown that loss of nuclear PTEN expression was associated with aggressive tumor behavior [36]. In contrast, we could show that strong cytoplasmic PTEN expression was found only in high risk patients.",
                "Most oncological findings regarding the Wnt/β-Catenin signaling are derived from the analysis of colon, breast and kidney carcinoma [37], [38] where activation of the pathway has been directly implicated in disease pathogenesis. The majority of colorectal carcinomas carry inactivating mutations in the Adenomatous polyposis coli (APC) tumor suppressor which lead to stabilization of β-Catenin, mimicking Wnt stimulation. Additionally, mutations in the β-Catenin gene CTNNB1 were found in colon cancer leading to the constitutive activation of β-Catenin/LEF/TCF-dependent canonical signaling [39]. However, such mutations are rarely found during melanoma development. In contrast to findings in colon carcinoma and in line with a study by Kuphal et al. [40], we show that β-Catenin protein was basically cytoplasmic in melanomas in vivo. Regarding our risk score, loss of cytoplamic β-Catenin expression was associated with worse outcome of melanoma patients. Kuphal and co-workers also demonstrated that the transcriptional activity of β-Catenin regulating expression of β-Catenin target genes was not observed in several melanoma cell lines, suggesting a cell type specific regulation of β-Catenin function [40].",
                "According to the data presented here, the seven-marker signature might serve as a prognostic tool enabling physicians to selectively triage, at the time of diagnosis and initial surgery, the subset of high recurrence risk stage I–II patients for adjuvant therapy. Selective treatment of those patients that are more likely to develop distant metastatic disease could potentially lower the burden of untreatable metastatic melanoma and revolutionize the therapeutic management of MM. Prospective clinical trials are necessary to validate the prognostic and therapeutic value of this seven-marker signature and its benefit for routine clinical assessment of MM. The utility of the algorithm in a practice setting, where full heterogeneous tissue sections are used, is currently being analyzed in a prospective clinical trial at the Department of Dermatology, University of Regensburg, Germany."
            ],
            "subsections": []
        }
    ]
}