{
    "id": "https://semopenalex.org/work/W2009765991",
    "authors": [
        "James Gómez",
        "David M. Knipe",
        "Ella R. Hinson",
        "Sarah A. Stanley",
        "Deborah T. Hung",
        "Kevin F. Bryant",
        "Devinder Kaur",
        "Mark Borowsky",
        "B. Kaufmann",
        "Andrew B. Onderdonk",
        "Amy K. Barczak",
        "Alexander Sloutsky",
        "Lisa A. Cosimi"
    ],
    "title": "RNA signatures allow rapid identification of pathogens and antibiotic susceptibilities",
    "date": "2012-04-02",
    "abstract": "With rising rates of drug-resistant infections, there is a need for diagnostic methods that rapidly can detect the presence of pathogens and reveal their susceptibility to antibiotics. Here we propose an approach to diagnosing the presence and drug-susceptibility of infectious diseases based on direct detection of RNA from clinical samples. We demonstrate that species-specific RNA signatures can be used to identify a broad spectrum of infectious agents, including bacteria, viruses, yeast, and parasites. Moreover, we show that the behavior of a small set of bacterial transcripts after a brief antibiotic pulse can rapidly differentiate drug-susceptible and -resistant organisms and that these measurements can be made directly from clinical materials. Thus, transcriptional signatures could form the basis of a uniform diagnostic platform applicable across a broad range of infectious agents.",
    "sections": [
        {
            "title": "Results",
            "paragraphs": [
                "RNA-Based Pathogen Detection. We first sought to identify pathogens through direct detection of RNAs specific to the species.",
                "As an initial test, we targeted three Gram-negative pathogens: Escherichia coli, Pseudomonas aeruginosa, and Klebsiella pneumoniae. To identify organism-specific sequences for probe design, we analyzed publicly available coding sequences from multiple isolates of each of these three pathogens to find genes that are highly conserved within but not between species. We generated a pool of probes targeting these species-specific mRNAs, including four or five probes for each organism to obtain desired levels of specificity. (Probe lists are given in SI Appendix, Table S1.) We were able to detect and distinguish each organism in pure culture (Fig. 1A) and in a complex mixture including eight additional Gram-negative pathogens by directly probing crude lysates (SI Appendix, Fig. S1). Because microbiologic diagnosis of M. tuberculosis is among the slowest diagnosis made in a clinical setting, we then sought to extend our findings to this pathogen. We designed probes to both genes conserved throughout the genus Mycobacterium and genes specific to M. tuberculosis and were able to distinguish M. tuberculosis from other pathogenic mycobacteria (Fig. 1B).",
                "To transform these data into a binary determination of the presence or absence of a pathogen in a given sample, we condensed the counts from multiple transcripts into a single metric that assesses the presence or absence of an organism, using the mean of the natural logarithm of the raw counts from each probe, normalized for hybridization efficiency using internal controls. When applied to a set of 17 clinical E. coli isolates, every isolate was differentiated easily from a set of 13 non-E. coli samples (Z score > 6.5 relative to non-E. coli controls; Fig. 1C). This method also was effective when applied across a wider range of bacterial pathogens, including K. pneumoniae, P. aeruginosa, M. tuberculosis, Proteus mirabilis, Staphylococcus aureus, Streptococcus pneumoniae, Streptococcus pyogenes, and Stenotrophomonas maltophilia (SI Appendix, Fig. S2 and Table S2). Of note, the specificity of the probes allowed us to distinguish between species within a genus easily (the two streptococcal species were not detected with the other's probes, and Klebsiella oxytoca strains were not detected with K. pneumoniae probes).",
                "Because RNA is universal in pathogens ranging from bacteria, viruses, and fungi to parasites, RNA detection can provide a common diagnostic platform applicable across a broad range of infectious agents. Using a large pool of mixed pathogen probes, we were able directly and specifically to detect signals to identify influenza virus, herpes simplex virus-2 (HSV-2), and HIV-1 in cell culture in a dose-dependent manner (Fig. 2 A-C); the fungal pathogen Candida albicans (Fig. 2D); and the different stages of the Plasmodium falciparum life cycle in infected erythrocytes (Fig. 2E). As with bacterial detection, viral detection was highly specific; HSV-2 probes did not detect HSV-1 virus even at relatively high multiplicity of infection (MOI) (Fig. 2B). Current clinical laboratory practice uses a range of techniques from standard culture to fluorescent microscopy to diagnose infections with these organisms; however, RNA-based direct detection has the potential to streamline identification of almost all potential infectious agents into a single platform.",
                "RNA-Based Determination of Drug Susceptibility. In the clinical setting, determining appropriate therapy requires knowing not only which pathogens are present but also their antibiotic susceptibilities. We thus sought to demonstrate that RNA detection can be used to determine antibiotic resistance rapidly. In the case of mobile genetic elements that encode drug-resistance genes, detection of transcripts from known elements would enable us to determine resistance genotypically, in a manner analogous to PCR-based approaches that detect resistance-encoding genes in some bacteria (16)(17)(18). To demonstrate that an RNA-based approach is able to detect such resistance genes, we probed S. aureus isolates for mecA mRNA, which confers resistance to methicillin, and Enterococcus isolates for vanA mRNA, which confers resistance to vancomycin. In both cases, we could detect the relevant transcript (Fig. 3A), thus allowing rapid identification of MRSA and vancomycin-resistant Enterococcus (VRE), with the potential to match PCR-based methods while bypassing the need for nucleic acid isolation, purification, and amplification. In principle, this method can be extended to other genetic determinants of pathogenicity, such as virulence factors acquired through horizontal genetic exchange in food-borne pathogens [e.g., Shiga toxin in enterohemorrhagic or Shiga toxigenic E. coli (19)].",
                "We then sought to extend RNA-based determination of antibiotic resistance beyond the detection of specific known genotypes. Antibiotic exposure can trigger a stereotypical transcriptional response in susceptible microbes as rapidly as within a few minutes (14). For example, when treated with ciprofloxacin, P. aeruginosa up-regulates both recA and lexA, part of the canonical SOS response (20). These transcriptional programs represent one of the earliest detectable cellular changes that distinguish susceptible and resistant organisms. For many organism/antibiotic pairings, these responses have been well characterized using microarrays. We hypothesized that sensitive organisms exposed to drug would display a stereotypical transcriptional signature, but resistant organisms, regardless of the mechanism of resistance, would show no response, thus providing a basis for rapidly distinguishing antibiotic-susceptible from antibiotic -resistant strains based on phenotype.",
                "Using published data from Gene Expression Omnibus (http:// www.ncbi.nlm.nih.gov/geo/) or ArrayExpress (http://www.ebi.ac. uk/arrayexpress/), we identified genes that are regulated differentially upon exposure to various antimicrobial agents and thus can be used to indicate the presence or absence of a response. We generated a pooled antibiotic-sensitivity probe set to detect uniquely these genes for several pathogens of interest (14,20,21). Following a 10-min exposure of E. coli K-12 to ciprofloxacin, we observed changes in transcript levels of a subset of genes that together define a ciprofloxacin-susceptibility expression signature (Fig. 3B; probes are listed in SI Appendix, Table S7). A similar signature was detected in an additional laboratory isolate and in five clinical isolates tested (SI Appendix, Table S3). In contrast, this signature was not elicited in the seven resistant clinical strains tested (Fig. 3B and SI Appendix, Table S3). Similarly, on exposure of antibiotic-susceptible E. coli strains to gentamicin or ampicillin or on exposure of antibiotic-susceptible P. aeruginosa strains to ciprofloxacin, we observed stereotypic transcriptional responses specific to each antibiotic/microbe combination (Fig. 3 B and C and SI Appendix, Table S3) that were not elicited in resistant strains. Some genes (e.g., recA, involved in the SOS response) are upregulated in several species in response to multiple antibiotics, whereas other transcriptional changes are organism and/or mechanism specific. For example, exposure of E. coli to the β-lactam ampicillin [which blocks cell-wall synthesis and also hinders proline transport (22)] induces opgG, involved in the osmoregulated synthesis of periplasmic glucan (23), and proC, which encodes a proline synthetic enzyme. In contrast, the transcript levels of the majority of genes remain unchanged in response to antibiotic exposure, underscoring the sufficiency of following only a small subset of genes, i.e., a signature, rather than the entire genome. It should be noted that genes selected in this work were chosen based on a limited set of previously published data, and additional genomewide monitoring of a broader range of drug-susceptible isolates might improve these signatures and thus strengthen this approach.",
                "Rapid phenotypic testing for antibiotic susceptibility would have a particularly profound impact in tuberculosis, because established methods for phenotypic testing take weeks to months. During this time, patients with unsuspected resistance who are treated with standard therapy remain inappropriately treated, potentially resulting in the development of further drug resistance and worse outcomes. Moreover, until these patients receive adequate therapy, they remain infectious and can spread drug-resistant disease (24). We therefore defined expression signatures in response to the anti-tubercular agents isoniazid, ciprofloxacin, and streptomycin (25) and showed that susceptible and resistant laboratory and clinical isolates could be distinguished after 3-6 h of exposure to the antibiotic (Fig. 3D). Some genes in the transcriptional profiles are mechanism specific (e.g., alkA and lhr for ciprofloxacin; groEL for streptomycin; and kasA and accD6 for isoniazid) (25,26). Other genes, particularly those involved in mycolic acid synthesis or intermediary metabolism, are downregulated in response to multiple antibiotics, indicating a shift away from growth toward damage control.",
                "As with organism identification, we transformed the transcriptional signatures elicited by drug exposure into a binary outcome indicative of sensitivity or resistance. To condense the transcriptional responses into a single, quantitative metric, we calculated the squared projected distance (SPD) of the expression response from each experimental sample along a vector from the centroid of control, antibiotic-susceptible samples to the centroid of resistant controls (a detailed description of this metric is provided in the SI Appendix). Strains susceptible to a given antibiotic show closely clustered transcriptional responses, resulting in small SPDs (SI Appendix, Table S3). Conversely, antibiotic-resistant strains have larger SPD values, the result of the signature genes failing to respond to antibiotic. Using this metric, we can clearly separate sensitive and resistant laboratory and clinical isolates of E. coli (Fig. 3E and SI Appendix, Fig. S3), P. aeruginosa (SI Appendix, Fig. S4), and M. tuberculosis (Fig. 4B and SI Appendix, Fig. S5).",
                "Because transcription represents a phenotypic response to antibiotic exposure, we hypothesized that the sensitive signature should not be elicited in resistant strains regardless of the mechanism of resistance. To evaluate this principle, we engineered a set of isogenic strains with distinct, well-characterized resistance mechanisms and compared their transcriptional responses to antibiotic exposure. We tested five ciprofloxacin-resistant mutants of E. coli strain J53, each engineered to carry a different mechanism of resistance: two with single mutations in the fluoroquinolone target gene topoisomerase gyrA (G81D or S83L) and three carrying plasmid-mediated quinolone-resistance genes with distinct mechanisms of action (27) including aac(6′)-Ib, which encodes an acetylating, inactivating enzyme; qnrB, which encodes a protein that blocks the active site of GyrA; and oqxAB, which encodes an efflux pump (Fig. 4A). The susceptible parent strain, J53, demonstrated the expected signature upon ciprofloxacin exposure and a small SPD similar to that of other drug-sensitive isolates (SI Appendix, Table S3). However, none of the ciprofloxacin-resistant mutants showed the sensitivity signature upon ciprofloxacin exposure, and all had large SPDs, thus confirming that an expression signature can distinguish resistant from sensitive strains, independent of the mechanism of resistance.",
                "To demonstrate the applicability of this principle beyond E. coli, we tested M. tuberculosis isolates with known distinct mechanisms of resistance to the first-line drug isoniazid. The first resistant strain has a mutation in katG, which encodes a catalase necessary for prodrug activation (28); the second has a mutation in the promoter of inhA, which encodes the target of isoniazid (29). Because of these distinct mechanisms, these two strains have differing levels of resistance to isoniazid: The katG mutant shows high-level resistance [minimum inhibitory concentration (MIC) >6.4 μg/mL], whereas the inhA promoter mutant has lower-level resistance (MIC = 0.4 μg/mL). Exposure of the sensitive laboratory strain H37Rv to either low (0.2 μg/mL) or high (1 μg/mL) concentrations of isoniazid elicited the expected transcriptional signature. Exposure to the lower isoniazid concentration failed to elicit a transcriptional response in either resistant strain, but at the higher isoniazid concentration, the inhA mutant responded in a susceptible manner, in contrast to the katG mutant (Fig. 4C). This result confirms that the loss of the transcriptional signature is independent of mechanism. Moreover, it suggests that the concentrations required to elicit responses can be used to differentiate high-and low-level resistance.",
                "Application of an RNA-Based Diagnostic to Simulated and Real Patient Specimens. To show that an RNA-based diagnostic platform can be used to probe clinical specimens directly, we first sought to identify pathogens and their drug susceptibilities in blood samples spiked with bacteria. We introduced MRSA or methicillin-sensitive S. aureus (MSSA) or ciprofloxacin-sensitive (CIP S ) or -resistant (CIP R ) E. coli into human blood samples and then probed for pathogen RNA. From these samples, we were able to identify the spiked organism directly (Fig. 5A) and simultaneously to detect both genotypic and phenotypic antibiotic resistance. Using probes to mecA transcript, we were able to distinguish MRSA from MSSA easily (Fig. 5A), and, using our defined expression signatures of antibiotic exposure, we were able to distinguish CIP S from CIP R E. coli (Fig. 5B). We were similarly successful using urine into which we had introduced E. coli. We grew CIP S and CIP R isolates of E. coli in clean-caught urine from healthy donors and probed directly for and detected species-specific transcripts (Fig. 5A) as well as drug-sensitive transcriptional responses upon CIP exposure (Fig. 5B).",
                "Finally, we applied this method directly to clinical specimens by testing 34 urine specimens collected from patients suspected of having urinary tract infections based on a positive urine analysis. A small aliquot of urine was pulsed with ciprofloxacin for 30 min, lysed, and assayed in parallel with an unexposed aliquot, using a single probe set that included both identification and drug-susceptibility probes. For comparison, standard culture-based diagnostic tools were used for organism identification and drug-susceptibility testing [growth on selective/differential media, testing of isolates using API 20E strips (bioMerieux, Inc.), and microtiter plate-based MIC determinations; see SI Appendix, Tables S8 andS9]. We were able to identify K. pneumoniae and P. aeruginosa in all specimens infected with these organisms at levels greater than the standard clinical cutoff (>10 5 organisms per milliliter of urine); these scores for these culture-positive specimens differed from the scores of the culture-negative specimens by >12 SDs (Fig. 5C). Results for E. coli were less clear because background counts for the E. coli probes generally were higher than for the P. aeruginosa and K. pneumoniae probes. This background also was observed with nonclinical materials and blank controls across multiple probe lots, suggesting that the background signal is inherent to the Nano-String assay and could represent low levels of nucleic acid contamination in reagents. Nevertheless, all 17 E. coli-positive specimens scored higher than the 17 E. coli-negative specimens, with 13 of the E. coli-positive specimens scoring more than three SDs higher than the mean of the negative specimens. Finally, using the data from the spiked urine samples (Fig. 5B) as a training data set to define the ciprofloxacin sensitivity signature in urine, we evaluated the 13 unknown E. coli-infected urine specimens for ciprofloxacin sensitivity (Fig. 5D and SI Appendix, Table S9). Samples were scored as sensitive if the SPD score fell more than three SDs from the mean SPD of the resistant samples used in the training set. Using this cutoff, all 13 samples were characterized correctly (100% accuracy, P = 0.00037)."
            ],
            "subsections": []
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The current wealth of genomic and transcriptomic data available should promote the development of substantially improved diagnostics for infectious diseases. Our work suggests that an RNA-based diagnostic can capitalize on this information by taking advantage of both static genome sequences and dynamic transcriptomic responses. Although additional testing will be required to determine the full applicability of the approach, direct RNA detection has the potential to identify most classes of pathogens and to allow simultaneous phenotypic determination of antibiotic susceptibility within a single assay. An RNA-centered diagnostic has two important advantages. First, the natural abundance of single-stranded mRNA allows its direct detection via hybridization, without purification or amplification. First, the natural abundance of single-stranded mRNA allows its direct detection via hybridization, without purification, thus eliminating the challenges of enzymatic amplification. More critically, antibiotic-elicited RNA signatures are a rapid indicator of antibiotic susceptibility; because these signatures are among the first cellular changes that occur upon drug exposure, they should allow detection of resistance long before the traditional phenotype of growth inhibition can be observed. Moreover, we have demonstrated that transcriptional profiles reflect physiologic phenotypes regardless of the underlying genotypic basis for resistance.",
                "RNA detection thus has the potential to accelerate, unify, and simplify diagnosis, particularly with regards to determining antibiotic susceptibilities. Recently, RNA signatures have been recognized as an important tool in guiding clinical practice in cancer (30). Our work extends this application by measuring dynamic changes in RNA signatures upon antibiotic exposure rather than static baseline transcriptional profiles.",
                "Although this paper provides a proof of principle, considerable additional work will be required to yield a clinic-ready, RNA-based diagnostic for infectious diseases. First, probe-set design will benefit from the availability of more sequenced genomes and additional transcriptomic data. Second, it will be necessary to develop a fully automated, integrated system for sample processing and detection, which will drive the speed, sensitivity, and detection limit of the system [the current assay detects 40-90 bacteria grown in culture; see SI Appendix, Fig. S6]. Engineering also can facilitate the development of systems suited to resource-poor settings. Third, it will be necessary to benchmark the RNA signatures with conventional assays for organism identification and drug-susceptibility determination and to run trials to determine statistically meaningful sensitivities and specificities for the method. As an important step, the work described here demonstrates the feasibility of this approach and raises the possibility that an RNA-based diagnostic could meet the critical need for more rapid diagnosis of infectious disease."
            ],
            "subsections": []
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [
                "For expanded details of methods, see SI Appendix.",
                "Selection of Organism-Identification Probes. To select nCounter probes for differential detection of Gram-negative organisms, we compared all publically available sequenced genomes for relevant organisms (SI Appendix, Table S10). We identified genes conserved within each species by selecting coding sequences (CDS) having at least 50% identity over at least 70% of the CDS length for all sequenced genomes for pathogenic strains of that species available at the time the probe sets were generated. We broke the CDS into overlapping 50-mers and retained only those 50-mers with 100% identity within a species and having no greater than 50% identity to a CDS in any other species in the study. Available published expression data in Gene Expression Omnibus were reviewed, and genes with good expression under most conditions were selected. Full details of this process are described in SI Appendix.",
                "Bacterial and Fungal Culture. All Gram-negative bacterial clinical isolates were obtained from the Brigham and Women's Hospital microbiology laboratory, and clinical M. tuberculosis isolates were obtained from the Massachusetts Supranational Tuberculosis Reference Laboratory. Bacterial or yeast cultures were grown to an OD 600 of ∼1 in LB medium. For mixing experiments, equal numbers of bacteria as determined by OD 600 were combined before lysis for nCounter analysis. For spiked urine experiments, E. coli was grown overnight at 37 °C in sterile urine, diluted 1:20, and grown to OD 600 of 0.1-0.3 in fresh urine before harvest or antibiotic exposure, as described below. Mycobacterium isolates were grown in Middlebrook 7H9 medium (BD Diagnostics) supplemented with OADC (BD Diagnostics) and 0.2% glycerol.",
                "Viral and Plasmodium Infections. HeLa cells (2 × 10 6 ), 293T cells (2 × 10 5 ), and human peripheral blood monocytes (5 × 10 5 ) were infected with HSV-1 strain KOS and HSV-2 strain 186 Syn+, influenza A PR8, or HIV-1 NL-ADA, respectively, at the noted MOIs. Primary red blood cells (5 × 10 9 ) were infected with P. falciparum strain 3D7 until they reached the noted levels of parasitemia. At the indicated times, the cells were washed once with PBS and harvested as described below.",
                "Antibiotic Exposure. Cultures of E. coli or P. aeruginosa were grown to an OD 600 of ∼1 in LB. Cultures then were divided into two samples, one of which was treated with antibiotic (E. coli: ciprofloxacin 4-8 μg/mL or 300 ng/mL or ampicillin 500 μg/mL for 10 min, gentamicin 64 μg/mL for 30 min; P. aeruginosa: ciprofloxacin 16 μg/mL for 30 min). Cultures of S. aureus or Enterococcus were grown to an OD 600 of ∼1 in LB. Cultures then were exposed to cloxacillin (25 μg/mL) or vancomycin (128 μg/mL), respectively, for 30 min. Cultures of M. tuberculosis were grown to midlog phase and then were normalized to OD 600 of 0.2. Two milliliters of each culture were treated with no antibiotic or with one of the following (final concentration): isoniazid 0.2-1.0 μg/mL for 3 h; streptomycin 5 μg/mL for 6 h, or ciprofloxacin 5 μg/mL for 3 h. Clinical samples, including spiked blood, spiked urine, and discarded patient urines, were exposed to 4 μg/mL ciprofloxacin for 30 min. All bacterial cultures and clinical materials were maintained at 37 °C during drug exposure.",
                "Sample Processing. Gram-negative cultures were lysed directly in RLT buffer (Qiagen). In addition, Gram-positive cultures were disrupted mechanically with bead beating. For spiked blood samples, 1 × 10 7 bacteria were added per milliliter of blood. Samples then were added to PAXgene blood RNA tubes (PreAnalytix GmbH) and were processed according to the manufacturer's protocol through the first centrifugation. Then supernatant was aspirated, pellets were resuspended in RLT buffer, and lysates were used directly in hybridizations. For spiked urine and clinical specimens, urine was added directly to RLT buffer. Mycobacterial cultures were centrifuged and then were resuspended in TRIzol (Gibco) with or without mechanical disruption by bead beating, and the initial aqueous phase was collected for analysis. Viral and parasite RNA were prepared similarly using TRIzol and chloroform. For all lysates, 3-5 μL were used directly in hybridizations according to standard nCounter protocols. For organism identification, raw scores were normalized to internal hybridization controls. To determine antibiotic susceptibility, raw counts were normalized to the mean of the middle 50% of all probes for a sample, and fold induction for each gene was determined by comparing antibiotic-treated with untreated samples.",
                "Processing of Clinical Urine Specimens. Discarded, de-identified urine specimens positive for nitrites and leukocytes were obtained from the Brigham and Women's Hospital clinical laboratory. The time between collection and processing ranged from 3-48 h. Laboratory sample processing was minimal, consisting of a 30-min exposure of a collected urine specimen to antibiotic followed by rapid lysis in RLT buffer. nCounter transcript detection was performed according to the manufacturer's recommendation for analysis of mammalian genomes (18-h hybridization followed by a 5-h analysis on an automated instrument). Microbial identification and antibiotic susceptibility were determined independently using standard laboratory protocols. For full details see SI Appendix."
            ],
            "subsections": []
        }
    ]
}