{
    "id": "https://semopenalex.org/work/W2748950984",
    "authors": [
        "Billy R. Ballard",
        "Maria Gazouli",
        "Mary Kay Washington",
        "Alan J. Herline",
        "Timothy M. Geiger",
        "Duane T. Smoot",
        "Roberta L. Muldoon",
        "Amos M. Sakwe",
        "Olga Y. Korolkova",
        "J. Shawn Goodwin",
        "Michael G. Izban",
        "Amanda D. Williams",
        "Samuel James",
        "Amosy E. M’Koma"
    ],
    "title": "Human alpha defensin 5 is a candidate biomarker to delineate inflammatory bowel disease",
    "date": "2017-08-17",
    "abstract": "Inability to distinguish Crohn's colitis from ulcerative colitis leads to the diagnosis of indeterminate colitis. This greatly effects medical and surgical care of the patient because treatments for the two diseases vary. Approximately 30 percent of inflammatory bowel disease patients cannot be accurately diagnosed, increasing their risk of inappropriate treatment. We sought to determine whether transcriptomic patterns could be used to develop diagnostic biomarker(s) to delineate inflammatory bowel disease more accurately. Four patients groups were assessed via whole-transcriptome microarray, qPCR, Western blot, and immunohistochemistry for differential expression of Human α-Defensin-5. In addition, immunohistochemistry for Paneth cells and Lysozyme, a Paneth cell marker, was also performed. Aberrant expression of Human α-Defensin-5 levels using transcript, Western blot, and immunohistochemistry staining levels was significantly upregulated in Crohn's colitis, p< 0.0001. Among patients with indeterminate colitis, Human α-Defensin-5 is a reliable differentiator with a positive predictive value of 96 percent. We also observed abundant ectopic crypt Paneth cells in all colectomy tissue samples of Crohn's colitis patients. In a retrospective study, we show that Human α-Defensin-5 could be used in indeterminate colitis patients to determine if they have either ulcerative colitis (low levels of Human α-Defensin-5) or Crohn's colitis (high levels of Human α-Defensin-5). Twenty of 67 patients (30 percent) who underwent restorative proctocolectomy for definitive ulcerative colitis were clinically changed to de novo Crohn's disease. These patients were profiled by Human α-Defensin-5 immunohistochemistry. All patients tested strongly positive. In addition, we observed by both hematoxylin and eosin and Lysozyme staining, a large number of ectopic Paneth cells in the colonic crypt of Crohn's colitis patient samples. Our experiments are the first to show that Human α-Defensin-5 is a potential candidate biomarker to molecularly differentiate Crohn's colitis from ulcerative colitis, to our knowledge. These data give us both a potential diagnostic marker in Human α-Defensin-5 and insight to develop future mechanistic studies to better understand crypt biology in Crohn's colitis.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Managing phenotypic outcomes of indeterminate colitis (IC), given its unpredictable clinical presentation and disease course, is challenging in endoscopic medicine [1,2]. Inadequate differentiated diagnostic features of the two predominantly colonic main inflammatory bowel disease (IBD), namely ulcerative colitis (UC) and Crohn’s colitis (CC), may lead instead to an inconclusive diagnosis of IC [1,2]. A significant subgroup of IBD patients are misdiagnosed or have diagnosis delayed even when a state-of-the-art classification system of clinical, endoscopic, radiologic and histologic tools is used [2–5]. Study strategy is to enhance accurate and noninvasive diagnostics technologies that can measure individual molecules in complex endoscopic and surgical clinical specimen and provide quantitative and qualitative data about cellular system and can differentiate pathologic from normal tissue to delineate diseases within the same organ [6,7,8].",
                "In addition, in predominantly colonic IBD, the distinction between UC and CC is of utmost importance when determining a patient’s candidacy for restorative proctocolectomy [9–11]. Approximately 15% of patients whose IC is surgically treated with IPAA resolve with an ultimate diagnosis of de novo Crohn’s, for which surgery may have been contraindicated [1,12]. Construction of an ileoanal pouch in these patients indicate that positive outcomes require painstaking clinical evaluations to identify those with Crohn’s or IC that turns to de novo Crohn’s, which may result in pouch failure and significant morbidity in the interim [10,13]. Change of diagnosis of IC to UC or CC is sometimes observed in patients with IBD before colectomy, as is the development of de novo Crohn’s disease after surgery, restorative proctocolectomy (RPC) and ileal pouch-anal anastomosis (IPAA) [1,10,12,13,14]. Incorrect diagnosis and treatment carries potential morbidity from inappropriate and unnecessary surgeries and underscores the necessity of research efforts aimed at a more accurate diagnosis of the colitides [6,7,10,11]. This paper describes a potential diagnostic molecular biomarker for reclassifying IC into an accurate clinical diagnosis of UC or CC prior to appropriate care intervention. These successful studies are the first of their kind to use tissue molecular biometrics in the colon microenvironment to delineate the colitides [6,7].",
                "In this study, we found that expression levels of HD5 were up to 118-fold greater in CC as compared to UC. HD5 is a human protein that is encoded by the DEFA5 gene and is highly expressed in secretory granules of crypt Paneth cells (PCs) of the small intestine (ileum) [15]. Of note, crypt PCs are normally not found in normal colon epithelium [16]. However, we observed abundant PCs in all CC colectomy tissues and in one patient with UC, indicating that there may be stem cell niche factors in this tissue. Others had similar observation [16,17]. This study is the first to significantly extend what others have presented earlier about changes in PC density and morphology, based on lysozyme distribution in PCs of ileal Crohn’s/Crohn’s ileitis [18,19]. HD5 is a microbicide and cytotoxic peptide involved in host defense mechanisms and is responsible for non-specific killing of gut microbes [15]. To date, there is no available single molecular biomarker that has proven to have sufficient diagnostic qualities for IBD. In this study, we provide HD5 as a possible diagnostic candidate biomarker. HD5 is a more reliable signature to distinguish CC from UC. Developing a better diagnostic marker will allow patients previously diagnosed as IC and UC, but in reality were CC and received inappropriate surgical intervention, to receive recommended appropriate therapies."
            ],
            "subsections": []
        },
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Clinical Samples And Ethical Consideration",
                    "paragraphs": [
                        "In order to carryout tissue profiling of differentially expressed proteins/genes in IBD, we first sought ethical approval from the Meharry Medical College (IRB file #: 100916AM206) and Vanderbilt University Medical Center (IRB file #s: 080898 and 100581) Institutional Review Boards [20]. Informed consent was provided, and patient participation in the study was voluntary. Patient samples comprised of surgical pathology colectomy tissues from adults with definitive UC and CC phenotypes as well as those diagnosed with IC at Vanderbilt University Medical Center (VUMC) between 2000 and 2007. The full thickness surgical samples of colectomy tissue were analyzed by pathology teams at MMC and VUMC, Schools of Medicine following established protocol criteria for IBD subtypes. For each selected sample, medical records data on patient demographics, preoperative variables prior to and after time of ileal pouch-anal anastomosis surgery, surveillance endoscopic and clinical findings, and medical and surgical treatment history were reviewed retrospectively. Samples included in all experiments were taken from various parts of the colon; all inflamed tissue unless otherwise indicated. A condensed list of samples and colon locations are included in S1 Table."
                    ],
                    "subsections": []
                },
                {
                    "title": "Diagnostic Criteria For Inflammatory Bowel Disease",
                    "paragraphs": [
                        "Pathology teams at MMC and VUMC Schools of Medicine used the following protocol criteria for the final surgical pathology reporting."
                    ],
                    "subsections": [
                        {
                            "title": "For Ulcerative Colitis",
                            "paragraphs": [
                                "Characteristic pattern of involvement of colon, worse distally in untreated patients; lack of perianal or fistulizing disease; no granulomas, except in association with ruptured/injured crypts; no transmural lymphoid aggregates or other transmural inflammation; no involvement of terminal ileum, except mild “backwash ileitis” in cases with severe cecal involvement and no pyloric metaplasia in terminal ileum."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "For Crohn’S Disease",
                            "paragraphs": [
                                "Involvement of other sites in the gastrointestinal tract (skip lesions, segmental disease); perianal or fistulizing disease; granulomas, not in association with ruptured/injured crypts and terminal ileum involvement."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "For Indeterminate Colitis",
                            "paragraphs": [
                                "Distribution favors UC, but focal transmural inflammation, or inflammation in ileum more than expected in backwash ileitis and no fistulizing disease."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Vanderbilt Patient Medical Records Database",
                    "paragraphs": [
                        "The availability of a detailed IBD patient database registry at Vanderbilt University Medical Center (VUMC) made chart review and follow-up surveillance possible. Medical records data on patient demographics, preoperative variables prior to and after IPAA surgery, surveillance of endoscopic and clinical findings, and medical and surgical treatment history were retrieved retrospectively."
                    ],
                    "subsections": []
                },
                {
                    "title": "Indeterminate Colitis Clinical Retrospective Study",
                    "paragraphs": [
                        "A retrospective investigation was conducted to identify a cohort of patients diagnosed with IC and registered in the IBD Center at VUMC. Twenty-one patients, initially classified as IC at the time of diagnosis between years 2000–2007, were identified and reevaluated for disease course in 2014, after a mean surveillance follow-up of 8.7±3.7 (range, 4–14) years, in order to identify the rates of diagnosis resolution to UC or CC. Diagnosis for each patient was determined based on standard clinical and pathologic features as previously described [21,22]. Three gastrointestinal pathologists blinded to clinical diagnosis reconciled and confirmed colitis diagnosis for each patient and represented a consensus among treating physicians. Patients who clinically did not changed and maintained the IC diagnosis were tested via IHC and Nikon Element Advanced Research Analysis Software (NEARAS) for HD5 levels to determine if HD5 could be used to identify CC from UC."
                    ],
                    "subsections": []
                },
                {
                    "title": "Restorative Proctocolectomy Operated Patients’ Retrospective Study",
                    "paragraphs": [
                        "One hundred twenty patients with definitive UC underwent RPC surgery between 4/18/2001 and 6/18/2008. Of the 120 patients, 67 had their diagnosis re-evaluated after a mean follow-up of 9.4 (range, 6–13) years of functionally acceptable pouches. Compiled medical records allowed us to re-evaluate a progressive course of UC patients following RPC. Clinical information needed for each of these patients was available in the IBD medical records registry database at VUMC. The aim was to reevaluate patients who underwent RPC operation for definitive UC and had a change in diagnosis to de novo Crohn’s ileitis. Patients who had a change in diagnosis should reconcile the molecular biometric test that delineates IC into CC; again using NEARAS for HD5 levels."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cdna Microarray",
                    "paragraphs": [
                        "We performed a whole-transcriptome microarray with RNA extracted and pooled from human full thickness colon samples from UC and CC patients (n = 5/group) (Affymetrix, Santa Clara, CA)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Nanostring Ncounter Human Inflammation Kit Gene Expression",
                    "paragraphs": [
                        "RNA from UC and CCl tissue was processed by NanoString (NanoString Technologies Inc., Seattle, WA) to determine gene expression level according to the manufacturer protocol [23]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Real-Time Rt-Pcr",
                    "paragraphs": [
                        "Real-Time RT-PCR was used to measure transcript levels of HD5. RNA was extracted from three human colon biopsy samples each from moderate UC and CC, and diverticulitis (DV) as a non-IBD control (RNeasy Miniprep Kit, Qiagen, CA). cDNA was generated using iScript cDNA synthesis kit (Bio-Rad, Hercules, CA). Pre-designed TaqMan probes (Thermo Fisher Scientific, Waltham, MA) were purchased for HD5 and GAPHD control, and all samples were run in triplicate using a CFX96 qPCR thermocycler (Bio-Rad). Data were analyzed per the ΔΔCt method of analysis."
                    ],
                    "subsections": []
                },
                {
                    "title": "Western Blot And Immunohistochemistry",
                    "paragraphs": [
                        "Western blot was used to assess any differences in HD5 protein levels. Protein was extracted from a minimum of 10 colon biopsy samples each from mild, moderate, and severe UC; mild, moderate, and severe CC; and non-IBD DV control. Whole cell lysates were extracted from full-thickness colon samples using T-PER (Thermo Fisher Scientific) per manufacturer’s protocol. Bradford Assays (Bio-Rad) were run to determine protein concentration, and protein was loaded onto a 4–20% SDS-PAGE tris/glycine gel (Bio-Rad). Proteins were transferred to PVDF (Bio-Rad), and Western blots for HD5 and β-actin loading control were performed with primary and secondary antibodies (Santa Cruz, Dallas, TX) per manufacturer’s protocol. Blots were visualized with Opti-4CN colorimetric detection kit (Bio-Rad) and imaged with ChemiDoc XRS+ imaging system (Bio-Rad). Band intensities were measured and data analysis performed with Image Lab Software (Bio-Rad).",
                        "Five colon tissue protein extracts and staining of HD5 per disease by immunohistochemistry (IHC) was done as previously described.24 Quantification of HD5 staining was analyzed manually by microscopy and automatically quantified using Nikon's Eclipse Ti microscope with built-in NEARAS [24,25]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Nearas Technology For Quantification Of Immunohistochemistry Staining",
                    "paragraphs": [
                        "NEARAS (Melville, NY) was used to calculate the number of cells with HD5 staining in IHC tissue. A mean intensity threshold of 20 to 255 intensity units was established to eliminate a false-positive signal from background staining. A circularity parameter of 0.5 to 1 and equivalent diameter of 5–15 micrometer was used to select for cells. All threshold parameters were used in each image to count the number of HD5-positive cells in tissue samples."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "The Vanderbilt University Microarray Core Laboratory performed statistical analyses for the microarray. Transcriptome level fold changes and the significance of those changes were calculated using one way ANOVA with Bonferroni’s correction for multiple comparisons. Significantly changed transcripts were defined as having >2.0 fold expression change from controls and a Benjamini-Hochberg (BH) false discovery rate corrected ANOVA p-value <0.05.",
                        "All other statistical analyses were performed using GraphPad Prism v6 software [26]. qRT-PCR and IHC HD5 counts were examined by applying an unpaired two-tailed Student’s t-test with the Welch correction, respectively. Western blots were analyzed by ANOVA followed by Fisher’s test for multiple comparisons. Chi square tests were utilized for determining relatedness of HD5 levels to CC. For all statistical analyses, p< 0.05 indicated a statistical significance."
                    ],
                    "subsections": []
                },
                {
                    "title": "Dual Staining Of Human Α-Defensin-5 And Lysozyme",
                    "paragraphs": [
                        "DoubleStain IHC was performed on a Lab Vision autostainer 360 (Thermo fisher) using Abcam’s M&R on human tissue (DAB & AP/Red) staining kit (ab210059, Abcam Biotechnology, Cambridge, UK). The manufacture’s recommended conditions were used with the following modifications. The mouse anti-α-defensin 5 (sc-53997, Santa Cruz Biotechnolgy, Inc, Dallas, TX) and rabbit anti-lysozyme (ab-2408) were used at a 1:50 dilution in OP Quanto antibody Diluent (Thermo Fisher, Waltham, WA). Prior to addition of antibody for 45 minutes, tissues were incubated for 10 min with Utravision hydrogen peroxide block (Thermo Fisher) followed by a 5 min incubation with Ultravisoion Quanto protein block. A single incubation with Permanent Red was used for ileum tissue, whereas two consecutive 10 min permanent Red incubations were performed for colonic tissue. Following hematoxylin counter staining, tissue was exposed to Richard-Allen Scientific Blueing Reagent (Thermo Fisher). Antigen retrieval was performed in 1 mM EDTA pH 8.4, 0.05% Tween 20 for 20 minutes at 98°C (60°C preheat/70°C cool down) using the Labvision PT Module (Thermo Scioentific). Image color deconvolution was performed with Fiji ImageJ 1.51f (http://imagej.nih.gov/ij) using the Fast Red, Fast Blue and DAB built in stain vector plugin."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Nearly 30% Of Indeterminate Colitis Patients Cannot Be Delineated Into Uc Or Cc",
                    "paragraphs": [
                        "A retrospective investigation was conducted to identify a cohort of patients diagnosed with IC to determine if they could be properly delineated into UC or CC over time. We followed 21 patients who were diagnosed with IC between the years 2000–2007 and reevaluated in 2014. A mean surveillance follow-up period was 8.7 ±3.7 (range, 4–14) years. Fifteen of the 21 (71.4%) had their original diagnosis changed; 9 to UC (43%) and 6 to CC (28.5%). Six (28.5%) patients remained clinically inconclusive and retained their diagnosis of IC (Fig 1A). These data were collected in the absence of any type of biomarker."
                    ],
                    "subsections": []
                },
                {
                    "title": "Thirty Percent Of Restorative Proctocolectomy Operated Crohn’S Colitis Patients Were Misdiagnosed As Ulcerative Colitis",
                    "paragraphs": [
                        "A retrospective investigation was conducted to identify a cohort of patients that underwent RPC and IPAA surgery for a definitive UC diagnosis to determine if they had been misdiagnosed. We identified 67 such patients. A mean surveillance follow-up period was 9.4 (range, 6–13) years. A change in diagnosis to de novo Crohn’s disease of the ileal pouch was clinically observed in 20 (30%) patients (Fig 1B). In the other 47 (70%) cases, the initial diagnosis of UC remained clinically unchanged. These data were collected in the absence of any type of biomarker. Because of these results, we sought to determine if there are potential genes that may be used to better differentiate between UC and CC at first clinical biopsy and prior to any surgical intervention."
                    ],
                    "subsections": []
                },
                {
                    "title": "There Is Differential Expression Of Human Α-Defensin-5 In Inflammatory Bowel Disease",
                    "paragraphs": [
                        "We initially performed whole-transcriptome microarray with RNA extracted and pooled from human full thickness colon samples from UC and CC patients (n = 5) using the Affymetrix gene expression array according to the manufacturer’s instructions (Affymetrix, Santa Clara, CA) Tissues from diverticulitis (DV) were used as control. This analysis showed a total of 484 genes that were up- or down-regulated (≥ 2-fold) between the two diseases. Among the up-regulated genes were α-defensin-5, other antimicrobial peptides, and mucins (Table 1). HD5 was increased the most: 31-fold in CC vs. UC. A full list of the microarray results can be found in S2 Table.",
                        "To replicate these data in a different platform, an independent analysis by PCR array (NanoString Technologies Inc. Seattle, WA) was carried out on 5 different human full thickness colon samples from UC and CC patients. Although the NanoString array only specifically targeted inflammatory genes, the only gene to show up in both the microarray and the PCR array was HD5. The NanoString array determined that HD5 was increased 118-fold in CC vs. UC in these human samples, compared to 31-fold in the previous samples analyzed by microarray (Table 2).",
                        "To further validate these data, we assessed the expression of HD5 by semi-quantitative RT-PCR using RNA extracted from moderate CC and moderate UC tissues (n = 3). This analysis also showed a significant increase in transcript levels of HD5 in CC compared to UC (Fig 2A, SEM, p< 0.05). Several commercially available HD5 antibodies have been developed. Due to the sequence homology of the alpha defensin class of proteins, we tested a set of antibodies to assess specificity to HD5. We performed dot blots using commercially available antibodies against recombinant HD1-6. We determined that the monoclonal antibody from Santa Cruz Biotechnology, Inc. (Santa Cruz, CA) showed the highest level of specificity for HD5, and was therefore used in subsequent assays (S1 Fig). Next, we assessed the expression of HD5 by Western blotting (n≥ 10 for each disease state). Samples were run individually on western blots, with a combination of disease states on each blot, and we show an example of an individual sample per disease state in a representative blot (Fig 2B). When we take each individual sample into consideration across all western blots, protein densitometry analysis also shows significantly higher levels of HD5 in moderate and severe CC compared to all other disease states (Fig 2C, p< 0.0001). Finally, we examined the expression of HD5 in moderate disease activity of IBD and control tissues by IHC using FFPE sections. This analysis revealed that HD5 levels are indeed increased in CC (Fig 2G) when compared to DV, and UC and normal (NL) control tissue (Fig 2D, 2E and 2F). Quantification of the HD5 IHC staining spot counts by NEARAS revealed a 5.6-fold increase of HD5 in CC vs. UC (Fig 2H, p< 0.0001). We believe the IHC data explains the weak western blot banding patterns. Because the western blots were run with full-thickness samples, there is a low overall abundance of HD5 in the tissue; the IHC shows that it is much localized in the base of individual colonic crypts. Because of this, further analysis is done using IHC instead of western blots."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human Α-Defensin-5 Levels Are Aberrant In Indeterminate Colitis And Restorative Proctocolectomy Operated Patients",
                    "paragraphs": [
                        "All previous experiments indicate that HD5 levels are high in CC, but these samples were taken from patients who obtained a clear diagnosis of either UC or CC from the attending physician and pathologist. In order to determine if HD5 could be used to assess whether IC patients could be delineated into a diagnosis of either UC or CC, we assessed levels of HD5 in surgical pathology colectomy samples via IHC in patients described in Fig 1A. In each instance of a final diagnosis of CC, HD5 high NEARAS counts were in agreement with that diagnosis. We also found that when the 6 patients with unchanged IC diagnoses were analyzed via HD5 IHC NEARAS profile tests, 3 showed high HD5 count and agreed with the final diagnosis of CC (red font), and 3 low HD5 count and were in agreement with the final diagnosis of UC (green font) (Table 3).",
                        "Further, RPC and IPAA-operated patients described in Fig 1B who had a clinical change in diagnosis to de novo Crohn’s (n = 20) and those whose diagnoses did not change (n = 47) were also analyzed molecularly for HD5 levels via NEARAS IHC counts. The patients whose diagnosis remained unchanged showed only trace levels of HD5 (Fig 3A). Patients whose diagnoses clinically changed from UC to de novo Crohn’s showed prominent HD5 staining (Fig 3B). These images can be compared to normal ileum control (Fig 3C). Differential quantification of HD5 levels by NEARAS counts for UC RPC and IPAA-operated patients who did not have their original diagnoses changed vs. those with de novo Crohn’s (Fig 3A vs. 3B) were statistically significant (p<0.0001) (Fig 3D). In addition, statistical analysis to determine positive predictive values (PPVs) of HD5 in patient tissue are 95.8% for CC and only 76.9% for UC. Chi squared analysis shows significant relatedness between high levels of HD5 and a diagnosis of CC (p<0.0001). These data indicate that HD5 could be developed into a diagnostic tool to better distinguish CC from UC."
                    ],
                    "subsections": []
                },
                {
                    "title": "Aberrantly Regulated Human Α-Defensin-5 In Crohn’S Colitis Patients May Be Caused By Ectopic Colonic Crypt Paneth Cells",
                    "paragraphs": [
                        "HD5 is a Paneth cell product; therefore, we wanted to determine if Paneth cells were present in the colon crypt of Crohn’s colitis patients. All 20 UC RPC operated patients with de novo Crohn's showed pools of ectopic crypt PCs in the colectomy samples, as demonstrated by H&E representative photomicrography (Fig 4E). This was validated by IHC labeling of PCs using lysozyme by microscopy, which confirmed the abundant presence of PCs in CC colonic crypts (Fig 4H, arrow). To validate whether the pool of HD5 expressed in CC and in de novo Crohn’s colectomy samples was indeed coming from colonic epithelial crypt PCs, we used immunohistochemically detection of PC markers α-Defensin 5 (DEFA5) and lysozyme (LYZ) and double staining IHC to colocalize PCs and HD5 on colectomy samples. Lysozyme alone detects PCs. We demonstrate the presence of abundant crypt PCs in CC colectomy patients (Fig 4H) compared to all other colonic conditions analyzed (UC, DV, DVL and NL). Further, double staining analyses from de novo Crohn’s (Fig 5A and 5D), normal colon (Fig 5J) and normal-ileum/control (Fig 5G) are presented. Image deconvolutions are displayed vertically to evaluate lysozyme-specific permanent red (Fig 5B, 5E and 5H) and HD5-specific DAB (Fig 5C, 5F and 5I). The normal colon image (Fig 5J), which lacks PCs, was not further processed. The results reconcile and represent a consensus among treating physicians."
                    ],
                    "subsections": []
                },
                {
                    "title": "Human Α-Defensin-5 Is A Better Candidate Biomarker Than Paneth Cells For Crohn’S Colitis.",
                    "paragraphs": [
                        "Finally, we sought to determine if HD5 and Paneth cells were both upregulated in the normal, adjacent tissue of CC patients compared to UC patients (Fig 6). Immunohistochemistry for HD5 shows positive staining in the base of the crypts in both inflamed and normal, adjacent tissue of CC patient samples (Fig 6A). We were even able to see some positive HD5 staining when the crypt structure is abolished due to excessive inflammation and tissue damage (Fig 6A, patient WD-12919, arrows). Unsurprisingly, in UC tissue, we saw either very low levels of HD5 or no expression at all (Fig 6B). We were very surprised, however, to find that we could not see any Paneth cells in either the inflamed or normal adjacent tissues of any of the CC or UC patients surveyed (CC, n = 3; UC, n = 2) (Fig 6C and 6D). These results are surprising, considering our earlier experiments surveying Paneth cells in a larger number of patients (Fig 4). Because we can detect HD5 in the normal, adjacent tissue more readily than visualize Paneth cells, we believe that HD5 will serve as a better candidate biomarker than Paneth cells for CC."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "We analyzed colectomy surgical pathology samples of patients with unambiguous CC and UC undergoing colectomy in connection with RPC and IPAA [6,7]. We identified and compared those protein profiles which had the necessary (i) specificity; (ii) sensitivity; (iii) discriminatory; and (iv) predictive capacity to determine the heterogeneity of IBD [6,7]. We were able to molecularly delineate UC and CC with molecular signatures of HD5 using IHC and quantified by NEARAS. Alpha-Defensins HD5 and HD6 are PC products and their altered expression has been linked to IBD pathogenesis.",
                "Our Paneth cell data is interesting, and further work needs to be done to determine the role of Paneth cells in CC, specifically. Because HD5 is a Paneth cell product, we were surprised that we could not visualize PCs in these tissues even though we could detect HD5 in the same tissue (Fig 6), especially compared to earlier experiments showing high levels of PCs in all CC patients surveyed (Fig 4). In future experiments, we want to determine what cellular pathways are activated in the stem cells of the CC crypt, and if the levels of inflammation and/or severity of disease is important to when and how PCs appear in CC. These experiments are in progress. Whether the PCs are essential for stem cell maintenance in vivo remains debatable [27].",
                "To date, there is no diagnostic gold standard tool for IBD. Differentiating UC and CC among patients with IC has remained painstaking and is a major challenge in endoscopic medicine and colorectal surgery [1,12,28,29]. Clinicians use an inexact classification system of clinical, endoscopy, radiologic, and histopathology findings in order to diagnose CC and UC [21,30,31]. Even with a combination of these diagnostic modalities, up to 15% of IBD patients are labeled as IC when no definitive evaluations can be made [13,30,32]. In addition, CC is mistakenly diagnosed and RPC and IPAA-operated as definitive UC in another 15% of IBD patients because of overlap in the clinical, endoscopic, radiological and histologic findings [12,33–36]. Further, most IC patients who undergo RPC and IPAA surgery for presumed UC are subsequently found to develop a recurrent de novo Crohn’s disease in the ileal pouch [1,12,33]. This is a serious consequence that may hinder the restoration of intestinal continuity and its intractable nature leads to pouch failure, often requiring pouch diversion or excision with a permanent terminal-ileostomy, resulting in negative psycho-sociological implications and poorer quality of life [1,29,31,36–41]. Curative treatment for UC is often surgical [42]. Success of RPC and IPAA surgery is largely dependent on careful patient selection combined with meticulous surgical technique and diagnostic accuracy [9–11,13]. Available clinical presentations and experience suggest that it is difficult to identify patients with CC who are likely to have a successful outcome after RPC and IPAA surgery [10,13,34,43]. However, in highly selected patients with CC, RPC and IPAA has been indicated [44–47]. If we are able to develop HD5 into a molecular marker, it may ultimately be used to select those patients with CC who are potential candidates for this sphincter preserving operation. Thus, RPC operation may be considered and should remain a careful option for certain subgroup of patients with CC, but an acceptable care option for patients with UC and for those IC patients predicted to develop UC [9,42].",
                "Our studies of HD5 as a candidate biomarker for CC suggest it could be a diagnostic signature to efficiently distinguish CC from UC. Newly published data shows that patients with small bowel Crohn's disease (Crohn’s ileitis) are characterized with a deficiency of HD5, as shown by a reduced expression and secretion of the Paneth cell HD5, a fundamental feature of Crohn’s ileitis [48–51]. Our data, in CC, the reverse is true. We found Paneth cell HD5 to be a predominantly expressed antimicrobial peptide. This indicates that definitive CC and Crohn’s ileitis may have distinct etiologies and mechanisms. In these studies, we have reconciled all IC patient samples into UC and CC using molecular biomarker, HD5, and verified the reconciliation by patient outcomes (Fig 1 and Table 3).",
                "Accurately distinguising CC from UC is of utmost importance when determining the candidacy of a patient for RPC [1,42]. Early diagnostic accuracy of IBD will lead to timely appropriate medical options. We have identified that HD5 can differentiate CC and UC and reclassify IC into CC. In addition to distinguishing the colitides, HD5 could objectively be used to evaluate biophysiological processes and therapeutic outcomes and potentially play a pivotal role in IBD clinics as an attractive, non-invasive avenue [52,53]."
            ],
            "subsections": []
        }
    ]
}