{
    "id": "US20130137595",
    "authors": [
        "Richard C. Zangar",
        "Susan M. Varnum"
    ],
    "title": "BIOMARKERS FOR LYMPHOMA",
    "date": "2012-11-30 00:00:00",
    "abstract": "A biomarker, method, test kit, and diagnostic system for detecting the presence of lymphoma in a person are disclosed. The lymphoma may be Hodgkin's lymphoma or non-Hodgkin's lymphoma. The person may be a high-risk subject. In one embodiment, a plasma sample from a person is obtained. The level of at least one protein listed in Table S3 in the plasma sample is measured. The level of at least one protein in the plasma sample is compared with the level in a normal or healthy subject. The lymphoma is diagnosed based upon the level of the at least one protein in the plasma sample in comparison to the normal or healthy level.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "This invention relates to biomarkers for lymphoma. More specifically, this invention relates to plasma biomarkers for detecting Hodgkin's lymphoma or non-Hodgkin's lymphoma."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field of biomarkers for lymphoma"
                    ],
                    "num_characters": 173,
                    "outline_medium": [
                        "define technical field of biomarkers for lymphoma"
                    ],
                    "outline_short": [
                        "define technical field of biomarkers for lymphoma"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "In the presence of human immunodeficiency virus (HIV) infection, non-Hodgkin's lymphoma (NHL) and Kaposi sarcoma (KS) were the first malignancies used to define acquired immune deficiency syndrome (AIDS). People with HIV infection are also at increased risk of a number of other cancers. As people with HIV infection live longer due to highly active antiretroviral therapy (HAART), the incidence of these non-AIDS-defining cancers has increased among HIV-infected individuals. One of the most common of these malignancies is Hodgkin's lymphoma (HL), and it has been estimated that people with HIV/AIDS have a 5.6- to 14.7-fold increased risk of developing HL compared to the general population.",
                        "HL is a solid tumor that is comprised of no more than 2% of the cancerous B lymphocytes. Instead, these lymphocytes secrete a wide range of cytokines that attract numerous normal leukocytes that then comprise the large majority of the tumor. Thus, HL is largely seen as an uncontrolled inflammatory disease. In people with immunosuppression, HL is believed to result from the Epstein-Barr virus (EBV). EBV is present in nearly all adults, but typically only causes HL when the immune system is suppressed, such as with HIV infection.",
                        "The increase in non-AIDS-defining cancers has created a greater need for the early detection of these malignancies in this susceptible population. It seems likely that HIV-infected individuals would benefit from a routine, non-invasive screen for HL, but no such screen exists. Rather, HL patients are identified after they become symptomatic. Chemotherapy and radiation therapy have been shown to be very effective at causing HL remission, but morbidity and mortality associated with these treatments is substantial. Early-stage HL is generally treated less intensively, suggesting that early detection of HL would result in less treatment-related toxicity. Cancer treatment strategies for HIV-infected individuals with HL are the same as for non-AIDS subject, but HIV-infected patients require additional vigorous supportive care (HAART, antifungals, neutrophil-simulating growth factors).",
                        "What is needed is a blood-based test to detect lymphoma earlier, when the tumor burden is much smaller, which would allow for less severe therapy and reduce long-term mortality and morbidity associated with current treatments."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce lymphoma and its relation to HIV",
                        "describe limitations of current lymphoma detection methods",
                        "highlight need for early detection of lymphoma",
                        "motivate development of blood-based test for lymphoma"
                    ],
                    "num_characters": 2350,
                    "outline_medium": [
                        "motivate need for lymphoma detection",
                        "describe current limitations of lymphoma treatment"
                    ],
                    "outline_short": [
                        "motivate need for early detection of lymphoma"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "In one embodiment of the present invention, a biomarker for detecting lymphoma in a person is disclosed. The biomarkers include at least one protein listed in Table S3.",
                        "The lymphoma may be Hodgkin's lymphoma or non-Hodgkin's lymphoma. The at least one protein is found in plasma, and the person is a high-risk subject.",
                        "In another embodiment of the present invention, a method of detecting lymphoma in a person is disclosed. The method includes obtaining a plasma sample from the person. The method further includes measuring the level of at least one protein listed in Table S3 in the plasma sample. The method also includes comparing the level of the at least one protein in the plasma sample with the level in a normal or healthy subject; and diagnosing the lymphoma based upon the level of the at least one protein in the plasma sample in comparison to the normal level. In one embodiment, the obtaining a plasma sample from the person further comprises providing a reagent that reacts with proteins in the plasma sample to detect the presence of lymphoma. The reagent may be an antibody.",
                        "In another embodiment of the present invention, a test kit for diagnosing lymphoma in a person is disclosed. The test kit includes an antibody-based assay that measures a plurality of plasma biomarkers selected from the group consisting of the biomarkers of Table S3; and instructions for conducting the antibody-based assay.",
                        "In another embodiment of the present invention, a diagnostic system for detecting the presence of lymphoma in a person is disclosed. The system includes a plurality of protein assays measuring a plurality of plasma biomarkers. The plasma biomarkers are selected from the biomarkers of Table S3. Concentration levels or peak intensity values of at least one of the plasma biomarkers is modified by the presence of the lymphoma in the person. The system also includes a detector for detecting the plasma biomarkers.",
                        "In one embodiment, the detector is a mass spectrometer. In another embodiment, the detector includes at least one labeled antibody specific for a biomarker of Table S3."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce biomarkers for detecting lymphoma",
                        "describe method of detecting lymphoma using biomarkers",
                        "outline test kit for diagnosing lymphoma",
                        "summarize diagnostic system for detecting lymphoma"
                    ],
                    "num_characters": 2105,
                    "outline_medium": [
                        "introduce biomarkers for detecting lymphoma",
                        "outline methods and systems for detecting lymphoma"
                    ],
                    "outline_short": [
                        "summarize biomarkers and methods for detecting lymphoma"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS",
                    "paragraphs": [
                        "The present invention is directed to methods, diagnostic systems, kits, and biomarkers for detecting lymphoma in a patient. These biomarkers may form the basis for a blood-based test for early detection of lymphoma and may be used clinically.",
                        "To identify candidate biomarkers for Hodgkin's Lymphoma (HL) detection, plasma samples from HIV-infected patients were analyzed, with or without HL, using accurate mass tag and time (AMT) tag proteomics, and thereby identified a set of 60 proteins. As a group, these proteins are associated with both cancer and inflammation and therefore are promising candidate biomarkers for early detection of HL."
                    ],
                    "subsections": [
                        {
                            "title": "Materials and Methods",
                            "paragraphs": [
                                "Ethics Statement.",
                                "The study protocol was approved by the George Washington University Medical Center Institutional Review Board. Written informed consent was obtained from all study participants. Additional approval from the PNNL Institutional Review Board, which included a review of the George Washington University Medical Center IRB approval, was obtained before samples were transferred to PNNL.",
                                "Human Subjects and Sample Processing.\n\n\n- - Frozen, human plasma samples were provided by the AIDS and Cancer\n    Specimen Resource (San Francisco, Calif.). The control subjects\n    (HIV-infected without HL) were chosen to approximately match the\n    cases (HIV-infected with HL) based on gender and age (Table 1). In\n    most cases, plasma samples were collected from HIV-infected subjects\n    with HL that had not received HL chemotherapy within at least 30\n    days (n=12). Information on chemotherapy was unknown for some cases\n    (n=9) and one sample was known to have been collected within 30 days\n    of chemotherapy. For all processing and analytical steps, samples\n    were blocked based on HL status and randomized. The 12 most abundant\n    plasma proteins were depleted using the Proteome Purify™ 12\n    immunodepletion resin (R&D Systems), according to the manufacturer's\n    protocol. The remaining plasma proteins were precipitated using\n    ice-cold trichloroacetic acid at a final concentration of 10%,\n    followed by overnight incubation at 4° C. and centrifugation at\n    14,000×g for 5 minutes. The pellet was washed with cold acetone and\n    dried at room temperature for 5 minutes prior to suspension in 25 μL\n    of 100 mM ammonium bicarbonate, 8 M urea, 2 M thiourea and 5 mM\n    dithiothreitol, and heating to 60° C. for 30 min. The samples were\n    then diluted 4-fold with 100 mM ammonium bicarbonate and CaCl₂ was\n    added to 1 mM. Methylated, sequencing-grade trypsin (Promega,\n    Madison, Wis.) was added at a substrate-to-enzyme ratio of 50:1\n    (mass:mass) and incubated at 37° C. for 15 h. Peptides were then\n    purified by binding to a 1 mL SPE C₁₈ column (Supelco, Bellefonte,\n    Pa.) and eluting with 1 mL of methanol. After concentration in a\n    SpeedVac, the samples were dissolved in 25 mM ammonium bicarbonate\n    and frozen at −20° C. until analysis.",
                                "Liquid Chromatography-Mass Spectrometry.",
                                "Peptide samples were analyzed using a custom-built, automated, high-pressure nanocapillary liquid chromatography (HPLC) system coupled on-line to a LTQ-Orbitrap mass spectrometer (Thermo Fisher Scientific). The reversed-phase capillary column was prepared by slurry packing 3-μm Jupiter C18 bonded particles (Phenomenex, Torrence, Calif.) into a 65-cm-long, 75-μm-inner diameter fused silica capillary (Polymicron Technologies, Phoenix, Ariz.). The mobile phase consisted of 0.2% acetic acid and 0.05% trifluoroacetate in water (A) and 0.1% trifluoroacetate in 90% acetonitrile, 10% water (B). After loading 5 μL (2.5 μg total) of peptides onto the column, the mobile phase was held at 100% A for 50 min. Exponential gradient elution was performed by increasing the mobile phase composition from 0 to 55% B over 115 min. The HPLC column was coupled to the mass spectrometer by an in-house manufactured electrospray ionization interface. The heated capillary inlet temperature and electrospray voltage were 200° C. and 2.2 kV, respectively. Data were acquired for 100 min, beginning 65 min after sample injection (15 min into start of buffer B gradient). Orbitrap spectra (AGC 5×105) were collected from 400-2000 m/z at a resolution of 100,000.",
                                "The mass spectra were analyzed using the AMT tag approach. The peak lists for each analysis were matched against a mass tag database containing 30,573 tryptic peptides that were previously identified from LC-MS/MS analyses of human plasma. An estimate of the false-positive rate for peptide identifications in our analysis, which was <6%, was obtained by searching the sequence-reversed database.",
                                "Statistics.",
                                "There were 76 mass spectrometry runs included in the proteomics data, including at least two analyses for each of the 36 samples. A total of 6460 unique peptides were initially identified. The data-analysis process first removed peptides for which there were insufficient identifications to perform a statistical analysis, which reduced the peptide number to 3814. Next, the peptide abundance measurements were normalized via regression based on all the peptide signals for that mass spectrometer run and then averaged across replicate runs for each sample. The averaged signal intensities were normalized for each sample based on the median absolute deviation of the signal intensity for all peptides identified in each sample. Finally, the data were subjected to two statistical tests to determine peptides having differential abundance due to either signal intensities or presence-absence. A non-parametric Mann-Whitney test was performed using MatLab 2009 to compare signal intensities. Differences in detection incidence was determined using a modified Chi-square test, called a G-test. Using either test, 647 peptides were identified with a p-value of 0.05 or less.",
                                "Normalized peptide abundance values were used for protein inference; the peptide abundance measurements were weighted and combined to calculate the relative protein abundances in the two groups using RRollup within DAnTEm. Only proteins represented by two or more unique peptides were analyzed. Peptide redundancy was reduced with Protein Prophet and by manually selecting characterized proteins over predicted or hypothetical proteins.",
                                "Ingenuity Pathway Analysis.",
                                "Differentially regulated proteins were analyzed for common biological functions using Ingenuity Pathway Analysis (IPA; Ingenuity Systems, Mountain View, Calif.) software. To infer significant biological functions, all proteins that were significantly different between groups and their corresponding ratiometric values (HL+/HL−; minimum of 1.5-fold change) were analyzed by IPA. The significance values for biological function were determined using the right-tailed Fisher's Exact Test."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe ethics statement",
                                "outline human subjects and sample processing",
                                "detail plasma sample preparation",
                                "describe liquid chromatography-mass spectrometry",
                                "outline data analysis using AMT tag approach",
                                "describe statistics and data normalization",
                                "perform non-parametric Mann-Whitney test",
                                "perform modified Chi-square test",
                                "analyze protein inference",
                                "describe Ingenuity Pathway Analysis",
                                "outline results of proteomics analysis",
                                "discuss biological functions of identified proteins"
                            ],
                            "num_characters": 6127,
                            "outline_medium": [
                                "describe ethics statement",
                                "outline human subjects and sample processing",
                                "describe protein depletion and precipitation",
                                "outline liquid chromatography-mass spectrometry",
                                "describe data analysis and statistics",
                                "perform Ingenuity Pathway Analysis"
                            ],
                            "outline_short": [
                                "describe ethics statement and sample processing",
                                "outline liquid chromatography-mass spectrometry",
                                "explain statistics and data analysis"
                            ]
                        },
                        {
                            "title": "Results and Discussion",
                            "paragraphs": [
                                "To identify potential circulating biomarkers for HL in a susceptible population, we used the AMT tag LC-MS approach to compare the plasma proteomes from 36 HIV-infected patients with or without HL. The HIV-infected patients without HL served as the control group to identify protein changes associated with HL. The relatively high-throughput characteristics of this approach enabled duplicate analyses of each of the 36 plasma samples, thereby improving data quality. The subject characteristics are described in Table 1. The proteomics analysis identified 3814 peptides across all of the samples, which corresponded to 629 proteins. Of these 3814 peptides, 647 were significantly different between the two disease states, which corresponded to 152 proteins (Tables S1 and S2). Sixty of these proteins met our criteria of being both significantly different between the two groups and having at least 1.5-fold difference in the normalized signal (Table S3). This protein list included well-known acute-phase inflammatory proteins, including C-reactive protein and serum amyloid proteins. To better identify common biological functions within these 60 proteins, Ingenuity Pathway Analysis (IPA) was utilized. In general, proteins that were associated with immune responses and cancer were highly represented in the list of significantly altered biological functions. Many of the proteins we identified are known to be secreted by white blood cells, such as those that infiltrate HL tumors, or by the liver, an important component of the reticuloendothelial system (Table S3). Similarly, the use of IPA to identify common biological functions across the 60 proteins identified “inflammatory response” and “cancer” (Table 2), suggesting that these proteins have a biological relationship with HL. Since only 1% to 2% of the mass of an HL tumor is composed of the cancerous lymphocytes, it may be that the proteins we identified did not originate from these relatively rare cells. Rather, these proteins may be the product of a systemic inflammatory response associated with HL or due to noncancerous leukocytes that form ˜99% of the tumor mass.",
                                "At least three of the proteins we identified have been previously reported to be increased in HL subjects compared to healthy controls, including C-reactive protein, beta-2-microglobulin and lactate dehydrogenase. These prior studies examined HL in the general population, and did not focus on HIV-positive subjects. In addition, these studies measured these proteins by immunoassay, providing analytical verification as well. In the current study, the presence of HIV in the study population could be a confounding factor. For example, the HL subjects appeared to have slightly more advanced cases of HIV, on the average, as suggested by a trend (p=0.07, t-test) towards lower CD4-positive cell counts (Table 1), a result which is consistent with slightly more advanced immunosuppression. Even so, since three of the proteins we identified are increased in HL subjects without HIV, it seems clear that the results for these proteins, at least, are not confounded by differential states of HIV infection. Overall, the present study independently validates three plasma biomarkers for HL and identifies an additional 57 novel plasma proteins that appear to be promising candidate biomarkers based on their relationships with cancer and inflammation. These candidate biomarkers remain to be validated in regards to their association with HL.",
                                "The present invention has been described in terms of specific embodiments incorporating details to facilitate the understanding of the principles of construction and operation of the invention. As such, references herein to specific embodiments and details thereof are not intended to limit the scope of the claims appended hereto. It will be apparent to those skilled in the art that modifications can be made in the embodiments chosen for illustration without departing from the spirit and scope of the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize results of proteomics analysis",
                                "describe identified proteins and their functions",
                                "discuss inflammatory response and cancer",
                                "validate previously reported biomarkers",
                                "discuss potential confounding factors",
                                "highlight novel plasma proteins as candidate biomarkers",
                                "conclude results and discussion"
                            ],
                            "num_characters": 3998,
                            "outline_medium": [
                                "summarize proteomics analysis results",
                                "discuss biological functions of identified proteins",
                                "validate and discuss results in context of prior studies"
                            ],
                            "outline_short": [
                                "discuss results of proteomics analysis and biological functions"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce methods and systems for detecting lymphoma"
                    ],
                    "num_characters": 644,
                    "outline_medium": [
                        "describe methods and materials for identifying biomarkers"
                    ],
                    "outline_short": [
                        "describe methods and materials for identifying biomarkers"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A biomarker for detecting lymphoma in a person, comprising at least one protein listed in Table S3.",
        "2. The biomarker of claim 1 wherein the lymphoma is Hodgkin's lymphoma or non-Hodgkin's lymphoma.",
        "3. The biomarker of claim 1 wherein the at least one protein is found in plasma.",
        "4. The biomarker of claim 1 wherein the person is a high-risk subject.",
        "5. A method of detecting lymphoma in a person, comprising:\na. obtaining a plasma sample from the person;\nb. measuring the level of at least one protein listed in Table S3 in the plasma sample;\nc. comparing the level of the at least one protein in the plasma sample with the level in a normal or healthy subject; and\nd. diagnosing the lymphoma based upon the level of the at least one protein in the plasma sample in comparison to the normal or healthy level.",
        "6. The method of claim 5 wherein the lymphoma is Hodgkin's lymphoma or non-Hodgkin's lymphoma.",
        "7. The method of claim 5 wherein the person is a high-risk subject.",
        "8. The method of claim 5 wherein the obtaining a plasma sample from the person further comprises providing a reagent that reacts with proteins in the plasma sample to detect the presence of lymphoma.",
        "9. The method of claim 8 wherein the reagent is an antibody.",
        "10. A test kit for diagnosing lymphoma in a person comprising:\na. an antibody-based assay that measures a plurality of plasma biomarkers selected from the group consisting of the biomarkers of Table S3; and\nb. instructions for conducting the antibody-based assay.",
        "11. The test kit of claim 10 wherein the lymphoma is Hodgkin's lymphoma or non-Hodgkin's lymphoma.",
        "12. The test kit of claim 10 wherein the person is a high-risk subject.",
        "13. A diagnostic system for detecting the presence of lymphoma in a person, the system comprising:\na. a plurality of protein assays measuring a plurality of plasma biomarkers, wherein the plasma biomarkers are selected from the biomarkers of Table S3, wherein concentration levels or peak intensity values of at least one of the plasma biomarkers is modified by the presence of the lymphoma in the person; and\nb. a detector for detecting the plasma biomarkers.",
        "14. The diagnostic system of claim 13 wherein the detector is a mass spectrometer.",
        "15. The diagnostic system of claim 13 wherein the detector comprises at least one labeled antibody specific for a biomarker of Table S3.",
        "16. A method of monitoring tumor response to treatment in a lymphoma patient, comprising:\na. obtaining a baseline plasma sample from the patient;\nb. measuring the level of at least one protein listed in Table S3 in the baseline plasma sample;\nc. administering therapy to the patient;\nd. thereafter obtaining a second plasma sample from the patient;\ne. measuring the level in the second plasma sample; and\nf. comparing the levels; wherein a changed level after treatment indicates a therapeutic response.",
        "17. The method of claim 16 wherein the therapy is chemotherapy or radiation therapy.",
        "18. The method of claim 16 wherein the lymphoma is Hodgkin's lymphoma or non-Hodgkin's lymphoma.",
        "19. A method of monitoring patient compliance with a drug treatment protocol, comprising:\na. obtaining a plasma sample from the patient;\nb. measuring the level of at least one protein listed in Table S3 in the sample; and\nc. determining if the level is increased in the patient sample compared to the level in a control untreated sample; wherein a change in protein concentration indicates patient compliance with the drug treatment protocol."
    ]
}