{
    "id": "US20110009604",
    "authors": [
        "Ralph Zahn",
        "Ahmed El Gedaily",
        "Susanne Franitza",
        "Nicola Franscini",
        "Ulrich Matthey"
    ],
    "title": "Method for Concentrating, Purifying and Removing Prion Protein",
    "date": "2006-10-25 00:00:00",
    "abstract": "The present invention relates to a method for concentrating and/or purifying prion PrPSc proteins by contacting prion PrPSc proteins with sepharose under conditions that allow for the specific and high affinity binding of the sepharose to the prion PrPSc proteins and removing the unbound non-prion proteins from the sepharose, as well as the same method for removing prion PrPSc proteins from body fluids by contacting body fluids with sepharose under conditions that allow for the specific and high affinity binding of the sepharose to the prion PrPSc proteins and removing the body fluid from said sepharose. In addition, the present invention is directed to a method for separating and/or enriching prion PrPSc proteins from PrPC proteins by contacting prion PrPSc proteins and PrPC proteins with a ligand-modified sepharose under conditions that allow for the specific and high affinity binding of the sepharose part to the prion PrPSc proteins and the binding of the ligand part of the sepharose to PrPC proteins, adding a selective release agent to the sepharose-bound proteins under conditions that allow for the release of non-prion proteins and PrPC proteins from the ligand part of the sepharose but not for the release of the prion PrPSc proteins, and removing the non-prion proteins and PrPC from the sepharose. Another aspect of the present invention concerns the use of the before-mentioned methods for concentrating, purifying and/or removing prion PrPSc proteins.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "The present invention relates to a method for concentrating and/or purifying prion PrPSc proteins by contacting prion PrPSc proteins with sepharose under conditions that allow for the specific and high affinity binding of the sepharose to the prion PrPSc proteins and removing the unbound non-prion proteins from the sepharose, as well as the same method for removing prion PrPSc proteins from body fluids by contacting body fluids with sepharose under conditions that allow for the specific and high affinity binding of the sepharose to the prion PrPSc proteins and removing the body fluid from said sepharose.",
                "In addition, the present invention is directed to a method for separating and/or enriching prion PrPSc proteins from PrPC proteins by contacting prion PrPSc proteins and PrPC proteins with a ligand-modified sepharose under conditions that allow for the specific and high affinity binding of the sepharose part to the prion PrPSc proteins and the binding of the ligand part of the sepharose to PrPC proteins, adding a selective release agent to the sepharose-bound proteins under conditions that allow for the release of non-prion proteins and PrPC proteins from the ligand part of the sepharose but not for the release of the prion PrPSc proteins, and removing the non-prion proteins and PrPC proteins from the sepharose.",
                "Another aspect of the present invention concerns the use of the before-mentioned methods for concentrating, purifying and/or removing prion PrPSc proteins.",
                "The Sequence Listing submitted in text format (.txt) on Sep. 24, 2010, named “29243U_Sequence_Listing.txt, (created on Sep. 16, 2010, 2 KB), is incorporated herein by reference."
            ],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Native prion protein, referred to as “PrPC” for cellular prion protein, is widely distributed throughout nature and is particularly well conserved in mammals. The conversion of the native PrPC protein to the infectious protein, referred to as “PrPSc” for scrapie prion protein or as “PrPres” for proteinase K resistant prion protein, is believed to lead to the propagation of various diseases. Examples of prion-associated diseases include, for example, kuru and Creutzfeldt-Jakob disease (CJD) in humans; scrapie in sheep, bovine spongiform encephalopathy (BSE) in cattle, transmissible mink encephalopathy and wasting disease in deer and elk.",
                        "BSE is a form of mad cow disease and is transmissible to a wide variety of other mammals including humans. The human form of BSE is referred to as new variant Creutzfeldt-Jakob disease or vCJD. An estimated 40 million people in the United Kingdom ingested BSE-contaminated beef during the mid- to late 1980s. Because the incubation period for the orally transmitted disease may be 20-30 years, the true extent of this disease may not become apparent until after 2010.",
                        "In addition to the ingestion of infected beef, there is a potential for the transmission of prion-associated diseases among humans by blood transfusion. Since there are now (two) direct indications of prion transmission by blood transfusions, there is increasing concern about the security of blood products. Also, the infected prions have already been shown to be present on lymphocytes, and there is also evidence indicating that prions are present in the plasma in addition to being cell-associated. Furthermore, animals can become infected with prion-associated diseases by grazing on prion-contaminated soil or by ingesting hay that contains prion-infected hay mites.",
                        "The ability to detect and also to remove prion proteins from a sample is of profound importance in the food industry and the medical sector.",
                        "For detecting prion proteins a number of assays based on prion-specific antibodies have been developed. However, these assays require prior enrichment due to the very low concentrations of prion proteins in nature and in mammals, particularly in human blood, human or other mammalian organs for transplantation and in meat and processed foods derived from mammals.",
                        "A number of approaches for purifying prion proteins and derivatives thereof have been developed during the last decade. Affinity chromatography plays a major role as a suitable purification technique. In particular, sepharose gels have proven themselves as suitable support material for carrying ligands for affinity chromatography.",
                        "Grathwohl et al. (Arch. Virol. (1996) 141: 1863-1874) disclose the enrichment of PrPSc from mouse spleen of Scrapie-infected mice shortly after infection through immobilized metal (Cu2+) affinity chromatography (IMAC) employing divalent copper ion sepharose as support material. However, they found that for the diagnosis at the earliest stage of infection, extraction of PrPSc by salting out with Sarkosyl and NaCl was more effective.",
                        "WO 01/77687 compares the removal of PrPC prion proteins from a partially purified soluble preparation using specific hexapeptide ligands attached to sepharose with the removal achieved by the same sepharose material alone as reference material. SP-Sepharose and DEAE-Sepharose alone demonstrate a binding to PrPC that is 100 times lower than that achieved with the hexapeptide ligand-bound resins. As a matter of fact, the document states in this respect:\n\n\n- - “At pH 7.4 DEAE sepharose also does not appear to bind PrP^(C).”",
                        "The low binding of SP Sepharose to PrPC is still more than 20 fold reduced over the binding of PrPC to silica, i.e. to an unspecific binder. From the fact that DEAE sepharose does not bind at all and that SP sepharose binds with very low and unspecific affinity to PrPC, it is clear that it is the SP (sulfopropyl group) part of the SP sepharose that is responsible for the low binding affinity. Hence, WO 01/77687 actually teaches the use of sepharose as an inert solid support for PrPC-specific ligands and that the SP part of SP sepharose can actually bind PrPC with an affinity more than 20 fold less than that of the unspecific binder silica.",
                        "The document of P. R. Foster (Transfusion Medicine, 1999, 9, 3-14) was published in 1999, a time when prion research was still in its beginning and the scientific community had no clue regarding the physicochemical composition of prion PrPSc proteins and the detection of the causative “agent” of transmissible spongiform encephalopathy (TSE) still relied on elaborate and error prone animal studies with little quantitative significance. Furthermore, the document notes that PrPSc will generally tend to precipitate into the solids phase in a precipitation process due to its “very low aqueous solubility”. In addition, it states that PrPSc has strong hydrophilic and hydrophobic domains that will adhere to many diverse surfaces and, in particular, will interact with chromatographic and filtration media used for the production of plasma products. The document informs that ionic, cationic, hydrophobic and a number of not identified resins will bind PrPSc. Even a cellulose-acetate membrane for filtration specifically pretreated to prevent adsorption will interact with PrPSc. However, all studies presented in this document were based on a reduction of TSE infectivity and did not demonstrate any actual binding of PrPSc to any adsorbents. It is specifically noted that next to adsorbent binding a reduced PrPSc activity can also result from other mechanisms, e.g. (i) precipitation of PrPSc in solution and mechanical retention by solids such as filters and chromatographic support materials and (ii) inactivation of PrPSc by contact to solids and/or with time. In this respect the author noted in his discussion of chromatographic materials that all examined adsorbents resulted in separation of PrPSc—\n\n\n- - “ . . . despite the use of different ligands, matrices and\n    principles of adsorption.”",
                        "Table 1 of this document also discloses a weak reduction in PrPSc infectivity for anionic, cationic and hydrophobic ligated sepharoses when compared to other adsorbents. However, the document does not disclose any material or method for practicing its teaching relating to sepharose itself nor does it refer to any other publicly available reference for these sepharose-related embodiments. Hence, the results relating to sepharose-based adsorbents lack an enabling disclosure. Furthermore, the results of table 1 are contradicted by the specification of this document where it was demonstrated that the employed SP sepharose has a high binding affinity while Q sepharose has essentially no binding affinity to PrPSc (Table on page 28). Regarding the fidelity of the results the author notes himself:\n\n\n- - “Much remains to be learned concerning the physicochemical\n    properties of TSE agents in general ( . . . ) and nvCJD in\n    particular. In the absence of such data it is inevitable that\n    uncertainty will exist over the ability of particular process steps,\n    either individually or in combination, to fully remove any nvCJD\n    agent which may be present.” (emphasis added)",
                        "In other words, the author P. R. Foster himself recognized that in 1999 there were many inherent problems associated with the investigation of the potential of plasma fractionation steps to effectively reduce PrPSc and that the results of this document must be viewed as speculative and preliminary in said context.",
                        "A particularly elegant, sensitive and highly selective method for purifying and/or detecting human or animal prion proteins is based on the reversible aggregation and dissociation of prion proteins or derivatives thereof with one or more prion repeat structures that oligomerize with prion proteins at a pH of 6.2 to 7.8 and dissociate again at a pH of 4.5 to 5.5. For example, proteins with prion repeat structure(s) attached to solid support can oligomerize with prion proteins and thereby detect or remove these (PCT/EP2004 003 060).",
                        "At present, there is still a need in the art for further simple methods that concentrate, purify and/or remove prion PrPSc proteins in a simple, cost effective, highly selective and effective manner.",
                        "Due to the same amino acid sequence of PrPSc and PrPC proteins both are typically concentrated and enriched together and then separated by proteinase K digestion at a later stage wherein only PrPC proteins are selectively digested while PrPSc proteins remain proteinase resistant.",
                        "Hence, there is also a need for efficiently separating PrPSc from PrPC proteins other than by selective enzyme digestion.",
                        "Therefore, the object underlying the present invention is the provision of a simple, low cost, efficient and highly selective method for concentrating, purifying and/or removing PrPSc.",
                        "Another object is the provision of a simple, low cost, efficient and highly selective method for separating PrPSc from PrPC proteins.",
                        "The object underlying the present invention is solved by a method for concentrating and/or purifying prion PrPSc proteins and/or functional derivatives thereof, comprising the following steps:\n\n\n- a) contacting prion PrP^(Sc) proteins and/or functional derivatives\n  thereof with sepharose under conditions that allow for the specific\n  and high affinity binding of said sepharose to the prion PrP^(Sc)\n  proteins and/or functional derivatives thereof,\n- b) removing the unbound non-prion proteins from the sepharose,  \n  wherein the sepharose is preferably not a Cu²⁺-chelating sepharose.",
                        "It was surprisingly found that sepharose by itself (i.e. as such, naked, with inactivated, removed, masked ligands) has a specific and high binding affinity to PrPSc proteins and/or functional derivatives thereof. Therefore, the binding of sepharose to PrPSc proteins and/or functional derivatives thereof is sufficient for their concentration and/or purification. One merely has to remove the unbound non-prion proteins from said sepharose.",
                        "The term “specific and high affinity binding of sepharose to prion PrPSc” as used herein is meant to indicate that the sepharose as such (i.e. the sepharose core but not any ligands thereon) binds specifically to PrPSc but not to PrPC. Preferably, specific binding of sepharose in the context of the invention means the binding of sepharose as such to PrPSc multimers but not to PrPC. The term high affinity binding in this respect is meant to refer to a binding affinity relating to a dissociation constant of 10−6 to 10−12 M or lower, preferably 10−8 to 10−12 M or lower. The skilled person can easily determine a specific and high binding affinity of a given sepharose to prion PrPSc by routine and simple binding assays. For example, one such assay would comprise the following steps:\n\n\n- - a) providing the sepharose to be assayed and removing, inactivating\n    and/or masking any ligands on said sepharose core if present,\n  - b) diluting the PrP^(Sc) used to a concentration that will avoid\n    unspecific removal, e.g. precipitation, unspecific binding, etc.,\n  - c) incubating the sepharose of a) and PrP^(Sc) of b) in a suitable\n    buffer under conditions and for a time that will allow for binding\n    to each other,\n  - d) one or more washing step(s), preferably 3 to 10 buffer volumes\n    incubation buffer, for washing out any unbound protein from the\n    sepharose,\n  - e) optionally washing with an excess, preferably a 1000 fold excess,\n    of unspecifically binding protein, preferably BSA (bovine serum\n    albumin), in order to remove or block any unspecific binding sites\n    on the sepharose,\n  - f) an elution step with a buffer comprising a chaotropic agent,\n    preferably urea and/or guanidinium chloride and/or SDS, in order to\n    remove sepharose-bound PrP^(Sc),\n  - g) detecting PrP^(Sc) in the eluted buffer and, thereby\n    demonstrating high affinity binding of the sepharose to PrP^(Sc) as\n    such.",
                        "For determining the specificity of the assayed sepharose, the above assay is repeated except that PrPC instead of PrPSc is incubated in step c) and PrPC is detected in the wash solution, thereby indicating the lack of binding. Alternatively, PrPSc and PrPC can be incubated simultaneously with the sepharose in step c) and a specific and high affinity sepharose will result in detecting PrPC in the wash solution and PrPSc in the chaotropic elution buffer only.",
                        "A more detailed and preferred assay for determining the specificity and high affinity binding of sepharoses is presented below in example 1.",
                        "In short, the term “specific and high affinity binding of sepharose to PrPSc proteins” is meant to distinguish sepharoses and methods using these from sepharoses and said methods that merely bind PrPSc unspecifically and with low affinity, e.g. by precipitation and/or low adsorption.",
                        "The terms “concentrating and/or purifying” as used herein are meant to indicate that the concentration of PrPSc proteins and/or functional derivatives thereof is raised and/or non-PrPSc proteins and/or non-protein material(s) are removed.",
                        "This method can also be employed for effectively removing prion PrPSc proteins and/or functional derivatives thereof from body fluids. In that case it comprises the following steps:\n\n\n- a) contacting a body fluid comprising prion PrP^(Sc) proteins and/or\n  functional derivatives thereof with sepharose under conditions that\n  allow for the specific and high affinity binding of the sepharose to\n  the prion PrP^(Sc) proteins and/or functional derivatives thereof,\n- b) removing the body fluid from the sepharose.",
                        "Preferably said body fluid is selected from whole blood, blood fractions or brain homogenate, preferably from blood plasma. However, the body fluid may also encompass homogenates of mammalian tissues, in particular homogenates of brain tissue and spinal cord tissue.",
                        "It was also found that sepharose itself typically has an excellent compatibility with blood and as such no or at most a negligible effect on blood coagulation is observed when it is brought into contact with blood. Most ligated, metal-ligated and/or negatively charged sepharoses have also proven to be blood compatible. This is demonstrated by the results of Table 1 below, where the influence of a number of sepharoses for use according to the invention on common physiological protein parameters is tested. It was surprisingly found that sepharoses can be brought into contact with blood or blood fractions without harming or substantially altering blood parameters. Moreover, it was surprisingly found that metal-chelated sepharoses actually have a positive effect on the stability of coagulation factor VII.",
                        "Therefore, an independent aspect of the present invention is directed to novel compositions comprising coagulation factor VII, preferably the human coagulation factor VII, and further at least one metal-chelated sepharose, preferably Ni- and/or Zn-sepharose, more preferably Zn-sepharose. Another independent aspect is directed to the use of metal-chelated sepharose, preferably Ni- and/or Zn-sepharose, more preferably Zn-sepharose, for stabilizing blood, blood fractions and solid or liquid compositions comprising coagulation factor VII.",
                        "It is assumed without wishing to be bound by theory, that the advantageous effect of metal-chelated sepharoses on coagulation factor VII is based on stabilizing effects with regard to protease digestion and/or folding stability.",
                        "It should be noted that, in principle, any ligated or non-ligated sepharose can be employed for practicing the present invention(s) as long as the sepharose is not masked and, in the case that the blood is brought into contact with living cells in vivo and/or in vitro, is non-toxic. For practicing the method of the present invention for the removal of prion proteins from blood, metal-ligated sepharoses are preferred, negatively charged sepharoses are more preferred while non-ligated sepharoses and non-charged sepharoses are most preferred.",
                        "Surprisingly, the sepharose for use in the method of the present invention is not limited to any particular type of sepharose except that the sepharose core should be sufficiently accessible to the prion PrPSc proteins and/or functional derivatives thereof for binding.",
                        "Preferably, the sepharose for practicing the method of the present invention is selected from non-ligated sepharoses, more preferably selected from the group consisting of Sepharose® 2B, 4B, 6B, Sepharose® CL-4B, Sepharose®-6B, Superdex® 75, Sephacryl® 100HR and Sephadex® G10.",
                        "Also preferred for practicing the methods of the present invention are sepharoses selected from ligand-modified sepharoses, preferably selected from the group consisting of metal-chelating sepharoses, lectin agaroses, iminodiacetic sepharose, protein A agarose, streptavidin sepharose, sulfopropyl sepharose and carboxmethyl sepharose, more preferably selected from metal-chelating sepharoses and most preferred the sepharose for practicing the methods, compositions or uses is Zn-sepharose.",
                        "Zn sepharose is highly compatible with physiological fluids. Neither the sepharose nor the Zn ion will have any detrimental effects on body fluids such as whole blood, blood fractions, preferably blood plasma. Therefore, Zn sepharose is particularly useful for removing PrPSc proteins and/or functional derivatives from body fluids and/or body organs, e.g. organs for transplantation, that are to be reintroduced into an animal, preferably a human.",
                        "As mentioned before, for practicing the methods, compositions or uses of the present invention it is necessary that the optional ligands do not mask the sepharose core so that prion PrPSc proteins and/or functional derivatives thereof have free access. This is the problem with many ligand-modified sepharoses employed in the prior art. The skilled person can routinely select ligand-modified sepharoses that are sufficiently accessible for PrPSc binding by simply testing the sepharose binding affinity to PrPSc proteins, and, if desired, design appropriate ligand-modified sepharoses, e.g. by employing spacer molecules that position the ligand at an appropriate distance for the sepharose not to be masked by the ligand.",
                        "Another unexpected advantage of the method of the present invention is that the sepharose binding to prion PrPSc proteins and/or functional derivatives thereof is highly selective with respect to prion PrPC proteins and/or functional derivatives thereof which do not have any significant binding affinity to sepharose by themselves.",
                        "Therefore, the method of the present invention does not only allow for selectively concentrating, purifying and/or removing prion PrPSc proteins and/or functional derivatives thereof, but actually removes the highly analogous prion PrPC proteins and/or functional derivatives thereof, too.",
                        "When ligand-modified sepharoses are used, wherein the ligand part binds to prion PrPC proteins and/or functional derivatives thereof, the method of the present invention allows for the simultaneous concentrating and/or purification of prion PrPSc and PrPC proteins and/or functional derivatives thereof. The prion PrPSc and PrPC proteins and/or functional derivatives thereof can then be separated by selectively removing PrPC proteins and/or functional derivatives thereof from the sepharose.",
                        "In a preferred embodiment the present invention also relates to a method for separating and/or enriching prion PrPSc proteins and/or functional derivatives thereof from PrPC proteins and/or functional derivatives thereof, comprising the following steps:\n\n\n- a) contacting prion PrP^(Sc) proteins and PrP^(C) proteins and/or\n  functional derivatives thereof with ligand-modified sepharose under\n  conditions that allow for\n  - (i) the specific and high affinity binding of said sepharose part to\n    said prion PrP^(Sc) proteins and/or functional derivatives thereof,\n    and\n  - (ii) the binding of said ligand part of the sepharose to PrP^(C)\n    proteins and/or functional derivatives thereof,\n- b) optionally removing unbound material from said ligand-modified\n  sepharose,\n- c) optionally waiting for a sufficient time period for some or most of\n  the ligand-bound PrP^(C) proteins and/or functional derivatives\n  thereof to convert into prion PrP^(Sc) proteins and/or functional\n  derivatives in the close proximity of the prion PrP^(Sc) proteins\n  and/or functional derivatives thereof,\n- d) adding a selective release agent to the sepharose-bound proteins\n  and/or functional derivatives thereof from step a), b) or c) under\n  conditions that allow for the release of PrP^(C) proteins and\n  optionally non-prion proteins from the ligand part of the sepharose\n  but not for the release of the prion PrP^(Sc) proteins and/or\n  functional derivatives thereof from the sepharose part, and\n- e) removing the PrP^(C) and optionally non-prion proteins from the\n  sepharose.",
                        "When prion PrPSc and PrPC proteins and/or functional derivatives thereof were present on the ligand-modified sepharose it was unexpectedly found that the amount of PrPSc is raised in many instances at the expense of PrPC. It is believed that PrPC and/or functional derivatives thereof are converted by a spontaneous conformational change in the close proximity of PrPSc that seem to chaperone this change. This finding is in line with the understanding that the presence of PrPSc is required for PrPSc “production” from PrPC precursors.",
                        "In a more preferred embodiment of the above method, said method further comprises the step of:\n\n\n- f) releasing PrP^(Sc) prion proteins and/or derivatives thereof from\n  the sepharose.",
                        "For releasing PrPSc prion proteins and/or derivatives thereof from the sepharose it is preferred to add chaotropic agents and/or detergents, preferably urea and/or guanidinium chloride and/or SDS, more preferred to add urea and/or SDS, most preferred to add a gel-loading buffer comprising 8 M urea and 5% SDS and applying an electrical field. Of course, any other non-destructive method routinely applied for interrupting enzymes' affinity to polymers, preferably sugar-derived polymers, can also be employed.",
                        "For practicing the methods according to the present invention, in particular a method for separating and/or enriching prion PrPSc proteins from PrPC proteins, it is preferred to employ a ligand-modified sepharose that is a metal-chelating sepharose comprising divalent immobilized metal ions.",
                        "Metal-chelating sepharoses as well as negatively charged sepharoses such as sulfopropyl sepharose and carboxymethyl sepharose may bind to PrPSc as well as PrPC proteins and/or functional derivatives thereof due to the binding of the sepharose part and optionally the negative charged and/or metal ligand part of the sepharose to PrPSc and the negatively charged and/or metal ligand part of the sepharose to PrPC.",
                        "The mechanism underlying the separation method of the present invention relies on the different binding properties of PrPSc and PrPC regarding sepharose-immobilized metal ions. While PrPSc seems to have an intrinsic affinity to sepharose, divalent metal ions and negative charges, PrPC seems to have an intrinsic affinity to divalent metal ions and negative charges only. Hence, their different affinity for sepharose can be employed for separating them.",
                        "Preferably, the metal ions of the metal-chelating sepharose are selected from the group consisting Ni2+, Zn2+, Co2+, Mg2+, Ca2+ and Mn2+.",
                        "The binding of Ca2+ and Mn2+ is weaker and both ions bind only monomers of PrPSc and PrPC.",
                        "The other mentioned metal ions Ni2+, Co2+, Zn2+ and Mn2+ bind stronger to monomers and oligomers of PrPSc and PrPC and are preferred for that reason. Because of its excellent binding properties and due to its lack of toxicity under physiological conditions in vivo Zn2+ is most preferred for the metal-chelating sepharose for practicing the methods, uses and compositions of the present invention.",
                        "Incidentally, Cu-sepharose will not retain PrPSc proteins efficiently as demonstrated in example 1. In example 1 the reloading of Ni-High Performance Sepharose with Cu2+ results in unspecific binding of large amounts of BSA (see also FIG. 4, lane 1) and is, therefore, not suited for the enrichment of prion proteins in complex protein solutions. Therefore, the Cu-sepharose IMAC presented by Grathwohl et al. will not provide the differential affinity necessary for a quantitative separation of PrPSc from PrPC. It is therefore generally preferred for all methods of the invention that the sepharose is not a Cu2+-metal-chelating sepharose",
                        "When a metal-chelating sepharose is employed for practicing a method of the present invention the selective release agent is preferably a metal chelating agent, preferably an agent selected from EDTA, imidazole and/or EGTA, more preferably EDTA.",
                        "For separating PrPSc and PrPC proteins and/or functional derivatives thereof from a metal chelating sepharose in a method of the invention it is most preferred that the metal is Zn2+ and the metal chelating agent is EDTA.",
                        "It is also preferred that the conditions in step d) of the method of the present invention for separating PrPSc and PrPC proteins that allow for the release of PrPC and optionally non-prion proteins from the sepharose-immobilized metal ions comprise the presence of a metal chelating agent in a concentration of 5 to 50 mM, more preferably 10 to 25 mM, most preferably EDTA at a concentration of 10 to 25 mM.",
                        "It was also found that the addition of small amounts of chelators such as EDTA, imidazole and/or EGTA to complex protein fractions such as blood fractions or brain homogenates can assist to avoid unspecific binding and therefore assists separation of unspecific material from PrPSc and/or PrPC proteins. For example, for some plasma fractions it was found that 10 to 25 mM EDTA reduced unspecific binding effectively. When working with sepharose-immobilized metal ions one must take care that the effects of reducing unspecific binding and releasing PrPC by chelators do not overlap if the release of PrPC is not yet desired. Moreover, depending on the presence and amounts of unspecifcally binding proteins the above preferred concentration ranges will have to be adapted, i.e. increased, to compensate for the presence of unspecific proteins that scavenge the chelators for PrPC release. Such an optimization is within the routine skill of those in the art.",
                        "Although sepharose itself is sufficient to bind significant amounts of PrPSc by itself if unmasked it may be desirable to employ sepharoses with at least one additional ligand for specifically binding prion PrPSc and/or PrPC proteins, wherein said ligand is bound directly or indirectly, e.g. by means of a spacer molecule, to the sepharose.",
                        "In a preferred embodiment the additional ligand is selected from the group consisting of prion proteins, functional derivatives of prion proteins, His-tagged prion proteins, prion protein-binding proteins, prion protein-binding antibodies, and prion-protein specific ligands.",
                        "More preferably, the additional ligand is a prion protein, e.g. a prion fragment such as e.g. bovine PrP(25-241), that is directly or indirectly bound, e.g. by a metal chelator, to the sepharose.",
                        "As mentioned before in the introductory section, the reversible aggregation of prion proteins or derivatives thereof with one or more prion repeat structures that oligomerize with prion proteins at a pH of 6.2 to 7.8 and which may dissociate again at a pH of 4.5 to 5.5 provides highly selective and efficient means for binding, concentrating, purifying and/or removing prion proteins and/or functional derivatives thereof (PCT/EP2004 003 060). For practicing the present invention prion repeat structure(s) may be attached to sepharoses as additional ligands in order to specifically oligomerize with prion proteins and thereby to bind these.",
                        "In a more preferred embodiment the additional ligand is a prion protein and/or a functional derivative thereof.",
                        "The additional ligand on sepharoses for practicing the method of the present invention may be bound to the sepharose directly or indirectly, and is preferably bound by a spacer moiety in between the sepharose and the ligand itself.",
                        "Although the methods of the present invention are not limited to any particular prion proteins or derivatives thereof the prion proteins and/or functional derivatives thereof are selected from the group consisting of prion proteins from human, bovine, ovine, mouse, hamster, deer, or rat origin and derivatives thereof.",
                        "The term “functional derivatives of prion proteins” as used throughout the description and the claims refers to any derivatives of prion proteins, in particular fragments thereof, that comprise at least one or more prion repeat structure(s), preferably 2 to 4, more preferably 4 prion repeat structures.",
                        "In a preferred embodiment the functional derivative of a prion protein has at least one prion repeat structure(s) that is (are) an octapeptide, pseudooctapeptide, hexapeptide or pseudohexapeptide, more preferably an octapeptide having a sequence selected from the group consisting of PHGGGWGQ (SEQ ID: 1, human), PHGGSWGQ (SEQ ID: 2, mouse) and PHGGGWSQ (SEQ ID: 3, rat), or a pseudooctapeptide derived from said sequences, preferably selected from the group consisting of PHGGGGWSQ (SEQ ID: 4, various species), and PHGGGSNWGQ (SEQ ID: 5, marsupial), or a hexapeptide having a sequence selected from the group consisting of PHNPGY (SEQ ID: 6, chicken), PHNPSY (SEQ ID: 7, turtle), PHNPGY (SEQ ID: 8, turtle) or is a pseudohexapeptide derived from said sequences.",
                        "In a more preferred embodiment at least one, preferably each, of the prion repeat structures comprises an N-terminal loop conformation connected to a C-terminal β-turn structure.",
                        "Most preferred, the functional derivatives for practicing the present invention are also capable of reversible aggregation and/or dissociation, i.e. oligomerisation at a pH of 6.2 to 7.8 and/or dissociation of the oligomer aggregate at a pH of 4.5 to 5.5 in an aqueous fluid environment.",
                        "The functional derivatives of prion proteins useful for practicing the methods of the present invention may also be characterized in that they bind to unmasked sepharose to a significant extent. A significant extent means that preferably at least 50, more preferably at least 70, even more preferably at least 80, and most preferably at least 90% of the derivatives bind to unmasked sepharose relative to the naturally occurring prion protein from which the derivative is derived. For determining the extent of sepharose binding to prion protein derivatives the sepharose binding may be assessed using, e.g. Sepharose® 4 B (Sigma, product code 4B-200). The parameters for such an assay can be routinely determined by those skilled in the art.",
                        "As one of average skill in the art of prion proteins will appreciate, the functional derivatives of prion proteins mentioned herein can be briefly and sufficiently characterized in that they comprise at least one of the above prion repeat structures and are capable of binding unmasked sepharose. For bovine prion proteins or derivatives thereof, the binding of a prion protein to sepharose is assumed to be effected by domain 102-241, corresponding to amino acid residues 90 to 230 in human PrP. Analogous regions in prion proteins and derivatives thereof of other species have similar sepharose binding activity.",
                        "In a preferred embodiment the functional derivative for practicing the present invention is derived from prion proteins by one or more deletion(s), substitution(s) and/or insertion(s) of amino acid(s) and/or covalent modification(s) of one or more amino acid(s).",
                        "In a more preferred embodiment the functional derivative for practicing the present invention comprises one or more octapeptide repeat sequences, preferably amino acids 51-90, and/or the C-terminal domain, preferably, amino acids 121-230 of human PrP.",
                        "The conditions for contacting the prion PrPSc proteins and/or functional derivatives thereof with sepharose under conditions that allow for the binding of said sepharose to said prion PrPSc proteins and/or functional derivatives thereof, and optionally the binding of the ligand part of the ligand-modified sepharose to PrPC proteins, if ligand-modified sepharose is employed, are preferably physiological conditions, more preferably a pH of 5 to 8 and 2 to 39° C., more preferably a pH of about 7 and about 20 to 25° C.",
                        "Further conditions for binding sepharose to prion proteins and functional derivatives thereof are ionic strength, buffer substances, etc. The person skilled in the art can routinely determine the suitable and optimized conditions for binding sepharose to prion proteins.",
                        "The term removing as it is used in the context of the removal of unbound non-prion proteins, body fluid and/or PrPC proteins and/or derivatives thereof refers to standard techniques for separating proteins and sepharose material such as centrifugation, filtration, ultrafiltration, etc.",
                        "If sepharoses with the above-mentioned additional ligands for binding prion proteins by prion protein aggregation are used, naturally, a pH of 6.2 to 7.8 is preferred.",
                        "In another preferred embodiment the conditions for contacting sepharose and prion proteins comprise the presence of at least one detergent and/or a cell lysis buffer. That way, cells and/or membrane fractions present in a sample of interest can be treated by a method according to the present invention directly without any prerequisite steps for liberating the prion proteins or functional derivatives thereof and making them accessible.",
                        "In a further aspect the present invention relates to the use of sepharose, preferably ligand-modified sepharose, for concentrating, purifying and/or removing prion PrPSc proteins and/or functional derivatives thereof from other proteins in a method according to the invention.",
                        "In a preferred embodiment the sepharose is used in one of the above methods for concentrating, purifying and/or removing prion PrPSc proteins and/or functional derivatives thereof from whole blood, a blood fraction or brain homogenate, preferably from blood plasma.",
                        "In a further preferred embodiment the sepharose used is a metal-chelating sepharose, preferably comprising a divalent metal ion, more preferably a metal ion selected from the group consisting of Ni2+, Co2+, Zn2+ and Mn2+, most preferably Zn2+.",
                        "In the following the present invention will be further illustrated by way of examples, which relate to preferred embodiments of the present invention and which are not to be construed as limiting to the scope of the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce prion proteins",
                        "describe prion-associated diseases",
                        "mention BSE and vCJD",
                        "discuss transmission of prion diseases",
                        "highlight importance of detecting and removing prion proteins",
                        "describe existing assays for detecting prion proteins",
                        "discuss limitations of existing assays",
                        "introduce affinity chromatography",
                        "describe sepharose as a support material",
                        "discuss Grathwohl et al.'s work on IMAC",
                        "compare removal of PrPC using hexapeptide ligands and sepharose",
                        "discuss binding of SP-Sepharose and DEAE-Sepharose to PrPC",
                        "highlight limitations of WO 01/77687",
                        "introduce P. R. Foster's work on prion detection",
                        "discuss limitations of P. R. Foster's work",
                        "highlight uncertainty in prion research",
                        "introduce method for purifying and detecting prion proteins",
                        "discuss reversible aggregation and dissociation of prion proteins",
                        "highlight need for simple and effective methods for concentrating and purifying prion proteins",
                        "discuss need for separating PrPSc from PrPC proteins",
                        "introduce object of the present invention",
                        "describe method for concentrating and purifying prion PrPSc proteins",
                        "highlight specific and high affinity binding of sepharose to PrPSc proteins",
                        "discuss removing unbound non-prion proteins from sepharose",
                        "introduce assay for determining specific and high affinity binding of sepharose to PrPSc",
                        "describe steps of the assay",
                        "discuss determining specificity of the assayed sepharose",
                        "introduce method for removing prion PrPSc proteins from body fluids",
                        "discuss compatibility of sepharose with blood",
                        "highlight effect of metal-chelated sepharoses on coagulation factor VII",
                        "introduce novel compositions comprising coagulation factor VII and metal-chelated sepharose",
                        "discuss use of metal-chelated sepharose for stabilizing blood and blood fractions",
                        "assume stabilizing effects of metal-chelated sepharoses on coagulation factor VII",
                        "discuss preferred sepharoses for practicing the method",
                        "highlight accessibility of sepharose core for binding",
                        "introduce preferred ligand-modified sepharoses",
                        "discuss Zn sepharose as a preferred sepharose",
                        "highlight advantages of the method of the present invention",
                        "introduce prion proteins and separation method",
                        "describe method steps for separating prion proteins",
                        "explain conversion of PrPC to PrPSc",
                        "describe releasing PrPSc from sepharose",
                        "introduce metal-chelating sepharose",
                        "describe binding properties of PrPSc and PrPC",
                        "specify preferred metal ions for metal-chelating sepharose",
                        "describe limitations of Cu-sepharose",
                        "introduce selective release agents",
                        "specify preferred conditions for releasing PrPC",
                        "describe use of chelators to avoid unspecific binding",
                        "introduce additional ligands for sepharose",
                        "specify preferred additional ligands",
                        "describe binding of prion proteins to sepharose",
                        "introduce prion repeat structures",
                        "specify preferred prion repeat structures",
                        "describe functional derivatives of prion proteins",
                        "specify preferred functional derivatives",
                        "describe binding of functional derivatives to sepharose",
                        "introduce conditions for contacting sepharose and prion proteins",
                        "specify preferred conditions",
                        "describe use of detergents and cell lysis buffers",
                        "introduce use of sepharose for concentrating and purifying prion proteins",
                        "specify preferred uses of sepharose",
                        "describe preferred sepharose for concentrating and purifying prion proteins",
                        "introduce examples of the present invention",
                        "describe preferred embodiments of the present invention",
                        "specify scope of the present invention",
                        "summarize method for separating prion proteins",
                        "conclude background of the invention"
                    ],
                    "num_characters": 34726,
                    "outline_medium": [
                        "introduce prion proteins",
                        "describe prion-associated diseases",
                        "discuss BSE and vCJD",
                        "mention transmission of prion diseases",
                        "highlight importance of detecting and removing prion proteins",
                        "describe prior art assays for detecting prion proteins",
                        "discuss limitations of prior art assays",
                        "introduce Grathwohl et al. (Arch. Virol. (1996) 141: 1863-1874)",
                        "describe WO 01/77687",
                        "discuss limitations of WO 01/77687",
                        "introduce P. R. Foster (Transfusion Medicine, 1999, 9, 3-14)",
                        "discuss limitations of P. R. Foster",
                        "describe PCT/EP2004 003 060",
                        "highlight need for simple and effective methods",
                        "discuss current methods for separating PrPSc from PrPC",
                        "highlight need for efficient separation methods",
                        "state object of the present invention",
                        "describe method for concentrating and/or purifying prion PrPSc proteins",
                        "highlight advantages of the present invention",
                        "introduce prion protein separation method",
                        "describe method steps",
                        "explain conversion of PrPC to PrPSc",
                        "describe metal-chelating sepharose",
                        "explain binding properties of PrPSc and PrPC",
                        "describe preferred metal ions",
                        "explain limitations of Cu-sepharose",
                        "describe selective release agents",
                        "explain conditions for releasing PrPC",
                        "describe additional ligands for sepharose",
                        "explain binding of prion proteins to sepharose",
                        "describe functional derivatives of prion proteins",
                        "explain reversible aggregation of prion proteins",
                        "describe conditions for contacting sepharose and prion proteins",
                        "outline use of sepharose for concentrating and purifying prion proteins"
                    ],
                    "outline_short": [
                        "introduce prion diseases",
                        "describe prion protein conversion",
                        "list examples of prion-associated diseases",
                        "discuss BSE and vCJD",
                        "highlight transmission risks",
                        "motivate detection and removal of prion proteins",
                        "summarize prior art on prion protein detection",
                        "discuss limitations of prior art methods",
                        "identify need for simple and effective methods",
                        "introduce prion protein separation method",
                        "describe method steps for separating prion proteins",
                        "explain mechanism of separation method",
                        "discuss preferred embodiments of metal-chelating sepharose",
                        "describe additional ligands for specifically binding prion proteins",
                        "define functional derivatives of prion proteins",
                        "outline conditions for contacting prion proteins with sepharose"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "The binding affinity and specificity of prion proteins to various Sepharoses was investigated with recombinant prion proteins in the presence of a 1,000-fold excess of BSA. The recombinant prion proteins PrP-pure (alicon ag, product code P0001) and PrP-beta (alicon ag, P 0019 and P0027) were used as model substances for PrPC and PrPSc, respectively. The beta-form of bovine PrP(25-241) and mouse PrP(89-231), and the pure-form of bovine PrP(25-241) can be well distinguished by SDS-PAGE because of their different electrophoretic mobilities.",
                                "For the binding experiments 5 μg of the prion protein studied and 5 mg BSA were dissolved in 1 ml binding buffer containing 50 mM sodium phosphate pH 7. Depending of the experimental design the binding buffer contained additives such as EDTA or detergents. The mixture of Sepharose matrix and binding buffer was rotated in 1.5 ml vials for 1 h at 4° C. Subsequently, the matrix was centrifuged at 500 g and washed twice with 1 ml binding buffer to remove unbound proteins. The Sepharose-bound proteins were denatured in 10 μl standard gel-loading buffer containing 5% SDS and 8 M urea, and analysed by SDS-PAGE on 12% polyacryamide gels.",
                                "Reloading of Ni Sepharose High Performance (Amersham, Product Code 17-5268 02) with a cation of choice was performed by first washing the matrix twice with binding buffer containing 50 mM EDTA to remove bound Ni2+. The stripped matrix was washed twice with binding buffer, and reloaded by rotating in binding buffer containing 50 mM metal ion for 10 min at 4° C. The unbound metal ions were removed after washing twice with binding buffer.",
                                "**Results:**",
                                "The results are summarized in Table 1 below: where “ ” indicates no affinity of Sepharose to PrP, “+” indicates affinity to monomeric PrP forms, “++” indicates high affinity to monomeric PrP forms, and “+++” indicates high affinity to monomeric and oligomeric forms of PrP. The terms “monomeric” and “oligomeric” PrP forms refer to disulfide-linked oligomers observed under non-reducing conditions in the SDS-PAGE rather than to aggregated PrP forms without an intermolecular disulfide bond.",
                                "Unligated Sepharoses bind with high affinity to the beta forms of bovine PrP(25-241) and mouse PrP(89-231), but not the pure form of bovine PrP(25-241). Binding occurs to the monomeric but not the oligomeric forms (FIG. 2 lane 7; FIG. 3 lane 7). Although there is a 1000-fold excess of BSA over PrP, the relative amount of albumin bound to Sepharose matrix is relatively low, indicating that PrP binding is highly specific.",
                                "Negatively charged Sepharoses bind with high affinity to the beta form of bovine PrP(25-241) and mouse PrP(89-231), as well as the pure form of bovine PrP(25-241). Binding occurs to monomeric and oligomeric PrP forms (FIG. 3 lanes 1 and 2).",
                                "Positively charged Sepharoses showed an unspecific protein binding affinity as indicated by strong binding to BSA. Because the large amount of total protein loaded on SDS-PAGE gels, the amount of bound PrP could not be determined.",
                                "Some of the ligand-modified Sepharoses tested bind with high affinity to the beta form of bovine PrP(25-241) and mouse PrP(89-231), and the pure form of bovine PrP(25-241). Binding occurs to monomeric, but not to oligomeric PrP forms (FIG. 2 lanes 4 and 5; FIG. 3 lanes 3 and 6). However, some other ligand-modified Sepharoses showed an unspecific protein binding affinity as indicated by strong BSA binding (FIG. 2 lanes 1-2 and 6; FIG. 3 lane 5).",
                                "IMAC-Sepharoses bind with high affinity to the beta form of bovine PrP(25-241) and mouse PrP(89-231), as well as the pure form of bovine PrP(25-241). For some IMAC-Sepharoses, such as Ni Sepharose High Performance (Amersham), binding occurred to monomeric as well as to oligomeric PrP forms (FIG. 1 lane 9; FIG. 2 lane 9; FIG. 3 lane 9; FIG. 4 lane 10). However, many Sepharoses exclusively bound to monomeric PrP.",
                                "The binding of IMAC Sepharose to prion protein is modulated by the type of chelated metal ions. Ni Sepharose High Performance reloaded with Ni2+, Zn2+, or Co2+ binds with high affinity to the beta form of bovine PrP(25-241) and mouse PrP(89-231), as well as the PrP-pure form of bovine PrP(25-241) (FIG. 4 lanes 5, 6, 7, and 10). The binding to the oligomeric PrP forms to Ni Sepharose High Performance remains unchanged after washing with 0.5% Triton X-100 (FIG. 4 lane 8), indicating that binding is specific. Pre-coating of Ni Sepharose High Performance with BSA results in more efficient binding of oligomeric PrP-forms (FIG. 5 lanes 7-8). Reloading of Ni Sepharose High Performance with Cu2+ results in unspecific binding of large amounts of BSA (FIG. 4 lane 1), and is thus not applicable for specific enrichment of prion proteins in complex protein solutions. Ni Sepharose High Performance reloaded with Mn2+, Mg2+ or Ca2+ predominantly binds to monomeric PrP (FIG. 4 lane 4; FIG. 5 lane 4-6).",
                                "**Interpretation:**",
                                "The binding of PrP-beta to Sepharoses is modulated by the:\n\n\n- - accessibility of the Sepharose matrix\n  - presence of Sepharose-immobilize metal ions\n  - presence of negative charges on the Sepharose",
                                "The binding of PrP-pure to Sepharoses is modulated by the:\n\n\n- - presence of Sepharose-immobilize metal ions\n  - presence of negative charges on the Sepharose",
                                "The amino acids responsible for the intrinsic affinity of the beta form to Sepharose are located within residues 104 to 241 of the bovine prion protein sequence. Residues 25 to 103 containing the octapeptide repeats are thus not required for Sepharose binding. However, the presence of residues 23 to 103 results in an increased affinity to IMAC Sepharose or Cation Exchange Sepharose by binding of immobilized metal ions and negative charges, respectively.",
                                "**Summary:**",
                                "Unligated Sepharose has an intrinsic binding affinity for PrP-beta (corresponding to PrPSc) but not PrP-pure (corresponding to PrPC). Thus unligated Sepharoses can be used for concentrating, purifying, and removing prions without affecting the concentration of PrPC.",
                                "The binding affinity of PrP-beta to Sepharose is increased when the matrix is modified with immobilized metal ions (such as Ni2+, Zn2+, Co2+) or negative charges (such as sulfopropyl or carboxymethyl), where these ligands also bind to PrP-pure. Thus IMAC Sepharoses and negatively charged Sepharoses can be used for concentrating, purifying, and removing of various prion protein forms."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design",
                                "describe binding affinity of prion proteins to Sepharoses",
                                "summarize results in Table 1",
                                "describe binding of unligated Sepharoses to PrP-beta",
                                "describe binding of negatively charged Sepharoses to PrP-beta",
                                "describe binding of positively charged Sepharoses to PrP-beta",
                                "describe binding of ligand-modified Sepharoses to PrP-beta",
                                "describe binding of IMAC-Sepharoses to PrP-beta",
                                "describe modulation of PrP-beta binding by metal ions",
                                "describe modulation of PrP-pure binding by metal ions",
                                "interpret results",
                                "summarize results"
                            ],
                            "num_characters": 6435,
                            "outline_medium": [
                                "describe experimental design",
                                "present results of binding experiments",
                                "interpret results",
                                "summarize binding affinity of PrP-beta and PrP-pure",
                                "discuss implications for prion protein enrichment",
                                "conclude on use of Sepharose for prion protein concentration"
                            ],
                            "outline_short": [
                                "describe experimental design",
                                "present results of binding affinity experiments",
                                "interpret results"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "The amount of PrPC in blood of healthy humans and animals is only marginal. Without any concentration step PrPC is not detected using conventional analytical methods such as Western Blot. However, applying Ni Sepharose High Performance pre-loaded with bovine PrP(25-241) pure-form to 20 ml blood, PrPC becomes visible.",
                                "Ni Sepharose High Performance pre-loaded with bovine PrP(25-241) was prepared by adding 5 ng of the recombinant prion protein to 20 ml of the Sepharose equilibrated with 50 mM phosphate buffer. The mixture was vortexed, and incubated while rotating for 1 h at 4° C.",
                                "The preparation of cell lysates and plasma from fresh cattle blood was carried out using standard protocols. For Example, the plasma fraction was prepared from 20 ml blood collected in EDTA tubes, after 1/10 dilution with sodium citrate to a final concentration of 10 mM. The citrate blood was diluted 1/1 with Gey's balanced salt solution (Sigma, Product Code G9779) and mixed carefully. The solution was distributed to 50 ml Falcon tubes with a maximal volume of 15 ml per tube, and centrifuged at 200 g for 7 min with brake on. To the supernatant EDTA was added to a final concentration of 10 mM, and centrifuged at 560 g for 10 min with brake on. Native blood PrP was concentrated by adding 60 μl of Ni Sepharose High Performance pre-loaded with bovine PrP(25-241) to each blood fraction. The protein solutions were incubated while rotating for 1 h at 4° C., and centrifuged at 500 g for 2 min. The supernatant was discarded, and the Sepharose was washed twice with 1 ml buffer containing 100 mM sodium phosphate, 10 mM Tris, 20 mM imidazole, pH 8 to remove unbound proteins. For consecutive proteinase K digest each blood fraction was divided into three parts. The Sepharose-bound proteins were incubated with proteinase K (Sigma, P2308) at concentrations between 0 μg/ml and 50 μg/ml, while shaking in an Eppendorf Thermomixer at 1400 rpm for 1 h at 37° C. The sample volume was 80 μl in 0.2 ml PCR tubes, and the cleavage buffer was composed of 50 mM sodium phosphate pH 7 and 150 mM NaCl. To guarantee a homogeneous distribution of the Sepharose matrix during proteinase K reaction, 10 μl-tips (Treff) cut to a length of 0.5 cm were added to the PCR tubes. The reaction was stopped by adding 2 μl of a 150 mM PMSF stock solution. The tubes were vortexed and centrifuged at 500 g for 2 min, and the supernatant was discarded. The Sepharose-bound protein was denatured in 10 μl gel-loading buffer containing 5% SDS and 8 M urea, and loaded onto a 12% acrylamide gel. Proteins were transferred to PVDF using a semi-dry discontinuous three-buffer system. Transfer was at 1 mA/cm2 for 1 h. Blots were analysed using the standard protocol of ECL Advance Western Blotting Detection Kit (Amersham), a PrP-specific monoclonal antibody, and a peroxidase-coupled anti-mouse monoclonal antibody.",
                                "**Results:**",
                                "After concentration nanogram-amounts PrPC are measured in various blood fractions, including monocytes and lymphocytes, platelets, and plasma (FIG. 6). Native PrPC in blood cells and plasma predominantly is di-glycosylated and has an apparent molecular weight of about 35 kDa. Neutrophiles do not express significant amounts of prion protein.",
                                "Sepharose-bound PrP is accessible to proteinase K digestion. After treatment of immobilized prion protein from cell lysates or plasma with 5 μg/ml proteinase K for one hour, PrPC is partially degraded showing an apparent molecular weight of about 30 kDa (FIGS. 7 and 8). At 10-fold higher proteinase K concentration prion protein is completely degraded.",
                                "**Summary:**",
                                "IMAC-Sepharose constitutes an excellent matrix for concentration of total prion protein from body fluids. Sepharose-immobilized prion proteins are accessible for further biochemical analysis employed in prion diagnostics, such as protease digestion."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design",
                                "describe preparation of Ni Sepharose High Performance",
                                "describe concentration of PrPC from blood",
                                "describe proteinase K digestion of PrPC",
                                "summarize results",
                                "describe accessibility of Sepharose-bound PrP to proteinase K",
                                "summarize results"
                            ],
                            "num_characters": 3882,
                            "outline_medium": [
                                "describe experimental design",
                                "present results of PrPC concentration",
                                "summarize use of IMAC-Sepharose for prion protein concentration"
                            ],
                            "outline_short": [
                                "describe concentration of PrPC from blood using IMAC Sepharose"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "The nature of native PrPSc in blood is not known, although it seems likely that it has similar biochemical properties as PrPSc found in brain. We used PrPSc from brain homogenate (PrPSc concentration between 1 pg/ml and 1 ng/ml) as a model substrate to analyse its binding to Ni Sepharose High Performance pre-loaded with bovine PrP(25-241).",
                                "The concentration experiment was carried out as described under Example 2, except that various amounts of scrapie brain homogenate were added to the samples.",
                                "**Results:**",
                                "After spiking of 1 ml sodium phosphate buffer pH 8 with brain homogenate to a final concentration of 1 ng/ml PrPSc and subsequent 200-fold concentration, di-glycosylated, mono-glycosylated, and unglycosylated PrPSc as well as a multimeric forms could be detected in the Western Blot (FIG. 9). Thus, independent of its aggregation and glycosylation state, PrPSc efficiently binds to the Sepharose. In the presence of 5 and 25 μg/ml proteinase K about 70 residues are removed from the N-terminus of immobilized PrPSc. Similar results are obtained up to 5.000-fold concentration of PrPSc, and in phosphate buffer containing 0.5% Triton X-100, 0.5% deoxycholat, and 0.43% sucrose. Even after N-terminal truncation the binding of PrPSc to the Sepharose is not diminished by the presence of detergent or carbohydrate.",
                                "Similar results were obtained with platelets lysate and plasma. Native blood PrPC and PrPSc from brain homogenate were co-concentrated by the Sepharose matrix. In the presence of 5 μg/ml proteinase K native PrPC was completely degraded (FIG. 10 A), whereas concentrated PrPSc showed the typical pattern of di-glycosylated, mono-glycosylated, and unglycosylated forms (FIG. 10 B).",
                                "**Summary:**",
                                "IMAC-Sepharose constitutes an excellent matrix for concentration of infectious prions from body fluids. Sepharose-immobilized PrPSc is accessible for further biochemical analysis employed in prion diagnostics, such as proteinase K digestion."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design",
                                "describe binding of PrPSc to Ni Sepharose High Performance",
                                "summarize results"
                            ],
                            "num_characters": 1991,
                            "outline_medium": [
                                "describe experimental design and results of PrPSc binding"
                            ],
                            "outline_short": [
                                "describe concentration of PrPSc from brain homogenate using IMAC Sepharose"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "As mentioned in the previous Examples, Ni Sepharose High Performance binds with high affinity to the recombinant proteins PrP-beta and PrP-pure, as well as to native PrPC and PrPSc.",
                                "To investigate the elution properties of the Sepharose matrix, we used the same experimental design as before, with the sole exception that the binding buffer contained various concentrations of EDTA.",
                                "**Results:**",
                                "In the presence of 10 mM EDTA, exclusively the dimeric forms of recombinant PrP are released from the Sepharose matrix. In the presence of 40 mM EDTA the pure form of bovine PrP(25-241) is released, whereas the beta forms stay bound to the Sepharose even at 80 mM EDTA concentration (FIG. 1).",
                                "The three glycoforms of PrPSc and recombinant bovine PrP(25-241) are co-concentrated, when treated with Ni Sepharose High Performance. After washing the Sepharose matrix with increasing concentrations of EDTA the bovine PrP(25-241) is gradually released, whereas the PrPSc stays bound (FIG. 11). Thus, the pure form representing native PrPC is specifically released from the Sepharose. Similar results were obtained with native PrPC from blood after spiking with scrapie brain homogenate.",
                                "**Interpretation:**",
                                "Addition of EDTA to Ni Sepharose High Performance results in stripping of Ni2+ from the Sepharose. At a concentration of EDTA where the amount Sepharose-immobilized Ni+ falls below a certain value, there are not enough binding sites available and PrPC is released from the Sepharose. In contrast, PrPSc stays bound, because of its additional Sepharose binding activity.",
                                "**Summary:**",
                                "IMAC-Sepharose constitutes an excellent matrix for concentration of PrPC and PrPSc from body fluids, and subsequent separation of the two PrP conformers in the presence of EDTA."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design",
                                "describe elution properties of Sepharose matrix",
                                "interpret results"
                            ],
                            "num_characters": 1792,
                            "outline_medium": [
                                "describe experimental design and results of elution properties"
                            ],
                            "outline_short": [
                                "investigate elution properties of IMAC Sepharose"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "The amount of PrPSc in blood of cattle infected with BSE prions is only marginal. Without any concentration step PrPSc is not detected using conventional analytical methods such as Western Blot. However, applying Ni Sepharose High Performance pre-loaded with bovine PrP(25-241) pure-form to 20 ml blood of a cow experimentally infected with BSE, PrPSc becomes visible.",
                                "For these experiments we use the same experimental setup as in Example 2.",
                                "Results:",
                                "After treatment of immobilized prion protein from plasma with 25 μg/ml or 50 μg/ml proteinase K, there is an accumulation of four prion protein bands that are typically detected for cattle infected with BSE (FIG. 12 A). Picogram-amounts of PrPSc shifted relative to undegraded PrPC in the absence of proteinase K. No such bands are observed for control cattle. (FIG. 12 B).",
                                "**Summary:**",
                                "IMAC-Sepharose constitutes an excellent matrix for the detection of native PrPSc from body fluids of BSE-infected cattle."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design"
                            ],
                            "num_characters": 991,
                            "outline_medium": [
                                "describe experimental design and results of PrPSc detection"
                            ],
                            "outline_short": [
                                "detect PrPSc from BSE-infected cattle using IMAC Sepharose"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Experimental Design:**",
                                "From the previous examples it turned out that the small amounts of Sepharose matrix used have a binding capacity in the nanogram range. The Sepharose thus may be applied for complete removal of total prion proteins from body fluids such as human and animal blood plasma.",
                                "For the plasma filtration experiments we used the same experimental setup as described in Example 2, except that four batches of Sepharose matrix were added consecutively to the same plasma. The Ni Sepharose High Performance for filtration of human and cattle plasma was pre-loaded with the pure form of human PrP(23-230) bovine PrP(25-241), respectively.",
                                "**Results:**",
                                "The first batch of 20 μl Ni Sepharose High Performance pre-loaded with bovine PrP(25-241) pure-form binds nanogram-amounts of native prion protein after 1 hour of incubation in 10 ml plasma from cattle blood (FIG. 13). The second batch of Sepharose already is completely free of prion protein up to the detection limit of 1 pg. The same result was obtained for the third and fourth batch of Sepharose. Thus, all prion proteins have been removed from plasma already after the first incubation period with the Sepharose matrix.",
                                "The first batch of 20 μl Ni Sepharose High Performance pre-loaded with human PrP(23-230) pure-form also binds nanogram-amounts of native prion protein after 1 hour of incubation in 10 ml human plasma (FIG. 14). The second and third batches of Sepharose bind relatively less prion protein when compared to the previous batch, respectively. The fourth batch of Sepharose is completely free of prion protein up to the detection limit of 1 pg. Thus, all prion proteins have been removed from human plasma.",
                                "The larger amount of Sepharose required for filtration of human plasma when compared to cattle plasma is explained by an about 4-fold higher amount of PrPC in human plasma.",
                                "**Summary:**",
                                "IMAC-Sepharose constitutes an excellent matrix for the removal of native prion proteins from body fluids such as human and bovine plasma."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental design",
                                "describe filtration of cattle plasma",
                                "describe filtration of human plasma",
                                "summarize results"
                            ],
                            "num_characters": 2024,
                            "outline_medium": [
                                "describe experimental design and results of plasma filtration",
                                "summarize use of IMAC-Sepharose for prion protein removal"
                            ],
                            "outline_short": [
                                "remove prion proteins from human and animal blood plasma using IMAC Sepharose"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [
                "define prion protein concentration method",
                "define prion protein separation method",
                "mention use of methods"
            ],
            "num_characters": 1670,
            "outline_medium": [
                "outline methods for prion protein processing"
            ],
            "outline_short": [
                "outline methods for prion protein processing"
            ]
        }
    ],
    "claims": [
        "1. A method for concentrating and/or purifying prion PrPSc proteins and/or functional derivatives thereof, comprising the following steps:\na) contacting prion PrPSc proteins and/or functional derivatives thereof with sepharose under conditions that allow for the specific and high affinity binding of said sepharose to said prion PrPSc proteins and/or functional derivatives thereof,\nb) removing the unbound non-prion proteins from said sepharose,\nwherein the sepharose is not a Cu2+-chelating sepharose.",
        "2. A method for removing prion PrPSc proteins and/or functional derivatives thereof from body fluids, comprising the following steps:\na) contacting a body fluid comprising prion PrPSc proteins and/or functional derivatives thereof with sepharose under conditions that allow for the specific and high affinity binding of said sepharose to said prion PrPSc proteins and/or functional derivatives thereof,\nb) removing the body fluid from said sepharose.",
        "3. The method of claim 2, wherein the body fluid is selected from whole blood, blood fractions or brain homogenate, preferably from blood plasma.",
        "4. The method according to claim 1, wherein the sepharose is selected from unligated sepharoses, preferably selected from the group consisting of Sepharose 2B®, 4B®, 6B®, Sepharose CL-4B®, Sepharose-6B®, Superdex 75®, Sephacryl 100HR® and Sephadex G10®.",
        "5. The method according to claim 1, wherein the sepharose is selected from ligand-modified sepharoses, preferably selected from the group consisting of metal-chelating sepharoses, lectin agaroses, iminodiacetic sepharose, protein A agarose, streptavidin sepharose, sulfopropyl sepharose and carboxmethyl sepharose, more preferably selected from metal-chelating sepharoses, most preferably the sepharose is Zn sepharose.",
        "6. A method for separating and/or enriching prion PrPSc proteins and/or functional derivatives thereof from PrPC proteins and/or functional derivatives thereof, comprising the following steps:\na) contacting prion PrPSc proteins and PrPC proteins and/or functional derivatives thereof with ligand-modified sepharose under conditions that allow for\n(i) the specific and high affinity binding of said sepharose part to said prion PrPSc proteins and/or functional derivatives thereof, and\n(ii) the binding of said ligand part of the sepharose to PrPC proteins and/or functional derivatives thereof,\n\nb) optionally removing unbound material from said ligand-modified sepharose,\nc) optionally waiting for a sufficient time period for some or most of the ligand-bound PrPC proteins and/or functional derivatives thereof to convert into prion PrPSc proteins and/or functional derivatives in the close proximity of the prion PrPSc proteins and/or functional derivatives thereof,\nd) adding a selective release agent to the sepharose-bound proteins and/or functional derivatives thereof from step a), b) or c) under conditions that allow for the release of PrPC proteins and optionally non-prion proteins from the ligand part of the sepharose but not for the release of the prion PrPSc proteins and/or functional derivatives thereof from the sepharose part, and\ne) removing the PrPC and optionally non-prion proteins from the sepharose.",
        "7. The method of claim 6, further comprising the step of:\nf) releasing PrPSc prion proteins and/or derivatives thereof from the sepharose.",
        "8. The method of claim 7, wherein the release of PrPSc prion proteins and/or derivatives thereof is accomplished by adding chaotropic agents and/or detergents, preferably urea and/or guanidinium chloride and/or SDS, more preferably adding urea and/or SDS, most preferably adding a gel-loading buffer comprising 8 M urea and 5% SDS and applying an electrical field.",
        "9. The method of claim 5, wherein the ligand-modified sepharose is a metal-chelating sepharose comprising divalent immobilized metal ions.",
        "10. The method of claim 9, wherein the metal ions are selected from the group consisting Ni2+, Co2+, Zn2+, Mg2+, Ca2+ and Mn2+.",
        "11. The method of claim 10, wherein the metal ions are selected from the group consisting Ni2+, Co2+, Zn2+ and Mn2+.",
        "12. The method of claim 11, wherein the metal ions are Zn2+.",
        "13. The method of claim 6, wherein the ligand-modified sepharose is a metal-chelating sepharose according to any one of claims 9 to 12 and the selective release agent is a metal chelating agent, preferably an agent selected from EDTA, imidazole and/or EGTA.",
        "14. The method of claim 13, wherein the metal chelating agent is EDTA.",
        "15. The method according to claim 14, wherein the metal chelating sepharose comprises Zn2+ and the metal chelating agent is EDTA.",
        "16. The method according to claim 6, wherein the conditions in step d) of claim 6 that allow for the release of non-prion proteins and PrPC from the sepharose-immobilized metal ions comprise the presence of a metal chelating agent in a concentration of 5 to 50 mM, more preferably 10 to 25 mM, most preferably EDTA at a concentration of 10 to 25 mM.",
        "17. The method of claim 1, wherein at least one additional ligand for binding prion PrPSc and/or PrPC proteins is bound directly or indirectly to the sepharose.",
        "18. The method of claim 17, wherein the additional ligand is selected from the group consisting of prion proteins, functional derivatives of prion proteins, His-tagged prion proteins, prion protein-binding proteins, prion protein-binding antibodies, and prion-protein specific ligands.",
        "19. The method of claim 18, wherein the additional ligand is a prion protein and/or a functional derivative thereof.",
        "20. The method of claim 17, wherein the additional ligand is bound to sepharose directly or indirectly, preferably by a spacer moiety.",
        "21. The method according to claim 1, wherein the prion proteins and/or functional derivatives thereof are selected from the group consisting of prion proteins from human, bovine, ovine, mouse, hamster, deer, or rat origin and derivatives thereof.",
        "22. The method of claim 1, wherein the functional derivative is derived from prion proteins by one or more deletion(s), substitution(s) and/or insertion(s) of amino acid(s) and/or covalent modification(s) of one or more amino acid(s).",
        "23. The method of claim 1, wherein the functional derivative comprises one or more octapeptide repeat sequences, preferably amino acids 51-90, and/or the C-terminal domain, preferably, amino acids 121-230, of human PrP.",
        "24. The method of claim 1, wherein the conditions for the binding of sepharose to prion PrPSc proteins and/or functional derivatives thereof are physiological conditions, preferably a pH of 5 to 8 and 2 to 39° C., more preferably a pH of about 7 and about 2 to 8° C.",
        "25. The method of claim 24, wherein the conditions comprise the presence of at least one detergent and/or a cell lysis buffer.",
        "26. Use of sepharose having specific and high affinity binding to PrPSc for concentrating, purifying and/or removing prion PrPSc proteins and/or functional derivatives thereof from other proteins in a method according to claim 1.",
        "27. The use of sepharose according to claim 26 for concentrating, purifying and/or removing prion PrPSc proteins and/or functional derivatives thereof from whole blood, a blood fraction or brain homogenate, preferably from blood plasma.",
        "28. The use of claim 26, wherein the sepharose is a metal-chelating sepharose, preferably comprising a divalent metal ion, more preferably a metal ion selected from the group consisting of Ni2+, Co2+, Zn2+ and Mn2+, most preferably Zn2+."
    ]
}