{
    "id": "US20170009267",
    "authors": [
        "Long Liu",
        "Jian Chen",
        "Guocheng Du",
        "Jianghua Li",
        "Yanfeng Liu",
        "Hannes Link",
        "Uwe Sauer"
    ],
    "title": "Method for Enhancing N-acetylglucosamine Production through glcK Knockout of Bacillus subtilis",
    "date": "2015-11-06 00:00:00",
    "abstract": "The present invention provides a method for enhancing N-acetylglucosamine production by usage of a recombinant Bacillus subtilis with a glcK knockout. This invention enhanced the production of GlcNAc by knocking out the glcK gene which encodes a glucokinase, thus eliminating the GlcNAc phosphorylation to GlcNAc-6-P. The specific growth rate and content of GlcNAc in the supernatant of the recombinant Bacillus subtilis with the glcK knockout were 0.15 h−1 and 3.0 g/L, respectively, which were 2.32 times and 2.14 times of those of the control strain without glcK knockout. The recombinant Bacillus subtilis of the present invention would be potentially useful for industrial production of GlcNAc.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "CROSS-REFERENCES AND RELATED APPLICATIONS",
                    "paragraphs": [
                        "This application claims the benefit of priority to Chinese Application No. 201510394205.7, entitled “A method for enhancing N-acetylglucosamine production through glcK knockout of Bacillus subtilis”, filed Jul. 7, 2015, which is herein incorporated by reference in its entirety."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "claim priority to Chinese Application"
                    ],
                    "num_characters": 278,
                    "outline_medium": [
                        "claim priority to Chinese Application"
                    ],
                    "outline_short": [
                        "claim priority to Chinese Application"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Field of the Invention",
                        "The present invention relates to the field of genetic engineering, and more particularly relates to a method for enhancing N-acetylglucosamine production through glcK knockout of Bacillus subtilis.",
                        "Description of the Related Art",
                        "N-acetylglucosamine (GlcNAc) is a monosaccharide which is widespread in bacteria, yeast, fungi, plants and animals. As a precursor of glycosaminoglycan building blocks, it plays an important role in cartilage and joint health in the human body. Therefore, GlcNAc has long been used as pharmaceuticals and dietary supplements to cure osteroarthritis and maintain cartilage and joint health. In addition, it has wide application in the cosmetic and pharmaceutical fields. Currently, GlcNAc is mainly produced through acid hydrolysis of chitin extracted from crab and shrimp shells; however, this extraction method poses problems such as severe environmental pollution and potential allergic reactions in consumers.",
                        "Bacillus subtilis (B. subtilis) has long been used as a production host for manufacturing pharmaceutically important biochemicals and industrially useful components that meet GRAS grade requirements. Therefore, constructing recombinant B. subtilis by metabolic engineering would be an effective strategy to produce GRAS grade GlcNAc.",
                        "In previous work, a recombinant B. subtilis named BSGN6-PxylA-glmS-P43-GNA1 was constructed to produce GlcNAc (Ref: Liu, Y. et al. Modular pathway engineering of Bacillus subtilis for improved N-acetylglucosamine production. Metab. Eng. 23: 42-52, 2014). And the fermentation medium for GlcNAc production was complex medium, which contained corn steep liquor, yeast extract, tryptone, glucose, etc. However, the stability and controllability of the fermentation process were severely influenced by the complex medium, due to the fact that the compositions of the complex medium in different batches were quite different, especially the corn steep liquor. In addition, the high cost of the complex medium has become a major constraint in industrial production of GlcNAc by recombinant B. subtilis. Thus, it would be a great strategy to use synthetic medium for fermentation, which would avoid the differences of the complex medium in different batches and significantly reduce the costs and facilitate the separation and purification of the product. However, experimental data showed that the growth of BSGN6-PxylA-g/mS-P43-GNA1was slow and the yield of GlcNAc was significantly reduced in the synthetic medium compared to the complex medium. Therefore, it has become an urgent problem to enhance the GlcNAc production of recombinant B. subtilis in synthetic media.",
                        "The present invention provides a method to enhance the GlcNAc production of recombinant B. subtilis in synthetic media and provides other benefits as well."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to genetic engineering",
                        "describe GlcNAc",
                        "describe current GlcNAc production",
                        "describe limitations of current production",
                        "motivate need for new method"
                    ],
                    "num_characters": 2825,
                    "outline_medium": [
                        "introduce N-acetylglucosamine",
                        "limitations of current production methods"
                    ],
                    "outline_short": [
                        "motivate N-acetylglucosamine production"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The goal of the present invention is to provide a method for enhancing N-acetylglucosamine production of recombinant B. subtilis in synthetic medium. The method is to knock out the glcK gene from the strain BSGN6-PxylA-glmS-P43-GNA1 and use the recombinant B. subtilis thus obtained to produce GlcNAc. The strain BSGN6-PxylA-glmS-P43-GNA1 is constructed from B. subtilis 168 Δ nagP Δ gamP Δ gamA Δ nagA Δ nagB Δ ldh Δ pta::lox72, and the expression of glmS and GNA1 in this strain are under the control of promoter PxylA and P43, respectively.",
                        "In one embodiment of the present invention, the nucleotide sequence of the glcK which encodes a glucokinase is shown in NCBI with a gene ID: 938206.",
                        "In one embodiment of the present invention, the method of constructing the BSGN6-PxylA-glmS-P43-GNA1 could be referred to a literature (Liu, Y. et al. Modular pathway engineering of Bacillus subtilis for improved N-acetylglucosamine production. Metab. Eng. 23: 42-52, 2014).",
                        "In one embodiment of the present invention, the GNA1 gene was expressed by the plasmid pP43-GNA1, and the glmS gene was integratively expressed through the plasmid pM7Z6M-PxylA-glmS.",
                        "In one embodiment of the present invention, the knockout of the glcK gene was achieved by two steps: first, a knockout cassette of glcK gene containing a spectinomycin resistance gene spc was constructed, and then the glcK gene of the BSGN6-PxylA-glmS-P43-GNA1 was replaced by spc through homologous recombination. The GlcNAc phosphorylation to N-acetylglucosamine-6-phosphate (GlcNAc-6-P) was eliminated through glcK knockout, resulting in increased yield of GlcNAc.",
                        "The present invention also provides a recombinant B. subtilis with enhanced GlcNAc production in synthetic medium. The recombinant B. subtilis was constructed by knocking out the glcK gene of the strain BSGN6-Pxy/A-glmS-P43-GNA1. And the BSGN6-PxylA-glmS-P43-GNA1 was constructed from B. subtilis 168 Δ nagP Δ gamP Δ gamA Δ nagA Δ nagB Δ ldh Δ pta::lox72, and the expression of glmS and GNA1 of it were under the control of promoter PxylA and P43, respectively.",
                        "The present invention also provides a method for producing GlcNAc by the recombinant B. subtilis in a synthetic medium containing 20 g/L glucose, 6-8 g/L Na2HPO4, 1-1.5 g/L KH2PO4, 2-2.5 g/L (NH4)2SO4, 0.2-0.3 g/L MgSO4, 0.5-1.0 g/L FeSO4.7H2O, 0.05-0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan.",
                        "In one embodiment of the present invention, 20 g/L glucose, 7.1 g/L Na2HPO4, 1.35 g/L KH2PO4, 2 g/L (NH4)2SO4, 0.25 g/L MgSO4, 1.0 g/L FeSO4.7H2O, 0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan was contained in the synthetic medium.",
                        "In one embodiment of the present invention, the method was to transfer the activated seeds of the glcK knockout recombinant B. subtilis into the synthetic medium with a inoculum amount of 5% -10% and add xylose as the inducer, and then cultivate the culture for 28-30 hours at 35-37° C. and 200-220 rpm.",
                        "Through 13C isotope labeling experiments and gene homologous analysis, the inventors found that the glucokinase is a key enzyme of the reverse reaction of GlcNAc biosynthesis, which catalyses the GlcNAc into GlcNAc-6-P. Therefore, to enhance the production of GlcNAc, the glcK encoding the glucokinase should be knocked out to eliminate the reaction of converting GlcNAc into GlcNAc-6-P.",
                        "The recombinant B. subtilis with the glcK knockout in the present invention exhibits enhanced GlcNAc production in a synthetic medium, which could reach 3.0 g/L. Although the titer (3.0 g/L) is slightly lower than that of the previous strain BSGN6-PxylA-g/mS-P43-GNA1 in a complex medium (3.55 g/L), the yield of GlcNAc (150.00 mg/g) is 2.3 times and 1.7 times of those of the BSGN6-PxylA-g/mS-P43-GNA1 in the synthetic medium (65.00 mg/g) and the complex medium (88.75 mg/g), respectively. In addition, the production of the recombinant B. subtilis in the present invention could be further improved by optimizing the components of the medium and the fermentation conditions of fed-batch. The present invention makes a contribution to improve GlcNAc production. And the glcK knockout recombinant B. subtilis of the invention has good prospects in industrial production of GlcNAc."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Materials and Methods**",
                                "GlcNAc was detected and quantified by HPLC. The apparatus was agilent 1200 with a differential refraction detector (RID) detector, and the separation column was an NH2 column (250*4.6 mm, 5 m). 70% acetonitrile was used as the mobile phase with a flow rate of 0.75 ml/min. And the column temperature was 30° C., the sample volume was 10 nL.",
                                "Seed medium: 10 g/L tryptone, 5 g/L yeast extract, 20 g/L NaCl.",
                                "Fermentation medium: a synthetic medium containing 20 g/L glucose, 7.1 g/L Na2HPO4, 1.35 g/L KH2PO4, 2 g/L (NH4)2SO4, 0.25 g/L MgSO4, 1.0 g/L FeSO4.7H2O, 0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan.",
                                "Cultivation conditions: recombinant B. subtilis seeds were activated at 37° C., 200 rpm for 12 hours in a seed medium and were transferred into the fermentation medium with a inoculum amount of 5% and xylose was added to the medium to a final concentration of 5 g/L as the inducer, and then the culture was cultivated for 30 hours at 37° C. and 200 rpm.",
                                "**Example 1**",
                                "**Knockout of the glcK Gene Encoding a Glucokinase**",
                                "A knockout cassette was constructed based on the front and back sequences of the glcK gene of B. subtilis 168 (purchased from the American Type Culture Collection with the ATCC catalog No. 27370) and the sequence of a spectinomycin resistance gene published on NCBI. The nucleotide sequence of the knockout cassette was the same as SEQ ID NO:1.",
                                "The knockout cassette was then transformed into the recombinant strain BSGN6-PxylA-glmS-P43-GNA1, and the recombinant glcK knockout B. subtilis named BSGNK was obtained through spectinomycin screening and colony PCR verification. The construction of the BSGN6-PxylA-glmS-P43-GNA1 could be referred to a periodical literature (Liu, Y. et al. Modular pathway engineering of Bacillus subtilis for improved N-acetylglucosamine production. Metab. Eng. 23: 42-52, 2014). And the expression of glmS and GNA1 of BSGN6-PxylA-glmS-P43-GNA1 were under the control of promoter PxylA and P43, respectively.",
                                "**Example 2**",
                                "**Fermentation of GlcNAc by the Recombinant B. subtilis BSGNK**",
                                "Seeds of BSGNK were activated at 37° C., 200 rpm for 12 hours in the seed medium and were transferred into the fermentation medium (a synthetic medium) with an inoculum amount of 5% and xylose was added to the medium to a final concentration of 5 g/L as the inducer, and then the culture was cultivated for 30 hours at 37° C. and 200 rpm.",
                                "Results showed that the content of GlcNAc in the supernatant was 3.0 g/L and the specific growth rate of BSGNK was 0.15 h−1 in the synthetic medium, which were 2.32 times and 2.14 times of those of the control strain BSGN6-PxylA-glmS-P43-GNA1, respectively. It indicated that the GlcNAc production of recombinant B. subtilis in synthetic medium was enhanced.",
                                "Although the titer (3.0 g/L) was slightly lower than that of the previous strain BSGN6-PxylA-glmS-P43-GNA1 in complex medium (3.55 g/L), the yield (150.00 mg GlcNAc/g glucose) was 2.3 times or 1.7 times of those of the BSGN6-PxylA-glmS-P43-GNA1 in synthetic medium (65.00 mg/g) or complex medium (88.75 mg/g), respectively. In addition, the production of the recombinant B. subtilis in the present invention could be further improved by optimizing the components of the medium and the fermentation conditions of fed-batch. The present invention makes a contribution to improve GlcNAc production. And the obtained recombinant B. subtilis has good prospects in industrial production of GlcNAc.",
                                "While the present invention has been described in some detail for purposes of clarity and understanding, one skilled in the art will appreciate that various changes in form and detail can be made without departing from the true scope of the invention. All figures, tables, appendices, patents, patent applications and publications, referred to above, are hereby incorporated by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe materials and methods",
                                "describe seed medium",
                                "describe fermentation medium",
                                "describe cultivation conditions",
                                "describe knockout of glcK gene",
                                "describe fermentation of GlcNAc",
                                "describe results of fermentation"
                            ],
                            "num_characters": 3877,
                            "outline_medium": [
                                "describe materials and methods",
                                "describe knockout of glcK gene",
                                "describe fermentation of GlcNAc"
                            ],
                            "outline_short": [
                                "illustrate knockout of glcK gene and fermentation of GlcNAc"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe goal of invention",
                        "describe method of glcK knockout",
                        "describe construction of BSGN6-PxylA-glmS-P43-GNA1",
                        "describe knockout of glcK gene",
                        "describe recombinant B. subtilis",
                        "describe method for producing GlcNAc",
                        "describe synthetic medium",
                        "describe benefits of invention"
                    ],
                    "num_characters": 4222,
                    "outline_medium": [
                        "describe goal of invention",
                        "describe method of glcK knockout",
                        "describe recombinant B. subtilis construction",
                        "describe GlcNAc production method"
                    ],
                    "outline_short": [
                        "describe method for enhancing GlcNAc production",
                        "describe recombinant B. subtilis with enhanced GlcNAc production"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for enhancing N-acetylglucosamine (GlcNAc) production of Bacillus subtilis, comprising:\na), knocking out a glcK gene of the strain BSGN6-PxylA-glmS-P43-GNA1 to obtain a recombinant glcK knockout Bacillus subtilis; and\nb), using the recombinant glcK knockout Bacillus subtilis obtained in step a) to produce GlcNAc, wherein said glcK gene encodes a glucokinase; and wherein said BSGN6-PxylA-glmS-P43-GNA1 is constructed from Bacillus subtilis 168 Δ nagP Δ gamP Δ gamA Δ nagA Δ nagB Δ ldh Δ pta::lox72, and the expression of glmS and GNA1 in said BSGN6-PxylA-glmS-P43-GNA1 are under the control of promoter PxylA and P43, respectively.",
        "2. The method of claim 1, the nucleotide sequence of said glcK is shown in NCBI with a gene ID: 938206.",
        "3. The method of claim 1, wherein said glcK gene is knocked out by the following steps:\na), constructing a knockout cassette of said glcK gene containing a spectinomycin resistance gene spc; and\nb), replacing said glcK gene of BSGN6-PxylA-glmS-P43-GNA1 with said spc gene by transforming said knockout cassette into said BSGN6-PxylA-glmS-P43-GNA1.",
        "4. The method of claim 1, wherein said GlcNAc production is conducted in a synthetic medium.",
        "5. The method of claim 4, wherein said GlcNAc production is conducted in a synthetic medium containing 20 g/L glucose, 6-8 g/L Na2HPO4, 1-1.5 g/L KH2PO4, 2-2.5 g/L (NH4)2SO4, 0.2-0.3 g/L MgSO4, 0.5-1.0 g/L FeSO4.7H2O, 0.05-0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan.",
        "6. A recombinant Bacillus subtilis with enhanced GlcNAc production, wherein said recombinant Bacillus subtilis is constructed by knocking out a glcK gene of the strain BSGN6-PxylA-glmS-P43-GNA1; and wherein said BSGN6-PxylA-glmS-P43-GNA1 is constructed from Bacillus subtilis 168 Δ nagP Δ gamP Δ gamA Δ nagA Δ nagB Δ ldh Δ pta::lox72, and the expression of glmS and GNA1 of said BSGN6-PxylA-glmS-P43-GNA1 are under the control of promoter PxylA and P43, respectively.",
        "7. A method for production of GlcNAc, comprising producing GlcNAc by using the recombinant Bacillus subtilis of claim 6, wherein said recombinant Bacillus subtilis is cultured in a synthetic medium to produce GlcNAc; and wherein said synthetic medium contains 20 g/L glucose, 6-8 g/L Na2HPO4, 1-1.5 g/L KH2PO4, 2-2.5 g/L (NH4)2SO4, 0.2-0.3 g/L MgSO4, 0.5-1.0 g/L FeSO4.7H2O, 0.05-0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan.",
        "8. The method of claim 7, wherein said synthetic medium contains 20 g/L glucose, 7.1 g/L Na2HPO4, 1.35 g/L KH2PO4, 2 g/L (NH4)2SO4, 0.25 g/L MgSO4, 1.0 g/L FeSO4.7H2O, 0.1 g/L MnSO4.4H2O, 0.01 g/L thymine and 0.01 g/L tryptophan.",
        "9. The method of claim 7, wherein said method for producing GlcNAc comprises\na), transferring activated seeds of said recombinant Bacillus subtilis into said synthetic medium with an inoculum amount of 5% -10% and adding xylose as an inducer; and\nb), cultivating for 28-30 hours at 35-37° C. and 200-220 rpm.",
        "10. The method of claim 9, wherein said xylose is added to said synthetic medium to a final concentration of 5 g/L."
    ]
}