{
    "id": "US20160198970",
    "authors": [
        "Garry Liu",
        "Graham Wright"
    ],
    "title": "METHOD FOR DETERMINING DIASTASIS TIMING USING AN MRI SEPTAL SCOUT",
    "date": "2014-07-31 00:00:00",
    "abstract": "A new MRI imaging sequence, the Septal Scout, has been presented. This new technique can accurately determine the timing of diastasis windows for the purpose of cardiac gating in applications such as high-resolution coronary MRA. The Septal Scout acquires 1D MR images along the long-axis of the basal ventricular septum either through projection imaging or 2D excitations. Each acquisition produces a line of data along the ventricular septum. The acquisition is repeated over time to generate a time-map of Septal Scouts. The data from the Septal Scout time-map is processed to generate a velocity graph of an ROI near the basal septum. From this graph, the beginning and end of diastasis is determined. This timing information is available for use to facilitate cardiac gating in subsequent high-resolution MR angiography.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD",
                    "paragraphs": [
                        "The present disclosure relates to the magnetic resonance imaging (MRI) of the heart. Specifically, the present disclosure relates to the determination of timing of cardiac-cycle phases to guide cardiac MRI."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to MRI of the heart"
                    ],
                    "num_characters": 206,
                    "outline_medium": [
                        "relate to MRI of the heart"
                    ],
                    "outline_short": [
                        "relate to cardiac MRI"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Currently, the slow data acquisition speed of cardiac magnetic resonance imaging (MRI) requires image acquisition to span multiple heartbeats in many applications involving the imaging of the heart. Under this circumstance, to prevent motion artifacts resulting from the heart beating during data acquisition, beat-to-beat data acquisitions need to be synchronized to the same stationary phase of the cardiac cycle. Typically, diastasis is the longest stationary period of the cardiac cycle; it occurs in between the periods of ventricular fast filling and atrial contraction during ventricular diastole (see FIG. 1). Because cardiac motion is periodic, image data acquired during diastasis over multiple heartbeats will appear to be acquired while the heart is still, provided that the relevant physiology of the imaging subject such as the heart rate remains the same during imaging. This is the principle behind prospective cardiac gating.",
                        "Typically, to perform prospective cardiac gating, the gating parameters need to be set prior to image acquisition. Ideal gating parameters, however, vary between subjects, and with heart rate. Therefore, calibration of gating parameters is desirable. For example, currently in MRI, a low spatial-resolution video of the 4-chamber view of the heart is acquired and used to determine the timing of the diastasis window, usually by a visual search for serial stationary frames. This approach, however, may produce gating errors on the order of tens of milliseconds due to limited temporal and/or spatial resolution of the calibration video. Since diastasis is preceded and succeeded by periods of significant ventricular motion, gating errors of tens of milliseconds may incur significant motion artifacts in high-resolution applications of cardiac imaging such as coronary angiography.",
                        "Liu et al. has demonstrated, using ultrasound and x-ray imaging, that long-axis motion and stasis of the basal ventricular septum accurately predict the motion and stasis of the coronary vasculature, respectively [1]. Septal motion-based cardiac gating is therefore more accurate than conventional ECG gating. It is desirable to have an MRI-based technique that measures septal motion to determine the cardiac gating parameters for cardiac MRI applications."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce cardiac MRI limitations",
                        "explain prospective cardiac gating",
                        "describe calibration of gating parameters",
                        "motivate septal motion-based cardiac gating"
                    ],
                    "num_characters": 2286,
                    "outline_medium": [
                        "introduce cardiac MRI limitations",
                        "motivate septal motion-based cardiac gating"
                    ],
                    "outline_short": [
                        "motivate cardiac gating"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "In embodiments disclosed herein, a method and system for determining the timing of diastasis using MRI cardiac imaging are disclosed. Tissue along the long-axis of a patient's ventricular septum is activated by the MRI and images are taken of a region of interest such that a time map of the MR images is produced. In a preferred embodiment, the region of interest is at the base of the septum and the images are generated by using a 1D steady-state free-precession pulse sequence or by 2D excitations. The images are then processed such that a velocity graph of points in the region of interest is generated over the course of at least a heartbeat.",
                        "The start and end times of the diastasis period is then determined. The start and end times are typically measured as a delay relative to the beginning of the heartbeat, typically chosen to be the onset of ventricular systole, which in turn is typically indicated by the R-peak of the ECG, a characteristic point determinable by someone skilled in the art of medical imaging. Therefore, in an embodiment, the ECG is used alongside the present disclosed method.",
                        "Upon locating the R-peak, the start and end times of the diastasis can typically be determined by finding, on the velocity graph, the period of low velocity in between the early and late ventricular filling peaks. Many methods are known to someone skilled in the art for determining this low velocity period. The method for selecting the diastasis period is non-specific to the present disclosure. In the preferred embodiment, the diastasis period is defined to be in between the first and last inflection points, respectively, enclosed by the early and late ventricular filling peaks of the velocity graph. The early and late ventricular filling peaks are determinable by someone skilled in the art. The inflection points are second derivative nulls representing the approach to and departure from the low velocity time period. In another embodiment, the diastasis period may be defined as the time period between the early and late ventricular filling peaks that fall below an arbitrary velocity threshold.",
                        "MR images may be generated using magnitude or phase data observed by the MRI detectors. In a preferred embodiment, diastasis is determined by intersecting findings over multiple heartbeats. In an embodiment, diastasis may be determined for a single heartbeat.",
                        "A further understanding of the functional and advantageous aspects of the disclosure can be realized by reference to the following detailed description and drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for determining diastasis timing",
                        "describe MRI image acquisition",
                        "explain image processing for velocity graph",
                        "determine start and end times of diastasis",
                        "outline variations of diastasis period definition"
                    ],
                    "num_characters": 2549,
                    "outline_medium": [
                        "introduce MRI-based technique for determining diastasis",
                        "outline method for determining diastasis period"
                    ],
                    "outline_short": [
                        "introduce septal motion-based cardiac gating"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Various embodiments and aspects of the disclosure will be described with reference to details discussed below. The following description and drawings are illustrative of the disclosure and are not to be construed as limiting the disclosure. The drawings are not necessarily to scale. Numerous specific details are described to provide a thorough understanding of various embodiments of the present disclosure. However, in certain instances, well-known or conventional details are not described in order to provide a concise discussion of embodiments of the present disclosure.",
                        "As used herein, the terms, “comprises” and “comprising” are to be construed as being inclusive and open ended, and not exclusive. Specifically, when used in this specification including claims, the terms, “comprises” and “comprising” and variations thereof mean the specified features, steps or components are included. These terms are not to be interpreted to exclude the presence of other features, steps or components.",
                        "As used herein, the term “exemplary” means “serving as an example, instance, or illustration,” and should not be construed as preferred or advantageous over other configurations disclosed herein.",
                        "As used herein, the term “diastasis window” refers to the time period spanning ventricular diastasis; “imaging window” refers to the time period spanning image data acquisition; and, “cardiac gating” refers to the method of synchronizing the imaging window to the diastasis window on a heartbeat-to-heartbeat basis for the purpose of avoiding cardiac motion artifacts.",
                        "As used herein, the expression “electrocardiogram” (ECG) is the graphical output of an electrical measurement obtained over a period of time from a pair of non-overlapping electrodes placed on a person's body surface. The electrodes detect the electrical activity of the person's heart. Typically, for MRI, more than two electrodes are placed on the person's chest, providing multiple ECG signals, known as “ECG leads.”",
                        "As used herein, the expression “R-peak” refers to the signal deflection on the ECG that is (1) associated in time with the onset of ventricular systole; and (2) caused by a bioelectrical depolarization wave propagating through the ventricular myocardium as observed by the electrodes on the body surface. The R-peak is often used to mark the beginning of a heartbeat.",
                        "As used herein, the expression “steady-state free-precession (SSFP) pulse sequence” refers to an MRI pulse sequence where (1) the readout gradient comprises of a zeroth- and first-moment nulled waveform; and (2) the transverse magnetization reaches a non-zero steady state prior to the application of each excitation pulse.",
                        "As used herein, the expression “1 D SSFP pulse sequence” refers to an SSFP pulse sequence used in conjunction with a slice excitation, and no phase encode gradients. The resultant reconstructed MR image is a 1D line image corresponding to the in-plane projection of the excited slice.",
                        "As used herein, the expression “k-space” refers to the data acquisition space in the MR image acquisition process.",
                        "As used herein, the expression “reconstructed image” refers to the image formed by processing the k-space data. Typically, this image reconstruction process involves the Fourier transform. The reconstructed image is comprised of pixel values of the complex mathematical type:",
                        "I=A+Bi  (Eq. 1)",
                        "where I is the image matrix of pixel values, and A and B are the real and imaginary components, respectively, of I.",
                        "As used herein, the expression “magnitude image” means an image composed of the magnitude of the reconstructed image:",
                        "IM=|I|",
                        "IM=√{square root over (A2+B2)}   (Eq. 2)",
                        "where IM is the magnitude image.",
                        "As used herein, the expression “phase image” means an image composed of the phase of the reconstructed image:",
                        "\\(\\begin{matrix}\n{{I_{\\phi} = {\\arg (I)}}{I_{\\phi} = \\left\\{ \\begin{matrix}\n{\\tan^{- 1}\\left( \\frac{B}{A} \\right)} & {{{if}\\mspace{14mu} A} > 0} \\\\\n{{\\tan^{- 1}\\left( \\frac{B}{A} \\right)} + \\pi} & {{{if}\\mspace{14mu} A} < {0\\mspace{14mu} {and}\\mspace{14mu} B} \\geq 0} \\\\\n{{\\tan^{- 1}\\left( \\frac{B}{A} \\right)} - \\pi} & {{{if}\\mspace{14mu} A} < {0\\mspace{14mu} {and}\\mspace{14mu} B} < 0} \\\\\n\\frac{\\pi}{2} & {{{if}\\mspace{14mu} A} = {{0\\mspace{14mu} {and}\\mspace{14mu} B} > 0}} \\\\\n{- \\frac{\\pi}{2}} & {{{if}\\mspace{14mu} A} = {{0\\mspace{14mu} {and}\\mspace{14mu} B} < 0}} \\\\\n{{in}\\mspace{14mu} {determinate}} & {{{if}\\mspace{14mu} A} = {{0\\mspace{14mu} {and}\\mspace{14mu} B} = 0}}\n\\end{matrix} \\right.}} & \\left( {{Eq}.\\mspace{11mu} 3} \\right)\n\\end{matrix}\\)",
                        "where Iφ is the phase image.",
                        "As used herein, the expression “projection” as applied to an image means to reduce the typically two-dimensional image to a one-dimensional line image by summing the pixel intensities along one direction. For example, the magnitude projection of an image along the row-direction is the summation of all the magnitude pixel intensities by the columns of the image to form a single row of magnitude intensities.",
                        "In medical imaging today, cardiac gating is commonly performed by referencing the electrocardiogram (ECG), a depiction of the electrical activity of the heart produced by measuring the voltage across pairs of electrodes placed on the chest. With reference to FIG. 1, the R-peak on the ECG is produced by the quickly propagating depolarization wave that triggers ventricular contraction, and the T-wave is produced by the subsequent slower repolarization process that accompanies ventricular relaxation. Isovolumic (ventricular) contraction, and ejection occur between the R-peak and the T-wave terminus; isovolumic relaxation, rapid filling, diastasis, and atrial contraction occur between the T-wave terminus and the R-peak. Since the R-peak is the most detectable feature of the ECG signal, it is used to mark the beginning of a cardiac cycle.",
                        "As used herein, the term “RR interval” refers to the time between two adjacent R-peaks on the ECG. It corresponds to the cardiac cycle duration, typically measured in milliseconds, and is inversely related to heart rate, typically measured in beats per minute.",
                        "As used herein, the term “trigger delay” refers to the time from the R-peak to the start of the imaging window.",
                        "As used herein, the term “gating parameters” refers to the trigger delay and imaging window duration.",
                        "As used herein, the term “gating error” refers to a misalignment between the imaging window and the diastasis window, causing a time difference between (a) the trigger delay and the beginning of the diastasis window, and/or (b) the imaging window duration and the diastasis window duration.",
                        "The present disclosure provides an MRI technique for determining the start and end of diastasis based on motion measurements of the ventricular septum. The technique provides line images, herein denoted “Septal Scouts,” that are magnitude projections of an image plane, herein denoted “Scout Plane,” which is oriented to be perpendicular to the 4-chamber long-axis plane and intersecting the approximate line formed by the septal wall, parallel to the long axis of the heart; the projection direction is through the 4-chamber long-axis plane (see FIG. 2). In the preferred embodiment, the Septal Scout image contrast is obtained by a 1D steady-state free-precession (SSFP) pulse sequence. In another embodiment, the Septal Scout image may be obtained by other 1D MR pulse sequences. It should be noted that the Septal Scout method is not limited to the SSFP family of pulse sequences, and that someone who is skilled in the art of MRI will be familiar with alternative sequences that although may provide different image contrast do not ultimately change the Septal Scout method itself.",
                        "Referring now to FIG. 3, the Septal Scout line acquisitions (dotted white line) are repeated over time at a selectable temporal resolution on the order of milliseconds. In an embodiment of the present disclosure, the technique is performed during a breath hold, and respiratory motion is therefore negligible. Due to the fact that cardiac motion is the only dynamic component in the Scout Plane, the Septal Scouts encode long-axis displacements of the septum. The Septal displacement over time can be extracted from this Septal Scout time-map by analyzing the region-of-interest (ROI) spanning a small selectable depth range (approximately 1 cm) near the basal ventricular septum (dotted white box).",
                        "Referring now to FIG. 4, the set of Septal Scouts over time is processed to provide displacement measurements of an ROI spanning a small depth range (approximately 1 cm) near the basal ventricular septum. In one embodiment the displacement graph is obtained by first tracking an ROI on the first Septal Scout line to its displaced position on the second Septal Scout line. This is achieved by finding an ROI on the second Septal Scout line that provides the maximum correlation with the ROI on the first line, and recording the position of the tracked ROI on the second line. This process is repeated with successive pairs of Septal Scout lines to provide a step by step displacement graph of the basal ventricular septum. In an embodiment of the present disclosure, the displacement graph is obtained by averaging all the Septal Scout line intensities within a small depth range—about 1 cm—near the basal septum. The averaging operation suppresses image noise while it is assumed that the tissue within the small depth range moves approximately rigidly. Given the technique provides sufficient temporal resolution and that the Septal Scout line images have non-constant intensity patterns, this displacement graph can be differentiated in time to provide a velocity graph. This method operates on the principle that pixel intensity changes in the Septal Scout image is mainly caused by motion of the septum.",
                        "Referring now to FIG. 5, the displacement graph provided in FIG. 4 is processed to provide a corresponding velocity graph. In an embodiment, the displacement graph is differentiated in time to provide the velocity graph.",
                        "The velocity graph shows phases of ventricular dynamics and stases. It should be noted that the method for selecting the diastasis period is non-specific to the present disclosure. Many methods are known to someone skilled in the art. In the present embodiment, the start and end of diastasis is determined by the first and last inflection points (2nd derivative nulls), respectively, enclosed by the early and late ventricular filling peaks on the velocity graph. These characteristic time points represent the approach to and departure from the expected low velocity period enclosed in between early and late ventricular filling. In another embodiment, the start and end of diastasis may be determined by identifying a time period in between the early and late ventricular filling peaks during which the absolute value of the velocity function is below a selected threshold.",
                        "An embodiment of the present disclosure provides the use of two-dimensional (2D) excitation schemes. More specifically, the Septal Scout is no longer obtained by a one-dimensional projection of an excited Scout Plane. Rather, a 2D excitation pulse is used to excite a line or column of tissue at the intersection of the Scout Plane and the 4-chamber long-axis plane. The Septal Scout is then directly detected from the excited tissue. The cross-sectional shape of the column excitation is selectable, but is typically a circle. In addition, another 2D excitation scheme may be used. The Scout Plane and the 4-chamber long-axis plane may both be excited at half power, one immediately after the other; the two excited planes will produce a full power excitation at their intersection. The resultant Septal Scout will have a dominant signal source from the intersection of the two excited planes. The combination of excitation powers in this scheme is selectable.",
                        "An embodiment of the present disclosure provides the use of phase images in the Septal Scouts in addition to the conventional magnitude images. For example, the phase images of the Septal Scout are suitable for detecting accelerating blood or tissue where high intensities on the phase images represent high acceleration. This is described in more detail below in another embodiment of the present disclosure.",
                        "An embodiment of the present disclosure provides the determination of other cardiac phases, such as the end-systole period as an alternative cardiac gating window at high heart rates. End-systole is a low-cardiac-motion period that exists in between ventricular ejection and fast filling during the phase of isovolumic relaxation. It is typically shorter than diastasis, lasting less than 100 ms. In this embodiment, the Septal Scout velocity graph is used to identify a period of low velocity before the early ventricular filling peak. Specifically, the start and end of the end-systole period may be determined by identifying a time period before the early ventricular filling peak during which the absolute value of the velocity graph is below a selected threshold.",
                        "An embodiment of the present disclosure combines the Septal Scout technique with existing free-breathing MRI using respiratory navigators. To perform MRI during free-breathing, image data acquisitions are typically gated to the end-expiration phase of tidal breathing. Respiratory navigators are short MRI acquisitions that monitor the caudo-cranial position of the diaphragm, where end-expiration corresponds to the diaphragm being situated at the most caudal monitored position. In this embodiment, an MRA acquisition is performed during free-breathing. The Septal Scout is used to guide cardiac gating. At the same time, a respiratory navigator is used to identify the cardiac gating periods that occur during end-expiration. The data acquired during these coincident periods of cardiac and respiratory stasis are deemed free from motion artifacts and retained for reconstruction.",
                        "An embodiment of the present disclosure provides real-time acquisition of Septal Scouts such that the cardiac-gated imaging is triggered and terminated upon the real-time detection of the onset and end of diastasis, respectively. In this way, this implementation of the Septal Scout technique mimics a navigator approach. Furthermore, this embodiment precludes the use of the ECG for determining the imaging windows; rather, the R-peak of the ECG may be used to indicate the beginning of a pre-acquisition period during which contrast preparation such as fat-suppression may be performed.",
                        "An embodiment of the present disclosure provides an MRI-based cardiac gating system (MRI-CGS) based on the use of the Septal Scout. This system provides the benefit of not having to maintain an ECG signal to perform cardiac-gated MR imaging. Currently, the ECG signal may arbitrarily deteriorate due to loosened connections at the chest electrodes; also, R-peak detection may fail due to significant T-wave amplification. This system embodiment comprises of five functions:",
                        "Function 1: Calibration Scan\n\n\n- - The system provides a gating window calibration scan. This scan\n    performs Septal Scout acquisitions throughout a 20-second breath\n    hold and determines, per heartbeat, diastasis start and end times\n    relative to the corresponding systole onset. A multi-heartbeat\n    imaging window that is intended to be compatible with the observed\n    heart-rate variability (HRV) during the breath hold is then\n    determined based on the intersection of the set of estimated\n    diastasis windows. The approach here is to use smaller imaging\n    windows to compensate for HRV in a multi-heartbeat acquisition.\n    Alternatively, the system may aim to determine imaging windows in\n    realtime during the same heartbeat as the image acquisition; this\n    approach was not chosen to form the preliminary system design due to\n    the associated practical limitations.",
                        "Function 2: Calibration Check\n\n\n- - The system provides a calibration check at the beginning of each MRA\n    acquisition. This scan applies the Septal Scout method during a\n    heartbeat before the MRA scan. If the multi-heartbeat imaging window\n    determined at calibration extends earlier and/or later beyond the\n    diastasis window determined by the calibration check, the system\n    indicates a need for recalibration of the gating parameters. This\n    functionality attempts to detect when the MRI-CGS calibration has\n    become obsolete. Typically, a change in the resting heart rate\n    requires a recalibration.",
                        "Function 3: Ventricular Systole Detection\n\n\n- - The system detects ventricular systole. Prospective gating requires\n    a time reference at a consistent phase of the cardiac cycle for each\n    heartbeat like the R-peak on the ECG, which marks the electrical\n    onset of ventricular systole. Ventricular systole is a good\n    candidate for the reference because (1) it typically occurs several\n    hundreds of milliseconds before diastasis and therefore provides\n    time for contrast preparation; and (2) it comprises of rapidly\n    occurring events that are measurable such as ventricular\n    depolarization, and ventricular ejection of blood into the aorta\n    thereafter. The method of systole detection in the MRI-CGS may\n    employ the ECG. In an embodiment detailed later, the Septal Scout is\n    used to detect systole.",
                        "Function 4: Cardiac Gating\n\n\n- - The system uses the gating window timing parameters determined\n    during calibration, and limits imaging acquisition to that window\n    every heartbeat. The system begins by performing the Septal Scout to\n    identify systole onset in realtime, and then begins the count on the\n    imaging trigger delay, which will synchronize acquisition to the\n    beginning of diastasis. After acquiring data for the duration of the\n    imaging window, the system will resume Septal Scout scans to look\n    for the next occurrence of ventricular systole. The process repeats\n    until the MRA acquisition is completed.",
                        "Function 5: Heart Rate Variability Tracking\n\n\n- - The system monitors HRV. By tracking beat-to-beat ventricular\n    systole, the system will monitor the variability of heartbeat\n    durations (HBDs). For the nth heartbeat, failure to meet the\n    condition, HBD_(min)\\<HBD_(n)\\<HBD_(max) will cause the system to\n    indicate a need for recalibration; HBD_(min) and HBD_(max) are the\n    minimum and maximum HBDs detected, respectively, during the breath\n    held calibration scan.\n  - Along with tracking significant heart rate changes since the\n    calibration scan, the system will monitor the HRV thresholds that\n    have been shown by Leiner et al. to be effective buffers for\n    maintaining coronary artery image quality against HRV \\[5\\]. For any\n    n^(th) heartbeat during the MRA acquisition, the following condition\n    is monitored: (HBD_(mean)−10%)\\<HBDn\\<(HBD_(mean)+50%), where\n    HBD_(mean) is mean heart beat duration observed during calibration.\n    Failure to meet this condition for all heartbeats will flag the scan\n    for having high HRV. The user should consider this flag as a\n    recommendation to reacquire the data.\n  - This functionality is a check for significant changes in breath held\n    heart rate patterns during the MRA acquisition beyond what was\n    observed during calibration. It is also a check for a generally\n    unstable heart rate that is a known cause for poor image quality.",
                        "Referring now to FIG. 6, a flowchart is provided to illustrate the logical operations of the MRI-CGS system embodiment. Gating window calibration (Function 1) is performed at any point in the MRI study to calibrate the timing parameters of the estimated cardiac gating window to guide subsequent MRA acquisitions. Immediately before an MRA acquisition, a calibration check (Function 2) is performed to test whether a recalibration of the gating window is necessary. If not, the system proceeds to perform the MRA acquisition, which typically spans multiple heartbeats. The acquisition is therefore cardiac gated (Function 4). The HRV is tracked during the MRA acquisition, and an HRV check (Function 5) is performed to test whether the data needs to be reacquired. In an embodiment, the beginning of each heartbeat may be detected by the R-peak of the ECG (Function 3).",
                        "An embodiment of the present disclosure provides the detection of the onset of ventricular systole by monitoring the Septal Scout at depths that do not necessarily include the basal septum. Referring now to FIG. 7, a Septal Scout prescription similar to FIG. 2 is provided in (a) with the inclusion of the ascending aorta in the Scout Plane (dotted box). Four locations at different depths (D1, D2, D3, and D4) are shown. The Septal Scout time-map is shown in (b) spanning just over two heartbeats. Three displacement graphs are provided at D1, D2, and D3 for comparison from this map (dotted boxes). The phase-signal-version of the Septal Scout time-map is provided in (c). An absolute phase-intensity graph is provided at D4 near the ascending aorta by averaging the absolute phase intensities within D4. The corresponding displacement graphs for D1, D2, and D3, and the phase graph for D4 are shown in the right column. Note that an R-peak of the ECG corresponds to time zero, and at time 1023 ms. Red circles on each graph mark the supposed triggers that would represent the ventricular systole onset of each heartbeat according to the graph. This figure shows that there are various delays in systole detection relative to the R-peak by the different graphs. In terms of systole detection, D4 provides the least delay relative to the R-peak of the ECG, followed by an effective tie between D1 and D3, and then lastly, D2. Therefore, the Septal Scout provides several means for detecting the onset of ventricular systole.",
                        "An embodiment of the present disclosure provides imaging of a coronary artery stenosis using the Septal Scout. Referring now to FIG. 8, a male patient with originally suspected, and later confirmed coronary artery disease was imaged using x-ray angiography, and MRA. A severe stenosis at the proximal right coronary artery is shown by an x-ray angiography image (left) and marked by a double asterisk. The corresponding MRA image that was acquired using a cardiac gating window identified by the Septal Scout method is shown (centre) with the stenosis marked by a double asterisk. The MRA image that was acquired using the conventional MRI technique where the cardiac gating window is identified by a cine-MRI sequence is shown (right) with the stenosis marked by a double asterisk. The Septal Scout-guided MRA image shows a more continuous tapering at the proximal entrance of the stenosis site compared with the cine-MRI guided image, and agrees better with the x-ray image.",
                        "The present Septal Scout technique can be clearly distinguished from MRI navigator techniques. In the past, MR projection imaging has been used to characterize one-dimensional motion of the diaphragm in respiratory navigator techniques [2], and lateral walls of the heart for cardiac navigator techniques [3]. The present disclosure can be distinguished from these previous navigator techniques by having a different target region of interest (ROI) for motion monitoring. The present disclosure focuses on the basal ventricular septum as a surrogate for motion of the coronary vasculature, as demonstrated by Liu et. al. [1]. The present disclosure is a novel use of MRI to track septal motion for the purpose of determining cardiac gating windows that is not obvious to one skilled in the art.",
                        "The foregoing description of the preferred embodiments of the invention has been presented to illustrate the principles of the invention and not to limit the invention to the particular embodiment illustrated. It is intended that the scope of the invention be defined by all of the embodiments encompassed within the following claims and their equivalents."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce patent application structure",
                        "define terms used in patent application",
                        "describe medical imaging context",
                        "introduce cardiac gating concept",
                        "define RR interval and trigger delay",
                        "define gating parameters and gating error",
                        "introduce Septal Scout technique",
                        "describe Septal Scout image acquisition",
                        "define Scout Plane and 4-chamber long-axis plane",
                        "describe Septal Scout line acquisitions",
                        "introduce displacement measurements",
                        "describe displacement graph processing",
                        "introduce velocity graph processing",
                        "describe velocity graph features",
                        "introduce diastasis period determination",
                        "describe alternative diastasis period determination",
                        "introduce 2D excitation schemes",
                        "describe 2D excitation pulse",
                        "introduce phase images in Septal Scouts",
                        "describe phase image features",
                        "introduce end-systole period determination",
                        "describe end-systole period features",
                        "introduce free-breathing MRI with respiratory navigators",
                        "describe respiratory navigator functionality",
                        "introduce real-time Septal Scout acquisition",
                        "describe real-time cardiac-gated imaging",
                        "introduce MRI-based cardiac gating system (MRI-CGS)",
                        "describe calibration scan functionality",
                        "describe calibration check functionality",
                        "introduce ventricular systole detection",
                        "describe cardiac gating functionality",
                        "introduce heart rate variability tracking",
                        "describe HRV tracking functionality",
                        "introduce HRV check functionality",
                        "describe MRI-CGS system flowchart",
                        "introduce alternative ventricular systole detection",
                        "describe Septal Scout prescription",
                        "introduce displacement graphs at different depths",
                        "describe phase-intensity graph at ascending aorta",
                        "introduce systole detection comparison",
                        "describe imaging of coronary artery stenosis",
                        "introduce x-ray angiography image",
                        "describe MRA image using Septal Scout method",
                        "describe MRA image using conventional MRI technique",
                        "introduce comparison of MRA images",
                        "distinguish Septal Scout technique from MRI navigator techniques",
                        "conclude patent application"
                    ],
                    "num_characters": 24002,
                    "outline_medium": [
                        "introduce patent application structure",
                        "define terms used in patent application",
                        "describe medical imaging background",
                        "introduce cardiac gating concept",
                        "describe limitations of ECG-based cardiac gating",
                        "introduce Septal Scout technique",
                        "describe Septal Scout image acquisition process",
                        "explain Septal Scout image processing",
                        "describe displacement graph extraction",
                        "describe velocity graph extraction",
                        "introduce diastasis period determination",
                        "describe alternative embodiments for diastasis period determination",
                        "introduce 2D excitation schemes",
                        "describe phase image usage in Septal Scouts",
                        "introduce end-systole period determination",
                        "describe free-breathing MRI using respiratory navigators",
                        "introduce real-time Septal Scout acquisition",
                        "describe MRI-based cardiac gating system (MRI-CGS)",
                        "describe calibration scan function",
                        "describe calibration check function",
                        "describe ventricular systole detection function",
                        "describe cardiac gating function",
                        "describe heart rate variability tracking function"
                    ],
                    "outline_short": [
                        "define terms used in the patent application",
                        "describe the background of cardiac gating in medical imaging",
                        "introduce the Septal Scout technique for determining cardiac gating windows",
                        "describe the acquisition of Septal Scout line images",
                        "process Septal Scout images to obtain displacement and velocity graphs",
                        "determine the start and end of diastasis from the velocity graph",
                        "describe alternative embodiments of the Septal Scout technique",
                        "describe the use of phase images in the Septal Scout technique",
                        "describe the determination of other cardiac phases using the Septal Scout technique",
                        "describe the combination of the Septal Scout technique with existing MRI techniques",
                        "describe the MRI-based cardiac gating system (MRI-CGS) using the Septal Scout technique"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for determining the timing of diastasis using MRI cardiac imaging, comprising the steps of:\ni) obtaining a magnetic resonance (MR) image along the long-axis of a ventricular septum;\nii) repeating the step (i) over time to generate a time-map of the MR images; and\niii) processing the data from the time-map to determine one or both of the beginning and an end of diastasis.",
        "2. The method according to claim 1, wherein the step iii) comprises generating a position graph of a region of interest.",
        "3. The method according to claim 2, wherein the step iii) comprises generating a velocity graph of the region of interest.",
        "4. The method according to claim 3, wherein the velocity graph is generated by taking a first derivative with respect to time of the position graph of the region of interest.",
        "5. The method according to claim 2, wherein the region of interest is near the base of the septum.",
        "6. The method according to claim 2, wherein the region of interest spans a depth range of about 1 cm near the base of the septum.",
        "7. The method according to claim 2, wherein the MR images are line images obtained by an MR pulse sequence.",
        "8. The method according to claim 1, wherein the MR images are line images obtained by 2D excitations.",
        "9. The method according to claim 1, wherein the step (i) is performed during a breath hold.",
        "10. The method according to claim 1, wherein the beginning and the end of diastasis are determined relative to an R-peak.",
        "11. The method according to claim 10, wherein the R-peak is determined by using an ECG.",
        "12. The method according to claim 1, where the start and end times of diastasis are determined by finding time points that mark the approach to and departure from, respectively, a low velocity time period in between the velocity peaks associated with early and late ventricular filling.",
        "13. The method according to claim 1, where the start and end of diastasis is determined by finding a time period in between the velocity peaks associated with early and late ventricular filling where the absolute velocity is below a selected threshold.",
        "14. The method according to claim 1, wherein the magnetic resonance image is generated from phase data obtained from the MRI.",
        "15. The method according to claim 1, wherein the magnetic resonance image is generated from magnitude data obtained from the MRI.",
        "16. The method according to claim 1, wherein an overall diastasis window is determined by intersecting the diastasis windows from multiple heartbeats.",
        "17. The method according to claim 1, wherein an overall diastasis window is determined to be the period in between the average start and end times of the diastasis windows from multiple heartbeats.",
        "18. The method according to claim 1, wherein heart rate is observed such that an observation of a predetermined threshold of heart rate change indicates that a new timing of diastasis must be determined.",
        "19. A system for determining the timing of diastasis using MRI cardiac imaging, comprising:\nan MRI programmed for the magnetic activation of tissue along the long-axis of a ventricular septum;\na processing means for generating magnetic resonance (MR) images of a region of interest of the ventricular septum over the course of a plurality of heart beats such that a time-map of the MR images is obtained; and\na processing means for processing data from the time-map such that a beginning and an end of diastasis can be determined.",
        "20. The system according to claim 19, including generating a position graph of a region of interest.",
        "21. The system according to claim 20, including generating a velocity graph of the region of interest.",
        "22. The system according to claim 21, wherein the velocity graph is generated by taking a first derivative with respect to time of the position graph of the region of interest.",
        "23. The system according to claim 20, wherein the region of interest is near the base of the septum.",
        "24. The system according to claim 20, wherein the region of interest spans a depth range of about 1 cm near the base of the septum.",
        "25. The system according to claim 19, wherein the MR images are line images obtained by an MR pulse sequence.",
        "26. The system according to claim 19, wherein the MR images are line images obtained by 2D excitations.",
        "27. The system according to claim 19, wherein the MR images are generated during a breath hold.",
        "28. The system according to claim 19, wherein the beginning and the end of diastasis are determined relative to an R-peak.",
        "29. The system according to claim 28, wherein the R-peak is determined by using an ECG.",
        "30. The system according to claim 19, where the start and end times of diastasis are determined by finding time points that mark the approach to and departure from, respectively, a low velocity time period in between the velocity peaks associated with early and late ventricular filling.",
        "31. The system according to claim 19, where the start and end of diastasis is determined by finding a time period in between the velocity peaks associated with early and late ventricular filling where the absolute velocity is below a selected threshold.",
        "32. The system according to claim 19, wherein the magnetic resonance image is generated from phase data obtained from the MRI.",
        "33. The system according to claim 19, wherein the magnetic resonance image is generated from magnitude data obtained from the MRI.",
        "34. The system according to claim 19, wherein diastasis is determined by intersecting the diastasis windows from multiple heartbeats.",
        "35. The system according to claim 19, wherein diastasis is determined to be the period in between the average start and end times of the diastasis windows from multiple heartbeats.",
        "36. The system according to claim 19, wherein heart rate is observed such that an observation of a predetermined threshold of heart rate change signals that a new timing of diastasis must be determined."
    ]
}