{
    "id": "https://semopenalex.org/work/W2014594088",
    "authors": [
        "Michael Rudnicki",
        "Gerhard A. Müller",
        "Bernd Mayer",
        "Susanne Eder",
        "Philipp Eller",
        "Carla Zoja",
        "Judith Sunzenauer",
        "Paul Perco",
        "Johannes Leierer",
        "Hannes Neuwirt",
        "Susie Jane Noppert",
        "Gert Mayer",
        "Alexander R. Rosenkranz"
    ],
    "title": "Increased Renal Versican Expression Is Associated with Progression of Chronic Kidney Disease",
    "date": "2012-09-14",
    "abstract": "Novel prognostic markers for progression of kidney disease are needed to distinguish patients who might benefit from a more aggressive nephroprotective therapy. Expression of the proteoglycan versican was evaluated in renal transcriptomics profiles and in an independent set of 74 renal biopsies. Versican levels were correlated to histologic damage scores and to renal outcome, and versican expression and regulation was evaluated in vitro. In transcriptomics profiles of renal tissue versican was positively correlated with (i) histological parameters in kidney biopsies, (ii) progressive decline of renal function in proteinuric kidney diseases, and (iii) impaired renal function and histology scores in diabetic nephropathy. In an independent cohort of 74 biopsies of glomerular diseases renal RNA levels of versican isoforms V0 and V1, but not V2 and V3 correlated significantly with creatinine after a mean follow up time of 53 months. Versican isoforms V0 and V1 together with serum creatinine at time of biopsy and the degree of glomerulosclerosis predicted 20% and 24% of the variability of creatinine at follow up, which was significantly more than serum creatinine and histological parameters alone (16%). However, when patients with acute kidney failure at time of biopsy (n = 5) were excluded, the additive predictive value of versican V1 was only marginally higher (35%) than creatinine and glomerulosclerosis alone (34%). Versican isoforms V0 and V1 were primarily expressed in vitro in proximal tubule cells and in fibroblasts. The results in humans were confirmed in three rodent models of kidney disease, in which renal versican expression was significantly upregulated as compared to corresponding controls. These data show for the first time an association of renal versican isoform V0 and V1 expression with progressive renal disease.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Progression of chronic kidney disease (CKD) is associated with increased morbidity and mortality, reduced quality of life, and major challenges for healthcare systems [1]. Clinical features predicting a poor prognosis include impaired renal function, hypertension and nephrotic range proteinuria at presentation [2] as well as during follow-up [3], [4]. Histopathological changes such as the degree of tubular atrophy and interstitial fibrosis have been shown to better predict long-term renal survival than the extent of glomerular damage even in primary glomerular diseases [5]. To further enhance the prediction of progression of CKD various genes and proteins have been identified as molecular biomarker candidates of kidney damage, and their clinical significance has recently been reviewed in detail [6].",
                "High-throughput transcriptomics experiments together with integrative bioinformatics led to the identification of additional novel biomarker candidates. Henger et al. identified a marker set of nine genes (Chemokine (C-C motif) ligand 21, interleukin 8, matrix metalloproteinase 3, 7 and 9, urokinase R, chemokine (C-X-C motif) receptor 5, integrin beta 4, and pleiotrophin), which predicted a progressive course of CKD [7]. Perco et al. showed that histology of zero-hour preimplant biopsies explained only 14% of the variability of one year creatinine whereas a combination of three biomarkers (NLR family, pyrin domain containing 2, immunoglobulin J polypeptide, and the regulator of G-protein signaling 5) without clinical covariables explained 28% [8]. Recently, our group identified activation of intracellular vascular endothelial growth factor signaling and hypoxia response pathways in microdissected proximal tubule cells from patients with progressive CKD using microarrays and pathway analysis tools. The expression levels of hypoxia-inducible factor-1 alpha and vascular endothelial growth factor-A were significantly superior in predicting clinical outcome as compared to proteinuria, renal function, and degree of histological damage [9].",
                "In the latter two datasets the hyaluronan binding proteoglycan versican (VCAN) – also termed chondroitin sulphate proteoglycan 2 (CSPG2) - showed a significant correlation with progressive decline of post-bioptical renal function in patients with CKD on the one hand and with increased histological damage on the other hand. The aim of the present study was to characterize versican as a novel renal biomarker predicting progressive decline of kidney function in patients with proteinuric nephropathies."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Versican Is A Marker Of Renal Injury And Impaired Renal Function",
                    "paragraphs": [
                        "Data are summarized in table 1. In the histogenomics data set by Perco et al. the expression levels of versican showed significant associations to the degree of acute tubular injury (2.55 fold upregulation), tubular atrophy (2.10 fold upregulation), as well as interstitial fibrosis (1.94 fold upregulation) in zero-hour preimplant renal biopsies [8] (figure S1). Rudnicki et al. analyzed global gene expression in microdissected human proximal tubular epithelial cells isolated from 21 patients with various proteinuric nephropathies. In the array raw data set versican showed a significant mean upregulation by 69% in 3 of 4 versican spots on the arrays when stable (n = 14) and progressive subjects (n = 7) were compared (figure S2) [9]. In kidney biopsies from patients with diabetic nephropathy (DN) versican expression was increased 1.4 fold as compared to patients with minimal change disease (MCD) (p<0.05) (figure S3) [10]. In the 13 diabetic DN biopsies renal versican expression was furthermore significantly correlated with serum creatinine at time of biopsy (spot 1: R = 0.70, p = 0.008, spot 2: R = 0.58, p = 0.04) and with chronic histological damage (spot 1: R = 0.68, p = 0.01, spot 2: R = 0.62, p = 0.03) (figures S4 and S5).",
                        "However, neither of these studies confirmed the results by real-time PCR or analyzed the expression of the specific versican isoforms V0, V1, V2 and V3 in the respective context covered by each study."
                    ],
                    "subsections": []
                },
                {
                    "title": "Renal Versican Expression Correlates With Progressive Decline Of Kidney Function",
                    "paragraphs": [
                        "To further characterize renal expression of versican isoforms and the association with clinical parameters we analyzed the expression of versican isoforms V0, V1, V2 and V3 in an independent cohort of 74 patients with various proteinuric kidney diseases (table 2). We did not detect any expression of V2 in these samples, and V3 did not show any correlation with laboratory, clinical or histological parameters (data not shown). No significant correlation of V0 and V1 to age, creatinine, eGFR or proteinuria at time of biopsy was detected, although the correlation of V1 to creatinine at biopsy was of borderline significance (R = 0.220, p = 0.06, table 3). However, both isoforms V0 and V1 did significantly correlate with serum creatinine at time of follow-up (V0 R = 0.337, p = 0.003; V1 R = 0.387, p = 0.001), but not with eGFR or proteinuria. Regarding histological characteristics no significant correlation of V0 or V1 levels with the histological diagnosis, and the degree of tubular atrophy/interstitial fibrosis (TAIF), interstitial inflammation (II), or glomerulosclerosis (GS) was observed. However, V1 levels showed a borderline significant correlation with the degree of TAIF (R = 0.208, p = 0.075) and II (R = 0.199, p = 0.092) (table 3). We classified the set of 74 patients as stable or progressive according to doubling of serum creatinine or reaching of end-stage renal disease (ESRD) during follow-up. As shown in figure 1A the expression of V0 and V1 was higher in progressive disease (V0∶1.56 fold, p = 0.034; V1∶1.67 fold, p = 0.011). Versican V0 and V1 levels did not correlate to eGFR slope (calculated as delta ml/min/1.73 m2 per year), neither in the whole group nor when analysis was restricted to subjects with eGFR values <60 ml/min/1.73 m2 (data not shown). In the stable cohort 5 patients were identified who had acute renal failure (ARF) at time of biopsy. Since data on renal function of these patients was not available before biopsy, ARF was defined as a decrease of creatinine during follow-up of more than 50%. These 5 patients had a creatinine at time of biopsy of 5.37±1.25 mg/dl and 1.40±0.32 mg/dl after a follow-up time of 55±19 months. When these 5 patients were excluded from the stable cohort, renal function at time of biopsy was significantly different between the stable and the progressive cohort (table 2). V0 and V1 significantly correlated with creatinine at time of biopsy and at time of follow-up, while no significant correlations were found with age and proteinuria. Regarding histological parameters no significant correlations of V0 and V1 with the diagnosis were identified. However, V0 correlated significantly with the degree of GS, while V1 correlated significantly with the degree of TAIF and showed a borderline significant correlation with the degree of II (table 4). As shown in figure 1B the expression of V0 and V1 was still higher in progressive disease (V0∶1.52 fold, p = 0.051; V1∶1.64 fold, p = 0.018) although the level of significance was borderline in the case of V0."
                    ],
                    "subsections": []
                },
                {
                    "title": "Versican Predicts Future Renal Function",
                    "paragraphs": [
                        "Creatinine at time of biopsy (p = 0.002) and the degree of GS (p = 0.006), but neither the degree of proteinuria, nor the extent of TAIF or II were significantly associated with adverse renal outcome. The isoforms V0 and V1 correlated with creatinine at follow-up resulting in R2 values of 0.1026 (p = 0.0033) and 0.1421 (p = 0.0006), respectively. The combination of the two parameters GS and creatinine at time of biopsy (model 1) resulted in an adjusted R2 of 0.1619 (p = 0.0009). Addition of V0 to this model resulted in an adjusted R2 of 0.2012 (p = 0.0004) (model 2). The model with the highest adjusted R2 of 0.2438 (p = 0.0001) included the variables GS, creatinine at time of biopsy, and V1 (model 3). The model with both isoforms together with GS and creatinine at time of biopsy (model 4) did not further increase the predictive value (table 5). We also analyzed the prediction of future renal function using the same variables after exclusion of the 5 patients with AKI. In this analysis creatinine at time of biopsy became a strong predictor of creatinine at follow-up with an adjusted R2 of 0.34. Although glomerulosclerosis and both versican isoforms also showed significant associations with creatinine at follow-up, the addition of glomerulosclerosis and either V0 or V1 or both isoforms to creatinine did not increase the predictive value of creatinine to a significant extent (table 6)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunohistochemical Staining Shows Pronounced Versican Expression In The Tubulointerstitial Compartment",
                    "paragraphs": [
                        "Next we evaluated the potential origin of versican expression by immunohistochemistry in a healthy control and in representative biopsies from patients with proteinuric nephropathies. We found ubiquitous versican protein expression in the glomerular and in the tubulointerstitial compartment as well as in blood vessels (figure 2). Glomerular expression was rather weak, and the tubular expression was more pronounced at the basolateral membrane. In areas of marked interstitial fibrosis versican expression was also increased showing a fibrillar pattern. In renal blood vessels no expression of versican was detected in the intima, but there was a strong signal in the media and in the adventitia. In healthy renal tissue versican expression was generally lower than in the diseased cases. A weak signal was seen mainly in the tubulointerstitium."
                    ],
                    "subsections": []
                },
                {
                    "title": "Versican Is Expressed In Renal Epithelial Cells And In Fibroblasts In Vitro",
                    "paragraphs": [
                        "We further analyzed cell and organ specificity of versican expression. Human proximal tubule cell line HK2 and human skin fibroblast (SF) cell line showed highest expression of V0 and V1 (figure 3). Apart from this relatively similar expression pattern in these three cell lines, we also detected cell type specific differences in expression between the isoforms V0 and V1. Human kidney fibroblasts TK-173, leukocytes, and the epithelial cell line A431 showed a V0 expression which was approximately 5 to 25 times less than in HK2 cells. The expression of V0 was extremely low in prostate epithelial cells, colon epithelial cells, smooth muscle cells and also in control (“healthy”) kidney tissue (0.06% to 0.3% as compared to HK2). The results were similar for V1 (0.01% to 7% as compared to HK2), with the exception that V1 expression was also very low in kidney fibroblasts and leukocytes (0.01% to 0.08% as compared to HK2). We did not detect any versican expression in endothelial cells."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tgf-Ss1 Upregulates Versican In Fibroblasts",
                    "paragraphs": [
                        "Based on the high basal expression of versican in tubule cells and in fibroblasts we next examined the effect of angiotensin (Ang) II, platelet-derived growth factor (PDGF)-AB and transforming growth factor (TGF) beta-1 on the expression of all versican isoforms in HK-2 and TK-173 cells. We selected these ligands because of their known regulatory effect on versican expression in smooth-muscle cells, and their well-established profibrotic and proinflammatory characteristics. When HK-2 and TK-173 cells were treated with Ang II or PDGF-AB, we did not detect any regulation of any of the versican isoforms. However, treatment with TGF beta-1 resulted in a significant upregulation of V0 and V1 by approx. 3.5 fold in the fibroblast cell line TK-173. We did not detect any significant effect of TGF-ß1 on versican isoform expression in the proximal tubule cell line HK-2 (figure 4)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Versican Is Upregulated In Rodent Models Of Kidney Diseases",
                    "paragraphs": [
                        "We determined the relevance of our findings by analyzing renal versican mRNA expression in mouse and rat models resembling human glomerular pathologies. The expression values in corresponding controls were arbitrarily set to 1. Versican was upregulated 3.5 fold (p = 0.02) in mice with accelerated nephrotoxic serum nephritis, a model of proliferative glomerulonephritis, after 14 days (figure 5). In rats with adriamycin-induced nephropathy, that mimics aspects of human MCD and focal-segmental glomerulosclerosis (FSGS), a 1.5 fold (p = 0.03) increase in versican mRNA as compared to controls was found at 21 days. Finally, a highly significant upregulation of renal versican, i.e. 8.0 fold (p<0.001) increase over control, was observed in rats with Passive Heymann Nephritis (PHN) - a severe model of proteinuric nephropathy which partly resembles human membranous nephropathy (MN) - studied at 6 months. In ADR and in PHN nephropathy versican expression was also increased on the protein level (figure 6)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "In this work we describe the two versican isoforms V0 and V1 as novel biomarker candidates with the potential to predict progression of CKD already at an early stage.",
                "Versican is an extracellular matrix (ECM) protein belonging to the family of hyaluronan-binding proteoglycans showing expression in a variety of connective tissues. Four splice variants of human versican have been identified (V0, V1, V2 and V3), which result from alternative splicing of the two central exons 7 and 8 encoding the central glycosaminoglycan carrying regions, glycosaminoglycan alpha (GAG-α) and beta (GAG-β) [11]. It is V0 and V1, which are the predominant versican isoforms in stroma tissues of most cancers [12], [13], [14], while V2 expression seems to be restricted to the central nervous tissue [15]. V3 does not contain any GAG attachment sites and has been proposed to act as a regulatory protein [16]. Versican is involved in cell proliferation, cell adhesion, migration, and extracellular matrix assembly [17]. The expression of versican in smooth muscle cells is induced by various mitogens such as transforming growth factor beta-1, platelet derived growth factor, epidermal growth factor, basal fibroblast growth factor, and interleukin 1 beta via phosphatidylinositol 3-kinase–protein kinase B signaling, and is regulated by downstream transcription factors such as cAMP-responsive element binding protein, nuclear factor-kB (NF-kB), and p53 [18].",
                "We identified versican as a marker of histological damage in zero-hour biopsies, of progressive decline of renal function in CKD and in DN in publicly available transcriptomics data sets. Furthermore, versican V0 and V1 levels significantly increased the predictive value of conventional clinical and histological risk factors for renal disease progression in an independent cohort of patients with proteinuric renal diseases. In the field of cancer research several authors have previously identified high levels of tissue versican expression as an indicator for poor outcome in malignant diseases such as prostate cancer [19] and breast cancer [12]. Data on the association of versican expression with clinical outcome in kidney disease are scarce. In a genomics analysis in ageing kidneys, Melk et al. found renal versican RNA levels to be increased 2.90 fold in kidney tissue from older patients as compared to samples from adults. The highest differential versican expression (3.64 fold) was observed between samples with higher and lower degree of histological damage, thus also indicating a correlation with histological damage [20]. In kidney transplantation Einecke et al. evaluated global gene expression in 105 renal biopsies [21]. Versican was one of the most significant genes, which predicted renal graft loss with a 3.42 times higher expression in failed grafts as compared to censored grafts. Interestingly, in our independent cohort of 74 patients with various renal histologies versican expression levels did not correlate with the degree of TAIF, II or GS, although the correlation of V0 with glomerulosclerosis and of V1 with TAIF and II reached significant levels after exclusion of patients with ARF (see below). This association of versican with histological injury is in line with findings from several authors where (not isoform specific) versican expression was increased in renal tissue with high degree of histological injury [8], [10], [20]. This association is further supported by the borderline significant correlation of versican levels with serum creatinine at time of biopsy (which became significant after exclusion of ARF patients) in our cohort and in the findings from Schmid et al. [10]. Therefore, we cannot rule out the possibility that the predictive characteristics of versican V0 and V1 expression values on progression of renal failure are not – at least in part – due to increased damage of kidney tissue and poor kidney function already at time of biopsy.",
                "Versican levels did neither correlate with proteinuria nor did proteinuria predict adverse renal outcome. This lack of association of chronic histological changes and of proteinuria with prognosis might point to a selection bias in which patients with an acute form of glomerulonephritis and not a chronic presentation undergo kidney biopsy, thus limiting the generalizability of these results. To address this issue we identified 5 patients with ARF at time of biopsy in the stable cohort. Although these patients showed lower renal versican V0 and V1 expression than other stable patients as well as the progressive cohort, the differences did not reach statistical significance (data not shown). After exclusion of these 5 patients V0 and V1 levels were still higher in progressive subjects (V0 p = 0.051, V1 p = 0.018). Furthermore, V0 and V1 showed positive correlations to creatinine at time of biopsy and to the degree of histological damage. However, then the predictive value of creatinine at time of biopsy increased substantially (R2 = 0.34), and was not improved by the degree of glomerulosclerosis or V0 or V1 levels to a significant extent. These results in patients without ARF are in line with published data, which show that basal renal function is a robust marker for prediction of progression of CKD. However, in the clinical setting of deteriorated renal function at time of biopsy it is often difficult to predict future renal function. In this setting renal versican expression might serve as a potential candidate to predict worse renal outcome.",
                "Results in humans were reproduced in three animal models of nephropathies in which renal versican expression was significantly increased in diseased animals as compared to controls. Analysis of versican RNA expression in vitro showed significantly higher expression levels of V0 and V1 in renal tubule cells and in fibroblasts than in other cell lines. These findings were corroborated in biopsies from patients with IgA nephropathy (IgAN) and Lupus nephritis showing versican protein expression mainly in tubule cells, the ECM and interstitial fibroblasts. Bode-Lesniewska et al. showed that the V0 and V1 isoforms of versican are expressed in various tissues and epithelial cells, but not in renal tubules and glomeruli [22]. However, versican was detected in the surrounding interstitial tissue and in sclerosed glomeruli. These contradicting results could be explained by the fact that renal tubular expression of versican might only be activated in the diseased state. This hypothesis is supported by our findings of very low versican expression in control kidney tissue. Similar to our results a higher expression of versican in the fibromuscular stroma was reported in prostate cancer tissue [19] and in the stroma of nodules in benign prostatic hyperplasia [23] but not in prostate epithelial cells when compared with healthy prostate samples. These studies suggest that versican is mainly expressed in fibroblasts, and also deposited as part of the ECM, respectively.",
                "We detected an induction of versican expression in fibroblasts by TGF beta-1. It has been proposed that versican might be involved in epithelial-mesenchymal-transition (EMT) and mesenchymal-epithelial-transition (MET). In NIH3T3 fibroblasts V1 but not V2 induced MET with a switch in cadherin expression from N- to E-cadherin, reduced expression of vimentin, and increased expression of occludin resulting in a polarized and epithelial phenotype [24]. Furthermore, V1 enhanced cell proliferation, modulated cell cycle progression, and inhibited apoptosis via the activation of epithelial growth factor receptor expression, modulation of its downstream pathways and by inducing degradation of the cyclin-dependent kinase inhibitor p27 [25]. In the context of progressive renal disease these observations would suggest “protective” characteristics of at least versican isoform V1, in which overexpression in fibroblasts induces an epithelial phenotype and enhances gap junction communications.",
                "On the other hand it was shown that versican binds to adhesion molecules on the surface of leukocytes such as P- and L-selectins, and also CD44 [26]. Furthermore, the chondroitin sulphate chains of versican mediate the binding of several chemokines involved in the recruitment of mononuclear leukocytes [27]. Together with versicańs ability to bind to ECM components [28] increased versican levels might hence sustain an inflammatory microenvironment, thus promoting fibrogenesis and progression of CKD.",
                "In conclusion, we identified renal expression of versican isoforms V0 and V1 as markers for unfavourable renal prognosis. Due to the highly interactive characteristics of versican this molecule represents a promising candidate for further studies of renal pathologies. However, before versican levels can be used as a prognostic marker candidate these findings have to be replicated in an independent cohort of well characterized patients with sufficient statistical power."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Ethics Statement",
                    "paragraphs": [
                        "Before performing a routine kidney biopsy due to a clinical indication a written informed consent is obtained from every patient. Usually two biopsy cores are retrieved, one for routine histological analysis, which is fixed immediately with formalin and embedded in paraffin, and one for immunofluorescence analysis, which is embedded in Tissue-Tek®OCT™ (Sakura, Alphen aan den Rijn, the Netherlands) compound and processed as cryocut sections. After the diagnostic workup is finished the surplus cryocut sections are stored at −80°C. The Institutional Review Board of the Medical University of Innsbruck has accredited the use of surplus material from routine kidney biopsies for research purposes."
                    ],
                    "subsections": []
                },
                {
                    "title": "Microarray Data Sets On Versican Expression In Kidney Tissue",
                    "paragraphs": [
                        "We extracted versican RNA expression values from three transcriptomics studies in the context of kidney transplantation [8], chronic kidney disease [9] and diabetic nephropathy [10]. Versican levels were investigated in the context of the clinical questions of the respective papers (table 1). Raw data from the array experiments and supplemental figures are accessible via www.microarray.at."
                    ],
                    "subsections": []
                },
                {
                    "title": "Patients And Kidney Biopsies Of The Validation Cohort",
                    "paragraphs": [
                        "We used kidney biopsies obtained from 74 patients with proteinuric renal diseases during their routine diagnostic workup. Diagnoses included focal segmental glomerulosclerosis (FSGS), minimal change disease (MCD), IgA nephropathy (IGAN), lupus nephritis (LN), rapid-progressive glomerulonephritis (RPGN), membranoproliferative glomerulonephritis (MPGN), ANCA associated vasculitis (AAV), hypertensive nephropathy (HTN), membranous nephropathy (MN), Goodpasture syndrome, interstitial nephritis (IN) and other. Clinical follow-up data is summarized in table 2. Progressive disease was defined as doubling of serum creatinine during follow-up or end-stage renal disease. All other patients were defined as stable. An independent pathologist scored the degree of tubular atrophy/interstitial fibrosis (TAIF), glomerular sclerosis (GS) and interstitial inflammation (II) following a semiquantitative grading system on haematoxylin/eosin and periodic-acid-Schiff- or Pearse-stained sections."
                    ],
                    "subsections": []
                },
                {
                    "title": "Correlation Of Versican Isoform Mrna Levels With Clinical Parameters And Outcome",
                    "paragraphs": [
                        "Correlations of versican isoforms V0 and V1 were calculated to (i) clinical parameters at time of biopsy (age, creatinine, eGFR-MDRD, proteinuria), (ii) clinical parameters at follow-up (creatinine, eGFR-MDRD, proteinuria), and (iii) histological parameters (diagnosis, degree of TAIF, GS and II). The Pearson correlation coefficient was used for all analyses except for the correlation of versican levels with histological diagnosis for which an ANOVA test was used. We determined the strength of versican isoforms V0 and V1 along with traditional risk factors for progression such as creatinine at time of biopsy, proteinuria, degree of TAIF, GS and II to predict patient outcome. Creatinine at follow-up was used as outcome variable in the linear regression models."
                    ],
                    "subsections": []
                },
                {
                    "title": "Rna Isolation And Real-Time Pcr",
                    "paragraphs": [
                        "RNA was isolated using the RNeasy® Micro Kit (Qiagen, Hilden, Germany). RNA was reverse transcribed into cDNA with the High Capacity cDNA reverse Transcription kit (Applied Biosystems, Carlsbad, CA). Preamplification was performed using TaqMan® Gene Expression Assays (vide infra) and the TaqMan® PreAmp Master Mix. The preamplified cDNA was analyzed in duplicates on the 7500 Fast Real-Time PCR System (Applied Biosystems, Carlsbad, CA) using the following inventoried TaqMan® Gene Expression Assays: PPIA (cyclophilin A; Hs99999904_m1), VCAN0 (Hs01007944_m1), VCAN1 (Hs01007937_m1), VCAN2 (Hs01007943_m1) and VCAN3 (Hs01007941_m1). The relative amounts of transcripts for each gene were normalized to the reference gene cyclophilin A (PPIA)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell Culture",
                    "paragraphs": [
                        "Human renal proximal tubule cells (HK2), colon carcinoma cells (CACO2), epidermoid carcinoma cells (A431), and human endothelial cells (EA.hy926) were purchased from the American Type Culture Collection. The human kidney fibroblast cell line TK-173 was provided by Gerhard A. Müller, Göttingen, Germany [29]. Immortalized prostate epithelial cells (EP156T, EP153T) [30], primary smooth muscle cells (SMC) [31] and primary skin fibroblasts (SF) [32] were obtained from Helmut Klocker at the Department of Experimental Urology from the Medical University Innsbruck. Leukocyte cDNA was obtained from the Human MTC™ Panel I and Panel II (Clontech, Mountain View, CA). Kidney tissue was obtained from the unaffected part of a kidney, which was nephrectomized due to renal cell carcinoma. HK-2 cells were cultured in keratinocyte-serum-free medium (KSFM) containing 10% FCS, 5 ng/ml recombinant epidermal growth factor (rEGF), and 0.05 mg/ml bovine pituitary extract (BPE) and 1% PenStrep. TK173 fibroblasts were cultured in DMEM containing 10% FCS, 1% Glutamax (Life Technologies Corporation, Carlsbad, CA) and 1% PenStrep. After 24 h in serum-free medium HK-2 and TK173 cells were cultured for 24 h in the presence of angiotensin (Ang) II (10−7 mM), platelet-derived growth factor (PDGF)-AB (10 ng/ml) or transforming growth factor (TGF) beta-1 (10 ng/ml). RNA isolation and quantitative real-time PCR of the versican isoforms was performed as described above, but RNA was not pre-amplified."
                    ],
                    "subsections": []
                },
                {
                    "title": "Versican Immunohistochemistry",
                    "paragraphs": [
                        "Frozen sections from six patients (3 IgAN, 3 class IV lupus nephritis) were stained for human versican protein. Two patients (both IgAN) showed severe renal function impairment and a progressive course of disease, while the other 4 showed conserved renal function and a stable course of disease. As healthy control tissue we used an unaffected part of a tumor nephrectomy specimen. The sections were fixed in cold acetone. The sections were then incubated at 4°C overnight with a 1∶400 dilution of the primary antibody (rabbit anti-human Versican, sc-25831, Santa Cruz, CA). Versican was detected by the Vectastain Elite ABC Kit (Vector Laboratories, Burlingame, CA). This system uses a biotin-conjugated secondary antibody (1∶1000), avidin and biotinylated horseradish peroxidase, and 3-amino-9-ethylcarbazole (AEC) as the chromogen for visualization. All sections were counterstained with hematoxylin."
                    ],
                    "subsections": []
                },
                {
                    "title": "Animal Models Of Renal Disease",
                    "paragraphs": [
                        "We investigated versican expression in 3 rodent models of renal disease: (A) Accelerated anti-glomerular basement membrane nephritis was induced in n = 8 mice as described previously [33], and n = 8 untreated animals served as controls. In brief, 8- to 12-wk-old male C57Bl/6J mice were obtained from Charles River (Sulzfeld, Germany). The animals were preimmunized subcutaneously with 2 mg/ml rabbit IgG (Jackson Immuno Research Laboratories, West Grove, PA) dissolved in incomplete Freund's adjuvant (Sigma, St. Louis, MI) and nonviable desiccated Mycobacterium tuberculosis H37a (Difco Laboratories, Detroit, MI). After 5 days, heat-inactivated rabbit anti-mouse GBM antiserum was injected via the tail vein. The animals were sacrificed after 14 days. Austrian veterinary authorities approved these animal experiments (GZ 66.011/0.111–11/10b/2008; Bundesministerium für Wissenschaft und Forschung). (B) Passive Heymann Nephritis (PHN) was induced in n = 5 2-month old male Sprague-Dawley rats (Charles River Italia s.p.a., Calco, Italy) by a single intravenous injection of 0.4 ml/100 g body weight of rabbit anti-Fx1A antibody, followed 7 days later by unilateral nephrectomy to accelerate the onset of renal damage [34]. Animals were sacrificed after 6 months. Age-matched Sprague–Dawley rats (n = 5) were used as control. (C) Adriamycin nephropathy was induced in n = 5 male Lewis rats (Charles River Italia s.p.a., Calco, Italy) by a single intravenous injection of ADR (Adriblastina, Pfizer Italia s.r.l, Latina, Italy) at the dose of 5 mg/kg [35]. Five Lewis rats intravenously injected with saline served as controls. Animals were sacrificed after 21 days. Animal care and treatment were in accordance with current law [36]. Animal studies were submitted to and approved by the Institutional Animal Care and Use Committee of “Mario Negri” Institute, Milan, Italy. Renal expression of versican was analyzed by real-time PCR following the above outlined protocol using the inventoried TaqMan Gene Expression Assays for mouse versican (Mm01283063_m1), mouse 18s ribosomal RNA (Mm03928990_g1), rat versican (Rn01493755_m1) and rat cyclophilin A (Rn00690933_m1). The TaqMan Gene Expression Assays for mouse-versican and rat-versican used in this study are not isoform-specific but rather allow the detection of the expression of any of the known versican isoforms."
                    ],
                    "subsections": []
                },
                {
                    "title": "Western Blot",
                    "paragraphs": [
                        "The protocol has been previously published [37]. In brief, 1×1×2 mm blocks of rat kidney tissue were lysed in 250 µl of SDS sample buffer (NuSep Inc., Bogart, GA). 15 µl per lane were resolved using 4 to 12% Bis-Tris gels (Invitrogen, Leek, The Netherlands) and transferred onto a nitrocellulose membrane (Invitrogen). Primary antibody (rabbit anti-human versican, sc-25832, Santa Cruz Biotechnology Inc., Santa Cruz, CA) was incubated at 4°C over night. After washing, membranes were incubated with fluorescence-labeled secondary antibodies (Molecular Probes, Eugene, OR) and subsequently scanned using the Odyssey infrared imaging system (LiCor Biosciences, Lincoln, NE)."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}