{
    "id": "US20210155514",
    "authors": [
        "Akram Alshawabkeh",
        "Long Chen"
    ],
    "title": "ROBUST FLOW-THROUGH PLATFORM FOR ORGANIC CONTAMINANTS REMOVAL",
    "date": "2020-11-25 00:00:00",
    "abstract": "Disclosed is an electro-Fenton-like (EFL) platform wherein an electrochemically produced acidic environment supports heterogeneous Fenton-like reaction for high throughput water treatment. The platform enables treatment of contaminated water.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Various toxic organic compounds in the environment have produced considerable threats to human health and ecosystem. While efficient in providing clean drinking water with improved quality, many advanced water treatment facilities are flawed by high capital costs and remain as the principal barrier for implementation in developing countries (Lu et al. 2018). The classic Fenton process, which transforms hydrogen peroxide (H2O2) into hydroxyl radicals (HO.) under the ferrous ions (Fe2+) catalysis, is an affordable and proven water treatment technique (Wardman et al. 2018). HO. is the second most oxidative species with a redox potential of 2.73 V (vs NHE) after fluorine in nature (Wardman et al. 2018), and could non-selectively destroy recalcitrant and toxic organic contaminants in water (Babuponnusami et al. 2014; Pignatello et al. 2006). By coupling with other water treatment units, such as coagulation, membrane filtration, or microbial degradation, the Fenton process can be adapted for various water bodies' treatments (Feng et al. 2010; Wu et al. 2011; Ganiyu et al. 2015). Fruitful progresses have been achieved to date in Fenton chemistry for water treatment (Herney-Ramirez et al. 2010; Pouran et al. 2015; Bokare et al. 2014; Brillas et al. 2009; Ganiyu et al. 2018). In particular, in situ synthesis of H2O2 from H2 and O2 under noble metal catalysis (Yi et al. 2016), and H+ and O2 under photochemical (Moon et al. 2017), or electrochemical catalysis (Bolobajev et al. 2014) is a sustainable route to reduce the chemical cost. However, formation of the ferric sludge continues to be a challenge limiting implementation of the Fenton process. The sludge is formed when water pH is improved to around neutral after oxidation, and its toxicity stems from the adsorbed residual compounds in treated water (Bolobajev et al. 2014). Treatment of the ferric sludge requires substantial chemical and manpower costs—10% to 50% of overall operating costs in a water treatment plant (Pilego et al. 2012; Neyens et al. 2003).",
                        "Heterogeneous solid catalysts could potentially overcome the drawback of ferric sludge formation. Naturally occurring clays/minerals as well as transition metal-centered designer composites have been extensively explored as Fenton-like catalyst (Herney-Ramirez et al. 2012; Garrido-Ramirez et al. 2010; Cheng et al. 2018; Munos et al. 2015; Pouran et al. 2014). These catalysts have noteworthy structural elegance in the unique coordination environment of their metal cores, which stabilizes the metal-H2O2 complex transition state and facilitates the electron transfer inter se (Sun et al. 2018). Furthermore, the turnover of metal atoms on the catalyst surface occurs via a peroxidase-mimicking mechanism (Gao et al. 2007), akin to the Haber-Weiss reaction of homogeneous Fenton chemistry (Koppenol et al. 2001). The pH-dependence of heterogeneous Fenton-like catalysts is generally less strict than that of iron ions, the latter of which is most effective in pH 2.8-3.5 (Cheng et al. 2018). Nevertheless, most canonical Fenton-like catalysts favor acidic pH 3-5 (Table 1), and catalysts turnover frequency (TOF) can be reduced by up to 100 folds under neutral condition (Liu et al. 2011; André et al. 2011). This is due to surface metal—OH complexes forming at higher pH values and repelling H2O2 away from the exposed active sites. However, pH regulation of near-neutral drinking water bodies is challenging, especially if the water contains high carbonate alkalinity; furthermore, acidification of contaminated groundwater for in situ water treatment could release undesired metal ions from aquifers (Keith et al. 2001; Nordstrom et al. 1999). These concerns severely compromise the potential use of heterogeneous Fenton-like catalysts in the water treatment industry.",
                        "Flow electrochemistry holds great potential for automatic pH regulation to support water treatment, wherein OH− and H+ generated from the cathode and anode, respectively, are redistributed based on ion migration, dispersion, and hydraulic flux (Acar et al. 2011)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce environmental threats",
                        "describe limitations of advanced water treatment facilities",
                        "motivate Fenton process",
                        "summarize Fenton process",
                        "discuss limitations of Fenton process",
                        "introduce heterogeneous solid catalysts",
                        "describe pH dependence of heterogeneous Fenton-like catalysts",
                        "motivate flow electrochemistry"
                    ],
                    "num_characters": 4074,
                    "outline_medium": [
                        "introduce environmental threats",
                        "describe Fenton process",
                        "discuss limitations of Fenton process",
                        "motivate heterogeneous Fenton-like catalysts"
                    ],
                    "outline_short": [
                        "motivate water treatment",
                        "discuss limitations of Fenton process"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [
                        "One aspect of the present invention provides a process for treating contaminated water, comprising contacting said contaminated water with hydrogen peroxide in the presence of an iron oxychloride catalyst, wherein the process occurs in the absence of an acid.",
                        "Another aspect of the invention provides a process for treating contaminated water, comprising: (i) adding hydrogen peroxide to the contaminated water; (ii) providing an influent stream of the contaminated water into a chamber comprising an upstream anode, a downstream cathode, and an iron oxychloride catalyst between the anode and cathode; (iii) applying an electric current to the chamber to provide an acidic environment in the chamber so as to thereby treat the contaminated water in the chamber; and (iv) collecting an effluent stream of the treated water exiting the chamber.",
                        "Also provided herein is a process for treating contaminated water, comprising contacting said contaminated water with hydrogen peroxide in the presence of an iron oxychloride catalyst, wherein the process occurs in the absence of an acid, wherein the treating comprises removal of bisphenol A from the water.",
                        "Also provided herein is a process for treating contaminated water, comprising: (i) adding hydrogen peroxide to the contaminated water; (ii) providing an influent stream of the contaminated water into a chamber comprising an upstream anode, a downstream cathode, and an iron oxychloride catalyst between the anode and cathode; (ii) applying an electric current to the chamber to provide an acidic environment in the chamber so as to thereby treat the contaminated water in the chamber; and (iv) collecting an effluent stream of the treated water exiting the chamber, wherein the treating comprises removal of bisphenol A from the water."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe process for treating contaminated water",
                        "describe process for treating contaminated water with electric current",
                        "describe process for removing bisphenol A from water"
                    ],
                    "num_characters": 1791,
                    "outline_medium": [
                        "outline invention for treating contaminated water"
                    ],
                    "outline_short": [
                        "outline process for treating contaminated water"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a Fenton-like water treatment process that bypasses the need of acid and generation of iron sludge precipitate, and makes the process more widely applicable to various conditions. This Fenton-like process is greener and more cost-effective than current methods.",
                        "Toxic organic compounds in water severely threaten drinking water safety, and require effective pretreatment. Hydroxyl radical produced by Fenton process (Fe2+/H2O2) can non-selectively destroy organic contaminants based on its strong oxidation potential. An upgraded reaction utilizing heterogeneous solid catalysts, called Fenton-like process, was recently adopted to overcome ferric sludge precipitation of Fenton process. However, most heterogeneous Fenton-like catalysts operate optimally at pH 3-5, which acidity is challenging to create in near-neutral water bodies. The Ella process produced by electrochemical water splitting under flow-through conditions to facilitate the heterogeneous Fenton-like reaction. This Ella process boosted the activity of an immobilized iron oxychloride catalyst by over ten-fold in terms of hydroxyl radical yield, leading to near 100% destruction of various organic pollutants under high-throughput treatments. The robust performance in complex water bodies further highlights the promise of this scalable platform.",
                        "The Ella process uses a high-performance iron oxychloride nanocatalyst instead of free iron ion, an acid compartment induced by electrolysis instead of addition of acid. The immobilized iron oxychloride nanocatalyst is confined to the acid compartment.",
                        "The advantages of the Ella process include the ability to treat water contaminants in neutral solution without the addition of acids, prevent the generation of iron sludge waste as a secondary pollutant, and a simple operating procedure (i.e. by simply switching the electricity from the power supply). Also, the preparation of catalysts and induction of acid compartment are more cost-effective than previous homogeneous Fenton process, and contaminated water can be treated with high efficiency and robustness against complex water chemistry. Avoidance of secondary pollutants, and treatment of secondary contamination also provides a cost reduction.",
                        "The Ella process can be used in an advanced oxidation process in water treatment plants to replace the currently prevalent homogeneous Fenton process. The process can be used for water decontamination and disinfection of most surface water and groundwater as well as complex water bodies, such as industrial wastewater."
                    ],
                    "subsections": [
                        {
                            "title": "Definitions",
                            "paragraphs": [
                                "The term “contaminated water” as used herein refers to water containing one or more contaminants or pollutants. The contaminants or pollutants include, but are not limited to, organic contaminants or pollutants. The organic contaminants or pollutants include but are not limited to, drugs (e.g., ibuprofen and carbamazepine), drug precursors (e.g., 4-chlorophenol and 4-nitrophenol), plastic precursors (e.g., bisphenol A), herbicides (e.g., atrazine), pesticides, or recalcitrant dyes (e.g., rhodamine B, reactive blue 19, and orange II).",
                                "The term “iron oxychloride catalyst” as used herein refers to a FeOCl catalyst which is effective in catalyzing the production of hydroxyl radical (HO′) from hydrogen peroxide (H2O2). In the first step of the process of producing hydroxyl radical, FeIIIOCl is reduced by H2O2 into FeIIOCl, and in the second step the derived FeIIOCl then decomposes H2O2 into HO. radical via homolytic cleavage.",
                                "Although this invention demonstrates that iron oxychloride as a catalyst is powerful to treat pollutants, any other active Fenton-like catalyst can be used herein for water treatment.",
                                "In certain embodiments, any active Fe-based Fenton-like catalyst can be used herein for water treatment.",
                                "In certain embodiments, any active Mn-, Cu-, Co-, or Ni,-based Fenton-like catalyst can be used herein for water treatment.",
                                "Any catalyst listed in below Table 1, e.g., Fe3O4, KFePW12O40, H3PW12O40, FA-Fe2SiW10, V2O5, Nanoceria, Co3O4, MnFe2O4, ferrocene, Ag3PO4, nanodiamond—gold nanocomposites, MOF-88, nitrogen-doped graphene quantum dots, Carboxyl-modified graphene oxide, H@M, Cubic Pt nanocrystal, Rh NS, MoS2 NS, MoSe2 NS, WΩ NS, WSe2 NS, ZIF-67, Cu-MOF, Fe2O3, 2LFh, PdCu, Co9S8, Cu(OH)2 SC, Ru frame, FePt—Au HNP, PtAg-MoS2, PtPd NP, Cu-hemin, PS@Au@PB, and Cu NC, is useful in the disclosed treatment process.",
                                "Additional catalysts are also useful in the disclosed treatment process including ferrihydrites (e.g., 8% Ag/AgBr/Fh and 6% Ag/AgCl/Fh), ferrites (e.g., ZnFe2O4), pillared clays (e.g., Al—Fe smectite pillared clay), layered double hydroxides (e.g., CuNiFe LDH), Fe-Perovskites (e.g., LaCuxFet-xO3-δ (x=0.5)), graphene related materials (e.g., Fe3O4—Mn3O4/reduced graphene oxide), g-C3N4 composites (e.g., Fe-g-C3N4/graphitised mesoporous carbon and 5% Fe-doped g-C3N4), metal-organic frameworks (MOFs) and composites (e.g., TiO2 @NH2-MIL88B-Fe), and zero-valent iron (ZVI) based catalysts (e.g., nano-ZVI@kaolinite) (see Thomas et al. 2021).",
                                "In certain embodiments, a Fenton-like catalyst which is active at acidic pH can be used for water treatment. In some embodiments, a Fenton-like catalyst which is active at pH 2-4 can be used for water treatment.",
                                "In certain embodiments, the Fenton-like catalyst is immobilized. In some embodiments, the Fenton-like catalyst is immobilized onto a support. The immobilization method is not limited to the disclosed methods, e.g., melt infiltration method. For example, ball milling can also be used as the immobilization method."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define contaminated water",
                                "define iron oxychloride catalyst",
                                "suggest alternative Fenton-like catalysts",
                                "list examples of active Fenton-like catalysts",
                                "describe immobilization of Fenton-like catalysts",
                                "provide additional examples of catalysts"
                            ],
                            "num_characters": 3018,
                            "outline_medium": [
                                "define contaminated water",
                                "define iron oxychloride catalyst",
                                "list alternative Fenton-like catalysts"
                            ],
                            "outline_short": [
                                "define terms and catalysts"
                            ]
                        },
                        {
                            "title": "Exemplary Embodiments of the Invention",
                            "paragraphs": [
                                "The present invention provides a process for treating contaminated water with hydrogen peroxide in the presence of a Fenton-like catalyst (e.g., an iron oxychloride catalyst). The process degrades the contaminants in the water to benign constituents. The process enables water treatment in the absence of acid.",
                                "Embodiments of the invention are described below:",
                                "In certain embodiments, a process for treating contaminated water, comprising contacting said contaminated water with hydrogen peroxide in the presence of a Fenton-like catalyst, wherein the process occurs in the absence of an acid.",
                                "In certain embodiments, a process for treating contaminated water, comprising contacting said contaminated water with hydrogen peroxide in the presence of an iron oxychloride catalyst, wherein the process occurs in the absence of an acid.",
                                "In certain embodiments, the contaminated water is subjected to an electric current. In certain embodiments, the contaminated water is subjected to an electric current of about 100 mA.",
                                "In certain embodiments, the contaminated water subjected to the electric current attains a pH of about 2 to about 4. In certain embodiments, the contaminated water subjected to the electric current attains a pH of about 2.9 to about 3.2. In certain embodiments, the contaminated water subjected to the electric current attains a pH of about 3.",
                                "In certain embodiments, the iron oxychloride catalyst is a FeOCl/Al2O3 composite. In certain embodiments, the iron oxychloride catalyst is immobilized on a support. In certain embodiments, the iron oxychloride catalyst is immobilized on a γ-Al2O3 support. In certain embodiments, FeOCl nanoparticles are immobilized on a porous γ-Al2O3",
                                "In certain embodiments, the hydrogen peroxide is converted to hydroxy radicals. In certain embodiments, the hydroxy radical is the species that reacts with the contaminant(s), causing degradation of the contaminant(s).",
                                "In certain embodiments, a process for treating contaminated water, comprising:",
                                "(i) adding hydrogen peroxide to the contaminated water;",
                                "(ii) providing an influent stream of the contaminated water into a chamber comprising an upstream anode, a downstream cathode, and Fenton-like catalyst between the anode and cathode;",
                                "(iii) applying an electric current to the chamber to provide an acidic environment in the chamber so as to thereby treat the contaminated water in the chamber; and",
                                "(iv) collecting an effluent stream of the treated water exiting the chamber.",
                                "In certain embodiments, the treatment occurs in the absence of acid, i.e., acid is not added at any step of the process.",
                                "In certain embodiments, a process for treating contaminated water, comprising:",
                                "(i) adding hydrogen peroxide to the contaminated water;",
                                "(ii) providing an influent stream of the contaminated water into a chamber comprising an upstream anode, a downstream cathode, and an iron oxychloride catalyst between the anode and cathode;",
                                "(iii) applying an electric current to the chamber to provide an acidic environment in the chamber so as to thereby treat the contaminated water in the chamber; and",
                                "(iv) collecting an effluent stream of the treated water exiting the chamber.",
                                "In certain embodiments, the treatment occurs in the absence of acid, i.e. acid is not added at any step of the process.",
                                "In certain embodiments, the influent stream of contaminated water is at neutral pH. In certain embodiments, the influent stream of contaminated water has a pH of about 7 to about 8.",
                                "In certain embodiments, the effluent stream of treated water is at neutral pH. In certain embodiments, the influent stream of contaminated water has a pH of about 7 to about 8.",
                                "In certain embodiments, the contaminated water in the chamber is at an acidic pH. In certain embodiments, the pH of the contaminated water in the chamber is about 2 to about 4. In certain embodiments, the pH of the contaminated water in the chamber is about 2.9 to about 3.2. In certain embodiments, the pH of the contaminated water in the chamber is about 3.",
                                "In certain embodiments, anode and cathode are mixed metal oxide electrodes. In certain embodiments, the electric current is about 100 mA. In certain embodiments, the electric current enables an acidic pH between the anode and cathode to be attained at steady state.",
                                "In certain embodiments, the iron oxychloride catalyst is a FeOCl/Al2O3 composite. In certain embodiments, the iron oxychloride catalyst is immobilized on a support. In certain embodiments, the iron oxychloride catalyst is immobilized on a γ-Al2O3 support. In certain embodiments, FeOCl nanoparticles are immobilized on a porous γ-Al2O3",
                                "In certain embodiments, the hydrogen peroxide is converted to hydroxy radicals inside the chamber. In certain embodiments, the hydroxy radical is the species that reacts with the contaminant(s), causing degradation of the contaminant(s). In certain embodiments, the concentration of hydroxy radicals in the chamber is greater than 250 μM.",
                                "In certain embodiments, the flow rate of the water through the chamber is less than 30 mL/min. In certain embodiments, the flow rate of the water through the chamber is about 10 to about 25 mL/min. In certain embodiments, the flow rate of the water through the chamber is about 10 to about 20 mL/min. In certain embodiments, the flow rate of the water through the chamber is about 15 mL/min.",
                                "In certain embodiments, the flow rate of the water through the chamber is 30-50 mL/min. In certain embodiments, the flow rate of the water through the chamber is 50-100 mL/min. In certain embodiments, the flow rate of the water through the chamber is 100-500 mL/min. In certain embodiments, the flow rate of the water through the chamber is 500-1000 mL/min.",
                                "In certain embodiments, the treating comprises purification of the water by removal of contaminants from the water. In certain embodiments, the treating comprises removing one or more contaminants from the water. In certain embodiments, the treating comprises removing one or more organic contaminants from the water. In certain embodiments, the treating comprises removing one or more drugs, drug precursors, plastic precursors, herbicides, pesticides, or recalcitrant dyes from the water.",
                                "In certain embodiments, the treating comprises removing bisphenol A (BPA) from the water. In certain embodiments, the treating comprises removing greater than 99% of the bisphenol A (BPA) present in the water prior to treatment of the water. In certain embodiments, the treating comprises removing greater than 95% of the bisphenol A (BPA) present in the water prior to treatment of the water. In certain embodiments, the treating comprises removing greater than 90% of the bisphenol A (BPA) present in the water prior to treatment of the water. In certain embodiments, the treating comprises removing greater than 80% of the bisphenol A (BPA) present in the water prior to treatment of the water.",
                                "In certain embodiments, the contaminant(s) is degraded to carbon dioxide and water. In certain embodiments, the bisphenol A (BPA) is degraded to carbon dioxide and water.",
                                "**Chemicals**",
                                "FeCl3.6H2O (Honeywell Fluka) was used to synthesize the FeOCl nanocatalyst, and H2O2 was purchased from Fisher Scientific. γ-Al2O3(Alfa Aesar) was used as a support to immobilize FeOCl. BPA (Sigma-Aldrich), ibuprofen (Alfa Aesar), atrazine (Sigma-Aldrich), carbamazepine (Sigma-Aldrich), 4-chlorophenol (Acros Organics), 4-nitrophenol (Acros Organics), Rhodamine B (Harleco, Philadelphia, Pa.), Reactive blue 19 (Sigma-Aldrich), and Orange II (Acros Organics) were used as substrates for Fenton-like process treatment. Other chemicals (i.e., sodium sulfate (Na2SO4) as the supporting electrolyte, sodium carbonate (Na2CO3) for synthetic alkaline water, ethanol as a HO. radical scavenger, methanol and acetonitrile as mobile phase for HPLC) were purchased from Fisher Scientific. Pure water was used throughout the work except the field water studies.",
                                "**Synthesis of FeOCl**",
                                "2 g grinded FeCl3.6H2O powder was put at the bottom of a ceramic crucible, and then tightly sealed with aluminum foil. The crucible was heated at an 8° C./min rate until up to 200° C. and maintained for 2 h in a muffle furnace. After heating, the crucible was naturally cooled down to room temperature. The cooling process took around 1 h. The formed dark red FeOCl plates were ground into fine powder and then washed with ethanol at least for three times until eluent was colorless to remove residual FeCl3 impurity. Eventually, the synthesized and purified FeOCl was stored in a dry 15-mL Corning tube, and then put in a chemical fume hood under constant ventilation drying.",
                                "Synthesis of FeOCl/Al2O3",
                                "10 g grinded γ-Al2O3 microparticles were mixed with 5.97 g FeCl3.6H2O (i.e., theoretical 10 wt % Fe loading) under vigorous vortex for 10 min until the powder mixture turned homogeneously yellow. The powder was then transferred into 5-mL glass tubes with air-tight caps and further sealed with Teflon bands to prevent vaporization of crystalline water in FeCl3.6H2O. The glass tubes were heated under 80° C. for 12 h, during which FeCl3.6H2O (melting point 37° C.) infiltrated into γ-Al2O3 pores. The obtained powder was transferred into crucibles for the synthesis of FeOCl/Al2O3 using the same condition as FeOCl synthesis. Produced FeOCl/Al2O3 was extensively washed with ethanol before use.",
                                "**Synthesis of FeOCl on Alginate Hydrogel**",
                                "1.5 g synthesized FeOCl and 3 g alginate were at first sufficiently mixed via vigorous vortex, and then 100 mL DI water was poured into the beaker containing well-mixed FeOCl and alginate. A clean glass stick was used to stir the solution until it turned into homogeneous red paste. A syringe was then used to drop the red slurry into 0.1 M CaCl2) solution, and formed FeOCl/alginate beads were allowed to harden for 2 h. The as-prepared FeOCl/alginate beads were then washed with DI water and loaded into the reactor for subsequent experiments.",
                                "**Characterization of Materials**",
                                "The crystalline phase of samples was measured using a D/MAX-2200 X-ray diffraction (XRD) analyzer equipped with a rotation anode using CuKa radiation (λ=0.1541 nm). Field emission scanning electron microscope (FESEM) photography was performed on an S-4800 instrument at an accelerating voltage of 15 kV. High resolution transmission electron microscopy (HRTEM) images were obtained on a JEOL JEM-2100F transmission electron microscope at an accelerating voltage of 200 kV. The chemical composition and the binding states on the surface of the FeOCl specimen were carried out on a Thermo Scientific ESCALAB 250 Xi X-ray photoelectron spectroscopy (XPS) microprobe with monochromatic X-ray (Al Kα, 1486.6 eV) radiation as an excitation source. The measurements of specific surface area, pore volume, and pore size distribution in the 2-500 nm range were carried out using a Micromeritics ASAP 2020 instrument by nitrogen adsorption/desorption at 77.3 K (−194.85° C.).",
                                "**EFL Platform Loading Unimmobilized FeOCl**",
                                "5 g FeOCl powder was mixed well with 50 g sand particles under vortex for 20 min, and the mixture was then filled in between the cathode and anode, and all other spaces were filled with sand particles to reduce hydrodynamic perturbation. A neutral solution containing 10 mM H2O2, 10 μM BPA, and 5 mM Na2SO4 as electrolyte was pumped up into the vertically aligned reactor at a rate of 15 mL/min. A steady-state acidic-compartment was formed between the cathode and anode under a current of 100 mA after 60 min, and BPA removals at each sampling port was tested.",
                                "**Flow-Through Column Reaction**",
                                "The experimental column (15 cm×5 cm O.D., 0.32 cm wall thickness) is made with cast acrylic tube and Teflon rods with O-rings as the top and bottom cap. Mixed metal oxide sintered titanium (Ti/MMO) mesh electrodes were inserted in parallel at a distance of 9 cm. Titanium hex nuts and threaded rods were used to connect Ti/MMO electrodes with electric power source. Gum rubber was sealed on the external titanium rod to avoid contact with both electrodes. Four sampling ports using tube adapter (0.79375 cm tube to 0.3175 cm NPT male) were installed at an equal distance (3 cm) between the electrodes.",
                                "To load catalysts into the reactor, the FeOCl/Al2O3 catalyst (˜50 g) was filled between the cathode and anode, and rest spaces were filled with fine silica sand particles. The silica sand particles were extensively washed with pure water, and then oven-dried at 80° C. Filter papers were placed at the bottom and top of sand zones to avoid particles draining into effluent.",
                                "Initially, a neutral solution (pH 7) of 10 μM BPA was used to condition the column until effluent BPA concentration matched influent to reach adsorption equilibrium. After BPA breakthrough, another neutral solution containing 10 mM H2O2, 10 μM BPA, and 5 mM Na2SO4 electrolyte was pumped up into the vertically aligned column at a rate of 15 mL/min by a peristaltic pump, with a 100 mA electric current applied to the electrodes. A steady-state acid-compartment was formed between electrodes after 60 min, and BPA removal was tested. 1 mL solutions sampled from each port and influent/effluent were neutralized with 1 mL 20 mM phosphate buffer (pH 7) to avoid following analysis inaccuracy due to pH inconsistence. Samples after filtration with 0.45 μm PVDF membrane (13 mm diameter, Jin Teng Ltd., China) were measured by high-performance liquid chromatography (HPLC, Agilent 1200 Infinity Series) equipped with an Agilent Eclipse AAA C18 column (4.6×150 mm). BPA was separated by 0.5 mL/min methanol/water 60/40 mobile phase, and detected at 228 nm wavelength using Agilent 1260 diode array detector. Degradation of other substrates was also tested, and quantification methods were indicated in",
                                "In certain assays, the solution pH, flow rate, and synthetic alkalinity (i.e., 1 mM Na2CO3 is equivalent to 100 mg CaCO3/L water alkalinity) were subjected to changes as indicated, while other parameters were fixed as stated above. For electricity responsiveness test, experiment was initiated by turning on the 100 mA electric current after conditioning the column, without reaching steady state. For BPA removal in field water bodies, water samples 1 and 2 were taken from lakes in Boston, Mass., US, and water samples 3 and 4 were taken from underground sources of Superfund sites in Puerto Rico. They were stored at 4° C. cold room. Characterizations of the field water samples were shown in Table 3. Water samples were filtrated through 0.45 μm PVDF membranes (47 mm diameter, EMD Millipore, Germany) before use to remove suspended particles. Solution pH was not adjusted after addition of H2O2 and BPA, and solution intrinsic conductivity supported electrochemical water splitting. BPA concentrations in the influent and effluent were analyzed during steady state.",
                                "**Hydroxyl Radical Quantification Method**",
                                "The total HO. radical amount was quantified via a reported benzoic acid oxidation method48. Briefly, the accumulated HO. radical amount equals that of generated p-hydroxybenzoic acid, a product of HO. radical and benzoic acid reaction, multiplied by a conversion factor of 5.87. In batch reaction, 100 mL solutions of 5 mM benzoic acid, 10 mM H2O2, and 0.2 g/L catalyst (i.e., free FeOCl or immobilized FeOCl/Al2O3) were stirred for 30 min under indicated solution pH. In flow-through reaction, after conditioning the column with 5 mM benzoic acid until breakthrough, influent solutions containing 5 mM benzoic acid, 10 mM H2O2, and 5 mM Na2SO4 at neutral pH passed through the column at a rate of 15 mL/min, with or without 100 mA electric current applied to the electrodes. Effluent samples were collected during steady state. The concentration of generated p-hydroxybenzoic acid was analyzed by HPLC with mobile phase of 0.5 mL/min methanol/water 20/80 and detection wavelength at 255 nm using the same column for BPA analysis.",
                                "**Density Functional Theory (DFT) Calculation Method**",
                                "Geometry optimization. DFT calculations were performed with PBE (Perdew-Burke-Ernzerhof) functional by using CASTEP (Clark et al. 2005; Segall et al. 2002) as incorporated in Materials studio 7.0. The ultrasoft pseudopotential (USPP) was used to represent the core-valence electron interaction. The plane wave expansion basis sets with a cut-off energy of 300 eV was used. The k-point sampling of 4×4×2 within the Monkhorst-Pack special k-point scheme in the Brillouin Zone was considered for the geometry optimization and energy calculation.",
                                "Transition state calculation. To investigate the pathways of Fenton process, linear synchronous transit/quadratic synchronous transit (LST/QST) by using DFT+U technique were performed, and the Uvalues of O 2p and Fe 3d is 6.3 and 3.0 eV, respectively. FeOCl (100) surface was considered as reactive surface with two fixed atomic layers (Lahay et al. 2007), and 2×2×1 k-point mesh was used. Spin polarization was considered for all the calculations.",
                                "**Reactive Transport Model to Estimate the Steady-State pH in the Ella Process**",
                                "Water splitting is considered as the dominant electrolysis reaction in this system. This process will produce an acid front after the anode and gets neutralized after passing through the cathode.",
                                "Anode: 2H2O→O2+4H++2e−  (1)",
                                "Cathode: 2H2O+2 e−→H2+2OH−  (2)",
                                "Competing reactions may exist depending on the electrolyte composition and concentration, which reduces the current efficiency of the system. However, in this study we assume 100% efficiency for water electrolysis on both electrode surfaces.",
                                "Transport process in the column is expressed by Nernst-Plank's equation in dilute electrolytes.",
                                "Ji=uCi-DH∇Ci-uiziFCi∇ϕ  (3)",
                                "Where u is the pore water velocity and Ji, Ci, DH, ui, and zi are the total flux, concentration, hydrodynamic dispersion coefficient, mobility, and the charge of ith species, respectively. Species mobility, ui, can be estimated by Einstein relation.",
                                "\\(\\begin{matrix}\n{u_{i} = \\frac{z_{i}{FD}_{i}}{RT}} & (4)\n\\end{matrix}\\)",
                                "Hydrodynamic dispersion, DH, is a function of the pore water velocity and is represented as DH=τD0+αLu, where the tortuosity, τ, is a measure of effective transport path through media, D0, is the molecular diffusion coefficient, and αL, is the longitudinal dispersivity. Many studies are conducted to evaluate the hydrodynamic dispersion coefficient (De Smedt et al. 1984). This factor in large scale systems is estimated by column tracer test or fitted models of similar experiment characteristics.",
                                "In systems with supporting electrolyte, migration term can be neglected. Therefore, the governing equation for a transient simulation is obtained by conservation of mass.",
                                "\\(\\begin{matrix}\n{\\frac{\\partial C_{i}}{\\partial t} = {{- {\\nabla J_{i}}} + R_{i}}} & (5)\n\\end{matrix}\\)",
                                "Where Ri is the reaction rate of species i in the bulk fluid. Electric field in the electrolyte can be calculated considering conservation of charge in the electrolyte, knowing that current arises from the motion of all charged species.",
                                "i=−κ∇ϕ−κFΣiziDi∇Ci  (6)",
                                "Where the first term is ohmic potential and the second term is concentration-caused potential. In systems with supporting electrolyte, the concentration gradient can be neglected and the equation reduces to",
                                "i=−κ∇ϕ  (7)",
                                "where",
                                "κ=F2Σizi2uiCi  (8)",
                                "The inlet boundary condition is considered Dirichlet boundary with a constant feed concentration over time.",
                                "C(x=0,t)=C0  (9)",
                                "The outlet boundary condition is a Neumann boundary condition:",
                                "∇Ci=0  (10)",
                                "Fluxes on the surface of the electrodes are shown as followed.",
                                "Ji|x=electrode+∂x=Ji|x=electrode−∂x+JeRXN,i  (11)",
                                "where, JeRXN,i, is the inward electrochemical source/sink flux for ith species and is calculated in a constant current operating condition using Faraday's law.",
                                "\\(\\begin{matrix}\n{J_{{eRXN},i} = \\frac{I}{z_{i}{FA}}} & (12)\n\\end{matrix}\\)",
                                "I applied current\n\nzi number of electrons participating for each mole of species i produced/consumed\n\nF Faraday's constant, 96485 c/eq\n\nA Electrode surface area",
                                "The homogeneous phase reactions included in the model are assumed to reach equilibrium.",
                                "Σj=1NνijCi=0 for i=1, . . . ,Nx  (13)",
                                "Nc total number of species\n\nNx total number of reactions\n\nνij stochiometric constant for jth species in the ith reaction",
                                "There have been many studies on integration of species transport and equilibrium reaction models (Acar et al. 1993; Davis et al. 2003; Hojabri et al. 2018; Paz-Garcia et al. 2016; Steefel et al. 1994). In this study, reaction simulations and species concentrations are determined by PHREEQC computer program (Parkhurst et al. 2013). PHREEQC is a computer program which is designed and optimized for aqueous geochemical reactions with a strong database. Nardi et al. have developed a comprehensive geochemical model using COMSOL Multiphysics for transport calculations and PHREEQC for geochemical reaction calculations (Nardi et al. 2014). Paz Garcia et al. have obtained a similar approach in simulation of electrochemical remediation reactors using COMSOL Multiphysics with an interface with PHREEQC. In our study, we used MATLAB as the main platform for numerical calculation with an interface with PHREEQC for chemical reaction calculations. The interface written in MATLAB is used to transfer data between MATLAB and PHREEQC using Microsoft COM (Component Object Model). Phreeqc.dat is the thermodynamic database used in this study for equilibrium calculations. The reactions in the bulk fluid include acid/base reactions, water association/dissociation reaction, and redox reactions. Due to the characteristics of the aqueous reactions in this system, local equilibrium is considered.",
                                "In this study, hybrid Finite Volume differencing scheme is used for spatial discretization and implicit scheme is used for temporal discretization with a non-iterative sequential solver for integration of reactions in the simulation. This scheme guarantees continuity of the concerned variables and stability of numerical simulation. The hybrid scheme will evaluate the differencing scheme based on local Peclet number.",
                                "\\(\\begin{matrix}\n{{Pe} = \\frac{u}{D/L}} & (14)\n\\end{matrix}\\)",
                                "If the local Peclet number is small, diffusion is dominant and central differencing scheme results in smaller error. However, if the advection is dominant, upwind scheme is used to more accurately capture the impact of advection (Versteeg et al. 2007)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce process for treating contaminated water",
                                "describe Fenton-like catalyst",
                                "specify iron oxychloride catalyst",
                                "describe electric current application",
                                "specify pH range of contaminated water",
                                "describe immobilization of iron oxychloride catalyst",
                                "specify support for immobilization",
                                "describe conversion of hydrogen peroxide to hydroxy radicals",
                                "specify reaction of hydroxy radicals with contaminants",
                                "describe treatment process with influent and effluent streams",
                                "specify absence of acid addition",
                                "describe treatment of contaminated water with neutral pH",
                                "specify pH range of contaminated water in chamber",
                                "describe anode and cathode materials",
                                "specify electric current value",
                                "describe attainment of acidic pH between anode and cathode",
                                "specify concentration of hydroxy radicals",
                                "describe flow rate of water through chamber",
                                "specify treatment of water by removal of contaminants",
                                "describe removal of specific contaminants",
                                "specify degradation of contaminants to carbon dioxide and water",
                                "describe removal of bisphenol A (BPA)",
                                "specify percentage of BPA removal",
                                "describe synthesis of FeOCl nanocatalyst",
                                "specify materials used for synthesis",
                                "describe synthesis of FeOCl/Al2O3",
                                "specify materials used for synthesis",
                                "describe synthesis of FeOCl on Alginate Hydrogel",
                                "specify materials used for synthesis",
                                "describe characterization of materials",
                                "specify X-ray diffraction (XRD) analysis",
                                "describe Field Emission Scanning Electron Microscope (FESEM) analysis",
                                "specify High Resolution Transmission Electron Microscopy (HRTEM) analysis",
                                "describe X-ray Photoelectron Spectroscopy (XPS) analysis",
                                "specify surface area, pore volume, and pore size distribution analysis",
                                "describe EFL platform loading unimmobilized FeOCl",
                                "specify experimental setup",
                                "describe flow-through column reaction",
                                "specify experimental setup",
                                "describe hydroxyl radical quantification method",
                                "specify benzoic acid oxidation method",
                                "describe Density Functional Theory (DFT) calculation method",
                                "specify geometry optimization and energy calculation",
                                "describe reactive transport model to estimate steady-state pH in the Ella process"
                            ],
                            "num_characters": 22410,
                            "outline_medium": [
                                "introduce process for treating contaminated water with hydrogen peroxide and Fenton-like catalyst",
                                "describe process without acid",
                                "specify iron oxychloride catalyst",
                                "describe electric current application",
                                "specify pH range of contaminated water",
                                "describe immobilization of iron oxychloride catalyst",
                                "specify conversion of hydrogen peroxide to hydroxy radicals",
                                "describe treatment process with influent and effluent streams",
                                "specify absence of acid addition",
                                "describe treatment of various contaminants",
                                "specify removal of bisphenol A (BPA)",
                                "describe degradation of contaminants to carbon dioxide and water",
                                "specify chemicals used",
                                "describe synthesis of FeOCl nanocatalyst",
                                "describe synthesis of FeOCl/Al2O3",
                                "describe synthesis of FeOCl on Alginate Hydrogel",
                                "describe characterization of materials",
                                "describe EFL platform loading unimmobilized FeOCl",
                                "describe flow-through column reaction",
                                "describe hydroxyl radical quantification method",
                                "describe density functional theory (DFT) calculation method",
                                "describe reactive transport model to estimate steady-state pH in the Ella process"
                            ],
                            "outline_short": [
                                "describe process for treating contaminated water with hydrogen peroxide and Fenton-like catalyst",
                                "specify process conditions: absence of acid, electric current, and pH range",
                                "detail iron oxychloride catalyst composition and immobilization",
                                "describe hydrogen peroxide conversion to hydroxy radicals",
                                "outline process steps: adding hydrogen peroxide, providing influent stream, applying electric current, and collecting effluent stream",
                                "specify treatment outcomes: purification, contaminant removal, and degradation",
                                "provide examples of contaminants removed: BPA, drugs, herbicides, pesticides, and dyes",
                                "describe chemicals used: FeCl3, H2O2, γ-Al2O3, and BPA",
                                "outline synthesis of FeOCl and FeOCl/Al2O3",
                                "describe characterization of materials: XRD, FESEM, HRTEM, and XPS",
                                "detail experimental setup: EFL platform loading, flow-through column reaction, and hydroxyl radical quantification"
                            ]
                        },
                        {
                            "title": "Example 1. Design of a Flow-Through Water Treatment Platform",
                            "paragraphs": [
                                "Ella process was utilized to regulate pH of heterogeneous Fenton-like catalysts for water treatment with desired acidity. To this end, immobilized catalysts must be transferred to the acidic zone mediated by the Ella process, whereby H2O2 is rapidly transformed into oxidizing HO. radicals, leading to the instant degradation of organic compounds in the local vicinity (FIG. 1A). This coupled water treatment process is categorized as electro-Fenton-like (EFL) platform in this study. The flow-through treatment method is especially favored over batch reaction mode for industry application, since a water treatment plant treats high volume of contaminated water in a fast pace. Besides, it is worth of noting that the EFL platform can take advantage of the intermittent solar and wind electricity, often with near-zero or even negative prices.",
                                "The contaminants treatment efficiency by the EFL platform is majorly determined by the reaction during the transport through catalyst column, that is, longer retention time and higher catalyst and H2O2 concentration tend to result in more complete contaminants removal. Therefore, the key aspects to warrant the success of the EFL platform are to promote HO. generation and allow sufficient reaction time within the column."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Ella process for water treatment",
                                "describe electro-Fenton-like (EFL) platform"
                            ],
                            "num_characters": 1269,
                            "outline_medium": [
                                "describe Ella process for regulating pH of heterogeneous Fenton-like catalysts for water treatment"
                            ],
                            "outline_short": [
                                "describe EFL platform design for water treatment with immobilized Fenton-like catalysts"
                            ]
                        },
                        {
                            "title": "pH Regulation by the Ella Process",
                            "paragraphs": [
                                "As a proof of concept, a benchtop flow-through device was manufactured for our EFL platform. A set of stable mixed metal oxide electrodes were installed 9 cm apart in a vertically anchored acrylic flow-through column device (15 cm×5 cm O.D.). The column was filled with clean silica sand (0.15 to 0.6 mm) to maintain a laminar flow. A combination of 100 mA electric current and 15 mL/min hydraulic flow rate was applied to the neutral solution passing through the column, and solution pHs at various locations along the column were measured (FIG. 1B). The solution was homogeneously neutral without electric current; however, by turning on the 100 mA electric current, an acidic pH of 2.93-3.12 between the anode and cathode was automatically attained at steady state. The electrochemically created acidity is suitable for most Fenton-like catalysts. The effluent pH measured as 7.59 was close to the influent value (pH 7), showing minimal effect on the treated water pH. A reactive transport model that accounts for advection, hydrodynamic dispersion, and ion migration was used to simulate the pH profile (Hojabri et al. 2018). Modeling results indicate that the theoretical acidity of the confined space between electrodes using the above stated experimental settings is pH 2.8. The slight discrepancy of pH between experimental results and modelled value is possibly because the current efficiency of water electrolysis was not 100% due to possible energy losses in a non-ideal system."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "demonstrate pH regulation by Ella process",
                                "model pH profile using reactive transport model"
                            ],
                            "num_characters": 1489,
                            "outline_medium": [
                                "demonstrate Ella process for pH regulation"
                            ],
                            "outline_short": [
                                "demonstrate Ella process for pH regulation"
                            ]
                        },
                        {
                            "title": "Immobilization of Fenton-Like Catalyst",
                            "paragraphs": [
                                "Iron oxychloride (FeOCl) was reported to possess extraordinary Fenton-like activity with high fidelity and can be mass produced (Sun et al. 2018; Yang et al. 2013). Characterizations of the synthetic FeOCl nanocatalyst produced via the calcination of FeCl3.6H2O were shown in FIGS. 2 and 3. Bisphenol A (BPA) was used as the primary pollutant to illustrate FeOCl catalytic degradation performance, provided BPA is an environmental estrogen that disrupts human endocrine system upon exposure (Vanderberg et al. 2007). 10 μM BPA was rapidly degraded by the FeOCl/H2O2 reaction. On the contrary, the addition of ethanol, a strong HO. radical quencher (Adams et al. 1965), competed with BPA for the produced HO. radical reservoir and fully inhibited BPA removal by FeOCl/H2O2 reaction, demonstrating the degradation of BPA was via HO. radical (FIG. 10). The activity of synthesized FeOCl sample was tested by decomposing H2O2 for BPA removal. It was shown that 0.2 g/L FeOCl with 10 mM H2O2 at pH 3 could remove 86% 10 μM BPA in 6 min and 100% BPA in 8 min. The role of HO. radical in BPA removal was verified by ethanol as a scavenger, since it fully inhibited BPA removal via quenching HO. radical. The catalytic activities of FeOCl at different pHs were compared. Results showed that, the optimum pH for FeOCl is around pH 3 as it mediated the highest yield of HO. radical. It was further found that FeOCl showed optimal activity at pH 3, around 9.3-fold higher than that at pH 7 in terms of HO. radical yield (FIG. 4B).",
                                "Density functional theory (DFT) calculation was harnessed to study the catalysis mechanism of the FeOCl/H2O2 reaction. It was revealed that the reaction is accomplished via two electron-transfer processes (FIG. 5). In the first step, FeIIIOCl is at first reduced by H2O2 into FeIIOCl, and the second step the derived FeIIOCl then decomposes H2O2 into HO. radical via homolytic cleavage. The readily reducible nature of unsaturated Fe atoms on the exposed (100) surface of FeOCl crystals allows rapid turnovers of FeIII/II to catalyze the H2O2 transformation. Specifically, the energy barrier of reducing FeIII to FeII on FeOCl crystals by H2O2 was determined to be 0.235 eV (FIG. 6), whereas that of hematite (Fe2O3, a rhombohedral Fenton-like catalyst) is 0.76 eV as a comparison (Ji et al. 2019).",
                                "It is, however, a great concern that the micro catalyst particles are subject to fluid transport, resulting in potential draining from the silica sand pores within the column device. For instance, by packing well-mixed FeOCl and silica sand particles into the column (FIG. 7), the overall catalyst activity decayed by 36% after 8 h due to hydraulic erosion (FIG. 8). Another immobilization strategy of cross-linking FeOCl with alginate hydrogel was attempted for effective retention of FeOCl nanoparticles (FIG. 9) (Smidsrød et al. 2019). However, the resulting FeOCl/alginate composite showed only 1% activity compared to the same amount of unimmobilized FeOCl catalyst (FIG. 10), delivering poor in-reactor performance under high flow rates (FIGS. 11 and 12). At pH 3, 0.2 g/L FeOCl and 10 mM H2O2 mediated formation of 305.3 μM HO. radical (FIG. 4B) after 30 min, while 0.075 g/mL FeOCl/alginate (dry weight, 1:2 FeOCl:alginate) produced 396.2 μM HO. radical (FIG. 10B). As a result, the specific activity of unimmobilized and immobilized FeOCl was calculated as 1511.5 and 15.8 μM HO./(g L−1) FeOCl, respectively. This is due to a large fraction of FeOCl particles becoming buried inside the hydrogel of the FeOCl/alginate composite and were not effectively accessible by H2O2 molecules.",
                                "To solve this problem, FeOCl nanoparticles were alternatively immobilized on a porous γ-Al2O3 support via a melt infiltration method (FIG. 13A) (Eggenhuisen et al. 2010), with the belief that this approach offers maximum FeOCl catalytic sites for H2O2 molecules. Field emission scanning electron microscopy (FESEM) images clearly revealed the dispersion of FeOCl nanosheets on the amorphous γ-Al2O3 support in the synthesized FeOCl/Al2O3 composite (FIGS. 13B-13D), with a surface area of 206 m2/g (Table 4). The compositional distribution of the FeOCl/Al2O3 was investigated with energy-dispersive X-ray spectroscopy (EDX) (FIG. 13E). EDX analysis identified Al, O, Fe, and Cl elements on the FeOCl/Al2O3 composite. Elemental mapping results suggested that Al and Fe elements were separately located, in agreement with the overlay structure of the FeOCl/Al2O3 composite. Besides, Cl element exhibited consistent pattern with Fe element on the FeOCl surface, while O element was uniformly distributed on the FeOCl/Al2O3 composite. X-ray diffraction (XRD) of the FeOCl/Al2O3 composite disclosed several characteristic diffraction peaks (2θ) at 11.2, 26.1, and 35.4°, which respectively belongs to the (010), (110), and (O21) plane of orthorhombic FeOCl crystal (PDF 01-072-0619) (FIG. 13F). The chemical states of compositional elements were studied with X-ray photoelectron spectroscopy (XPS). In particular, deconvoluted Fe 2p spectrum showed Fe3+2p1/2 (724.6 eV) and 2p3/2 (711.2 eV) were dominant over Fe2+2p1/2 (728.2 eV) and 2p3/2 (714.6 eV) (FIG. 13G), consistent with the unimmobilized FeOCl crystal (FIG. 3). XPS analyses of other elements in the FeOCl/Al2O3 composite and the γ-Al2O3 support are shown in FIGS. 15 and 18. Overall, the above results suggested that the morphology and electronic properties of the FeOCl crystal remained intact after immobilization on the γ-Al2O3 support.",
                                "Activity test results of the synthetic FeOCl/Al2O3 composite are shown in FIG. 16. It was found that 10 μM BPA was completely degraded in 10 min by 0.2 g/L of FeOCl/Al2O3 and 10 mM H2O2 at pH 3, while the FeOCl/Al2O3 composite or H2O2 alone led to negligible BPA removals. Further, under the stated conditions, FeOCl/Al2O3-mediated Fenton-like reaction produced the most remarkable amount of HO. radicals at pH 3 (i.e., 289.8 μM after reaction for 30 min), which acidity could be readily achieved by the Ella process. The catalytic performance of the FeOCl/Al2O3 composite showed a consistent pattern with that of the unimmobilized FeOCl nanoparticle (FIG. 4), indicating that the γ-Al2O3 support played no role in H2O2 transformation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce FeOCl as Fenton-like catalyst",
                                "characterize FeOCl nanocatalyst",
                                "test FeOCl catalytic degradation performance",
                                "demonstrate role of HO. radical in BPA removal",
                                "compare catalytic activities of FeOCl at different pHs",
                                "study catalysis mechanism of FeOCl/H2O2 reaction using DFT",
                                "describe limitations of FeOCl immobilization",
                                "attempt cross-linking FeOCl with alginate hydrogel",
                                "evaluate activity of FeOCl/alginate composite",
                                "immobilize FeOCl on γ-Al2O3 support",
                                "characterize FeOCl/Al2O3 composite",
                                "test activity of FeOCl/Al2O3 composite"
                            ],
                            "num_characters": 6245,
                            "outline_medium": [
                                "introduce FeOCl as Fenton-like catalyst",
                                "characterize FeOCl nanocatalyst",
                                "test FeOCl catalytic activity",
                                "study catalysis mechanism via DFT calculation",
                                "immobilize FeOCl on silica sand",
                                "immobilize FeOCl on γ-Al2O3 support"
                            ],
                            "outline_short": [
                                "synthesize and characterize FeOCl nanocatalyst",
                                "test FeOCl catalytic activity for BPA degradation",
                                "immobilize FeOCl on γ-Al2O3 support"
                            ]
                        },
                        {
                            "title": "Example 2. High Performance of the Electro-Fenton-Like Platform",
                            "paragraphs": [
                                "The synthetic FeOCl/Al2O3 composites were transferred to the space between electrodes of the column, in order to utilize the acidity produced by the Ella process (FIG. 17A). Neutral solutions containing 10 mM H2O2 oxidant and 10 μM BPA contaminant were pumped through the column at a rate of 15 mL/min, and BPA removals along the hydraulic flux direction were measured (FIG. 17B). Low BPA removal from the effluent (17.6%) was observed without electric current, due to the weak activity of FeOCl/Al2O3 under neutral condition. However, after a 100 mA electric current was applied to electrodes, gradual degradation of BPA took place as measured from the sampling ports, and BPA removal reached 100% in the effluent. Direct BPA degradation by electrodes was ruled out based on control experiment (FIG. 18). Additionally, the presence of 10 mM ethanol as HO. radical scavenger almost fully quenched BPA removal (FIG. 18), suggesting that in situ produced HO. radicals accounted for BPA degradation. As shown in FIG. 19, the HO. radicals generated by the EFL platform could also non-selectively degrade other organic contaminants including drugs (ibuprofen and carbamazepine), herbicide (atrazine), pesticide and drug precursors (4-chlorophenol and 4-nitrophenol), and recalcitrant dyes (rhodamine B, reactive blue 19, and orange II). It was further determined that the yield of HO. radical produced by the platform when 100 mA electric current was turned off and on was 23.5 and 254.4 μM, respectively (FIG. 17C). This 10.8-fold increase in HO. radical production was attributed to the acidic environment created by the Ella process which boosted FeOCl/Al2O3 catalyst activity. Results indicate that the EFL platform by coupling a heterogeneous Fenton-like catalyst and the Ella process in a flow-through column device is effective for removal of organic contaminants.",
                                "The long-term stability of BPA removal by the EFL platform was tested (FIG. 17D). Over the course of 8-h reactions, laminar fluid transport was maintained, and the BPA removal steadily approached 100%. BPA removal by this platform under different hydraulic flow rates was also measured (FIG. 17E). A high flow rate leads to shortened contact time among H2O2 molecules, the catalyst surface, and the organic contaminant, which reduces HO. radical yield and compromises contaminant removal. Over 95% of 10 μM BPA could be removed from the effluent at a flow rate of less than 20 mL/min, whereas BPA removal rate decreased to 82.4% and 44.4% at 25 and 30 mL/min, respectively. The tolerance of flow rate by using FeOCl/Al2O3 in this design was greatly superior than that by using FeOCl crosslinked on alginate hydrogel as a catalyst (FIG. 12), primarily due to the abundant catalytic sites exposed on the surface of the FeOCl/Al2O3 composite.",
                                "Responsiveness of BPA removal by the EFL platform to electric current was monitored by repeatedly turning the electric power supply on and off with a 60-min interval. As shown in FIG. 17F, BPA removal significantly increased after the 100 mA electric current was turned on for 15 min, and approached 100% after 40 min. As the power was turned off, BPA removal gradually decreased during the first 30 min, from 84.3-92.3% to 16.7-23.9%, and was steady afterwards. The non-instant response of BPA removal to electricity was presumably because of the slow accumulation and desorption of protons. Results demonstrated that electricity is a critical governor of contaminant removal by our developed platform. In addition, the observed response time in this study matches well with the intermittency of solar and wind electricity, and therefore our device can potentially provide clean drinking water without the need for battery energy storage.",
                                "Complex water environments are typically encountered in water treatment practices, posing challenges to downgradient treatment. For instance, water bodies receiving leachates from industries could be highly basic and require a pH neutralization process such as CO2 sequestration before biological/chemical treatment (Gomes et al. 2016). In this study, contaminants in a synthetic basic solution are treated by the EFL platform. Influent solutions of pH 7-11 were effectively acidified to around pH 3 under 100 mA electric current and 15 mL/min flow rate, in good agreement with modeling results (FIG. 20A). Consequently, BPA removals approached 100% under the Ella process-mediated acidic environment regardless of influent pH, whereas less than 22.4% of BPA was removed when the electric current was turned off (FIG. 20B).",
                                "The potential of water bodies to neutralize protons, namely water alkalinity, represents another challenge for acid-demanding chemical treatments due to the buffering carbonate ions, expressed as equivalent mg CaCO3/L (Lahay et al. 2007). Specifically, a substantial amount of acid is required to overcome high water alkalinity for the conventional Fenton process. BPA removal in synthetic solutions containing 0-200 mg CaCO3/L water alkalinity were tested by the EFL platform. Results show that, solution of higher alkalinity was less prone to acidification by the Ella process, but the acidic zone was still below pH 4.14 in all tests under 100 mA electric current and 15 mL/min flow rate (FIG. 20C). This acidity led to an 84.5%-100% removal efficiency of BPA, significantly higher than that when electric current was turned off (FIG. 20D). The acidity produced by the Ella process could be tuned against water buffering capacity by adjusting applied electric current and hydraulic flow rate. For instance, a combination of 60 mA electric current and 2 mL/min flow rate is able to acidify a solution of 500 mg CaCO3/L alkalinity from pH 8 to pH 3.5 (Yuan et al. 2013)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "transfer FeOCl/Al2O3 composite to column device",
                                "test BPA removal under different conditions",
                                "demonstrate role of HO. radical in BPA removal",
                                "test degradation of other organic contaminants",
                                "evaluate long-term stability of BPA removal",
                                "test BPA removal under different hydraulic flow rates",
                                "monitor responsiveness of BPA removal to electric current",
                                "demonstrate effect of electric current on BPA removal",
                                "test BPA removal in synthetic basic solutions",
                                "evaluate effect of water alkalinity on BPA removal",
                                "discuss potential of EFL platform for water treatment"
                            ],
                            "num_characters": 5746,
                            "outline_medium": [
                                "test FeOCl/Al2O3 composite activity",
                                "integrate FeOCl/Al2O3 with Ella process",
                                "measure BPA removal and HO. radical production",
                                "test long-term stability and flow rate effect",
                                "demonstrate responsiveness to electric current"
                            ],
                            "outline_short": [
                                "test FeOCl/Al2O3 composite for BPA degradation",
                                "demonstrate EFL platform for contaminant removal"
                            ]
                        },
                        {
                            "title": "Example 3. Test with Field Water Samples",
                            "paragraphs": [
                                "The results demonstrate the effectiveness of the EFL platform in synthetic solutions of complex water chemistry. Furthermore, in this study, water samples extracted in the field from surface or groundwater sources were used as the matrices for BPA removal with intrinsic conductivity supporting electrochemical water splitting. Water quality characteristics are shown in Table 2. Treated water bodies were acidified to pH 2.9-4.04 by the Ella process, and 91.7 to 97.2% BPA removals were achieved by the mediated Fenton-like process (FIG. 21)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "test EFL platform with field water samples"
                            ],
                            "num_characters": 543,
                            "outline_medium": [
                                "test EFL platform with field water samples"
                            ],
                            "outline_short": [
                                "test EFL platform with field water samples"
                            ]
                        },
                        {
                            "title": "Example 4. Techno-Economic Analysis",
                            "paragraphs": [
                                "Compared with the conventional Fenton process, the required energy for electrochemical water splitting by this integral EFL platform is estimated to be 1.39 kWh/m3 influent, which translates into a cost of $0.091/m3 based on the average US industrial electricity rate ($0.0653/kWh) (Average Price of Electricity to Ultimate Customers by End-Use Sector, 2020). This value is subjected to optimization based on applied electric current, hydraulic flow rate, and solution conductivity, but it only constitutes around 10% of unit operating cost by modern water treatment plants (Guo et al. 2014). Besides, the cost of γ-Al2O3 and FeCl3.6H2O is estimated as $0.5/kg (Aluminum Oxide Price, 2020) and $0.3/kg (Ferric Chloride Price, 2020), respectively. This means it takes less than $0.0005 to synthesize 1 g of FeOCl/Al2O3 catalyst, and we used ˜50 g of synthesized catalyst particles for our device. By considering the long-term stability of this catalyst, its cost is indeed negligible. Furthermore, in situ electrochemical synthesis of highly concentrated H2O2 (Chen et al. 2017; Yamanaka et al. 2003) could be used as a replacement of externally supplied H2O2 in the future, further reducing the overall chemical cost.",
                                "Moreover, the EFL water treatment platform developed in this study is applied to practical implementation after upscaling. The fast response of the EFL platform in removing organic pollutants especially allows for smart controls at low cost. In addition, it possesses the easy-to-(un)install feature that makes it affordable and compatible with other connecting units of a centralized water treatment facility. For instance, a feasible niche of this device is to function as an electrochemical filter before advanced purification units requiring removal of fouling hazards such as organic molecules and biofilm-forming bacteria (Guo et al. 2011; Zhou et al. 1990). On the small size end, the EFL platform is designed to provide clean drinking water for individual families without electrical grid, by coupling with cheap photovoltaic sources."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "estimate energy cost of EFL platform",
                                "estimate cost of FeOCl/Al2O3 catalyst",
                                "discuss potential for upscaling and practical implementation",
                                "highlight advantages of EFL platform for water treatment"
                            ],
                            "num_characters": 2061,
                            "outline_medium": [
                                "estimate energy cost and operating cost",
                                "discuss cost-effectiveness and upscaling potential"
                            ],
                            "outline_short": [
                                "analyze techno-economic feasibility of EFL platform"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce Fenton-like water treatment process",
                        "motivate need for effective pretreatment",
                        "describe Ella process and its advantages",
                        "summarize benefits of Ella process",
                        "suggest applications of Ella process"
                    ],
                    "num_characters": 2581,
                    "outline_medium": [
                        "motivate Fenton-like water treatment process",
                        "describe Ella process advantages"
                    ],
                    "outline_short": [
                        "introduce Fenton-like water treatment process"
                    ]
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "An electro-Fenton-like (EFL) platform wherein an electrochemically produced acidic environment supports heterogeneous Fenton-like reaction was developed for high throughput water treatment of contaminated water. The acidic pH produced by the Ella process (100 mA electric current and 15 mL/min flow rate) mediated a 10.8-fold increase in HO. yield, which contributed to the complete removal of contaminants in the effluent. The EFL platform showed strong stability for long-term use, tolerance of high water flux, and effectiveness against complex water chemistry for organic contaminant removal. The setup configuration is advantageous in that it provides high degree of automation that enables water treatment by controlling the electric power, and low operating cost that most modern water treatment plants strive for, both of which are especially attractive for industrial applications.",
                        "The Ella process displays a small footprint because it turns neutral influent into acidic solution in between electrodes, and zones beyond that are neutral as the influent. Combined with heterogeneous Fenton-like catalysts, Ella process showed excellent performance under long-term use, high flow rate, and complex water chemistry, manifesting the robustness of this coupled platform for recalcitrant organic compounds removal."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce EFL platform",
                        "advantages of Ella process"
                    ],
                    "num_characters": 1319,
                    "outline_medium": [
                        "introduce electro-Fenton-like platform"
                    ],
                    "outline_short": [
                        "introduce electro-Fenton-like platform"
                    ]
                },
                {
                    "title": "REFERENCES CITED",
                    "paragraphs": [
                        "- Acar, Y. B., Alshawabkeh, A. N. Principles of electrokinetic\n  remediation. *Environ. Sci. Technol.* 27, 2638-2647 (1993).\n- Adams, G. E., Boag, J. W. & Michael, B. D. Reactions of the hydroxyl\n  radical. Part 2.-Determination of absolute rate constants. *Trans.\n  Faraday Soc.* 61, 1417-1424 (1965).\n- Aluminum Oxide Price \\[online\\], available from\n  \\<https://www.intratec.us/chemical-markets/aluminum-oxide-price\\>.\n  retrieved September 2020.\n- André, R. et al. V₂O₅ nanowires with an intrinsic peroxidase-like\n  activity. *Adv. Funct. Mater.* 21, 501-509 (2011).\n- Asati, A., Santra, S., Kaittanis, C., Nath, S. & Perez, J. M.\n  Oxidase-like activity of polymer-coated cerium oxide nanoparticles.\n  *Angew. Chem. Int. Ed.* 121, 2344-2348 (2009).\n- Babuponnusami, A. & Muthukumar, K. A review on Fenton and improvements\n  to the Fenton process for wastewater treatment. *J. Environ. Chem.\n  Eng.* 2, 557-572 (2014).\n- Bokare, A. D. & Choi, W. Review of iron-free Fenton-like systems for\n  activating H₂O₂ in advanced oxidation processes. *J Hazard. Mater.*\n  275, 121-135 (2014).\n- Bolobajev, J. et al. Reuse of ferric sludge as an iron source for the\n  Fenton-based process in wastewater treatment. *Chem. Eng. J.* 255,\n  8-13 (2014).\n- Brillas, E., Sirés, I. & Oturan, M. A. Electro-Fenton process and\n  related electrochemical technologies based on Fenton's reaction\n  chemistry. *Chem. Rev.* 109, 6570-6631 (2009).\n- Cai, R. et al. Single nanoparticle to 3D supercage: framing for an\n  artificial enzyme system. *J. Am. Chem. Soc.* 137, 13957-13963 (2015).\n- Cai, S. et al. Pt74Ag₂₆ nanoparticle-decorated ultrathin MoS₂\n  nanosheets as novel peroxidase mimics for highly selective\n  colorimetric detection of H₂O₂ and glucose. *Nanoscale* 8, 3685-3693\n  (2016).\n- Cai, S. et al. Single-layer Rh nanosheets with ultrahigh\n  peroxidase-like activity for colorimetric biosensing. *Nano Res.* 11,\n  6304-6315 (2018).\n- Chen, Z. et al. Development of a reactor with carbon catalysts for\n  modular-scale, low-cost electrochemical generation of H₂O₂*. React.\n  Chem. Eng.* 2, 239-245 (2017).\n- Chen, T. M., Wu, X. J., Wang, J. X. & Yang, G. W. WSe₂ few layers with\n  enzyme mimic activity for high-sensitive and high-selective visual\n  detection of glucose. *Nanoscale* 9, 11806-11813 (2017).\n- Cheng, M. et al. Metal-organic frameworks for highly efficient\n  heterogeneous Fenton-like catalysis. *Coord Chem. Rev.* 368, 80-92\n  (2018).\n- Clark, S. J. et al. First principles methods using CASTEP. Z.\n  *Kristallogr Cryst. Mater.* 220, 567-570 (2005).\n- Davis, E. M. & Davis, R. J. Fundamentals of Chemical Reaction\n  Engineering. *Journal of Chemical Education* (Vol. 43, 2003). New\n  York, N: McGraw-Hill Higher Education.\n- Deng, H. et al. Monodisperse magnetic single-crystal ferrite\n  microspheres. *Angew. Chem. Int. Ed.* 44, 2782-2785 (2005).\n- De Smedt, F. & Wierenga, P. J. Solute transfer through columns of\n  glass beads. *Water Resources Res.* 20, 225-232 (1984).\n- Ding, Y. et al. FePt—Au ternary metallic nanoparticles with the\n  enhanced peroxidase-like activity for ultrafast colorimetric detection\n  of H₂O₂*. Sensor. Actuat. B: Chem.* 259, 775-783 (2018).\n- Eggenhuisen, T. M., Breejen, J. P. D., Verdoes, D., Jongh, P. E. D. &\n  Jong, K. P. D. Fundamentals of melt infiltration for the preparation\n  of supported metal catalysts. The case of Co/SiO₂ for Fischer-Tropsch\n  synthesis. *J. Am. Chem. Soc.* 132, 18318-18325 (2010).\n- Feng, F., Xu, Z., Li, X., You, W. & Zhen, Y. Advanced treatment of\n  dyeing wastewater towards reuse by the combined Fenton oxidation and\n  membrane bioreactor process. *J. Environ. Sci.* 22, 1657-1665 (2010).\n- Ferric Chloride Price \\[online\\], available from\n  \\<https://www.icis.com/explore/resources/news/2001/08/27/145944/us-ferric-chloride-producers-raise-prices-in-healthy-market/\\>,\n  retrieved September 2020.\n- Ganiyu, S. O., Van Hullebusch, E. D., Cretin, M., Esposito, G. &\n  Oturan, M. A. Coupling of membrane filtration and advanced oxidation\n  processes for removal of pharmaceutical residues: a critical review.\n  *Sep. Purif. Technol.* 156, 891-914 (2015).\n- Ganiyu, S. O., Zhou, M. & Martinez-Huitle, C. A. Heterogeneous\n  electro-Fenton and photoelectro-Fenton processes: a critical review of\n  fundamental principles and application for water/wastewater treatment.\n  *Appl. Catal*., B. 235, 103-129 (2018).\n- Garrido-Ramirez, E. G., Theng, B. K. G. & Mora, M. L. Clays and oxide\n  minerals as catalysts and nanocatalysts in Fenton-like reactions—a\n  review. *Appl. Clay Sci.* 47, 182-192 (2010).\n- Gao, L. et al. Intrinsic peroxidase-like activity of ferromagnetic\n  nanoparticles. *Nat. Nanotechnol.* 2, 577-583 (2007).\n- Gao, W. et al. Membrane fouling control in ultrafiltration technology\n  for drinking water production: a review. *Desalination* 272, 1-8\n  (2011).\n- Gomes, H. I., Mayes, W. M., Rogerson, M., Stewart, D. I. &\n  Burke, I. T. Alkaline residues and the environment: a review of\n  impacts, management practices and opportunities. *J. Clean. Prod.*\n  112, 3571-3582 (2016).\n- Guo, W., Ngo, H. H. & Li, J. A mini-review on membrane fouling.\n  *Bioresour. Technol.* 122, 27-34 (2012).\n- Guo, T., Englehardt, J. & Wu, T. Review of cost versus scale: water\n  and wastewater treatment and reuse processes. *Wat. Sci. Tech.* 69,\n  223-234 (2014).\n- He, Y et al. Microwave-Assisted Fabrication of Bimetallic PdCu\n  Nanocorals with Enhanced Peroxidase-Like Activity and Efficiency for\n  Thiocyanate Sensing. *ACS Appl. Nano Mater.* 1, 2397-2405 (2018).\n- Herney-Ramirez, J., Vicente, M. A. & Madeira, L. M. Heterogeneous\n  photo-Fenton oxidation with pillared clay-based catalysts for\n  wastewater treatment: a review. *Appl. Catal*., B. 98, 10-26 (2010).\n- Hojabri, S., Rajic, L. & Alshawabkeh, A. N. Transient reactive\n  transport model for physico-chemical transformation by electrochemical\n  reactive barriers. *J. Hazard. Mater.* 358, 171-177 (2018).\n- Hu, L. et al. Copper nanoclusters as peroxidase mimetics and their\n  applications to H₂O₂ and glucose detection. *Anal. Chico. Acta* 762,\n  83-86 (2013).\n- Jiang, T., Song, Y., Du, D., Liu, X. & Lin, Y. Detection of p₅₃\n  protein based on mesoporous Pt—Pd nanoparticles with enhanced\n  peroxidase-like catalysis. *ACS Sensors* 1, 717-724 (2016).\n- Ji, X. X., Wang, H. F. & Hu, P. J. First principles study of Fenton\n  reaction catalyzed by FeOCl: reaction mechanism and location of active\n  site. *Rare Metals* 38, 783-792 (2019).\n- Keith, D. C. et al. Geochemical models of the impact of acidic\n  groundwater and evaporative sulfate salts on Boulder Creek at Iron\n  Mountain, Calif. *Appl. Geochem.* 16, 947-961 (2001).\n- Kim, M. C., Lee, D., Jeong, S. H., Lee, S. Y. & Kang, E.\n  Nanodiamond—Gold Nanocomposites with the Peroxidase-Like Oxidative\n  Catalytic Activity. *ACS Appl. Mater. Interfaces* 8, 34317-34326\n  (2016).\n- Koppenol, W. H. The Haber-Weiss cycle-70 years later. *Redox Rep.* 6,\n  229-234 (2001).\n- Lahav, O. & Birnhack, L. Quality criteria for desalinated water\n  following post-treatment. *Desalination* 207, 286-303 (2007).\n- Lin, T. et al. Visual detection of blood glucose based on\n  peroxidase-like activity of WS₂ nanosheets. *Biosens. Bioelectron.*\n  62, 302-307 (2014).\n- Lin, T., Zhong, L., Guo, L., Fu, F. & Chen, G. Seeing diabetes: visual\n  detection of glucose based on the intrinsic peroxidase-like activity\n  of MoS₂ nanosheets. *Nanoscale* 6, 11856-11862 (2014).\n- Lin, L. et al. Intrinsic peroxidase-like catalytic activity of\n  nitrogen-doped graphene quantum dots and their application in the\n  colorimetric detection of H₂O₂ and glucose. *Anal. Chico. Acta* 869,\n  89-95 (2015).\n- Liu, S., Lu, F., Xing, R. & Zhu, J. J. Structural effects of Fe₃O₄\n  nanocrystals on peroxidase-like activity. *Chem.: Eur. J.* 17, 620-625\n  (2011).\n- Liu, Y, Zhu, G., Yang, J., Yuan, A. & Shen, X. Peroxidase-like\n  catalytic activity of Ag₃PO₄ nanocrystals prepared by a colloidal\n  route. *PloS one* 9, e109158 (2014).\n- Liu, F. et al. Cu-hemin metal-organic frameworks with peroxidase-like\n  activity as peroxidase mimics for colorimetric sensing of glucose. *J.\n  Nanopart. Res.* 18, 106 (2016).\n- Lu, L. et al. Wastewater treatment for carbon capture and utilization.\n  *Nat. Sustain.* 1, 750-758 (2018).\n- Ma, M. et al. Size dependence of specific power absorption of Fe₃O₄\n  particles in AC magnetic field. *J. Magn. Magn. Mater.* 268, 33-39\n  (2004).\n- Ma, M., Zhang, Y. & Gu, N. Peroxidase-like catalytic activity of cubic\n  Pt nanocrystals. *Colloids Surf A* 373, 6-10 (2011).\n- Moon, G. H. et al. Eco-friendly photochemical production of H₂O₂\n  through O₂ reduction over carbon nitride frameworks incorporated with\n  multiple heteroelements. *ACS Catal.* 7, 2886-2895 (2017).\n- Mu, J., Wang, Y., Zhao, M. & Zhang, L. Intrinsic peroxidase-like\n  activity and catalase-like activity of Co₃O₄ nanoparticles. *Chem.\n  Comm.* 48, 2540-2542 (2012).\n- Mu, J., Li, J., Zhao, X., Yang, E. C. & Zhao, X. J. Novel urchin-like\n  Co₉S₈ nanomaterials with efficient intrinsic peroxidase-like activity\n  for colorimetric sensing of copper(II) ion. *Sensor. Actuat. B: Chem.*\n  258, 32-41 (2018).\n- Munoz, M., De Pedro, Z. M., Casas, J. A. & Rodriguez, J. J.\n  Preparation of magnetite-based catalysts and their application in\n  heterogeneous Fenton oxidation—a review. *Appl. Catal*., B. 176,\n  249-265 (2015).\n- Nardi, A., Idiart, A., Trinchero, P., De Vries, L. M., & Molinero, J.\n  Interface COMSOL-PHREEQC (iCP), an efficient numerical framework for\n  the solution of coupled multiphysics and geochemistry. *Comput.\n  Geosci.* 69, 10-21 (2014).\n- Neyens, E. & Baeyens, J. A review of classic Fenton's peroxidation as\n  an advanced oxidation technique. *J. Hazard. Mater.* 98, 33-50 (2003).\n- Nordstrom, D. K. & Alpers, C. N. Negative pH, efflorescent mineralogy,\n  and consequences for environmental restoration at the Iron Mountain\n  Superfund site, California. *Proc. Natl. Acad. Sci. U.S.A.* 96,\n  3455-3462 (1999).\n- Parkhurst, D. L. & Appelo, C. A. J. PHREEQC (Version 3)—A Computer\n  Program for Speciation, Batch-Reaction, One-Dimensional Transport, and\n  Inverse Geochemical Calculations. In Modeling Techniques, book 6 (p.\n  497). (2013).\n- Pariona, N., Herrera-Trejo, M., Oliva, J. & Martinez, A. I.\n  Peroxidase-like activity of ferrihydrite and hematite nanoparticles\n  for the degradation of methylene blue. *J. Nanomater.* 2016, U.S. Pat.\n  No. 3,427,809 (2016).\n- Paz-Garcia, J. M., Villén-Guzman, M., Garcia-Rubio, A., Hall, S.,\n  Ristinmaa, M. & Cesar, G.-L. A Coupled Reactive-Transport Model for\n  Electrokinetic Remediation. In A. B. Ribeiro, E. P. Mateus, & N. Couto\n  (Eds.), Electrokinetics Across Disciplines and Continents (pp.\n  251-278). Cham: Springer International Publishing. (2016).\n- Peng, Y. et al. Size-and shape-dependent peroxidase-like catalytic\n  activity of MnFe₂O₄ nanoparticles and their applications in highly\n  efficient colorimetric detection of target cancer cells. *Dalton\n  Trans.* 44, 12871-12877 (2015).\n- Pignatello, J. J., Oliveros, E. & MacKay, A. Advanced oxidation\n  processes for organic contaminant destruction based on the Fenton\n  reaction and related chemistry. *Crit. Rev. Environ. Sci. Technol.*\n  36, 1-84 (2006).\n- Pliego, G., Zazo, J. A., Blasco, S., Casas, J. A. & Rodriguez, J. J.\n  Treatment of highly polluted hazardous industrial wastewaters by\n  combined coagulation-adsorption and high-temperature Fenton oxidation.\n  *Ind. Eng. Chem. Res.* 51, 2888-2896 (2012).\n- Pouran, S. R., Raman, A. A. A. & Daud, W. M. A. W. Review on the\n  application of modified iron oxides as heterogeneous catalysts in\n  Fenton reactions. *J. Clean. Prod.* 64, 24-35 (2014).\n- Pouran, S. R., Aziz, A. A. & Daud, W. M. A. W. Review on the main\n  advances in photo-Fenton oxidation system for recalcitrant\n  wastewaters. *J. Ind. Eng. Chem.* 21, 53-69 (2015).\n- Qin, F. X. et al. Hemin@metal—organic framework with peroxidase-like\n  activity and its application to glucose detection. *Catal. Sci.\n  Technol.* 3, 2761-2768 (2013).\n- Qu, K., Shi, P., Ren, J. & Qu, X. Nanocomposite incorporating V₂O₅\n  nanowires and gold nanoparticles for mimicking an enzyme cascade\n  reaction and its application in the detection of biomolecules. *Chem.:\n  Eur. J.* 20, 7501-7506 (2014).\n- Segall, M. D. et al. First-principles simulation: ideas, illustrations\n  and the CASTEP code. *J. Phys.: Condens. Matter* 14, 2717-2744 (2002).\n- Smidsrød, O. & Skja, G. Alginate as immobilization matrix for cells.\n  *Trends Biotechnol.* 8, 71-78 (1990).\n- Song, Y, Qu, K., Zhao, C., Ren, J. & Qu, X. Graphene oxide: intrinsic\n  peroxidase catalytic activity and its application to glucose\n  detection. *Adv. Mater.* 22, 2206-2210 (2010).\n- Steefel, C. I. & Lasaga, A. C. A coupled model for transport of\n  multiple chemical species and kinetic precipitation/dissolution\n  reactions with application to reactive flow in single phase\n  hydrothermal systems. *Am. J. Sci.* 294, 529-592 (1994).\n- Sun, C. et al. Fabrication of an inorganic-organic hybrid based on an\n  iron-substituted polyoxotungstate as a peroxidase for colorimetric\n  immunoassays of H₂O₂ and cancer cells. *J. Mater. Chem*. A 1,\n  4699-4705 (2013).\n- Sun, M. et al. Reinventing Fenton chemistry: iron oxychloride\n  nanosheet for pH-insensitive H₂O₂ activation. *Environ. Sci. Tech.\n  Let.* 5, 186-191 (2018).\n- Thomas, N. et al. Heterogeneous Fenton catalysts: A review of recent\n  advances. *Journal of Hazardous Materials* 404, 124082 (2021).\n- US Average Price of Electricity to Ultimate Customers by End-Use\n  Sector \\[online\\], \\<.\n  https://www.eia.gov/electricity/monthly/epm_table_grapher.php?t=epmt_5_6_a\\>,\n  retrieved April 2020.\n- Vandenberg, L. N., Hauser, R., Marcus, M., Olea, N. & Welshons, W. V.\n  Human exposure to bisphenol A (BPA). *Reproductive Toxicol.* 24,\n  139-177 (2007).\n- Versteeg, H. K. & Malalasekera, W., 2007. An introduction to\n  computational fluid dynamics: the finite volume method. Pearson\n  education.\n- Wang, J., Han, D., Wang, X., Qi, B. & Zhao, M. Polyoxometalates as\n  peroxidase mimetics and their applications in H₂O₂ and glucose\n  detection. *Biosens. Bioelectron.* 36, 18-21 (2012).\n- Wang, Q. et al. The peroxidase-like catalytic activity of ferrocene\n  and its application in the biomimetic synthesis of microsphere\n  polyaniline. *New J. Chem.* 42, 13536-13540 (2018).\n- Wang, S., Xu D. et al. Ultrathin ZIF-67 nanosheets as a colorimetric\n  biosensing platform for peroxidase-like catalysis. *Anal. Bioanal.\n  Chem.* 410, 7145-7152 (2018).\n- Wang, C., Gao, J. & Tan, H. Integrated Antibody with Catalytic\n  Metal-Organic Framework for Colorimetric Immunoassay. *ACS Appl.\n  Mater. Interfaces* 10, 25113-25120 (2018).\n- Wardman, P. Reduction Potentials of One-Electron Couples Involving\n  Free Radicals in Aqueous Solution *J. Phys. Chem*. Ref. Data 18,\n  1637-1755 (1989).\n- Wu, Y. et al. Transformation of pollutants in landfill leachate\n  treated by a combined sequence batch reactor, coagulation, Fenton\n  oxidation and biological aerated filter technology. *Process Saf\n  Environ.* 89, 112-120 (2011).\n- Wu, X., Chen, T., Wang, J. & Yang, G. Few-layered MoSe₂ nanosheets as\n  an efficient peroxidase nanozyme for highly sensitive colorimetric\n  detection of H₂O₂ and xanthine. *J. Mater. Chem*. B 6, 105-111 (2018).\n- Yamanaka, I., Onizawa, T., Takenaka, S. & Otsuka, K. Direct and\n  continuous production of hydrogen peroxide with 93% selectivity using\n  a fuel-cell system. *Angew Chem. Int. Ed.* 42, 3653-3655 (2003).\n- Yang, X. J., Xu, X. M., Xu, J. & Han, Y F. Iron oxychloride (FeOCl):\n  an efficient Fenton-like catalyst for producing hydroxyl radicals in\n  degradation of organic contaminants. *J. Am. Chem. Soc.* 135,\n  16058-16061 (2013).\n- Ye, H. et al. Peroxidase-like properties of Ruthenium nanoframes.\n  *Sci. Bull.* 61, 1739-1745 (2016).\n- Yi, Y, Wang, L., Li, G. & Guo, H. A review on research progress in the\n  direct synthesis of hydrogen peroxide from hydrogen and oxygen:\n  noble-metal catalytic method, fuel-cell method and plasma method.\n  *Catal. Sci. Technol.* 6, 1593-1610 (2016).\n- Yuan, S., Chen, M., Mao, X. & Alshawabkeh, A. N. A three-electrode\n  column for Pd-catalytic oxidation of TCE in groundwater with automatic\n  pH-regulation and resistance to reduced sulfur compound foiling.\n  *Water Res.* 47, 269-278 (2013).\n- Zeb, A. et al. Intrinsic peroxidase-like activity and enhanced\n  photo-Fenton reactivity of iron-substituted polyoxometallate\n  nanostructures. *Dalton Trans.* 47, 7344-7352 (2018).\n- Zhang, X. Z., Zhou, Y, Zhang, W., Zhang, Y. & Gu, N.\n  Polystyrene@Au@prussian blue nanocomposites with enzyme-like activity\n  and their application in glucose detection. *Colloids Surf A* 490,\n  291-299 (2016).\n- Zheng, H. Q. et al. MOF-808: A Metal-Organic Framework with Intrinsic\n  Peroxidase-Like Catalytic Activity at Neutral pH for Colorimetric\n  Biosensing. *Inorg. Chem.* 57, 9096-9104 (2018).\n- Zhou, X. & Mopper, K. Determination of photochemically produced\n  hydroxyl radicals in seawater and freshwater. *Mar. Chem.* 30, 71-88\n  (1990)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "cite Acar et al. on electrokinetic remediation",
                        "cite Adams et al. on hydroxyl radical reactions",
                        "cite Aluminum Oxide Price on market data",
                        "cite André et al. on V₂O₅ nanowires",
                        "cite Asati et al. on cerium oxide nanoparticles",
                        "cite Babuponnusami et al. on Fenton process",
                        "cite Bokare et al. on iron-free Fenton-like systems",
                        "cite Bolobajev et al. on ferric sludge reuse",
                        "cite Brillas et al. on electro-Fenton process",
                        "cite Cai et al. on artificial enzyme systems",
                        "cite Cai et al. on Pt74Ag₂₆ nanoparticle-decorated MoS₂",
                        "cite Chen et al. on electrochemical H₂O₂ generation",
                        "cite Cheng et al. on metal-organic frameworks",
                        "cite Clark et al. on first principles methods",
                        "cite Davis et al. on chemical reaction engineering",
                        "cite Deng et al. on monodisperse magnetic ferrite microspheres",
                        "cite De Smedt et al. on solute transfer through glass beads",
                        "list references cited",
                        "introduce Moon et al. research on eco-friendly H2O2 production",
                        "discuss Mu et al. research on Co3O4 nanoparticles with peroxidase-like activity",
                        "summarize Mu et al. research on urchin-like Co9S8 nanomaterials",
                        "review Munoz et al. research on magnetite-based catalysts",
                        "introduce Nardi et al. research on interface COMSOL-PHREEQC",
                        "discuss Neyens et al. review of Fenton's peroxidation",
                        "summarize Nordstrom et al. research on negative pH and efflorescent mineralogy",
                        "introduce Parkhurst et al. research on PHREEQC",
                        "discuss Pariona et al. research on peroxidase-like activity of ferrihydrite and hematite nanoparticles",
                        "review Paz-Garcia et al. research on coupled reactive-transport model",
                        "summarize Peng et al. research on MnFe2O4 nanoparticles with peroxidase-like activity",
                        "discuss Pignatello et al. review of advanced oxidation processes",
                        "introduce Pliego et al. research on combined coagulation-adsorption and high-temperature Fenton oxidation",
                        "review Pouran et al. research on modified iron oxides as heterogeneous catalysts",
                        "discuss Qin et al. research on hemin@metal-organic framework with peroxidase-like activity",
                        "summarize remaining references cited"
                    ],
                    "num_characters": 17093,
                    "outline_medium": [
                        "list Acar et al. electrokinetic remediation",
                        "list Adams et al. hydroxyl radical reactions",
                        "list Aluminum Oxide Price online resource",
                        "list André et al. V₂O₅ nanowires peroxidase-like activity",
                        "list Asati et al. cerium oxide nanoparticles oxidase-like activity",
                        "list Babuponnusami et al. Fenton process review",
                        "list Bokare et al. iron-free Fenton-like systems review",
                        "list numerous other references on Fenton reaction, electro-Fenton, and peroxidase-like activity",
                        "list references cited",
                        "introduce Moon et al. research on eco-friendly H2O2 production",
                        "discuss Mu et al. research on Co3O4 nanoparticles with peroxidase-like activity",
                        "summarize Munoz et al. review on magnetite-based catalysts for Fenton oxidation",
                        "introduce Nardi et al. framework for coupled multiphysics and geochemistry",
                        "discuss Neyens et al. review on classic Fenton's peroxidation",
                        "summarize Nordstrom et al. research on negative pH and efflorescent mineralogy",
                        "conclude with Parkhurst et al. computer program for speciation and geochemical calculations"
                    ],
                    "outline_short": [
                        "list references on electrokinetic remediation",
                        "list references on Fenton reaction and its applications",
                        "list references on peroxidase-like activity of various materials",
                        "list references on wastewater treatment and related technologies",
                        "list references cited",
                        "summarize Fenton reaction and related chemistry",
                        "describe applications of Fenton reaction in wastewater treatment",
                        "discuss peroxidase-like activity of various materials"
                    ]
                },
                {
                    "title": "EQUIVALENTS",
                    "paragraphs": [
                        "The foregoing written specification is considered to be sufficient to enable one skilled in the art to practice the invention. The present invention is not to be limited in scope by examples provided, since the examples are intended as a single illustration of one aspect of the invention and other functionally equivalent embodiments are within the scope of the invention. Various modifications of the invention in addition to those shown and described herein will become apparent to those skilled in the art from the foregoing description and fall within the scope of the appended claims. The advantages and objects of the invention are not necessarily encompassed by each embodiment of the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "disclaim limitations"
                    ],
                    "num_characters": 703,
                    "outline_medium": [
                        "disclaim limitations"
                    ],
                    "outline_short": [
                        "disclaim limitations"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A process for treating contaminated water, comprising contacting said contaminated water with hydrogen peroxide in the presence of an iron oxychloride catalyst, wherein the process occurs in the absence of an acid.",
        "2. The process of claim 1, further comprising applying an electric current to the contaminated water.",
        "3. The process of claim 2, wherein the electric current is about 100 mA.",
        "4. The process of claim 2, wherein the contaminated water subjected to the electric current attains a pH of about 2 to about 4.",
        "5.-6. (canceled)",
        "7. The process of claim 1, wherein the iron oxychloride catalyst is a FeOCl/Al2O3 composite.",
        "8. The process of claim 7, wherein the iron oxychloride catalyst is immobilized on a support.",
        "9. The process of claim 8, wherein the iron oxychloride catalyst is immobilized on a γ-Al2O3 support.",
        "10. (canceled)",
        "11. A process for treating contaminated water, comprising:\n(i) adding hydrogen peroxide to the contaminated water;\n(ii) providing an influent stream of the contaminated water into a chamber comprising an upstream anode, a downstream cathode, and an iron oxychloride catalyst between the anode and cathode;\n(iii) applying an electric current to the chamber to provide an acidic environment in the chamber, thereby treating the contaminated water in the chamber; and\n(iv) collecting an effluent stream of the treated water exiting the chamber.",
        "12. The process of claim 11, wherein the influent stream of contaminated water is at about neutral pH; and effluent stream of treated water is at about neutral pH.",
        "13. The process of claim 11, wherein the contaminated water in the chamber is at an acidic pH.",
        "14. The process of claim 13, wherein the pH of the contaminated water in the chamber is about 2 to about 4.",
        "15.-17. (canceled)",
        "18. The process of claim 11, wherein the electric current is about 100 mA.",
        "19. The process of claim 11, wherein the iron oxychloride catalyst is a FeOCl/Al2O3 composite.",
        "20. (canceled)",
        "21. The process of claim 11, wherein the iron oxychloride catalyst is immobilized on a γ-Al2O3 support.",
        "22. The process of claim 11, wherein the hydrogen peroxide is converted to hydroxy radicals inside the chamber.",
        "23. The process of claim 22, wherein the concentration of hydroxy radicals in the chamber during step (iii) is greater than 250 μM.",
        "24. (canceled)",
        "25. The process of claim 11, wherein the flow rate of the water through the chamber is about 10 to about 25 mL/min.",
        "26.-28. (canceled)",
        "29. The process of claim 1, wherein one or more organic contaminants is decreased or removed from the water.",
        "30. The process of claim 29, wherein the one or more contaminants is one or more drugs, drug precursors, plastic precursors, herbicides, pesticides, or recalcitrant dyes.",
        "31. The process of claim 30, wherein the one or more contaminants is bisphenol A (BPA).",
        "32.-35. (canceled)"
    ]
}