{
    "id": "US20170362575",
    "authors": [
        "Xianmin Zeng",
        "Mahendra S. Rao"
    ],
    "title": "Methods and Compositions for Rapid Generation of Single and Multiplexed Reporters in Cells",
    "date": "2015-12-07 00:00:00",
    "abstract": "Methods and compositions for rapid development of reporter lines utilizing safe harbor sites in iPSCS, as well as other progenitor cells, pluripotent and multipotent stem cells and differentiated cells, and multiple Lox sites are provided.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This patent application claims the benefit of priority from U.S. Provisional Application Ser. No. 62/091,792, filed Dec. 15, 2014, the contents of which are herein incorporated by reference in their entirety."
            ],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a method for rapid development of reporter lines utilizing safe harbor sites in iPSCS as well as other progenitor cells, pluripotent or multipotent stem cell, and differentiated cells. A master cell line which uses a Cre-recombinase induced cassette exchange strategy is also provided to rapidly exchange reporter cassettes to develop new reporter lines in the same isogenic background at high efficiency. Vector constructs used to generate these lines, as well as the selected promoters and reporters, can be multiplexed to provide ratio-metric measurements and quantitative analysis as well as monitoring lineage-specific differentiation in vitro and in vivo."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce reporter lines and master cell line"
                    ],
                    "num_characters": 694,
                    "outline_medium": [
                        "introduce reporter lines and master cell line"
                    ],
                    "outline_short": [
                        "introduce reporter lines using safe harbor sites"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Induced pluripotent stem cells (iPSC) are rapidly becoming a mainstay of in vitro human cell-based assays for both toxicology and drug discovery. This has been possible due to a slew of advances in the field, which include techniques for high efficiency homologous recombination using transcription activator-like effector nuclease (TALEN), zinc finger nucleases (ZFN) or clustered regularly interspaced short palindromic repeats (CRISPRs)/cas9 system (Mali et al. Science 2013 339:823-826; Boch et al. Science 2009 326:1509-1512; Urnov et al. Nature 2005 435:646-651; and Moscou, M. J. & Bogdanove, A. J. Science 2009 326:1501), and the ability to make integration-free iPSC cost effectively from normal individuals and patients with monogenic and polygenic diseases. Combined with advances in differentiating iPSC into multiple cell types, this allows the same signaling pathways or the same mutation to be assessed in a common allelic background. The power of this approach has been demonstrated by multiple groups using human cells rather than the standard xeno models used in the past (Han et al. PLoS One 2009 4:e7155; Matsa et al. Science translational medicine 2014 6:239; Peng et al. Journal of biomolecular screening 2013 18:522-533; Sinnecker et al. Journal of cardiovascular translational research 2013 6:31-36). Other groups have used iPSC-based models to identify patients who might adversely respond to an approved drug therapy or discover new drugs to treat a disease (Laustriat et al. Biochemical Society transactions 2010 38: 1051-1057; Sinnecker et al. Pharmacology & therapeutics 2014 143: 246-252; Shtrichman et al. Current molecular medicine 2013 13:792-805; Kumar et al. Neurotoxicology 2012 33:518-529; Ananiev et al. PloS one 2011 6:e25255).",
                        "Although these efforts clearly demonstrate the utility of using iPSC-derived cells for screening and toxicology assays, several issues have constrained the widespread use of such cells. Some of these issues include the time periods required to differentiate iPSC into an appropriate phenotype, the purity of the differentiated cells, and the consistency of the differentiation process. Further constraints include the lack of isogenic lines to control for allelic variability, the difficulty in generating reporter systems, and the time required to select stable subclones for assays (Vojnits, K. & Bremer, S. Toxicology 2010 270:10-17; Fu, X. & Xu, Y. Genome medicine 2012 4:55; Ho et al. Cell transplantation 2012 21: 801-814; Sun et al. Expert review of cardiovascular therapy 2012 10: 943-945; and Tabar, V. & Studer, L. Nature reviews. Genetics 2014 15: 82-92).",
                        "Several groups have begun to develop techniques to address these problems. For example researchers have shown that ZFN, TALEN and CRISPRs/cas9 systems provide efficient gene targeting technologies and allow one to develop safe harbor or lineage specific reporter system (Wang et al. Genome research 2012 22:1316-1326; Holkers et al. Nucleic acids research 2013 41: e63; Luo et al. Stem cells translational medicine 2014 3:821-835; Maggio et al. Scientific reports 2014 4:5105). It has also been shown that it is possible to make GFP and luciferase reporter lines using a standardized targeting system for safe harbor sites where expression is not silenced during differentiation (Luo et al. Stem cells translational medicine 2014 3:821-835)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce iPSC and their applications",
                        "describe advances in homologous recombination",
                        "discuss integration-free iPSC and differentiation",
                        "highlight power of iPSC-based models",
                        "describe limitations of iPSC-derived cells",
                        "mention efforts to address these limitations"
                    ],
                    "num_characters": 3377,
                    "outline_medium": [
                        "motivate iPSC for in vitro human cell-based assays",
                        "summarize advances in iPSC technology",
                        "limitations of current iPSC-based models"
                    ],
                    "outline_short": [
                        "motivate iPSC-based assays for toxicology and drug discovery"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "An aspect of the present invention relates to a method for developing a master cell line. The method comprises integrating a reporter cassette into a cell at a safe harbor site. The reporter cassette comprises a reporter gene driven by a constitutively active promoter and multiple Lox sites.",
                        "Another aspect of the present invention relates to master cell line integrated with a reporter cassette at a safe harbor site in the cell. The reporter cassette comprises a reporter gene driven by a constitutively active promoter and multiple Lox sites.",
                        "Yet another aspect of the present invention relates to a method of generating a new reporter line using the master cell line of this invention. In the method a Cre-recombinase induced cassette exchange strategy is used to exchange the reporter cassette in the master cell line with a new reporter cassette, thereby generating a new reporter line with the same isogenic background."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize method for developing master cell line"
                    ],
                    "num_characters": 929,
                    "outline_medium": [
                        "outline method for developing master cell line"
                    ],
                    "outline_short": [
                        "describe master cell line with reporter cassette"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "Induced pluripotent stem cells (iPSC) are important tools for drug discovery assays and toxicology screens. The present invention provides a unique platform for rapidly developing custom single or dual reporter systems for screening assays in iPSCs, other progenitor cells, pluripotent and multipotent stem cells and differentiated cells.",
                        "Terms",
                        "Unless otherwise noted, technical terms are used according to conventional usage. Definitions of common terms in molecular biology may be found in Benjamin Lewin, Genes V, published by Oxford University Press, 1994 (ISBN 0-19-854287-9); Kendrew et al. (eds.), The Encyclopedia of Molecular Biology, published by Blackwell Science Ltd., 1994 (ISBN 0-632-02182-9); and Robert A. Meyers (ed.), Molecular Biology and Biotechnology: a Comprehensive Desk Reference, published by VCH Publishers, Inc., 1995 (ISBN 1-56081-569-8). In order to facilitate review of the various embodiments of this disclosure, the following explanations of specific terms are provided:",
                        "Animal: Living multi-cellular vertebrate organisms, a category that includes, for example, mammals and birds. The term mammal includes both human and non-human mammals. Similarly, the term “subject” includes both human and veterinary subjects.",
                        "Cell Culture: Cells grown under controlled condition. A primary cell culture is a culture of cells, tissues or organs taken directly from an organism and before the first subculture. Cells are expanded in culture when they are placed in a growth medium under conditions that facilitate cell growth and/or division, resulting in a larger population of the cells. When cells are expanded in culture, the rate of cell proliferation is typically measured by the amount of time required for the cells to double in number, otherwise known as the doubling time.",
                        "Differentiation: The process whereby relatively unspecialized cells (e.g., embryonic cells or stem cells) acquire specialized structural and/or functional features characteristic of mature cells. Similarly, “differentiate” refers to this process. Typically, during differentiation, cellular structure alters and tissue-specific proteins and properties appear.",
                        "Differentiation medium: A synthetic set of culture conditions with the nutrients necessary to support the growth or survival of microorganisms or culture cells, and which allows the differentiation of cells, such as mesenchymal stem cells.",
                        "Donor polynucleotide: A polynucleotide that is capable of specifically inserting into a genomic locus.",
                        "Downstream: A relative position on a polynucleotide, wherein the “downstream” position is closer to the 3′ end of the polynucleotide than the reference point. In the instance of a double-stranded polynucleotide, the orientation of 5′ and 3′ ends are based on the sense strand, as opposed to the antisense strand.",
                        "Embryonic Stem (ES) Cells: Pluripotent cells isolated from the inner cell mass of the developing blastocyst, or the progeny of these cells. “ES cells” can be derived from any organism. ES cells can be derived from mammals, including mice, rats, rabbits, guinea pigs, goats, pigs, cows, monkeys and humans. In specific, non-limiting examples, the cells are human or murine. Without being bound by theory, ES cells can generate a variety of the cells present in the body (bone, muscle, brain cells, etc.), provided they are exposed to conditions conducive to developing these cell types. Methods for producing murine ES cells can be found in U.S. Pat. No. 5,670,372, which is herein incorporated by reference. Methods for producing human ES cells can be found in U.S. Pat. No. 6,090,622, WO 00/70021 and WO 00/27995, which are herein incorporated by reference.",
                        "Effective amount or Therapeutically effective amount: The amount of agent, such a cell, for example MSCs, that is sufficient to prevent, treat, reduce and/or ameliorate the symptoms and/or underlying causes of any disorder or disease, or the amount of an agent sufficient to produce a desired effect on a cell. In one embodiment, a “therapeutically effective amount” is an amount sufficient to reduce or eliminate a symptom of a disease. In another embodiment, a therapeutically effective amount is an amount sufficient to overcome the disease itself.",
                        "Exogenous: Not normally present in a cell, but can be introduced by genetic, biochemical or other methods.",
                        "Exogenous nucleic acids include DNA and RNA, which can be single or double-stranded; linear, branched or circular; and can be of any length. By contrast, an “endogenous” molecule is one that is normally present in a particular cell at a particular developmental stage under particular environmental conditions.",
                        "Expand: A process by which the number or amount of cells in a culture is increased due to cell division.",
                        "Similarly, the terms “expansion” or “expanded” refers to this process. The terms “proliferate,” “proliferation” or “proliferated” may be used interchangeably with the words “expand,” “expansion” or “expanded.” Typically, during an expansion phase, the cells do not differentiate to form mature cells.",
                        "Expansion medium: A synthetic set of culture conditions suitable for the expansion of cells, such as mesenchymal stem cells. Tissue culture media generally include a carbon source, a nitrogen source and a buffer to maintain pH. In one embodiment, a medium contains a minimal essential media, such as DMEM, supplemented with various nutrients to enhance mesenchymal stem cell growth.",
                        "Additionally, the minimal essential media may be supplemented with additives such as horse, calf or fetal bovine serum.",
                        "FokI nuclease: A nonspecific DNA nuclease that occurs naturally in Flavobacterium okeanokoites. The term includes fragments of the FokI nuclease protein that retain nuclease activity that are, or may be, fused to a DNA-binding polypeptide.",
                        "Genomic insertion site: A site of the genome that is targeted for, or has undergone, insertion of an exogenous polynucleotide.",
                        "Growth factor: A substance that promotes cell growth, survival, and/or differentiation. Growth factors include molecules that function as growth stimulators (mitogens), molecules that function as growth inhibitors (e.g. negative growth factors) factors that stimulate cell migration, factors that function as chemotactic agents or inhibit cell migration or invasion of tumor cells, factors that modulate differentiated functions of cells, factors involved in apoptosis, or factors that promote survival of cells without influencing growth and differentiation. Examples of growth factors are bFGF, epidermal growth factor (EGF), CNTF, HGF, nerve growth factor (NGF), and actvin-A.",
                        "Heterologous: A heterologous sequence is a sequence that is not normally (i.e. in the wild-type sequence) found adjacent to a second sequence. In one embodiment, the sequence is from a different genetic source, such as a virus or organism, than the second sequence.",
                        "Induced pluripotent stem cell” (“iPS” cell or “iPSC”): A pluripotent stem cell artificially derived from a non-pluripotent cell, typically an adult somatic cell, by recombinant expression of specific factors in the non-pluripotent cell. Factors that may be used to for iPSCs include, but are not limited to, one or more of Oct-3/4, certain members of the Sox gene family (Sox1, Sox2, Sox3, and Sox15, Klf family members (Kif1, Klf2, Klf4, and Klf5), factors of the Myc family (c-myc, L-myc, and N-myc), Nanog, and LIN28, as defined by current knowledge in the art. Other factors or methods useful for creating iPSCs are also known in the art and are considered to produce cells that fall within the scope of this definition.",
                        "Isolated: An “isolated” biological component (such as a nucleic acid, peptide or cell) has been substantially separated, produced apart from, or purified away from other biological components or cells of the organism in which the component naturally occurs, i.e., other chromosomal and extrachromosomal DNA and RNA, cells and proteins. Nucleic acids, peptides and proteins which have been “isolated” thus include nucleic acids and proteins purified by standard purification methods. The term also embraces nucleic acids, peptides and proteins prepared by recombinant expression in a host cell as well as chemically synthesized nucleic acids.",
                        "Lineage-specific: Characteristics of a cell that indicate the cell will become one of a limited number of related cell types or a particular cell type, such as a differentiated cell or a cell undergoing the process of differentiation into a specific cell type or a mature cell type.",
                        "Mesenchymal Stem Cell (MSC): Also referred to as multipotent stromal cells and meant to be inclusive not only of MSCs but also of cells with replicative potential similar thereto that can differentiate into a variety of cell types. Additional examples of cells meant to be encompassed herein by the terms MSC and/or mesenchymal stem cells include, but are not limited to, mesenchymal precursor cells or MPCs, mesenchymal progenitor cells such as described by Mesoblast, Ltd., and other adult-derived stem cells such as MULTISTEM (Athersys, Inc.). While these multipotent stem cells are traditionally found in the bone marrow, they can also be isolated from other tissues including, but not limited to, cord blood, peripheral blood, fallopian tube, fetal liver and lung, placenta and fat. MSCs and other adult stem cells which can be used in accordance with the present invention, differentiate to form cells and/or tissues including, but not limited, adipocytes, cartilage, bone, tendons, muscle, and skin as well as myocytes, neurons and glia.",
                        "Modulate: A change in the content of genomic DNA gene.",
                        "Modulation can include, but is not limited to, gene activation, gene repression, gene deletion, polynucleotide insertion, and polynucleotide excision.",
                        "Neural cell: A cell that exhibits a morphology, a function, and a phenotypic characteristic similar to that of glial cells and neurons derived from the central nervous system and/or the peripheral nervous system.",
                        "There are several types of neurons (neuronal cells). Cholinergic neurons manufacture acetylcholine. GABAergic neurons manufacture gamma aminobutyric acid (GABA). Glutamatergic neurons manufacture glutamate. Dopaminergic neurons manufacture dopamine. Serotonergic neurons manufacture serotonin.",
                        "Neuronal stem cell or neural stem cell (NSC): Undifferentiated, multipotent, self-renewing neural cell. A NSC is a multipotent stem cell which is able to divide and, under appropriate conditions, has self-renewal capability and can terminally differentiate into neurons, astrocytes, and oligodendrocytes. Hence, the neural stem cell is “multipotent” because stem cell progeny have multiple differentiation pathways. A NSC is capable of self maintenance, meaning that with each cell division, at least one daughter cell will also be, on average, a stem cell. Neural stem cells can be derived from tissues including, but not limited to brain and spinal cord. A “long term” NSC divides in culture for at least 15 cell divisions, such as at least 15, 20, 25, 30, 35, 40, 45 or 50 cell divisions. A long term retains the properties of a neuronal stem cell, such as expression of nestin and sox1, and has the capacity to differentiate into neurons and glia in appropriate culture conditions in vitro.",
                        "NSCs can be obtained from a cadaver or living subject, including from fetal tissue and adult brain biopsies. NSCs can be produced from other stem cells, such as induced pluripotent stem cells or embryonic stem cells. NSCs can be autologous or heterologous to a recipient.",
                        "Neurological disorder: A disorder in the nervous system, including the central nervous system (CNS) and peripheral nervous system (PNS). Examples of neurological disorders include Parkinson's disease, Huntington's disease, Alzheimer's disease, severe seizure disorders including epilepsy, familial dysautonomia as well as injury or trauma to the nervous system, such as neurotoxic injury or disorders of mood and behavior such as addiction, schizophrenia and amyotrophic lateral sclerosis. Neuronal disorders also include Lewy body dementia, multiple sclerosis, epilepsy, cerebellar ataxia, progressive supranuclear palsy, amyotrophic lateral sclerosis, affective disorders, anxiety disorders, obsessive compulsive disorders, personality disorders, attention deficit disorder, attention deficit hyperactivity disorder, Tourette Syndrome, Tay Sachs, Nieman Pick, and other lipid storage and genetic brain diseases and/or schizophrenia",
                        "Neurodegenerative disorder: An abnormality in the nervous system of a subject, such as a mammal, in which neuronal integrity is threatened. Without being bound by theory, neuronal integrity can be threatened when neuronal cells display decreased survival or when the neurons can no longer propagate a signal. Specific, non-limiting examples of a neurodegenerative disorder are Alzheimer's disease, Pantothenate kinase associated neurodegeneration, Parkinson's disease, Huntington's disease (Dexter et al., Brain 114:1953-1975, 1991), HIV encephalopathy (Miszkziel et al., Magnetic Res. Imag. 15:1113-1119, 1997), and amyotrophic lateral sclerosis.",
                        "Alzheimer's disease manifests itself as pre-senile dementia. The disease is characterized by confusion, memory failure, disorientation, restlessness, speech disturbances, and hallucination in mammals (Medical, Nursing, and Allied Health Dictionary, 4th Ed., 1994, Editors: Anderson, Anderson, Glanze, St. Louis, Mosby).",
                        "Parkinson's disease is a slowly progressive, degenerative, neurologic disorder characterized by resting tremor, loss of postural reflexes, and muscle rigidity and weakness (Medical, Nursing, and Allied Health Dictionary, 4th Ed., 1994, Editors: Anderson, Anderson, Glanze, St. Louis, Mosby).",
                        "Amyotrophic lateral sclerosis is a degenerative disease of the motor neurons characterized by weakness and atrophy of the muscles of the hands, forearms and legs, spreading to involve most of the body and face (Medical, Nursing, and Allied Health Dictionary, 4th Ed., 1994, Editors: Anderson, Anderson, Glanze, St. Louis, Mosby).",
                        "Pantothenate kinase associated neurodegeneration (PKAN, also known as Hallervorden-Spatz syndrome) is an autosomal recessive neurodegenerative disorder associated with brain iron accumulation. Clinical features include extrapyramidal dysfunction, onset in childhood, and a relentlessly progressive course (Dooling et al., Arch. Neurol. 30:70-83, 1974). PKAN is a clinically heterogeneous group of disorders that includes classical disease with onset in the first two decades, dystonia, high globus pallidus iron with a characteristic radiographic appearance (Angelini et al., J. Neurol. 239:417-425, 1992), and often either pigmentary retinopathy or optic atrophy (Dooling et al., Arch. Neurol. 30:70-83, 1974; Swaiman et al., Arch. Neurol 48:1285-1293, 1991).",
                        "A “neurodegenerative-related disorder” is a disorder such as speech disorders that are associated with a neurodegenerative disorder. Specific non-limiting examples of a neurodegenerative related disorders include, but are not limited to, palilalia, tachylalia, echolalia, gait disturbance, perseverative movements, bradykinesia, spasticity, rigidity, retinopathy, optic atrophy, dysarthria, and dementia.",
                        "Nucleofection: Electroporation. Nucleofection uses a combination of electrical parameters, generated by a device called Nucleofector, with cell-type specific reagents. The substrate is transferred directly into the cell nucleus and the cytoplasm.",
                        "Pharmaceutically acceptable carriers: The pharmaceutically acceptable carriers useful in this invention are conventional. Remington's Pharmaceutical Sciences, by E. W. Martin, Mack Publishing Co., Easton, Pa., 15th Edition (1975), describes compositions and formulations suitable for pharmaceutical delivery of the fusion proteins herein disclosed.",
                        "In general, the nature of the carrier will depend on the particular mode of administration being employed. For instance, parenteral formulations usually comprise injectable fluids that include pharmaceutically and physiologically acceptable fluids such as water, physiological saline, balanced salt solutions, aqueous dextrose, glycerol or the like as a vehicle. For solid compositions (e.g., powder, pill, tablet, or capsule forms), conventional non-toxic solid carriers can include, for example, pharmaceutical grades of mannitol, lactose, starch or magnesium stearate. In addition to biologically-neutral carriers, pharmaceutical compositions to be administered can contain minor amounts of non-toxic auxiliary substances, such as wetting or emulsifying agents, preservatives, and pH buffering agents and the like, for example sodium acetate or sorbitan monolaurate.",
                        "Pharmaceutical agent or “drug”: A chemical compound or composition capable of inducing a desired therapeutic or prophylactic effect when properly administered to a subject or a cell. “Incubating” includes a sufficient amount of time for a drug to interact with a cell. “Contacting” includes incubating a drug in solid or in liquid form with a cell.",
                        "Polynucleotide: A nucleic acid sequence (such as a linear sequence) of any length. Therefore, a polynucleotide includes oligonucleotides, and also gene sequences found in chromosomes. An “oligonucleotide” is a plurality of joined nucleotides joined by native phosphodiester bonds. An oligonucleotide is a polynucleotide of between 6 and 300 nucleotides in length. An oligonucleotide analog refers to moieties that function similarly to oligonucleotides but have non-naturally occurring portions. For example, oligonucleotide analogs can contain non-naturally occurring portions, such as altered sugar moieties or inter-sugar linkages, such as a phosphorothioate oligodeoxynucleotide. Functional analogs of naturally occurring polynucleotides can bind to RNA or DNA, and include peptide nucleic acid (PNA) molecules.",
                        "Polypeptide: Three or more covalently attached amino acids. The term encompasses proteins, protein fragments, and protein domains. A “DNA-binding” polypeptide is a polypeptide with the ability to specifically bind DNA.",
                        "The term “polypeptide” is specifically intended to cover naturally occurring proteins, as well as those which are recombinantly or synthetically produced. The term “functional fragments of a polypeptide” refers to all fragments of a polypeptide that retain an activity of the polypeptide. Biologically functional fragments, for example, can vary in size from a polypeptide fragment as small as an epitope capable of binding an antibody molecule to a large polypeptide capable of participating in the characteristic induction or programming of phenotypic changes within a cell. An “epitope” is a region of a polypeptide capable of binding an immunoglobulin generated in response to contact with an antigen. Thus, smaller peptides containing the biological activity of insulin, or conservative variants of the insulin, are thus included as being of use.",
                        "The term “substantially purified polypeptide” as used herein refers to a polypeptide which is substantially free of other proteins, lipids, carbohydrates or other materials with which it is naturally associated. In one embodiment, the polypeptide is at least 50%, for example at least 80% free of other proteins, lipids, carbohydrates or other materials with which it is naturally associated. In another embodiment, the polypeptide is at least 90% free of other proteins, lipids, carbohydrates or other materials with which it is naturally associated. In yet another embodiment, the polypeptide is at least 95% free of other proteins, lipids, carbohydrates or other materials with which it is naturally associated.",
                        "Conservative substitutions replace one amino acid with another amino acid that is similar in size, hydrophobicity, etc. Examples of conservative substitutions are shown below.",
                        "Variations in the cDNA sequence that result in amino acid changes, whether conservative or not, should be minimized in order to preserve the functional and immunologic identity of the encoded protein. The immunologic identity of the protein may be assessed by determining whether it is recognized by an antibody; a variant that is recognized by such an antibody is immunologically conserved. Any cDNA sequence variant will preferably introduce no more than twenty, and preferably fewer than ten amino acid substitutions into the encoded polypeptide. Variant amino acid sequences may, for example, be 80%, 90% or even 95% or 98% identical to the native amino acid sequence.",
                        "Promoter: A promoter is an array of nucleic acid control sequences which direct transcription of a nucleic acid. A promoter includes necessary nucleic acid sequences near the start site of transcription, such as, in the case of a polymerase II type promoter, a TATA element. A promoter also optionally includes distal enhancer or repressor elements which can be located as much as several thousand base pairs from the start site of transcription.",
                        "Recombinant: A recombinant nucleic acid is one that has a sequence that is not naturally occurring or has a sequence that is made by an artificial combination of two otherwise separated segments of sequence. This artificial combination is often accomplished by chemical synthesis or, more commonly, by the artificial manipulation of isolated segments of nucleic acids, e.g., by genetic engineering techniques. Similarly, a recombinant protein is one coded for by a recombinant nucleic acid molecule.",
                        "Recombination: A process of exchange of genetic information between two polynucleotides. “Homologous recombination (HR)” refers to the specialized form of an exchange that takes place, for example, during repair of double-strand breaks in cells. Nucleotide sequence homology is utilized in recombination, for example using a “donor” molecule to template repair of a “target” molecule (i.e., the one that experienced the double-strand break), and is variously known as “non-crossover gene conversion” or “short tract gene conversion,” because it leads to the transfer of genetic information from the donor to the target.",
                        "Safe harbor: A locus in the genome where a polynucleotide may be inserted without causing deleterious effects to the host cell. Examples of safe harbor loci known to exist within mammalian cells may be found within the AAVS1 gene, the CYBL gene, and the CCR5 gene.",
                        "Selectable marker: A gene introduced into a cell, such mammalian cells in culture, for example a MSC, that confers a trait suitable for artificial selection from cells that do not possess the gene.",
                        "Sequence identity: The similarity between amino acid sequences is expressed in terms of the similarity between the sequences, otherwise referred to as sequence identity. Sequence identity is frequently measured in terms of percentage identity (or similarity or homology); the higher the percentage, the more similar the two sequences are. Homologs or variants of a FGF polypeptide will possess a relatively high degree of sequence identity when aligned using standard methods.",
                        "Methods of alignment of sequences for comparison are well known in the art. Various programs and alignment algorithms are described in Smith and Waterman, Adv. Appl. Math. 2:482, 1981; Needleman and Wunsch, J. Mol. Biol. 48:443, 1970; Pearson and Lipman, Proc. Natl. Acad. Sci. USA 85:2444, 1988; Higgins and Sharp, Gene 73:237, 1988; Higgins and Sharp, CABIOS 5:151, 1989; Corpet et al., Nucleic Acids Research 16:10881, 1988; and Pearson and Lipman, Proc. Natl. Acad. Sci. USA 85:2444, 1988. Altschul, et al., Nature Genet., 6:119, 1994 presents a detailed consideration of sequence alignment methods and homology calculations.",
                        "The NCBI Basic Local Alignment Search Tool (BLAST) (Altschul, et al., J. Mol. Biol. 215:403, 1990) is available from several sources, including the National Center for Biotechnology Information (NCBI, Bethesda, Md.) and on the internet, for use in connection with the sequence analysis programs blastp, blastn, blastx, tblastn and tblastx. A description of how to determine sequence identity using this program is available on the NCBI website on the internet.",
                        "Homologs and variants of a FGF polypeptide are typically characterized by possession of at least about 75%, for example at least about 80%, sequence identity counted over the full length alignment with the amino acid sequence of the factor using the NCBI Blast 2.0, gapped blastp set to default parameters. For comparisons of amino acid sequences of greater than about 30 amino acids, the Blast 2 sequences function is employed using the default BLOSUM62 matrix set to default parameters, (gap existence cost of 11, and a per residue gap cost of 1). When aligning short peptides (fewer than around 30 amino acids), the alignment should be performed using the Blast 2 sequences function, employing the PAM30 matrix set to default parameters (open gap 9, extension gap 1 penalties). Proteins with even greater similarity to the reference sequences will show increasing percentage identities when assessed by this method, such as at least 80%, at least 85%, at least 90%, at least 95%, at least 98%, or at least 99% sequence identity. When less than the entire sequence is being compared for sequence identity, homologs and variants will typically possess at least 80% sequence identity over short windows of 10-20 amino acids, and may possess sequence identities of at least 85% or at least 90% or 95% depending on their similarity to the reference sequence. Methods for determining sequence identity over such short windows are available at the NCBI website on the internet. One of skill in the art will appreciate that these sequence identity ranges are provided for guidance only; it is entirely possible that strongly significant homologs could be obtained that fall outside of the ranges provided.",
                        "Specific binding: A sequence-specific, non-covalent interaction between macromolecules (e.g., between a polypeptide and a polynucleotide). Not all components of a binding interaction need be sequence-specific (e.g., contacts with phosphate residues in a DNA backbone), as long as the interaction as a whole is sequence-specific. The term should not be construed to indicate that a macromolecule described as participating in specific binding, or as being specific for another given macromolecule, cannot bind to another macromolecule, but rather that the specific nature of the interaction is significantly favored over a nonspecific or random binding. Such “specific binding” interactions are generally characterized by a dissociation constant (Kd) of 10−6 M−1 or lower.",
                        "Subject: Human and non-human animals, including all vertebrates, such as mammals and non-mammals, such as non-human primates, mice, rabbits, sheep, dogs, cats, horses, cows, chickens, amphibians, and reptiles. In many embodiments of the described methods, the subject is a human.",
                        "Synapse: Highly specialized intercellular junctions between neurons and between neurons and effector cells across which a nerve impulse is conducted (synaptically active). Generally, the nerve impulse is conducted by the release from one neuron (presynaptic neuron) of a chemical transmitter (such as dopamine or serotonin) which diffuses across the narrow intercellular space to the other neuron or effector cell (post-synaptic neuron). Generally neurotransmitters mediate their effects by interacting with specific receptors incorporated in the post-synaptic cell. “Synaptically active” refers to cells (e.g., differentiated neurons) which receive and transmit action potentials characteristic of mature neurons.",
                        "Transduced, Transformed and Transfected: A virus or vector “transduces” a cell when it transfers nucleic acid into the cell. A cell is “transformed” or “transfected” by a nucleic acid transduced into the cell when the DNA becomes stably replicated by the cell, either by incorporation of the nucleic acid into the cellular genome, or by episomal replication.",
                        "Numerous methods of transfection are known to those skilled in the art, such as: chemical methods (e.g., calcium-phosphate transfection), physical methods (e.g., electroporation, microinjection, particle bombardment), fusion (e.g., liposomes), receptor-mediated endocytosis (e.g., DNA-protein complexes, viral envelope/capsid-DNA complexes) and by biological infection by viruses such as recombinant viruses (Wolff, J. A., ed, Gene Therapeutics, Birkhauser, Boston, USA, 1994). In the case of infection by retroviruses, the infecting retrovirus particles are absorbed by the target cells, resulting in reverse transcription of the retroviral RNA genome and integration of the resulting provirus into the cellular DNA. Methods for the introduction of genes into cells are known (e.g. see U.S. Pat. No. 6,110,743, herein incorporated by reference). These methods can be used to transduce a MSC or a cell produced by the methods described herein.",
                        "Genetic modification of the target cell is an indicium of successful transfection. “Genetically modified cells” refers to cells whose genotypes have been altered as a result of cellular uptakes of exogenous nucleotide sequence by transfection. A reference to a transfected cell or a genetically modified cell includes both the particular cell into which a vector or polynucleotide is introduced and progeny of that cell.",
                        "Transgene: An exogenous gene.",
                        "Treating, Treatment, and Therapy: Any success or indicia of success in the attenuation or amelioration of an injury, pathology or condition, including any objective or subjective parameter such as abatement, remission, diminishing of symptoms or making the condition more tolerable to the patient, slowing in the rate of degeneration or decline, making the final point of degeneration less debilitating, improving a subject's physical or mental well-being, or prolonging the length of survival. The treatment may be assessed by objective or subjective parameters; including the results of a physical examination, neurological examination, or psychiatric evaluations.",
                        "Upstream: A relative position on a polynucleotide, wherein the “upstream” position is closer to the 5′ end of the polynucleotide than the reference point. In the instance of a double-stranded polynucleotide, the orientation of 5′ and 3′ ends are based on the sense strand, as opposed to the antisense strand.",
                        "Vector: A nucleic acid molecule as introduced into a host cell, thereby producing a transformed host cell. A vector may include nucleic acid sequences that permit it to replicate in the host cell, such as an origin of replication. A vector may also include one or more therapeutic genes and/or selectable marker genes and other genetic elements known in the art. A vector can transduce, transform or infect a cell, thereby causing the cell to express nucleic acids and/or proteins other than those native to the cell. A vector optionally includes materials to aid in achieving entry of the nucleic acid into the cell, such as a viral particle, liposome, protein coating or the like.",
                        "Zinc finger DNA binding domain: A polypeptide domain that binds DNA in a sequence-specific manner through one or more zinc fingers, which are regions of amino acid sequence within the binding domain whose structure is stabilized through coordination of a zinc ion.",
                        "Zinc finger binding domains, for example the recognition helix of a zinc finger, can be “engineered” to bind to a predetermined nucleotide sequence. Rational criteria for design of zinc finger binding domains include application of substitution rules and computerized algorithms for processing information in a database storing information of existing ZFP designs and binding data, see for example U.S. Pat. No. 5,789,538; U.S. Pat. No. 5,925,523; U.S. Pat. No. 6,007,988; U.S. Pat. No. 6,013,453; U.S. Pat. No. 6,140,081; U.S. Pat. No. 6,200,759; U.S. Pat. No. 6,453,242; and U.S. Pat. No. 6,534,261; and PCT Publication Nos. WO 95/19431; WO 96/06166; WO 98/53057; WO 98/53058; WO 98/53059; WO 98/53060; WO 98/54311; WO 00/27878; WO 01/60970; WO 01/88197; WO 02/016536; WO 02/099084 and WO 03/016496.",
                        "The term “about” as used herein when referring to a measurable value such as an amount, a temporal duration, and the like, is meant to encompass variations of up to ±10% from the specified value. Unless otherwise indicated, all numbers expressing quantities of ingredients, properties such as molecular weight, reaction conditions, and so forth used in the specification and claims are to be understood as being modified in all instances by the term “about.” Accordingly, unless indicated to the contrary, the numerical parameters set forth in the following specification and attached claims are approximations that may vary depending upon the desired properties sought to be obtained by the disclosed subject matter. At the very least, and not as an attempt to limit the application of the doctrine of equivalents to the scope of the claims, each numerical parameter should at least be construed in light of the number of reported significant digits and by applying ordinary rounding techniques.",
                        "Notwithstanding that the numerical ranges and parameters setting forth the broad scope of the invention are approximations, the numerical values set forth in the specific examples are reported as precisely as possible. Any numerical value, however, inherently contain certain errors necessarily resulting from the standard deviation found in their respective testing measurements.",
                        "Unless otherwise explained, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this disclosure belongs. The singular terms “a,” “an,” and “the” include plural referents unless context clearly indicates otherwise. Similarly, “A or B” is intended to include “A,” “B,” and “both A and B,” unless the context clearly indicates otherwise. It is further to be understood that all base sizes or amino acid sizes, and all molecular weight or molecular mass values, given for nucleic acids or polypeptides are approximate, and are provided for description. Although methods and materials similar or equivalent to those described herein can be used in the practice or testing of this disclosure, suitable methods and materials are described below. The term “comprises” means “includes.” All publications, patent applications, patents, and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the present specification, including explanations of terms, will control. In addition, the materials, methods, and examples are illustrative only and not intended to be limiting."
                    ],
                    "subsections": [
                        {
                            "title": "Methods and Compositions for Rapid Generation of Single and Multiplexed Reporters in Cells",
                            "paragraphs": [
                                "An important feature of iPSCs is that they can be engineered in multiple ways to be used for screenings, for developing therapeutic purposes, or for investigating disease mechanisms or processes. For instance, iPSCs can be engineered to create ubiquitous reporters to develop enhanced assays, lineage-specific reporters to allow for stage-specific screening, or pathway and organelle reporters to allow for focused screening.",
                                "Disclosed herein are compositions and methods for rapid generation of single and multiplexed reporters in various iPSC cell lines as well as other progenitor cells including other pluripotent and multipotent stem cells and differentiated cells.",
                                "Efficient Targeting of Chr. 19 and Chr. 13 Safe Harbor Loci in Multiple Lines with Multiple Constructs",
                                "High efficiency TALEN and ZFN were designed which target two safe harbor sites on chromosome 13 and 19 in an iPSC line.",
                                "Recombinant polynucleotide-binding polypeptides for use in targeting these chromosomes can occur in a variety of forms. In some embodiments, the recombinant polynucleotide-binding polypeptide is a recombinant DNA-binding polypeptide that specifically binds to a genomic target sequence in the cell. In one embodiment the targeted genomic sequence bound by the recombinant DNA-binding polypeptide falls within the sequence of SEQ ID NO: 19, or its corresponding antisense sequence. In another embodiment the targeted sequence bound by the recombinant DNA-binding polypeptide in the genome of the cell includes the sequence of SEQ ID NO: 1. In yet another embodiment, the targeted sequence bound by the recombinant DNA-binding polypeptide is the sequence of SEQ ID NO: 1. Alternatively, the targeted sequence bound by the recombinant DNA-binding polypeptide may include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In one embodiment, the targeted sequence bound by the recombinant DNA-binding polypeptide is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In another embodiment the targeted sequence bound by the recombinant DNA-binding polypeptide includes the sequence of SEQ ID NO: 3. In a further embodiment, the targeted sequence bound by the recombinant DNA-binding polypeptide is the sequence of SEQ ID NO: 3. Alternatively, the targeted sequence bound by the recombinant DNA-binding polypeptide can include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3. In one embodiment, the targeted sequence bound by the recombinant DNA-binding polypeptide is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3.",
                                "In some embodiments the described recombinant DNA-binding polypeptide includes a zinc-finger domain or a transcription activator-like effector (TALE) domain, or a polypeptide fragment thereof that retains the DNA binding function of the TALE domain or the zinc-finger domain. Furthermore, the recombinant DNA-binding polypeptide may also be combined with a polypeptide having nuclease activity, such as a zinc-finger domain or a transcription activator-like effector (TALE) domain fused to a nuclease protein, or a fragment thereof. Exemplary nucleases include, but are not limited to, S1 nuclease, mung bean nuclease, pancreatic DNAase I, micrococcal nuclease, and yeast HO endonuclease (see also Linn et al. (eds.) Nucleases, Cold Spring Harbor Laboratory Press, 1993).",
                                "Restriction endonucleases (restriction enzymes) are present in many species and are capable of sequence-specific binding to DNA (at a recognition site), and cleaving DNA at or near the site of binding. Certain restriction enzymes (e.g., Type IIS) cleave DNA at sites removed from the recognition site and have separable binding and cleavage domains. For example, the Type IIS enzyme Fok I catalyzes double-stranded cleavage of DNA, at nine nucleotides from its recognition site on one strand and 13 nucleotides from its recognition site on the other (see, for example, U.S. Pat. Nos. 5,356,802; 5,436,150 and 5,487,994; Li et al. (1992) Proc. Natl. Acad. Sci. USA 89:4275-4279; Li et al. (1993) Proc. Natl. Acad. Sci. USA 90:2764-2768; Kim et al. (1994a) Proc. Natl. Acad. Sci. USA 91:883-887; Kim et al. (1994b) J. Biol. Chem. 269:31, 978-31, 982). Thus, in one embodiment, a nuclease domain from at least one Type IIS restriction enzyme is utilized. An exemplary Type IIS restriction enzyme, whose cleavage domain is separable from the binding domain, is FokI. This particular enzyme is active as a dimer. See Bitinaite et al. (1998) Proc. Natl. Acad. Sci. USA 95: 10,570-10,575. Additional forms of FokI nuclease are set forth in U.S. Published Patent Application No. 20110027235, which is incorporated herein by reference.",
                                "In some embodiments the polypeptide having nuclease activity that is fused with the recombinant DNA-binding polypeptide is the FokI nuclease, or a derivative or fragment thereof that retains the nuclease activity. In some embodiments, the FokI nuclease is at least about 80%, at least about 85%, at least about 90%, at least about 95%, at least about 96%, at least about 97%, at least about 98%, at least about 99%, or about 100% identical to SEQ ID NO: 13.",
                                "In the case of a recombinant DNA-binding polypeptide produced from a TALE domain, fusion with a polypeptide having nuclease activity forms a transcription activator-like effector nuclease (TALEN). Some of the TALEN embodiments described herein are designed to specifically target a genomic sequence that falls within the sequence of SEQ ID NO: 19, or its corresponding antisense sequence, such as, for example, the sequence of SEQ ID NO: 1 or 3. In one embodiment the targeted sequence bound by a described TALE domain includes the sequence of SEQ ID NO: 1. In one embodiment, the targeted sequence bound by a described TALE domain is the sequence of SEQ ID NO: 1. Alternatively, the targeted sequence bound by a described TALE domain may include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In one embodiment, the targeted sequence bound by a described TALE domain is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In another embodiment the targeted sequence bound by a described TALE domain includes the sequence of SEQ ID NO: 3. In one embodiment, the targeted sequence bound by a described TALE domain is the sequence of SEQ ID NO: 3. Alternatively, the targeted sequence bound by a described TALE domain may include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3. In one embodiment, the targeted sequence bound by a described TALE domain is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3.",
                                "The TALE domains of use in the methods disclosed herein can be linked to a polypeptide having nuclease activity to form a TALEN, which can be used to cleave DNA at a specific location of interest. In one embodiment the targeted sequence bound by a described TALEN includes the sequence of SEQ ID NO: 1. In one embodiment, the targeted sequence bound by a described TALEN is the sequence of SEQ ID NO: 1. Alternatively, the targeted sequence bound by a described TALEN may include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In one embodiment, the targeted sequence bound by a described TALEN is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 1. In another embodiment the targeted sequence bound by a described TALEN includes the sequence of SEQ ID NO: 3. In one embodiment, the targeted sequence bound by a described TALEN is the sequence of SEQ ID NO: 3. Alternatively, the targeted sequence bound by a described TALEN may include a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3. In one embodiment, the targeted sequence bound by a described TALEN is a sequence that is antisense, or complementary, to the sequence of SEQ ID NO: 3.",
                                "For the methods disclosed herein, the recombinant DNA-binding polypeptide may also be combined with a polypeptide having nuclease activity, such as a zinc-finger domain or a transcription activator-like effector (TALE) domain fused to a nuclease protein, or a fragment thereof. In some embodiments the polypeptide having nuclease activity that is fused with the recombinant DNA-binding polypeptide is the fokI nuclease, or a derivative or fragment thereof that retains the nuclease activity. In the case of a recombinant DNA-binding polypeptide produced from a TALE domain, fusion with a polypeptide having nuclease activity forms a transcription activator-like effector nuclease (TALEN).",
                                "Some of the TALEN embodiments of use in the disclosed methods are designed to specifically target a genomic sequence that falls within the sequence of SEQ ID NO: 19, or its corresponding antisense sequence, such as, for example, the sequence of SEQ ID NO: 1 or 3. In one embodiment the TALE domain includes the amino acid sequence of SEQ ID NO: 7. In another embodiment the TALE domain includes an amino acid sequence of SEQ ID NO: 10. In further embodiments a TALE domain is fused to a polypeptide having nuclease activity to form a TALEN. One TALEN of use in the methods disclosed herein is a TALE domain that includes the amino acid sequence of SEQ ID NO: 7 incorporated into a polypeptide having nuclease activity. In one such embodiment, the amino acid sequence of SEQ ID NO: 7 is incorporated into a polypeptide that also includes a fokI nuclease, or a fragment thereof. For example, the amino acid sequence of SEQ ID NO: 7 may be incorporated into a polypeptide that also includes the amino acid sequence of SEQ ID NO: 13. One embodiment of a polypeptide where the amino acid sequence of SEQ ID NO: 7 is incorporated with the amino acid sequence of SEQ ID NO: 13, is the polypeptide of SEQ ID NO: 8. One TALEN of use in the methods disclosed herein is a TALE domain that includes the amino acid sequence of SEQ ID NO: 10 incorporated into a polypeptide having nuclease activity. In one such embodiment, the amino acid sequence of SEQ ID NO: 10 is incorporated into a polypeptide that also includes a fokI nuclease, or a fragment thereof that retains nuclease activity. For example, the amino acid sequence of SEQ ID NO: 10 may be incorporated into a polypeptide that also includes the amino acid sequence of SEQ ID NO: 13. One embodiment of a polypeptide where the amino acid sequence of SEQ ID NO: 10 is incorporated with the amino acid sequence of SEQ ID NO: 13, is the polypeptide of SEQ ID NO: 11.",
                                "The TALE constructs of use in the methods disclosed herein can be used to target specific DNA sequences, such as a genomic sequence of interest in an MSC. When coupled with a polypeptide having nuclease activity to form a TALEN, these constructs can be used to target a specific polynucleotide of interest for modification in the genome of the MSC. In one embodiment the described TALE domain includes the amino acid sequence of SEQ ID NO: 7 which can target the sequence of SEQ ID NO: 1 specifically. In another embodiment the TALE domain includes an amino acid sequence of SEQ ID NO: 10 which can target the sequence of SEQ ID NO: 3 specifically. In further embodiments a described TALE domain is fused to a polypeptide having nuclease activity to form a TALEN. One TALEN described herein is a TALE domain that includes the amino acid sequence of SEQ ID NO: 7 incorporated into a polypeptide having nuclease activity, which can target the sequence of SEQ ID NO: 1 specifically. In one such embodiment, the amino acid sequence of SEQ ID NO: 7 is incorporated into a polypeptide that also includes a fokI nuclease, or a fragment thereof that retains nuclease activity, and can target the sequence of SEQ ID NO: 1 specifically and mediate cleavage of a DNA sequence proximal to the segment where the polynucleotide is bound. For example, the amino acid sequence of SEQ ID NO: 7 may be incorporated into a polypeptide that also includes the amino acid sequence of SEQ ID NO: 13, for specific targeting of the sequence of SEQ ID NO: 1 and cleavage of the polynucleotide sequence proximal to the binding locus. One embodiment of a polypeptide where the amino acid sequence of SEQ ID NO: 7 is incorporated with the amino acid sequence of SEQ ID NO: 13, is the polypeptide of SEQ ID NO: 8, which can specifically bind the sequence of SEQ ID NO: 1 and cleave the polynucleotide sequence proximal to the binding locus.",
                                "Another TALEN of use in the methods disclosed herein is a TALE domain that includes the amino acid sequence of SEQ ID NO: 10 incorporated into a polypeptide having nuclease activity, which can target the sequence of SEQ ID NO: 3 specifically. In one such embodiment, the amino acid sequence of SEQ ID NO: 10 is incorporated into a polypeptide that also includes a fokI nuclease, or a fragment thereof that retains nuclease activity, and can target the sequence of SEQ ID NO: 3 specifically and mediate cleavage of a DNA sequence proximal to the segment where the polynucleotide is bound. For example, the amino acid sequence of SEQ ID NO: 10 may be incorporated into a polypeptide that also includes the amino acid sequence of SEQ ID NO: 13, for specific targeting of the sequence of SEQ ID NO: 3 and cleavage of the polynucleotide sequence proximal to the binding locus. One embodiment of a polypeptide where the amino acid sequence of SEQ ID NO: 10 is incorporated with the amino acid sequence of SEQ ID NO: 13, is the polypeptide of SEQ ID NO: 11, which can specifically bind the sequence of SEQ ID NO: 3 and cleave the polynucleotide sequence proximal to the binding locus.",
                                "Modifications can be made to the described subject matter resulting in substantially similar polypeptides and constructs that carry out essentially the same functions, in substantially the same way, as the described polynucleotide-binding polypeptides and related nuclease constructs. For example, zinc-finger-based constructs, or CRISPR technology, can be used to target the loci described herein to modify a genome of a cell or chromosomal DNA. Accordingly, such variations are considered to be within the scope of, the present disclosure.",
                                "Polynucleotides and vectors are also of use in the methods disclosed herein. The polynucleotides encode the polypeptides disclosed above. In some embodiments, the polynucleotides and vectors encode recombinant DNA-binding polypeptides, zinc-finger or TALE domains, nuclease proteins or polypeptides, fusion proteins produced from the fusion of DNA-binding polypeptides and nuclease proteins or polypeptides, such as TALENs. In some embodiments the expression of the polypeptides encoded by the vectors are controlled by an inducible promoter. Suitable promoters include, but are not limited to, the doubecourtin (DCX) promoter and glial fibrillary acidic protein (GFAP). In other embodiments the expression of the polypeptides encoded by the vectors are controlled by a repressible promoter. Cells of the present invention can be modified by the described vectors, for example transfected cells or cells having an expression product of the vectors.",
                                "The polypeptides described herein can be encoded by a variety of polynucleotides due to the degeneracy of the genetic code. Thus, the polynucleotides provided herein may be altered to encode the same corresponding amino acid sequences disclosed herein, as would be understood by those skilled in the art. Accordingly, the use of such varied polynucleotide sequences should be considered within the scope of the presently claimed methods. The amino acid sequence of SEQ ID NO: 7 may be encoded by a nucleotide having the sequence of SEQ ID NO: 2. The amino acid sequence of SEQ ID NO: 8 may be encoded by a nucleotide having the sequence of SEQ ID NO: 5. The amino acid sequence of SEQ ID NO: 10 may be encoded by a nucleotide having the sequence of SEQ ID NO: 4. The amino acid sequence of SEQ ID NO: 11 may be encoded by a nucleotide having the sequence of SEQ ID NO: 6. The amino acid sequence of SEQ ID NO: 13 may be encoded by a nucleotide having the sequence of SEQ ID NO: 14.",
                                "Furthermore, the vectors of use in the methods disclosed herein, that express the polynucleotides, or produce the polypeptides, may be substituted for other vectors having similar functional capabilities that would be understood by those skilled in the art having benefit of the present disclosure. In one embodiment, the polypeptide of SEQ ID NO: 8 may be produced by the polynucleotide of SEQ ID NO: 9. In another embodiment the polypeptide of SEQ ID NO: 11 may be encoded by the polynucleotide of SEQ ID NO: 12.",
                                "Provided herein are donor polynucleotides that may be inserted into the genome of the cell. In some embodiments the donor polynucleotides are double-stranded polynucleotides with sense and/or antisense strand polynucleotide overhangs that are at least partially complementary to corresponding polynucleotide overhangs of cleaved genomic DNA to facilitate insertion of the donor polynucleotide with the cleaved genomic DNA. In additional embodiments the donor polynucleotides are single-stranded polynucleotides with sense and/or antisense strand polynucleotide overhangs (portions) that are at least partially complementary to corresponding polynucleotide overhangs of cleaved genomic DNA to facilitate insertion of the donor polynucleotide with the cleaved genomic DNA. In some embodiments the donor polynucleotide may express a polypeptide once inserted into the genome of the cell or a cell differentiated therefrom. In some embodiments the expressed polypeptide can be a protein that can function to induce cell differentiation or maturation to proceed in a particular manner, such as toward a specific cell lineage. In some embodiments the expression of a polypeptide by the donor polynucleotide may be controlled by an inducible promoter, such as a promoter expressed in differentiated cells. In other embodiments, the expression of a polypeptide by the donor polynucleotide may be controlled by a repressible promoter. In still other embodiments the donor polynucleotide may encode more than one polypeptide, for example, the donor polynucleotide may include an expression cassette having a plurality of genes. In certain embodiments where the donor polynucleotide encodes more than one polypeptide, the donor polynucleotide may have inducible promoters to regulate the expression of certain genes and repressible promoters to regulate the expression of other genes.",
                                "As shown herein, these sites can be targeted in multiple iPSC lines to generate reporter systems while retaining pluripotent characteristics. These sites have previously been shown not to be silenced (Luo et al. Stem cells translational medicine 2014 3:821-835; Macarthur et al. Stem cells and development 2012 21:191-205). Different promoters were evaluated and the CMV early enhancer/chicken beta actin (CAG) promoter appeared the most stable and was used for subsequent experiments. Additionally, two different reporters were evaluated: Nanoluc (luciferase) for quantitation and sensitivity, and copGFP for its fluorescence intensity and stability. Both reporters worked efficiently and a subset of the data is shown in FIG. 1.",
                                "The constructs and the schemas of generating knock in (KI) iPSC lines at the two safe harbor sites with the exemplary reporter copGFP driven by the constitutively active CAG promoter are illustrated in FIG. 1A-B. A well-characterized integration-free iPSC line, XCL1, was used as the parental line for all gene-targeting work described herein unless specified otherwise. The Chr 19 site was first targeted and 37 colonies were analyzed for AAVS1-copGFP line by PCR after drug selection and single cell colony cloning. Of these colonies, 12 clones were targeted on one allele and 25 were targeted to both alleles. Similar targeting efficacy was observed for the Chr 13 site. A representative example of a monoallelic (heterozygote) and biallelic (homozygote) is shown in FIG. 1C-D (homozygotes for the AAVS1-copGFP line and heterozygotes for the Chr13-copGFP line). Further sequencing of the PCR products confirmed the successful integration of donor constructs into appropriate genome loci (FIGS. 1C and 1D).",
                                "The reporter lines engineered by each of the safe harbor integration strategies were then validated. Genomic stability of a representative line, the AAVS1-copGFP line was determined. When directly differentiated toward the neural lineage, the copGFP reporter in this KI line was not silenced as evidenced by continuous expression of GFP in nestin-positive neural stem cell (NSC) (FIG. 1E). No gene silencing was observed during random differentiation via embryoid body formation as cells of the three germ layers differentiated from the AAVS1-copGFP line remained GFP-positive.",
                                "To confirm that this safe harbor KI approach can be generalized, similar reporters were created in another well-characterized integration-free line, XCL5 (NCRM5). As an example, a Chr13-Nanoluc-halotag line was generated, similar to the Chr13-copGFP line in which a Nanoluc/HaloTag reporter was used instead of copGFP. This line was differentiated to a pure population of neurons or astrocytes via directed differentiation. Further, no gene silencing in these lineages was confirmed. Taken together, these experiments demonstrate targeting at the safe harbor loci to be both reliable and efficient. The cell lines obtained were stable, karyotypically normal and the reporters did not silence on random or directed differentiations. In addition, both sites could be targeted simultaneously, and both monoallelic and biallelic subclones could be identified.",
                                "Rapid Exchanging of Reporter Cassettes in Safe Harbors in iPSC and Progenitor Cells Using a Master Cell Line Strategy",
                                "While ZFN and TALEN increased targeting efficiency several-fold compared to the traditional gene targeting methods, their efficiency may not be high enough to target non-pluripotent cells. This may be important when the differentiation process is very long or genes have toxic effects at some stages. Accordingly, in the present invention, the safe harbor site targeting strategy was modified by utilizing constructs with multiple Lox sites, which allowed for easy replacement of one reporter or promoter with another by Cre-recombinase mediated cassette exchange (RMCE). An nonlimiting example of such a vector design is illustrated in FIG. 2A. In this construct, the CAG promoter driving the copGFP reporter cassette was inserted between lox2272 and lox511 sites with the appropriate orientation for RMCE. In addition, a puromycin resistant gene flanked by two different loxP sites was inserted at the endogenous promoter of AAVS1. Two insulator sites were also added in this line to prevent copGFP silencing. To generate new reporter lines, daughter constructs containing any gene-specific or ubiquitous promoter driving a reporter gene can be inserted between a lox2272 and a lox511 site, and drug selection and loss of the previous insert can be used to identify appropriate clones.",
                                "This strategy was tested by replacing GFP driven by the ubiquitous CAG promoter in the AAVS1-copGFP line with a promoter-reporter construct using the neuronal lineage-specific promoter doublecortin (DCX) driving TagGFP (see FIG. 2) or Nanoluc. In the DCX daughter construct, DCXp-TagGFP, a DCX promoter driving TagGFP together with a PGK promoter driving Neomycin resistant gene was cloned between lox2272 and lox511 sites (see FIG. 2A). In order to induce the RMCE, DCXp-TagGFP construct was co-transfected with a plasmid expressing Cre recombinase by the PGK promoter, into an established AAVS1-copGFP (a homozygote clone) iPSC line. After RCME, colonies that had lost green fluorescence were identified and picked for PCR verifications. Using primers designed specifically for targeting the “parental” and “swap” sequences, iPSC clones were identified where cassette exchange had been successful (see FIG. 2B). Before cassette exchange, the master iPSC line AAVS1-copGFP constitutively expresses green fluorescence and is puromycin resistant. In the presence of Cre recombinase and DCX daughter construct, the puromycin gene was deleted via Cre-loxP mediated recombination, and “CAGp-copGFP” was replaced by the “DCXp-TagGFP-PGKp-Neo” cassette. Thus, the new reporter line, referred to herein as DCXp-TagGFP, is not puromycin but neomycin resistant and is not fluorescent at the iPSC stage (see FIG. 2C).",
                                "To confirm functionally appropriate expression in the DCXp-TagGFP reporter line created by cassette exchange, a directed differentiation protocol was used to induce neuronal differentiation in accordance with procedures described by Yan et al. (Stem cells translational medicine 2013 2:862-870). As the cells differentiated toward the neuronal lineage, GFP-positive cells appeared (see FIG. 2D). ICC staining 6 days after differentiation confirmed that all green cells were specifically located with DCX antibody positive neurons (see FIG. 2D), validating the specificity of the DCXp-TagGFP reporter line.",
                                "To further confirm the utility of the master iPSC line strategy, it was determined whether the RMCE can be extended to intermediate/progenitor stage cells as well. For these experiments, NSC were derived from the AAVS1-copGFP iPSC line, which maintained strong green fluorescence through differentiation (see FIGS. 1E and 2E). Following the same RMCE procedures as described for the iPSC (see FIG. 2A), DCXp-TagGFP daughter construct and Cre-expressing plasmid were co-transfected into AAVS1-copGFP NSC. No drug selection was used to enrich cells with successful RMCE, since the goal for this experiment was not to isolate single clones of NSC with correct cassette exchange. Instead, the entire cell population was analyzed and cells losing green fluorescence post transfection were identified by fluorescence microscopy, indicating the successful event of RMCE (see FIG. 2E). Junction PCR was used to confirm that cassette exchange was indeed correctly induced in a subset of the NSC (see FIG. 2F). Overall these results showed that isogenic subclones can be rapidly generated at multiple stages of differentiation, which should allow expression of deleterious genes at specific stages of development."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce iPSCs",
                                "motivate engineering iPSCs",
                                "disclose compositions and methods",
                                "describe efficient targeting of Chr. 19 and Chr. 13 safe harbor loci",
                                "design high efficiency TALEN and ZFN",
                                "describe recombinant polynucleotide-binding polypeptides",
                                "specify targeted genomic sequences",
                                "describe recombinant DNA-binding polypeptide forms",
                                "fuse recombinant DNA-binding polypeptide with nuclease activity",
                                "describe nuclease activity",
                                "specify FokI nuclease",
                                "describe FokI nuclease activity",
                                "describe TALEN embodiments",
                                "specify targeted sequences for TALEN",
                                "describe TALE domains",
                                "fuse TALE domain with nuclease activity",
                                "describe TALEN formation",
                                "specify targeted sequences for TALEN",
                                "describe polypeptide having nuclease activity",
                                "fuse polypeptide with TALE domain",
                                "describe TALEN embodiments",
                                "specify targeted sequences for TALEN",
                                "describe TALE constructs",
                                "target specific DNA sequences",
                                "form TALEN for modification",
                                "describe TALEN embodiments",
                                "specify targeted sequences for TALEN",
                                "introduce modifications to polynucleotide-binding polypeptides",
                                "describe CRISPR technology",
                                "discuss polynucleotides and vectors",
                                "describe recombinant DNA-binding polypeptides",
                                "discuss inducible and repressible promoters",
                                "describe cells modified by vectors",
                                "discuss degeneracy of genetic code",
                                "provide examples of polynucleotide sequences",
                                "discuss vectors with similar functional capabilities",
                                "describe donor polynucleotides",
                                "discuss sense and antisense strand polynucleotide overhangs",
                                "describe expression of polypeptides by donor polynucleotides",
                                "discuss inducible and repressible promoters for donor polynucleotides",
                                "describe targeting of safe harbor sites",
                                "discuss evaluation of promoters and reporters",
                                "describe generation of knock-in iPSC lines",
                                "discuss validation of reporter lines",
                                "describe genomic stability of AAVS1-copGFP line",
                                "discuss directed differentiation of reporter lines",
                                "describe creation of Chr13-Nanoluc-halotag line",
                                "discuss rapid exchanging of reporter cassettes",
                                "describe master cell line strategy",
                                "discuss Cre-recombinase mediated cassette exchange",
                                "describe replacement of GFP with TagGFP",
                                "discuss validation of DCXp-TagGFP reporter line"
                            ],
                            "num_characters": 26324,
                            "outline_medium": [
                                "introduce iPSCs and their applications",
                                "describe compositions and methods for rapid generation of reporters",
                                "detail efficient targeting of safe harbor loci",
                                "describe recombinant polynucleotide-binding polypeptides",
                                "specify targeted genomic sequences",
                                "describe zinc-finger domain or TALE domain",
                                "detail nuclease activity and FokI nuclease",
                                "describe TALEN and its applications",
                                "specify targeted sequences for TALEN",
                                "describe TALE domains and their sequences",
                                "detail TALEN constructs and their applications",
                                "describe specific TALEN embodiments",
                                "summarize TALEN applications",
                                "introduce polynucleotides and vectors",
                                "describe polypeptides encoded by vectors",
                                "discuss degeneracy of genetic code",
                                "provide examples of polynucleotides and polypeptides",
                                "describe donor polynucleotides for genome insertion",
                                "discuss expression of polypeptides by donor polynucleotides",
                                "describe targeting of safe harbor sites in iPSC lines",
                                "validate reporter lines engineered by safe harbor integration",
                                "describe rapid exchanging of reporter cassettes in safe harbors",
                                "illustrate vector design for cassette exchange",
                                "test strategy by replacing GFP with TagGFP",
                                "confirm functionally appropriate expression in reporter line"
                            ],
                            "outline_short": [
                                "introduce iPSCs and their applications",
                                "describe compositions and methods for rapid generation of reporters",
                                "design TALEN and ZFN for targeting safe harbor sites",
                                "describe recombinant polynucleotide-binding polypeptides for targeting chromosomes",
                                "detail nuclease domains and their applications",
                                "describe TALEN constructs for targeting specific DNA sequences",
                                "describe modifications to polynucleotide-binding polypeptides",
                                "outline polynucleotides and vectors for encoding polypeptides",
                                "detail donor polynucleotides for genome insertion",
                                "illustrate reporter systems in iPSC lines",
                                "describe rapid exchanging of reporter cassettes in safe harbors",
                                "validate master cell line strategy for reporter cassette exchange"
                            ]
                        },
                        {
                            "title": "Generation and Lineage-Specific Expression of KI Reporters",
                            "paragraphs": [
                                "Although lineage-specific constructs for some genes are available and some fragments are sufficiently small that they could be targeted to the safe harbor loci (see above DCX-copGFP reporter), a KI strategy in genes that are expressed in specific lineages is desirable as it allows for the development of assays to identify regulators of development. A Nanoluc-HaloTag construct (see FIG. 3) was selected to knock into the endogenous MAP2 locus, and the same reporter construct in endogenous GFAP allele. Monallelic lines were produced and the 3′ prime end of the gene was targeted to allow expression of normal levels of the endogenous gene. Both KI reporter lines were made in the XCL1 iPSC line to show that isogenic subclones could be obtained. Further, the same construct has been used in other NCRM lines. Specifically, ZFN pairs targeting the C-term of GFAP or MAP2 genes were designed and optimized. One pair cutting at ˜130 bp after the stop codon of GFAP ORF and ZFNs targeting ˜90 bp before the stop codon of MAP2 gene were selected for these experiments (FIGS. 3A and 3B). A donor vector consisting of a reporter cassette of a P2A peptide, a Nanoluc luciferase gene fused with a HaloTag, followed by a neomycin resistance gene was designed to be in frame with the C-terminal of the targeted genes (see FIGS. 3A and 3B). After co-transfection with the donor vector and mRNA of the respective ZFN pair, and appropriate drug selection, 35 colonies from each line were picked for further analysis. Successful insertion of the reporter genes to either GFAP or MAP2 gene was confirmed by both PCR and sequencing analyses for 33 GFAP and 4 MAP2 clones (see FIGS. 3C and 3D). Four clones of each reporter line were selected and verified to be heterozygotes (see FIGS. 3C and 3D). One of each validated GFAP-Nanoluc-KI and MAP2-Nanoluc-KI clone was chosen for further analysis as described below.",
                                "The positive expression of pluripotency markers and a normal karyotype in prolonged culture of both GFAP-Nanoluc-KI and MAP2-Nanoluc-KI iPSC lines were first confirmed. Next neural differentiation was induced via NSC formation from these two iPSC lines and the expression of the reporter genes, Nanoluc and HaloTag, was tracked during lineage-specific differentiation (see FIG. 4). No luciferase signal was detected in GFAP-Nanoluc-KI or MAP2-Nanoluc-KI lines or NSC derived from them (see FIGS. 4A, 4C, 4D and 4F).",
                                "For GFAP-Nanoluc-KI NSC, the expression of luciferase and HaloTag during astrocyte differentiation was monitored using a well-established protocol (Shaltouki et al. Stem cells 2013 31:941-952). Starting from day 18 after the NSC stage, the luminescence intensity increased gradually as the cells differentiated to astrocytes (see FIG. 4A). In order to visualize expression of the reporter gene during differentiation, ligand that covalently binds to HaloTag was used to label live GFAP-Nanoluc-KI cells at different time points during astrocyte differentiation. HaloTag-labeled fluorescent cells were only observed after the differentiation, further confirming that the reporters were turned on specifically by the GFAP promoter as the cells differentiated into astrocytes (see FIG. 4C). The differentiated GFAP-Nanoluc-KI cells (D23 post differentiation) were then tested by immunostaining and co-localization of GFAP and HaloTag antibodies was found in nearly 100% of the cells, indicating that the reporter genes in GFAP-Nanoluc-KI only turned on in the GFAP-positive cells (see FIG. 4B).",
                                "Using a similar strategy, the expression of Nanoluc and HaloTag reporter genes was monitored in the MAP2-Nanoluc-KI cells during neuronal differentiation. A 2-week differentiation protocol was used to generate a pure population of mixed neurons from the NSC (Swistowska et al. Stem cells and development 2010 19:71-82). No detectable luminescence was observed until 12 days post differentiation (see FIG. 4D). No fluorescence was detected from HaloTag expression in MAP2 NSC prior to differentiation (see FIG. 4F). Expression of HaloTag was observed as more and more cells differentiated into neurons (see FIG. 4E). Importantly, HaloTag antibody only stained the MAP2-positive neurons, indicating the specific expression of the reporter from the endogenous MAP2 promoter. These results signify that a single luciferase or HaloTag gene is sufficiently sensitive to allow for live tracking of differentiation events.",
                                "To determine the minimal numbers of cells required for detectable level of Nanoluc, the luminescence level of both GFAP-Nanoluc-KI astrocytes and MAP2-Nanoluc-KI neurons was measured at different cell densities (see FIG. 4G). Less than 1×104 cells were required for either GFAP-Nanoluc-KI astrocytes or MAP2-Nanoluc-KI neurons to be detected by luminescence in a 96-well format. This result suggested that the GFAP-Nanoluc-KI and MAP2-Nanoluc-KI reporters can be used to effectively and accurately track astrocytes or neurons during differentiation with small numbers of cells and in a high-throughput manner.",
                                "To further demonstrate that clones with multiple reporters can be made rapidly, a stock of NSC was generated from the MAP2-Nanoluc-KI subclone targeting the safe harbor locus at the NSC stage. The targeted clone (the MAP2-Nanoluc-KI line) could be re-targeted and a dual reporter line could be readily generated. Even higher efficiency was obtained when the clone was targeted at the iPSC stage, which was comparable to those seen in an untargeted line.",
                                "Thus, as shown herein, by combining safe harbor gene editing, cassette exchange tools, and the identification of lineage specific gene loci, the present invention provides a useful means for rapidly developing single and multiplexed reporters that provide investigators the ability to develop a repertoire of assays using reporters appropriate for their particular need. Further, the Nanoluc-HaloTag reporter construct disclosed herein offers several advantages. For example, it allows for simultaneous quantitative assessment and fluorescent imaging on demand for time-lapse imaging. By using small molecule ligands to HaloTag, one also has the advantage of choosing fluorescent signals, as its labeling is transient, which allows for other imaging modalities to be used when necessary. In addition, antibodies to the HaloTag are available allowing antibody labeling in fixed cells for archival purposes.",
                                "Further, the limited availability of human cells of the central nervous system make iPSC derived neural derivatives a promising cell source for drug discovery and for improvement of existing drug development workflow, specifically for the evaluation of toxicity and efficacy of lead compounds. Most neural differentiation protocols currently available, however, produce a heterogeneous population of neuron and glial cells, making it difficult to interpret the mechanism of action of a given compound. Using the neural lineage-specific KI reporter approach of the present invention mitigates this problem through use of a donor vector containing dual reporters of luciferase and HaloTag attached to the C-terminal of an endogenous lineage-specific gene. For example, using this approach, the MAP2 gene was targeted for neuron-specific reporter and the GFAP gene was targeted for astrocyte-specific reporter. Lineage-specific expression of the reporters was then validated during lineage-specific differentiation. This MAP2-Nanoluc-KI line allows for real-time monitoring of neuronal differentiation, and the luciferase activity in the culture reflects the percentage of neurons. The non-disruptive assay format enables accurate and quantitative measurement of any compound on neurons specifically. Likewise, the GFAP-Nanoluc-KI line allows for tracking and quantitative measurement of astrocytes in culture. The fact that as few as 104 cells (neurons or astrocytes) from these KI lines were needed to detect the luciferase activity in culture media makes these reporters/assays applicable for high-throughput and high content screening.",
                                "Further, because drug selection is incorporated via a T2A site downstream of the lineage specific promoter in the present invention, it is possible to purify neurons and astrocytes for assays. Likewise, cells can be sorted using the fluorescent label allowing one to combine screening with gene expression analysis.",
                                "In addition, cassette exchange in iPSC and NSCs in accordance with the present invention showed that clones can be rapidly generated in multiple stages of development. While experiments described in detail herein were performed in the neuronal lineage, the platform of the present invention has also been demonstrated to work in mesenchymal stem cells and astrocyte precursors and is expected to work with any other intermediate progenitor as well. The ability to use multiple reporters in the same site for different purposes is an invaluable benefit to having to generate new reporters or new lines and test their specificity and quality each time.",
                                "An additional advantage of the present invention is that the same safe harbors, master and control lines can be used for other lineages. This will allow for development of a database of drug responses and effects of a mutation in a single pathway in multiple cell types from a single allelic background.",
                                "The following nonlimiting examples are provided to further illustrate the present invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate KI strategy",
                                "introduce Nanoluc-HaloTag construct",
                                "design ZFN pairs for GFAP and MAP2 genes",
                                "describe donor vector design",
                                "summarize co-transfection and drug selection",
                                "confirm reporter gene insertion",
                                "verify heterozygosity of clones",
                                "confirm pluripotency markers and karyotype",
                                "induce neural differentiation",
                                "track reporter gene expression during differentiation",
                                "monitor luciferase expression in GFAP-Nanoluc-KI NSC",
                                "visualize HaloTag expression during astrocyte differentiation",
                                "co-localize GFAP and HaloTag antibodies",
                                "monitor Nanoluc and HaloTag expression in MAP2-Nanoluc-KI cells",
                                "determine minimal cell numbers for detectable luminescence",
                                "generate dual reporter lines",
                                "highlight advantages of Nanoluc-HaloTag reporter construct",
                                "discuss applications in drug discovery and development"
                            ],
                            "num_characters": 9404,
                            "outline_medium": [
                                "motivate KI strategy",
                                "design Nanoluc-HaloTag construct",
                                "generate monallelic lines",
                                "target 3′ prime end of gene",
                                "produce isogenic subclones",
                                "track reporter gene expression",
                                "confirm lineage-specific expression",
                                "demonstrate high-throughput screening",
                                "highlight advantages of invention"
                            ],
                            "outline_short": [
                                "motivate KI strategy for lineage-specific expression",
                                "design and optimize ZFN pairs for GFAP and MAP2 genes",
                                "generate and validate KI reporter lines for GFAP and MAP2 genes",
                                "demonstrate application of KI reporters for lineage-specific differentiation and high-throughput screening"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce iPSCs",
                        "importance of iPSCs in drug discovery",
                        "define terms",
                        "explain animal",
                        "explain cell culture",
                        "explain differentiation",
                        "explain differentiation medium",
                        "explain donor polynucleotide",
                        "explain downstream",
                        "explain embryonic stem cells",
                        "explain effective amount",
                        "explain exogenous",
                        "explain expand",
                        "explain expansion medium",
                        "explain FokI nuclease",
                        "explain genomic insertion site",
                        "explain growth factor",
                        "explain heterologous",
                        "explain induced pluripotent stem cell",
                        "explain isolated",
                        "explain lineage-specific",
                        "explain mesenchymal stem cell",
                        "explain modulate",
                        "explain neural cell",
                        "explain neuronal stem cell",
                        "explain neurological disorder",
                        "explain neurodegenerative disorder",
                        "provide examples of neurodegenerative disorders",
                        "define PKAN disease",
                        "describe clinical features of PKAN",
                        "introduce neurodegenerative-related disorders",
                        "define nucleofection",
                        "describe pharmaceutically acceptable carriers",
                        "define pharmaceutical agent or drug",
                        "define polynucleotide",
                        "define oligonucleotide",
                        "define polypeptide",
                        "define DNA-binding polypeptide",
                        "define functional fragments of a polypeptide",
                        "define substantially purified polypeptide",
                        "describe conservative substitutions",
                        "define promoter",
                        "define recombinant",
                        "define recombination",
                        "define safe harbor",
                        "define selectable marker",
                        "define sequence identity",
                        "describe methods of alignment for comparison",
                        "define specific binding",
                        "define subject",
                        "define synapse",
                        "define transduced, transformed, and transfected",
                        "describe methods of transfection",
                        "define transgene",
                        "define treating, treatment, and therapy",
                        "define upstream",
                        "define vector",
                        "define zinc finger DNA binding domain",
                        "describe engineering of zinc finger binding domains",
                        "define about",
                        "describe numerical parameters",
                        "describe technical and scientific terms",
                        "describe singular and plural terms",
                        "describe \"A or B\" terms",
                        "describe base sizes and molecular weight values",
                        "describe suitable methods and materials",
                        "define comprises",
                        "describe incorporated references",
                        "describe conflict resolution"
                    ],
                    "num_characters": 34692,
                    "outline_medium": [
                        "introduce iPSCs as tools for drug discovery and toxicology screens",
                        "define terms used in molecular biology",
                        "explain animal and mammal terms",
                        "define cell culture and expansion",
                        "describe differentiation and differentiation medium",
                        "explain donor polynucleotide and downstream position",
                        "define embryonic stem cells and their derivation",
                        "explain effective amount and therapeutically effective amount",
                        "define exogenous and endogenous molecules",
                        "describe expansion and expansion medium",
                        "explain FokI nuclease and genomic insertion site",
                        "define growth factor and heterologous sequence",
                        "describe induced pluripotent stem cells and lineage-specific characteristics",
                        "explain mesenchymal stem cells, modulation, and neurological disorders",
                        "define PKAN and its clinical features",
                        "describe neurodegenerative-related disorders",
                        "introduce nucleofection and electroporation",
                        "describe pharmaceutically acceptable carriers",
                        "define pharmaceutical agent or drug",
                        "define polynucleotide and oligonucleotide",
                        "define polypeptide and DNA-binding polypeptide",
                        "describe functional fragments of a polypeptide",
                        "define substantially purified polypeptide",
                        "describe conservative substitutions",
                        "define promoter and its components",
                        "define recombinant and recombination",
                        "describe safe harbor and selectable marker",
                        "define sequence identity and its measurement",
                        "describe specific binding and its characteristics",
                        "define subject and synapse",
                        "describe transduced, transformed, and transfected",
                        "define transgene and treating",
                        "describe upstream and vector",
                        "define zinc finger DNA binding domain"
                    ],
                    "outline_short": [
                        "introduce iPSCs and their importance",
                        "define key terms in molecular biology",
                        "explain cell culture and differentiation",
                        "describe nucleic acids and genomic insertion sites",
                        "define growth factors and their roles",
                        "explain induced pluripotent stem cells and their derivation",
                        "describe neural cells, stem cells, and neurological disorders",
                        "define neurodegenerative disorders",
                        "describe PKAN and related disorders",
                        "introduce nucleofection and pharmaceutically acceptable carriers",
                        "define polynucleotide, polypeptide, and related terms",
                        "describe promoter, recombinant, and recombination",
                        "introduce safe harbor, selectable marker, and sequence identity",
                        "define specific binding, subject, and synapse",
                        "describe transduced, transformed, and transfected cells",
                        "introduce transgene, treating, and therapy",
                        "define upstream, vector, zinc finger DNA binding domain, and about"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1: iPSC Culture and Gene Targeting by ZFN/TALENs",
                            "paragraphs": [
                                "A subclone of each NCRM1 and NCRM5 integration-free iPSC line (NIH CRM), named XCL1 and XCL5, was obtained from XCell Science (Novato, Calif.) and used as the parental cells for all engineered work described in these examples. iPSC were cultured as in accordance with procedures described by Lie et al. (Methods in molecular biology 2012 873: 237-246) and Zou et al. Blood 2011 117:5561-5572) and maintained in feeder-free conditions on Matrigel (BD Biosciences, CA) coated dishes using mTeSR™1 media (STEMCELL Technologies Inc., Vancouver, Canada) following the manufacturer's protocols. TALEN expression plasmids targeting safe harbor sites in Chr.13 and Chr.19 (AAVS1) were provided by NIH and comprise sequences set forth herein in the Section entitled. ZFN expression plasmids targeting the C-term of MAP2 and GFAP genes were purchased from Sigma (St. Louis, Mo.). Each plasmid DNA was linearized by XbaI for mRNA production and purification following modified manufacturer's protocols."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "culture iPSC and engineer using ZFN/TALENs"
                            ],
                            "num_characters": 991,
                            "outline_medium": [
                                "culture iPSC and engineer genes"
                            ],
                            "outline_short": [
                                "culture iPSC and engineer genes"
                            ]
                        },
                        {
                            "title": "Example 2: Donor Vector Design and Construction",
                            "paragraphs": [
                                "A backbone vector containing a puromycin resistant gene flanked by two loxP sites and a CAG promoter driving copGFP cassette was constructed between the lox2272 and lox511 sites. Insulator expressing genes were used to generate AAVS1-copGFP donor vector targeting to the AAVS1 site at Chr.19 (see FIG. 1A). A 754 bp left homologous arm and an 838 bp right homologous arm were amplified by PCR from XCL1 (Xcell Inc, CA) gDNA and cloned into the backbone vector. For Chr13-copGFP, a similar backbone vector was used (the puromycin resistant gene was replaced by a PGK promoter driven neomycin resistant gene) and inserted with a 832 bp left homologous arm and a 796 bp right homologous arm amplified from the Chr13 safe harbor region where designed TALENs are targeting to.",
                                "Another backbone vector containing a P2A peptide, Nanoluc reporter gene fused with a downstream HaloTag, a T2A peptide in frame with a Neomycin resistant gene and a puromycin resistant gene flanked by two loxP sites was designed and constructed for targeting different genes to generate lineage-specific reporter donor vectors. A 1069 bp left homologous arm right before the stop codon of MAP2 gene was PCRed from XCL1, and then cloned into the backbone vector upstream and in frame with the P2A peptide. A 1084 bp fragment was cloned in as right homologous arm to generate the MAP2-Nanoluc-KI donor vector. For the GFAP-Nanoluc-KI donor vector, a 1022 bp fragment right before the stop codon and a 1020 bp fragment after the stop codon was cloned into backbone vector as the left and right homologous arm, respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "design donor vector backbone",
                                "construct AAVS1-copGFP donor vector",
                                "construct lineage-specific reporter donor vectors"
                            ],
                            "num_characters": 1593,
                            "outline_medium": [
                                "design and construct donor vectors"
                            ],
                            "outline_short": [
                                "design and construct donor vectors"
                            ]
                        },
                        {
                            "title": "Example 3: Reporter iPSC Lines Generation",
                            "paragraphs": [
                                "Prior to nucleofection, XCL1 iPS cells were maintained and passed using Accutase (Life Tech., NJ) to make sure cells are growing in monolayer. On the day of nucleofection, single cell suspension cells were generated using Accutase followed by inactivation and washes with HBSS. 4-6 ug of each pair of TALENs/ZFNs RNA was used for nucleofection using Amaxa Human Stem Cell Nucleofection Kit (Lonza, N.J.). After nucleofection, cells were plated in mTeSR™1 medium with 10 uM Rock inhibitor. After 2-5 days recovery, cells were treated with appropriate antibiotics. Specifically, 2.5 μg/ml Puromycin (Life Tech., NJ) for AAVS1-copGFP, MAP2-nanoluc-KI and GFAP-Nanoluc-KI lines and 500 μg/ml Neomycin (Life Tech., NJ) for Chr13-copGFP line. Drug resistant colonies were re-plated at low density for single cell cloning. Colonies growing from single cells were screened by PCRs and sequencing to identify targets with correct donor vector integrations. The verified targets were expanded, stored and characterized for future experiments."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "nucleofect iPSC with TALENs/ZFNs",
                                "select and verify reporter iPSC lines"
                            ],
                            "num_characters": 1032,
                            "outline_medium": [
                                "generate reporter iPSC lines"
                            ],
                            "outline_short": [
                                "generate reporter iPSC lines"
                            ]
                        },
                        {
                            "title": "Example 4: NSC Derivation and Neural Differentiation",
                            "paragraphs": [
                                "Generation of NSC was accomplished in accordance with procedures described by Swistowski et al. (PloS one 2009 4:e6233). More specifically, NSC were derived from iPSC lines and were cultured on Matrigel coated dishes in Neurobasal® medium supplemented with 1% nonessential amino acids, 1% GlutaMAX, 1×B-27®, and 10 ng/ml bFGF, and passaged using Accutase. Neuronal differentiation was achieved by culturing NSC in Neuronal Primer media (Xcell inc, CA) on a surface coated with Poly-L-ornithine (2 μg/ml, Sigma, St. Louis, Mo.) and laminin (10 μg/ml, Life Tech., NJ) at a density of 40-50 k/cm2 for 5-6 days until cells become confluent. Then cells were split with Accutase and were plated onto new poly-ornithine/laminin coated dishes at 40-50 k/cm2 in Neuronal Medium (Xcell inc, CA) to continue differentiation for as long as desired. Astrocyte differentiation from NSC was also carried out on culture dishes or glass cover slips coated with Poly-L-ornithine/laminin in Astrocyte Primer medium (Xcell Inc, CA). Medium was changed every other day and cells have to be split at least 3 times before day 15. On day 18, change media to Astrocyte medium (Xcell inc, CA) and continue differentiation for up to day 35."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "derive NSC from iPSC",
                                "differentiate NSC into neurons and astrocytes"
                            ],
                            "num_characters": 1213,
                            "outline_medium": [
                                "derive NSC and differentiate neurons"
                            ],
                            "outline_short": [
                                "derive NSC and differentiate neurons"
                            ]
                        },
                        {
                            "title": "Example 5: Cre Recombinase-Mediated Cassette Exchange in iPSC and NSC",
                            "paragraphs": [
                                "The iPSC or NSC master lines (AAVS1-copGFP or Chr13-copGFP) were plated on Matrigel-coated 35 mm dishes. When cells reached 70-80% confluency, plasmid expressing Cre recombinase and daughter construct were co-transfected using Lipofectamine 3000 (Life Tech., NJ) following manufacturer's protocols. For iPSC, cells were selected with appropriate antibiotics to enrich the cell populations with successful cassette exchange. Then drug resistant colonies were further screened using a fluorescence microscope to identify colonies that lost green fluorescence, which were picked, expanded and confirmed by PCR and sequencing."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform Cre-mediated cassette exchange"
                            ],
                            "num_characters": 622,
                            "outline_medium": [
                                "perform cassette exchange using Cre recombinase"
                            ],
                            "outline_short": [
                                "perform cassette exchange using Cre recombinase"
                            ]
                        },
                        {
                            "title": "Example 6: Immunocytochemistry",
                            "paragraphs": [
                                "Immunocytochemistry and staining procedures were performed in accordance with procedures described by Zeng et al. (Stem Cells 2003 21:647-653). Specifically, cells were fixed with 4% paraformaldehyde for 20 minutes at room temperature, blocked in blocking buffer (10% goat serum, 1% BSA, 0.1% Triton X-100) for one hour followed by incubation with the primary antibody at 4° C. overnight in 8% goat serum, 1% BSA, 0.1% Triton X-100. Appropriately coupled secondary antibodies, Alexa488 and Alexa594 (Molecular Probes and Jackson ImmunoResearch Lab Inc.) were used for single or double labeling. All secondary antibodies were tested for cross reactivity and non-specific immune-reactivity. The following primary antibodies were used: Nestin (BD Biosciences, CA), GFAP (DakoCytomation Inc, CA), MAP2 (Sigma, St. Louis) and DCX (Santa Cruz Biotechnology, TX). DAPI was used to label the nuclei."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform immunocytochemistry staining"
                            ],
                            "num_characters": 891,
                            "outline_medium": [
                                "perform immunocytochemistry"
                            ],
                            "outline_short": [
                                "perform immunocytochemistry"
                            ]
                        },
                        {
                            "title": "Example 7: Luciferase Activity Measurement and HaloTag Detection",
                            "paragraphs": [
                                "Determination of Nanoluc luciferase activity was measured using Nano-Glo Assay System following manufacturer's protocol (Promega, Wis.). Specifically, 50 μl culture media was mixed with 50 μl of Nano-Glo Assay Reagent in a 96-well plate for an incubation period of 5 min. Then luciferase activity was measured using a Perkin Elmer Fusion-alpha-FP-HT universal microplate analyzer. Detection of HaloTag was achieved either in live cells using HaloTag® TMR Ligand following manufacturer's protocol (Promega, Wis.) or in fixed cells using HaloTag antibodies (Promega, Wis.)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "measure luciferase activity and detect HaloTag"
                            ],
                            "num_characters": 571,
                            "outline_medium": [
                                "measure luciferase activity and detect HaloTag"
                            ],
                            "outline_short": [
                                "measure luciferase activity and detect HaloTag"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [
                "claim priority from provisional application"
            ],
            "num_characters": 208,
            "outline_medium": [
                "claim priority from provisional application"
            ],
            "outline_short": [
                "claim priority from provisional application"
            ]
        }
    ],
    "claims": [
        "1. A method for developing a master cell line, said method comprising integrating a reporter cassette into a cell at a safe harbor site, wherein said reporter cassette comprises a reporter gene driven by a constitutively active promoter and multiple Lox sites.",
        "2. The method of claim 1 wherein a Cre-recombinase induced cassette exchange strategy is used to exchange said reporter cassette in the master cell line with a new reporter cassette, thereby generating a new reporter line with the same isogenic background.",
        "3. The method of claim 1 wherein the promoter driving the reporter gene is inserted between two Lox sites.",
        "4. The method of claim 3 wherein the promoter is inserted between lox2272 and lox511.",
        "5. The method of claim 1 wherein the cell is a progenitor cell.",
        "6. The method of claim 1 wherein the cell is a pluripotent or multipotent stem cell.",
        "7. The method of claim 6 wherein the cell is an induced pluripotent stem cell.",
        "8. The method of claim 6 wherein the cell is a neural stem cell.",
        "9. The method of claim 1 wherein the cell is a differentiated cell.",
        "10. A master cell line integrated with a reporter cassette at a safe harbor site in the cell, wherein said reporter cassette comprises a reporter gene driven by a constitutively active promoter and multiple Lox sites.",
        "11. The master cell line of claim 10 wherein a Cre-recombinase induced cassette exchange strategy is used to exchange said reporter cassette in the master cell line with a new reporter cassette, thereby generating a new reporter line with the same isogenic background.",
        "12. The master cell line of claim 10 wherein the promoter driving the reporter gene is inserted between two Lox sites.",
        "13. The master cell line of claim 12 wherein the promoter is inserted between lox2272 and lox511.",
        "14. The master cell line of claim 10 wherein the cell is a progenitor cell.",
        "15. The master cell line of claim 10 wherein the cell is a pluripotent or multipotent stem cell.",
        "16. The master cell line of claim 15 wherein the cell is an induced pluripotent stem cell.",
        "17. The master cell line of claim 15 wherein the cell is a neural stem cell.",
        "18. The master cell line of claim 10 wherein the cell is a differentiated cell.",
        "19. A method of generating a new reporter line, said method comprising utilizing a Cre-recombinase induced cassette exchange strategy in the master cell line of claim 10 to exchange the reporter cassette in the master cell line with a new reporter cassette, thereby generating a new reporter line with the same isogenic background."
    ]
}