{
    "id": "US20160195529",
    "authors": [
        "Ajit Lalvani",
        "Katrina Mary Pollock",
        "Graham Taylor",
        "Hilary Sian Whitworth"
    ],
    "title": "METHODS AND KITS FOR DETERMINING TUBERCULOSIS INFECTION STATUS",
    "date": "2014-09-04 00:00:00",
    "abstract": "There is provided methods of determining tuberculosis (TB) infection status in an individual comprising: (i) providing a sample comprising T-cells; (ii) exposing the sample of (i) to one or more TB antigens; (iii) identifying T-cells in the sample that are CD4 positive and (a) secrete TNF-α without secreting IFN-γ; or (b) secrete IFN-γ without secreting TNF-α; (iv) identifying those cells of (iii) which are also CCR7 and, CD127 negative; and optionally (v) calculating the cells identified in (iv) as a percentage of those identified in (iii); wherein the identification of cells in (iv) and/or the percentage of T-cells calculated in (v) correlates to TB infection status of the individual, and wherein steps (iii) and (iv) can be carried out either sequentially or simultaneously. There are also provided compositions and kits for use in such methods.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "The present invention relates to methods for determining tuberculosis infection status and compositions and kits for use in such methods.",
                "Worldwide there are almost 2 million deaths due to active tuberculosis (TB) every year (World Health Organisation (WHO) 2011) and in the developed world, including the UK, rates of TB have risen (Health Protection Agency (HPA) 2011).",
                "Clinicians treating TB face two major challenges:\n\n\n- - 1) Diagnostic distinction of active TB and latent TB infection\n    (“ATB” and “LTBI”, respectively)\n  - 2) Prioritising treatment of LTBI to those most likely to progress\n    to active TB.",
                "Unlike, for example HIV infection, where the amount of virus in the body (plasma or other compartments) is directly quantifiable using PCR, there is no comparable test to directly measure mycobacterial (e.g. Mycobacterium tuberculosis) pathogen load. A widely used TB diagnostic assay, the mantoux or tuberculin skin test (TST), uses an immune-based approach to demonstrate the presence of infection with Mycobacterium tuberculosis (MTB). The TST has poor specificity especially in those who are BCG-vaccinated (Diel, Goletti et al. 2011) and poor sensitivity especially in those who are immunocompromised e.g. with HIV infection (Cobelens, Egwaga et al. 2006).",
                "The recently introduced interferon-gamma release assays (IGRAs) also use an immune-based approach, which is more quantifiable than the mantoux test and less open to confounding by BCG vaccination or exposure to environmental mycobacteria. Neither the mantoux test nor the IGRAs nor indeed any other commercially available assay can reliably distinguish between latent, active or treated TB or predict which patients with LTBI are likely to progress to active TB.",
                "Approximately half of pulmonary TB cases are smear positive for acid fast bacilli (HPA 2011). This method for diagnosing active TB is therefore not very sensitive and is highly disease site specific. The gold standard diagnostic test for active TB is microbiological culture. This was only positive in 58% of cases reported in the UK in 2010 (HPA 2011) and is especially difficult to interpret in paucibacillary disease e.g. lymph node TB, central nervous system TB (CNS TB) and in HIV co-infection. This method of diagnosis is also confined to accessing the site of disease, which can be challenging. The new PCR based approaches e.g. GeneXpert, whilst quicker than microbiological culture cannot distinguish active from latent TB. Both CNS TB and TB with HIV co-infection are associated with high morbidity and mortality. Early and accurate diagnosis is therefore of paramount importance.",
                "Investigation of both active and latent TB infection may involve multiple invasive, time consuming and expensive tests such as CT with contrast, bronchoscopy, biopsy or PET scanning. A blood test that could reduce the need for such intensive investigation would therefore be of great benefit to both patients and healthcare providers.",
                "Treatment of active TB requires a longer, more complex and more toxic treatment regime than the chemoprophylaxis used for LTBI, however both can be associated with potentially life-threatening toxicity. Many therapeutics currently used to treat mycobacterial infection have high associated morbidity e.g. peripheral neuropathy and mortality e.g. liver necrosis. Therefore use of the appropriate shortest and most effective therapeutic regime is vital.",
                "Misdiagnosis of active TB as LTBI can lead to uncontrolled mycobacterial replication and increases the risk of drug resistance, which is more difficult to treat and has a higher associated morbidity and mortality. Misdiagnosis of LTBI and consequent treatment as active TB exposes patients to unnecessary and sometimes toxic therapies for a prolonged period. Furthermore, as most patients with LTBI will never progress to active TB, there is therefore an opportunity to improve care by identifying those most likely to progress and prioritising them to receive treatment. Those unlikely to progress would thus be able to avoid taking chemoprophylaxis altogether.",
                "Currently there is no diagnostic test able to distinguish these two groups. However, given that the likelihood of progression is greatest in the first 2-3 years following MTB infection, correlates of time since exposure may provide a means for risk stratification.",
                "Some data have shown that changes in the antigen-specific cellular immune response mirror pathogen burden and clearance e.g. in cytomegalovirus and HIV infections (Harari, Petitpierre et al. 2004). Recent work on the MTB-specific cellular immune response has suggested that this paradigm holds true in TB (Casey,",
                "Blumenkrantz et al.; Millington, Innes et al. 2007). Further studies have focused on using either MTB-specific cell function or cell phenotype to try to distinguish between active and latent infection (Harari, Rozot et al.; Goletti, Butera et al. 2006; Wang, Cao et al. 2010; Mueller, Detjen et al. 2008; Caccamo, Guggino et al. 2009).",
                "WO 2007/107714 describes the use of T-cell IFN-γ and IL-2 secretion in assessing the outcome of infections such as TB. WO 2009/158521 describes using differential expression of a large number of genes for distinguishing between active and latent TB. Caccamo et al. (2010) Eur. J. Immunol 40: 2211-2220 describe the use of the T-cell subset that expresses TNF-α, IFN-γ and IL-2 as correlating with active TB. Data in the wider literature on the correlation of multi-functional (and here specifically tri-functional) MTB-specific T-cell frequency with the presence of active TB is both limited and conflicting. WO 2011/044508 describes the use of differential expression of T-cell antigens in the evaluation of prognoses of patients suffering from chronic pulmonary diseases generally. WO 2012/085652 describes the use of CD4 positive T-cells in a method which is 66.67% sensitive and 92.41% specific in the differentiation between active and latent TB infection, based only on the percentage of those cells that produce TNF-α but not IFN-γ or IL-2.",
                "To date, it has not been recognised that loss of CD127 expression can be used to discriminate a subset of differentiated effector T cells or showed clearly that the changes measured in active versus latent TB were independent of HIV co-infection. Therefore, none demonstrated an approach that was sufficiently sensitive or specific enough to be taken forward as a clinical diagnostic test or widely applicable to the HIV co-infected population. Furthermore, these tests were not evaluated with a view to risk stratification in LTBI. In addition, the results from, WO 2012/085652, were not fully replicable from our own data or in other studies comparing active and latent TB e.g. Caccamo et al. (2010) Eur. J. Immunol 40: 2211-2220.",
                "The inventors now combine simultaneous measurement of both cellular phenotype and function to give highly detailed data on the MTB-specific cellular immune response. They have shown for the first time, that when combined, MTB-specific cell phenotype and function are closely linked to TB disease stage e.g. active versus latent and that these changes are independent of HIV co-infection.",
                "The method described herein can distinguish between active and latent TB with a sensitivity of 100%, specificity of 93% and on receiver operator characteristic analysis, the area under the curve of was 0.994 (the value for a perfect test being 1).",
                "Furthermore, this data suggests that, within LTBI, this combined measurement may be a clinically relevant approach to risk stratification by distinguishing individuals who have been recently versus remotely infected. This novel combined approach therefore provides the most accurate proxy of TB disease activity to date.",
                "The inventors now provide the most sensitive and specific immunological approach to date for distinction of active and latent infection and indication of mycobacterial disease activity based on the measurement of the phenotype (CD45RA-CCR7-CD127-) of a specific subset of CD4+ MTB-antigen responsive cells.",
                "Advantages of the method provided by the inventors over the currently used tests can be seen in Table A.",
                "In a first aspect of the invention there is provided a method of determining tuberculosis (TB) infection status in an individual comprising:\n\n\n- - (i) providing a sample comprising T-cells;\n  - (ii) exposing the sample of (i) to one or more TB antigens;\n  - (iii) identifying T-cells in the sample that are CD4 positive\n    and (a) secrete TNF-α without secreting IFN-γ; or (b) secrete IFN-γ\n    without secreting TNF-α;\n  - (iv) identifying those cells of (iii) which are also CCR7 and CD127\n    negative; and optionally\n  - (v) calculating the cells identified in (iv) as a percentage of\n    those identified in (iii);",
                "wherein the identification of cells in (iv) and/or the percentage of cells calculated in (v) correlates to TB infection status of the individual, and wherein steps (iii) and (iv) can be carried out either sequentially or simultaneously.",
                "Steps (i) and (ii) may be performed as a distinct methodology e.g. as part of an alternative assay such as an IGRA (interferon-gamma release assay), ELISpot (Enzyme-Linked Immunosorbent Spot), or TBSpot assay and consequently may be performed at a different time or using a different piece of equipment (e.g. well plate) or even a different physical location to the remaining steps.",
                "In certain embodiments, the cells identified in step (iv) of the methods are additionally CD45RA negative.",
                "In certain embodiments, the cells identified in step (iii) of the methods additionally do not secrete IL-2.",
                "In certain embodiments the cells identified in step (iii) of the methods are additionally CD3 positive.",
                "In certain embodiments the cells identified in step (iii) of the methods are additionally CD8 negative.",
                "“TB” is used interchangeably herein with “MTB” and “tuberculosis”. It is intended to include TB caused by any MTB specific causing organisms including Mycobacterium Tuberculosis, Mycobacterium Bovis and Mycobacterium africanum. It is particularly preferred that the TB is caused by Mycobacterium Tuberculosis.",
                "By “individual” we refer to any organism capable of being infected with TB. Preferably the individual is a mammal, more preferably selected from cattle, badgers and humans. Most preferably the individual is a human.",
                "By “TB antigens” we refer to any TB protein capable of eliciting an immune response.",
                "Examples of TB antigens are tuberculosis purified protein derivative (PPD), ESAT-6, CFP-10, EspC, TB7.7, Rv3879c, Rv3873, Rv3878, PE/PPE proteins, Ag85A/B and TB10.4, Heparin-Binding Haemagglutinin, Rv0440, Rv3875/Rv3874, Rv0140, Rv0384c, Rv2662, Rv3223c, Rv3307, Rv3862c, Rv0079, Rv0081, Rv0574c, Rv1733c, Rv1734c, Rv1998, Rv2006, Rv2007c, Rv2028c, Rv2627c, Rv2629, Rv2630, Rv3132c, Rv0867c, Rv1009, Rv1884c, Rv2389c. Any other TB antigen known in the art could also be used.",
                "In certain embodiments the cells in step (iii) are additionally identified as live T-cells. They may be identified as live cells by any method known in the art, such as the use of either a dead cell marker or a live cell marker. Such markers are well known in the art (e.g. LIVE/DEAD® fixable dead cell stain kits).",
                "Dead cell markers label internal cellular structures via disrupted membranes in dead cells. Other dyes that could be used as dead cell markers are impermeant nucleic acid dyes e.g. EMA, DAPI, SYTOX®Blue/Green/Red, Ethidium homodimer-1, Propidium iodide, 7-AAD, monomeric cyanine dyes, Annexin V dyes. Not all of these dyes are suitable for use with formaldehyde fixation unlike the LIVE/DEAD® fixable dead cell stain kits.",
                "The particular subsets of T-cells as specified in steps (iii) and (iv) can be identified by any suitable technique known in the art. However, a preferred technique is that of multi-parameter flow cytometry. This technique is well known in the art as a method which can be used to determine the amount of cells of a certain type in a sample by criteria such as cell phenotype and/or cell function and using a cocktail of visually tagged antibodies specific for multiple markers of cell phenotype or function. The following gating strategy may be used:",
                "Example gating strategy:\n\n\n- - 1. Gate on live cells i.e. those negative for the dead cell\n    discriminator\n  - 2. Gate on singlets using forwards scatter\n  - 3. Gate on singlets using side scatter\n  - 4. Gate on lymphocytes using light scatter properties.\n  - 5. Gate on CD3+ cells\n  - 6. Gate on CD4+ cells\n  - 7. Define IFN-γ, IL-2 and TNF-α quadrants using fluorescence minus\n    one controls\n  - 8. Use Boolean gating to create 7 non overlapping functional subsets\n    including IFN-γ-only secreting and TNF-α-only secreting cells\n  - 9. Define CCR7 vs. CD45RA and CCR7 vs. CD127 quadrants using\n    fluorescence minus one controls on functional subsets.\n  - 10. Use Boolean gating to select CD45RA-CCR7-CD127- cells.",
                "In preferred embodiments of the invention, steps (iii) and/or (iv) of the methods of the first aspect of the invention are performed by multi-parameter flow cytometry.",
                "A preferred method of multi-parameter flow cytometry will involve reduction of the number of fluorophore detectors required. It is estimated that the method could be simplified by at least 5 colours to a 6-colour flow cytometry assay. Therefore, the method could be run as a 5-11 colour assay, for example, an 11, 10, 9, 8, 7, 6 or 5 colour flow cytometry assay. This is a realistic target for a diagnostic assay in a clinical setting given the flow cytometry assays currently performed in patients with blood dyscrasias e.g. lymphoma.",
                "In certain embodiments of the invention, the TB infection status determined by the method of the first aspect of the invention corresponds to the presence or absence of TB infection. In other words the method is used to determine if the sample is from an individual that is, or is not, infected with TB.",
                "In certain embodiments the identification of one or more cells in step (iii) determines the presence of TB infection.",
                "In certain embodiments of the invention, the TB infection status determined by the method of the first aspect of the invention corresponds to the presence of an active TB infection (ATB) or a latent TB infection (LTBI). In other words, the method of the invention is able to distinguish between samples from individuals with active TB and those with latent TB.",
                "In certain embodiments the identification of one or more cells in step (iv) determines the presence of an active TB infection.",
                "In certain embodiments the absence of one or more cells in step (iv) determines the presence of a latent TB infection.",
                "In certain embodiments the percentage values calculated in step (v) that determine the presence of an active TB infection are higher than the percentage values calculated in step (v) that determine the presence of a latent TB infection. In other words, the percentage values determined in step (v) for a sample from an individual with active TB will be higher than for a sample from an individual with latent TB.",
                "Preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10% to 40%.",
                "Preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10% to 17.4%.",
                "For example, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10, 11, 12, 13, 14, 15, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39 or 40%.",
                "More preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10, 11, 12, 13, 14, 15, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29 or 30%.",
                "Even more preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 17-18%, for example 17.0, 17.1, 17.2, 17.3, 17.4, 17.5, 17.6, 17.7, 17.8, 17.9 or 18.0%.",
                "Most preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 17.4%.",
                "Preferably, the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 10% to 40%.",
                "Preferably, the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 17.3% to 40%.",
                "For example, the TB infection status corresponds to latent TB infection when the percentage calculated in step (v) is less than or equal to 10, 11, 12, 13, 14, 15, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39 or 40%.",
                "More preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is less than or equal to 10, 11, 12, 13, 14, 15, 15, 17, 18, 19, 20, 21, 22, 23, 24 or 25%.",
                "Even more preferably, the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is less than or equal to 17-18%, for example 17.0, 17.1, 17.2, 17.3, 17.4, 17.5, 17.6, 17.7, 17.8, 17.9 or 18.0%.",
                "Most preferably, the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 17.3%.",
                "In certain embodiments of the invention, the TB infection status determined by the method of the first aspect of the invention corresponds to the risk of a latent TB infection progressing to an active TB infection. In other words, the method of the invention is able to determine the risk of an individual with a latent TB infection progressing to having active TB.",
                "In one embodiment the risk of a latent TB infection progressing to an active TB infection is determined by the identification of one or more cells in step (iv). In other words, if one or more cells are identified in step (iv), the individual is at risk of progressing from a latent TB infection to active TB.",
                "In one embodiment the risk of a latent TB infection progressing to an active TB infection is proportional (positively correlated) to the percentage value calculated in step (v) of the method. For example, a higher percentage value calculated in step (v) correlates with an increased risk of a latent TB infection progressing to an active TB infection.",
                "In certain embodiments of the invention the TB infection status identified by the method of the first aspect of the invention corresponds to the amount of time elapsed since the individual was originally infected with TB. In other words, the method of the invention is able to determine the relative time since the individual was originally infected with TB.",
                "In one embodiment the time elapsed since the individual was originally infected with TB is inversely proportional (negatively correlated) to the percentage value calculated in step (v). For example, a higher percentage value calculated in step (v) correlates to a shorter amount of time since the individual was originally infected with TB.",
                "A more recently acquired asymptomatic infection is more likely to progress to active TB disease than an infection acquired longer ago. Therefore the proportion or frequency of CD3+CD4+TNFalpha+IFNgamma-IL2-CCR7-CD127-CD45RA- may also correlate with the recentness of TB exposure and in some instances may be as high as seen in active TB.",
                "The methods of the invention allow determination of the TB status of an individual regardless of whether or not the individual is also infected with HIV. In other words, the methods of the invention function independently of the HIV status of the individual.",
                "In certain embodiments the individual is infected with HIV. In other embodiments the individual is not infected with HIV, or the HIV infection status of the individual is unknown.",
                "The methods of the invention allow determination of the TB status of an individual regardless of the site of the TB infection. In other words, the methods of the invention function independently of the site of the TB infection.",
                "For example, the individual may be or have been infected with TB in the lung (pulmonary) or at any other site (extrapulmonary), or the site of infection may be unknown.",
                "Examples of extrapulmonary infection sites include the pleura (e.g. in tuberculous pleurisy), the central nervous system (e.g. in tuberculous meningitis), the lymphatic system (e.g. in scrofula of the neck), the genitourinary system (e.g. in urogenital tuberculosis), the bones and joints (e.g. in Pott's disease of the spine), the skin, and gastrointestinal manifestations, among others.",
                "In certain embodiments the individual has been infected with TB at any site. In other words, the site of infection may be pulmonary and/or extrapulmonary. In certain embodiments the site of infection is unknown.",
                "In certain embodiments of the invention the sample provided in step (i) of the methods of the first aspect of the invention is a blood sample, preferably a peripheral blood mononuclear cell (PBMC) sample. Alternatively, a bronochoalveolar lavage (BAL) or cerebral spinal fluid (CSF) sample may be used.",
                "In certain embodiments of the invention, the method is 70-100% sensitive and/or 80-100% specific. In one embodiment the method is 100% sensitive and/or 93% specific. Sensitivity and specificity are calculated using receiver operator curve analysis. This calculates a range of sensitivity and specificities depending on which percentage cut-off is drawn e.g. for a cut-off of >19.05% MTB-specific TNF-α only secreting cells that are CD45RA-CCR7-CD127- sensitivity is 83.3% and specificity is 100%.",
                "In certain embodiments of the invention an additional step in the method of the first aspect of the invention is first performed in order to determine that the sample of cells is either infected with MTB or is obtained from a subject infected with MTB.",
                "For example, this additional first step may be performed using an ELISpot (Enzyme-Linked Immunosorbent Spot) platform. IGRA (interferon-gamma release assays), Immune based assays, tuberculin skin tests and/or Quantiferon can also be used.",
                "In a second aspect of the invention there is provided a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, CCR7 and CD127 and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, CCR7 and CD127.",
                "In other words, the composition as a whole is able to bind to each of CD4, CCR7 and CD127 and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CD4, CCR7 and CD127.",
                "In one embodiment the plurality of antibodies or antigen-binding fragments thereof additionally binds to each of TNF-α and IFN-γ and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for each of TNF-α, and IFN-γ.",
                "In other words, the composition as a whole is able to bind to each of CD4, CCR7, CD127, TNF-α, and IFN-γ and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CD4, CCR7, CD127, TNF-α, and IFN-γ.",
                "In a third aspect of the invention there is provided a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, TNF-α and IFN-γ and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, TNF-α, and IFN-γ.",
                "In a fourth aspect of the invention there is provided a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CCR7 and CD127 and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CCR7 and CD127.",
                "In certain embodiments, the plurality of antibodies or antigen-binding fragments of the compositions of the second, third or fourth aspects is additionally able to bind to one or more of CD3, CD8, CD45RA, IL-2 and/or dead cells and the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for the one or more of CD3, CD8, CD45RA, IL-2 and/or dead cells.",
                "In a preferred embodiment, the plurality of antibodies or antigen-binding fragments of the compositions of the second, third or fourth aspects is additionally able to bind to CD45RA and the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD45RA.",
                "In a preferred embodiment, the plurality of antibodies or antigen-binding fragments of the compositions of the second, third or fourth aspects is additionally able to bind to IL-2 and the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for IL-2.",
                "In a preferred embodiment, the plurality of antibodies or antigen-binding fragments of the compositions of the second, third or fourth aspects is as a whole additionally able to bind to CD3 and the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD3.",
                "The antigen-binding fragment may be selected from the group consisting of Fv fragments (e.g. single chain Fv and disulphide-bonded Fv), Fab-like fragments (e.g. Fab fragments, Fab′ fragments and F(ab)2 fragments), single variable domains (e.g. VH and VL domains) and domain antibodies (dAbs, including single and dual formats [i.e. dAb-linker-dAb]).",
                "Also included within the scope of the invention are modified versions of antibodies and an antigen-binding fragments thereof, e.g. modified by the covalent attachment of polyethylene glycol or other suitable polymer.",
                "Methods of generating antibodies and antibody fragments are well known in the art. For example, antibodies may be generated via any one of several methods which employ induction of in vivo production of antibody molecules, screening of immunoglobulin libraries (Orlandi. et al, 1989. Proc. Natl. Acad. Sci. U.S.A. 86:3833-3837; Winter et al., 1991, Nature 349:293-299) or generation of monoclonal antibody molecules by cell lines in culture. These include, but are not limited to, the hybridoma technique, the human B-cell hybridoma technique, and the Epstein-Barr virus (EBV)-hybridoma technique (Kohler et al., 1975. Nature 256:4950497; Kozbor et al., 1985. J. lmmunol. Methods 81:31-42; Cote et al., 1983. Proc. Natl. Acad. Sci. USA 80:2026-2030; Cole et al., 1984. Mol. Cell. Biol. 62:109-120).",
                "Suitable monoclonal antibodies to selected antigens may be prepared by known techniques, for example those disclosed in “Monoclonal Antibodies: A manual of techniques”, H Zola (CRC Press, 1988) and in “Monoclonal Hybridoma Antibodies: Techniques and Applications”, J G R Hurrell (CRC Press, 1982).",
                "Antibody fragments can be obtained using methods well known in the art (see, for example, Harlow & Lane, 1988, “Antibodies: A Laboratory Manual”, Cold Spring Harbor Laboratory, New York). For example, antibody fragments according to the present invention can be prepared by proteolytic hydrolysis of the antibody or by expression in E. coli or mammalian cells (e.g. Chinese hamster ovary cell culture or other protein expression systems) of DNA encoding the fragment. Alternatively, antibody fragments can be obtained by pepsin or papain digestion of whole antibodies by conventional methods.",
                "In certain embodiments the plurality of antibodies or antigen-binding fragments thereof is fixed to a solid support.",
                "In certain embodiments the antibodies or antigen-binding fragments thereof with a particular specificity are separately detectable to those with a different specificity.",
                "In other words an antibody or antigen-binding fragment thereof which is specific for a particular target can be detected as a separate entity to an antibody or antigen-binding fragment thereof which is specific for a different target. In this context ‘target’ refers to any of CD3, CD4, CD8, CD45RA, CCR7, CD127, TNF-α, IFN-γ or IL-2.",
                "In a preferred embodiment the antibodies or antigen-binding fragments thereof are visually detectable.",
                "The antibodies or antigen-binding fragments thereof may be labelled in order to allow their detection. For example, they may be labelled with a fluorescent label (e.g. a fluorophore) or with a radio label.",
                "Multiple examples of suitable labels such as fluorophores are well known in the art.",
                "Fluorophores of interest include, but are not limited to fluorescein dyes (e.g. fluorescein dT, 5-carboxyfluorescein (5-FAM), 6-carboxyfluorescein (6-FAM), 2′,4′,1,4,-tetrachlorofluorescein (TET), 2′,4′,5′,7′,1,4-hexachlorofluorescein (HEX), and 2′,7′-dimethoxy-4′,5′-dichloro-6-carboxyfluorescein (JOE)), cyanine dyes such as Cy5, dansyl derivatives, rhodamine dyes (e.g. tetramethyl-6-carboxyrhodamine (TAMRA), ATTO dyes (such as ATTO 647N) and tetrapropano-6-carboxyrhodamine (ROX)), DABSYL, DABCYL, cyanine, such as Cy3, anthraquinone, nitrothiazole, and nitroimidazole compounds, or other non-intercalating dyes.",
                "Preferred possible fluorophores include, amongst others, BD Horizon™ violet laser dyes e.g. BD Horizon™ V450, Alexa Fluor ® dyes e.g. Alexa Fluor ® 488, Fluorescein isothiocyanate (FITC), R-phycoerythrin (PE), PECy™5, PerCP, PerCPCy™5.5, PE-Cy™7, Allophycocyanin (APC), APC-Cy™7,APC-H7, Qdot dyes e.g. Qdot 605.",
                "Particularly preferred fluorophores include, but are not limited to PE-CF594, AF700, QDot605, Qdot655, PE-Cy7, PerCP-Cy5.5, APC-Cy7, BV570, V450, PE, FITC, APC, Biotin, PE-Cy5.",
                "Exemplary fluorophores are used as in the following antibodies used in the methods described herein: LIVE/DEAD® Fixable Dead Cell Stain Kits, aqua, (Invitrogen), CD3-APC-Alexa Fluor®750, CD4-Qdot®605, CD45RA-Qdot®655 (Invitrogen), CD8-APC, CCR7-PE-Cy™7, CD127-FITC (BD Biosciences), PD-1-PerCP/Cy5.5 (Biolegend). IFN-γ-V450, IL-2-PE and TNF-α-AlexaFluor 700 (BD Biosciences)",
                "As used herein, “fluorophore” (also referred to as fluorochrome) refers to a molecule that, when excited with light having a selected wavelength, emits light of a different wavelength.",
                "In a third aspect of the invention the composition of the second aspect is for use in diagnosing an active or latent TB infection.",
                "In a fourth aspect of the invention the composition of the second aspect is for use in treating a TB infection wherein the use comprises identifying if an individual has an active or latent TB infection and subsequently administrating the most appropriate treatment for that infection. For example, if the individual is shown to have active TB, then treatment appropriate for treating active TB will be administered.",
                "In a fifth aspect of the invention there is provided a method of treating a subject infected with TB comprising:\n\n\n- - (a) conducting the method of any previous claim; and\n  - (b) administrating the most appropriate treatment to the subject\n    depending on the outcome of the step (a)",
                "For example, if the individual is shown by step (a) to have an active TB infection, then a treatment appropriate for treating active TB will be administered in step (b). As an alternative example, if the individual is shown by step (a) to have a high risk of progressing from a latent TB infection to active TB, then an appropriate treatment will be administered in step (b) (e.g. a treatment for treating active TB will be administered in step (b)).",
                "As a further example, an individual co-infected with HIV could be recommended to start highly active antiretroviral therapy (HAART) if shown to have LTBI.",
                "In a sixth aspect of the invention there is provided a kit for determining tuberculosis (TB) infection status in an individual comprising:\n\n\n- - (i) a composition comprising a plurality of antibodies or\n    antigen-binding fragments thereof that binds to each of CD4, CCR7\n    and CD127 and wherein the plurality comprises antibodies or\n    antigen-binding fragments thereof that are individually specific for\n    each of CD4, CCR7 and CD127;\n  - (ii) a composition comprising a plurality of antibodies or\n    antigen-binding fragments thereof that binds to each of TNF-α and\n    IFN-γ and wherein the plurality comprises antibodies or\n    antigen-binding fragments thereof that are individually specific for\n    each of TNF-α, and IFN-γ; and\n  - (iii) instructions for use.",
                "In other words, the composition (i) of the kit is a composition which as a whole is able to bind to each of CD4, CCR7 and CD127 and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CD4, CCR7 and CD127; and the composition (ii) of the kit is a composition which as a whole is able to bind to each of TNF-α, and IFN-γ and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of TNF-α, and IFN-γ.",
                "In a seventh aspect of the invention there is provided a kit for determining tuberculosis (TB) infection status in an individual comprising:\n\n\n- - (i) a composition comprising a plurality of antibodies or\n    antigen-binding fragments thereof that binds to each of CD4, TNF-α\n    and IL-2 and wherein the plurality comprises antibodies or\n    antigen-binding fragments thereof that are individually specific for\n    each of CD4, TNF-α and IL-2;\n  - (ii) a composition comprising a plurality of antibodies or\n    antigen-binding fragments thereof that binds to each of CCR7 and\n    CD127 and wherein the plurality comprises antibodies or\n    antigen-binding fragments thereof that are individually specific for\n    each of CCR7 and CD127; and\n  - (iii) instructions for use.",
                "In other words, the composition (i) of the kit is a composition which as a whole is able to bind to each of CD4, TNF-α and IL-2 and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CD4, TNF-α and IL-2; and the composition (ii) of the kit is a composition which as a whole is able to bind to each of CCR7 and CD127 and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CCR7 and CD127.",
                "In an eighth aspect of the invention there is provided a kit for determining tuberculosis (TB) infection status in an individual comprising:\n\n\n- - (i) a composition comprising a plurality of antibodies or\n    antigen-binding fragments thereof that binds to each of CD4, CCR7,\n    CD127, TNF-α and IFN-γ and wherein the plurality comprises\n    antibodies or antigen-binding fragments thereof that are\n    individually specific for each of CD4, CCR7, CD127, TNF-α and IFN-γ;\n    and\n  - (ii) instructions for use.",
                "In other words, the composition (i) of the kit is a composition which as a whole is able to bind to each of CD4, CCR7, CD127, TNF-α, and IFN-γ and comprises antibodies or antigen-binding fragments thereof that are individually able to bind only one of CD4, CCR7, CD127, TNF-α, and IFN-γ.",
                "In certain embodiments of the kit of the sixth, seventh and eight aspects, the plurality of antibodies or antigen-binding fragments of the composition of (i) and/or (ii) is additionally able to bind to one or more of CD3, CD8, CD45RA, IL-2 and/or dead cells and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for the one or more of CD3, CD8, CD45RA, IL-2 and/or dead cells.",
                "In certain embodiments of the kit of the sixth, seventh and eight aspects, the plurality of antibodies or antigen-binding fragments of the composition of (i) and/or (ii) is additionally able to bind to CD45RA and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD45RA.",
                "In certain embodiments of the kit of the sixth, seventh and eight aspects, the plurality of antibodies or antigen-binding fragments of the composition of (i) and/or (ii) is additionally able to bind to CD3 and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD3.",
                "In certain embodiments of the kit of the sixth, seventh and eight aspects, the plurality of antibodies or antigen-binding fragments of the composition of (i) and/or (ii) is additionally able to bind to IL-2 and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for IL-2.",
                "In certain embodiments the kit of the sixth and seventh aspects additionally comprises one or more TB antigens, a live and/or dead cell discriminator, and/or a positive control.",
                "Example TB antigens are described above. Example dead cell discriminators (e.g. dead cell markers) are described above.",
                "Example positive controls include PMA-lonomycin for stimulating the sample, PMA plus calcium ionophore, lipopolysaccharide(LPS), staphylococcal enterotoxin B (SEB), Anti CD3 plus Anti CD28, phytohemagglutinin (PHA). Activated human cell sets that have been screened for cytokine production may also be used.",
                "One particular exemplary kit may include one or more of the following components:",
                "a) Positive control, test antigen",
                "b) Dead cell discriminator",
                "c) Cocktail of cell surface fluorophore-conjugated antibodies",
                "d) Fixing and permeabilising buffer",
                "e) Cocktail of intracellular fluorophore-conjugated antibodies",
                "f) Wash buffer(s)",
                "g) Test plate",
                "(optional h) compensation beads",
                "In an eighth aspect of the invention there is provided the use of a kit of the sixth or seventh aspect in a method of the first aspect.",
                "Definitions and Abbreviations",
                "By “CD3”, “CD4” and “CD8” we refer to cluster of differentiation 3, 4 and 8, respectively.",
                "By “CCR7” we refer to C-C chemokine receptor 7",
                "By “CD127” we refer to cluster of differentiation 127, also known as interleukin-7 receptor alpha.",
                "By “CD45RA” we refer to cluster of differentiation 45 RA isoform.",
                "By “IFN-γ” we refer to interferon-gamma.",
                "By “IL-2” we refer to interleukin-2.",
                "By “TNF-α” we refer to tumour necrosis factor-alpha.",
                "By “+” we mean positive. In other words the particular immunological molecule/marker the + is associated with is present.",
                "By “−” we mean negative. In other words the particular immunological molecule/marker the − is associated with is absent.",
                "By “antibody” we include substantially intact antibody molecules, as well as chimaeric antibodies, humanised antibodies, human antibodies (wherein at least one amino acid is mutated relative to the naturally occurring human antibodies), single chain antibodies, bispecific antibodies, antibody heavy chains, antibody light chains, homodimers and heterodimers of antibody heavy and/or light chains, and antigen binding fragments and derivatives of the same.",
                "By “antigen-binding fragment” we mean a functional fragment of an antibody that is capable of binding to a particular antigen.",
                "The term “individual” encompasses all organisms. Examples of those organisms include mammals such as humans, cows, badgers, dogs, cats, goats, sheep, and pigs. Preferably the individual is human.",
                "Examples embodying an aspect of the invention will now be described with reference to the following figures in which:",
                "FIG. 1 shows the Frequency of IFN-γ and TNF-α Secreting CD4+ and CD8+ Cell Subsets are Increased in ATB",
                "(A) Example gating strategy for the CD4+ TNF-α-only-secreting subset using representative plots from an individual with ATB whose cells were stimulated overnight with PPD is shown. Cells were gated on live singlets (not shown) and CD3+CD4+ cells (top row), then according to IFN-γ, IL-2 and TNF-α expression using FMOs (middle row). Boolean gating was used to define individual non-overlapping functional subsets, for example the TNF-α-only subset which did not express IFN-γ or IL-2 (bottom row).",
                "Graphs show frequency and median of CD4+ (B) and CD8+ (C) cells secreting IFN-γ and TNF-α in response to overnight stimulation with PPD or RD1-peptides in participants with ATB versus LTBI. Those with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "FIG. 2 Shows the Cell Surface Phenotype of CD4+ Cell Functional Subsets is Influenced by TB Disease Stage",
                "CD4+ cell functional subsets were examined for CD45RA and CCR7 expression in active versus LTBI in those with a positive response.",
                "(A) An example gating strategy for a PPD-specific CD4+ IFN-γ-only secreting subset is demonstrated using representative plots from an individual with ATB. Each CD3+CD4+ (top row) functional subset e.g. IFN-γ-only-secreting cells (middle row) was analysed for expression of CD45RA and CCR7 (bottom row).",
                "(B) Graphs show the percentage (and median percentage) of PPD-stimulated CD4+ IFN-γ-only (page 7/22), TNF-α-only (page 8/22) and IL-2-only (page 9/22) cells that were CD45RA-CCR7+ (TCM) (top chart) and CD45RA-CCR7− (TEM) (bottom chart) in patients with ATB and LTBI. The first two pages are representative of changes observed in active versus LTBI in all MTB-specific (responding to PPD and RD-1-peptides) CD4+ functional subsets except IL-2-only-secreting cells. Those with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "FIG. 3 Shows the Percentage of MTB-Specific CD4+ Functional T-Cell Subsets Expressing CD127 is Influenced by Stage of TB Infection and CD4 Count",
                "CD3+CD4+ functional cell subsets were examined for CD127 expression.",
                "(A) A representative gating strategy is shown. PBMCs from an individual with LTBI infection were stimulated overnight with PPD, and CD3+CD4+ cells (top row) were gated for cytokine secretion e.g. IFN-γ-only-secreting subset (middle row) and analysed for expression of CD127 (bottom row).",
                "(B) Graphs show percentage (and median percentage) of cells expressing CD127 from positive responders in CD4+ IFN-γ-only- (top row), TNF-α-only- (middle row) and IFN-γ- and TNF-α-dual-secreting (bottom row) cell subsets following stimulation with PPD (page 11/22) and RD1-peptides (page 12/22) in ATB and LTBI. Patients with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "(C) Graphs show correlations of CD4 cells/pi with the percentage of CD4+ PPD-specific cells secreting all three cytokines (top left), IFN-γ-only (top right), TNF-α and IL-2 (bottom left) and TNF-α-only (bottom right) that expressed CD127 in patients with HIV co-infection. Patients with TB (filled circles) and LTBI (open circles) are indicated. Spearman's rank correlation coefficient, corresponding p values and lines of best fit are shown.",
                "FIG. 4 Shows Combining Functional Subset Analysis with Memory Phenotype Reveals a Potentially Powerful Biomarker to Distinguish Active and LTBI",
                "Boolean gating was used to analyse the percentage of PPD-specific CD4+ TNF-α-only-secreting cells that had the phenotype TEFF (CD45RA-CCR7-CD127-) in active and LTBI.",
                "A representative gating strategy is shown for individuals with ATB (A) and LTBI (B). (C) Graphs at the top of each page show the percentage (and median percentage) of PPD or RD-1 peptide-specific CD4+ TNFα-only and IFNγ-only cells from responders that were TEFF. Cut off values for distinguishing ATB from LTBI are shown as dotted lines, and corresponding ROC curves are shown in bottom chart on each page. A cut off of 17.3% of TNF-α-only cells of TEFF phenotype distinguished ATB from LTBI with 100% sensitivity (95% CI 73.5-100.0) and 92.9% specificity (95% CI 66.1-99.8) (table 2). In ROC analysis, area under the curve was 0.99 (95% CI 0.97-1.01; p<0.0001) (FIG. 4C). A cut off of 34.5% for PPD-specific IFN-γ-only cells gave a sensitivity of 100% (95% CI 73.5 to 100.0) and specificity of 84.2% (95% CI 60.42-96.6); a cut off of 33.8% for RD-1-specific TNF-α-only cells gave a sensitivity of 100% (95% CI 54.07 to 100.0) and specificity of 75.0% (95% CI 34.91 to 96.8); and a cut off of 49.3% of RD-1-specific IFN-y-only cells gave a sensitivity of 100% (95% CI 66.4-100.0) and specificity of 75.0% (95% CI 42.8-94.5).",
                "(D) Graphs show the percentage (and median percentage) of PPD-specific CD4+ TNFα-only and IFNγ-only cells that were TEFF in patients with extrapulmonary TB (EPTB) and pulmonary TB (PTB). Patients with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "FIG. 5 Shows There Was No Difference in the Frequency of Tri-Functional Cells Between Those with ATB or LTBI or HIV-Infected Versus Uninfected Responding to PPD (Top Row) or RD-1 Peptides (Bottom Row)",
                "Patients with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "FIG. 6 Shows There Was No Difference in the Proportion of Any CD4+ Functional Subsets That Were TCM Except for RD-1-Peptides-Specific Cells Secreting IFN-γ Only (Top Row) and TNF-α and IL-2 (Bottom Row)",
                "Patients with HIV co-infection (filled circles) and without HIV co-infection (open circles) are indicated. Results were analysed by Mann Whitney U test; and p values of <0.05 were considered significant.",
                "FIG. 7 Shows the Inverse Correlation of the Proportion of PPD-Specific or ECR-Specific TNF-α-Only T Cells that are CD45RA-CCR7-CD127- with Time Since Exposure to TB",
                "Proportion of (a) PPD-specific and (b) ECR-specific TNF-α-only T cells that are CD45RA-CCR7-CD127- against estimated time since TB exposure. Results were analysed by Spearman's Rank Correlation Coefficient."
            ],
            "subsections": [
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "Methods Used in the Examples",
                        "Participants were prospectively enrolled from three clinical centres in London, UK during the period January 2008-February 2011 under National Research Ethics Service approval (07/H0712/85). Participants were ≧18 years, provided written, informed consent and were eligible if under clinical investigation for ATB (active TB), undergoing LTBI (latent tuberculosis infection) screening or had recognised TB risk factors e.g. known TB contact.",
                        "Suspected ATB was confirmed microbiologically by the clinical diagnostic laboratory. LTBI was defined as a positive response to RD-1 antigens in either T-SPOT.TB (carried out in routine clinical work up) or MTB IFN-γ ELISpot (carried out for the current study) in the absence of symptomatic, microbiological or radiological evidence of ATB.",
                        "Presence of HIV infection was confirmed by 3rd or 4th generation sero-assay performed by the clinical diagnostic laboratory and using HIV-1 type specific EIA, according to national standards. HIV viral load (VL) and CD4 T-lymphocyte counts were assayed in the local Clinical Pathology Association-accredited diagnostic laboratories at the time of study recruitment. HIV diagnostics were available for all patients with ATB (in line with the national screening policy) and the majority of those with LTBI; the remainder had no risk factors for HIV and normal CD4:CD8 lymphocyte ratios, and were classified as HIV-uninfected.",
                        "The demographic characteristics of the study population are shown in Table 1.",
                        "IFN-γ MTB ELISpot",
                        "Fresh or frozen peripheral blood mononuclear cells (PBMCs), 2.5×105 per well, were stimulated overnight (37° C., 5% CO2, 16-20 h) in an IFN-γ ELISpot plate (Mabtech) with phytohemagglutinin (PHA; positive control; Sigma-Aldrich), Tuberculin Purified Protein Derivative (PPD; Statens Serum Institute) or pools of MTB-specific 15-mer overlapping peptides covering each of ESAT-6, CFP-10, EspC, TB7.7, Rv3879c, Rv3873 and Rv3878. Unstimulated cells were used as a negative control. The IFN-γ ELISpot assay was performed as previously described (Dosanjh DP et al. Ann Intern Med 2008; 148:325-36).",
                        "Intracellular cytokine staining and polychromatic flow cytometry: Thawed PBMCs (3-5×106 per well) were cultured for 16 h (37° C., 5% CO2) in 10% human serum (Sigma-Aldrich) in RPMI-1640 (Sigma-Aldrich) at a concentration of 1×107 cells/ml. Cells were stimulated with PMA-lonomycin (positive control); (Sigma-Aldrich; 500 ng/ml final concentration), PPD (16.7 μg/ml final concentration) or a cocktail of peptides spanning the length of three highly immunodominant MTB-specific RDI-associated antigens, ESAT-6, CFP-10 and EspC (10 μg/ml final concentration per peptide) (Millington K A et al. Proc Natl Acad Sci USA 2011; 108:5730-5). Unstimulated cells were used as a negative control.",
                        "After two hours, monensin (2 μM final concentration) was added. Following stimulation, cells were washed and stained with a dead cell marker (LIVE/DEAD® Fixable Dead Cell Stain Kits, aqua, Invitrogen) for 30 minutes at 4° C. in phosphate buffered saline (PBS). Cells were then washed in PBS and placed in FC block buffer (10% human serum in filtered FACS solution (0.5% bovine serum albumin and 2 mM EDTA in PBS)) for 20 minutes at 4° C. before staining with a pre-titrated and optimised antibody cocktail with fluorochrome-conjugated antibodies against CD3-APC-Alexa Fluor®750, CD4-Qdot®605, CD45RA-Qdot®655 (Invitrogen), CD8-APC, CCR7-PE-CyTM7, CD127-FITC (BD Biosciences) and PD-1-PerCP/Cy5.5 (Biolegend). After washing, the cells were fixed and permeabilised using BD Cytofix/Cytoperm™ Fixation/Permeabilization kit (BD Biosciences) for 20 minutes at 4° C. The cells were washed twice with Perm/Wash solution (BD Biosciences) then stained with pre-titrated fluorochrome-conjugated antibodies in Perm/Wash solution with IFN-γ-V450, IL-2-PE and TNF-α-AlexaFluor 700 (BD Biosciences) for 30 minutes at 4° C. 1×106 events (where possible) were acquired straightaway using a BD LSR-II flow cytometer. Anti-Rat and Anti-Mouse Ig compensation beads (BD Biosciences) were used to set compensation parameters. Fluorescence minus one (FMO) controls were used in each experiment to set gates.",
                        "Data Analysis and Thresholds",
                        "The data was analysed on FlowJo version 9.4.4 ©TreeStar, Inc. Events were gated on live cells, singlets and lymphocytes using forward and side scatter properties. CD3+CD4+ and CD3+CD8+ subsets were defined. Gating controls were used to define IFN-γ, IL-2 and TNF-α responses and surface marker expression.",
                        "For phenotypic analysis of MTB-specific cells, only participants with a positive response were included. Positive responders were defined as those with a response that was ≧2 times the background (in unstimulated but fully stained samples) and >0.001% of CD3+CD4+ or CD3+CD8+ cells. This cut-off was used because we did not use co-stimulation to enhance responses, and we normalised to background (unstimulated) data before applying the cut-off (rather than classifying background as negligible). A strict cut-off meant only antigen-specific cells were included in the phenotypic analysis.",
                        "Statistical Analysis",
                        "Statistical analysis was conducted using IBM SPSS Statistics version 20 and GraphPad Prism version 5.00 for Mac OS X, GraphPad Software, California USA. TB disease stage compared all TB (n=13) vs. all LTBI (n=21) regardless of HIV status, the impact of HIV compared all HIV-infected (n=17) vs. uninfected (n=17) regardless of TB disease stage and across all four subgroups. The 2-tailed Mann-Whitney U test was used for non-parametric two-sample comparisons. Spearman's rank correlation coefficients were used to test correlations. Receiver operator characteristic (ROC) curve defined the sensitivity and specificity of the diagnostic approach."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**The Frequency of CD4+ and CD8+ Cells with an IFN-γ and TNF-α+ Response was Increased in ATB**",
                                "We first examined the frequency of CD4+ and CD8+ functional effector cell subsets. Boolean gating was used to create individual non-overlapping subsets by combining data in 3 dimensions (FIG. 1A). The frequency of PPD-specific CD4+ IFN-γ-only, TNF-α-only and IFN-γ/TNF-α-dual-secreting cells was higher in ATB compared with LTBI (p=0.003, 0.002 and 0.002, respectively) (FIG. 1B). A similar relationship was seen for RDI-peptide-specifc CD4+ IFN-γ-only-secreting cells (not significant; data not shown), and IFN-γ/TNF-α-dual-secreting cells (p=0.017) (FIG. 1B).",
                                "The presence of HIV-infection was not associated with an altered frequency of these cell subsets. We observed no difference in the frequency of tri-functional cells in patients with ATB compared with those with LTBI (FIG. 5).",
                                "The majority of participants with ATB, but not LTBI, had a CD8+ IFN-γ response (PPD: 12/13 for ATB vs 6/21 for LTBI, RDI-peptides: 10/13 for ATB vs 11/21 for LTBI). The frequencies of PPD- and RDI-peptide-specific CD8+ IFN-γ-only-producing cells were significantly higher in ATB than in LTBI (p=0.017 and 0.016, respectively), as was the frequency of CD8+ PPD-specific cells secreting both IFN-γ and TNF-α (p=0.013) (FIG. 1C).",
                                "HIV co-infection was (non-significantly) associated with a reduced frequency of PPD-specific IFN-γ/TNF-α-dual and TNF-α-only responses in ATB compared with HIV-negativity (p=0.051 for both). In the HIV-uninfected TB group the percentages of these PPD-specific CD8+ cells were significantly higher than in LTBI (p=0.008 and 0.022 respectively).",
                                "Similarly the frequency of cells secreting IFN-γ-only were significantly higher in ATB compared with LTBI in HIV-uninfected (p=0.023). These CD8+ effector functional subsets were therefore related to mycobacterial load analogously to equivalent CD4+ subsets but the impact of HIV co-infection was more profound."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "examine frequency of CD4+ and CD8+ cells with IFN-γ and TNF-α+ response",
                                "compare ATB and LTBI responses",
                                "analyze impact of HIV co-infection"
                            ],
                            "num_characters": 1971,
                            "outline_medium": [
                                "analyze frequency of CD4+ and CD8+ cells with IFN-γ and TNF-α+ response in ATB"
                            ],
                            "outline_short": [
                                "analyze frequency of CD4+ and CD8+ cells with IFN-γ and TNF-α+ response in ATB"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**PPD-Specific and RD1-Peptide-Specific CD4+ Cellular Differentiation was Increased in ATB Versus LTBI**",
                                "We analysed the memory phenotype of the CD4+ functional subsets as putative correlates of mycobacterial pathogen load. Non-responders were excluded. Each T-cell functional subset was gated for expression of CD45RA and CCR7 (FIG. 2A). Memory phenotypes of functional subsets were defined as naive CD45RA+CCR7+, central memory (TCM) CD45RA-CCR7+, effector memory (TEM) CD45RA-CCR7− and CD45RA+ effectors (TEMRA) CD45RA+CCR7−. This last subset was mainly evident in CD8+ cells.",
                                "PPD- and RD1-peptide-specific CD4+ cell effector functional subsets were principally TCM in LTBI compared to TEM in ATB, for example fewer PPD-specific CD4+ IFN-γ-only secreting cells were TCM in ATB compared with LTBI (p=0.005) (FIG. 2B). Comparisons of HIV-infected with uninfected patients were non-significant except for the CD4+ RD1-peptide-specific IFN-γ-only- and TNF-α/IL-2-dual-secreting subsets, fewer of which were TCM in HIV-infected than uninfected subjects (p=0.030 and 0.006) (FIG. 6).",
                                "In contrast to the CD4+ effector functional subsets, CD4+ IL-2-only PPD- (FIG. 2B) and RDI-peptide-specific cells (data not shown) were principally TCM in both ATB and LTBI and were therefore unaffected by TB disease stage. CD8+ IFN-γ-only cellular responses to PPD and RD1-peptides were mostly TEM and TEMRA (data not shown).",
                                "CD127 (IL7Rα) expression is reduced following antigen stimulation in effector T-cells (Schluns et al. Nat Rev Immunol 2003; 3:269-79.) and defines CD4+ and CD8+ subsets of differentiated murine T effector cells distinct from effector memory cells (Kaech et al. Nat Immunol 2003; 4:1191-8; Harrington et al. Nature 2008; 452:356-60). We therefore measured CD127 expression on antigen-specific CD4+ functional T-cell subsets (FIG. 3A).",
                                "A smaller percentage of PPD- and RDI-peptide-specific CD4+ cells expressed CD127 in ATB compared with LTBI, for example a lower percentage of PPD-specific CD4+ IFN-γ-only- and TNF-α-only-secreting cells expressed CD127 in ATB compared with LTBI (p<0.001 and p=0.003 respectively) (FIG. 3B). Expression of CD127 on antigen-specific cells was unaffected by HIV status (FIG. 3B).",
                                "However, in patients with HIV co-infection, frequencies of several subsets of PPD-specific T-cells expressing CD127 correlated with CD4 count (FIG. 3C). Similarly, for RD-1-peptide-specific cells, IFN-γ/IL-2-dual-producing cells expressing CD127 correlated with CD4 count (Rho=0.647; p=0.047) and HIV VL correlated inversely with IFN-γ-only (Rho=-0.780; p=0.013) and IFN-γ/TNF-α-dual-secreting CD127-expressing cells (Rho=-0.727; p=0.005) (data not shown)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "analyze memory phenotype of CD4+ functional subsets",
                                "define memory phenotypes",
                                "compare PPD- and RD1-peptide-specific CD4+ cell effector functional subsets",
                                "analyze impact of HIV co-infection",
                                "describe CD127 expression on antigen-specific CD4+ functional T-cell subsets"
                            ],
                            "num_characters": 2681,
                            "outline_medium": [
                                "examine memory phenotype of CD4+ functional subsets in ATB vs LTBI",
                                "analyze CD127 expression on antigen-specific CD4+ functional T-cell subsets"
                            ],
                            "outline_short": [
                                "analyze memory phenotype of CD4+ functional subsets in ATB versus LTBI"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Expansion of Differentiated CD4+ Functional Effector T-Cells in ATB Versus LTBI**",
                                "We next investigated the potential of combined phenotypic and functional measurement as a clinical biomarker. We determined the percentage of PPD- and RD1-peptide-specific CD4+ cells secreting IFN-γ-only or TNF-α-only that were differentiated effector cells (TEFF; CD45RA-CCR7-CD127-) (FIGS. 4A (ATB) and B (LTBI)).",
                                "In ATB, compared with LTBI, a higher percentage of CD4+ cells secreting IFN-γ-only or TNF-α-only in response to PPD and RD1-peptides were TEFF. This was most significant for CD4+ PPD-specific CD4+ cells secreting TNF-α-only (p<0.0001) and IFN-γ-only (p<0.0001). A cut off of >17.3% of TNF-a-only cells of TEFF phenotype distinguished ATB from LTBI with 100% sensitivity (95% CI 73.5-100.0) and 92.9% specificity (95% CI 66.1-99.8) (Table 2).",
                                "In ROC analysis, area under the curve was 0.99 (95% CI 0.97-1.01; p<0.0001) (FIG. 4C). Similar although slightly less discriminatory ROC curves were generated for PPD-specific IFN-γ-only cells and for RD-1-specific cells (FIG. 4C).",
                                "To test whether this approach was robust to differences in disease site we compared individuals with active pulmonary (PTB) and extra-pulmonary disease (EPTB). We found no significant difference in the proportion of PPD-specific cells secreting IFN-γ-only, or TNF-α-only that were TEFF (FIG. 4D) when stratified by site of disease or HIV co-infection. There was also no difference in the proportion of RD-1 peptide-specific cells that were TEFF when stratified by disease site (data not shown).",
                                "The operator conducting analyses (KMP) was also involved in participant recruitment and therefore not blinded to patient categorization. To demonstrate integrity and reproducibility of the results, data for all study participants was re-gated and re-analysed by a second independent operator (HSW) who was blinded to patient diagnoses.",
                                "Correlations between results obtained by operators 1 and 2 for the percentage of CD3+CD4+ cells secreting TNF-α-only (Rho=0.97, p<0.0001), the percentage of CD3+CD4+ TNF-α-only-secreting cells that are CD127+ (Rho=0.96, p<0.0001) and the percentage of CD3+CD4+ TNF-α-only-secreting cells that are CD45RA-CCR7− (Rho=0.88, p<0.0001) were very strong. Using the 17.3% cut-off for TNF-α-only-secreting cells of TEFF phenotype to distinguish TB from LTBI, operator 2 misclassified 1 case of TB as LTBI, and 1 further case of LTBI as TB (data not shown)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "investigate combined phenotypic and functional measurement as clinical biomarker",
                                "determine percentage of PPD- and RD1-peptide-specific CD4+ cells secreting IFN-γ-only or TNF-α-only that",
                                "analyze ROC curve analysis",
                                "test robustness to differences in disease site"
                            ],
                            "num_characters": 2459,
                            "outline_medium": [
                                "investigate expansion of differentiated CD4+ functional effector T-cells in ATB vs LTBI",
                                "evaluate potential of combined phenotypic and functional measurement as a clinical biomarker"
                            ],
                            "outline_short": [
                                "investigate expansion of differentiated CD4+ functional effector T-cells in ATB versus LTBI"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Diagnosis of Infection with MTB**",
                                "ELISpot platforms such that use MTB-specific antigens such as the T-SPOT®. TB are a highly sensitive and highly specific method to demonstrate the presence of infection with MTB (Dinnes, Deeks et al. 2007). The antigens utilised are either encoded by or associated with the region of difference 1 (RD1) including ESAT-6, CFP-10, Rv3879c, Rv3873 and Rv3615c which are both specific and immunodominant for MTB infection (Dosanjh, Hinks et al. 2008) (Dosanjh, Bakir et al. 2011). This approach is now recommended by health protection organisations worldwide for the diagnosis of LTBI. The ELISpot platform has the following advantages\n\n\n- - a) Standardisation of cell number in each well, this is a\n    theoretical advantage in immunosuppression and data suggests that\n    this test retains sensitivity when used in HIV co-infected\n    individuals, unlike the TST (Chapman, Munkanta et al. 2002).\n  - b) Highly sensitive method of detection. This allows the use of\n    several MTB-specific antigens, which can be used to distinguish MTB\n    infection without confounding by prior BCG vaccination. Use of these\n    antigens in the flow cytometry method of Example 5 is also possible,\n    but responses can be too small to fully characterise. The most\n    sensitive platform as the initial screening assay is therefore\n    preferable to attain the highest diagnostic rate.",
                                "Method:\n\n\n- - 1. Take 5-10 mls peripheral blood from the patient into a TSpot. TB\n    assay tube.\n  - 2. Separate out the peripheral blood mononuclear cells.\n  - 3. Place the counted cells into a 96-well TSpot. TB plate with\n    negative control, positive control and test wells in duplicate.\n  - 4. Stimulate overnight with MTB-specific antigens.\n  - 5. Read on an AIDS ELISpot reader.\n  - 6. Stratify into positive and negative according to manufacturer's\n    predefined threshold.",
                                "This method of diagnosing MTB infection may preferably then be followed by the method described in Example 5."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe ELISpot platforms for diagnosis of MTB infection",
                                "outline advantages of ELISpot platform",
                                "describe method of diagnosing MTB infection using ELISpot"
                            ],
                            "num_characters": 2000,
                            "outline_medium": [
                                "describe diagnosis of infection with MTB using ELISpot platforms"
                            ],
                            "outline_short": [
                                "describe diagnosis of infection with MTB using ELISpot platforms"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Distinction of Active and Latent TB Infection and Indication of Mycobacterial Disease Activity**",
                                "Multi-parameter flow cytometry is a powerful tool for the interrogation of cellular immunity for measurement of responses to PPD, RD1, live or dead MTB and BCG. Simple flow cytometry procedures are used for monitoring in HIV infection (CD4 counts). Complex staining procedures are used for diagnostics of immune cancers such as leukaemia. There are currently no multi-colour flow cytometry assays for diagnostic use in the field of TB.",
                                "The test (which may preferably be performed as a second step after the test described in Example 4) measures a novel combination of cellular targets, not previously investigated simultaneously:\n\n\n- - 1. Dead cell marker (allows removal of dead cells from analysis)\n  - 2. Cluster of differentiation (CD) 3 fluorochrome-conjugated\n    antibody (identifies T-cells)\n  - 3. CD4 fluorochrome-conjugated antibody (identifies major T helper\n    cell subset)\n  - 4. C-C chemokine receptor 7 (CCR7) fluorochrome-conjugated antibody\n  - 5. CD127 also known as interleukin-7 receptor alpha\n    fluorochrome-conjugated antibody (this is particularly\n    under-investigated in TB)\n  - 6. Interferon-gamma (IFN-γ) fluorochrome-conjugated antibody\n  - 7. Interleukin-2 (IL-2) fluorochrome-conjugated antibody\n  - 8. Tumour necrosis factor-alpha (TNF-α) fluorochrome-conjugated\n    antibody\n  - 9. CD45RA fluorochrome-conjugated antibody (loss of this marker\n    identifies experienced T-cell memory subset, this may be dispensable\n    in the final assay)\n  - 10. CD8 fluorochrome-conjugated antibody (identifies major\n    T-cytotoxic cell subset, this marker may be dispensable in the final\n    assay)",
                                "This method quantifies the proportion of live CD3+CD4+ cells secreting TNF-α or IFN-γ that do not express CD45RA, CCR7 or CD127 (effector phenotype). This is to distinguish active from latent infection and stratify those at risk of progression to active TB. The higher the percentage of TNF-α-only secreting cells that have this effector phenotype, the higher the likelihood that a patient has active TB (higher threshold) or risk of progression to active TB (lower threshold). The combined measurement of these MTB-specific phenotype and function markers and test-specific approach to flow cytometry data analysis has not previously been described.",
                                "Method:\n\n\n- - 1. Take 30 mls whole blood from the patient with a positive response\n    from the test described in Example 1. (This could be done\n    simultaneously with the step 1 phlebotomy).\n  - 2. Separate PBMCs using Ficoll-Paque solution.\n  - 3. Take 3-5 million cells per well and leave unstimulated (negative\n    control) or stimulate for 16 hours with mitogen (positive control)\n    and purified protein derivative (PPD) in duplicate. After 2 hours\n    add a golgi apparatus blocking compound e.g. Monensin.\n  - 4. Stain cells with a live cell marker then with a cocktail of cell\n    surface marker fluorochrome-conjugated antibodies.\n  - 5. Fix and permeabilise cells and stain with a cocktail of\n    intracellular cytokine fluorochrome-conjugated antibodies.\n  - 6. Acquire at least 1 million events per well on a flow cytometer\n  - 7. Analyse data using a gating strategy specific for this test with\n    flow cytometry software package e.g FlowJo, Treestarinc.",
                                "Discussion of Results of Examples 1-3",
                                "Our detailed interrogation of antigen-specific T-cell phenotype and function has delineated the association of TB disease stage with MTB-specific cellular immunity. ATB was associated with an increased frequency of mono- or dual-functional CD4+ and CD8+ MTB-specific T-cells that secrete IFN-γ and/or TNF-α making these subsets potential biomarkers of disease activity.",
                                "Simultaneous evaluation of memory phenotype of responding cells provided a more sensitive and specific surrogate than CD4+ functional profile alone. Expression of CD45RA, CCR7 and CD127 on MTB-specific T-cells secreting only IFN-γ or TNF-α was lowest in those with ATB. Memory phenotype was not exclusively linked to the functional profile (except for IL-2-only cells which were mainly TCM) but was closely related to underlying TB stage. These markers might therefore serve as indicators of TB activation.",
                                "Combined measurement of both functional profile and differentiation phenotype provided a highly discriminatory immunological read-out for ATB and LTBI. In those with ATB, >17.3% of PPD-specific CD4+ TNF-α-only-secreting cells were CD45RA-CCR7-CD127- and this phenotype was therefore strongly associated with activated infection. Given that responses to PPD are less specific for MTB infection than responses to RD-1 antigens, this PPD-specific T cell signature may be used to distinguish TB from LTBI in the second step of a two-step diagnostic testing strategy, where MTB infection has been ruled-in at step one by a positive result in an RD-1-based immunodiagnostic test (e.g. IGRA).",
                                "Our data shows that the frequency of CD8+ MTB-specific cells, and therefore proportion of responders, was increased in ATB and this approach holds promise for the discrimination of TB disease stage especially in HIV co-infection where all participants had a positive response to MTB peptides. This association precludes the comparison of combined function and phenotype of MTB-specific CD8+ cells, however, because non-responders were by default mainly in the LTBI group. Measurement of CD8+ functional subsets in ATB and LTBI was therefore not sufficiently discriminatory for active and LTBI in our cohort.",
                                "In this study we included individuals with HIV co-infection to compare and distinguish the impact of ATB on MTB-specific cellular immunity with the impact of HIV co-infection. Where CD4+ MTB-specific effector-like cells were influenced by TB disease stage, the impact of HIV co-infection per se was rarely significantly associated with these changes. This may have been partially due to the inclusion of patients who were treated for HIV infection.",
                                "However, in the case of CD127, stratification by CD4 count showed that the stage of HIV disease influenced expression of this marker on MTB-specific T-cells. Reduced CD127 expression on HV-specific CD8+ T-cells (reviewed in Crawley et al. Immunol Cell Biol 2011 Aug 23. doi: 10.1038/icb.2011.66) and CD4+ T-cells (Dunham R M, et al. J Immunol 2008; 180:5582-92) is observed with HIV disease progression, but a relationship between HIV disease progression and CD127 expression on MTB-specific T-cells has not previously been noted. Our finding indicates that in HIV co-infection, MTB-antigen-specific CD4+ cells lose CD127 expression with advancing HIV disease and are therefore potentially more differentiated. This effect could be directly virus-induced or secondary to increasing subclinical mycobacterial burden with advancing HIV infection.",
                                "Our cohort included individuals with both pulmonary and extra-pulmonary infection. HIV infection is more commonly associated with TB dissemination as evidenced by the widespread involvement in some of these individuals. Despite some variation in clinical phenotype of those with ATB, our biomarker reliably distinguished TB stage, regardless of site of disease, suggesting that it may remain robust across the clinical TB disease spectrum and therefore have wide applicability. No individuals with LTBI developed ATB during 12 months of follow-up suggesting that, in our cohort (recruited in a TB non-endemic area), subclinical TB was not present in those classified as LTBI. The lack of continuous exogenous priming or re-stimulation due to TB exposure distinguishes our cohort from others recruited from TB endemic areas and removes this is as a possible confounding effect on the immunological changes we observed.",
                                "Through dissection of the impact of varying TB stage as a surrogate for mycobacterial pathogen burden, with and without HIV co-infection, we have identified cellular changes that are highly sensitive to TB activity."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce multi-parameter flow cytometry",
                                "motivate need for TB diagnostic tool",
                                "describe novel combination of cellular targets",
                                "list cellular targets",
                                "explain method for measuring cellular targets",
                                "describe staining procedure",
                                "describe data analysis",
                                "discuss results of examples 1-3",
                                "associate TB disease stage with MTB-specific cellular immunity",
                                "evaluate memory phenotype of responding cells",
                                "discuss functional profile and differentiation phenotype",
                                "associate PPD-specific T cell signature with activated infection",
                                "discuss impact of HIV co-infection on MTB-specific cellular immunity",
                                "discuss expression of CD127 on MTB-specific T-cells",
                                "conclude applicability of biomarker across clinical TB disease spectrum"
                            ],
                            "num_characters": 7994,
                            "outline_medium": [
                                "introduce multi-parameter flow cytometry",
                                "describe novel combination of cellular targets",
                                "outline method for distinguishing active and latent TB infection",
                                "discuss results of examples 1-3",
                                "analyze association of TB disease stage with MTB-specific cellular immunity",
                                "discuss impact of HIV co-infection on MTB-specific cellular immunity",
                                "conclude on biomarker reliability and applicability"
                            ],
                            "outline_short": [
                                "motivate multi-parameter flow cytometry",
                                "describe novel combination of cellular targets",
                                "discuss results of examples 1-3"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Inverse Correlation with Time Since Estimated Exposure to TB**",
                                "In further work carried out amongst an entirely distinct cohort of HIV-uninfected individuals with latent TB infection (LTBI) (Table 3), the inventors have demonstrated that the immunological signature of the proportion of PPD-specific or ECR-specific TNF-α-only T cells that are CD45RA-CCR7-CD127-) inversely correlates with time since estimated exposure to TB (FIGS. 7(a) and (b)).",
                                "“ECR” refers to the combination of ESAT-6 and CFP-10 and Rv3615c (otherwise known as EspC). Each of these are antigens that are strongly and widely recognised by T cells in MTB-infected people but not in BCG-vaccinated, MTB-uninfected people. Hence, unlike PPD, ECR is a MTB-specific cocktail of T cell antigens.",
                                "This second cohort includes recent (<6 months) contacts of known pulmonary TB cases and individuals from high TB incidence countries who have been in the UK for at least 2 years with no known TB exposure within that time (‘remote’ contacts). For remote contacts, time since entry to the UK was used as a proxy measure for time since TB exposure. Given the far higher risk of progression to TB disease within the first few years following MTB infection, and the decline in risk over time thereafter, the inventor's novel T cell signature can stratify individuals with LTBI by their likelihood of developing disease."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce inverse correlation with time since estimated exposure to TB",
                                "describe immunological signature of PPD-specific or ECR-specific TNF-α-only T cells"
                            ],
                            "num_characters": 1379,
                            "outline_medium": [
                                "demonstrate inverse correlation with time since estimated exposure to TB"
                            ],
                            "outline_short": [
                                "demonstrate inverse correlation with time since estimated exposure to TB"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce study population",
                        "describe participant enrollment",
                        "define ATB and LTBI",
                        "confirm HIV infection",
                        "describe IFN-γ MTB ELISpot assay",
                        "outline intracellular cytokine staining and polychromatic flow cytometry",
                        "explain data analysis and thresholds",
                        "describe statistical analysis",
                        "introduce ROC curve analysis",
                        "outline compensation and gating controls",
                        "summarize data acquisition and analysis"
                    ],
                    "num_characters": 5799,
                    "outline_medium": [
                        "describe participant enrollment and selection",
                        "outline IFN-γ ELISpot assay and intracellular cytokine staining",
                        "detail data analysis and threshold settings",
                        "explain statistical analysis methods",
                        "introduce example analyses"
                    ],
                    "outline_short": [
                        "describe methods used in examples",
                        "detail experimental design and procedures"
                    ]
                }
            ],
            "outline_long": [
                "introduce tuberculosis infection status",
                "describe global TB statistics",
                "outline challenges in TB diagnosis",
                "describe limitations of current diagnostic tests",
                "motivate need for new diagnostic approach",
                "discuss importance of early and accurate diagnosis",
                "describe current treatment options and limitations",
                "highlight risks of misdiagnosis",
                "discuss potential of correlates of time since exposure for risk stratification",
                "summarize existing research on MTB-specific cellular immune response",
                "describe prior art in distinguishing active and latent TB",
                "highlight limitations of prior art",
                "introduce inventors' novel approach combining cellular phenotype and function",
                "describe results of inventors' approach",
                "highlight advantages of inventors' approach",
                "outline method of determining TB infection status",
                "describe steps of method",
                "define terms used in method",
                "describe optional steps of method",
                "outline preferred embodiments of method",
                "describe use of multi-parameter flow cytometry",
                "outline gating strategy for flow cytometry",
                "describe simplification of flow cytometry assay",
                "outline use of method for determining TB infection status",
                "describe use of method for distinguishing active and latent TB",
                "highlight advantages of method",
                "outline potential applications of method",
                "conclude description of invention",
                "describe TB infection status determination",
                "specify percentage values for active TB infection",
                "specify percentage values for latent TB infection",
                "determine risk of latent TB progressing to active TB",
                "correlate percentage value with risk of progression",
                "determine time elapsed since original TB infection",
                "correlate percentage value with time since infection",
                "describe TB status determination regardless of HIV status",
                "describe TB status determination regardless of infection site",
                "specify sample types for TB status determination",
                "specify sensitivity and specificity of method",
                "describe additional step for determining MTB infection",
                "introduce composition of antibodies for CD4, CCR7, and CD127",
                "specify additional binding capabilities of composition",
                "introduce composition of antibodies for CD4, TNF-α, and IFN-γ",
                "introduce composition of antibodies for CCR7 and CD127",
                "specify additional binding capabilities of compositions",
                "preferentially bind to CD45RA",
                "preferentially bind to IL-2",
                "preferentially bind to CD3",
                "conclude composition descriptions",
                "define antigen-binding fragments",
                "describe antibody generation methods",
                "summarize antibody fragment preparation methods",
                "introduce solid support fixation",
                "describe separate detectability of antibodies",
                "introduce visually detectable antibodies",
                "describe labeling methods",
                "list fluorophore examples",
                "define fluorophore",
                "introduce TB infection diagnosis",
                "describe TB infection treatment",
                "outline method of treating TB",
                "introduce kit for TB infection status determination",
                "describe kit composition",
                "outline kit instructions",
                "introduce additional kit components",
                "describe kit variations",
                "introduce positive control examples",
                "describe dead cell discriminator examples",
                "outline kit components",
                "define CD3, CD4, CD8, CCR7, CD127, IFN-γ, IL-2, TNF-α",
                "define antibody and antigen-binding fragment",
                "define individual",
                "introduce figure 1",
                "describe figure 1",
                "introduce figure 2",
                "describe figure 2",
                "introduce figure 3",
                "describe figure 3",
                "introduce figure 4",
                "describe figure 4",
                "introduce figure 5",
                "describe figure 5",
                "introduce figure 6",
                "describe figure 6",
                "introduce figure 7",
                "describe figure 7",
                "outline figure legends",
                "describe figure correlations",
                "conclude figure descriptions"
            ],
            "num_characters": 45911,
            "outline_medium": [
                "introduce tuberculosis infection status",
                "motivate need for accurate diagnosis",
                "describe limitations of current diagnostic tests",
                "highlight importance of early diagnosis",
                "discuss challenges in distinguishing active and latent TB",
                "summarize current approaches to TB diagnosis",
                "describe prior art in MTB-specific cellular immune response",
                "highlight limitations of prior art",
                "introduce inventors' novel approach to TB diagnosis",
                "describe method of determining TB infection status",
                "outline advantages of inventors' method",
                "provide definitions of terms used in the invention",
                "describe preferred techniques for identifying T-cell subsets",
                "outline embodiments of the invention",
                "define TB infection status",
                "determine active TB infection",
                "determine latent TB infection",
                "determine risk of latent TB progressing to active TB",
                "determine time elapsed since TB infection",
                "describe method independence of HIV status",
                "describe method independence of TB infection site",
                "specify sample types for method",
                "describe method sensitivity and specificity",
                "describe antibody compositions for method",
                "define antigen-binding fragments",
                "describe methods of generating antibodies",
                "list suitable monoclonal antibodies",
                "describe antibody fragments preparation",
                "introduce fluorophores",
                "list examples of fluorophores",
                "describe use of fluorophores",
                "introduce composition for diagnosing TB infection",
                "describe method of treating TB infection",
                "introduce kit for determining TB infection status",
                "describe components of kit",
                "introduce additional components of kit",
                "define abbreviations",
                "describe figures",
                "introduce figure 1",
                "introduce figure 2",
                "introduce figure 3",
                "introduce figure 4",
                "introduce figure 5",
                "introduce figure 6 and 7"
            ],
            "outline_short": [
                "introduce tuberculosis problem",
                "motivate need for better diagnostic test",
                "describe limitations of current diagnostic tests",
                "summarize prior art approaches",
                "highlight shortcomings of prior art approaches",
                "introduce inventors' novel approach",
                "describe advantages of inventors' approach",
                "define TB infection status",
                "determine TB infection status",
                "correlate TB infection status",
                "describe method embodiments",
                "describe composition embodiments",
                "define antigen-binding fragments",
                "describe methods of generating antibodies",
                "introduce fluorophores and labelling",
                "outline aspects of the invention",
                "describe kits for determining TB infection status",
                "provide definitions and abbreviations",
                "introduce figures and example gating strategies",
                "describe cell surface phenotypes and functional subsets",
                "show correlations and biomarkers for distinguishing ATB and LTBI",
                "provide additional figures and results"
            ]
        }
    ],
    "claims": [
        "1. A method of determining tuberculosis (TB) infection status in an individual comprising:\n(i) providing a sample comprising T-cells;\n(ii) exposing the sample of (i) to one or more TB antigens;\n(iii) identifying T-cells in the sample that are CD4 positive and (a) secrete TNF-α without secreting IFN-γ; or (b) secrete IFN-γ without secreting TNF-α;\n(iv) identifying those cells of (iii) which are also CCR7 and CD127 negative; and optionally\n(v) calculating the cells identified in (iv) as a percentage of those identified in (iii);\n\nwherein the identification of cells in (iv) and/or the percentage of cells calculated in (v) correlates to TB infection status of the individual, and wherein steps (iii) and (iv) can be carried out either sequentially or simultaneously.",
        "2. The method of claim 1 wherein the cells identified in step (iv) are additionally CD45RA negative.",
        "3. The method of claim 1 or 2 wherein the cells identified in step (iii) additionally do not secrete IL-2.",
        "4. The method of any previous claim wherein the cells identified in step (iii) are additionally CD3 positive.",
        "5. The method of any previous claim wherein the T-cells identified in step (iii) are identified as live T-cells, preferably by use of a dead cell marker.",
        "6. The method of any previous claim wherein the TB infection status determined by the method corresponds to the presence or absence of TB infection.",
        "7. The method of claim 6 wherein identifying one or more cells in step (iii) determines the presence of TB infection.",
        "8. The method of any previous claim wherein the TB infection status determined by the method corresponds to the presence of an active TB infection or a latent TB infection.",
        "9. The method of claim 8 wherein identification of cells in step (iv) corresponds to the presence of an active TB infection or a latent TB infection.",
        "10. The method of claim 9 wherein identifying one or more cells in step (iv) determines the presence of an active TB infection.",
        "11. The method of claim 9 wherein identifying no cells in step (iv) determines the presence of a latent TB infection.",
        "12. The method of claim 8 wherein the percentage values calculated in step (v) that determine the presence of an active TB infection are higher than the percentage values calculated in step (v) that determine the presence of a latent TB infection.",
        "13. The method of claims 8 and 12 wherein the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10% to 40%.",
        "14. The method of claim 13 wherein the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 10% to 17.4%.",
        "15. The method of claim 14 wherein the TB infection status corresponds to an active TB infection when the percentage calculated in step (v) is at least 17.4%.",
        "16. The method of claims 8 and 12 wherein the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 10% to 40%.",
        "17. The method of claim 16 wherein the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 17.3% to 40%.",
        "18. The method of claim 17 wherein the TB infection status corresponds to a latent TB infection when the percentage calculated in step (v) is less than or equal to 17.3%.",
        "19. The method of any previous claim wherein the TB infection status determined by the method corresponds to the risk of a latent TB infection progressing to an active TB infection.",
        "20. The method of claim 19 wherein the risk of a latent TB infection progressing to an active TB infection is proportional to the percentage value calculated in step (v) of the method.",
        "21. The method of any previous claim wherein the TB infection status determined by the method corresponds to the amount of time elapsed since the individual was originally infected with TB.",
        "22. The method of claim 21 wherein the time elapsed since the individual was originally infected with TB is inversely proportional to the percentage value calculated in step (v).",
        "23. The method of any previous claim wherein the individual is infected with HIV.",
        "24. The method of any previous claim wherein the individual has been infected with TB at any site.",
        "25. The method of any previous claim wherein the sample is a blood sample (preferably a PBMC sample), a bronochoalveolar lavage (BAL) sample or a cerebral spinal fluid (CSF) sample.",
        "26. The method of any previous claim wherein the method is 70-100% (preferably 100%) sensitive.",
        "27. The method of any previous claim wherein the method is 80-100% (for example 93%) specific.",
        "28. The method of any previous claim wherein steps (iii) and/or (iv) are performed by multi-parameter flow cytometry.",
        "29. The method of any previous claim wherein an additional step is first performed in order to determine that the sample of cells is either infected with TB or is obtained from a subject infected with TB.",
        "30. The method of claim 29 wherein the additional step is performed using an ELISpot platform, an interferon gamma release assay (IGRA) and/or a tuberculin skin test.",
        "31. A composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, CCR7 and CD127 and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, CCR7 and CD127.",
        "32. The composition of claim 31 wherein the plurality of antibodies or antigen-binding fragments thereof additionally binds to each of TNF-α and IFN-γ and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for each of TNF-α and IFN-γ.",
        "33. A composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, TNF-α and IFN-γ and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, TNF-α and IFN-γ.",
        "34. The composition of any of claims 31 to 33 wherein the plurality of antibodies or antigen-binding fragments thereof additionally binds to CD45RA and wherein the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD45RA.",
        "35. The composition of any of claims 31 to 34 wherein the plurality of antibodies or antigen-binding fragments thereof additionally binds to IL-2 and wherein the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for IL-2.",
        "36. The composition of any of claims 31 to 35 wherein the plurality of antibodies or antigen-binding fragments thereof additionally binds to CD3 and wherein the plurality additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for CD3.",
        "37. The composition of any of claim 31 or 36 wherein the antibody or antigen-binding fragments thereof is selected from antibody or antigen-binding fragment thereof is selected from the group consisting of Fv fragments, scFv fragments, Fab, single variable domains and domain antibodies.",
        "38. The composition of any one of claims 31 to 37 wherein the antibodies or antigen-binding fragments thereof with a particular specificity are separately detectable to those with a different specificity.",
        "39. The composition of any one of claims 31 to 38 wherein the antibodies or antigen-binding fragments thereof are visually detectable.",
        "40. The composition of any one of claims 31 to 39 wherein the antibodies or antigen-binding fragments thereof are labelled (e.g. with a fluorescent label).",
        "41. The composition of claims 31 to 40 for use in diagnosing an active or latent TB infection.",
        "42. The composition of any one of claims 31 to 41 for use in treating a TB infection wherein the use comprises identifying if a subject has an active or latent TB infection and subsequently administrating the most appropriate treatment for that infection.",
        "43. A method of treating a subject infected with TB comprising:\n(a) conducting the method of any of claims 1 to 30; and\n(b) administrating the most appropriate treatment to the subject depending on the outcome of the step (a)",
        "44. A kit for determining tuberculosis (TB) infection status in an individual comprising:\n(i) a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, CCR7 and CD127 and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, CCR7 and CD127;\n(ii) a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of TNF-α and IFN-γ and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of TNF-α and IFN-γ; and\n(iv) instructions for use.",
        "45. A kit for determining tuberculosis (TB) infection status in an individual comprising:\n(i) a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, TNF-α and IFN-γ and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, TNF-α and IFN-γ;\n(ii) a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CCR7 and CD127and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CCR7 and CD127; and\n(v) instructions for use.",
        "46. A kit for determining tuberculosis (TB) infection status in an individual comprising:\n(i) a composition comprising a plurality of antibodies or antigen-binding fragments thereof that binds to each of CD4, CCR7, CD127, TNF-α and IFN-γ and wherein the plurality comprises antibodies or antigen-binding fragments thereof that are individually specific for each of CD4, CCR7, CD127, TNF-α and IFN-γ; and\n(iii) instructions for use.",
        "47. A kit as claimed in any one of claims 44 to 46 wherein the plurality of antibodies or antigen-binding fragments thereof of the composition of (i) and/or (ii) additionally binds to one or more of CD3, CD45RA and/or IL-2 and additionally comprises antibodies or antigen-binding fragments thereof that are individually specific for each of the one or more of CD3, CD45RA and/or IL-2.",
        "48. A kit as claimed in any one of claims 44 to 47 additionally comprising one or more TB antigens, a live and/or dead cell discriminator, and/or a positive control.",
        "49. Use of a kit as claimed in any one of claims 44 to 48 in the method of any of claims 1 to 30.",
        "50. A method substantially as described herein with reference to the Examples and Figures.",
        "51. A composition substantially as described herein with reference to the Examples and Figures.",
        "52. A kit substantially as described herein with reference to the Examples and Figures.",
        "53. A use substantially as described herein with reference to the Examples and Figures."
    ]
}