{
    "id": "https://semopenalex.org/work/W2075774046",
    "authors": [
        "Muhammad Nadeem Akram",
        "Kaiying Wang",
        "Xuyuan Chen",
        "Zhaomin Tong",
        "Guangmin Ouyang"
    ],
    "title": "Laser speckle reduction based on angular diversity induced by Piezoelectric Benders",
    "date": "2013-04-09",
    "abstract": "Speckle reduction techniques have been investigated in display systems with coherent light sources. We propose a simple but efficient method to reduce speckle via two fast vibrating piezoelectric benders. The concept is modulating laser beams to have angle diversity and reducing speckle by temporal averaging in the integration time of the detector. Experiments demonstrate that the speckle contrast is suppressed down to 0.06. Both free space and imaging geometry are considered. In order to fairly evaluate the speckle reduction, the optical configuration as well as the camera settings, which largely affect the speckle contrast, is discussed.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "In comparison with conventional lamps, the use of lasers in projection displays gives unrivaled imaging quality with extensive color coverage. However, one major technique obstacle, which limits its applications, is the speckle phenomenon. The presence of speckle masks the image information and therefore its reduction is highly desirable in projection displays. The fundamental theory of speckle formation, its statistical properties and de-speckle methods are described thoroughly in [1]. Considerable efforts have been made to minimize the speckle noise. The most common methods are using moving diffusers (either with pre-determined Hadamard phase patterns [2], or with random phase patterns [3]- [5]), in the path of laser beams. The speckle is reduced by temporal averaging function of the detector. The reduced speckle contrast was 0.09 as reported in [2]. A similar technique has been developed in [6], where time varying speckles were generated by a stationary phase plate based on Barker binary phase code. A speckle contrast of 0.17 was demonstrated. A 2D MEMS scanning mirror has been applied for speckle reduction by producing angle diversity of the laser beams [7,8]. The speckle contrast is reduced to 0.05 [7]. A polymer diffractive optical element for speckle reduction was proposed in [9] and demonstrated in [10]. A speckle contrast of 0.5 was reported. A technology which combines temporal averaging, spatial averaging and angular diversity for speckle reduction was reported in [11]. Two independent lasers were illuminated at a vibrating multimode optical fiber bundle. The speckle con-trast was suppressed to 0.035. When mechanically moving elements are used, such as those in [2]- [5], a motor is needed to provide fast vibration or rotation. This can be difficult for practical implementation and decreases the system's reliability. The method based on binary phase code [6] is only applicable in line-scan projectors. Polymer dynamic diffractive optical element [9,10] is not suitable for high power lasers. Combination of using independent lasers and vibrating multimode optical fibers [11] increase the optics complexity and the cost. Two piezoelectric benders have been employed in this work for speckle reduction. To date, the speckle reduction by piezoelectric benders have not been reported, although the cylindrical piezoelectric transducers have been utilized to provide radial extension of coiled multimode fibers for speckle reduction [12,13]. In this work, the incoming laser beam is steered by the two piezoelectric benders. The moving beam is collected by a condenser lens, and falls on a transmitting diffuser at different angles. Speckle reduction is achieved by angular diversity of laser beams. Experiments are performed both for free space propagation geometry and imaging geometry. The speckle reduction technique proposed in this work is reliable, low cost and efficient. The integration in laser TVs or projectors is simple and straight forward. It is a good candidate in the case when high laser power is requested, since the piezoelectric ceramic is reliable under high temperature. "
            ],
            "subsections": []
        },
        {
            "title": "EXPERIMENTAL SETUP",
            "paragraphs": [
                "The experimental setup to implement speckle reduction in the free space propagation is shown in Figure 1. He-Ne laser is employed with power of 4 mW, wavelength of 633 nm, and beam spot size of 0.5 mm. The laser beam has a fixed polarization and passes through two polarizers. Polarizer 1 is rotated to adjust the beam intensity, and polarizer 2 maintains a fixed polarization of the transmitted beam. The piezoelectric benders are based on lead zirconate titanate material and are purchased from Noliac AS. The dimension is 50 mm×7.8 mm×0.7 mm (L×W×H). The surface of piezoelectric benders is deposited with thin gold film, which works as reflective mirrors. Two piezoelectric benders are placed perpendicularly to each other and both of them are fixed at one end. The maximum deflection range of the benders is characterized as ±1 mm under ±100 V square wave voltage. Laser beam is reflected at two benders and is steered in both X and Y directions, creating a 2D scanning. The trace of the 2D scanning depends on many factors, e.g. the linearity of benders movement, the relative position of two bends, the location of the laser beam on benders, etc. The 2D laser scan at the condenser lens is shown in Figure 2. The period of one scan is 6 ms. The moving laser beam is collected by the condenser lens with focal length 25 mm, and falls on a transmitting diffuser with different angles. The diffuser is very rough on the optical wavelength scale to ensure a sufficient phase modification. After passing through the diffuser, the beam propagates in free space and falls on the charged coupled device (CCD). The CCD has a resolution of 640×480 pixels, and each pixel has a dimension of 5.6 µm×5.6 µm.",
                "In order to demonstrate the application of the piezoelectric benders for speckle reduction in full frame laser display, an imaging geometry is constructed as shown in Figure 3. Unlike free space geometry, after passing through diffuser 1, the scattered light is collected and homogenized by a 175 mm long hexagonal light pipe. Diffuser 2 is placed at the output of the light pipe, to further homogenize the beam. The object, which is a transparent plastic sheet printed with a letter \"S\", is placed right after diffuser 2. The CCD camera is equipped with an imaging lens of focal length 50 mm. Lens extenders are employed to adjust the distance between imaging lens and the CCD sensor, which is f1 in Figure 3."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS AND DISCUSSION",
            "paragraphs": [
                "When the piezoelectric benders are actuated, laser beam is steered. The moving beam is focused at a spot on diffuser by the condenser lens. The spatial position of the laser spots on diffuser remains the same while the illumination angle is changed. The laser spots with different illumination angle generate different speckle patterns, which are averaged by the CCD camera during its integrating time. The speckle is evaluated by speckle contrast (SC) which is defined as the standard deviation divided by the mean value of light intensity in the speckle pattern [1]. Many measurement parameters will influence the value of SC. In order to fairly evaluate the speckle reduction, it is important to perform the calibration and find the suitable measurement parameters. The calibration process is based on three criterions: 1). The speckle size detected in CCD sensor should be big enough compared with the CCD pixel size. According to [1], the ratio between the speckle size and CCD pixel size affects the value of SC, by:",
                "where k is equal to A c /A m , A c is the \"coherent area\" or \"speckle size\" and A m is the CCD pixel size. By plotting parameter k with regard to SC (as shown in Figure 4), it is seen that the speckle contrast largely depends on k if k is less than 10. Therefore to avoid the speckle reduction introduced by the spatial averaging of CCD pixel, the speckle size A c should be at least 10 times bigger than CCD pixel size A m . 2). The CCD camera should be operated in the linear regime. The detected light intensity distribution should be neither over-saturated nor under-saturated. 3). In free space geometry, ideally the original SC is equal to 1 without any de-speckle method applied. In practice, however, the SC should be 1/2 0.5 (0.71) even without the motion of piezoelectric benders, due to the laser FIG. 4 The influence of parameter k to speckle contrast SC.",
                "scattering at a depolarizing screen [1], which is the diffuser in this case.",
                "In free space geometry, the center-to-center spacing of adjacent dark spots or of adjacent light spots in speckle pattern is given by λz/D [13], where λ is the laser wavelength, z is the propagation distance between diffuser and CCD sensor, D is the diameter of the scattering spot. This is the one dimensional \"width of speckle\". A reasonable approximation is that A c = (λz/D) 2 [1]. In this case, λ is 633 nm, z is 50 mm and D is 0.5 mm. Therefore the speckle size at the CCD sensor is 63.3 µm ×63.3 µm, which is big enough to avoid the spatial averaging from the CCD pixel. To ensure that the CCD camera is operated in its linear regime, the camera parameters are set as: Gamma=100, Brightness=0, Gain=550, Exposure time=1/34 sec (to simulate the averaging time of human eye). The light intensity is adjusted by the polarizer 1 to avoid over-saturation and under-saturation of the detected speckle in CCD. In this calibrated system, when laser illuminated at the diffuser, which works as a depolarizing screen, the SC is 0.71.",
                "The captured speckle image with and without the actuation of the piezoelectric benders are shown in Figure 5(a) and (b), respectively. Without the actuating of benders, the speckle is significant. As benders actuated, the image becomes smooth. The speckle contrast is reduced from 0.71 to 0.06.",
                "For imaging geometry, in order to determine the measurement parameters, the first two criterions as in free space geometry are employed. However, the third criterion is not applicable due to \"compound speckle\" phenomenon [1]. In imaging geometry, when light passes through diffuser 1, and falls on a finite-sized diffuser 2, there can be a compounding of speckle statics. The speckle generated from diffuser 1 has bigger size, or \"coarse speckle\"; while the speckle generated from diffuser 2 has smaller size, or \"fine speckle\". The SC of compound speckle can be bigger than 1 [1]. The \"compound speckle\" has also been reported in [5,8]. In this work, due to the dimension difference between the coarse and fine speckle, it is difficult to measure and evaluate both of them in a single setup.",
                "The optical configuration has to be adjusted in order to observer one or the other. The fine speckle size is calculated by",
                ", where M is the magnification of the optical configuration, which is f 1 / f 2 as shown in Figure 3. In order to obtain sufficiently large fine speckle size, F# of the imag- ing lens is set as the maximum value 16. The lens is mounted 150 mm away from the CCD sensor and placed 75 mm away from diffuser 2. Hence, the speckle size is 30.4 µm×30.4 µm, which is big enough to avoid the spatial averaging from CCD. The camera parameters and light intensity are fixed the same as in free space geometry, to ensure that the CCD camera is operated in the linear regime and have comparable results. The captured speckle image with and without the actuation of the piezoelectric benders are shown in Figure 5(c) and (d). The SC is reduced from 0.87 to 0.16. The original SC is 0.87 rather than 0.71, which is due to the compound speckle phenomenon. In this case, both the fine and coarse speckle is detected by the CCD sensor. However, the coarse speckle is too big to distinguish from Figure 5(c).",
                "The size of coarse speckle is calculated by two steps. From diffuser 1, the scattered beam propagates in the light pipe with multiple reflections. This is free space propagation and the speckle size is (λz/D) 2 . The speckle pattern at the output of light pipe is magnified into the CCD sensor by magnification M. Therefore the coarse speckle size is [(λz/D)×M] 2 , where z is the propagation distance within the light pipe. We assume that z is three times longer than the length of light pipe. To observe the coarse speckle clearly, the optical configuration is adjusted to:",
                "Hence, the coarse speckle size is 159.5 µm×159.5 µm. Please note that the coarse speckle size calculation is just an approximation because the light propagated inside light pipe in a complicated manner and it is difficult to predict the light path. Moreover, unlike the free space propagation, in light pipe propagation the speckle pattern is folded many times by multiple reflections from the side walls and this may affect the speckle size. The coarse speckle is shown in Figure 5(e). It is clear that the coarse speckle is much bigger than the fine speckle, since the letter \"S\" is the same as in Figure 5(c). The height of the letter \"S\" is approximately 0.5 mm, indicating that the calculated coarse speckle size 159.5 µm×159.5 µm agrees with the experiments. In this setup, the fine speckle size is [(1+M)×λ×F#] 2 = 1.1 µm×1.1 µm, which is much smaller than the CCD pixel size therefore it is not perceived by CCD sensor. The coarse speckle is reduced from 0.72 to 0.09 by piezoelectric benders in imaging geometry. From Figure 5(e) and (f), the masked letter \"S\" becomes quite distinct after speckle reduction.",
                "In conclusion, by using two fast vibrating piezoelectric benders, the speckle contrast is efficiently reduced from 0.71 to 0.06 and 0.09, in free space geometry and imaging geometry, respectively. It demonstrated that the proposed method can be implemented into full frame laser display for speckle reduction. The method is simple to construct with low cost and shows good reliability. It is especially suitable for large display screen where a high power laser is needed."
            ],
            "subsections": []
        },
        {
            "title": "ACKNOWLEDGEMENTS",
            "paragraphs": [
                "The authors are grateful to Dr. V. Kartashov for fruitful discussions. This research work is funded by the Research Council of Norway under grant BIA-286 project number 182667."
            ],
            "subsections": []
        }
    ]
}