{
    "id": "US20230286077",
    "authors": [
        "Muneo Matsushita",
        "Rinsei Ikeda"
    ],
    "title": "DOUBLE-SIDE FRICTION STIR WELDING METHOD AND DOUBLE-SIDE FRICTION STIR WELDING DEVICE FOR METAL SHEETS OR METAL PLATES",
    "date": "2023-05-17 00:00:00",
    "abstract": "Provided is a double-side friction stir welding method of metal sheets or metal plates to each other, and a double-side friction stir device for performing the double-side friction stir welding. According to the present invention, a pair of rotating tools facing each other is respectively arranged on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates, the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion, and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a double-side friction stir welding method of welding metal sheets or metal plates to each other, and to a double-side friction stir welding device for performing double-side friction stir welding. In the friction stir welding method, a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which becomes a welded joint of the metal sheets or the metal plates; the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools. As a result, a plastic flow is caused to occur at the welded joint to join the metal sheets or the metal plates to each other.",
                        "Aspects of the present invention are directed to overcoming a problem that may occur when the friction stir welding method is applied to joining metal sheets or metal plates to each other or when the friction stir welding device is applied to joining metal sheets or metal plates to each other, that is, the problem that a localized improper plastic flow occurs in the welded joint due to differences in temperature and plastic flow occurring in a thickness direction of the metal sheets or the metal plates at the welded joint. Therefore, aspects of the present invention are advantageous in overcoming welding defects, ensures a sufficient strength (joint strength), and intends to improve welding workability, in particular, to increase welding speed.",
                        "In the description below, a butted portion (or an overlapping portion) where the metal sheets or the metal plates (such as steel sheets or steel plates) only butt against each other (or overlap each other) and are not joined to each other yet is called an “unwelded joint”, whereas a portion where the metal sheets or the metal plates are integrated to each other by being joined to each other due to a plastic flow is called a “welded joint”."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce friction stir welding method",
                        "describe advantages of friction stir welding",
                        "motivate application to structural steel sheets",
                        "describe limitations of existing methods"
                    ],
                    "num_characters": 2165,
                    "outline_medium": [
                        "introduce friction stir welding method",
                        "describe advantages of friction stir welding"
                    ],
                    "outline_short": [
                        "introduce friction stir welding method"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "As a friction welding method, Patent Literature 1 discloses a technology in which, while a pair of metal materials is softened by frictional heat generated between the metal materials by rotating one or both of the metal materials, softened parts are stirred to produce a plastic flow to join the metal materials to each other. However, in this technology, since the metal materials to be joined to each other are rotated, there is a limit to the shapes and dimensions of the metal materials.",
                        "On the other hand, Patent Literature 2 discloses a method of continuously joining metal sheets or metal plates to each other in a longitudinal direction by heat generated and a plastic flow between rotating tools, which are made of materials that are substantially harder than the materials of the metal sheets or the metal plates, by inserting the rotating tools into an unwelded joint of the metal sheets or the metal plates and by moving the rotating tools while being rotated. In this technology, the metal sheets or the metal plates in a fixed state are joined to each other by moving the rotating tools while being rotated. Therefore, this method is advantageous in that even substantially indefinitely elongated members in the welding direction can be continuously subjected to solid-state welding in a longitudinal direction thereof. In addition, since the solid-state welding uses a plastic flow of metals caused by frictional heat between the rotating tools and the metal sheets or the metal plates, the metal sheets or the metal plates can be joined to each other without melting the welded joint. Further, this method has many advantages such as deformation being small after the welding because the heating temperature is low, and defects being few and a metal filler being unnecessary because the welded joint is not melted.",
                        "As a welding method of welding low-melting-point metal sheets or metal plates, metal sheets or metal plates made of an aluminum alloy or a magnesium alloy being typical examples, the friction stir welding method is becoming widely used in the fields of, for example, airplanes, ships, railroad vehicles, and automobiles. This is because, although such low-melting-point metal sheets or metal plates do not easily allow a welded joint to have satisfactory characteristics in existing arc welding methods, when the friction stir welding method is applied, such low-melting-point metal sheets or low-melting-point metal plates allow productivity to be increased and allow a high-quality welded joint to be provided.",
                        "On the other hand, the application of the friction stir welding method to structural steel sheets or structural steel plates primarily used as material for structures, such as buildings, ships, heavy machines, pipelines, or automobiles, allows solidification cracking or hydrogen cracking, which are problems in existing melt welding, and structural changes in steel sheets or steel plates to be suppressed from occurring. Therefore, it is possible to expect an increase in joint performance. In addition, since by stirring a joining interface by the rotating tools, clean surfaces can be created and can be brought into contact with each other, the advantage that a previous preparation step, such as diffusion bonding, is not required can be expected. In this way, when the friction stir welding method is applied to structural steel sheets or structural steel plates, many advantages are expected. However, since problems related to joining workability, such as suppression of occurrence of defects at the time of welding and an increase in welding speed (that is, the moving speed of the rotating tools) still remain, the application of the friction stir welding method to structural steel sheets or structural steel plates is not as widespread as the application of the friction stir welding method to low-melting-point metal sheets or low-melting-point metal plates.",
                        "An example of the main causes of defects in the friction stir welding method described in Patent Literature 2 is differences in temperature and plastic flow occurring in a thickness direction of the metal sheets or the metal plates. When the metal sheets or the metal plates are to be joined to each other by pushing the rotating tool against one surface side of a joint portion of the metal sheets or the metal plates and by moving the rotating tool in the welding direction while being rotated, the surface side that is pushed by a shoulder part of the rotating tool is subjected to a large deformation at high temperatures due to a sufficient temperature increase and shear-stress load caused by rotating the shoulder part, as a result of which clean surfaces are created at a welding interface. In addition, by bringing the clean surfaces into contact each other at the welding interface, a sufficient plastic flow for attaining a metallurgical welded state is realized. On the other hand, the surface side opposite thereto is subjected to relatively lower temperatures and to a smaller shear-stress load, as a result of which a state in which a plastic flow sufficient for attaining a metallurgically welded state is not realized tends to occur.",
                        "When the technology of the friction stir welding method described in Patent Literature 2 is applied to structural steel sheets or structural steel plates, since the strength of the structural steel sheets or structural steel plates under high temperatures is high, in the case of low-heat input and high welding speed, there is a strong tendency that a state of a sufficient plastic flow described above cannot be realized. Therefore, it is difficult to increase the welding speed while suppressing defects at the time of welding from occurring.",
                        "Patent Literature 3, Patent Literature 4, and Patent Literature 5 disclose a double-side friction stir welding method. In the double-side friction stir welding method, shoulder parts of a pair of rotating tools facing each other is respectively pushed against a top-surface side and a bottom-surface side of a joint portion of metal sheets or metal plates, and two surfaces of the joint portion of the metal sheets or the metal plates are subjected to a large deformation at high temperatures due to a sufficient temperature increase and shear stress caused by rotating the shoulder parts. Therefore, it is possible to realize a plastic flow sufficient for realizing a homogeneously welded state with respect to the thickness direction of the metal sheets or the metal plates, and to increase the welding speed while suppressing defects at the time of welding from occurring. However, regarding the technologies described in Patent Literature 3, Patent Literature 4, and Patent Literature 5, when pushing the shoulder parts of the pair of rotating tools facing each other respectively against the top-surface side and the bottom-surface side of the joint portion of the metal sheets or the metal plates, a gap between the shoulder parts of the pair of rotating tools, which is important in realizing a temperature increase and shear stress sufficient for realizing the welded state, is not considered at all."
                    ],
                    "subsections": [
                        {
                            "title": "PATENT LITERATURE",
                            "paragraphs": [
                                "PTL 1: Japanese Unexamined Patent Application Publication No. 62-183979",
                                "PTL 2: Japanese Unexamined Patent Application Publication (Translation of PCT Application) No. 7-505090",
                                "PTL 3: Japanese Patent No. 3261433",
                                "PTL 4: Japanese Patent No. 4838385",
                                "PTL 5: Japanese Patent No. 4838388"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list patent literature"
                            ],
                            "num_characters": 284,
                            "outline_medium": [
                                "list prior art patents"
                            ],
                            "outline_short": [
                                "list prior art references"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce prior art",
                        "describe Patent Literature 1",
                        "describe Patent Literature 2",
                        "describe advantages of Patent Literature 2",
                        "describe limitations of Patent Literature 2",
                        "describe application to structural steel sheets",
                        "describe limitations of existing methods",
                        "describe Patent Literature 3, 4, and 5",
                        "describe limitations of Patent Literature 3, 4, and 5",
                        "describe main causes of defects",
                        "describe effects of temperature and plastic flow",
                        "describe effects of welding speed",
                        "describe limitations of existing methods",
                        "motivate need for improvement"
                    ],
                    "num_characters": 7129,
                    "outline_medium": [
                        "introduce prior art of friction welding",
                        "describe limitations of prior art",
                        "introduce friction stir welding method",
                        "describe advantages of friction stir welding",
                        "introduce double-side friction stir welding method",
                        "describe limitations of double-side friction stir welding method",
                        "motivate need for improvement"
                    ],
                    "outline_short": [
                        "describe prior art of friction stir welding",
                        "motivate need for improvement",
                        "summarize limitations of prior art"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "An object according to aspects of the present invention is to provide a friction stir welding method that overcomes the problems of the related art, and a friction stir welding device that is suitable for performing friction stir welding. That is, in accordance with aspects of the present invention, when performing double-side friction stir welding, shoulder parts of a pair of rotating tools facing each other is respectively pushed against a top-surface side and a bottom-surface side of a joint portion of metal sheets or metal plates, and two surfaces of the joint portion of the metal sheets or the metal plates are subjected to a large deformation at high temperatures due to a sufficient temperature increase and shear-stress caused by rotating the shoulder parts, so that it is possible to realize a plastic flow sufficient for realizing a homogeneously welded state with respect to a thickness direction of the metal sheets or the metal plates. As a result, it is possible to provide a technology that allows the welding speed to be increased while suppressing defects at the time of welding from occurring, a sufficient strength (a joining strength) to be ensured, and welding workability to be improved. Above all, an object according to aspects of the present invention is to provide a friction stir welding method in which a gap between shoulder parts of a pair of rotating tools facing each other, which is important in realizing a sufficient temperature increase and shear stress for attaining a welded state, is closely examined; and a friction stir welding device for realizing this.",
                        "In accordance with aspects of the present invention, “welded state” refers to a state in which crystal grains are continuously formed across a welded joint interface of the metal sheets or the metal plates and the interface of the metal sheets or the metal plates has microscopically disappeared. “Attaining a welded state” or “realizing a welded state” means that the aforementioned state is attained or the aforementioned state is realized.",
                        "The present inventors have assiduously conducted studies to overcome the above-described problems and, as a result, have gained the findings (a) to (d) mentioned below.\n\n\n- - (a) In double-side friction stir welding, in terms of increasing the\n    welding speed while suppressing defects at the time of welding from\n    occurring, in order to homogeneously distribute with respect to a\n    thickness direction of metal sheets or metal plates a temperature\n    increase and shear stress sufficient for realizing a welded state,\n    it is necessary to control a gap between the shoulder parts of a\n    pair of rotating tools facing each other. In particular, when the\n    pair of rotating tools is set at an inclination angle, it is\n    effective to adjust the diameter of the shoulder part of each\n    rotating tool and the inclination angle in addition to the thickness\n    of each metal sheet or metal plate.\n  - (b) When the pair of rotating tools facing each other is such that\n    the rotation direction on a top-surface side and the rotation\n    direction on a bottom-surface side are the same, the relative speed\n    of a rotating tool with respect to the other rotating tool is zero.\n    Therefore, in the gap between the shoulder parts of the respective\n    rotating tools, plastic deformation is reduced as a plastic flow of\n    the metal sheets or the metal plates approaches a homogeneous state,\n    and heat cannot be generated by the plastic deformation of the metal\n    sheets or the metal plates, as a result of which a good welded state\n    cannot be attained. Consequently, in order to cause a temperature\n    increase and shear stress sufficient for attaining a good welded\n    state to be homogeneous with respect to the thickness direction of\n    the metal sheets or the metal plates, the pair of rotating tools\n    need to be such that the rotation direction on the top-surface side\n    and the rotation direction on the bottom-surface side are opposite\n    each other.\n  - (c) In the pair of rotating tools facing each other, by controlling\n    a gap between ends of pin parts, it becomes possible to realize a\n    homogeneous temperature increase and shear stress with respect to\n    the thickness direction of the metal sheets or the metal plates, and\n    to increase the welding speed while suppressing defects at the time\n    of welding from occurring. Further, by adjusting the thicknesses of\n    the metal sheets or the metal plates and the diameters of the\n    shoulder parts of the respective rotating tools, the effects are\n    markedly exhibited.\n  - (d) In the pair of rotating tools facing each other, by controlling\n    the diameters of the shoulder parts, it is possible to realize a\n    homogeneous temperature increase and shear stress with respect to\n    the thickness direction of the metal sheets or the metal plates, and\n    to increase the welding speed while suppressing defects at the time\n    of welding from occurring. In particular, by limiting the diameters\n    of the shoulder parts in relation to the thicknesses of the metal\n    sheets or the metal plates, the effects can be markedly exhibited.",
                        "Aspects of the present invention are based on such findings.",
                        "That is, aspects of the present invention provide a double-side friction stir welding method in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools are moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\n\n\n- - each of the pair of rotating tools includes a shoulder part and a\n    pin part that is disposed at the shoulder part and that along with\n    the shoulder part includes a common rotation axis, and at least the\n    shoulder parts and the pin parts are made of materials that are\n    harder than materials of the metal sheets or the metal plates,\n  - while the metal sheets or the metal plates are fixed by a gripping\n    device, the pair of rotating tools is respectively pushed against a\n    top surface and a bottom surface of each metal sheet or metal plate,\n    and the rotating tools are moved in the welding direction while\n    being rotated, and\n  - a gap G (mm) between the shoulder parts that is formed by providing\n    a gap g (mm) between ends of the pin parts of the pair of respective\n    rotating tools with respect to a thickness t (mm) of each metal\n    sheet or metal plate for a case of butting or with respect to a\n    total thickness t (mm) of the overlapped metal sheets or the\n    overlapped metal plates for a case of overlapping satisfies",
                        "0.5×t≤G≤t, and\n\n\n- - the pair of rotating tools is further rotated in opposite directions\n    to perform the friction stir welding.",
                        "Aspects of the present invention also provide a double-side friction stir welding method in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\n\n\n- - each of the pair of rotating tools includes a shoulder part and a\n    pin part that is disposed at the shoulder part and that along with\n    the shoulder part includes a common rotation axis, and at least the\n    shoulder parts and the pin parts are made of materials that are\n    harder than materials of the metal sheets or the metal plates,\n  - while the metal sheets or the metal plates are fixed by a gripping\n    device, the pair of rotating tools is pushed against a top surface\n    and a bottom surface of each metal sheet or metal plate, the\n    rotating tools are moved in the welding direction while being\n    rotated, and\n  - the rotation axes of the pair of respective rotating tools is\n    inclined at an inclination angle α(°) on a preceding side with\n    respect to the welding direction from a vertical direction with\n    respect to the metal sheets or the metal plates, the inclination\n    angle α satisfies",
                        "0<α≤3, and\n\n\n- - a gap G (mm) between the shoulder parts that is formed by providing\n    a gap g (mm) between ends of the pin parts of the pair of respective\n    rotating tools with respect to a thickness t (mm) of each metal\n    sheet or metal plate and a diameter D (mm) of the shoulder part of\n    each rotating tool satisfies",
                        "(0.5×t)−(0.2×D×sin α)≤G≤t−(0.2×D×sin α),",
                        "and\n\n\n- - the pair of rotating tools is further rotated in opposite directions\n    to perform the friction stir welding.",
                        "In the double-side friction stir welding method according to aspects of the present invention, it is desirable that the diameter D (mm) of each shoulder part with respect to the thickness t (mm) of each metal sheet or metal plate satisfy",
                        "4×t≤D≤20×t,",
                        "and that the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate for the case of butting or with respect to a total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates for the case of overlapping and the diameter D (mm) of the shoulder part of each rotating tool satisfy",
                        "[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t.",
                        "Further, aspects of the present invention provide a double-side friction stir welding device in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\n\n\n- - each rotating tool includes a shoulder part and a pin part that is\n    disposed at the shoulder part and that along with the shoulder part\n    includes a common rotation axis, and at least the shoulder parts and\n    the pin parts are made of materials that are harder than materials\n    of the metal sheets or the metal plates,\n  - a gripping device that fixes the metal sheets or the metal plates\n    while the pair of rotating tools are moved in the welding direction\n    while being rotated is provided,\n  - a gap G (mm) between the shoulder parts that is formed by providing\n    a gap g (mm) between ends of the pin parts of the pair of respective\n    rotating tools with respect to a thickness t (mm) of each metal\n    sheet or metal plate for a case of butting or with respect to a\n    total thickness t (mm) of the overlapped metal sheets or the\n    overlapped metal plates for a case of overlapping satisfies",
                        "0.5×t≤G≤t, and\n\n\n- - a rotation driving device that further rotates the pair of rotating\n    tools in opposite directions is provided.",
                        "Aspects of the present invention also provide a double-side friction stir welding device in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\n\n\n- - each of the pair of rotating tools includes a shoulder part and a\n    pin part that is disposed at the shoulder part and that along with\n    the shoulder part includes a common rotation axis, and at least the\n    shoulder parts and the pin parts are made of materials that are\n    harder than materials of the metal sheets or the metal plates,\n  - a gripping device that fixes the metal sheets or the metal plates\n    while the pair of rotating tools is moved in the welding direction\n    while being rotated is provided,\n  - the rotation axes of the pair of respective rotating tools is\n    inclined at an inclination angle α (°) on a preceding side with\n    respect to the welding direction from a vertical direction with\n    respect to the metal sheets or the metal plates, the inclination\n    angle α satisfies",
                        "0<α≤3, and\n\n\n- - a gap G (mm) between the shoulder parts that is formed by providing\n    a gap g (mm) between ends of the pin parts of the pair of respective\n    rotating tools with respect to a thickness t (mm) of each metal\n    sheet or metal plate for a case of butting or with respect to a\n    total thickness t (mm) of the overlapped metal sheets or the\n    overlapped metal plates for a case of overlapping and a diameter\n    D (mm) of the shoulder part of each rotating tool satisfies",
                        "(0.5×t)−(0.2×D×sin α)≤G≤t−(0.2×D×sin α),",
                        "and\n\n\n- - a rotation driving device that further rotates the pair of rotating\n    tools in opposite directions is provided.",
                        "In the double-side friction stir welding device according to aspects of the present invention, it is desirable that the diameter D (mm) of each shoulder part with respect to the thickness t (mm) of each metal sheet or metal plate for the case of butting or with respect to the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates for the case of overlapping satisfy 4×t≤D≤20×t, and that the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate for the case of the butting or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates for the case of overlapping and the diameter D (mm) of the shoulder part of each rotating tool satisfy",
                        "[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t.",
                        "According to aspects of the present invention, in performing double-side friction stir welding, the shoulder parts of the pair of rotating tools facing each other is respectively pushed against the top surface and the bottom surface of a joint portion of the metal sheets or the metal plates, and the two surfaces of the joint portion of the metal sheets or the metal plates are subjected to a large deformation at high temperatures due to a sufficient temperature increase and shear stress caused by rotating the shoulder parts. Therefore, it is possible to accelerate a homogeneous plastic flow with respect to the thickness direction of the metal sheets or the metal plates, and to attain a good welded state. As a result, it is possible to increase the welding speed while suppressing defects at the time of welding from occurring, to ensure a sufficient strength, and to improve welding workability, so that the effects are industrially considerably exhibited."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce object of invention",
                        "describe double-side friction stir welding method",
                        "describe advantages of invention",
                        "define \"welded state\"",
                        "describe findings (a)",
                        "describe findings (b)",
                        "describe findings (c)",
                        "describe findings (d)",
                        "introduce double-side friction stir welding method",
                        "describe rotating tools",
                        "describe movement of rotating tools",
                        "describe plastic flow",
                        "describe gap between shoulder parts",
                        "describe rotation directions",
                        "describe gap between pin parts",
                        "describe effects of gap",
                        "describe effects of diameters of shoulder parts",
                        "describe effects of inclination angle",
                        "describe gap between shoulder parts",
                        "describe effects of gap",
                        "describe effects of diameters of shoulder parts",
                        "describe effects of inclination angle",
                        "describe gap between pin parts",
                        "describe effects of gap",
                        "describe effects of diameters of shoulder parts",
                        "describe effects of inclination angle",
                        "describe rotation directions",
                        "describe effects of invention",
                        "describe advantages of invention",
                        "describe industrial applicability",
                        "conclude summary"
                    ],
                    "num_characters": 15902,
                    "outline_medium": [
                        "introduce object of invention",
                        "describe double-side friction stir welding method",
                        "introduce findings of inventors",
                        "describe importance of gap control",
                        "describe importance of rotation direction",
                        "describe importance of pin part gap control",
                        "describe importance of shoulder part diameter control",
                        "introduce double-side friction stir welding method",
                        "describe features of rotating tools",
                        "describe movement of rotating tools",
                        "describe gap control between shoulder parts",
                        "describe rotation direction of rotating tools",
                        "describe inclination angle of rotation axes",
                        "describe gap control between pin parts",
                        "describe advantages of invention"
                    ],
                    "outline_short": [
                        "introduce double-side friction stir welding method",
                        "motivate need for improvement",
                        "summarize findings of inventors",
                        "describe double-side friction stir welding method",
                        "describe gap control between shoulder parts",
                        "describe rotation direction of rotating tools",
                        "summarize advantages of invention"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF EMBODIMENTS OF THE INVENTION",
                    "paragraphs": [
                        "In accordance with aspects of the present invention, double-side friction stir welding is performed by butting two metal sheets or metal plates against each other or by making the two metal sheets or metal plates overlap each other and by disposing a pair of rotating tools respectively on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion.",
                        "A case in which double-side friction stir welding is performed on a butted portion is described in detail below with reference to FIGS. 1 and 2.",
                        "As shown in FIG. 1, a pair of rotating tools 1 and 8 is respectively disposed so as to face the top-surface side and the bottom-surface side of each of two metal sheets 3 or metal plates 3 that are butted against each other, the rotating tools 1 and 8 are inserted into an unwelded joint 12 from the top-surface side and the bottom-surface side, respectively, of each metal sheet 3 or metal plate 3, and the pair of rotating tools 1 and 8 is moved in a welding direction while being rotated. The arrow P in FIG. 1 indicates the advancing direction of the rotating tools 1 and 8 (that is, the welding direction), the arrow Q indicates the rotation direction of the rotating tool 1 that is disposed on the top-surface side, and the arrow R indicates the rotation direction of the rotating tool 8 that is disposed on the bottom-surface side.",
                        "While the metal sheets 3 or the metal plates 3 are softened by generating frictional heat by rotating the pair of rotating tools 1 and 8 facing each other, softened parts are stirred by the pair of rotating tools 1 and 8 to produce a plastic flow and to join the metal sheets 3 or the metal plates 3 to each other. A welded joint 4 that is obtained in this way is linearly formed in the advancing direction of the rotating tools 1 and 8. A straight line 7 (hereunder called “welding center line”) extending from the unwelded joint 12 to the center of the width of the welded joint 4 in FIG. 1 matches a path of the rotating tools 1 and 8 that advance in the direction of arrow P (see FIG. 2(1)).",
                        "When the rotating tools 1 and 8 advance along the welding center line 7, the two metal sheets 3 or metal plates 3 are gripped by a gripping device (not shown) and are fixed at predetermined positions. As the gripping device, a device that is capable of preventing variations in the positions of the metal sheets 3 or the metal plates 3 as the rotating tools 1 and 8 advance may be used, so that the structure of the gripping device is not particularly limited to certain structures.",
                        "An end of the pin part 6 of the rotating tool 1 on the top-surface side and an end of the pin part 10 of the rotating tool 8 on the bottom-surface side are not in contact with each other and a gap g (mm) is provided therebetween as shown in FIG. 2(2). A gap G (mm) is formed between stepped portions 5 and 9 (hereunder called “shoulder parts”), the stepped portion 5 being formed due to a difference between a diameter D (mm) of the rotating tool 1 and a diameter a (mm) of the pin part 6 and the stepped portion 9 being formed due to a difference between a diameter D (mm) of the rotating tool 8 and a diameter a (mm) of the pin part 10.",
                        "Further, the rotating tool 8 on the bottom-surface side is rotated in a direction (that is, the direction of arrow R) opposite to the rotation direction (that is, the direction of arrow Q) of the rotating tool 1 on the top-surface side. For example, as shown in FIG. 2(1), in plan view as seen from the top-surface side of each metal sheet 3 or metal plate 3, when the rotating tool 1 is rotated clockwise, the rotating tool 8 is rotated counterclockwise. Although not shown, when the rotating tool 1 is rotated counterclockwise, the rotating tool 8 is rotated clockwise.",
                        "In this way, the gap g is provided between the end of the pin part 6 of the rotating tool 1 and the end of the pin part 10 of the rotating tool 8, the gap G is provided between the shoulder part 5 of the rotating tool 1 and the shoulder part 9 of the rotating tool 8, and the rotating tool 1 and the rotating tool 8 are rotated in opposite directions. Therefore, it is possible to subject both surfaces of each metal sheet 3 or metal plate 3 to a sufficient temperature increase and shear stress, to reduce differences between the temperatures and between the plastic flows occurring in a thickness direction of each metal sheet 3 or metal plate 3 at the welded joint 4, and to attain a homogeneous welded state. In addition, it is possible to advantageously overcome welding defects by overcoming plastic flow failures occurring locally inside the welded joint 4, to ensure a sufficient strength, and to improve welding workability, in particular, to increase welding speed.",
                        "The rotating tool 1 on the top-surface side includes the shoulder part 5 and the pin part 6 that is disposed at the shoulder part 5 and that includes along with the shoulder part 5 a common rotation axis 2. The rotating tool 8 on the bottom-surface side includes the shoulder part 9 and the pin part 10 that is disposed at the shoulder part 9 and that along with the shoulder part 9 includes a common rotation axis 11. At least the shoulder parts 5 and 9 and the pin parts 6 and 10 are made of materials that are harder than the materials of the metal sheets 3 or the metal plates 3.",
                        "By causing the rotation directions Q and R of the respective rotating tools 1 and 8 facing each other to be such that the rotation direction Q on the top-surface side is opposite to the rotation direction R on the bottom-surface side, it is possible to cancel rotation torques applied to the metal sheets 3 or the metal plates 3 by the rotations of the respective rotating tools 1 and 8. Compared to existing friction stir welding methods of welding metal sheets or metal plates by pushing the rotating tools from one-surface side, it is possible to simplify the configuration of a jig that retains the metal sheets 3 or the metal plates 3.",
                        "In contrast, if the rotation directions of the rotating tools 1 and 8 facing each other are such that the rotation direction of the rotating tool 1 on the top-surface side and the rotation direction of the rotating tool 8 on the bottom-surface side are the same, the relative speed of the rotating tool 8 on the bottom-surface side is zero with respect to the speed of the rotating tool 1 on the top-surface side. Therefore, as the state of the plastic flows of the metal sheets 3 or the metal plates 3 between the shoulder part 5 of the rotating tool 1 and the shoulder part 9 of the rotating tool 8 approaches a homogeneous state, plastic deformations are reduced and heat generated by the plastic deformations of the metal sheets 3 or the metal plates 3 can no longer be generated, as a result of which it becomes impossible to attain a good welded state.",
                        "Therefore, in order to make a temperature increase and a shear stress that are sufficient for attaining a good welded state homogeneous with respect to a thickness direction of a workpiece, the rotation directions Q and R of the respective rotating tools 1 and 8 facing each other are such that the rotation direction Q on the top-surface side is opposite to the rotation direction R on the bottom-surface side.",
                        "Further, in accordance with aspects of the present invention, adjusting the arrangement of the rotating tools as follows is effective in terms of prolonging the life of each rotating tool, suppressing welding defects from occurring, and increasing the welding speed.",
                        "First, inclination angle α (°) of each rotating tool on the top-surface side and the bottom-surface side is described.",
                        "By causing the rotation axis 2 of the rotating tool 1 and the rotation axis 11 of the rotating tool 8 to be inclined at the angle α (°) from a vertical direction with respect to the metal sheets 3 or the metal plates 3 and by causing the ends of the respective pin parts 6 and 10 to precede with respect to a welding direction P, the rotating tools 1 and 8 can be subjected to loads with respect to the rotating tools 1 and 8 as component forces that are compressed in the directions of the respective rotation axes 2 and 11. The pair of rotating tools 1 and 8 need to be made of materials that are harder than the materials of the metal sheets 3 or the metal plates 3. When the rotating tools 1 and 8 are made of materials that lack toughness, such as ceramic, subjecting the pin parts 6 and 10 to bending-direction forces causes localized stress to be concentrated and the pin parts 6 and 10 to break. Therefore, by causing the rotation axes 2 and 11 of the respective rotating tools 1 and 8 to be inclined at the angle α (hereunder referred as the “inclination angle”), the loads exerted upon the rotating tools 1 and 8 are applied as component forces that are compressed in the directions of the respective rotation axes 2 and 11, such that it is possible to reduce the bending-direction forces and to prevent the rotating tools 1 and 8 from becoming damaged.",
                        "When the inclination angle α is greater than 0°, the aforementioned effects are obtained. However, when the inclination angle α is greater than 3°, the front and bottom surfaces of the welded joint become concave-shaped and adversely affect the welding joint strength. Therefore, 3° is the upper limit. That is, it is desirable that the inclination angle be 0°<α≤3°. It is more desirable that the inclination angle be 0.5°≤α≤2.0°.",
                        "Even if the inclination angle α is 0°, it is possible to attain a welded state.",
                        "Next, the gap G (mm) between the shoulder part of the rotating tool on the top-surface side and the shoulder part of the rotating tool on the bottom-surface side is described.",
                        "In double-side friction stir welding, in terms of increasing the welding speed while suppressing defects at the time of welding from occurring, it is necessary to strictly control the gap G between the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 facing each other, the gap being important in making a temperature increase and a shear stress that are sufficient for attaining a welded state homogenous with respect to the thickness direction of the metal sheets 3 or the metal plates 3.",
                        "When the inclination angle α of the rotating tools 1 and 8 on the top-surface side and the bottom-surface side, respectively, is 0°, the gap G is limited to a range of 0.5×t or greater and t or less with respect to thickness t (mm) of the metal sheets 3 or the metal plates 3 in the case of butt-welding or with respect to total thickness t (mm) of the overlapped metal sheets 3 or metal plates 3 in the case of overlap-welding. As a result, the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 facing each other respectively push the top-surface side and the bottom-surface side of each metal sheet 3 or metal plate 3 by a sufficient load, and heat generation and plastic flow are accelerated due to friction produced and plastic deformation in a shearing direction by the shoulder parts 5 and 9 of the respective rotating tools 1 and 8. Therefore, it is possible to accelerate a homogeneous plastic flow with respect to the thickness direction of the metal sheets 3 or the metal plates 3, and to attain a good welded state. When the gap G between the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 is greater than t, the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 can no longer respectively push the top-surface side and the bottom-surface side of each metal sheet 3 or metal plate 3 by a sufficient load, as a result of the aforementioned effects cannot be obtained. On the other hand, when the gap G between the shoulder parts 5 and 9 is less than 0.5×t, the front and bottom surfaces of the welded joint become concave-shaped and adversely affect the welding joint strength. Therefore, when the inclination angle α=0°, the gap G must be 0.5×t or greater and t or less.",
                        "Further, when the inclination angle α of the rotating tools 1 and 8 facing each other is 0°<α≤3°, in order to bring the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 respectively into contact with the top surface and the bottom surface of each metal sheet 3 or metal plate 3 over a wide range, the gap G between the shoulder part 5 of the rotating tool 1 on the top-surface side and the shoulder part 9 of the rotating tool 8 on the bottom-surface side needs to be set small. Therefore, when the inclination angle α is provided, the gap G needs to be (0.5×t)−(0.2×D× sin α) or greater and t−(0.2×D× sin α) or less with respect to, in addition to the thickness t of each metal sheet 3 or metal plate 3 (in the case of butt-welding) or the total thickness t of the overlapped metal sheets or metal plates (in the case of overlap-welding), diameter D (mm) of the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 and the inclination angle α (°).",
                        "When the gap G is less than (0.5×t)−(0.2×D× sin α), the front and bottom surfaces of the welded joint become concave-shaped and adversely affect the welding joint strength. When the gap G is greater than t−(0.2×D× sin α), the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 cannot respectively push the top-surface side and the bottom-surface side of each metal sheet 3 or metal plate 3 by a sufficient load, and the aforementioned effects cannot be obtained. It is desirable that the gap G be (0.6×t)−(0.2×D× sin α)≤G≤(0.9×t)−(0.2×D× sin α).",
                        "That is, the gap G is as follows:",
                        "When α=0°,0.5×t≤G≤t,",
                        "When 0°<a≤3°,(0.5×t)−(0.2×D×sin α)≤G≤t−(0.2×D×sin α).",
                        "Next, the gap g (mm) between the end of the pin part of the rotating tool on the top-surface side and the end of the pin part of the rotating tool on the bottom-surface side is described.",
                        "In order to obtain a temperature increase and a shear stress that are homogeneous with respect to the thickness direction of the metal sheets 3 or the metal plates 3, and increase the welding speed while suppressing defects at the time of welding from occurring, it is effective to control the gap g between the ends of the pin parts 6 and 10 of the respective rotating tools 1 and 8 facing each other. In particular, when ratio (D/t) between the diameter D of each of the shoulder parts 5 and 9 of a corresponding one of the rotating tools 1 and 8 and the thickness t of the metal sheets 3 or the metal plates 3 (in the case of butt-welding) or the total thickness t of the overlapped metal sheets or metal plates (in the case of overlap-welding) is small, it becomes difficult to produce a homogeneous plastic flow with respect to the thickness direction. Therefore, it is effective to limit the gap g between the end of the pin part 6 and the end of the pin part 10 to a value greater than or equal to [0.1−0.09× exp{−0.011×(D/t)2}]×t and less than or equal to [1−0.9× exp{−0.011×(D/t)2}]×t.",
                        "When the gap g between the end of the pin part 6 and the end of the pin part 10 is less than [0.1−0.09× exp{−0.011×(D/t)2}]×t, the ends of the pin parts 6 and 10 of the respective rotating tools 1 and 8 facing each other may be brought into contact with each other and may become damaged, which is not desirable. When the gap g between the end of the pin part 6 and the end of the pin part 10 is greater than [1−0.9× exp{−0.011×(D/t)2}]×t, a homogenous plastic flow with respect to the thickness direction cannot be effectively realized. That is, it is desirable that the gap g be [0.1−0.09× exp{−0.011×(D/t)2}]×t≤g≤[1−0.9× exp{−0.011×(D/t)2}]×t. It is more desirable that the gap g be [0.12−0.09× exp{−0.011×(D/t)2}]×t≤g≤[0.9−0.9× exp{−0.011×(D/t)2}]×t.",
                        "Next, the diameter D (mm) of the shoulder parts of the rotating tools, respectively, on the top-surface side and the bottom-surface side are described.",
                        "In addition to controlling the gaps G and g that have been already described, strictly controlling the diameter D of the shoulder parts 5 and 9 of the respective rotating tools 1 and 8 facing each other is effective in terms of realizing a homogeneous temperature increase and shear stress with respect to the thickness direction of the metal sheets 3 or the metal plates 3 and increasing the welding speed while suppressing defects at the time of welding from occurring. In particular, by limiting the diameter D (mm) to 4×t or greater and 20×t or less with respect to the thickness t (mm) of the metal sheets 3 or the metal plates 3, the effects can be obtained.",
                        "When the diameter D (mm) is less than 4×t, a homogenous plastic flow with respect to the thickness direction of the metal sheets 3 or the metal plates 3 cannot be effectively obtained. On the other hand, when the diameter D (mm) is greater than 20×t, only a region where unwanted plastic flow occurs is widened, as a result of which an excessive load is applied to the device, which is not desirable. That is, the diameter D is 4×t D 20×t. The thickness t refers to the thickness t (mm) of each metal sheet 3 or metal plate 3 in the case of butt welding or the total thickness t (mm) of the overlapped metal sheets 3 or the overlapped metal plates 3 in the case of overlap-welding. It is more desirable that the diameter D be 5×t≤D≤18×t.",
                        "Length b of the pin part 6 of the rotating tool 1 on the top-surface side and the pin part 10 of the rotating tool 8 on the bottom-surface side is determined as appropriate in accordance with the inclination angle α, the gap G between the shoulder parts, the gap g between the ends of the pin parts, the diameter D of the shoulder parts, and the thickness t.",
                        "The welding conditions other than those described above are in accordance with ordinary methods. This makes it possible to set the number of rotations of the rotating tools 1 and 8 facing each other in the range of 100 to 5000 rotations/minute and to increase the welding speed to 1000 mm/min or greater.",
                        "The metal sheets 3 or metal plates 3 to which aspects of the present invention are applied are suitably applicable to general structural steels or carbon steel sheets or carbon steel plates, such as steel sheets or steel plates in correspondence with JIS G 3106 or JIS G 4051. The metal sheets 3 or metal plates 3 are also advantageously applicable to high-strength structural steel sheets or high-strength structural steel plates having a tensile strength of 800 MPa or greater. Even in this case, the welded joint can have a strength that is greater than or equal to 85% of the tensile strength of the steel sheets or steel plates, or greater than or equal to 90% of the tensile strength of the steel sheets or steel plates."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "Using steel sheets or steel plates having the thickness, the chemical composition, and the tensile strength shown in Table 1, friction stir welding was performed. In the case of butt-welding, with joint-butt surfaces not being angled, that is, being in a so-called square-groove milled surface state, the joint-butt surfaces were pushed by rotating tools from both the top-surface side and the bottom-surface side of a butted portion of the steel sheets or steel plates, and were joined to each other. In the case of overlap-welding, two steel sheets or steel plates of the same type were caused to overlap each other and were pushed by the rotating tools from both the top-surface side and the bottom-surface side of an overlapping portion of the steel sheets or the steel plates, and were joined to each other. The welding conditions of the friction stir welding are shown in Table 2. When the facing rotating tools on the respective top-surface side and bottom-surface side were seen from the top-surface side, the welding was performed for the case where the rotation direction of the rotating tool on the top-surface side was clockwise and the rotation direction of the rotating tool on the bottom-surface side was counterclockwise, and for the case where the rotation direction of the rotating tool on the top-surface side and the rotation direction of the rotating tool on the bottom-surface side were both clockwise. Here, the rotating tools using as materials two types of tungsten carbide (WC) having cross-sectional shapes shown in FIGS. 3(1) and 3(2) were used.",
                                "Table 3 shows whether or not surface defects existed in the observations of appearances of joints at the time of the welding, whether or not internal defects existed in the observations of cross sections of the joints, and tensile strengths when tension tests were performed by extracting tensile specimens having the dimensions of specimen No. 1 prescribed in JIS Z 3121 from the acquired welding joints.",
                                "Surface defects and internal defects were evaluated as follows.",
                                "<Evaluation of Surface Defects>",
                                "In the observations, parts in which the welding speeds of the acquired welding joints having the values shown in Table 2 were used. Whether or not surface defects existed was determined by visual inspection based on whether or not groove-shaped unwelded states due to a lack of plastic flow was observed or whether or not the welded joints had concave shapes due to the gap G between the shoulder parts of the joining tools being too narrow. When groove-shaped unwelded states or concave-shaped states of the welded joints were observed, a depth Dd (mm) was measured using a laser displacement meter for evaluating surface defects.\n\n\n- - No: Neither of the surface defects described above were observed.\n  - Good: Although at least one of the surface defects described above\n    were observed, a ratio (Dd/t) between the depth Dd (mm) and the\n    steel-sheet or steel-plate thickness t (mm) was 0.1 or less.\n  - Yes: At least one of the surface defects described above were\n    observed and the ratio (Dd/t) between the depth Dd (mm) and the\n    steel-sheet or steel-plate thickness t (mm) was greater than 0.1, or\n    groove-shaped unwelded states penetrated from the top surface to the\n    bottom surface. When the groove-shaped unwelded states penetrated\n    from the top surface to the bottom surface, evaluations were not\n    performed for internal defects and joint strengths.",
                                "<Evaluations of Internal Defects>",
                                "In the observations, specimens were provided as follows. That is, parts in which the welding speeds of the acquired welding joints having the values shown in Table 2 were cut so as to provide a cross section in a location that was 20 mm from an end portion of a welding start side, a cross section in a location that was 20 mm from an end portion of a welding completion side, and a cross section in a location that was intermediate between both the end portions. Whether or not internal defects existed was evaluated by using an optical microscope (magnification: 10×) based on whether or not unwelded states produced in the interior of the welded joints due to a lack of plastic flow was observed.\n\n\n- - No: Tunnel-shaped unwelded state was not observed at any of the\n    three locations described above.\n  - Good: An unwelded state inside a joint portion was observed in one\n    of the three locations described above.\n  - Yes: An unwelded state inside a joint portion was observed in two or\n    more of the three locations described above.",
                                "As shown in Table 3, in the invention examples 1 to 10 for butt-welding and the invention examples 11 to 13 for overlap-welding, even if the welding speed was increased to 1 m/min or greater, surface defects were not observed in the observations of the appearances of the joints, and internal defects were not observed even in the observations of the cross sections of the joints, as a result of which it was confirmed that sound welded states were realized. Further, the joint strengths were 95% or greater than the tensile strengths of the steel sheets or the steel plates, which were the base materials. “Sound welded states” means that the surface-defect evaluation results and the internal-defect evaluations results were either “good” or “no”.",
                                "On the other hand, in the comparative examples 1 to 7 for butt-welding and the comparative examples 8 and 9 for overlap-welding, surface defects were observed in the observations of the appearances of the joints and/or internal defects were observed in the observations of the cross sections of the joints, as a result of which sound welded states were not realized. In the comparative examples 10 and 11, since the surface-defect evaluations were “existed with penetration”, welding failures occurred, as a result of which internal-defect evaluations and joint-strength evaluations were not performed.",
                                "Further, the joint strengths were 70% or less of the tensile strengths of the steel sheets or the steel plates, which were the base materials."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform friction stir welding",
                                "describe welding conditions",
                                "introduce rotating tools",
                                "present evaluation criteria for surface defects",
                                "present evaluation criteria for internal defects",
                                "show results of surface defect evaluations",
                                "show results of internal defect evaluations",
                                "present tensile strengths of welding joints",
                                "summarize results of invention examples",
                                "summarize results of comparative examples",
                                "highlight differences between invention and comparative examples",
                                "conclude sound welded states"
                            ],
                            "num_characters": 6041,
                            "outline_medium": [
                                "perform friction stir welding",
                                "describe welding conditions",
                                "evaluate surface defects",
                                "evaluate internal defects",
                                "present results of invention examples",
                                "present results of comparative examples"
                            ],
                            "outline_short": [
                                "perform friction stir welding",
                                "evaluate surface defects",
                                "evaluate internal defects"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe double-side friction stir welding",
                        "introduce rotating tools on top-surface and bottom-surface sides",
                        "describe insertion of rotating tools into unwelded joint",
                        "explain movement of rotating tools in welding direction",
                        "describe generation of frictional heat and plastic flow",
                        "explain formation of welded joint",
                        "describe welding center line",
                        "introduce gripping device to fix metal sheets",
                        "describe gap between pin parts of rotating tools",
                        "explain gap between shoulder parts of rotating tools",
                        "describe rotation directions of rotating tools",
                        "explain cancellation of rotation torques",
                        "compare with existing friction stir welding methods",
                        "describe effects of opposite rotation directions",
                        "explain importance of temperature increase and shear stress",
                        "introduce rotating tool structure",
                        "describe materials of rotating tools",
                        "explain rotation directions to cancel rotation torques",
                        "describe inclination angle of rotating tools",
                        "explain effects of inclination angle on loads",
                        "describe gap between shoulder parts of rotating tools",
                        "explain importance of gap for welding speed and defects",
                        "describe limitations of gap for inclination angle",
                        "explain effects of gap on welding joint strength",
                        "describe gap between pin parts of rotating tools",
                        "explain importance of gap for temperature increase and shear stress",
                        "describe limitations of gap for diameter and thickness",
                        "explain effects of gap on welding joint strength",
                        "describe diameter of shoulder parts of rotating tools",
                        "explain importance of diameter for temperature increase and shear stress",
                        "describe limitations of diameter for thickness",
                        "explain effects of diameter on welding joint strength",
                        "describe length of pin parts of rotating tools",
                        "explain determination of length based on other parameters",
                        "describe welding conditions",
                        "introduce applicable metal sheets and plates"
                    ],
                    "num_characters": 18557,
                    "outline_medium": [
                        "describe double-side friction stir welding process",
                        "illustrate butted portion of metal sheets",
                        "describe rotating tools on top-surface and bottom-surface sides",
                        "explain welding direction and rotation directions",
                        "describe gap between pin parts of rotating tools",
                        "describe gap between shoulder parts of rotating tools",
                        "explain opposite rotation directions of rotating tools",
                        "describe advantages of opposite rotation directions",
                        "describe structure of rotating tools",
                        "explain materials of rotating tools",
                        "describe rotation directions and torque cancellation",
                        "explain limitations of same rotation directions",
                        "describe inclination angle of rotating tools",
                        "explain effects of inclination angle on loads",
                        "describe gap between shoulder parts and its limitations",
                        "describe gap between pin parts and its limitations",
                        "describe diameter of shoulder parts and its limitations",
                        "describe applicability of invention to various metal sheets"
                    ],
                    "outline_short": [
                        "describe double-side friction stir welding process",
                        "illustrate welding process with reference to FIGS. 1 and 2",
                        "explain gap provision between rotating tools",
                        "describe rotation directions of rotating tools",
                        "discuss advantages of opposite rotation directions",
                        "describe inclination angle of rotating tools",
                        "explain gap between shoulder parts of rotating tools",
                        "describe gap between pin parts of rotating tools",
                        "discuss diameter of shoulder parts and welding conditions"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A double-side friction stir welding method in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools are moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\neach of the pair of rotating tools includes a shoulder part and a pin part that is disposed at the shoulder part and that along with the shoulder part includes a common rotation axis, and at least the shoulder parts and the pin parts are made of materials that are harder than materials of the metal sheets or the metal plates,\nwhile the metal sheets or the metal plates are fixed by a gripping device, the pair of rotating tools is respectively pushed against a top surface and a bottom surface of each metal sheet or metal plate, and the rotating tools are moved in the welding direction while being rotated, and\na gap G (mm) between the shoulder parts that is formed by providing a gap g (mm) between ends of the pin parts of the pair of respective rotating tools with respect to a thickness t (mm) of each metal sheet or metal plate or a total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates satisfies\n\n\n0.5×t≤G≤t, and\n\n\nthe pair of rotating tools is further rotated in opposite directions to perform the friction stir welding.",
        "2. A double-side friction stir welding method in which a pair of rotating tools facing each other is respectively disposed on a top-surface side and a bottom-surface side of a butted portion or an overlapping portion, which comprises a joint portion of two metal sheets or two metal plates; the pair of rotating tools is moved in a welding direction while being rotated at the butted portion or the overlapping portion; and while the metal sheets or the metal plates are softened by frictional heat generated between the rotating tools and the metal sheets or the metal plates, softened parts are stirred by the rotating tools to produce a plastic flow to join the metal sheets or the metal plates to each other, wherein\neach of the pair of rotating tools includes a shoulder part and a pin part that is disposed at the shoulder part and that along with the shoulder part includes a common rotation axis, and at least the shoulder parts and the pin parts are made of materials that are harder than materials of the metal sheets or the metal plates,\nwhile the metal sheets or the metal plates are fixed by a gripping device, the pair of rotating tools is pushed against a top surface and a bottom surface of each metal sheet or metal plate, the rotating tools are moved in the welding direction while being rotated, and\nthe rotation axes of the pair of respective rotating tools are inclined at an inclination angle α (°) on a preceding side with respect to the welding direction from a vertical direction with respect to the metal sheets or the metal plates, the inclination angle α\nsatisfies\n\n\n0<α≤3, and\n\n\na gap G (mm) between the shoulder parts that is formed by providing a gap g (mm) between ends of the pin parts of the pair of respective rotating tools with respect to a thickness t (mm) of each metal sheet or metal plate or a total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates and a diameter D (mm) of the shoulder part of each rotating tool satisfies\n\n\n(0.5×t)−(0.2×D×sin α)≤G≤t−(0.2×D×sin α), and\n\n\nthe pair of rotating tools is further rotated in opposite directions to perform the friction stir welding.",
        "3. The double-side friction stir welding method according to claim 1, wherein the diameter D (mm) of each shoulder part with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates satisfies\n\n\n4×t≤D≤20×t.",
        "4. The double-side friction stir welding method according to claim 1, wherein the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates and the diameter D (mm) of the shoulder part of each rotating tool satisfies\n\n\n[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t.",
        "5. The double-side friction stir welding method according to claim 2, wherein the diameter D (mm) of each shoulder part with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates satisfies\n\n\n4×t≤D≤20×t.",
        "6. The double-side friction stir welding method according to claim 2, wherein the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates and the diameter D (mm) of the shoulder part of each rotating tool satisfies\n\n\n[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t.",
        "7. The double-side friction stir welding method according to claim 3, wherein the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates and the diameter D (mm) of the shoulder part of each rotating tool satisfies\n\n\n[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t.",
        "8. The double-side friction stir welding method according to claim 5, wherein the gap g (mm) with respect to the thickness t (mm) of each metal sheet or metal plate or the total thickness t (mm) of the overlapped metal sheets or the overlapped metal plates and the diameter D (mm) of the shoulder part of each rotating tool satisfies\n\n\n[0.1−0.09×exp{−0.011×(D/t)2}]×t≤g≤[1−0.9×exp{−0.011×(D/t)2}]×t."
    ]
}