{
    "id": "US20230257767",
    "authors": [
        "Kenji Masuda",
        "Koichi Nonaka",
        "Hiroki Tanemura"
    ],
    "title": "Promoter of Hspa5 Gene",
    "date": "2023-01-12 00:00:00",
    "abstract": "The present invention provides an approach to enhancing the production of a foreign protein serving as a protein-based pharmaceutical product in host cells such as cultured cells derived from a mammal. The present invention provides transformed cells having a novel Hspa5 gene promoter, and a method for secreting and producing a foreign protein at high levels using the transformed host cells.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to a method for producing a foreign protein using mammalian cells constructed by transfecting mammalian host cells with a foreign gene expression vector having a Hspa5 gene promoter."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define technical field"
                    ],
                    "num_characters": 212,
                    "outline_medium": [
                        "introduce technical field"
                    ],
                    "outline_short": [
                        "introduce technical field"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "The development of gene recombination techniques has rapidly expanded the market of protein-based pharmaceutical products such as therapeutic proteins and antibody drugs. Among them, antibody drugs do not cause adverse immune responses when administered to the human body and are under active development because of their high specificity.",
                        "Examples of hosts to produce the protein-based pharmaceutical products typified by antibody drugs can include microorganisms, yeasts, insects, animal and plant cells, and transgenic animals and plants. Posttranslational modification such as folding or sugar chain modification is essential for the physiological activity or antigenicity of the protein-based pharmaceutical products. Therefore, microorganisms which cannot perform complicated posttranslational modification, or plants which differ significantly in sugar chain structure from humans are not suitable as hosts. Cultured mammalian cells, such as CHO (Chinese hamster ovary) cells, are currently mainstream due to their having a sugar chain structure similar to that of humans and permitting posttranslational modification, and further in consideration of safety.",
                        "Use of cultured mammalian cells as a host presents problems such as low growth rates, low productivity and high cost as compared with microorganisms or the like (Non Patent Literature 1). Furthermore, clinical utilization of protein-based pharmaceutical products requires administering the pharmaceutical products at large doses. Therefore, a lack of sufficient production capacity thereof has been a global issue. In the case of producing a protein-based pharmaceutical product in a cultured mammalian cell expression system, reduction in production cost has been attempted by making improvements to each production step, because the production cost is higher than that of synthetic low-molecular weight pharmaceutical products. However, increasing the amount of protein produced in the cultured mammalian cell expression system is also a promising method for reduction in production cost (Non Patent Literature 2 and 3). Accordingly, in order to increase the productivity of foreign genes in cultured mammalian cells, many approaches such as promoters, enhancers, drug selection markers, gene amplification and culture engineering approaches have been practiced so far through trial and error. In the case of using CHO cells as host cells, a human cytomegalovirus major immediate early promoter (hereinafter, referred to as a CMV promoter) derived from a virus is generally used for the expression of foreign genes, i.e., the production of protein-based pharmaceutical products (Non Patent Literature 4, 5 and 6). It is also known that a polynucleotide upstream of the transcription start site of the gene (promoter region) of elongation factor-1 alpha (EF-1α) (Patent Literature 1 and Non Patent Literature 7) or a human ribosomal protein RPL32 or RPS11 can be used alone or in combination with an additional heterologous promoter in protein expression in CHO cells (Non Patent Literature 8 and Patent Literature 2). However, these promoters regulate the expression of their downstream foreign genes in response to the intracellular physiological conditions of the cultured mammalian cells serving as a host, and often exhibit the maximum activity in the logarithmic growth phase in which the cultured mammalian cells actively proliferate. Thus, the activity of such a promoter is often attenuated in the stationary phase after the cell density reaches its maximum level. Hence, there is a demand for the development of a promoter that permits strong expression of a foreign gene throughout the culture period of cultured mammalian cells."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate protein-based pharmaceutical products",
                        "describe hosts for protein production",
                        "limitations of microorganisms and plants",
                        "advantages of cultured mammalian cells",
                        "problems with cultured mammalian cells",
                        "prior approaches to increasing productivity",
                        "limitations of prior promoters"
                    ],
                    "num_characters": 3709,
                    "outline_medium": [
                        "motivate protein-based pharmaceutical products",
                        "describe limitations of hosts",
                        "discuss prior art promoters"
                    ],
                    "outline_short": [
                        "discuss background art"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Technical Problem",
                            "paragraphs": [
                                "An object of the present invention is to provide an approach to enhancing the amount of a foreign protein, which serves as a protein-based pharmaceutical product, produced using a promoter having high foreign gene expression-enhancing activity in host cells such as cultured mammalian cells. If a promoter is found which has promoter activity comparable to or higher than that of a human EF-1α promoter in CHO cells or the like and maintains its high promoter activity for a long period from the logarithmic growth phase to the stationary phase of cultured mammalian cells, an approach to achieving the stable and high expression of a foreign gene in mammalian cells can be provided. Accordingly, an approach can be provided which contributes to increasing the amount of a protein-based pharmaceutical product produced in a cultured mammalian cell expression system, i.e., reduction in production cost."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "state technical problem"
                            ],
                            "num_characters": 902,
                            "outline_medium": [
                                "state technical problem"
                            ],
                            "outline_short": [
                                "state technical problem"
                            ]
                        },
                        {
                            "title": "Solution to Problem",
                            "paragraphs": [
                                "The present inventors have conducted intensive studies directed towards achieving the aforementioned object. As a result, the inventors have found that a polynucleotide approximately 3 kbp upstream of the start codon of a heat-shock protein A5 (Hspa5/GRP78) gene has excellent promoter activity and is capable of markedly improving the productivity of a foreign protein to be expressed in cultured mammalian cells, thereby completing the present invention. Specifically, the present invention includes the following aspects of the invention.",
                                "(1) A polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 1 or a partial sequence of the nucleotide sequence, the polynucleotide being a Chinese hamster derived Hspa5 gene promoter and comprising a polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 9.\n\n(2) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 1.\n\n(3) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 5.\n\n(4) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 6.\n\n(5) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 7.\n\n(6) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 8.\n\n(7) The polynucleotide according to the above (1), which consists of the nucleotide sequence shown in SEQ ID NO: 9.\n\n(8) A polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 2 in the sequence listing, the polynucleotide being a human-derived Hspa5 gene promoter.\n\n(9) A polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 3 in the sequence listing, the polynucleotide being a mouse-derived Hspa5 gene promoter.\n\n(10) A polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 4 in the sequence listing, the polynucleotide being a rat-derived]Hspa5 gene promoter.\n\n(11) A polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence according to any one of the above (1) to (10), the polynucleotide having promoter activity.\n\n(12) A polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence according to any one of the above (1) to (10), the polynucleotide having promoter activity.\n\n(13) A polynucleotide that hybridizes under stringent conditions to a polynucleotide consisting of a nucleotide sequence complementary to the nucleotide sequence according to any one of the above (1) to (12), the polynucleotide having promoter activity.\n\n(14) A foreign gene expression unit comprising the polynucleotide according to any one of the above (1) to (13).\n\n(15) The foreign gene expression unit according to the above (14), wherein the foreign gene is a gene encoding a multimeric protein.\n\n(16) The foreign gene expression unit according to the above (14), wherein the foreign gene is a gene encoding a heteromultimeric protein.\n\n(17) The foreign gene expression unit according to the above (14), wherein the foreign gene is a gene encoding an antibody or an antigen-binding fragment thereof.\n\n(18) A foreign gene expression vector comprising the foreign gene expression unit according to any one of the above (14) to (17).\n\n(19) A foreign gene expression vector comprising the foreign gene expression unit according to any one of the above (14) to (17) and any one or more polynucleotides selected from polynucleotides (a) to (e) of the following group A:\n\ngroup A\n\n(a) a polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 35 in the sequence listing,\n\n(b) a polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 36 in the sequence listing,\n\n(c) a polynucleotide consisting of the nucleotide sequence shown in SEQ ID NO: 37 in the sequence listing,\n\n(d) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence of any one of the polynucleotides (a) to (c), the polynucleotide having foreign gene expression-enhancing activity, and\n\n(e) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence of any one of the polynucleotides (a) to (c), the polynucleotide having foreign gene expression-enhancing activity.\n\n(20) A transformed cell into which the foreign gene expression vector according to the above (18) or (19) has been introduced.\n\n(21) A transformed cell according to the above (20), wherein the cell is a cultured cell derived from a mammal.\n\n(22) The transformed cell according to the above (21), wherein the cultured cell derived from a mammal is a COS-1 cell, a 293 cell, or a CHO cell.\n\n(23) A method for producing a foreign gene-derived protein, comprising culturing the transformed cell according to any one of the above (20) to (22), and obtaining the foreign gene-derived protein from the culture.\n\n(24) Use of the polynucleotide according to any one of the above (1) to (13) for the purpose of expressing a foreign gene in a transformed cell.\n\n(25) Use of the foreign gene expression vector according to the above (18) or (19) for the purpose of expressing a foreign gene in a transformed cell."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Hspa5 gene promoter",
                                "describe polynucleotide of SEQ ID NO: 1",
                                "describe polynucleotide of SEQ ID NO: 5",
                                "describe polynucleotide of SEQ ID NO: 6",
                                "describe polynucleotide of SEQ ID NO: 7",
                                "describe polynucleotide of SEQ ID NO: 8",
                                "describe polynucleotide of SEQ ID NO: 9",
                                "describe human-derived Hspa5 gene promoter",
                                "describe mouse-derived and rat-derived Hspa5 gene promoters",
                                "describe polynucleotides with high identity to Hspa5 gene promoters"
                            ],
                            "num_characters": 5334,
                            "outline_medium": [
                                "introduce Hspa5 gene promoter",
                                "describe polynucleotide aspects",
                                "describe foreign gene expression unit",
                                "describe foreign gene expression vector",
                                "describe transformed cell and method"
                            ],
                            "outline_short": [
                                "describe solution",
                                "list aspects of invention"
                            ]
                        },
                        {
                            "title": "Advantageous Effects of Invention",
                            "paragraphs": [
                                "The method for producing a foreign protein according to the present invention is capable of markedly enhancing the expression of a foreign gene such as one encoding a therapeutic protein or an antibody. Furthermore, the combination of the promoter of the present invention with a DNA element can further enhance the expression of a foreign gene encoding a therapeutic protein, an antibody, or the like."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize advantageous effects"
                            ],
                            "num_characters": 402,
                            "outline_medium": [
                                "describe advantageous effects"
                            ],
                            "outline_short": [
                                "describe advantageous effects"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS",
                    "paragraphs": [
                        "Hereinafter, the present invention will be specifically described.",
                        "In the present description, the term “gene” means a moiety that is transcribed into mRNA and translated into a protein, and is used to include, not only DNA but also its mRNA and cDNA, and the RNA thereof.",
                        "In the present description, the term “polynucleotide” is used to have the same meaning as that of a nucleic acid, and includes DNA, RNA, a probe, an oligonucleotide, and a primer.",
                        "In the present description, the term “polypeptide” is used without being distinguished from the term “protein”.",
                        "In the present description, the term “gene expression” means a phenomenon in which a gene is transcribed into mRNA, and/or a phenomenon in which the mRNA is translated into a protein.",
                        "In the present description, the term “foreign gene” means a gene that is artificially introduced into host cells.",
                        "In the present description, the term “foreign protein” means a protein encoded by the foreign gene.",
                        "In the present description, the term “gene expression unit” means a polynucleotide having at least a promoter region, a foreign gene, and a transcriptional terminator region (polyA addition signal) in the reading frame direction of transcription.",
                        "In the present description, the term “promoter” means a region to which a transcription factor involved in the start of transcription of DNA into RNA binds. In the present description, the term “promoter region” is also used. Examples of the promoter can include a polynucleotide from a nucleotide approximately 3 kbp upstream of a start codon to a nucleotide immediately upstream of a nucleotide sequence corresponding to the start codon. The promoter may contain 5′UTR and an intron.",
                        "In the present description, the term “promoter activity” refers to activity by which transcription starts through the binding of a transcription factor to the promoter to perform the production of a protein encoded by the gene. Promoter activity can be examined by using, as an indicator, the activity of a protein encoded by a reporter gene, such as firefly luciferase.",
                        "In the present description, the phrase “to have promoter activity” means that an antibody expression level equivalent to or higher than that of a human EF-1α gene promoter is exhibited under conditions similar to those for the evaluation of promoter activity with antibody expression level as an indicator in fed-batch culture described in (Example 5) mentioned later.",
                        "In the present description, the term “DNA element” means a polynucleotide having foreign gene expression-enhancing activity when located in proximity to a gene expression unit or in a foreign gene expression vector comprising the gene expression unit.",
                        "In the present description, the term “antigen-binding fragment of the antibody” means a partial fragment of the antibody having binding activity to the antigen. Examples thereof include Fab and F(ab′)2, though the antigen-binding fragment is not limited to these molecules as long as it has antigen-binding ability.",
                        "In the present description, the term “identity” refers to the relationship between sequences as to two or more nucleotide sequences or amino acid sequences and is determined by the comparison of the sequences, as known in the art. The term “identity” in the art also means, in some cases, the degree of sequence relevance between nucleic acid molecules or between polypeptides when determined depending on the agreement between two or more nucleotide sequences or between two or more amino acid sequences in a row. The term “identity” can be evaluated by calculating percent identity between a smaller sequence of two or more sequences and gap alignment (if present) addressed by a particular mathematical model or computer program (i.e., “algorithm”). Specifically, the identity can be evaluated using software such as ClustalW2 provided by European Molecular Biology Laboratory-European Bioinformatics Institute (EMBL-EBI), though the evaluation method is not limited thereto as long as the method is used by a person skilled in the art.",
                        "In the present description, the phrase “to hybridize under stringent conditions” refers to hybridization under conditions in which a so-called specific hybrid is formed whereas a non-specific hybrid is not formed. Examples thereof can include conditions under which a complementary strand of a nucleic acid consisting of a nucleotide sequence having 80% or higher, preferably 90% or higher, more preferably 95% or higher, most preferably 99% or higher identity to a nucleic acid hybridizes whereas a complementary strand of a nucleic acid consisting of a nucleotide sequence having lower identity does not hybridize. More specifically, the phrase is used to mean that hybridization is carried out in the commercially available hybridization solution ExpressHyb Hybridization Solution (manufactured by Clontech) at 68° C., or that hybridization is carried out under conditions in which hybridization is carried out using a DNA-immobilized filter in the presence of 0.7 to 1.0 M NaCl at 68° C., and the resultant is then washed at 68° C. with a 0.1× to 2×SSC solution (wherein 1×SSC consists of 150 mM NaCl and 15 mM sodium citrate), or conditions equivalent thereto.",
                        "1. Promoter for Use in Enhancement of Foreign Gene Expression",
                        "The foreign promoter for use in the method for producing a foreign gene-derived protein according to the present invention is a promoter of a heat-shock protein A5 gene (hereinafter, referred to as “Hspa5”). The promoter is not particularly limited as long as the promoter is a polynucleotide having activity as a Hspa5 promoter. The Hspa5 promoter is preferably a polynucleotide from a nucleotide approximately 3 kbp upstream of a start codon to a nucleotide immediately upstream of a nucleotide sequence corresponding to the start codon.",
                        "The origin of the Hspa5 promoter is not particularly limited and may be of mammalian origin. Examples thereof can include Chinese hamster, human, mouse, and rat derived Hspa5 promoters.",
                        "The promoter for use in the method for producing a foreign gene-derived protein according to the present invention is preferably a Chinese hamster Hspa5 promoter, more preferably the polynucleotide shown in SEQ ID NO: 1 in the sequence listing and FIG. 12. The nucleotide sequence of SEQ ID NO: 1 is a sequence from a nucleotide approximately 3 kbp upstream of the start codon of Chinese hamster-derived Hspa5 to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon. The nucleotide sequences of SEQ ID NOs: 2, 3, and 4 are sequences from a nucleotide approximately 1 kbp upstream of the start codon of human-derived Hspa5, mouse-derived Hspa5, and rat-derived Hspa5, respectively, to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon. The nucleotide sequences of SEQ ID NOs: 2, 3, and 4 are also shown in FIGS. 13, 14, and 15, respectively.",
                        "The Chinese hamster-derived Hspa5 promoter may have a nucleotide sequence consisting of a partial sequence of the sequence shown in SEQ ID NO: 1. Examples thereof include polynucleotides comprising the sequences shown in SEQ ID NOs: 5, 6, 7, 8 and 9, which are sequences from a nucleotide approximately 2.5, 2.0, 1.5, 1.1 and 0.6 kbp, respectively, upstream of the start codon of Hspa5 to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon. The polynucleotides shown in SEQ ID NOs: 7, 8 and 9 are preferred, and the polynucleotides shown in SEQ ID NOs: 8 and 9 are more preferred.",
                        "The promoter for use in the method for producing a foreign gene-derived protein according to the present invention may be a polynucleotide consisting of a nucleotide sequence having 80% or higher, preferably 90% or higher, more preferably 95% or higher, most preferably 99% or higher identity to the nucleotide sequence shown in any one of SEQ ID NOs: 1 to 9, and having promoter activity.",
                        "The promoter for use in the method for producing a foreign gene-derived protein according to the present invention may be a polynucleotide that hybridizes under stringent conditions to a polynucleotide consisting of a nucleotide sequence complementary to a polynucleotide consisting of any one nucleotide sequence selected from the group consisting of the nucleotide sequences shown in SEQ ID NOs: 1 to 9, and having promoter activity.",
                        "The promoter for use in the method for producing a foreign gene-derived protein according to the present invention may be a mutant polynucleotide consisting of a nucleotide sequence comprising a deletion, substitution, and/or addition of one or more, preferably 1 to 300, more preferably 1 to 30 nucleotides in any one nucleotide sequence selected from the group consisting of the nucleotide sequences shown in SEQ ID NOs: 1 to 9, and having promoter activity.",
                        "The introduction of a mutation (deletion, substitution, and/or addition) into the nucleotide sequence can be performed by an approach known in the art such as the Kunkel method or the gapped duplex method, or a method equivalent thereto. For example, a kit for mutation introduction which exploits site-directed mutagenesis (e.g., Mutant-K (manufactured by Takara Bio Inc.) or Mutant-G (manufactured by Takara Bio Inc.)), or LA PCR in vitro Mutagenesis series kit from Takara Bio Inc. can be utilized. Such a mutant polynucleotide can also be used as the promoter of the present invention.",
                        "The foreign gene expression-enhancing activity possessed by the promoter of the present invention can be examined by using, as an indicator, the activity of a protein encoded by a reporter gene, such as firefly luciferase, or the amount of an antibody produced in fed-batch culture. When the amount of the antibody produced in fed-batch culture is equivalent or higher, preferably 1.2 or more times, more preferably 1.5 or more times higher by use of the promoter of the present invention compared with use of a human EF-1α promoter, it can be determined that this promoter has foreign gene expression-enhancing activity. Even in cases where the amount of an antibody produced in Fed-batch culture is increased by approximately 1.2-fold or more, a reduction of cell culture scale, culture time and the number of purification steps is expected. As a result, an improvement in yield and a reduction in culture cost are attained. The improved yield permits stable supply of a foreign protein as a medicament. Also, the reduced culture cost leads to a reduction in the prime cost of a foreign protein as a medicament.",
                        "2. Foreign Gene Expression Unit",
                        "The foreign gene expression unit for use in the method for producing a foreign gene-derived protein according to the present invention (hereinafter, also referred to as the “gene expression unit of the present invention”) has at least the promoter of the present invention described in the preceding section 1., a foreign gene, and a transcriptional terminator region (polyA addition signal) in the reading frame direction of transcription.",
                        "The polyA addition sequence can be any sequence having the activity of terminating transcription from the promoter, and may be derived from a gene which is the same as or different from the gene of the promoter.",
                        "3. DNA Element for Use in Enhancing Foreign Gene Expression",
                        "Combined use of the gene expression unit of the present invention described in the preceding section 2. with a DNA element can further enhance the expression of a foreign gene. The DNA element for combined use can be obtained by interaction with acetylated histone H3 as an indicator. In general, the acetylation of histone (H3, H4) is reportedly involved in the activation of transcription on the basis of two main hypotheses: that conformational change of the nucleosome is involved such that histone tail acetylation neutralizes the charge thereof to loosen the binding between the DNA and the histone (Mellor J. (2006) Dynamic nucleosomes and gene transcription. Trends Genet. 22 (6): 320-329); and that the acetylation is involved in the recruitment of various transcription factors (Nakatani Y. (2001) Histone acetylases—versatile players. Genes Cells. 6 (2): 79-86). Both of the hypotheses strongly suggest that the acetylation of histone is involved in transcriptional activation. Thus, chromatin immunoprecipitation (ChIP) using an anti-acetylated histone H3 antibody is capable of enriching a sample for a DNA element that interacts with acetylated histone H3.",
                        "Examples of the DNA element for use in the enhancing of foreign gene expression in combination with the promoter of the present invention can include A2, A7, and A18.",
                        "A2 is positioned at a site from 80966429 to 80974878 of human chromosome 15 and is an 8450 bp polynucleotide having an AT content of 62.2%. The nucleotide sequence of A2 is shown in SEQ ID NO: 35 in the sequence listing.",
                        "A7 is positioned at a site from 88992123 to 89000542 of human chromosome 11 and is an 8420 bp polynucleotide having an AT content of 64.52%. The nucleotide sequence of A7 is shown in SEQ ID NO: 36 in the sequence listing.",
                        "A18 is positioned at a site from 111275976 to 111284450 of human chromosome 4 and is an 8475 bp polynucleotide having an AT content of 62.54%. The nucleotide sequence of A18 is shown in SEQ ID NO: 37 in the sequence listing.",
                        "The foreign gene expression-enhancing activity possessed by the DNA element for combined use with the promoter of the present invention can be examined by using, as an indicator, the activity of a protein encoded by a reporter gene, such as SEAP.",
                        "For combined use with the promoter of the present invention, any one of the DNA elements described above may be used alone, or two or more copies of one DNA element may be used. Alternatively, two or more DNA elements may be used in combination.",
                        "The DNA element used in the present invention may consist of a nucleotide sequence having 80% or higher, preferably 90% or higher, more preferably 95% or higher, most preferably 99% or higher identity to the nucleotide sequence shown in any of SEQ ID NOs: 35 to 37, and having foreign gene expression-enhancing activity. A homology search of the nucleotide sequence can be performed using, for example, a program such as FASTA or BLAST and the DNA Databank of JAPAN as the subject of the search.",
                        "A person skilled in the art can readily obtain such a homolog gene of the DNA element of the present invention with reference to Molecular Cloning (Sambrook, J. et al., Molecular Cloning: a Laboratory Manual 2nd ed., Cold Spring Harbor Laboratory Press, 10 Skyline Drive Plainview, N.Y. (1989)), etc. Likewise, the identity of the nucleotide sequence described above can be determined by FASTA search or BLAST search.",
                        "The introduction of a mutation (deletion, substitution, and/or addition) into the polynucleotide can be performed by an approach known in the art such as the Kunkel method or the gapped duplex method, or a method equivalent thereto. For example, a kit for mutation introduction (e.g., Mutant-K (manufactured by Takara Bio Inc.) or Mutant-G (manufactured by Takara Bio Inc.), or LA PCR in vitro Mutagenesis series kit from Takara Bio Inc. can be utilized which exploits site-directed mutagenesis. Such a mutant polynucleotide can also be used as the DNA element of the present invention.",
                        "4. Obtaining the Polynucleotide",
                        "In the present invention, a polynucleotide comprising a foreign gene encoding a foreign protein whose production is to be enhanced as mentioned later can be obtained by a general method given below. The polynucleotide can be isolated, for example, by screening a cDNA library derived from cells or tissues expressing the foreign gene, using a DNA probe synthesized on the basis of the gene fragment. mRNA can be prepared by an approach usually used in the art. For example, the cells or the tissues are treated with a guanidine reagent, a phenol reagent, or the like to obtain total RNA. Then, poly(A)+RNA (mRNA) is obtained therefrom by the affinity column method using an oligo(dT) cellulose column, polyU-Sepharose with Sepharose 2B as a carrier, or the like, or by the batch method. The poly(A)+RNA may be further fractionated by the sucrose density gradient centrifugation method or the like. Subsequently, single-stranded cDNA is synthesized with the obtained mRNA as a template using an oligo dT primer and reverse transcriptase. Double-stranded cDNA is synthesized from the single-stranded cDNA using DNA synthetase I, DNA ligase and RNase H, etc. The synthesized double-stranded cDNA is blunt-ended with T4 DNA synthetase, then subjected to the linkage of an adaptor (e.g., an EcoRI adaptor), phosphorylation, etc., and incorporated into a X phage such as λgt11 for in vivo packaging to prepare a cDNA library. Alternatively, the cDNA library may be prepared using a plasmid vector instead of the X phage. Then, a clone having the DNA of interest (positive clone) can be selected from the cDNA library.",
                        "In the case of isolating a polynucleotide comprising the promoter and a terminator region, the DNA element, or a polynucleotide comprising a foreign gene for use in protein production from genomic DNA, the genomic DNA is extracted from a cell line of an organism serving as a source, followed by polynucleotide selection, according to a general approach (Molecular Cloning (1989) and Methods in Enzymology 194 (1991)). The extraction of the genomic DNA can be performed according to, for example, the method of Cryer et al. (Methods in Cell Biology, 12, 39-44 (1975)) and the method of P. Philippsen et al. (Methods Enzymol., 194, 169-182 (1991)).",
                        "The obtaining of the polynucleotide of interest comprising the promoter, the DNA element, or a foreign gene can also be performed by, for example, PCR (PCR Technology. Henry A. Erlich, Atockton press (1989)). The amplification of the polynucleotide by PCR employs 20 to 30 mer synthetic single-stranded DNA as a primer and genomic DNA as a template. The amplified gene is used after its polynucleotide sequence is confirmed. A genomic DNA library such as a bacterial artificial chromosome (BAC) library may be used as a template for PCR.",
                        "On the other hand, a polynucleotide comprising a foreign gene having an unknown sequence can be obtained by (a) preparing a gene library according to a common method, (b) selecting the desired polynucleotide from the prepared gene library, and amplifying the polynucleotide. The gene library can be prepared by partially digesting chromosomal DNA obtained by a common method from a cell line of an organism serving as a source, with an appropriate restriction enzyme to prepare fragments, ligating the obtained fragments to an appropriate vector, and introducing the vector into an appropriate host. Alternatively, the gene library may be prepared by extracting mRNA from the cells, synthesizing cDNA therefrom, then ligating the cDNA to an appropriate vector, and introducing the vector into an appropriate host. In this respect, a plasmid known as a well known vector for gene library preparation can be used as the vector, and a phage vector or a cosmid, etc. can also be widely used. The host to be transformed or transduced can be used according to the type of vector. The polynucleotide comprising a foreign gene is selected from the gene library by colony hybridization, plaque hybridization, or the like using a labeled probe comprising a sequence unique to the foreign gene.",
                        "The polynucleotide comprising a foreign gene can also be synthesized entirely chemically. The gene can be synthesized by, for example, a method of preparing one pair of complementary oligonucleotides and annealing these, a method of ligating several annealed DNAs using DNA ligase, or a method of preparing several partially complementary oligonucleotides and filling gaps therein by PCR.",
                        "The polynucleotide sequence can be determined by a usual method, for example, the dideoxy method (Sanger et al., Proc. Natl. Acad. Sci., USA, 74, 5463-5467 (1977)). Alternatively, the polynucleotide sequence may be readily determined using a commercially available sequencing kit or the like.",
                        "5. Foreign Gene Expression Vector",
                        "A vector comprising the foreign gene expression unit described in the preceding section 2. comprising the promoter described in the preceding section 1. is provided as a foreign gene expression vector for use in the method for producing a foreign gene-derived protein according to the present invention. The foreign gene expression vector for use in the method for producing a foreign gene-derived protein according to the present invention may comprise one of the DNA elements described in the preceding section 3., two or more copies of one DNA element, or a combination of two or more DNA elements. When a foreign gene is expressed in host cells using the foreign gene expression vector, the DNA element may be located immediately preceding or immediately following the gene expression unit, or may be located at a position distant from the gene expression unit. Alternatively, one foreign gene expression vector comprising a plurality of DNA elements may be used. The orientation of the DNA element may be either the forward direction or the reverse direction with respect to the gene expression unit.",
                        "Examples of the foreign gene can include, but are not particularly limited to: reporter genes such as secreted alkaline phosphatase (SEAP) gene, green fluorescence protein (GFP) gene, and luciferase gene; various enzyme genes such as α-amylase gene and α-galactosidase gene; genes of various interferons such as interferon α and interferon γ, which are pharmaceutically useful physiologically active proteins; genes of various interleukins such as IL1 and IL2; various cytokine genes such as erythropoietin (EPO) gene and granulocyte colony-stimulating factor (G-CSF) gene; growth factor genes; and a gene encoding a multimeric protein, for example, a gene encoding a heteromultimer which is an antibody or an antigen-binding fragment thereof. These genes may be obtained by any approach.",
                        "The term “antigen-binding fragment of the antibody” means a partial fragment of the antibody having binding activity to the antigen. Examples thereof include Fab, F(ab′)2, Fv, scFv, diabody, linear antibodies, and multispecific antibodies formed from antibody fragments. Also, Fab′, which is a monovalent fragment of antibody variable regions obtained by the treatment of F(ab′)2 under reductive conditions is included in the antigen-binding fragment of the antibody. However, the antigen-binding fragment is not limited to these molecules as long as it has antigen-binding ability. Furthermore, these antigen-binding fragments also include, not only a fragment obtained by the treatment of the full-length molecule of an antibody protein with an appropriate enzyme but also a protein produced in appropriate host cells using a genetically engineered antibody gene.",
                        "The foreign gene expression vector for use in the method for producing a foreign gene-derived protein according to the present invention can comprise a selection marker for selecting a transformant. The transformant can be selected using, for example, a drug resistance marker which confers resistance to a drug such as cerulenin, aureobasidin, zeocin, canavanine, cycloheximide, hygromycin, puromycin, blasticidin, tetracycline, kanamycin, ampicillin, or neomycin. Alternatively, the transformant may be selected by using, as a marker, a gene that confers, for example, solvent resistance to ethanol or the like, osmotic pressure resistance to glycerol, a salt, or the like, or metal ion resistance to copper or the like.",
                        "The foreign gene expression vector for use in the method for producing a foreign gene-derived protein according to the present invention may be a vector that is not integrated into chromosomal DNA. In general, the foreign gene expression vector is randomly integrated into the chromosome after transfection of host cells. By contrast, use of a constituent derived from a mammalian virus such as simian virus 40 (SV40), papillomavirus (BPV, HPV), or EBV allows the foreign gene expression vector to be used as an episomal vector capable of replicating autonomously in the transfected host cells. For example, a vector having a sequence encoding a SV40-derived replication origin and a trans-acting factor SV40 large T antigen, or a vector having a sequence encoding EBV-derived oriP and EBNA-1 is widely used. The DNA element is capable of exhibiting foreign gene expression-enhancing activity, regardless of the type of vector or the presence or absence of integration into the chromosome.",
                        "6. Transformed Cells",
                        "The transformed cells for use in the method for producing a foreign gene-derived protein according to the present invention are transformed cells comprising the foreign gene expression vector of the preceding section 5. introduced thereinto.",
                        "The host cells to be transformed are eukaryotic cells, preferably mammalian cells, more preferably human-, mouse-, rat-, hamster-, monkey-, or bovine-derived cells. Examples of the mammalian cells can include, but are not limited to, COS-1 cells, 293 cells, and CHO cells (CHO-KI, DG44, CHO dhfr-, CHO-S).",
                        "In the present invention, the method for introducing the expression vector into host cells can be any method as long as the method allows the introduced gene to be present stably in the host and to be appropriately expressed. Examples thereof can include methods generally used, for example, the calcium phosphate method (Ito et al., (1984) Agric. Biol. Chem., 48, 341), electroporation (Becker, D. M. et al. (1990) Methods. Enzymol., 194, 182-187), the spheroplast method (Creggh et al., Mol. Cell. Biol., 5, 3376 (1985)), the lithium acetate method (Itoh, H. (1983) J. Bacteriol. 153, 163-168), and lipofection.",
                        "7. Method for Producing Foreign Protein",
                        "The method for producing a foreign protein according to the present invention can be performed by culturing the transformed cells described in the preceding section 6. by a known method, and collecting the foreign protein from the culture, followed by purification. The “culture” means any of a culture supernatant, cultured cells, and a cell homogenate. Not only a monomeric protein but also a multimeric protein may be selected as the foreign protein that can be produced using the transformed cells described in section 6. In the case of producing a heteromultimeric protein constituted by a plurality of different subunits, a plurality of genes encoding these subunits each need to be introduced into the host cells described in section 6.",
                        "The method for culturing the transformed cells can be performed according to a usual method for use in the culture of the host cells.",
                        "When the transformed cells are mammalian cells, the transformed cells are cultured, for example, at 37° C. under 5% or 8% CO2 conditions for a culture time on the order of 24 to 1000 hours. The culture can be carried out by, for example, static culture, shake culture, stirring culture, batch culture under aeration, fed-batch culture, perfusion culture or continuous culture.",
                        "The expression product of the foreign protein gene from the culture (culture solution) described above can be confirmed by SDS-PAGE, Western blotting, ELISA, or the like.",
                        "8. Method for Producing Antibody Protein",
                        "Examples of the heteromultimeric protein to be produced using the production method described in the preceding section 7. can include antibody proteins. The antibody protein is a tetramer protein consisting of two molecules of a heavy chain polypeptide and two molecules of a light chain polypeptide. Thus, for obtaining an antibody protein in a form that maintains antigen-binding ability, it is necessary to introduce both heavy chain and light chain genes into the transformed cells described in the preceding section 6. In this case, heavy chain and light chain gene expression units may be present on the same expression vector or may be present on different expression vectors.",
                        "Examples of the antibody to be produced according to the present invention can include antibodies prepared by immunizing laboratory animals such as rabbits, mice, and rats with the desired antigen. Further examples of the antibody to be produced according to the present invention can include chimeric antibodies and humanized antibodies originating from the antibodies described above. In addition, a human antibody obtained from a genetically engineered animal or by the phage display method is also an antibody to be produced according to the present invention.",
                        "The antibody gene for use in antibody production is not limited to an antibody gene having a particular polynucleotide sequence as long as a combination of a heavy chain polypeptide and a light chain polypeptide obtained by the transcription of the antibody gene and subsequent translation retains the activity of binding to an arbitrary antigen protein.",
                        "The antibody gene is not necessarily required to encode the full-length molecule of the antibody. A gene encoding an antigen-binding fragment of the antibody can be used. The gene encoding such an antigen-binding fragment can be obtained by genetically engineering a gene encoding the full-length molecule of the antibody protein.",
                        "9. Methods for Producing Other Foreign Proteins",
                        "Examples of the foreign protein to be produced by the production method of the present invention can include the antibodies mentioned above as well as various human- or non-human animal-derived proteins, antigen-binding fragments thereof, and modified forms of the proteins or the fragments. Examples of such a protein and the like can include, but are not limited to: peptide hormones such as atrial natriuretic peptide (ANP), brain natriuretic peptide (BNP), C-type natriuretic peptide (CNP), vasopressin, somatostatin, growth hormone (GH), insulin, oxytocin, ghrelin, leptin, adiponectin, renin, calcitonin, osteoprotegerin, and insulin-like growth factor (IGF); cytokines such as interleukin, chemokine, interferon, tumor necrosis factor (TNFα/β as well as TNF superfamily, etc.), nerve growth factor (NGF), cell growth factor (EGF, FGF, PDGF, HGF, TGF, etc.), hematopoietic factor (CSF, G-CSF, erythropoietin, etc.), and adiponectin; receptors such as TNF receptor; enzymes such as lysozyme, protease, proteinase, and peptidase; functional fragments thereof (fragments partially or wholly retaining the biological activity of the original protein); and fusion proteins comprising these proteins."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "Hereinafter, the present invention will be specifically described with reference to Examples. However, these Examples do not limit the technical scope of the present invention by any means. Plasmids, restriction enzymes, DNA-modifying enzymes, etc. used in Examples of the present invention are commercially available and can be used according to common methods. Operations used in DNA cloning, polynucleotide sequencing, transformation of host cells, culture of transformed cells, collection of a protein from the resulting culture, purification, etc. are also well known to a person skilled in the art or can be derived from the literature.",
                                "**(Example 1) Construction of Humanized Antibody X-Expressing Cell Line**",
                                "1-1) Construction of Humanized Antibody Gene X Expression Vector",
                                "Humanized antibody gene X expression vector pDSLH4.1-X having pDSLH4.1 described in Non Patent Literature 9 as a vector backbone was constructed.",
                                "1-2) Generation of Humanized Antibody X-Expressing Stable Pool",
                                "CHO-KI cells (ATCC) were adapted to suspension culture in a serum-free suspension culture condition, to obtain CHO-01 cells as host cells. The CHO-01 cells were transfected with the humanized antibody gene X expression vector pDSLH4.1-X constructed in (1-1) using a transfection apparatus Neon Transfection System (Invitrogen), and cultured in 5% CO2 at 37° C. in a T25 flask. One day after the transfection, Geneticin (Life Technologies Corporation) was added thereto at a final concentration of 800 μg/mL, followed by drug selection culture for 1 week. Then, the cells were cultured in 5% CO2 at 37° C. in a 125 mL Erlenmeyer flask to obtain a humanized antibody X-expressing stable pool.",
                                "1-3) Construction of Humanized Antibody X-Expressing Cell Line",
                                "The humanized antibody X-expressing stable pool generated in (1-2) was monocloned to obtain humanized antibody X-expressing cell lines X #1 and X #2.",
                                "Specifically, the humanized antibody X-expressing stable pool generated in (1-2) was suspended in a soft agar medium, seeded onto a 6-well plate, and cultured in 5% CO2 at 37° C. After the culturing, a colony highly expressing humanized antibody X was picked onto a 96-well plate using ClonePix 2 (Genetix). The colony thus picked was subcultured by successive cell expansion steps to a 24-well plate, a 6-well plate, a T25 flask, and a 125 mL Erlenmeyer flask in that order, to obtain humanized antibody X-expressing cell lines X #1 and X #2.",
                                "**(Example 2) Transcriptome Analysis of Humanized Antibody X-Expressing Cell Lines X #1 and X #2**",
                                "Fed-batch culture was performed using the humanized antibody X-expressing cell lines X #1 and X #2 generated in Example 1. Transcriptome analysis was conducted on the time-dependent samples thereof to identify a highly expressed gene.",
                                "2-1) Fed-Batch Culture of Humanized Antibody X-Expressing Cell Lines X #1 and X #2",
                                "Each humanized antibody X-expressing cell line generated in Example 1 was subjected to fed-batch culture in a 1 L jar. For Jar #1, the cell line used was X #1, and the basal medium/feed medium used was G13 (custom medium manufactured by JX Energy)/F13 (custom medium manufactured by JX Energy). For Jar #2, the cell line used was X #1, and the basal medium/feed medium used was DA1 (custom medium manufactured by Life Technologies Corporation)/DAFM3 (custom medium manufactured by Life Technologies Corporation). For Jar #3, the cell line used was X #2, and the basal medium/feed medium used was G13/F13.",
                                "The change in the number of viable cells and the change in the amount of the antibody produced are shown in FIGS. 1A and 1B, respectively. The amount of antibody produced was compared between the cell lines and was found to be higher in X #1 than in X #2. The amount of antibody produced was compared between the basal media/feed media and was found to be higher in G13/F13 than in DA1/DAFM3.",
                                "2-2) Transcriptome Analysis of Humanized Antibody X-Expressing Cell Lines X #1 and X #2",
                                "Total RNA was extracted using RNAiso Plus (Takara Bio Inc.) from the cells on days 4, 7, 9, 11, and 14 of the fed-batch culture carried out in (2-1). Subsequently, a sequencing library was prepared using TruSeq RNA Sample Prep Kit v2 (illumina). Specifically, polyA+RNA was isolated from the total RNA and fragmented. Double-stranded cDNA was synthesized with the obtained RNA fragments as templates. The synthesized double-stranded cDNA was blunt-ended at both ends and phosphorylated, followed by 3′-dA overhang reaction. An indexed adaptor was linked thereto. The adaptor-linked double-stranded cDNA was used as a template in PCR amplification. Then, the obtained PCR products were purified by the magnetic bead method using AMPure XP (Beckman Coulter) to prepare a sequencing library. Then, a cluster serving as a sequencing template was formed using the sequencing library and applied to a HiSeq 2000 system (illumina) where high-speed sequencing analysis was conducted to obtain sequencing data.",
                                "2-3) Data Analysis of Transcriptome Analysis Results",
                                "Read sequences obtained by the sequencing analysis were mapped onto reference sequences using Bowtie (version. 1.0.0) described in Non Patent Literature 10. The reference sequences were prepared by adding spliced sequences extracted on the basis of Chinese hamster gene information registered in NCBI to Chinese hamster chromosomal sequences registered in NCBI. The expression levels of the read sequences (RPKM: reads per kilobase of exon [intron/intergenic] model per million mapped reads) and novel gene expression regions were studied using ERANGE 3.2 described in Non Patent Literature 11.",
                                "The top 20 genes having the highest expression level in the cells on day 4 of Jar #1 are shown in Table 1. The expression levels of the above-mentioned 20 genes on each day of sampling of Jar #1, Jar #2, and Jar #3 are shown in FIGS. 2A, 2B, and 2C, respectively. The Hspa5 (heat shock protein 5) gene exhibited a higher level of expression at the late stage of culture under all the conditions of Jar #1, Jar #2, and Jar #3, and the Fth1 (ferritin heavy chain 1) gene exhibited a higher level of expression at the late stage of culture under the conditions of Jar #2 and Jar #3. The expression level of the Hspa5 gene rose at the late stage of culture irrespective of cell line and medium conditions, suggesting that its promoter activity was increased at the late stage of culture.",
                                "**(Example 3) Cloning of Promoter Region of Highly Expressed Gene**",
                                "The promoter region of each gene was cloned for the 18 genes among the top 20 genes having the highest expression level found in Example 2 except for tRNA.",
                                "3-1) Cloning of Hspa5 Promoter Region",
                                "The Hspa5 promoter region used was a sequence from a nucleotide approximately 3.0 kbp upstream of the start codon of Hspa5 to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon with reference to the sequence of mRNA registered under NM_001246739.1 and the scaffold sequence of the Chinese hamster genome registered under NW_003615108.1 in GenBank.",
                                "The Hspa5 promoter region was amplified by PCR with the genomic DNA of CHO cells as a template using the primer set given below and KOD FX Neo (Toyobo), and the PCR product was purified using QIAquick PCR Purification kit (Qiagen). The purified DNA fragment was digested with KpnI-HindIII and then inserted into the KpnI-HindIII site of pGL4.10[luc2] (Promega) to construct pGL4.10-Hspa5. The nucleotide sequence of the cloned Hspa5 promoter region is shown in SEQ ID NO: 1 in the sequence listing.",
                                "3-2) Cloning of Promoter Regions of Other Highly Expressed Genes",
                                "In accordance with the method described in the preceding section 3-1), Rps14 (ribosomal protein S14), Gapdh (glyceraldehyde-3-phosphate dehydrogenase), Eef1a1 (eukaryotic translation elongation factor 1 alpha 1), Rps11 (40S ribosomal protein S11-like), Rplp0 (60S acidic ribosomal protein PO-like), Rps4 (ribosomal protein S4), PKM (pyruvate kinase isozymes M1/M2-like), Rps2 (ribosomal protein S2), Actb (actin, beta), Chub2 (polyubiquitin), Rps3 (40S ribosomal protein S3a-like), Prdx1 (peroxiredoxin 1), Rpsa (ribosomal protein SA), Rps25 (40S ribosomal protein S25-like), Rpl8 (60S ribosomal protein L8-like), Fth1 (ferritin heavy chain 1), and Hspd1 (heat shock protein 1) promoter regions were each cloned and inserted into the multicloning site of pGL4.10[luc2].",
                                "3-3) Construction of pGL4.10-hEF1α",
                                "Next, a human EF1-α promoter was amplified by PCR with pEF1/V5-His A (Invitrogen) as a template using the primer set given below and KOD-Plus-Ver. 2 (Toyobo), and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with NheI-HindIII and then inserted into the NheI-HindIII site of pGL4.10[luc2] to construct pGL4.10-hEF1α.",
                                "**(Example 4) Activity Evaluation of Each Promoter with Transient Expression Level of Firefly Luciferase as Indicator**",
                                "4-1) Transfection",
                                "The CHO-01 cells described in (1-2) were suspended at 2.5×105 cells/mL in Opti-MEM I Reduced Serum Medium (Life Technologies Corporation) and seeded at 1 mL/well onto a 24-well plate. 3.2 μg of pGL4.10[luc2] having an insert of each promoter constructed in Example 3, and 0.4 μg of control vector pGL4.74[hRluc/TK] for transfection efficiency correction (Promega) were diluted with 68 μL of OptiPro SFM (Life Technologies Corporation). Meanwhile, 8 μL of Lipofectamine 2000 CD (Life Technologies Corporation) was diluted with 68 μL of OptiPro SFM, mixed with the plasmid solution, and left at room temperature for 20 minutes. Then, half the amount was added to each of 2 wells and cultured in 5% CO2 at 37° C.",
                                "4-2) Luciferase Assay",
                                "On the day following transfection, the transient expression level of luciferase was measured using a Dual-Luciferase Reporter Assay System (Promega). Specifically, the culture solution was centrifuged at 9000 G for 1 minute, and the supernatant was removed. The cell pellets were washed once with PBS. Then, a cell lysate was prepared using the Passive Lysis Buffer attached to the kit. Then, the amounts of luminescence of firefly luciferase and Renilla luciferase were measured using the kit and a luminometer.",
                                "FIG. 3 shows a value obtained by transfecting the cells with the luciferase expression vector having an insert of each promoter, and normalizing the amount of luminescence of firefly luciferase (luc2) with the amount of luminescence of Renilla luciferase (Rluc) measured on the next day. Eef1a1 exhibited strong promoter activity, which was comparable to that of human EF1-α used as a control. Hspa5 exhibited the second strongest promoter activity after Eef1a1 among the studied promoters.",
                                "**(Example 5) Evaluation of Hspa5 Promoter by Fed-Batch Culture with Antibody Expression Level as Indicator**",
                                "In the transcriptome analysis, the expression level of the Hspa5 gene was increased at the late stage of culture, suggesting enhanced promoter activity at the late stage of culture. Also, the Hspa5 gene promoter exhibited strong promoter activity in the evaluation of transient expression using the luciferase assay. Accordingly, this promoter was evaluated by the fed-batch culture of an antibody expressing stable pool.",
                                "5-1) Construction of Antibody Expression Vector",
                                "Humanized antibody gene Y expression vector pDSLHA4.1-hRPS7-Y having pDSLH4.1 described in Non Patent Literature 9 as a vector backbone was constructed. This vector contained the human RPS7 promoter described in Patent Literature 2 for the expression of antibody H chain and L chain genes and DNA element A7 described in Patent Literature 2 as a DNA element. Subsequently, pDSLHA4.1-Hspa5-Y and pDSLHA4.1-hEF1α-Y were constructed by substituting the promoter for the antibody H chain and L chain genes in the humanized antibody gene Y expression vector pDSLHA4.1-hRPS7-Y with a Hspa5 or human EF1-α promoter. The vectors are schematically shown in FIG. 4.",
                                "pDSLHA4.1-Hspa5-Y was constructed by the following method: first, a Chinese hamster Hspa5 promoter was amplified by PCR with pGL4.10-Hspa5 as a template using the primer set given below and PrimeSTAR Max DNA Polymerase (Takara Bio Inc.), and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with NotI-XbaI and then inserted into the NotI-NheI sites of H chain gene expression vector pDSH1.1-hRPS7-Y and L chain gene expression vector pDSL2.1-hRPS7-Y to construct pDSH1.1-Hspa5-Y and pDSL2.1-Hspa5-Y, respectively. Next, a DNA fragment obtained by the digestion of pDSL2.1-Hspa5-Y with AatII-HindIII was inserted into the AatII-HindIII site of pDSH1.1-Hspa5-Y to construct pDSLH3.1-Hspa5-Y. DNA element A7 described in Patent Literature 2 was inserted upstream of the expression cassette of pDSLH3.1-Hspa5-Y to construct pDSLHA4.1-Hspa5-Y.",
                                "On the other hand, pDSLHA4.1-hEF1α-Y was constructed by the following method: first, a human EF1-α promoter was amplified by PCR with pGL4.10-hEF1α as a template using the primer set given below and KOD-Plus-Ver. 2, and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with NotI-NheI and then inserted to the NotI-NheI sites of H chain gene expression vector pDSH1.1-hRPS7-Y and L chain gene expression vector pDSL2.1-hRPS7-Y to construct pDSH1.1-hEF1α-Y and pDSL2.1-hEF1α-Y, respectively. Next, a DNA fragment obtained by the digestion of pDSL2.1-hEF1α-Y with AatII-HindIII was inserted into the AatII-HindIII site of pDSH1.1-hEF1α-Y to construct pDSLH3.1-hEF1α-Y. DNA element A7 described in Patent Literature 2 was inserted upstream of the expression cassette of pDSLH3.1-hEF1α-Y to construct pDSLHA4.1-hEF1α-Y.",
                                "5-2) Generation of Humanized Antibody Y-Expressing Stable Pool",
                                "The CHO-01 cells described in (1-2) were transfected with the antibody expression vector pDSLHA4.1-Hspa5-Y, pDSLHA4.1-hRPS7-Y, or pDSLHA4.1-hEF1α-Y constructed in (5-1), according to the method described in (4-1). One day after the transfection, the culture solution was centrifuged, and the supernatant was removed. The cell pellets were suspended in a medium containing 800 μg/mL Geneticin, followed by drug selection culture for 1 week on a 6-well plate. Then, the transfectants were cultured in 5% CO2 at 37° C. in a T25 flask and subsequently in a 125 mL Erlenmeyer flask to generate a humanized antibody Y-expressing stable pool. The stable pool was generated at N=2 with each antibody expression vector.",
                                "5-3) Evaluation of Amount of Antibody Produced by Fed-Batch Culture of Humanized Antibody Y-Expressing Stable Pool",
                                "Fed-batch culture was performed in a 125 mL Erlenmeyer flask using each humanized antibody Y-expressing stable pool generated in (5-2). The basal medium used was G13, and the feed medium used was F13.",
                                "Change in the number of viable cells, change in the amount of the antibody produced, and change in the amount of the antibody produced per cell and per day (SPR: specific production rate) are shown in FIGS. 5A, 5B, and 5C, respectively. The amount of the antibody produced per cell and per day was calculated by dividing the amount of the antibody produced at the time of sampling by the integrated number of viable cells up to the time of sampling. At the initial stage of culture, both the amount of the antibody produced and the amount of the antibody produced per cell and per day for the Hspa5 promoter were comparable to those for the human RPS7 promoter used as a control and lower than those for the human EF1-α promoter. However, the amount of the antibody produced per cell and per day for the Hspa5 promoter increased drastically at the intermediate stage or later of culture and was 1.3 and 0.9 times the values for the human RPS7 promoter and the human EF1-α promoter, respectively, on day 10 of culture and 1.8 and 1.4 times the values for the human RPS7 promoter and the human EF1-α promoter, respectively, on day 14 of culture. As a result, the amount of the antibody produced for the Hspa5 promoter on day 14 of culture reached 1.5 and 1.4 times the values for the human RPS7 promoter and the human EF1-α promoter, respectively, and thus greatly exceeded the amount of the antibody produced for the promoters currently frequently used.",
                                "5-4) mRNA Expression Level Evaluation by Fed-Batch Culture of Humanized Antibody Y-Expressing Stable Pool",
                                "The mRNA expression level of the antibody Y gene of interest was compared by real-time PCR using the cells obtained over time in the fed-batch culture carried out in (5-3). Total RNA was extracted from the cells on days 4, 6, 9, 10, and 11 of fed-batch culture using a RNeasy Micro Kit (Qiagen), and cDNA was synthesized by a reverse transcription reaction with the total RNA as a template using a PrimeScript High Fidelity RT-PCR Kit (Takara Bio Inc.). Next, real-time PCR was carried out with the reverse transcription reaction solution as a template using the primer set given below and SYBR Premix Ex Taq II (Takara Bio Inc.). Calibration curves were prepared using the humanized antibody Y expression vector used in transfection for the H chain gene, and plasmid DNA obtained by the TOPO cloning of a DNA fragment amplified with the primer set given below for the Gapdh gene to calculate the numbers of copies of the H chain gene and the Gapdh gene in each sample. The expression level of the H chain gene normalized by dividing the number of copies of the H chain gene by the number of copies of the Gapdh gene in each sample is shown in FIG. 6. At the initial stage of culture, the mRNA expression level of the H chain gene under the Hspa5 promoter was comparable to that under the human RPS7 promoter used as a control and lower than that under the human EF1-α promoter. However, the expression level of the H chain gene under the Hspa5 promoter was increased greatly at the intermediate stage or later of culture and largely exceeded the values under the human RPS7 promoter and the human EF1-α promoter. The results showing this time-dependent change in mRNA expression level were similar to the results for the protein expression level shown in FIG. 5C. These results indicated that the increase in protein expression level at the late stage of culture for the Hspa5 promoter was ascribable to an increase in promoter activity of the Hspa5 promoter.",
                                "**(Example 6) Evaluation of Hspa5 Promoter by Fed-Batch Culture with Renilla Luciferase Expression Level as Indicator**",
                                "6-1) Construction of Renilla Luciferase Expression Vector",
                                "A Hspa5 promoter, a human RPS7 promoter, or a human EF1-α promoter was inserted into the multicloning site of Renilla luciferase expression vector pGL4.82[hRluc/Puro] (Promega) to construct pGL4.82-Hspa5, pGL4.82-hRPS7, or pGL4.82-hEF1α.",
                                "Specifically, the KpnI-HindIII-digested Hspa5 promoter prepared in (3-1) was inserted into the KpnI-HindIII site of pGL4.82[hRluc/Puro] to construct pGL4.82-Hspa5.",
                                "Next, a human RPS7 promoter was amplified by PCR with pDSLHA4.1-hRPS7-Y as a template using the primer set given below and PrimeSTAR Max DNA Polymerase (Takara Bio Inc.), and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with XhoI-HindIII and then inserted into the XhoI-HindIII site of pGL4.82[hRluc/Puro] to construct pGL4.82-hRPS7.",
                                "Also, the NheI-HindIII-digested human EF1-α promoter prepared in (3-3) was inserted into the NheI-HindIII site of pGL4.82[hRluc/Puro] to construct pGL4.82-hEF1α.",
                                "6-2) Generation of Renilla Luciferase-Expressing Stable Pool",
                                "The CHO-01 cells described in (1-2) were transfected with the Renilla luciferase expression vector pGL4.82-Hspa5, pGL4.82-hRPS7, or pGL4.82-hEF1α constructed in (6-1), according to the method described in (4-1). One day after the transfection, the culture solution was centrifuged, and the supernatant was removed. The cell pellets were suspended in a medium containing 8 μg/mL puromycin, followed by drug selection culture for 12 days on a 6-well plate. Then, the transfectants were cultured in 5% CO2 at 37° C. in a T25 flask and subsequently in a 125 mL Erlenmeyer flask to generate a Renilla luciferase-expressing stable pool. The stable pool was generated at N=3 with each Renilla luciferase expression vector.",
                                "6-3) Evaluation of Amount of Protein Produced by Fed-Batch Culture of Renilla Luciferase Expressing Stable Pool",
                                "Fed-batch culture was performed in a 125 mL Erlenmeyer flask using each Renilla luciferase-expressing stable pool generated in (6-2). The basal medium used was G13, and the feed medium used was F13. The expression level of Renilla luciferase was measured with respect to the cells on days 3, 4, 7, 9, and 11 of fed-batch culture using Renilla Luciferase Assay System (Promega).",
                                "Specifically, the culture solution was centrifuged at 9000 G for 1 minute, and the supernatant was removed. The cell pellets were washed once with PBS. Then, a cell lysate was prepared using Renilla Luciferase Assay Lysis Buffer attached to the kit. Then, the amount of luminescence of Renilla luciferase was measured using the kit and a luminometer.",
                                "Change in the number of viable cells and change in the amount of luminescence of Renilla luciferase per 103 cells are shown in FIGS. 7A and 7B, respectively. In the cells at the initial stage of culture, the amount of luminescence of Renilla luciferase for the Hspa5 promoter was higher than that for the human RPS7 promoter used as a control and comparable to that for the human EF1-α promoter. However, the amount of luminescence of Renilla luciferase for the Hspa5 promoter was increased over time in the cells at the intermediate stage or later of culture, whereas the amount of luminescence of Renilla luciferase decreased drastically for the human RPS7 promoter and the human EF1-α promoter. Hence, in the cells on day 11 of culture, the amount of luminescence of Renilla luciferase for the Hspa5 promoter was as large as 4.5 and 4.8 times the values for the human RPS7 promoter and the human EF1-α promoter, respectively. Thus, as a result of attempting the expression of Renilla luciferase, it was possible to confirm that the Hspa5 promoter was superior to the existing human RPS7 promoter and human EF1-α promoter in the effect of enhancing the amount of protein produced in a system other than an antibody expression system. These results indicated that the Hspa5 promoter is also useful in the production of proteins other than antibodies.",
                                "**(Example 7) Study on Hspa5 Promoter Length with Antibody Expression Level as Indicator in Fed-Batch Culture**",
                                "7-1) Construction of Antibody Expression Vector",
                                "pDSLHA4.1-Hspa5-2.5-Y, pDSLHA4.1-Hspa5-2.0-Y, pDSLHA4.1-Hspa5-1.5-Y, pDSLHA4.1-Hspa5-1.1-Y, and pDSLHA4.1-Hspa5-0.6-Y were constructed by substituting the promoter for antibody H chain and L chain genes in the humanized antibody gene Y expression vector pDSLHA4.1-hRPS7-Y by a partial sequence of the Hspa5 promoter. In these expression vectors, the partial sequence of the Hspa5 promoter used was a sequence from a nucleotide approximately 2.5, 2.0, 1.5, 1.1, and 0.6 kbp, respectively, upstream of the start codon of Hspa5 to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon.",
                                "pDSLHA4.1-Hspa5-2.5-Y was constructed by the following method: first, the partial sequence of the Chinese hamster Hspa5 promoter was amplified by PCR with pGL4.10-Hspa5 as a template using the primer set given below and PrimeSTAR Max DNA Polymerase, and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with NotI-XbaI and then inserted to the NotI-NheI sites of H chain gene expression vector pDSH1.1-hRPS7-Y and L chain gene expression vector pDSL2.1-hRPS7-Y to construct pDSH1.1-Hspa5-2.5-Y and pDSL2.1-Hspa5-2.5-Y, respectively. Next, a DNA fragment obtained by the digestion of pDSL2.1-Hspa5-2.5-Y with AatII-HindIII was inserted into the AatII-HindIII site of pDSH1.1-Hspa5-2.5-Y to construct pDSLH3.1-Hspa5-2.5-Y. DNA element A7 described in Patent Literature 2 was inserted upstream of the expression cassette of pDSLH3.1-Hspa5-2.5-Y to construct pDSLHA4.1-Hspa5-2.5-Y. pDSLHA4.1-Hspa5-2.0-Y, pDSLHA4.1-Hspa5-1.5-Y, pDSLHA4.1-Hspa5-1.1-Y, and pDSLHA4.1-Hspa5-0.6-Y were constructed in the same way as above.",
                                "7-2) Generation of Humanized Antibody Y-Expressing Stable Pool",
                                "The CHO-01 cells described in (1-2) were transfected with the antibody expression vector pDSLHA4.1-hRPS7-Y, pDSLHA4.1-hEF1α-Y, pDSLHA4.1-Hspa5-Y, pDSLHA4.1-Hspa5-2.5-Y, pDSLHA4.1-Hspa5-2.0-Y, pDSLHA4.1-Hspa5-1.5-Y, pDSLHA4.1-Hspa5-1.1-Y, or pDSLHA4.1-Hspa5-0.6-Y constructed in (5-1) or (7-1), according to the method described in (4-1). Then, drug selection culture was performed by the method described in (5-2) to generate a humanized antibody Y-expressing stable pool. The stable pool was generated at N=3 with each antibody expression vector.",
                                "7-3) Evaluation of Amount of Antibody Produced by Fed-Batch Culture of Humanized Antibody Y-Expressing Stable Pool",
                                "Fed-batch culture was performed in a 125 mL Erlenmeyer flask using each humanized antibody Y-expressing stable pool generated in (7-2). The basal medium used was G13, and the feed medium used was F13.",
                                "Change in the number of viable cells, change in the amount of the antibody produced, and change in the amount of the antibody produced per cell and per day (SPR: specific production rate) are shown in FIGS. 8A, 8B, and 8C, respectively. Unexpectedly, the Hspa5 promoters having a length decreased from 3.0 kbp to 0.6 or 1.1 kbp exhibited high productivity from the initial stage of culture. On day 5 of culture, both the amount of the antibody produced and the amount of the antibody produced per cell and per day for the Hspa5 promoters were higher than those for the human RPS7 promoter and the human EF1-α promoter used as controls. Furthermore, the amount of the antibody produced per cell and per day was increased at the intermediate stage or later of culture, irrespective of the length of the Hspa5 promoter, and both the values for the 0.6 and 1.1 kbp Hspa5 promoters were 2.3 times the value for the human EF1-α promoter on day 14 of culture. As a result, the amounts of the antibody produced for the 0.6 and 1.1 kbp Hspa5 promoters on day 14 of culture both exceeded 0.5 g/L and reached 2.1 and 2.0 times, respectively, the value for the human EF1-α promoter. The Hspa5 promoter having the optimized length was able to exert its maximum promoter activity and consequently surpassed the promoters currently in frequent use in terms of the amount of the antibody produced.",
                                "7-4) Evaluation of Amount of Antibody Produced by Fed-Batch Culture of Humanized Antibody Y-Expressing Monoclone",
                                "A monoclone was obtained from the humanized antibody Y-expressing stable pool generated using the 0.6 kbp partial sequence of the Hspa5 promoter in (7-2), and evaluated for the amount of the antibody produced by fed-batch culture.",
                                "First, highly expressing cells were enriched using a flow cytometer. Specifically, the culture solution was centrifuged at 200 G for 3 minutes, and the supernatant was removed. The cell pellets were washed twice with 2% BSA-PBS and then resuspended in 2% BSA-PBS. Fluorescein isothiocyanate (FITC)-conjugated Goat F(ab′)2 Fragment Anti-Human IgG (H+L) (Beckman Coulter) was added to the obtained cell suspension, which was then stained at 4° C. for 30 minutes. Then, the cell suspension was centrifuged at 200 G for 3 minutes, and the supernatant was removed. The cell pellets were washed twice with 2% BSA-PBS and then resuspended in 2% BSA-PBS. The obtained cell suspension was sorted using a BD FACSAria Fusion sorter (Becton Dickinson). The sorting was carried out under the following conditions: first, in a dot plot with FSC-Area on the abscissa against SSC-Area on the ordinate, two gates were set on the basis of the value of SSC, and four gates were further set on the basis of the value of FSC. Then, the top 5% cell population that exhibited the highest fluorescence intensity was sorted in cell populations in fractions having the smallest value of FSC and a smaller value of SSC.",
                                "Next, the sorted cell population was cultured, then suspended in a soft agar medium, seeded onto a 6-well plate, and cultured in 5% CO2 at 37° C. After the culturing, a colony highly expressing humanized antibody Y was picked onto a 96-well plate using ClonePix 2. The colony thus picked was subcultured by successive cell expansion steps to a 24-well plate, a 6-well plate, a T25 flask, and a 125 mL Erlenmeyer flask in that order.",
                                "Batch cultures were performed using the obtained humanized antibody Y-expressing monoclones to select a highly expressing monoclone. Subsequently, fed-batch culture was performed in a 125 mL Erlenmeyer flask using the selected humanized antibody Y-expressing monoclone. The basal medium used was G13, and the feed medium used was F13.",
                                "Change in the number of viable cells, change in the amount of the antibody produced, and change in the amount of the antibody produced per cell and per day (SPR: specific production rate) are shown in FIGS. 9A, 9B, and 9C, respectively. The amount of the antibody produced per cell and per day was increased at the intermediate stage or later of culture in many clones, as in the stable pool. Among 12 clones evaluated, 5 clones exhibited 2 g/L or more, and #48 had the highest amount of the antibody produced which reached approximately 4 g/L. These results demonstrated that use of the Hspa5 promoter having the optimized promoter length allows highly producing clones to be obtained even without evaluating many clones, and these clones include a clone that exhibits the amount of the antibody produced being as very high as approximately 4 g/L.",
                                "**(Example 8) Evaluation of Human, Mouse, and Rat Hspa5 Promoters by Fed-Batch Culture with Antibody Expression Level as Indicator**",
                                "8-1) Construction of Antibody Expression Vector",
                                "pDSLHA4.1-hHspa5-Y, pDSLHA4.1-mHspa5-Y, and pDSLHA4.1-rHspa5-Y were constructed by substituting the promoter for antibody H chain and L chain genes in the humanized antibody gene Y expression vector pDSLHA4.1-hRPS7-Y with human, mouse, and rat Hspa5 promoters, respectively. In each expression vector, the Hspa5 promoter used was a sequence from a nucleotide approximately 1.0 kbp upstream of the start codon of Hspa5 to the nucleotide immediately upstream of the nucleotide sequence corresponding to the start codon. The nucleotide sequences of the cloned human, mouse, and rat Hspa5 promoters are shown in SEQ ID NOs: 2, 3, and 4, respectively, in the sequence listing.",
                                "pDSLHA4.1-hHspa5-Y was constructed by the following method: first, a human Hspa5 promoter was amplified by PCR with human genomic DNA as a template using the primer set given below and PrimeSTAR Max DNA Polymerase, and the PCR product was purified using a QIAquick PCR Purification kit. The purified DNA fragment was digested with NotI-NheI and then inserted into the NotI-NheI sites of H chain gene expression vector pDSH1.1-hRPS7-Y and L chain gene expression vector pDSL2.1-hRPS7-Y to construct pDSH1.1-hHspa5-Y and pDSL2.1-hHspa5-Y, respectively. Next, a DNA fragment obtained by the digestion of pDSL2.1-hHspa5-Y with AatII-HindIII was inserted into the AatII-HindIII site of pDSH1.1-hHspa5-Y to construct pDSLH3.1-hHspa5-Y. DNA element A7 described in Patent Literature 2 was inserted upstream of the expression cassette of pDSLH3.1-hHspa5-Y to construct pDSLHA4.1-hHspa5-Y. pDSLHA4.1-mHspa5-Y and pDSLHA4.1-rHspa5-Y were constructed in the same way as above.",
                                "8-2) Generation of Humanized Antibody Y-Expressing Stable Pool",
                                "The CHO-01 cells described in (1-2) were transfected with the antibody expression vector pDSLHA4.1-Hspa5-1.1-Y, pDSLHA4.1-Hspa5-0.6-Y, pDSLHA4.1-hHspa5-Y, pDSLHA4.1-mHspa5-Y, or pDSLHA4.1-rHspa5-Y constructed in (7-1) or (8-1), according to the method described in (4-1). Then, drug selection culture was performed by the method described in (5-2) to generate a humanized antibody Y-expressing stable pool. The stable pool was generated at N=2 with each antibody expression vector.",
                                "8-3) Evaluation of Amount of Antibody Produced by Fed-Batch Culture of Humanized Antibody Y-Expressing Stable Pool",
                                "Fed-batch culture was performed in a 125 mL Erlenmeyer flask using each humanized antibody Y-expressing stable pool generated in (8-2). The basal medium used was G13, and the feed medium used was F13.",
                                "Change in the number of viable cells, change in the amount of the antibody produced, and change in the amount of the antibody produced per cell and per day (SPR: specific production rate) are shown in FIGS. 10A, 10B, and 10C, respectively. The amount of the antibody produced per cell and per day was increased at the intermediate stage or later of culture in the stable pool generated using any of the human, mouse, and rat Hspa5 promoters, as in the Chinese hamster Hspa5 promoter. Thus, these stable pools were able to achieve production of a high amount of the antibody. These results suggested that antibody productivity can be increased by use of any of the human, mouse, rat, and Chinese hamster Hspa5 promoters, and the effect does not depend on the organism.",
                                "**(Example 9) Study on Effect Brought about by Combination of Hspa5 Promoter and A7 with Antibody Expression Level as Indicator in Fed-Batch Culture**",
                                "9-1) Generation of Humanized Antibody Y-Expressing Stable Pool",
                                "The CHO-01 cells described in (1-2) were transfected with the DNA element A7-containing antibody expression vector pDSLHA4.1-Hspa5-1.1-Y or pDSLHA4.1-Hspa5-0.6-Y constructed in (7-1), or DNA element A7-free antibody expression vector pDSLH3.1-Hspa5-1.1-Y or pDSLH3.1-Hspa5-0.6-Y, according to the method described in (4-1). Then, drug selection culture was performed by the method described in (5-2) to generate a humanized antibody Y-expressing stable pool. The stable pool was generated at N=2 with each antibody expression vector.",
                                "9-2) Evaluation of Amount of Antibody Produced by Fed-Batch Culture of Humanized Antibody Y-Expressing Stable Pool",
                                "Fed-batch culture was performed in a 125 mL Erlenmeyer flask using each humanized antibody Y-expressing stable pool generated in (9-1). The basal medium used was G13, and the feed medium used was F13.",
                                "Change in the number of viable cells, change in the amount of the antibody produced, and change in the amount of the antibody produced per cell and per day (SPR: specific production rate) are shown in FIGS. 11A, 11B, and 11C, respectively. In the case of using any of the 0.6 and 1.1 kbp Hspa5 promoters, both the amount of the antibody produced and the amount of the antibody produced per cell and per day were higher for the A7-containing antibody expression vector than for the A7-free antibody expression vector. On day 14, the amounts of the antibody produced for the 0.6 and 1.1 kbp Hspa5 promoters combined with A7 were 2.1 and 1.5 times, respectively, the values for the 0.6 and 1.1 kbp Hspa5 promoters without A7. The amount of the antibody produced per cell and per day was increased at the intermediate stage or later of culture, regardless of the presence or absence of A7. These results demonstrated that combined use of the Hspa5 promoter with DNA element A7 effectively achieves high production by synergistic effects."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce examples",
                                "describe plasmids and enzymes used",
                                "describe DNA cloning and sequencing operations",
                                "describe cell culture and transformation operations",
                                "describe protein collection and purification operations",
                                "construct humanized antibody X expression vector",
                                "generate humanized antibody X-expressing stable pool",
                                "construct humanized antibody X-expressing cell line",
                                "perform fed-batch culture of humanized antibody X-expressing cell lines",
                                "conduct transcriptome analysis",
                                "extract total RNA from cells",
                                "prepare sequencing library",
                                "conduct high-speed sequencing analysis",
                                "map read sequences onto reference sequences",
                                "study expression levels of read sequences",
                                "identify highly expressed genes",
                                "clone promoter region of highly expressed gene",
                                "clone Hspa5 promoter region",
                                "clone promoter regions of other highly expressed genes",
                                "construct pGL4.10-hEF1α",
                                "evaluate activity of each promoter",
                                "transfect cells with luciferase expression vector",
                                "measure transient expression level of luciferase",
                                "evaluate Hspa5 promoter by fed-batch culture",
                                "construct antibody expression vector",
                                "generate humanized antibody Y-expressing stable pool",
                                "perform fed-batch culture of humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced",
                                "conclude examples",
                                "introduce examples",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "evaluate mRNA expression level by fed-batch culture",
                                "generate Renilla luciferase-expressing stable pool",
                                "evaluate amount of protein produced by fed-batch culture",
                                "study Hspa5 promoter length with antibody expression level as indicator",
                                "construct antibody expression vector",
                                "generate humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "evaluate amount of antibody produced by fed-batch culture of humanized antibody Y-expressing monoclone",
                                "evaluate human, mouse, and rat Hspa5 promoters by fed-batch culture",
                                "construct antibody expression vector",
                                "generate humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "study effect brought about by combination of Hspa5 promoter and A7",
                                "generate humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in luminescence of Renilla luciferase",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show change in viable cells, antibody produced, and SPR for Hspa5 promoter",
                                "show change in viable cells, antibody produced, and SPR for human RPS7 promoter",
                                "show change in viable cells, antibody produced, and SPR for human EF1-α promoter",
                                "show effect of combination of Hspa5 promoter and A7"
                            ],
                            "num_characters": 35330,
                            "outline_medium": [
                                "introduce examples",
                                "construct humanized antibody X-expressing cell line",
                                "generate humanized antibody X-expressing stable pool",
                                "construct humanized antibody X-expressing cell line",
                                "perform fed-batch culture of humanized antibody X-expressing cell lines",
                                "conduct transcriptome analysis",
                                "analyze sequencing data",
                                "identify highly expressed genes",
                                "clone promoter region of highly expressed gene",
                                "clone promoter regions of other highly expressed genes",
                                "construct pGL4.10-hEF1α",
                                "evaluate activity of each promoter",
                                "evaluate Hspa5 promoter by fed-batch culture",
                                "construct antibody expression vector",
                                "introduce examples of Hspa5 promoter evaluation",
                                "evaluate antibody production using Hspa5 promoter",
                                "evaluate mRNA expression level of antibody Y gene",
                                "generate Renilla luciferase-expressing stable pool",
                                "evaluate amount of protein produced by fed-batch culture",
                                "study Hspa5 promoter length with antibody expression level",
                                "construct antibody expression vector with partial Hspa5 promoter",
                                "generate humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "evaluate amount of antibody produced by fed-batch culture of monoclone",
                                "evaluate human, mouse, and rat Hspa5 promoters",
                                "construct antibody expression vector with human, mouse, and rat Hspa5 promoters",
                                "generate humanized antibody Y-expressing stable pool",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "study effect of combination of Hspa5 promoter and A7",
                                "generate humanized antibody Y-expressing stable pool with or without A7",
                                "evaluate amount of antibody produced by fed-batch culture",
                                "compare antibody production with or without A7",
                                "show results of fed-batch culture",
                                "conclude effectiveness of Hspa5 promoter and A7 combination"
                            ],
                            "outline_short": [
                                "introduce plasmids and enzymes used",
                                "construct humanized antibody X-expressing cell line",
                                "perform fed-batch culture and transcriptome analysis",
                                "clone promoter regions of highly expressed genes",
                                "evaluate promoter activity using luciferase assay",
                                "evaluate Hspa5 promoter by fed-batch culture with antibody expression level as indicator",
                                "construct antibody expression vector and generate humanized antibody Y-expressing stable pool",
                                "introduce antibody expression levels",
                                "evaluate Hspa5 promoter by fed-batch culture",
                                "evaluate mRNA expression level by real-time PCR",
                                "evaluate Renilla luciferase expression level by fed-batch culture",
                                "study Hspa5 promoter length with antibody expression level as indicator",
                                "evaluate humanized antibody Y-expressing stable pool by fed-batch culture",
                                "evaluate human, mouse, and rat Hspa5 promoters by fed-batch culture",
                                "study effect brought about by combination of Hspa5 promoter and A7",
                                "evaluate amount of antibody produced by fed-batch culture of humanized antibody Y-expressing stable pool",
                                "summarize results of fed-batch culture"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define gene",
                        "define polynucleotide",
                        "define polypeptide",
                        "define gene expression",
                        "define foreign gene",
                        "define foreign protein",
                        "define gene expression unit",
                        "define promoter",
                        "define promoter activity",
                        "define to have promoter activity",
                        "define DNA element",
                        "define antigen-binding fragment of the antibody",
                        "define identity",
                        "define to hybridize under stringent conditions",
                        "introduce Hspa5 promoter",
                        "describe origin of Hspa5 promoter",
                        "describe preferred Hspa5 promoter",
                        "describe mutant Hspa5 promoter",
                        "describe method for introducing mutation",
                        "describe examination of foreign gene expression-enhancing activity",
                        "introduce foreign gene expression unit",
                        "describe components of foreign gene expression unit",
                        "introduce DNA element for enhancing foreign gene expression",
                        "describe method for obtaining DNA element",
                        "describe examples of DNA element",
                        "describe nucleotide sequences of DNA elements",
                        "describe foreign gene expression-enhancing activity",
                        "introduce DNA elements",
                        "describe homology search",
                        "introduce mutations",
                        "obtain polynucleotide",
                        "isolate polynucleotide",
                        "prepare cDNA library",
                        "select positive clone",
                        "obtain polynucleotide by PCR",
                        "prepare gene library",
                        "select polynucleotide",
                        "synthesize polynucleotide chemically",
                        "determine polynucleotide sequence",
                        "introduce foreign gene expression vector",
                        "describe foreign gene expression unit",
                        "introduce DNA elements",
                        "describe orientation of DNA element",
                        "introduce foreign gene",
                        "describe examples of foreign genes",
                        "introduce antigen-binding fragment",
                        "describe selection marker",
                        "introduce episomal vector",
                        "describe transformed cells",
                        "introduce host cells",
                        "describe method for introducing expression vector",
                        "describe method for producing foreign protein",
                        "culture transformed cells",
                        "collect and purify foreign protein",
                        "introduce method for producing antibody protein",
                        "introduce heavy chain and light chain genes",
                        "describe examples of antibodies",
                        "introduce antibody gene",
                        "describe methods for producing other foreign proteins",
                        "introduce examples of foreign proteins"
                    ],
                    "num_characters": 30534,
                    "outline_medium": [
                        "define key terms",
                        "define gene expression",
                        "define gene expression unit",
                        "define promoter",
                        "define promoter activity",
                        "define DNA element",
                        "define antigen-binding fragment",
                        "define identity",
                        "define hybridization under stringent conditions",
                        "introduce Hspa5 promoter",
                        "describe characteristics of Hspa5 promoter",
                        "describe foreign gene expression unit",
                        "describe DNA element for enhancing foreign gene expression",
                        "describe foreign gene expression-enhancing activity",
                        "introduce DNA elements for combined use with promoter",
                        "describe homology search of nucleotide sequence",
                        "introduce mutations into polynucleotide",
                        "obtain polynucleotide comprising foreign gene",
                        "isolate polynucleotide from genomic DNA or cDNA library",
                        "obtain polynucleotide by PCR or gene synthesis",
                        "determine polynucleotide sequence",
                        "describe foreign gene expression vector",
                        "introduce DNA elements into foreign gene expression vector",
                        "describe selection marker for selecting transformant",
                        "describe episomal vector capable of replicating autonomously",
                        "introduce foreign gene expression vector into host cells",
                        "describe method for producing foreign protein",
                        "culture transformed cells and collect foreign protein",
                        "describe method for producing antibody protein",
                        "describe production of other foreign proteins"
                    ],
                    "outline_short": [
                        "define key terms",
                        "describe promoter activity",
                        "introduce Hspa5 promoter",
                        "describe foreign gene expression unit",
                        "introduce DNA element for enhancing foreign gene expression",
                        "provide examples of DNA elements",
                        "describe DNA element for combined use with promoter",
                        "obtain polynucleotide comprising foreign gene",
                        "prepare foreign gene expression vector",
                        "transform host cells with expression vector",
                        "produce foreign protein using transformed cells",
                        "produce antibody protein using transformed cells",
                        "produce other foreign proteins using transformed cells",
                        "describe various examples of foreign proteins"
                    ]
                },
                {
                    "title": "INDUSTRIAL APPLICABILITY",
                    "paragraphs": [
                        "The method for producing a foreign gene according to the present invention is capable of increasing the productivity of a foreign gene such as a therapeutic protein or an antibody. Particularly, the productivity can be increased by the production method of the present invention using a heat-shock protein A5 gene promoter that permits strong expression of a foreign gene throughout the culture period of cultured mammalian cells without attenuating a foreign gene expression regulation function throughout the culture period of mammalian cells."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate method for producing foreign gene"
                    ],
                    "num_characters": 545,
                    "outline_medium": [
                        "motivate method for producing foreign gene"
                    ],
                    "outline_short": [
                        "motivate method for producing foreign gene"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A foreign gene expression unit comprising a foreign gene and a polynucleotide consisting of a polynucleotide selected from (a) to (c):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4;\n(b) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4; and\n(c) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4.",
        "2. The foreign gene expression unit according to claim 1, wherein the polynucleotide consisting of a polynucleotide selected from (a) to (c):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 2;\n(b) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 2; and\n(c) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 2.",
        "3. The foreign gene expression unit according to claim 1, wherein the polynucleotide consisting of a polynucleotide selected from (a) to (c):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 3;\n(b) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 3; and\n(c) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 3.",
        "4. The foreign gene expression unit according to claim 1, wherein the polynucleotide consisting of a polynucleotide selected from (a) to (c):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 4;\n(b) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 4; and\n(c) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence as set forth in SEQ ID NO: 4.",
        "5. The foreign gene expression unit according to claim 1, wherein the foreign gene is a gene encoding a multimeric protein.",
        "6. The foreign gene expression unit according to claim 1, wherein the foreign gene is a gene encoding a hetero-multimeric protein.",
        "7. The foreign gene expression unit according to claim 1, wherein the foreign gene is a gene encoding an antibody or an antigen-binding fragment.",
        "8. A foreign gene expression vector comprising the foreign gene expression unit according to claim 1.",
        "9. A transformed cell into which the foreign gene expression vector according to claim 8 has been introduced.",
        "10. The transformed cell according to claim 9, wherein the cell is a cultured cell derived from a mammal.",
        "11. The transformed cell according to claim 10, wherein the cultured cell derived from the mammal is a COS-1 cell, a 293 cell, or a CHO cell.",
        "12. A method for producing a foreign gene-derived protein, comprising culturing the transformed cell according to claim 9, and obtaining the foreign gene-derived protein from the culture.",
        "13. A polynucleotide that hybridizes under stringent conditions to a polynucleotide consisting of a nucleotide sequence complementary to the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4, the polynucleotide having promoter activity, and wherein the stringent conditions comprise (a) a hybridization solution at 68 degrees Celsius, or (b) a DNA-immobilized filter with 0.7 to 1.0 M NaCl at 68 degrees Celsius and the hybridized polynucleotides are washed at 68 degrees Celsius with a 0.1× to 2× saline-sodium citrate (SSC) solution.",
        "14. A foreign gene expression vector comprising a polynucleotide consisting of (i) and (ii):\n(i) at least one sequence selected from (a) to (c):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4;\n(b) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4; and\n(c) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence as set forth in SEQ ID NOs: 2, 3, or 4; and\n\n(ii) at least one sequence selected from (a) to (e):\n(a) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 35;\n(b) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 36;\n(c) a polynucleotide consisting of the nucleotide sequence as set forth in SEQ ID NO: 37;\n(d) a polynucleotide consisting of a nucleotide sequence having 95% or higher identity to the nucleotide sequence of any one of the polynucleotides (a) to (c), the polynucleotide having foreign gene expression-enhancing activity, and\n(e) a polynucleotide consisting of a nucleotide sequence having 99% or higher identity to the nucleotide sequence of any one of the polynucleotides (a) to (c), the polynucleotide having foreign gene expression-enhancing activity."
    ]
}