{
    "id": "https://semopenalex.org/work/W1998321598",
    "authors": [
        "Reza Dana",
        "Yihe Chen",
        "Sunil Chauhan",
        "Thomas H. Dohlman",
        "Shilpa Kodati",
        "Daniel R. Saban",
        "Parisa Karimian"
    ],
    "title": "CCR7 Is Critical for the Induction and Maintenance of Th17 Immunity in Dry Eye Disease",
    "date": "2014-09-18",
    "abstract": "Purpose.: We characterized antigen-presenting cell (APC)–relevant chemokine receptor expression in dry eye disease (DED), and investigated the effect of topical CC chemokine receptor (CCR)-7 blockade specifically on Th17 cell immunity and dry eye disease severity. Methods.: We induced DED in female C57BL/6 mice. Chemokine receptor expression by corneal APCs was characterized using immunohistochemistry. To determine the functional role of CCR7 in DED, mice were treated topically with either anti-CCR7, a control isotype antibody, or left untreated, and clinical disease severity, Th17 responses, and molecular markers of DED were quantified. Results.: Frequencies of CD11b+ cells and their chemokine expression were increased in the cornea of DED mice. Mice treated topically with anti-CCR7 antibody displayed a significant reduction in clinical disease severity and Th17 response compared to the isotype and untreated groups. Topical CCR7 blockade was effective in ameliorating DED in its acute and chronic stages. Conclusions.: Our findings suggest that CCR7-mediated trafficking of APCs drives the induction and maintenance of Th17 immunity in DED and that CCR7 blockade is effective in suppressing the immunopathogenic mechanisms in DED.",
    "sections": [
        {
            "title": "RESULTS.",
            "paragraphs": [
                "Frequencies of CD11b þ cells and their chemokine expression were increased in the cornea of DED mice. Mice treated topically with anti-CCR7 antibody displayed a significant reduction in clinical disease severity and Th17 response compared to the isotype and untreated groups. Topical CCR7 blockade was effective in ameliorating DED in its acute and chronic stages."
            ],
            "subsections": [
                {
                    "title": "CONCLUSIONS.",
                    "paragraphs": [
                        "Our findings suggest that CCR7-mediated trafficking of APCs drives the induction and maintenance of Th17 immunity in DED and that CCR7 blockade is effective in suppressing the immunopathogenic mechanisms in DED."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Induction of DED",
            "paragraphs": [
                "We induced DED by exposing mice to a controlled environment chamber (CEC) as described previously. 18,19 Briefly, the CEC allows a continuous regulation and maintenance of the temperature (218C-238C), relative humidity (<30%), and airflow (15 L/min). Mice were exposed to the CEC for 12 days and additionally injected with scopolamine hydrobromide 0.5 mg/0.2 mL (Sigma-Aldrich Corp., Springfield, MO, USA) subcutaneously into their dorsal skin three times a day, to maximize ocular surface dryness. Age-and sex-matched control mice were housed in the normal environment of the animal facility and did not receive scopolamine hydrobromide. The induction and progression of DED was evaluated clinically using corneal fluorescein staining (CFS). A total of 1 lL of 5% fluorescein was applied to the lateral conjunctival sac of the mice, and eyes were examined for fluorescein staining using slit-lamp biomicroscopy under a cobalt blue light. Punctate staining was scored by two individuals using the National Eye Institute (Bethesda, MD, USA) grading system. One observer was masked and the scores of both observers were averaged at the end of each experiment. Mice were euthanized after 12 days of exposure to the CEC, and tissues were collected for immunohistochemical and molecular studies."
            ],
            "subsections": []
        },
        {
            "title": "Chronic DED",
            "paragraphs": [
                "We induced DED as outlined above. After 12 days of exposure to the CEC, mice were housed in the normal environment of the animal facility for 10 days. Before re-exposing mice to the CEC, CFS staining was performed to confirm a reduction of CFS scores to near baseline. At day 22, mice then were re-exposed to the CEC for 8 days. During this re-exposure period, mice were not treated with scopolamine."
            ],
            "subsections": []
        },
        {
            "title": "Topical CCR7 Blockade",
            "paragraphs": [
                "Lyophilized rat anti-CCR7 (R&D Systems, Minneapolis, MN, USA) and rat IgG2A isotype antibody (R&D Systems) were resuspended in PBS to yield a concentration of 1%. Then, 20 lg of either anti-CCR7 antibody or isotype antibody were instilled onto the ocular surface. Mice were treated initially three times a day for the first 4 days, and then twice a day thereafter. Mice were euthanized either at day 9 (acute DED) or day 30 (chronic DED), and tissues were harvested for flow cytometric and molecular studies."
            ],
            "subsections": []
        },
        {
            "title": "Flow Cytometry",
            "paragraphs": [
                "A single cell suspension was prepared from isolated draining submandibular and cervical LNs from control/naïve and DED mice. To assess mature APC frequencies, cells were stained with the following antibodies: anti-CD11b Alexa 488 (BD Bioscience, San Jose, CA, USA), anti-CCR7 Phycoerythrin (PE; Biolegend, San Diego, CA, USA), and anti-MHC Class II PE-Cy5 (Biolegend). To quantify IL-17-secreting CD4 þ cells, a single cell suspension was prepared from cervical LNs harvested from naïve mice, anti-CCR7-treated, isotype antibody-treated, and untreated DED mice. Cells were stimulated with phorbol 12myristate 13-acetate (PMA) and ionomycin (Sigma-Aldrich Corp.) in the presence of GolgiStop (BD Biosciences), and subsequently stained with an anti-CD4 FITC (Biolegend). After fixation and permeabilization (buffers from eBioscience, San Diego, CA, USA), cells were stained with an anti-IL-17A PE antibody (eBioscience). Appropriate isotype-matched control antibodies were used in all experiments. Stained cells were analyzed on a Beckman Coulter flow cytometer (Beckman Coulter, Inc., Pasadena, CA, USA)."
            ],
            "subsections": []
        },
        {
            "title": "Immunohistochemistry",
            "paragraphs": [
                "Whole mount corneas were fixed in acetone and blocked with 2% BSA and anti-FcR antibody (eBioscience). For the enumeration of CD11b þ cells, corneas were stained with anti-CD11b Alexa 488 (BD Biosciences) or isotype-matched control antibody overnight. For the quantification of chemokine receptor expression, whole mount corneas were stained with an anti-CD11b Alexa 488 antibody as well as unconjugated anti-CCR1, anti-CCR2, anti-CCR5, or anti-CCR7 antibodies. Following overnight staining, specimens were washed in PBS and stained for 2 hours with a rhodamine-conjugated secondary antibody (Santa Cruz Biotechnology, Santa Cruz, CA, USA). Specimens were mounted using Vector Shield 4 0 6-diamidino-2phenylindole (DAPI) mounting medium (Vector Laboratories, Burlingame, CA, USA) and subsequently examined using confocal microscopy (Leica TCS-SP5; Leica Microsystems, Wetzlar, Germany)."
            ],
            "subsections": []
        },
        {
            "title": "Reverse Transcription and Real-Time PCR",
            "paragraphs": [
                "Corneas were harvested after 9 days of topical CCR7 blockade. RNA was isolated with RNeasy Micro Kit (Qiagen, Valencia, CA, USA) and reverse transcribed using Superscript III Kit (Invitrogen, Carlsbad, CA, USA). Real-time quantitative PCR (qPCR) was performed using Taqman Universal PCR Mastermix and preformulated primers for murine glyceraldehyde-3-phosphate dehydrogenase (GAPDH), IL-17, matrix metalloproteinase (MMP)-3, TNF-a, and IL-1b (Applied Biosystems, Foster City, CA, USA). The results were analyzed by the comparative threshold cycle method, using GAPDH as an internal control and normalized to their expression levels in untreated DED mice. Real-time PCR was repeated two to three times for each cytokine."
            ],
            "subsections": []
        },
        {
            "title": "Statistical Analysis",
            "paragraphs": [
                "An unpaired 2-tailed Student's t-test was performed and P values less than 0.05 were regarded as statistically significant."
            ],
            "subsections": []
        },
        {
            "title": "Chemokine Receptor-Expressing CD11bþ Antigen-Presenting Cells Infiltrate the Corneal Stroma in DED",
            "paragraphs": [
                "We used confocal microscopy to enumerate the infiltration of CD11b-expressing cells within the corneal stroma, and in accord with previous reports, 10 we found significantly increased frequencies of CD11b þ cells (P < 0.001) within the corneas of DED mice (Fig. 1A).",
                "Chemokines have been implicated in the trafficking of APCs during corneal inflammation, including corneal alloimmunity. 14,20,21 Thus, we further characterized these cornealinfiltrating APCs in DED mice by analyzing their expression of chemokine receptors. Immunohistochemical analyses revealed significantly increased frequencies of CCR1 (P < 0.01), CCR2 (P < 0.01), CCR5 (P < 0.05), and CCR7 (P < 0.0001) expressing CD11b þ cells in the corneal stroma of DED mice compared to naïve mice (Fig. 1B)."
            ],
            "subsections": []
        },
        {
            "title": "CCR7 Promotes APC Trafficking to the DLNs in DED",
            "paragraphs": [
                "The CCR7 has been reported to be a critical mediator of APC trafficking to the DLNs in corneal alloimmunity. 17,20 Since we observed an increase in CCR7-expressing CD11bþ cells within the cornea of DED mice (Fig. 1B), we next analyzed CCR7 expression in mature MHC class IIþ APCs in the draining cervical LNs. In accordance with our findings in the cornea of DED mice, flow cytometric analysis of the DLNs showed an approximately 2-fold increase of mature CCR7-expressing APCs in DED mice (Fig. 2A). Thus, we investigated the effect of topical CCR7 blockade on APC trafficking after induction of DED. We treated the mice topically from day one with anti-CCR7 antibody or isotype antibody, or the mice remained untreated. We analyzed the expression of CD11b and MHC II in the DLNs after 9 days of treatment using flow cytometry. Mice treated with control isotype antibody displayed increased frequencies of mature APCs (CD11bþMHC IIþ) compared to naïve mice, whereas treatment with anti-CCR7 antibody decreased the frequencies of mature APCs (CD11bþMHC IIþ). Although the reduction of mature APCs by anti-CCR7 treatment was not significant, the frequencies of APCs in anti-CCR7-treated mice resembled the frequencies observed in naïve mice (Fig. 2B)."
            ],
            "subsections": []
        },
        {
            "title": "Topical CCR7 Blockade Inhibits the Induction of Th17 Immunity and Ocular Surface Inflammatory Cytokine Expression",
            "paragraphs": [
                "Activated IL-17-secreting CD4 T cells (Th17) have been reported as critical effector cells in DED. 8,9 Therefore, we analyzed the effect of topical CCR7 blockade on the induction of Th17 immunity. Flow cytometric analyses revealed decreased frequencies of Th17 cells in the LNs of anti-CCR7 antibody-treated mice (mean 0.9%) compared to 1.6% and 1.5% in the LNs of untreated and isotype-treated mice, respectively (Fig. 3A). Next, we analyzed the mRNA expression level of IL-17 in the conjunctiva. In accordance with our findings in the LNs, real-time PCR analysis of conjunctival tissue showed decreased IL-17 expression in anti-CCR7-treated compared to isotype-treated mice (Fig. 3B).",
                "Interleukin-17 has been demonstrated to induce MMP secretion by epithelial cells in DED, 8 which subsequently leads to an increase in epithelial permeability. We, thus, investigated the effect of topical CCR7 blockade on corneal MMP-3 expression and found the expression of MMP-3 to be decreased significantly in topical anti-CCR7-treated mice compared to isotype-treated mice (P < 0.05, Fig. 3C).",
                "Finally, we found decreased expression levels of two DEDassociated inflammatory cytokines, namely TNF-a and IL-1b, 22 in conjunctival and corneal tissue in anti-CCR7-treated mice compared to isotype-treated mice (Figs. 3D,3E)."
            ],
            "subsections": []
        },
        {
            "title": "Topical CCR7 Blockade Impairs the Induction and Progression of Acute DED as well as the Progression of Chronic DED",
            "paragraphs": [
                "Given the critical function of CCR7 in APC trafficking in corneal alloimmunity 17 and our findings above, we next investigated the functional role of CCR7 in DED by studying the effect of topical CCR7 blockade on disease onset and severity. Mice were treated topically from day 1 with either anti-CCR7 antibody or isotype antibody, or they remained untreated, and CFS scores were measured at various time points.",
                "During the induction (days 1-3) and progression (days 4-8) phases of acute DED, CFS scores were significantly lower in anti-CCR7 antibody-treated mice than in isotype-treated or untreated mice (Figs. 4A,4B), showing a diminished severity and progression of acute DED in anti-CCR7-treated mice.",
                "We next investigated whether topical CCR7 blockade also could impair the progression of chronic DED. A schematic diagram of the experimental design is depicted in Figure 4C. Chronic DED mice treated with anti-CCR7 antibody had significantly lower CFS scores (P ¼ 0.001) than mice receiving isotype antibody or mice that remained untreated, suggesting that topical blockade of CCR7 inhibits the development of clinically relevant chronic DED (Figs. 4D,4E). "
            ],
            "subsections": [
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "The cornea contains a heterogeneous population of resident APCs. These include Langerhans cells and dendritic cells (DC) in the epithelium, 23,24 as well as langerin þ DCs 24 and CD11c þ CD11b þ DCs in the stroma. 2 5 In addition, CD11b þ CD11c À macrophages/monocytes are located in the stroma. 25,26 We selected CD11b as an APC marker to capture most sets of the steady state populations in the cornea, as well as infiltrating APCs. 10,11 Our data showed infiltration of APCs into the cornea of mice with DED, and are consistent with previously reported results. 11 Chemokines have been implicated in the mobilization of T cells and APCs in corneal alloimmunity and models of corneal inflammation. However, to date, comparably less is known about chemokine expression in DED. 15,27,28 Our results demonstrated increased frequencies of CCR1-, CCR2-, CCR5-, and CCR7-expressing APCs within the corneal stroma. These results suggested a key role for chemokine-mediated APC trafficking in DED, and are consistent with several reports describing elevated expression levels of the chemokine ligands CCL3, CCL4, and CCL5 at the ocular surface and tear film in DED. 15,29 Mature APCs are known to upregulate the chemokine receptor CCR7, which facilitates their directional migration towards lymphoid tissue, in response to a CCL21 chemotactic gradient generated in part by the lymphatic 30 Notably, the functional importance of CCR7-mediated APC trafficking from the cornea to the DLNs in the afferent phase of the corneal alloimmune response has been highlighted by previous findings indicating a reduction in APC migration to the LNs following subconjunctival CCL21 blockade. 20 The corneal lymphangiogeneic response described in DED is thought to serve as the primary conduits for APC migration to the cervical LNs. 31 Our results showed increased frequencies of CCR7-expressing CD11b þ cells in the corneal stroma, increased frequencies of mature CCR7 þ CD11b þ cells within the DLNs of DED mice, and decreased frequencies of mature APCs (CD11bþMHC IIþ) in the DLNs after treatment with an anti-CCR7 antibody, thus suggesting an important role for CCR7 in directing APC trafficking in DED. The frequencies of IL-17-secreting CD4 T cells (Th17) are significantly increased in the LNs of DED mice and they have been demonstrated to be a critical CD4 þ population in DED. 7,8 Notably, they have been reported as displaying a relative resistance to T regulatory suppression. 9 Additionally, their effector functions in DED include, but are not limited to, the stimulation of lymphangiogenesis and direct disruption of the corneal epithelial barrier via upregulating MMP expression. 8 In our DED mouse model, Th1 cells frequencies in the DLNs are not increased after disease induction and anti-CCR7 treatment showed no effect on Th1 cells (Supplementary Fig. S1). Clearly, several inflammatory molecules, including cytokines, chemokines, and MMPs, are increased in the cornea and conjunctiva in DED. 7 However, in this study we focused on Th17associated molecules and inflammation markers. Our findings showing decreased frequencies of Th17 cells in LNs, as well as reduced IL-17 mRNA expression in the conjunctiva, and reduced expression of MMP-3, IL-1b, and TNF-a at the ocular surface of anti-CCR7-treated DED mice, clearly implicated a role for CCR7 in inducing ocular inflammation and suggested a role in Th17 immunity in DED. Because CCR7 is expressed not only by APCs, but also by other immune cells, including T cells, 32 blockade of CCR7 might act on several levels.",
                        "To assess the functional significance of CCR7 in DED, we used the approach of topical CCR7 blockade in vivo in a murine disease model. Furthermore, topical application was selected over systemic administration given our goal of exclusively impairing the afferent arm of APC mobilization to the DLNs, as systemic administration also would impact upon homing of regulatory T cells to the LNs. 17 Other investigators have observed significantly reduced clinical scores following topical treatment with anti-CCR7 antibody in their model of ocular allergy. 2,33 Consistent with this report, we observed that topical anti-CCR7-treated mice did not develop clinically significant DED, which suggests a fundamental role for CCR7 in the induction of DED.",
                        "It is thought that APC migration from the cornea to the DLNs is an essential requirement for the induction of DED, evident by the failure of DED to develop in mice, which have had either depletion of ocular surface APCs or cervical lymphadenectomy. 12 Our data showing significantly reduced clinical scores in anti-CCR7-treated mice certainly are consistent with this hypothesis. However, the question of whether continuous trafficking of APCs along the ocular surfacelymphoid axis is required to sustain the immune response in DED following the initial induction remains unknown. To address this question, we evaluated topical CCR7 blockade in a chronic DED model. Despite re-exposure to the CEC, topical anti-CCR7-treated mice do not have chronic DED, suggesting that re-exposure to a desiccating stimulus in the absence of CCR7-mediated APC migration to the DLNs is insufficient to perpetuate DED.",
                        "In summary, our findings revealed the chemokine receptors associated with APC infiltration into the cornea of DED mice as well as suggested a key role for CCR7 in the trafficking of corneal APCs to the DLNs in DED. Furthermore, our novel data demonstrated that topical CCR7 blockade is highly effective in inhibiting the immunopathogenesis of acute and chronic DED, in terms of clinical and molecular markers of the disease. Our data implicated an essential contribution of CCR7-mediated  "
                    ],
                    "subsections": []
                },
                {
                    "title": "Acknowledgments",
                    "paragraphs": [
                        "The authors thank Randy Huang and Donald Pottle for their technical assistance, and Susanne Eiglmeier, PhD, for her intellectual input and assistance in the preparation of the manuscript.",
                        "Supported by the National Eye Institute/National Institutes of Health Grant EY 020889. The authors alone are responsible for the content and writing of the paper. Disclosure: S. Kodati, P; S.K. Chauhan, P; Y. Chen, None; T.H. Dohlman, None; P. Karimian, None; D. Saban, P; R. Dana, P"
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}