{
    "id": "US20120181184",
    "authors": [
        "George M. Whitesides",
        "Zhihong Nie",
        "Christian Nijhuis",
        "Xin Chen",
        "Andres W. Martinez",
        "Max Narovlyansky"
    ],
    "title": "MICROFLUIDIC, ELECTROCHEMICAL DEVICES",
    "date": "2010-03-08 00:00:00",
    "abstract": "Microfluidic, electrochemical devices are described. The microfluidic, electrochemical device comprises one or more electrode(s) on a substrate and a patterned porous, hydrophilic layer having a fluid-impermeable barrier which substantially permeates the thickness of the porous, hydrophilic layer and defines boundaries of one or more hydrophilic channels within the patterned porous, hydrophilic layer, wherein the hydrophilic channel(s) comprises a hydrophilic region which is in fluidic communication with the electrode(s). In some embodiments, the electrodes comprise a working electrode, a counter electrode, and a reference electrode. In some embodiments, the microfluidic, electrochemical device further comprises a fluid sink. The method of assembling the microfluidic, electrochemical device is described. The method of using the device for electrochemical analysis of one or more analytes is also described.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The disclosed subject matter relates generally to microfluidic devices.",
                        "In recent years, microfluidic systems have attracted increasing interests due to their diverse and widespread potential applications. For example, using very small volumes of samples, microfluidic systems could carry out complicated biochemical reactions to acquire important chemical and biological information. Among other advantages, microfluidic systems reduce the required amount of samples and reagents, shorten the response time of reactions, and decrease the amount of biohazard waste for disposal.",
                        "First developed in the early 1990s, microfluidic devices were initially fabricated in silicon and glass using photolithography and etching techniques adapted from the microelectronics industry. Current microfluidic devices are constructed from plastic, silicone, or other polymeric materials, e.g. polydimethylsiloxane (PDMS). Such devices are generally expensive, inflexible, and difficult to construct.",
                        "Electrochemical analysis involves methods of measuring the potential and/or current of a fluidic sample containing analytes, which is widely used in the medicinal field or in environmental studies. Electrochemical analysis usually utilizes sophisticated instruments and is conducted by specially-trained technicians. However, for use in developing countries, in the field, or in-home heath-care settings, there remains a need for analytical devices that are inexpensive, portable, and easy to construct and use."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce microfluidic systems",
                        "limitations of current microfluidic devices"
                    ],
                    "num_characters": 1498,
                    "outline_medium": [
                        "introduce microfluidic systems"
                    ],
                    "outline_short": [
                        "introduce microfluidic systems"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "Microfluidic, electrochemical devices are described.",
                        "In one aspect, a microfluidic, electrochemical device is described, including:",
                        "a first electrode assembly including a first substrate layer supporting one or more electrodes; and",
                        "a first porous, hydrophilic layer overlaying the electrode assembly, wherein the hydrophilic layer includes a fluid-impermeable boundary that substantially permeates the thickness of the hydrophilic layer and defines a one or more hydrophilic channels within the hydrophilic layer, wherein the one or more hydrophilic channels include a first hydrophilic region which is in fluidic communication with the one or more electrodes.",
                        "In some embodiments, the electrode assembly further includes a barrier material surrounding at least a portion of the electrode.",
                        "In any of the preceding embodiments, the microfluidic, electrochemical further includes:",
                        "a fluid-impermeable layer overlaying and contacting at least a portion of the first hydrophilic layer; and",
                        "a second porous, hydrophilic layer overlaying and contacting at least a portion of the fluid-impermeable layer, wherein the second hydrophilic layer including a fluid-impermeable boundary that substantially permeates the thickness of the second hydrophilic layer and defines one or more hydrophilic channels within the second hydrophilic layer,",
                        "wherein the fluid-impermeable layer includes one or more openings in alignment with and in fluidic communication with at least a portion of a hydrophilic channel within each hydrophilic layer.",
                        "In any of the preceding embodiments, a porous, hydrophilic medium is disposed in the opening of the first fluid-impermeable layer and is in fluidic communication with at least a portion of a hydrophilic channel within the hydrophilic layers.",
                        "In any of the preceding embodiments, the electrode assembly includes a working electrode and a counter electrode.",
                        "In any of the preceding embodiments, the first electrode assembly includes a working electrode and the microfluidic, electrochemical device further includes a second electrode assembly including a counter electrode including a second substrate layer supporting the counter electrode, wherein the counter electrode is substantially surrounded by a barrier material.",
                        "In any of the preceding embodiments, the first porous, hydrophilic layer including the first hydrophilic region is disposed between the first and the second electrode assemblies, and wherein the first hydrophilic region is in fluidic communication with both the working and counter electrodes.",
                        "In any of the preceding embodiments, the microfluidic, electrochemical device further includes a fluid sink, wherein the fluid sink is in fluidic communication with one end of the hydrophilic channel including the first hydrophilic region.",
                        "In any of the preceding embodiments, the fluid sink includes a blotting cellulose paper.",
                        "In any of the preceding embodiments, the porous, hydrophilic medium includes paper.",
                        "In any of the preceding embodiments, the first or second porous, hydrophilic layer includes paper.",
                        "In any of the preceding embodiments, the first or second substrate layer includes a paper or a plastic film.",
                        "In any of the preceding embodiments, the barrier material includes polymerized photoresist disposed on the paper or plastic film and substantially surrounding the electrode.",
                        "In any of the preceding embodiments, the barrier material includes a fluid-impermeable sheet having apertures of a dimension for receiving the electrode, said fluid-impermeable sheet disposed over the first or second substrate layer and substantially surrounding the electrode.",
                        "In any of the preceding embodiments, the first or second substrate layer are integral with and form a unitary body with the barrier material.",
                        "In any of the preceding embodiments, the fluid-impermeable sheet includes double-sided adhesive tape.",
                        "In any of the preceding embodiments, the fluid-impermeable layer includes adhesive tape.",
                        "In any of the preceding embodiments, the first or second electrode assembly further includes a reference electrode.",
                        "In another aspect, a method of preparing a microfluidic, electrochemical device is described, including:",
                        "disposing a layer of hydrophobic barrier including a stencil including one or more openings to a supporting layer;",
                        "depositing electro-conductive material in the opening(s) to form one or more electrode(s); and",
                        "attaching a porous, hydrophilic layer including a fluid-impermeable barrier that substantially permeates the thickness of the patterned porous, hydrophilic layer and defines a boundary of one or more hydrophilic channel(s) in the porous, hydrophilic layer;",
                        "wherein",
                        "the hydrophilic channel includes a first hydrophilic region; and the first hydrophilic region is in fluidic communication with the electrode(s).",
                        "In any of the preceding embodiments, the method further includes:",
                        "attaching one or more porous, hydrophilic layer including a fluid-impermeable barrier that substantially permeates the thickness of the patterned porous, hydrophilic layer and defines a boundary of one or more hydrophilic channel(s) in the patterned porous, hydrophilic layer; and",
                        "disposing a second fluid-impermeable layer between adjacent patterned porous, hydrophilic layers; wherein the second fluid-impermeable layer includes one or more openings; and each opening is in alignment with and in fluidic communication with one or more portion(s) of one of the hydrophilic channel(s).",
                        "In yet another aspect, a method of determining the presence of one or more analytes in a fluidic sample using a microfluidic, electrochemical device of any one of the preceding embodiments, including:",
                        "depositing a fluidic sample in one of the one or more hydrophilic channels of the porous, hydrophilic layer to provide fluidic contact of the sample with the electrode(s); and",
                        "measuring an electrochemical signal using the electrode(s).",
                        "In any of the preceding embodiments, the electrochemical signal is correlated with a concentration of the analyte(s).",
                        "In any of the preceding embodiments, the electrochemical signal is correlated with presence of the analyte(s).",
                        "In any of the preceding embodiments, the fluidic sample is deposited in a region of the hydrophilic channel positioned substantially over the one or more electrode(s).",
                        "In any of the preceding embodiments, the microfluidic, electrochemical device further includes a fluid sink in fluidic communication with a distal end of the hydrophilic channel including the first hydrophilic region; and the method further including:",
                        "depositing the fluidic sample at a proximal end of the hydrophilic channel comprising the first hydrophilic region; wherein the fluidic sample is transported through capillary action over the electrode and into the fluid sink; and",
                        "wherein a constant fluidic flow of the fluidic sample is maintained across the electrode(s).",
                        "In any of the preceding embodiments, measuring an electrochemical signal includes impedance measurement, current measurement or voltage.",
                        "In any of the preceding embodiments, the electrochemical measurement is selected from the group consisting of amperometry, biamperometry, stripping voltammetry, differential pulse voltammetry, cyclic voltammetry, coulometry, chronoamperometry, and potentiometry.",
                        "In any of the preceding embodiments, the electrochemical measurement is chronoamperometry and the analyte includes glucose, cholesterol, uric acid, lactate, blood gases, DNA, haemoglobin, nitric oxide, and blood ketones.",
                        "In any of the preceding embodiments, measuring an electrochemical signal includes anodic stripping voltammetry.",
                        "In any of the preceding embodiments, the analyte includes a heavy metal ion or a mixture of heavy metal ions.",
                        "As used herein, “3-D” and “three-dimensional” are used interchangeably.",
                        "As used herein, “μPED” refers to a microfluidic, paper-based electrochemical device. As used herein, “F-F μPED” refers to a face-to-face microfluidic, paper-based electrochemical device. As used herein, “S-S μPED” refers to a side-by-side microfluidic, paper-based electrochemical device."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe microfluidic electrochemical device",
                        "define first electrode assembly",
                        "define first porous hydrophilic layer",
                        "describe fluid-impermeable layer",
                        "describe second porous hydrophilic layer",
                        "describe openings in fluid-impermeable layer",
                        "describe porous hydrophilic medium",
                        "describe working and counter electrodes",
                        "describe second electrode assembly",
                        "describe fluid sink",
                        "describe blotting cellulose paper",
                        "describe paper as porous hydrophilic medium",
                        "describe paper or plastic film as substrate layer",
                        "describe barrier material",
                        "describe method of preparing microfluidic electrochemical device",
                        "describe method of determining analyte presence"
                    ],
                    "num_characters": 8099,
                    "outline_medium": [
                        "describe microfluidic electrochemical device",
                        "define electrode assembly",
                        "describe hydrophilic layer",
                        "describe fluid-impermeable layer",
                        "describe porous hydrophilic medium",
                        "describe method of preparing microfluidic electrochemical device",
                        "describe method of determining analyte presence",
                        "define terms"
                    ],
                    "outline_short": [
                        "describe microfluidic electrochemical device",
                        "describe electrode assembly",
                        "describe hydrophilic layers and fluid-impermeable boundaries",
                        "describe method of preparing microfluidic electrochemical device"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "In one aspect, a microfluidic, electrochemical device is described. The microfluidic, electrochemical device comprises a first electrode assembly and a first porous, hydrophilic layer. The first electrode assembly comprises a first substrate layer which supports one or more electrode(s). In some embodiments, the microfluidic, electrochemical device further comprises a second electrode assembly comprising a second substrate layer which supports one or more electrode(s). In some embodiments, the first or second electrode assembly further comprises a barrier material surrounding at least a portion of the electrode. In some embodiments, the electrode is substantially surrounded by the barrier material. In some embodiments, the first or second substrate layer has a two-layer structure comprising a paper or plastic-film and a layer of the barrier material. In some specific embodiments, the barrier material comprises polymerized photoresist disposed on the supporting layer and substantially surrounding the electrode. In other specific embodiments, the barrier material comprises a fluid-impermeable sheet having apertures of a dimension for receiving the electrode. The fluid-impermeable sheet is positioned over the first or second substrate layer and substantially surrounds the electrode. In some specific embodiments, the fluid-impermeable sheet comprises double-sided adhesive tape. In other embodiments, the first or second substrate layer are integral with and form a unitary body with the barrier material. The barrier material provides a barrier to fluid flow and can prevent malfunction of the electrochemical device, for example, by short circuiting the electrodes.",
                        "The first porous, hydrophilic layer overlays with the electrode assembly, wherein the hydrophilic layer comprising a fluid-impermeable barrier that substantially permeates the thickness of the hydrophilic layer and defines a boundary of one or more hydrophilic channels within the hydrophilic layer, wherein the one or more hydrophilic channels comprise a first hydrophilic region which is in fluidic communication with the one or more electrodes.",
                        "In one aspect, a microfluidic, electrochemical device disclosed herein is described with reference to FIG. 1 and demonstrates the general principles of the device. FIG. 1(a) schematically illustrates a perspective view of a microfluidic, electrochemical device 100, which includes an electrode assembly 110 and a patterned porous, hydrophilic layer 107. The electrode assembly 110 comprises a substrate layer 103 supporting electrodes 101. The electrode further comprises a barrier material 102 disposed between electrodes 101. In some embodiments, the barrier material 102 surrounds at least a portion of the electrodes 101. In some embodiments, the electrodes 101 is substantially surrounded by the barrier material 102. In some specific embodiments, the barrier material 102 comprises polymerized photoresist disposed on the supporting layer 103 and substantially surrounding the electrodes 101. In other specific embodiments, the barrier material 102 comprises a fluid-impermeable sheet having apertures of a dimension for receiving the electrode. In some specific embodiments, barrier material 102 comprises double-sided adhesive tape. The patterned porous, hydrophilic layer 107 comprises a fluid-impermeable barrier 105 that substantially permeates the thickness of the patterned porous, hydrophilic layer and defines a boundary of a hydrophilic channel 108. The hydrophilic channel 108 comprises a first hydrophilic region 104, which is in fluidic communication with electrodes 101. In some embodiments, the microfluidic, electrochemical device further comprises an applicator region 106, which is in fluidic communication with the first hydrophilic region 104. Once a fluidic sample is deposited in the depositing region 106, the fluid will wick into the hydrophilic channel 108 though capillary mechanism. Once the sample reaches the first hydrophilic region 104, the analyte of the sample contacts the electrodes disposed below the hydrophilic region to create an electrochemical cell. An electrochemical signal can be measured via electrochemical reactions conducted though electrodes 101. FIG. 1(b) illustrates a photograph of a top view of the microfluidic, electrochemical device 100.",
                        "The substrate layer 103 on which the electrode(s) 101 are constructed can be a porous, hydrophilic layer or a plastic layer. In some embodiments, the substrate layer is paper. In other embodiments, the substrate layer is a plastic film. In some other embodiments, the substrate layer 103 is integral with and form a unitary body with the barrier material 102. By way of example, the substrate can be plastic, in which channels are etched to provide a depression in which the electrode is formed. Electrodes can be located as needed or desired on the substrate. By way of example, the electrodes can be aligned side by side (as shown in FIG. 1) or head to head (as shown in FIG. 3). Other electrode arrangements are contemplated.",
                        "Electrode(s) are fabricated using the methods and materials known in the art. Non-limiting examples of electro-conductive material suitable for electrode construction on the substrate layer include carbon ink, silver ink, Ag/AgCl ink, Copper, Nickel, Tin, Gold, or Platinum. In some embodiments, carbon ink is used for constructing the electrode on the substrate layer. In other embodiments, Ag/AgCl ink is used for constructing the electrode on the substrate layer. In yet other embodiments, gold is used for constructing the electrode on the substrate layer. In some specific embodiments, carbon ink is screen-printed on a layer of paper as the substrate layer. In other specific embodiments, carbon ink is screen-printed on a layer of polyester film as the substrate layer. In other specific embodiments, carbon ink is screen-printed on a layer of polyester film as the substrate layer. In yet other specific embodiments, Ag/AgCl ink is screen-printed on a layer of paper as the substrate layer. In yet other specific embodiments, Ag/AgCl ink is screen-printed on a layer of polyester film as the substrate layer.",
                        "Porous, hydrophilic layers that can be used in microfluidic, electrochemical devices described herein include any hydrophilic layer that wicks fluids by capillary action. In one or more embodiments, the porous, hydrophilic layer is paper. Non-limiting examples of porous, hydrophilic layers include chromatographic paper, filter paper, nitrocellulose and cellulose acetate, cellulosic paper, filter paper, paper towels, toilet paper, tissue paper, notebook paper, KimWipes, VWR Light-Duty Tissue Wipers, Technicloth Wipers, newspaper, any other paper that does not include binders, cloth, and porous polymer film. In general, any paper that is compatible with the selected patterning method may be used. In certain embodiments, porous, hydrophilic layers include Whatman chromatography paper No. 1.",
                        "In one or more embodiments, the hydrophilic layer is patterned following the procedures described in, e.g., WO 2008/049083 and WO 2009/121037. In certain embodiments, the hydrophilic paper is soaked in photoresist, and photolithography is used to pattern the photoresist to form the barriers following the procedures described in WO 2008/049083. The photoresist used for patterning porous, hydrophilic material include SU-8 photoresist, SC photoresist (Fuji Film), poly(methylmethacrylate), nearly all acrylates, polystyrene, polyethylene, polyvinylchloride, and any photopolymerizable monomer that forms a hydrophobic polymer.",
                        "Other hydrophilic material such as nitrocellulose and cellulose acetate are commonly used and well-known membranes for their use in fluid diagnostics, but are not compatible with solvents typically used in photolithography. In some other embodiments, the patterned hydrophilic paper is fabricated using method illustrated in copending PCT Application, titled “Methods Of Micropatterning Paper-Based Microfluidics,” filed on Mar. 8, 2010, Publication No. ______, which is incorporated by reference. Other methods, such as screening, stamping or printing, are suitable for patterning such materials. In addition, the hydrophilic layer and the fluid-impermeable barrier regions could be prepared using materials that are compatible with the testing conditions, e.g., temperature, pH, and/or ionic strength.",
                        "After the patterning process, the resulting patterned porous, hydrophilic layer contains one or more defined hydrophilic channels which allows the microfluidic flows by capillary action."
                    ],
                    "subsections": [
                        {
                            "title": "Fabrication of the Microfluidic, Electrochemical Device",
                            "paragraphs": [
                                "In some embodiments, the electrode assembly includes a barrier material and paper or plastic film. In one exemplary method, a microfluidic, electrochemical device is fabricated by first making a stencil using a fluid-impermeable layer. The stencil made from the fluid-impermeable layer can be made using any methods commonly known in the art. In some embodiments, the stencil is designed by a computer software and then cut by a laser cutter. In some embodiments, the stencil is made from a double-sided type and designed by computer software such as Adobe Freehand®. The stencil is then cut into designed configuration by using a laser cutter. The stencil is then attached to a substrate layer with pre-determined areas of the substrate layer exposed. The exposed areas define the location of the electrodes of the electrode assembly.",
                                "The stencil can serve as a filler material between electrodes and can also provide a barrier to fluid flow into the gap between electrodes which could impede the measurement process. In one or more embodiments, the stencil is prepared from a fluid-impermeable material such as a plastic sheet. In certain embodiments, the fluid-impermeable layer is an adhesive sheet or tape. Non-limiting examples of fluid-impermeable layer includes Scotch® double-sided carpet tape, water-impermeable barriers include 3M Double Sided Tape, Tapeworks double sided tape, CR Laurence black double sided tape, 3M Scotch Foam Mounting double-sided tape, 3M Scotch double-sided tape (clear), QuickSeam splice tape, double sided seam tape, 3M exterior weather-resistant double-sided tape, CR Laurence CRL clear double-sided PVC tape, Pure Style Girlfriends Stay-Put Double Sided Fashion Tape, Duck Duck Double-sided Duct Tape, and Electriduct Double-Sided Tape.",
                                "In some embodiments, one or more electrodes are then constructed on the exposed areas of the substrate layer. In some specific embodiments, the electro-conductive material is screen-printed onto the exposed areas of the substrate layer to form the electrode. In some embodiments, the electrode(s) are screen-printed on the substrate layer. In other embodiments, other methods of constructing the electrodes on the substrate layer can be used. Non-limiting examples of constructing the electrodes on the substrate layer include metal deposition (such as sputtering and sputter deposition, vapor deposition, thermal spray coating, and ion beam techniques), electrodeposition coating, etching, and self-assembly. In some other embodiments, the conductive ink is used to filled the opening of the stencil. Optionally, the substrate layer can be submitted to heating facilitate the drying of the ink. Subsequently, the protective layer of the double-sided type can be removed and a patterned porous, hydrophilic layer containing a first hydrophilic region can be attached onto the double-sided type in a way to allow the first hydrophilic region to contact at least a portion of the electrode.",
                                "In other embodiments, the substrate layer are integral with and form a unitary body with the barrier material. Non-limiting examples of fabricating such substrate layer include etching a film comprising a plastic material or other material suitable for the etching method to form channels to provide a depression in which the electrode is formed."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe fabrication of electrode assembly",
                                "describe stencil preparation",
                                "describe attachment of stencil to substrate layer",
                                "describe construction of electrodes on substrate layer",
                                "describe attachment of patterned porous, hydrophilic layer to electrode assembly",
                                "describe alternative substrate layer and barrier material configurations"
                            ],
                            "num_characters": 3314,
                            "outline_medium": [
                                "describe making stencil using fluid-impermeable layer",
                                "describe attaching stencil to substrate layer with pre-determined areas exposed",
                                "describe constructing electrodes on exposed areas of substrate layer"
                            ],
                            "outline_short": [
                                "describe method of fabricating device"
                            ]
                        },
                        {
                            "title": "Configuration of the Electrodes",
                            "paragraphs": [
                                "In some embodiments, the electrodes comprise a working electrode, an reference electrode, and a counter electrode. FIG. 1 demonstrates an arrangement of the electrodes where all three electrodes are side by side to each other in a single electrode assembly. Such electrode arrangement can be referred to as the side-by-side arrangement (“S-S”).",
                                "FIG. 2 illustrates a microfluidic, electrochemical device 200 with a arrangement of the electrodes where the working electrode and the counter electrode are placed in a face-to-face manner (“F-F”). The microfluidic, electrochemical device 200 is constructed using any of the methods described herein. FIG. 2(b) illustrates a cross-sectional side view of the device. As FIG. 2(b) illustrates an electrode assembly 211 with a two-layer structure comprising a reference electrode 201, a working electrode 202, a substrate layer 209, e.g., a polyester layer or a paper layer 209, on which the electrodes are disposed and a barrier material 208 located at least between the reference electrode 201 and working electrode 202. In some embodiments, the barrier material comprises a fluid-impermeable sheet 208 having apertures of a dimension for receiving the electrode, where the fluid-impermeable sheet is disposed over the substrate layer and substantially surrounding the electrode. Non-limiting examples of the fluid-impermeable sheet include double-sided adhesive tape. FIG. 2(b) also illustrates a second electrode assembly 212 comprising a second substrate layer 206 supporting a counter electrode 205. Barrier material 207 surrounds the electrode 205. A patterned hydrophilic layer 210 is disposed between the upper electrode assembly 212 housing counter electrode 205 and the lower electrode assembly 210 housing working electrode 202 and reference electrode 201. Hydrophilic layer 212 includes a hydrophilic channel 204 and a hydrophobic barrier region 203. The substrate layer 206 containing the counter electrode 205 is attached to one side of the hydrophilic layer 210 via a stencil fluid-impermeable layer 207. The substrate layer 209 containing the reference electrode 201 and working electrode 202 is attached to the other side of the hydrophilic layer 210 via a stencil hydrophobic impermeable layer 208. The device is constructed in a way such that counter electrode 205 and working electrode 202 are facing each other. Such an arrangement of electrode is referred to as the face-to-face arrangement (“F-F”). Without being bound to any specific theory, it is believed that the F-F configuration will have a higher effective surface area for electrochemical reactions to take place than the S-S configuration, since the electrochemical reactions take place between the faces of the two electrodes. In comparison, the S-S configuration will allow smaller effective surface area. A top view of the F-F device 200 is shown in FIG. 2(a), which demonstrates that the counter electrode 205 and working electrode 202 are facing each other resulting in a large electrochemical reaction surface area.",
                                "In some other embodiments, the first or second substrate layer are integral with and form a unitary body with the barrier material. Accordingly, barrier material 209 and substrate layer 208 form a unitary body. In some other embodiments, similarly, barrier material 207 and substrate layer 206 form a unitary body.",
                                "Microfluidic, Electrochemical Device with a Fluid Sink",
                                "In some embodiments, a microfluidic, electrochemical device with a fluid sink is described. The fluid sink is in fluidic communication with one end of the hydrophilic channel comprising the first hydrophilic region within the patterned porous, hydrophilic layer and functions as a sink to allow the fluidic sample to continuously flow through the first hydrophilic region and pass across the electrodes. Without being bound to any specific theory, it is believed that the continuous fluidic flow passing the electrodes can result in higher volume of sample contacting the surface of the electrodes, thus resulting a microfluidic, electrochemical device with a higher sensitivity and reproducibility. The fluid sink includes any hydrophilic layer that wicks fluids by capillary action. The fluid sink can be any of the material used for the porous, hydrophilic layers described herein. In one or more embodiments, the fluid sink is a hydrophilic channels or regions within the patterned porous, hydrophilic layer. In other embodiments, the fluid sink is paper. In other embodiments, the fluid sink is a pad of cellulose blotting paper.",
                                "A microfluidic, electrochemical device 300 with a fluid sink 301 is described with reference to FIG. 3. FIG. 3(a) demonstrates a simplified schematic view of the device 300. Reference electrode 305, counter electrode 303, and working electrode 304 are in contact and fluidic communication with a first hydrophilic region 312 within the hydrophilic channel 302. The hydrophilic channel 302 is in fluidic communication with an absorbing pad 301. During use, after a fluidic sample is deposited at the bottom area 313 of the hydrophilic channel 302, the fluid will continuously wick into the absorbing pad 301, thus generating a large volume of fluidic flow though the electrodes 303, 304, and 305. FIG. 3(b) shows a photographic view of a microfluidic, electrochemical device 300 with a fluid sink substrate 301. The patterned hydrophilic layer 314 comprises the hydrophilic channel 302 and a barrier region 306. The three electrodes 303, 304, and 305 are constructed on a substrate layer (omitted for simplification) and are attached to the patterned hydrophilic layer 314 using an adhesive fluid-impermeable layer 307. The fluid sink 301 is within a layer 310 beneath the hydrophilic layer 314. The layer 310 also comprises a hydrophobic region 311. In some embodiments, the layer 310 can also be a patterned hydrophilic layer and the fluid sink 301 is one of the hydrophilic channels or regions within the layer 311 and area 311 comprises the hydrophobic substrate described herein.",
                                "Three-Dimensional Microfluidic, Electrochemical Device with Vertical Fluidic Flow",
                                "In some embodiments, the microfluidic, electrochemical device is three-dimensional which allows vertical fluidic flow in addition to the two-dimensional fluidic flow within the patterned porous, hydrophilic layer. The three-dimensional microfluidic, electrochemical device comprise alternated patterned porous, hydrophilic layer and fluid-impermeable layers in addition to the substrate with the electrode(s) attached. The fluid-impermeable layers comprise apertures and the microfluidic device relies on those apertures to direct vertical microfluidic flow in which channels are etched to provide a depression in which the electrode is formed. The fluid-impermeable layer can be a sheet that is not soluble in the fluid analyzed by the microfluidic, electrochemical device and that provides the desired level of device stability and flexibility. The fluid-impermeable layer can comprise one or more openings which are in alignment with at least of a portion of the defined hydrophilic channels within the patterned porous, hydrophilic layer. When disposed between the substrate layer with the electrode(s) and patterned porous, hydrophilic layer containing the first hydrophilic region, the opening within the fluid-impermeable layer will be in alignment with both portions of the electrodes and the first hydrophilic region. Thus, upon deposition of a fluidic sample, the fluid flows through the hydrophilic channels to reach the first hydrophilic region, resulting in its contact with the electrodes and enabling appropriate electrochemical reactions.",
                                "In one or more embodiments, the fluid-impermeable layer is a plastic sheet. In certain embodiments, the fluid-impermeable layer is an adhesive sheet or tape. Non-limiting examples of fluid-impermeable layer includes Scotch® double-sided carpet tape, water-impermeable barriers include 3M Double Sided Tape, Tapeworks double sided tape, CR Laurence black double sided tape, 3M Scotch Foam Mounting double-sided tape, 3M Scotch double-sided tape (clear), QuickSeam splice tape, double sided seam tape, 3M exterior weather-resistant double-sided tape, CR Laurence CRL clear double-sided PVC tape, Pure Style Girlfriends Stay-Put Double Sided Fashion Tape, Duck Duck Double-sided Duct Tape, and Electriduct Double-Sided Tape. In certain specific embodiments, double-sided tape is used as the fluid-impermeable layer. Double-sided tape adheres to two adjacent layers of patterned paper and can bind to other components of the microfluidic, electrochemical device. It is impermeable to water, and isolates fluid streams separated by less than 200 μm. In addition, it is also sufficiently thin to allow adjacent layers of porous, hydrophilic layers to contact through openings of the tape. It can easily separate from the paper to which it adheres and thus allow disassembly of stacked devices and it is inexpensive and widely available.",
                                "As an alternative to double-sided tape, a heat-activated adhesive can be used to seal the fluid-carrying layers together. Indeed, any fluid-impermeable material that can be shaped and adhered to the pattern hydrophilic layers can be used. In addition, it is also possible to use the same material that is used to pattern the paper layers to join the layers of paper together. In one or more embodiments, a layer of photoresist is disposed between two adjacent patterned porous, hydrophilic layers.",
                                "The three-dimensional microfluidic device is described with reference to FIG. 4. FIG. 4(a) illustrates a three-dimensional microfluidic, electrochemical device 400 assembled using patterned porous, hydrophilic layers 410, 430, 450, fluid-impermeable layers 420, 440, 460, and the substrate layer 470 with electrodes 471 attached. In some embodiments, the patterned hydrophilic layers comprises paper which comprises hydrophilic channels or regions defined by the hydrophobic barrier such as photo resist on the paper. In some embodiments, the fluid-impermeable layers comprise double-sided types which has apertures to direct fluidic flow. As illustrated in FIG. 4(a), the first hydrophilic paper layer 410 comprises a hydrophilic region 411 and hydrophobic area 412 formed by photo resist. Once a fluidic sample is deposited in hydrophilic region 411, the fluid can flow though the double-side tape layer 420 via aperture 421 and into the center of the hydrophilic channel 433 within the second patterned hydrophilic paper layer 430. Through capillary actions, the fluid will then reach block-shaped hydrophilic regions 431. Optionally, at certain hydrophilic regions 432, a filtration agent or other reactant can be deposited to pre-treat the fluidic sample. Other non-limiting examples of assay reagents include other protein assay reagents, other glucose assay reagents, sodium acetoacetate assay reagents, sodium nitrite assay reagents, or a combination thereof. Other suitable assay reagents will be apparent to one skilled in the art.",
                                "Once reaching the hydrophilic region 431, the fluidic sample can then flow through apertures 441 on double-sided tape layer 440 and into the first hydrophilic region 451, which is in fluidic communication with electrode 471 on substrate 470, through aperture 461 of tape layer 460. Part of the deposited fluidic sample will also reach hydrophilic region 473 on the substrate layer 470 by sequentially passing through aperture 442, hydrophilic region 452, and aperture 462.",
                                "In some other embodiments, a three-dimensional microfluidic device 500 for running colorimetric assay is described with reference to FIG. 4(b). The device is assembled by alternated layers of double-sided tape 480, 500, 520 and patterned paper 490, 510, and 530. When a fluidic sample is deposited in aperture 481 of tape layer 480, the fluid will flow into the center region of the cross-shaped hydrophilic channel 492 on patterned paper layer 490 defined by photo resist 491, and reach the edge of the hydrophilic channel 493. In turn, the fluid will flow through the aperture 501 of the double-sided tape layer 500 and into the smaller cross-shaped hydrophilic channel 511 on patterned paper layer 500. The flow of the fluid then reaches the edge of the hydrophilic channel 512, pass through aperture 521 of tape layer 520, and reaches the hydrophilic regions 531 on the bottom patterned hydrophilic layer 530. Regions 531 are test zones pre-spotted with reagents for one or more colorimetric assays. A more detailed description of the three-dimensional microfluidic device for running colorimetric assay can be found in WO 2009/121037, filed Mar. 27, 2009, which is hereby incorporated by reference in its entirety.",
                                "The incorporation of multiple detection methods on a single three-dimensional microfluidic device has multiple advantages: i) it extends the range of analytes that the device is able to be detected; ii) it improves the reliability of the diagnosis; iii) it has the ability to quantitatively detect multiple analytes with optimal selection of the detection method for each; iv) it allows the integration of high density sensors; v) it lowers the cost of each detection, since it shares the cost of sample preparation, introduction, and microfluidic distribution systems over multiple assays.",
                                "The microfluidic device can use apertures or openings within the separating fluid-impermeable layer to direct vertical microfluidic flow. In some embodiments, the aperture or opening within the fluid-impermeable layer is filled with a hydrophilic medium to improve the vertical flow (or flow through). The hydrophilic medium fills the opening within the separating layer to bridge the gap between the adjacent hydrophilic layers. As a result, the two microfluidic regions within two adjacent patterned porous, hydrophilic layers that partially overlap with the opening will be in direct contact with the hydrophilic material in the opening, thus allowing optimized microfluidic flow by capillarity. In one or more embodiments, the porous, hydrophilic material substantially fills the void within the separating layer created by the aperture. In one or more embodiments, the porous, hydrophilic material substantially matches the shape of the opening. The porous, hydrophilic material filling the opening can be, for example, porous paper pads or “dots” that have a thickness similar to the thickness of the fluid-impermeable layer. The paper can be cut into shape to match the dimensions of the void space created by the aperture in the fluid-impermeable layer.",
                                "Other materials as described herein suitable for use as the patterned porous, hydrophilic layer and the fluid-impermeable layer are also contemplated."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe side-by-side electrode arrangement (S-S)",
                                "illustrate S-S arrangement with reference to FIG. 1",
                                "describe face-to-face electrode arrangement (F-F)",
                                "illustrate F-F arrangement with reference to FIG. 2",
                                "describe working electrode, reference electrode, and counter electrode",
                                "describe F-F arrangement with higher effective surface area",
                                "describe alternative substrate layer and barrier material configurations",
                                "describe microfluidic, electrochemical device with fluid sink",
                                "illustrate device with fluid sink with reference to FIG. 3",
                                "describe fluid sink materials",
                                "describe three-dimensional microfluidic, electrochemical device with vertical fluidic flow",
                                "illustrate device with reference to FIG. 4",
                                "describe patterned porous, hydrophilic layers and fluid-impermeable layers",
                                "describe apertures in fluid-impermeable layers",
                                "describe vertical microfluidic flow",
                                "describe hydrophilic medium in apertures",
                                "describe porous, hydrophilic material filling apertures",
                                "describe materials for patterned porous, hydrophilic layer and fluid-impermeable layer",
                                "describe advantages of three-dimensional microfluidic device",
                                "describe incorporation of multiple detection methods",
                                "describe improved reliability of diagnosis",
                                "describe quantitative detection of multiple analytes",
                                "describe integration of high density sensors",
                                "describe cost-effectiveness of three-dimensional microfluidic device",
                                "describe use of apertures or openings in fluid-impermeable layer",
                                "describe hydrophilic medium in apertures or openings",
                                "describe porous, hydrophilic material filling apertures or openings",
                                "describe materials for patterned porous, hydrophilic layer and fluid-impermeable layer",
                                "describe advantages of three-dimensional microfluidic device"
                            ],
                            "num_characters": 14755,
                            "outline_medium": [
                                "describe arrangement of electrodes in side-by-side configuration",
                                "illustrate side-by-side configuration with reference to FIG. 1",
                                "describe arrangement of electrodes in face-to-face configuration",
                                "illustrate face-to-face configuration with reference to FIG. 2",
                                "describe substrate layer with integral barrier material",
                                "describe etching of film to form channels for electrodes",
                                "describe constructing electrodes on substrate layer",
                                "describe using conductive ink to fill opening of stencil",
                                "describe removing protective layer of double-sided type",
                                "describe attaching patterned porous, hydrophilic layer to double-sided type",
                                "describe microfluidic, electrochemical device with fluid sink",
                                "describe fluid sink in fluidic communication with hydrophilic channel",
                                "describe continuous fluidic flow passing electrodes",
                                "describe microfluidic, electrochemical device with higher sensitivity and reproducibility"
                            ],
                            "outline_short": [
                                "describe arrangement of electrodes",
                                "illustrate side-by-side arrangement with reference to FIG. 1",
                                "describe face-to-face arrangement with reference to FIG. 2",
                                "illustrate face-to-face arrangement with reference to FIG. 2",
                                "describe substrate layer with integral barrier material",
                                "describe etching of film to form channels",
                                "describe other methods of fabricating substrate layer"
                            ]
                        },
                        {
                            "title": "Detection Methods for Electrochemical Analysis Using the Microfluidic, Electrochemical Devices",
                            "paragraphs": [
                                "In some embodiments, a fluidic sample is deposited in one of the one or more hydrophilic channels to allow the fluid sample to flow through the hydrophilic channel to contact with the electrode. In some embodiments, the fluidic sample can be deposited on top of the electrode. In some other embodiment, the fluidic sample is deposited in one end of a hydrophilic channel and is wicked through the channel to contact the electrode. In some embodiments, the fluidic sample is deposited on one end of the hydrophilic channel comprising the first hydrophilic region and the microfluidic, electrochemical device further comprises a fluid sink in fluidic communication with the other end of the hydrophilic channel comprising the first hydrophilic region to maintain a constant fluidic low of the fluidic sample through the electrode(s).",
                                "The electrochemical devices can be configured to be used in a variety of analytical methods. Non-limiting methods include impedance measurement, amperometry (measurement of electrical currents), biamperometry, stripping voltammetry, differential pulse voltammetry, cyclic voltammetry, coulometry, and potentiometry. In some embodiments, the analytes within the fluidic sample are detected by chronoamperometric method. In some specific embodiments, the analyte is glucose. Other non-limiting examples of analyte which can be detected by chronoamperometric method include metabolites such as cholesterol, uric acid, and lactate, blood gases such as oxygen, DNA, and other analytes such as haemoglobin, nitric oxide, and blood ketones.",
                                "In some embodiments, the glucose in the sample is detected using the microfluidic, electrochemical devices by chronoamperometric method. Chronoamperometry is an electrochemical technique in which the potential of the working electrode is stepped, and the resulting current from faradic processes occurring at the electrode (caused by the potential step) is monitored as a function of time. Information about the identity of the electrolyzed species can be obtained from the ratio of the peak oxidation current versus the peak reduction current. The reactions for the glucose detection are",
                                "In the first step, glucose oxidase catalyzed the oxidation of glucose to gluconic acid with concomitant reduction of Fe(III) to Fe(II) (eq 1); the Fe(CN)64− ions generated were detected chronoamperometrically (eq 2). The corresponding cathodic reaction was described in (eq 3).",
                                "In some embodiments, the detection of glucose using microfluidic, electrochemical device demonstrate comparable sensitivity and detection limits compared with the detection used in bulk solutions. The microfluidic, electrochemical device, however, several advantages: i) it stabilizes the geometry of the electrode; ii) it reduces the effect of convection of liquids due to random motion, vibration and heating; iii) it minimizes the total volume of solution required for analysis.",
                                "Without wishing to be bound to any particular theory, it is believed that the use of microfluidic, electrochemical device confines the fluids in the hydrophilic channel, inhibits the convective movement of fluids, and thus facilitates the chronoamperometric measurements by minimizing the disturbances of the stationary boundary layer in the vicinity of electrodes due to vibration, thermal or density-based convection, and other disturbing sources. In addition, the normal level of glucose in urine is 0.1-0.8 mM, and 3.5-5.3 mM in whole blood. In some embodiments, the detection limit of glucose in the microfluidic, electrochemical device is about 0.22 mM (corresponding to 4 mg/mL). This value is below the approximately 1.0 mM claimed in specifications of conventional glucometers.",
                                "In other embodiments, the analytes within the fluidic sample is detected and measured by anodic stripping voltammetry (ASV) through the use of the microfluidic, electrochemical device described herein. Anodic stripping voltammetry is a voltammetric method for quantitative determination of specific ionic species. The analyte of interest is electroplated on the working electrode during a deposition step, and oxidized from the electrode during the stripping step. The current is measured during the stripping step. In some specific embodiments, heavy metal ions in a fluidic sample can be detected by anodic stripping voltammetry thought the use of the microfluidic, electrochemical device. Non-limiting examples of heavy metal ions include mercury, lead, copper, zinc, bismuth, and cadmium.",
                                "The pollution of heavy-metal ions in soil and water presents a global issue, and poses a severe threat to both the ecosystem and humans. Square-wave anodic stripping voltammetry (SWASV) is an ASV method frequently used for the measurement of trace heavy metals because it greatly reduces the background noise coming from the charging current during the potential scan. Conventional ASV measurements of heavy metal ions are usually performed either by dipping electrodes in a sample solution under controlled stirring condition or by placing a sample droplet onto the electrodes. The former approach is not practical in field measurements due to the difficulty of synchronizing the stirring and ASV procedures. The latter one shows limited sensitivity of measurement because pre-accumulation of analytes in stripping is limited by diffusion. Additionally, in this case, new electrodes are usually required for each measurement since it is difficult to remove the residue of deposited metals in a stagnant drop of solution before the next cycle of ASV.",
                                "In some embodiments, heavy metal ions are detected by anodic stripping voltammetry (ASV) through the use of the microfluidic, electrochemical device described herein. In some specific embodiments, Pb(II) is detected by the use of the microfluidic, electrochemical device described herein. In some embodiments, a fluid sink is included in the microfluidic, electrochemical devices. In some specific embodiments, the fluid sink is a pad of cellulose blotting paper as a sink in the outlet of the hydrophilic channel (see FIG. 3). The use of an absorbing pad allows the continuous wicking of fluids to pass across the electrodes, and facilitates the plating of metals, as well as the cleaning of electrodes. In some embodiments, the size of the cellulose blotting paper is adjusted to optimize the wicking time of fluids in the hydrophilic channel so that the flow stopped before the system entered the equilibration step in the process of SWASV, which results in higher sensitivity and reproducibility of the measurement. Without wishing to be bound to any particular theory, it is believed that the enhanced sensitivity can be attributed to the high efficiency of the accumulation of metals on the electrodes by convection of flowing fluids in the porous, hydrophilic channels over the electrodes, and to the large volume (˜800 μL) of sample that flows across the surface of the electrodes.",
                                "The following example is provided to illustrate the invention, which is not intended to be limiting of the invention, the scope of which is set forth in the claims which follow."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe fluidic sample deposition methods",
                                "introduce electrochemical devices for analytical methods",
                                "list non-limiting analytical methods",
                                "describe chronoamperometric method for glucose detection",
                                "explain glucose detection reactions",
                                "compare microfluidic device with bulk solution detection",
                                "describe advantages of microfluidic device",
                                "explain theory of microfluidic device operation",
                                "describe detection limit of glucose",
                                "introduce anodic stripping voltammetry (ASV) method",
                                "describe ASV method for heavy metal ion detection",
                                "explain advantages of microfluidic device for ASV",
                                "describe fluid sink in microfluidic device",
                                "explain enhanced sensitivity of ASV method"
                            ],
                            "num_characters": 7122,
                            "outline_medium": [
                                "describe fluidic sample deposition methods",
                                "list electrochemical analytical methods",
                                "detail chronoamperometric method for glucose detection",
                                "describe advantages of microfluidic, electrochemical device",
                                "explain detection of glucose using chronoamperometric method",
                                "describe anodic stripping voltammetry for heavy metal ion detection",
                                "detail detection of heavy metal ions using anodic stripping voltammetry"
                            ],
                            "outline_short": [
                                "describe chronoamperometric method for glucose detection",
                                "describe anodic stripping voltammetry for heavy metal ion detection",
                                "highlight advantages of microfluidic, electrochemical device over bulk solutions"
                            ]
                        },
                        {
                            "title": "Chemical Reagents",
                            "paragraphs": [
                                "Carbon ink (E3456) and Ag/AgCl ink (AGCL-675C) were purchased from Ercon Inc (Wareham, Mass.) and Conductive Compound (Hudson, N.H.), respectively. Glucose oxidase (136,300 U/mg, Aspergillus niger), glucose, and potassium ferricyanide were purchased from Aldrich and used as received. Stock solutions of β-D-glucose were prepared in a PBS buffer (pH 7.0) and allowed to mutarotate overnight before use. Atomic absorption standard solutions of Pb(II) (104 mg/L), Zn(II) (103 mg/L), and Bismuth(III) (103 mg/L) were obtained from Aldrich, USA, and diluted as required. 0.1M acetate buffer (pH 4.5) was used as a supporting electrolyte."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list chemical reagents used"
                            ],
                            "num_characters": 633,
                            "outline_medium": [
                                "list chemical reagents used"
                            ],
                            "outline_short": [
                                "list chemical reagents used in the invention"
                            ]
                        },
                        {
                            "title": "Apparatus",
                            "paragraphs": [
                                "All chronoamperometric measurements were performed with a bipotentiostat (PINE Instrument Company, Model AFCBP1). A modular electrochemical system AUTOLAB equipped with PGSTAT12 was used in combination with GPES software (Eco Chemie) for the anodic stripping voltammetric measurements of heavy metal ions.",
                                "**Electrodes**",
                                "A microfludic paper-based elecrochemical device (μPEDs) was fabricated by screen-printing carbon ink (or Ag/AgCl ink for a reference electrode) on a piece of paper or polyester film. A stencil was generated for printing by designing patterns of electrodes using Adobe Freehand®, followed by cutting the pattern into double-sided adhesive tape using a laser-cutter (VersaLASER VLS3.50, Universal Laser Systems Inc.). The stencil was taped on top of a paper or plastic substrate, and filled the openings of the stencil with ink. The electrodes were baked on a hotplate at 100° C. for 30 minutes. After the ink dried, the protective backing layer of the tape was removed and the adhesive layer on the substrate for the assembly of a paper channel was left on the top of electrodes. The thickness of the electrodes was approximately 100 μm. A typical working and counter electrode had dimensions of 1.5 cm in length and 4 mm in width, and a typical reference electrode had dimensions of 1.5 cm in length and 3 mm in width.",
                                "**Microfluidic Channels**",
                                "The layers of patterned hydrophilic paper were constructed following the procedures described in WO 2008/049083. The patterns for the paper-based microfluidic devices were designed using the layout editor CleWin. Specifically, paper-based microfluidic channels were fabricated by patterning chromatography paper (Whatman 1 Chr) or polyester/cellulose blend paper (VWR®Spec-Wip) by photolithography or wax printing. Briefly, a piece of paper was soaked with SU-8 2010 photoresist, baked it at 95° C. for 5 min to remove solvents, and photoexposed it to UV light for 10 s through a photomask. The unpolymerized photoresist was removed by soaking the paper in acetone and washing three times with isopropanol. The polymers patterned on the paper form hydrophobic barriers to confine liquids in the microchannel. The paper microfluidic channel had dimensions of 4 mm in width and 100 μm in height (determined by the thickness of the paper), FIG. 1. The paper-based channels were assembled onto the electrodes using double-sided adhesive tapes. The contact area between a paper channel and a working electrode was 4 mm by 4 mm."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe bipotentiostat used",
                                "describe modular electrochemical system used",
                                "describe fabrication of microfluidic paper-based electrochemical device (μPEDs)",
                                "describe microfluidic channel fabrication"
                            ],
                            "num_characters": 2492,
                            "outline_medium": [
                                "describe bipotentiostat and modular electrochemical system",
                                "detail fabrication of microfluidic paper-based electrochemical device"
                            ],
                            "outline_short": [
                                "describe electrochemical measurement setup"
                            ]
                        },
                        {
                            "title": "Chronoamperometric Measurements",
                            "paragraphs": [
                                "Chronoamperometric experiments were performed using a 500 mV step potential (versus a carbon pseudo-reference electrode) to generate the calibration curve; these experiments used glucose with concentrations ranged from 0 to 22.2 mM (corresponding to 400 mg/dL). Solutions (Glucose oxidase 250 U/mL, K3[Fe(CN)6] 600 mM, KCl 1.0 M in pH 7.0 PBS buffer) containing glucose with different concentrations were measured (each sample was examined eight times). The solution of enzyme was spotted on top of the paper microchannel. The solution of enzyme was distributed evenly in the paper channel due to the capillary wicking. After the solution dried, the enzyme was uniformly absorbed in the paper. When a solution of analytes was added into the microchannel, the solution distributed and mixed well with the pre-loaded enzyme. In another set of experiments, the enzyme solution was premixed with glucose samples before the chronoamperometric measurements. No obvious difference was observed between the two methods. Paper can also be easily modified to immobilize enzymes if necessary. All measurements were conducted at room temperature under ambient conditions. A carbon working electrode (on a plastic substrate) was used with a surface area of 16 mm2 in contact with the fluid for the detection of glucose in the bulk solution. An average of the eight measurements of current readout was recorded and calculated the corresponding standard deviation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe chronoamperometric experiment conditions",
                                "explain enzyme solution preparation and measurement procedure"
                            ],
                            "num_characters": 1449,
                            "outline_medium": [
                                "describe chronoamperometric experiments"
                            ],
                            "outline_short": [
                                "describe chronoamperometric experiment procedure"
                            ]
                        },
                        {
                            "title": "Anodic Stripping Voltammetry",
                            "paragraphs": [
                                "Stripping voltammetric measurements were performed by in situ deposition of the bismuth (500 μg/L) and the target metal ions with concentrations ranged from 0 to 100 ppb (μg/L). Non-deaerated solutions were used for all measurements, and each sample was measured eight times. All measurements were carried out using the square-wave anodic stripping voltammetry (SWASV) with a frequency of 20 Hz, a potential step of 5 mV, and an amplitude of 25 mV. SWASV experiments comprised an electrochemical deposition step at −1.2V for 120 s, an equilibration period of 30 s, and a square-wave voltammetric stripping scan usually from −1.2 to −0.5 V. Before each measurement a pre-conditioning step (for cleaning of the electrode) at a potential of +0.5V was applied for 60 s.",
                                "Square-wave anodic stripping voltammetry was used for the measurements of heavy metal ions in the μPEDs. The measurements of trace metals relied on the simultaneous (in situ) plating of bismuth and target metals onto screen-printed carbon electrodes, which formed alloys followed by anodic stripping of metals from the electrode."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe SWASV experiment conditions",
                                "explain in situ deposition of bismuth and target metal ions"
                            ],
                            "num_characters": 1096,
                            "outline_medium": [
                                "describe anodic stripping voltammetric measurements"
                            ],
                            "outline_short": [
                                "describe anodic stripping voltammetry experiment procedure"
                            ]
                        },
                        {
                            "title": "Electrochemical Characterization of Paper-Based Electrochemical Devices",
                            "paragraphs": [
                                "Ferrocene carboxylic acid was used as a model redox-active compound to characterize electrochemical behavior of μPEDs (FIG. 5a). The peak shape of the CVs showed a typical reversible (Nernstian) electrochemical reaction in which the rate of reaction is governed by the diffusion of the electroactive species to the surface of a planar electrode. The difference in potential between the peaks of the reduction (Epc) and oxidation (Epa) curves was 0.068 V (a value that is close to the theoretical value of 0.059 V for the ferrocene redox pair) for all scan rates between 50 to 500 mV/s, and the peak current ratio (ipa/ipc) was equal to 1.0.14 This reversible behavior indicated that no side reactions take place, and that, as expected, the kinetics of electron transfer was sufficiently rapid to maintain the surface concentrations of redox-active species at the values required by the Nernst equation.",
                                "FIG. 5b shows that the anodic peak current, Ip, was linearly proportional to the square root of the scan rate (ν1/2) in both bulk solution and the μPED. The value of diffusion coefficient evaluated by analyzing the slope observed in bulk solution was 4.3×10−6 cm2/sec, which was fairly close to the reported value of 5.7×10−6 cm2/sec. The current readout (FIG. 2b) measured using the paper device is about 30% lower than that measured in bulk solution. It was presumed that this difference was due to the fact that 30-40% of the volume in diffusional contact with the electrodes is occupied by the cellulose fiber of the paper. These results containing the redox-active species, did not slow the rate of mass-limited charge transfer relative to that in solution."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe ferrocene carboxylic acid as a model redox-active compound",
                                "explain electrochemical behavior of μPEDs",
                                "compare anodic peak current in bulk solution and μPED"
                            ],
                            "num_characters": 1666,
                            "outline_medium": [
                                "characterize electrochemical behavior of μPEDs"
                            ],
                            "outline_short": [
                                "describe electrochemical characterization of μPEDs using ferrocene carboxylic acid"
                            ]
                        },
                        {
                            "title": "Chronoamperometric Analysis of Glucose in Urine",
                            "paragraphs": [
                                "The use of a μPED in the analysis of glucose in artificial urine was demonstrated using chronoamperometry. Chronoamperometry offers a better signal-to-noise ratio than other electrochemical techniques in this kind of experiment, and the use of a thin slab of fluids mechanically clamped to the electrodes is more resistant to vibration than analysis in a larger volume of solution. The chronoamperometric measurement of current—reflecting charge transfer to/from the redox-active species as a function of time at constant applied voltages—begins with an initially large capacitive current. Upon the decay of the initial capacitive current within one to two seconds, Faradaic current (the current that is proportional to the concentration of the analyte) dominates. The current, I, decays as t−1/2 as described by the Cottrell",
                                "equation (eq 4) where n is the number of electrons, t is the",
                                "\\(\\begin{matrix}\n{i = \\frac{{nFAD}^{\\frac{1}{2}}C}{\\pi^{\\frac{1}{2}}t^{\\frac{1}{2}}}} & (4)\n\\end{matrix}\\)",
                                "time, F is Faraday's constant, A is the area of the electrode, D is the diffusion coefficient of analytes, and C is the initial concentration of the reactants.",
                                "The μPED confines fluids in the paper channel, inhibits the convective movement of fluids, and thus facilitates the chronoamperometric measurements by minimizing the disturbances of the stationary boundary layer in the vicinity of electrodes due to vibration, thermal or density-based convection, and other disturbing sources. FIG. 6a shows a representative chronoamperometric response of the measurements of glucose using a μPED. Over the range of concentrations of glucose examined (0-22.2 mM), all the response curves reached a steady state two seconds after the step potential (also see the Cottrell plot in supplementary information). FIG. 6b shows a calibration curve for the detection of glucose. When the concentration of glucose was in the range of 0-22.2 mM, the current was linearly proportional to the glucose concentration in the artificial urine.",
                                "The interference of the sensing device with bovine serum albumin (BSA) as a typical globular protein; serum albumins are present in highest concentrations in serum, and thus relevant to bioanalysis. It was found that the presence of 40 μM BSA did not interfere with the measurement of glucose; this selectivity is due to the specificity of enzymatic oxidation of glucose; the BSA apparently does not foul the electrodes. Comparing the results of the detection of glucose in the μPEDs to those in bulk solutions (FIG. 6b), it was noticed that the two methods showed comparable sensitivity and detection limits; the paper matrix did not intefere with the detection. The paper matrix in the μPEDs has, however, several advantages: i) it stabilizes the geometry of the electrode; ii) it reduces the effect of convection of liquids due to random motion, vibration and heating; iii) it minimizes the total volume of solution required for analysis. The normal level of glucose in urine is 0.1-0.8 mM, and 3.5-5.3 mM in whole blood. The μPED device should therefore be capable of measuring glucose in other biological fluids such as serum and blood. The detection limit of glucose in the current μPED was about 0.22 mM (corresponding to 4 mg/mL). This value is below the approximately 1.0 mM claimed in specifications of conventional glucometers, and 0.5 mM obtained by colorimetric detection method reported previously. It was estimated the sensitivity of the glucose analysis to be 0.43 μA·mM−1·mm−2. In principle, other species in real urine and blood may interfere when, 500 mV potentials ae used for the analysis of glucose. The potential can be reduced to around 300 mV for the measurements in biological fluids, thanks to the enzymatic selectivity of glucose oxidase. The paper-based device also has the potential to be integrated with various separation techniques such as paper chromatography to minimize interferences.",
                                "**Anodic Stripping Voltammetric Analysis of Heavy Metal Ions**",
                                "Heavy-metal ions such as mercury, lead, and cadmium are toxic, non-biodegradable, and tend to accumulate in plants and animals. The pollution of heavy-metal ions in soil and water presents a global issue, and poses a severe threat to both the ecosystem and humans. Square-wave anodic stripping voltammetry (SWASV) is an ASV method frequently used for the measurement of trace heavy metals because it greatly reduces the background noise coming from the charging current during the potential scan. Conventional ASV measurements of heavy metal ions are usually performed either by dipping electrodes in a sample solution under controlled stirring condition or by placing a sample droplet onto the electrodes. The former approach is not practical in field measurements due to the difficulty of synchronizing the stirring and ASV procedures. The latter one shows limited sensitivity of measurement because pre-accumulation of analytes in stripping is limited by diffusion. Additionally, in this case, new electrodes are usually required for each measurement since it is difficult to remove the residue of deposited metals in a stagnant drop of solution before the next cycle of ASV.",
                                "It was demonstrated that μPEDs can be used in the selective measurement of Pb(II) in an aqueous mixture of Pb(II) and Zn(II) using SWASV. The designed of μPEDs was modified by introducing a pad of cellulose blotting paper as a sink in the outlet of the paper channel (FIG. 3c). The μPED allowed the continuous wicking of fluids to pass across the electrodes, and facilitated the plating of metals, as well as the cleaning of electrodes. By tuning the size of the cellulose blotting paper, the wicking time of fluids in the paper channel of μPEDs was optimized so that the flow stopped before the system entered the equilibration step in the process of SWASV.",
                                "FIG. 8 displays representative stripping voltammograms for the measurement of 25 ppb (μg/L) Pb(II) in acetate buffer solution in the presence of Zn(II). The voltammograms in the hydrodynamic μPEDs, in which the fluid of the sample solution continuously wicked in the paper microchannel, showed a well-defined, sharp peak for Pb(II) at ca. 780 mV versus the Ag/AgCl reference electrode (C and D in FIG. 8). In contrast, under the same SWASV conditions, a stagnant solution of analytes, both in the μPEDs (without a pad of blotting paper as a sink) and in an experiment that placed a droplet of sample solution on the electrodes, resulted in a much weaker signal (A in FIG. 8) or a poorly-defined response (B in FIG. 8). The hydrodynamic μPEDs thus exhibited a much higher sensitivity by a factor of five than the stagnant systems.",
                                "In the hydrodynamic μPEDs, the peak current of the analysis of Pb (II) dramatically increased with increasing the deposition time (FIG. 8). The peak current increased from 3.9 μA to 10.3 μA with the increase of deposition time from 120 s to 360 s. This increase was not obvious in the stagnant systems, since the deposition efficiency decays quickly with time due to the mass-transfer-limited reaction in the vicinity of the surface of electrodes. Moreover, it was found that the stagnant μPEDs showed a more poorly defined signal, compared to the system with a drop of sample solution directly placed onto the electrodes (FIG. 8). It is presumed that this is because the cellulose matrix in the stagnant μPEDs inhibits convective movement of the solutions, and thus affected the stripping behavior of Pb(II).",
                                "The stripping voltammograms for the analysis of Pb(II) in the hydrodynamic μPEDs showed well-defined peaks and a strong signal over a wide range of concentrations of Pb(II); this level of performance offers convenient quantification of low ppb levels of lead (FIG. 9a). The peak intensity increased proportionally with the concentration of Pb(II), which yielded a highly linear calibration plot with a slope of 0.17 μA·ppb−1 for lead (correlation coefficient, 0.996) (FIG. 9b). The limit of detection of lead was estimated from the signal-to-noise characteristics of the data to be approximately 1.0 ppb (μg/L); this value is even lower than 2.5 ppb obtained in conventional systems with controlled stirring. This value is also much lower than the 10 ppb (μg/L) WHO guideline value for lead concentration in drinking water. It is believed that even lower concentrations of lead could be detected if longer deposition periods were used. The sensitive measurement of Pb(II) in the hydrodynamic μPEDs is highly reproducible, as indicated by the low relative standard deviation.",
                                "The performance of the hydrodynamic μPEDs for the analysis of lead was compared with the stagnant system, in which a drop of sample solution was placed on electrodes (FIG. 9b). The stagnant system exhibited a much lower sensitivity of 0.05 μA·ppb−1 for lead (correlation coefficient, 0.978), and a higher limit of detection of 4.3 ppb, than the dynamic measurement. Unlike the stagnant system, small perturbations (e.g., vibration, heating) did not interfere with the analysis of lead in the hydrodynamic μPEDs due to the stabilization of the flow of the sample solution by the paper matrix; this stabilization resulted in a high reliability and reproducibility of the measurements. The device can be reused by simply replacing the pad of blotting paper, since the continuous wicking removes dissolved analytes before the next cycle of the deposition of metals.",
                                "**The Optimization of the Arrangement of Electrodes on the Paper Device**",
                                "The performance of the μPED with different arrangements of the working and counter electrodes was compared. FIG. 7 shows a paper device with another geometry where the working and counter electrodes were placed face-to-face at top and bottom of the paper channel (“F-F μPED”). The device where working and counter electrodes were placed side-by-side beneath the paper channel is referred to as “S-S μPED.”",
                                "FIG. 7 shows the peak current in CV experiments as a function of the square root of the scan rate, ν1/2. Under the same experimental conditions, the F-F μPED showed higher response currents in CV experiments, than did the corresponding S-S μPED. The F-F configuration probably has a higher effective surface area for electrochemical reactions can take place than the S-S configuration, since the electrochemical reactions take place between the two electrodes. The slope of the plot of the F-F μPED was close to that of the measurements in bulk solution. These results demonstrate that the configuration of electrodes influences the performance of the μPED, and that the paper material does not interfere with the electrochemistry. In terms of the spatial arrangement of electrodes, the flow passes through the working and counter electrodes in the F-F μPED at the same time, rather than in sequence as in S-S μPED. It is thought that the F-F μPED should show a performance superior in following the concentration of analytes flowing continuously in the paper channels. The F-F organization of electrodes also allows dense packing of sensors than S-S.",
                                "**Performance of Gold Electrodes in the Paper-Based Devices**",
                                "Other types of electrodes, for example, gold stripes coated on plastics are also suitable for the paper-based electrochemical device, and may be used for specific applications. Paper devices with electrodes made from gold stripes showed excellent performance in cyclic voltammetry, but were less robust than the carbon-based electrodes. FIG. 10 shows that the electrochemical reactions were reversible on Au electrodes in the μPEDs."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce chronoamperometry",
                                "describe advantages of chronoamperometry",
                                "explain chronoamperometric measurement",
                                "define Cottrell equation",
                                "describe μPED confinement of fluids",
                                "show representative chronoamperometric response",
                                "display calibration curve for glucose detection",
                                "test interference with bovine serum albumin",
                                "compare results with bulk solutions",
                                "list advantages of paper matrix",
                                "discuss detection limit of glucose",
                                "estimate sensitivity of glucose analysis",
                                "discuss potential interferences in biological fluids",
                                "suggest integration with separation techniques",
                                "introduce anodic stripping voltammetric analysis",
                                "describe importance of heavy metal ion detection",
                                "explain square-wave anodic stripping voltammetry",
                                "describe μPED design for ASV",
                                "show representative stripping voltammograms",
                                "discuss peak current increase with deposition time",
                                "compare hydrodynamic μPEDs with stagnant systems",
                                "discuss limit of detection of lead",
                                "compare performance of hydrodynamic μPEDs with stagnant systems"
                            ],
                            "num_characters": 11559,
                            "outline_medium": [
                                "demonstrate chronoamperometry",
                                "describe chronoamperometric measurement",
                                "explain Cottrell equation",
                                "describe μPED confinement of fluids",
                                "show chronoamperometric response",
                                "show calibration curve for glucose detection",
                                "test interference with bovine serum albumin",
                                "compare μPED to bulk solution detection",
                                "discuss advantages of paper matrix",
                                "estimate detection limit and sensitivity",
                                "discuss potential for integration with separation techniques"
                            ],
                            "outline_short": [
                                "demonstrate chronoamperometry",
                                "describe chronoamperometric measurement",
                                "analyze glucose detection in μPED",
                                "evaluate interference with BSA",
                                "discuss advantages of μPED"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe microfluidic, electrochemical device",
                        "introduce electrode assembly and porous, hydrophilic layer",
                        "describe electrode assembly with barrier material",
                        "describe porous, hydrophilic layer with fluid-impermeable barrier",
                        "illustrate device with reference to FIG. 1",
                        "describe substrate layer and electrode materials",
                        "describe fabrication of electrode assembly",
                        "describe patterning of porous, hydrophilic layer",
                        "describe attachment of porous, hydrophilic layer to electrode assembly",
                        "describe alternative substrate layer and barrier material configurations",
                        "describe fabrication of microfluidic, electrochemical device",
                        "describe configuration of electrodes",
                        "illustrate side-by-side electrode arrangement (S-S)",
                        "illustrate face-to-face electrode arrangement (F-F)",
                        "describe microfluidic, electrochemical device with fluid sink",
                        "describe three-dimensional microfluidic, electrochemical device with vertical fluidic flow",
                        "describe advantages of three-dimensional microfluidic device"
                    ],
                    "num_characters": 8605,
                    "outline_medium": [
                        "describe microfluidic, electrochemical device",
                        "define electrode assembly and porous, hydrophilic layer",
                        "illustrate device with reference to FIG. 1",
                        "describe fabrication of electrode assembly",
                        "describe patterning of porous, hydrophilic layer",
                        "describe attachment of patterned porous, hydrophilic layer to electrode assembly",
                        "describe resulting patterned porous, hydrophilic layer with hydrophilic channels",
                        "describe microfluidic flow by capillary action"
                    ],
                    "outline_short": [
                        "describe microfluidic, electrochemical device",
                        "illustrate device with reference to FIG. 1",
                        "describe fabrication of device",
                        "describe materials used for device"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1-30. (canceled)",
        "31. A microfluidic, electrochemical analysis device comprising:\na porous, hydrophilic layer comprising a fluid sample deposition region and a patterned, fluid impermeable boundary that substantially permeates the thickness of the hydrophilic layer and defines one or more hydrophilic channels therewithin in fluidic communication with said deposition region which permit fluidic flow within the one or more channels; and\nan electrode assembly comprising one or more electrodes in fluidic communication with said deposition region through a said channel.",
        "32. The device of claim 31 wherein the electrode assembly is supported by or comprises a portion of said porous, hydrophilic layer.",
        "33. The device of claim 31 wherein the device further comprises a substrate layer supporting the electrode assembly.",
        "34. The device of claim 33 wherein the substrate comprises paper or plastic film.",
        "35. The device of claim 31 wherein the fluid impermeable boundary further defines said sample deposition region.",
        "36. The device of claim 31 further comprising a filter or an assay reagent in a hydrophilic channel.",
        "37. The device of claim 31 further comprising plural porous, hydrophilic layers, respectively separated by a fluid impermeable layer defining one or more openings in alignment with at least a portion of a said channel within a hydrophilic layer to permit vertical fluidic communication through said fluid impermeable layer between said hydrophilic layers.",
        "38. The device of claim 37 wherein a said electrode assembly is disposed in fluidic communication with a hydrophilic channel on one said hydrophilic layer and said sample deposition region is disposed on another.",
        "39. The device of claim 37 wherein a said fluid impermeable layer comprises a polymer sheet or an adhesive sheet.",
        "40. The device of claim 31 wherein said porous, hydrophilic layer comprises paper.",
        "41. The device of claim 31 wherein said porous, hydrophilic layer comprises chromatography paper.",
        "42. The device of claim 31 further comprising a fluid sink in fluidic communication with and downstream of one end of the hydrophilic channel and said electrode assembly enabling flow of a fluid through the hydrophilic channel and across said electrode assembly.",
        "43. The device of claim 31 wherein the electrode assembly comprises an electrically conductive region of said hydrophilic layer surrounded at least in part by a fluid impermeable boundary.",
        "44. The device of claim 31 wherein the fluid impermeable boundary comprises a wax or a polymerized photoresist.",
        "45. The device of claim 31 wherein the electrode assembly comprises a working electrode and a counter electrode.",
        "46. The device of claim 45 wherein the electrode assembly further comprises a reference electrode.",
        "47. The device of claim 31 wherein the electrodes of said electrode assembly are arranged side by side in said hydrophilic layer.",
        "48. The device of claim 31 comprising plural porous, hydrophilic layers, respectively separated by a fluid impermeable layer defining one or more openings in alignment with at least a portion of a said channel within a hydrophilic layer to permit vertical fluidic communication through said fluid impermeable layer between the hydrophilic layers, wherein the electrode assembly comprises electrodes arranged facing one another in adjacent layers.",
        "49. The device of claim 31 wherein an electrode is screen-printed on said porous, hydrophilic layer.",
        "50. The device of claim 33 wherein an electrode is screen-printed on the substrate layer.",
        "51. A method of determining the presence or concentration of one or more analytes in a fluid sample using a microfluidic, electrochemical device of claim 31 or 37, comprising:\ndepositing a fluid sample onto said deposition region;\npermitting the sample to wick along a hydrophilic channel to provide fluidic contact of the sample with said electrode assembly; and\nmeasuring an electrochemical parameter or the presence or concentration of an electrolyte in said electrode assembly as an indicator of the presence or concentration of an analyte in the sample.",
        "52. The method of claim 51 wherein the electrochemical parameter is correlated with a concentration of an analyte.",
        "53. The method of claim 51 wherein the electrochemical parameter is correlated with the presence of the one or more analytes.",
        "54. The method of claim 51 using the device of claim 37 wherein said sample deposition region is positioned substantially over said electrode assembly.",
        "55. The method of claim 51 wherein the microfluidic, electrochemical device further comprises\na fluid sink in fluidic communication with a distal end of the hydrophilic channel comprising a hydrophilic region in fluidic communication with the electrode assembly; and\nthe method further comprising:\ndepositing a fluidic sample onto said deposition region disposed at a proximal end of a said hydrophilic channel and;\npermitting transport of fluid in the sample through capillary action over the electrode and into the fluid sink.",
        "56. The method of claim 51 wherein measuring an electrochemical parameter comprises measuring impedance, current, or voltage.",
        "57. The method of 51 wherein the step of measuring an electrical parameter is done by a method selected from the group consisting of amperometry, biamperometry, stripping voltammetry, differential pulse voltammetry, cyclic voltammetry, coulometry, chronoamperometry, and potentiometry.",
        "58. The method of claim 51 wherein the analyte comprises glucose, cholesterol, uric acid, lactate, blood gases, DNA, haemoglobin, nitric oxide, or blood ketones.",
        "59. The method of claim 51 wherein measuring an electrochemical parameter comprises anodic stripping voltammetry.",
        "60. The method of claim 51 wherein the analyte comprises a heavy metal ion or a mixture of heavy metal ions."
    ]
}