{
    "id": "https://semopenalex.org/work/W3102602845",
    "authors": [
        "L. N. Pfeiffer",
        "G. Gervais",
        "K. W. West",
        "John L. Reno",
        "Michael Lilly",
        "Samuel Gaucher",
        "B. Schmidt",
        "Keyan Bennaceur",
        "Dominique Laroche"
    ],
    "title": "Mechanical Flip-Chip for Ultra-High Electron Mobility Devices",
    "date": "2015-09-22",
    "abstract": "Electrostatic gates are of paramount importance for the physics of devices based on high-mobility two-dimensional electron gas (2DEG) since they allow depletion of electrons in selected areas. This field-effect gating enables the fabrication of a wide range of devices such as, for example, quantum point contacts (QPC), electron interferometers and quantum dots. To fabricate these gates, processing is usually performed on the 2DEG material, which is in many cases detrimental to its electron mobility. Here we propose an alternative process which does not require any processing of the 2DEG material other than for the ohmic contacts. This approach relies on processing a separate wafer that is then mechanically mounted on the 2DEG material in a flip-chip fashion. This technique proved successful to fabricate quantum point contacts on both GaAs/AlGaAs materials with both moderate and ultra-high electron mobility.",
    "sections": [
        {
            "title": "Methods",
            "paragraphs": [
                "In order to circumvent the problem of degradation of the electronic mobility, we have developed a flip-chip technique where all processing steps required to fabricate the electrostatic gates are performed on a separate substrate that is then mounted on the surface of the 2DEG. This approach has previously been used to fabricate resonators on 2DEGs13 as well as for the coupling of high-frequency lines14; however, to our knowledge, split gates on high-mobility structures have never been reported using a flip-chip technique. This technique offers several advantages:- It avoids contamination by chemicals during the fabrication process. Usually, the gate fabrication process uses several steps in which polymer resists are deposited on the surface of the 2DEG and chemicals are used to develop and remove these resists. Even when an appropriate solvent is used, these resist residues are hard to remove and doing so often involves a cleaning process that can damage the 2DEG (e.g. an oxygen plasma). Resist residues can also trap charges and generate undesirable fluctuations in the density of the 2DEG.- It avoids degradation of the electron mobility during lithography. Radiation damage can arise from heating, electrostatic charging, ionization damages (radiolysis), displacement damage, sputtering and hydrocarbon contamination. In our approach, the 2DEG is never exposed to any electron beam or optical lithography.- It avoids additional strain induced by differential thermal contractions. At room temperature, GaAs has a thermal expansion coefficient of . Electrostatic gates are typically made with a few nanometers of Ti () and/or Cr () adhesion layer, and most often with tens of nanometers of gold () or aluminium (). These coefficients do not vary much from ~300 K down to 150 K and eventually become negligible at low temperatures. For a typical 2 mm wide gate made out of gold, the gate will shrink by approximately 4 μm during the first 150 K, whereas GaAs will shrink by less than 2 μm. This is likely to induce strain in the material and to affect the electron mobility at low temperatures, particularly in the case of a narrow constriction with a width of only 500 nm.- It makes it possible to re-use the 2DEG material. The technique is non-destructive and enables the re-use of the 2DEG material at will. In addition, for the highest mobility GaAs/AlGaAs 2DEGs with mobility in excess of , it is known that different parts of the wafer may have different mobilities as well as fluctuations in the electron density. Since several types of gated devices have active areas of a few μm2 only, should the need arise, our approach allows for the device to easily be remounted on a slightly different part of the wafer. This technique also allows one to swap gates so as to measure different devices (or designs) on the exact same piece of material. Finally, it avoids wasting precious material during low-yield processes, which is common when fabricating complex devices."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [
                "In Fig. 1 we show the conventional (panels a–c) and flip-chip (panels d–h) fabrication processes of a QPC. In the traditional approach, the gates are fabricated directly on top of the 2DEG material using a combination of e-beam and optical lithography. In contrast, the flip-chip technique uses a sapphire plate where all the processing is performed through a conventional e-beam lithography process, with 50 nm of chromium first deposited to allow charge evacuation during the e-beam exposure followed by a spinning of MAA/PMMA resist. After exposure and development, 5/150 nm Ti/Au is deposited by e-beam evaporation followed by lift-off and chromium etching. Extreme care is taken to obtain a near perfect lift-off so as to prevent residual metal standing up along the edge, which could cause gate leakage or introduce an undesirable buffer space between the flip-chip gates and the 2DEG. A layer of aluminum oxide (30 to 100 nm thick) is then deposited to further prevent potential gate leakages. The ohmic contacts are fabricated directly on the GaAs/AlGaAs either by indium diffusion, or by evaporation of Ge/Au/Ni/Au using shadow mask to avoid lithography. The 2DEG wafer is placed on a sample holder and the ohmic contacts are connected to the contacts of the holder by indium-soldered gold wires. Then, the flip-chip is placed on top of the 2DEG together with an additional sapphire top plate, which is itself held in place by four BeCu springs that apply very gentle mechanical pressure. The optical interference fringes between the top plate and the flip-chip allow a fine tuning in the alignment of the flip-chip device. All fabrication and assembly steps are performed in a class-100 cleanroom to avoid contamination of the critical interfacing surfaces.",
                "We have fabricated both 1 μm long QPC and Fabry-Pérot gates on sapphire and tested the technique on GaAs/AlGaAs wafers grown at Sandia National Laboratories (Sample A) as well as Princeton University (Sample B). We have chosen to compare the flip-chip devices with the best conventional QPC fabricated out of 20; in many cases, the conductance quantization were not as good as for the flip-chip devices. For the flip-chips mounted on sample A, several QPCs showed pinch-off with a success rate of ~80%. In total, more than 20 devices were tested and a pinch-off voltage ranging from −6 V to −40 V was determined. For comparison, conventional QPCs (CQPCs) made on a similar wafer to sample A showed a pinch-off voltage ranging from −1.7 to −3 V, and thus had a superior gate efficiency by a factor ranging from ~3 to 13. We attribute the lower gate efficiency of the Flip chip QPC (FCQPC) to the ‘air’ (vacuum) gap between the flip-chip and the 2DEG. A rough calculation that assumes a pinch-off voltage scaling linearly with the distance between gates and the 2DEGs estimates this gap to be in the range from 50 to 200 nm. This gap most likely occurs because the contact area between the 2DEG and the flip-chip gates is over 3.6 × 2 mm2 in area and not perfectly flat; this could easily be improved by reducing the contact area between the two mechanical parts of the device.",
                "Figure 2 provides a typical example of the conductivity versus pinch-off gate voltage on a logarithmic scale for both a flip-chip QPC (red) and a conventional QPC (blue). The data were taken at 25 mK using a similar 2DEG GaAs/AlGaAS heterostructure with a moderate mobility of 2 × 106 cm2/V · s (although not coming from the exact same wafer). For both devices, the quantization of the conductance is clearly observed. While the CQPC shows better-defined and more precise conductance plateaus (ballistic behaviour), this likely arises from the shape of the QPCs that were not identical, and because of both the air gap present in the FCQPC and shallowness of the 2DEG modifying the gate-induced electric field profile. We also note that in the metallic regime at conductance below ~50 e2/h, the slopes of the FCQPC and CQPC are strikingly similar. Importantly, we have not observed a pronounced hysteresis in the pinch-off curve of the FCQPC whereas this undesirable behaviour is often observed in conventional gated devices. Finally, in the inset of Fig. 2 the conductance of a FCQPC integrated with an ultra-high mobility () GaAs/AlGaAs 2DEG and measured at 4 K is shown. Albeit with a lower gate efficiency, this data demonstrates that the flip-chip process can be integrated with the highest mobility 2DEG materials.",
                "As further confirmation of the quality and efficiency of the flip-chip devices, they were characterized in the quantum Hall regime at very low temperatures in a magnetic field up to 9 T. Figure 3a shows the measured resistance in various configurations within sample A. The Hall resistance RH measured outside of the interferometer (red trace) shows good quantization of the IQH plateaus and the 5/3 FQH plateau, as expected for a sample in this range of mobility. Due to the geometry of our design, it is not possible to directly measure RH under the interferometer; rather, we measure the diagonal resistance RD (blue trace), which includes a large longitudinal contribution. Also shown are Rxx outside of the interferometer and RxxT through the interferometer; again geometry plays a role, since the contacts outside are much closer together and the measured voltage is correspondingly smaller. The fact that RxxT does not reach zero in all of the states and that Rxx does may be due to the flip-chip blocking light from the LED used during the cooling process or to the non-ohmicity of particular contacts. Further investigation is required to clarify this. Finally, we note that in the quantum Hall regime the conductivity is related to the resistivity by the tensor relations  and . As a consequence, it is difficult to extract them in our case because they require the measurement of both RHall and Rxx in all regions of the sample in a well-controlled geometry, which is not the case here.",
                "In Fig. 3b, the conductance is shown as a function of gate voltage at a magnetic field of 1.7 T, near filling factor ν = 8. Plateaus occur for each integer multiple of e2/h, with the exception of the first plateau. The quantization for the lowest conductance plateaus (2, 3, 4) is excellent, but degrades for higher plateaus as the contribution of the longitudinal resistance in series with the QPC becomes significant. Along with the data in Fig. 3a, these results clearly show that the device can operate in a magnetic field and is mechanically stable up to 9 T at 20 mK.",
                "In conclusion, we have demonstrated successful fabrication of split-gate devices on GaAs/AlGaAs 2DEG heterostructures using a flip-chip technique which avoids performing any potentially damaging fabrication steps directly on the ultra-high mobility wafer. This process has a yield on par with traditional fabrication techniques, and results in robust devices that can be measured at dilution refrigerator temperatures and in high magnetic fields. Benchmark measurements show that the samples perform as expected; we demonstrate pinch-off and quantized conductance both at zero field and in the quantum Hall regime. These devices have great potential for future studies of sensitive quantum Hall states such as interferometric measurements with the 5/2 and 12/5 FQHE that occur only in pristine ultra-high mobility devices."
            ],
            "subsections": []
        },
        {
            "title": "Additional Information",
            "paragraphs": [
                "How to cite this article: Bennaceur, K. et al. Mechanical Flip-Chip for Ultra-High Electron Mobility Devices. Sci. Rep. 5, 13494; doi: 10.1038/srep13494 (2015)."
            ],
            "subsections": []
        }
    ]
}