{
    "id": "https://semopenalex.org/work/W2774536261",
    "authors": [
        "Lin Zhou",
        "M. J. Kramer",
        "Iver E. Anderson",
        "Wei Tang",
        "Emma White",
        "Liangfa Hu",
        "Aaron G. Kassen"
    ],
    "title": "Novel mechanisms for solid-state processing and grain growth with microstructure alignment in alnico-8 based permanent magnets",
    "date": "2017-12-14",
    "abstract": "An estimated 750,000 new hybrid electric and plug-in battery vehicles, most with permanent magnet synchronous alternating current (PMAC) drive motors, took to the road in 2016 alone. Accompanied by 40% year over year growth in the EV market significant challenges exist in producing large quantities of permanent magnets (on the order of tens of millions) for reliable, low-cost traction motors [IE Agency, Energy Technology Perspectives (2017)]. Since the rare earth permanent magnet (REPM) market is essentially 100% net import reliant in the United States and has proven to have an unstable cost and supply structure in recent years, a replacement RE-free PM material must be designed or selected, fully developed, and implemented. Alnico, with its high saturation magnetization and excellent thermal stability, appears to be uniquely suited for this task. Further, while alnico typically has been considered a relatively low coercivity hard magnet, strides have been made to increase the coercivity to levels suitable for traction drive motors [W Tang, IEEE Trans. Magn., 51 (2015)]. If a simple non-cast approach for achieving near [001] easy axis grain aligned permanent magnets can be found, this would allow mass-produced final-shape anisotropic high energy product magnets suitable for usage in compact high RPM rotor designs. Therefore, a powder metallurgical approach is being explored that uses classic compression molding with “de-bind and sinter” methods, where a novel applied uniaxial loading, and an applied magnetic field may create final-shape magnets with highly textured resulting microstructures by two different mechanisms. Results indicate a positive correlation between applied uniaxial load and resulting texture (Fig. 1), along with benefits from using an applied magnetic field for improved texture, as well. The apparent mechanisms and resulting properties will be described using closed loop hysteresisgraph measurements, EBSD orientation mapping, and high-resolution SEM.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "Permanent magnet (PM) based motors have become the primary technology of choice for original equipment manufacturers of electric drive vehicles with the only exception being Tesla motors. However, with the introduction of the Model 3, they have switched to a permanent magnet synchronous alternating current (PMAC) drive motor, similar to most other vehicle manufacturers. [1][2][3] The most common form of PMAC motor currently utilizes rare earth (RE) materials such as neodymium, dysprosium, and samarium quite extensively in high-temperature Dy-enhanced Nd 2 Fe 14 B (2-14-1) or SmCo 5 and Sm 2 Co 17 . 4 Given the dominant position held by China in oxide refinement of rare earth elements and in REPM production, with an estimated 90% control of both markets, another RE crisis is looming if diversification of PM types cannot be accomplished, particularly with Tesla's pre-order estimate of nearly 500,000 Model 3 automobiles being added to the EV sector. 5 Even without Tesla, growth is estimated around 40% per year in the electric vehicle market according to the International Energy Agency (IEA), and with this growth, comes a very real critical materials challenge. 1,4,6 Critical PMAC design criteria for the permanent magnets include sufficient levels of remanent magnetization, operating temperature, mechanical strength, and coercivity. These requirements have been a significant design barrier to PM innovation, and they explain why Nd-based 2-14-1 magnets have remained the choice of the PMAC world. However, when motor operational conditions increase to 180 • C, they result in a strong reduction of magnetic properties, e.g., energy product (BHmax), in Nd-based 2-14-1, making non-RE PM materials like alnico attractive. [6][7][8] Alnico is an established magnet alloy family consisting primarily of Al, Ni, Co, and Fe, along with Cu and Ti, with a unique spinodal nanostructure that can yield significant shape anisotropy-based coercivity. 9 Alnico also is notable for high saturation magnetization, and high-temperature performance with small magnetic remanence temperature coefficient (-0.025%/ • C) and positive coercivity temperature coefficient (+0.01%/ • C), as well as resistance to corrosion effects. 7 However, alnico typically has insufficient coercivity and a poor hysteresis loop shape for use in traction drive motors. Yet, theoretically, the upper limit for alnico coercivity and BHmax are far higher than have been observed. DeVos and Naastepad in the mid-1960's showed that energy products of 30-35 MGOe and coercivities of 4-6 kOe were possible based on calculated predictions. 10,11 Further, UQM Technologies has demonstrated and patented an alnico-based PMAC motor, already showing that the square loop shape with the low coercivity of alnico 9 (with 9MGOe for BHmax) can be tolerated, if a reduction in processing costs could be realized by the development of an alternative method. 12 However, alnico 9 would still require increased mechanical properties, beyond those found in sintered alnico 8H with an increased coercivity. 6,13 Fortunately, initial developments are promising for improved alnico alloys and processing by a powder metallurgical approach that includes the production of gas atomized powder with final-shape compression molding. Samples undergo debinding and sintering to create high-density magnets coupled with secondary sintering and textured grain growth under uni-axial stress, where misorientation of the [001] direction in underlying grains is kept to less than 15-18 • of the magnetic axis. 14,15 The latter secondary sintering/grain texturing step to favor the [001] easy axis direction has been described, 14 but an additional texturing improvement from an external field applied during the compression molding step will be revealed in this report."
            ],
            "subsections": [
                {
                    "title": "EXPERIMENTAL",
                    "paragraphs": [
                        "The experimental procedure reported in Anderson et al. was followed using high-pressure gas atomization to create fine metal powder based on an alnico 8H composition. Specifically, the target composition was: 7.3Al-13.0Ni-38Co-32.3Fe-3.0Cu-6.4Ti (wt.%). 16,17 The charge was created using high purity (99.99%) elemental additions and pre-alloyed buttons, and then atomized using high purity argon. The powder was riffled and screened according to ASTM standard screen sizes, yielding multiple size ranges in the sub 106µm range. Powder size cuts in the range of <20µm, 32-38µm, and 3-15µm, were then selected to facilitate different texturing experiments.",
                        "The various powder cuts were blended with a 6 wt% solution of acetone and a polypropylene carbonate (PPC) cleanly decomposing tantalum grade binder. Final loading was approximately 2.6 vol% binder in powder. 18 After blending, off-gassing of acetone occurred over 24h at room temperature to create the precursor for compression molding.",
                        "Two distinct specimen types were created for experiments, those with magnetic field templating, and those with no field template. Pressing dies utilized in the experiments were the same diameter of 9.525mm (3/8\") specifically designed to be non-magnetic, consisting of either bronze or Ti-6Al-4V bodies. Punches for the dies were either cobalt-bonded tungsten carbide (magnetic) or silicon bronze (non-magnetic). Samples without templating were pressed as described previously at 156 MPa, except with a warm die heated to 60 • C, above the glass transition of the PPC binder of 40 • C to enhance final net shape quality. 19 No influence on green body density or final density was measured resulting from warm die processing, however qualitatively, net shape quality was improved, and the technique was consistently applied with the assumption that during magnetic templating, the reduced viscosity would enhance particle mobility.",
                        "Samples which received a magnetic templating, underwent an extra processing step during green body forming. Specifically, a field (approximately 0.2-0.5T) was applied along specific orientations ranging from parallel to the magnetic axis to 54 • off horizontal. The field was generated using N52 grade neodymium based magnets either as bulk cylindrical magnets or in the form of a Halbach array (Fig. 1a andb). The Halbach array was designed such that the angular pivot is centered on the specimen to avoid effects from field fringing and ensure field uniformity. Precursor powder was broken down to a loose fill powder using a mortar and pestle and loaded into the non-magnetic die body. Once loaded, but under no pressure, the powder was stimulated by hand during loading to ensure proper filling and enhance particle mobility under the applied field. Die bodies were heated to 60 • C, while in the field, and physical stimulation continued for approximately 5 minutes to allow for a thermal soak and any particle re-arrangement that may occur. Pressing then took place at 156 MPa, and the die was air cooled to below the glass transition temperature while under pressure. The pressure was released, and processing then continued as normal for all specimens.",
                        "Binder burnout occurred in air, after compression molding, as previously detailed in Anderson et al. and vacuum (<5 x 10 -6 torr) sintering of 4h at 1250 • C performed to get starting condition specimens which had uniform equiaxed grains of approximately 30-45µm in size based on prior grain growth experiments carried out on 90wt.% 32-38µm + 10wt.% 3-15µm powder. 17 Samples were then cut from bulk to create experimental samples of 3.25mm x 10mm in size using electro-discharge machining (EDM), and centerless ground to 3mm in diameter for consistency.",
                        "Samples then received an applied uniaxial load using the apparatus described in Kassen et al. which was consistent with work showing the influence of applied uniaxial loads in enhancing resulting microstructural texture. 4 Uniaxial loading occurred during a second heat treatment at the same sintering temperature of 1250 • C for another 4h in a vacuum. 4 After secondary heat treatment,  samples were centerless ground to 3mm in diameter as needed to ensure uniformity of diameter for measurement in the hysteresisgraph. After centerless grinding, solutionizing at 1250 • C followed by magnetic field annealing, and low-temperature drawing was performed, as is typical for alnico and described in Anderson et al. 6 Sample properties were then measured on a Laboratorio Elettrofisico AMH-500 hysteresisgraph, and microstructural observations including grain size and orientation made using an FEI Teneo scanning electron microscope (SEM) outfitted with an electron backscatter detector (EBSD) for orientation data."
                    ],
                    "subsections": []
                },
                {
                    "title": "RESULTS",
                    "paragraphs": [
                        "Bulk green body samples were created by compression molding using a powder distribution of 90wt.% 32-38µm + 10wt.% 3-15µm. The initial field direction was as shown in Fig. 1a; this places the magnetic field in an orientation along the magnetic axis in the final magnet with the punches acting as pole pieces. 6 The specimens were pressed, sintered, and uniaxially loaded as described in (Table I).",
                        "The 90 • field orientation (Fig. 1a) resulted in a specimen with magnetic properties which were severely diminished compared to those with controlled uniaxial dead weight experiments from Kassen et al. and Anderson et al. or the MMPA standard alnico 8HC (high-coercivity). 4,6 A near-single crystal specimen resulted (Fig. 2) with a single orientation that aligned with the [111] direction (Fig. 2). Although a low applied stress in this case was used, the final grain orientation was like that of the high-stress case where a creep dominant mechanism was previously observed with significant plastic deformation. This orientation shift shows that the preliminary templating of the powder from the external magnetic field during the initial compression molding provided the primary grain orienting mechanism and that the low applied stress merely served to drive the abnormal grain growth process to completion in its magnetically aligned direction. Thus, the final (single crystal) orientation was not set by a creep or grain boundary energy biasing mechanism, but rather by the applied magnetic field direction during initial compression molding.",
                        "Using a Ti-6Al-4V die assembly and Halbach array (Fig. 1b), the applied field direction was varied to 54 • and powder size was reduced to sub <20µm to get near single crystal powder particles (Fig. 3c). The 54 • angle was geometrically determined for aligning the [001] direction, if as predicted, [111] would dominate in the growth direction of the applied field. The change in pressure did not affect the resolved strain. It was established this was due to the change in the rate of abnormal grain growth (AGG) which occurred in the smaller powder size fractions effectively stopping creep during secondary heat treatments. However, by reducing powder size it was believed the number of competing grains, and thus the number of competing domains would enhance the overall effect and control from the applied field (Fig. 3c). EBSD was performed on cross-sections of powder particles to confirm an approximate 15-17µm cut-off for single crystal powder. However, a -20µm cut was utilized for ease of processing (Fig. 3a andb).",
                        "The change in AGG rate turned out to be beneficial to the magnetic properties. The lack of creep enhanced texturing caused results to highlight the difference due to the field templating compared to that from light grain boundary energetic biasing which can be present from Kassen et al. 4 While both field and non-field templated samples showed improved properties as expected, the magnetic field samples were notably improved over just strained (Table I). Energy product was 18% higher than those of uniaxial loading alone arising from enhancement to loop shape and remanence coupled with a minor increase in coercivity, something which might be expected according to work performed by Zhou et al., showing the dependence of alnico spinodal growth on applied field direction during magnetic annealing. 20 "
                    ],
                    "subsections": []
                },
                {
                    "title": "CONCLUSIONS",
                    "paragraphs": [
                        "It has been demonstrated that an applied magnetic field can create microstructural templating in alnico. Through careful application of a uniform field during green body forming, gas atomized powder was oriented in a pole-to-pole type geometry by an applied field and a [111] oriented near single crystal was created. Microstructure driven by AGG resulted in an enhancement to BHmax and second quadrant loop shape parameters when the field angle was optimized to 54 • . The magnetic properties were shown further to be distinct from those achieved by uni-axial dead weight loading alone which can also produce 6.0 MGOe BHmax, however, with some loss to net-shape. The resulting 33% increase in BHmax compared to that of the MMPA standard (6.0MGOe vs. 4.8MGOe) and an increase of 18% over the non-templated result (6.0 MGOe vs. 5.1 MGOe) indicates a strong correlation between magnetic properties and compression molding under magnetic field. Further, an enhancement to the remanence ratio of 7% over the dead-weight only value and an increase of 5% in remanence indicated that improved orientation over the uniaxial loading alone occurred. Finally, increases of 33% to the remanence and 11% to the estimated remanence ratio occurred compared to the MMPA standard, admittedly with remanence values confounded by some alloy differences."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "paragraphs": [
                "The authors wish to acknowledge the significant efforts of Ross Anderson and Dave Byrd during the many parts of this work including powder production as well as developing of various technologies applied throughout. Kevin Dennis is thanked for assistance on thermal analysis work. We also are incredibly grateful for the insights into alnico processing from Steve Constantinides of Magnetics & Materials LLC. This work was funded by USDOE-EERE-VTO-EDT through Ames Lab contract no. DE-AC02-07CH11358."
            ],
            "subsections": []
        }
    ]
}