{
    "id": "US20240084169",
    "authors": [
        "Hua-Zhong Yu",
        "Lishen Zhang"
    ],
    "title": "HYDROPHOBIC AND SUPERHYDROPHOBIC COATINGS AND METHODS THEREOF",
    "date": "2022-01-26 00:00:00",
    "abstract": "Hydrophobic and superhydrophobic coatings and articles coated with the hydrophobic and superhydrophobic coatings that exhibit superior hydrophobic properties. The hydrophobic or superhydrophobic coatings and the articles coated therewith can be made using unconventional methods, for example, based on a single-step, stoichiometrically-controlled hydrolysis and condensation reaction of organosilanes. The reaction can provide micro- to nano-scale hierarchical siloxane aggregates that are dispersible in solvents (e.g., organic solvents) to provide a coating mixture.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Surface coating techniques to attain superhydrophobicity and waterproof capabilities have attracted both industrial and scientific interests. To achieve superhydrophobicity, the general strategy is to create micro-/nano-structures using materials of low surface tension. Existing coating methods reported to date rely on either replicating pre-existing “rough” structures or creating roughness on existing materials via multi-step procedures. However, the limited availability of ideal natural templates and accessible fabrication procedures is a significant challenge to achieving superhydrophobicity.",
                        "There is a need for hydrophobic and superhydrophobic coatings that are robust in real-life applications and for coating methods that are facile, low-cost, scalable, and environmental-friendly. The present disclosure fulfils these needs and provides further advantages."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate superhydrophobic coatings"
                    ],
                    "num_characters": 872,
                    "outline_medium": [
                        "motivate superhydrophobic coatings"
                    ],
                    "outline_short": [
                        "motivate superhydrophobic coatings"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "This summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This summary is not intended to identify key features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter.",
                        "In one aspect, the present disclosure features an article, including a hydrophobic coating that includes a microparticle. The microparticle is disposed on and covalently bound to a surface of the article. The microparticle can be porous and include a hierarchical morphology. The microparticle can include an agglomerated plurality of fibers, and the fiber can include a C12-C18 alkylhalosiloxane, a C6-C18 fluoroalkylhalosiloxane, or any combination thereof.",
                        "In another aspect, the present disclosure features a hydrophobic coating formulation, including a suspension that includes a microparticle suspended in a continuous phase. The microparticle can be porous and have a hierarchical morphology, the microparticle can include an agglomerated plurality of fibers, and the fiber can include a C12-C18 alkylhalosiloxane, a C6-C18 fluoroalkylhalosiloxane, or any combination thereof. The continuous phase can include an organic solvent, an alkyltrihalosilane, a fluoroalkyltrihalosilane or a combination thereof.",
                        "In yet another aspect, the present disclosure features a method of making a hydrophobic coating including: providing a mixture of water, together with a C12-C18 alkyltrihalosilane and/or a C6-C18 fluoroalkyltrihalosilane; mixing the mixture to provide an emulsion of nanodroplets that have a diameter of from 1 nm to 1000 nm; reacting the water and the C12-C18 alkyltrihalosilane and/or a C6-C18 fluoroalkyltrihalosilane in the mixture to provide a plurality of fibers that includes C12-C18 alkylhalosiloxane and/or C6-C18 fluoroalkylhalosiloxane; and agglomerating the plurality of fibers to provide porous microparticles suspended in C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosilane.",
                        "In yet another aspect, the present disclosure features a method of making a hydrophobic article, including: diluting a suspension of microparticles described herein in an organic solvent to provide a dilution of microparticles; and applying the dilution of microparticles to a surface of an article to provide the hydrophobic article."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce hydrophobic coating",
                        "introduce hydrophobic coating formulation",
                        "introduce method of making hydrophobic coating",
                        "introduce method of making hydrophobic article"
                    ],
                    "num_characters": 2380,
                    "outline_medium": [
                        "summarize hydrophobic coating",
                        "summarize coating formulation and method"
                    ],
                    "outline_short": [
                        "summarize hydrophobic coating aspects"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The present disclosure describes hydrophobic and superhydrophobic coatings and articles coated with the hydrophobic and superhydrophobic coatings that exhibit superior hydrophobic properties. The hydrophobic and superhydrophobic coatings and the articles coated therewith can be made using unconventional methods, for example, based on a single-step, stoichiometrically-controlled hydrolysis and condensation reaction of organosilanes. The reaction can provide micro- to nano-scale hierarchical siloxane aggregates that are dispersible in solvents (e.g., organic solvents) to provide a coating mixture. Excellent superhydrophobicity (e.g., ultrahigh water contact angle>170° and ultralow sliding angle<1°) can be attained on solid materials of various compositions and dimensions, for example, by coating (e.g., dipping or spraying) the article with the coating mixtures of the present disclosure. The hydrophobic and superhydrophobic coatings can have excellent properties such as waterproof capability, robustness, cost savings, scalability, and encapsulate other functional materials, such as luminescent dyes."
                    ],
                    "subsections": [
                        {
                            "title": "Definitions",
                            "paragraphs": [
                                "At various places in the present specification, substituents of compounds of the disclosure are disclosed in groups or in ranges. It is specifically intended that the disclosure includes each and every individual subcombination of the members of such groups and ranges. For example, the term “C1-6 alkyl” is specifically intended to individually disclose methyl, ethyl, C3 alkyl, C4 alkyl, C5 alkyl, and C6 alkyl.",
                                "It is further appreciated that certain features of the disclosure, which are, for clarity, described in the context of separate embodiments, can also be provided in combination in a single embodiment.",
                                "Conversely, various features of the disclosure which are, for brevity, described in the context of a single embodiment, can also be provided separately or in any suitable subcombination.",
                                "The verb “comprise” and its conjugations, are used in the open and non-limiting sense to mean that items following the word are included, but items not specifically mentioned are not excluded.",
                                "“About” in reference to a numerical value refers to the range of values somewhat less or greater than the stated value, as understood by one of skill in the art. For example, the term “about” could mean a value ranging from plus or minus a percentage (e.g., ±1%, ±2%, or ±5%) of the stated value. Furthermore, since all numbers, values, and expressions referring to quantities used herein are subject to the various uncertainties of measurement encountered in the art, then unless otherwise indicated, all presented values may be understood as modified by the term “about.”",
                                "As used herein, the articles “a,” “an,” and “the” may include plural referents unless otherwise expressly limited to one-referent, or if it would be obvious to a skilled artisan from the context of the sentence that the article referred to a singular referent.",
                                "Where a numerical range is disclosed herein, then such a range is continuous, inclusive of both the minimum and maximum values of the range, as well as every value between such minimum and maximum values. Still further, where a range refers to integers, every integer between the minimum and maximum values of such range is included. In addition, where multiple ranges are provided to describe a feature or characteristic, such ranges can be combined. That is to say that, unless otherwise indicated, all ranges disclosed herein are to be understood to encompass any and all subranges subsumed therein. For example, a stated range of from “1 to 10” should be considered to include 1 and 10, and any and all subranges between the minimum value of 1 and the maximum value of 10. Exemplary subranges of the range “1 to 10” include, but are not limited to, e.g., 1 to 6.1, 3.5 to 7.8, and 5.5 to 10.",
                                "As used herein, the term “substituted,” or “substitution” refers to the replacing of a hydrogen atom with a substituent other than H. For example, an “N-substituted piperidin-4-yl” refers to replacement of the H atom from the NH of the piperidinyl with a non-hydrogen substituent such as, for example, alkyl.",
                                "As used herein, the term “alkyl” refers to a saturated hydrocarbon group which is straight-chained (e.g., linear) or branched. Example alkyl groups include methyl (Me), ethyl (Et), propyl (e.g., n-propyl and isopropyl), butyl (e.g., n-butyl, isobutyl, t-butyl), pentyl (e.g., n-pentyl, isopentyl, neopentyl), and the like. An alkyl group can contain from 1 to about 30, from 1 to about 24, from 2 to about 24, from 1 to about 20, from 2 to about 20, from 1 to about 18, from 1 to about 10, from 1 to about 8, from 1 to about 6, from 1 to about 4, from 1 to about 3, from 4 to about 18, from about 10 to about 20, from 12 to about 18, from 14 to about 18, or from 16 to about 18 carbon atoms.",
                                "As used herein, the term “alkylene” refers to a linking alkyl group.",
                                "As used herein, the term “fluoroalkyl” refers to alkyl groups where one or more H is replaced with F. Fluoroalkyl groups can include 1 fluorine substituent up to perfluoroalkyl groups.",
                                "As used herein, the term “halo” or “halogen” includes fluoro, chloro, bromo, and iodo.",
                                "As used herein, “hierarchical morphology” refers to structures having nanoscale morphological features that in turn are present on microscale morphological features. An example of a hydrophobic surface having hierarchical morphology is the lotus leaf, where the presence of hierarchical structures is formed of nanoscale wax protrusions on microscale roughness.",
                                "As used herein, the term “hydrophilic” refers to a water contact angle of less than and not including 90°, which means that the water droplet wets the surface.",
                                "As used herein, the term “hydrophobic” refers to a material or surface with which water droplets have a contact angle in air of at least 90°, as measured by a contact angle goniometer. A hydrophobic surface can be substantially waterproof.",
                                "As used herein, the term “superhydrophobic” refers to a surface with which water droplets have a contact angle in air of at least 150°, as measured by a contact angle goniometer. A superhydrophobic surface can be completely waterproof.",
                                "As used herein, the term “water contact angle,” “contact angle,” or “static contact angle” refers to as the angle between a static drop of deionized water and a flat and horizontal surface upon which the droplet is placed. Water contact angles (WCA) can be measured with an optical goniometer (AST VCA system, Billerica, MA), where a 1.0 μL droplet is held with a syringe needle, and slowly moved down to contact the sample surface. At least three samples prepared under the same condition can be tested; and for each sample, 5 different regions can be examined.",
                                "As used herein, the term “nanoscale” morphological features or nanoscale features refers to a three-dimensional topography of features (e.g., fibers, particles, ridges, troughs, pits, mounds, etc.) having at least one dimension of less than 1 micron. Nanoscale morphological features can be disposed on or within, or otherwise aggregate to form a microscale feature, where the three-dimensional topography of microscale feature (e.g., a particle) have a minimum dimension of from 1 micron to 1000 microns.",
                                "As used herein, the term “covalently bound” refers to a substance that is linked to another via a covalent bond, which is a chemical bond that involves the sharing of electron pairs between atoms. These electron pairs are known as shared pairs or bonding pairs, and the stable balance of attractive and repulsive forces between atoms, when they share electrons, is known as covalent bonding.",
                                "As used herein, the term “crosslinking” refers to a bond that links one polymer chain, particle, or fiber to another. These links may take the form of covalent bonds or ionic bonds. In some embodiments, the links are covalent bonds.",
                                "As used herein, the term “self-cleaning” refers the property of a surface that generally keeps the surface clean without mechanical force or detergent to loosen and remove visual detractants (e.g., debris, contaminants, bacteria, and/or biofilm). The self-cleaning surface can have atilt angle of equal to or less than 10°.",
                                "As used herein, the term “tilt angle,” “roll-off angle,” or “sliding angle” refers to the smallest angle between a surface having a water droplet disposed thereon and the horizontal surface at which the droplet commences to and continues to roll off. Tilt angle and roll-off angle, as well as method of measuring them, are described, for example, in Superhydrophobic surfaces: from structural control to functional application, J. Mater. Chem., 2008, 18, 621-633, incorporated herein by reference in its entirety.",
                                "As used herein, the terms “anti-fouling” and “biofilm-resistant” are interchangeable and refer to a coating (as defined herein) that impairs, inhibits, prevents, or retards the attachment and/or growth of biofouling organisms.",
                                "As used herein, an “emulsion” refers to a mixture of two or more liquids that are normally immiscible owing to liquid-liquid phase separation.",
                                "As used herein, a “suspension” refers to a heterogeneous mixture in which the solute particles do not dissolve but are suspended throughout the bulk of the continuous phase (e.g., a solvent), and left floating around freely in the continuous phase.",
                                "As used herein, the term “coating” refers to a deposit layer applied to part or all of an exposed surface of a substrate.",
                                "As used herein, an “exposed surface” and “outer surface” refer to all accessible surface area of an object accessible to a liquid. The “exposed surface area” refers to the summation of all the areas of an article accessible to a liquid.",
                                "As used herein, the term “composite” refers to a composition material, a material made from two or more constituent materials with significantly different physical or chemical properties that, when combined, produce a material with characteristics different from the individual components. The individual components remain separate and distinct within the finished structure.",
                                "The compounds described herein can be asymmetric (e.g., having one or more stereocenters). All stereoisomers, such as enantiomers and diastereomers, are intended unless otherwise indicated.",
                                "Compounds of the disclosure can also include all isotopes of atoms occurring in the intermediates or final compounds. Isotopes include those atoms having the same atomic number but different mass numbers. For example, isotopes of hydrogen include tritium and deuterium.",
                                "In some embodiments, the compounds of the disclosure, and salts thereof, are substantially isolated. By “substantially isolated” is meant that the compound is at least partially or substantially separated from the environment in which it was formed or detected. Partial separation can include, for example, a composition enriched in the compound of the disclosure. Substantial separation can include compositions containing at least about 50%, at least about 60%, at least about 70%, at least about 80%, at least about 90%, at least about 95%, at least about 97%, or at least about 99% by weight of a given compound, or salt thereof. Methods for isolating compounds and their salts are routine in the art.",
                                "Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art. Although methods and materials similar or equivalent to those described herein can be used in the practice or testing of the present disclosure, suitable methods and materials are described below. All publications, patent applications, patents, and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the present specification, including definitions, will control. In addition, the materials, methods, and examples are illustrative only and not intended to be limiting.",
                                "It will be readily understood that the aspects of the present disclosure, as generally described herein, and illustrated in the figures, can be arranged, substituted, combined, separated, and designed in a wide variety of different configurations, all of which are explicitly contemplated herein.",
                                "Furthermore, the particular arrangements shown in the FIGURES should not be viewed as limiting. It should be understood that other embodiments may include more or less of each element shown in a given FIGURE. Further, some of the illustrated elements may be combined or omitted. Yet further, an example embodiment may include elements that are not illustrated in the FIGURES."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define substituents of compounds",
                                "describe individual subcombinations",
                                "explain combination of features",
                                "define verb \"comprise\"",
                                "explain \"about\" in reference to numerical values",
                                "define articles \"a\", \"an\", and \"the\"",
                                "describe numerical ranges",
                                "explain ranges referring to integers",
                                "define \"substituted\" or \"substitution\"",
                                "define \"alkyl\"",
                                "define \"alkylene\"",
                                "define \"fluoroalkyl\"",
                                "define \"halo\" or \"halogen\"",
                                "define \"hierarchical morphology\"",
                                "define \"hydrophilic\"",
                                "define \"hydrophobic\"",
                                "define \"superhydrophobic\"",
                                "define \"water contact angle\"",
                                "define \"nanoscale\" morphological features",
                                "define \"covalently bound\"",
                                "define \"crosslinking\"",
                                "define \"self-cleaning\""
                            ],
                            "num_characters": 11500,
                            "outline_medium": [
                                "define substituents of compounds",
                                "clarify individual disclosure of subcombinations",
                                "define verb \"comprise\"",
                                "define \"about\" in reference to numerical values",
                                "define articles \"a\", \"an\", and \"the\"",
                                "define numerical ranges",
                                "define \"substituted\" or \"substitution\"",
                                "define \"alkyl\"",
                                "define \"alkylene\"",
                                "define \"fluoroalkyl\"",
                                "define other terms (e.g., \"halo\", \"hierarchical morphology\", etc.)"
                            ],
                            "outline_short": [
                                "define substituents of compounds",
                                "clarify usage of terms like \"comprise\" and \"about\"",
                                "define articles \"a\", \"an\", and \"the\"",
                                "explain numerical ranges",
                                "define various technical terms"
                            ]
                        },
                        {
                            "title": "Hydrophobic and Superhydrophobic Coatings and Coated Articles",
                            "paragraphs": [
                                "The present disclosure features an article that includes a hydrophobic (e.g., a superhydrophobic) coating that is disposed, for example, on at least one surface of the article. The hydrophobic (e.g., superhydrophobic) coating includes a microparticle. The microparticle can be disposed on and covalently bound to a surface of the article. When viewed under magnification (e.g., with a scanning electron microscope or with a transmission electron microscope), the microparticle are porous and observed to have a hierarchical morphology. For example, the microparticle can be formed from an agglomerated plurality of fibers (e.g., nanofibers). The fiber (e.g., nanofiber) includes a C12-C18 alkylhalosiloxane, C6-C18 fluoroalkylhalosiloxane, or any combination thereof.",
                                "In some embodiments, the fiber (e.g., nanofiber) includes a mixture of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and/or C18 alkylhalosiloxane (e.g., C14 alkylhalosiloxane, C16 alkylhalosiloxane, and/or C18 alkylhalosiloxane; C16 alkylhalosiloxane and/or C18 alkylhalosiloxane; or a C18 alkylhalosiloxane); In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of, the C12-C18 alkylhalosiloxane, or any combination thereof. In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and/or C18 alkylhalosiloxane (e.g., C14 alkylhalosiloxane, C16 alkylhalosiloxane, and/or C18 alkylhalosiloxane; C16 alkylhalosiloxane and/or C18 alkylhalosiloxane; or a C18 alkylhalosiloxane). In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of, the C12-C18 alkylhalosiloxane, or any combination thereof.",
                                "In some embodiments, the fiber (e.g., nanofiber) includes a mixture of C6 fluoroalkylhalosiloxane, C8 fluoroalkylhalosiloxane, C10 fluoroalkylhalosiloxane, C12 fluoroalkylhalosiloxane, C14 fluoroalkylhalosiloxane, C16 fluoroalkylhalosiloxane, and/or C18 fluoroalkylhalosiloxane (e.g., C6 fluoroalkylhalosiloxane, C8 fluoroalkylhalosiloxane, C10 fluoroalkylhalosiloxane, C12 fluoroalkylhalosiloxane, and/or C14 fluoroalkylhalosiloxane; C6 fluoroalkylhalosiloxane, C8 fluoroalkylhalosiloxane, C10 fluoroalkylhalosiloxane, and/or C12 fluoroalkylhalosiloxane; C6 fluoroalkylhalosiloxane and/or C8 fluoroalkylhalosiloxane; or C8 fluoroalkylhalosiloxane). In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of, the C6-C18 fluoroalkylhalosiloxane, or any combination thereof. In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of C6 fluoroalkylhalosiloxane and/or C8 fluoroalkylhalosiloxane. In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of, the C6-C8 fluoroalkylhalosiloxane, or any combination thereof. Examples of fluoroalkylhalosiloxanes include, (1H,1H,2H,2H-perfluorooctyl)halosiloxane, (1H,1H,2H,2H-perfluorododecyl)halosiloxane, (1H,1H,2H,2H-perfluorodecyl)halosiloxane, and the like.",
                                "In some embodiments, the C12-C18 alkylhalosiloxane includes one or more of C12-C18 alkylchlorosiloxane. In some embodiments, the fiber (e.g., nanofiber) includes a C18 alkylhalosiloxane, such as a C18 alkylchlorosiloxane.",
                                "In some embodiments, the C12-C18 alkylhalosiloxane includes one or more of C12-C18 alkylfluorosiloxane. In some embodiments, the fiber (e.g., nanofiber) includes a C18 alkylhalosiloxane, such as a C18 alkylfluorosiloxane.",
                                "The C12-C18 alkylhalosiloxane, or any one of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and C18 alkylhalosiloxane, each independently can have less than 3 halo substituents per Si atom. In some embodiments, the ratio of the halo substituents to Si atom in the C12-C18 alkylhalosiloxane, or any one of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and C18 alkylhalosiloxane, each independently is from 3:2 to 1:2. In certain embodiments, the C12-C18 alkylhalosiloxane, or any one of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and C18 alkylhalosiloxane, each independently can have less than 0.5 halo substituent per Si atom (on average).",
                                "The C6-C18 fluoroalkylhalosiloxane, or any one of C6 fluoroalkylhalosiloxane, C8 fluoroalkylhalosiloxane, C10 fluoroalkylhalosiloxane, C12 fluoroalkylhalosiloxane, C14 fluoroalkylhalosiloxane, C16 fluoroalkylhalosiloxane, and/or Cis fluoroalkylhalosiloxane, each independently can have less than 3 halo substituents per Si atom (not counting the fluoro substituents on the alkyl groups). In some embodiments, the ratio of the halo substituents to Si atom (not counting the fluoro substituents on the alkyl groups) in the C6-Cis fluoroalkylhalosiloxane, or any one of C6 fluoroalkylhalosiloxane, C8 fluoroalkylhalosiloxane, C10 fluoroalkylhalosiloxane, C12 fluoroalkylhalosiloxane, C14 fluoroalkylhalosiloxane, C16 fluoroalkylhalosiloxane, and/or Cis fluoroalkylhalosiloxane, each independently is from 3:2 to 1:2. In certain embodiments, the C6-C18 alkylhalosiloxane, or any one of C12 alkylhalosiloxane, C14 alkylhalosiloxane, C16 alkylhalosiloxane, and C18 alkylhalosiloxane, each independently can have less than 0.5 halo substituent per Si atom (on average, not counting the fluoro substituents on the alkyl groups).",
                                "In some embodiments, a given fiber in the microparticle can have an average diameter of from 50 nm to 10000 nm. In some embodiments, the nanofiber in the microparticle can have an average diameter of from 50 nm (e.g., from 100 nm, from 150 nm, from 200 nm, from 250 nm, from 300 nm, from 400 nm, from 500 nm, or from 750 nm) to less than 1000 nm (e.g., to 750 nm, to 500 nm, to 400 nm, to 300 nm, to 250 nm, to 200 nm, to 150 nm, or to 100 nm). In certain embodiments, the nanofiber in the microparticle has an average diameter of from 100 nm to 500 nm. In certain embodiments, the nanofiber in the microparticle has an average diameter of from 100 nm to 250 nm. The average diameter of the fiber can be calculated by measuring the diameter of 10 fibers and calculating the average of the measured diameters.",
                                "In some embodiments, the microparticle has an average diameter of from 0.1 μm (e.g., from 0.5 μm, from 1 μm, from 5 μm, from 10 μm, from 25 μm, from 50 μm, from 100 μm, from 250 μm, from 500 μm, from 750 μm) to 1000 μm (e.g., to 750 μm, to 500 μm, to 250 μm, to 100 μm, to 50 μm, to 25 μm, to 10 μm, to 5 μm, to 1 μm, or to 0.5 μm). In certain embodiments, the microparticle has an average diameter of from 0.5 μm to 500 μm. In certain embodiments, the microparticle has an average diameter of from 1 μm to 100 μm. The average diameter of a microparticle can be calculated by measuring the diameter of 10 microparticles and calculating the average of the measured diameters.",
                                "In some embodiments, the hydrophobic coating has a water contact angle of from 90° (e.g., from 120°, from 140°, from 160°, from 170°, from 175°, or from 179°) to 180° (e.g., to 179°, to 175°, to 170°, to 160°, to 140°, or to 120°). In certain embodiments, the superhydrophobic coating has a water contact angle of from 150° to 179°. In certain embodiments, the superhydrophobic coating has a water contact angle of from 150° to 175°.",
                                "In some embodiments, the hydrophobic coating has a sliding angle of from 0.05° (e.g., from 0.1°, from 0.15°, from 0.2°, from 0.25°, from 0.3°, from 0.35°, from 5°, from 10°, from 12°, from 14°, from 16°, from 18°, or from 20°) to 25° (e.g., to 20°, to 18°, to 16°, to 14°, to 12°, to 10°, to 5°, to 0.35°, to 0.3°, to 0.25°, to 0.2°, to 0.15°, or to 0.1°). In certain embodiments, the hydrophobic coating has a sliding angle of from 0.1° to 25°. In certain embodiments, the superhydrophobic coating has a water contact angle of from 150° to 179°. In some embodiments, the superhydrophobic coating has a sliding angle of from 0.1° (e.g., from 0.15°, from 0.2°, from 0.25°, from 0.3°, from 0.35°, from 5°, or from 8°) and/or to 10° (e.g., to less than 10°, to 8°, to 5°, to 0.35°, to 0.3°, to 0.25°, to 0.2°, to 0.15°, or to 0.10).",
                                "In some embodiments, the microparticle has pores having a maximum dimension of from 0.05 μm (e.g., from 0.1 μm, from 0.25 μm, from 0.5 μm, or 0.75 μm) to 1 μm (e.g., to 0.75 μm, to 0.5 μm, to 0.25 μm, or to 0.1 μm). In certain embodiments, the microparticle has pores having a maximum dimension of from 0.1 μm to 0.5 μm. The average maximum of a pore can be calculated by measuring the maximum size of 10 pores and calculating the average of the measured sizes.",
                                "The hydrophobic or superhydrophobic coating can include a density of from 1 (e.g., from about 100, from about 1,000, from about 5,000, from about 10,000, from about 25,000, from about 50,000, from about 100,000, from about 500,000, from about 1,000,000, from about 10,000,000, from about 500,000,000, or from about 1,000,000,000) to about 10,000,000,000 (e.g., to about 1,000,000,000, to about 500,000,000, to about 10,000,000, to about 1,000,000, to about 500,000, to about 100,000, to about 50,000, to about 25,000, to about 10,000, to about 5,000, to about 1,000, or to about 100) microparticles per square centimeter. In certain embodiments, the hydrophobic or superhydrophobic coating has a density of from about 1,000 to about 100,000,000 microparticles per square centimeter. In certain embodiments, the hydrophobic or superhydrophobic coating has a density of from about 10,000 to about 10,000,000 microparticles per square centimeter. The number of particles per square centimeter can be determined by counting the number of particles in 4 or more SEM images, averaging the value, and calculating the number of particles at the square centimeter area.",
                                "The fibers (e.g., nanofibers) can be physically entangled and/or chemically crosslinked, to provide the agglomerated fibers (e.g., nanofibers). In some embodiments, the fibers (e.g., nanofibers) are both physically entangled and chemically crosslinked (e.g., fibers or nanofibers linked to one another via covalent bonds).",
                                "The microparticles of the hydrophobic or superhydrophobic coating can be covalently-bound to the surface, cannot be washed away by more than 50% (e.g., by more than 40%, by more than 30%, by more than 20%, or by more than 10%) with a sand abrasion test or water jetting test (described below and in the Example), as observed by scanning electron microscopy. In some embodiments, the hydrophobic or superhydrophobic coating can maintain hydrophobicity or superhydrophobicity, respectively, after sand abrasion (4.5 kJ) for 10 min or water jetting (90 kJ) for 10 min. In some embodiments, water immersion for three days and tissue wiping for 20 times does not change the surface hydrophobicity by more than 20% (e.g., by more than 10%, by more than 5%, or by more than 2%). In some embodiments, the hydrophobic or superhydrophobic coating can be subjected to a standard abrasion test, where a coated article is pressed onto a piece of silicon carbide sandpaper (Grit No. 400) under a pressure of 2.5 kPa, and then abraded for a distance of 50 cm. The water contact angle can be maintained (e.g., have a change of less than 20%, less than 10%, less than 5%, less than 2%, or less than 1%) and/or maintain the sliding angle (e.g., have a change of less than 20%, less than 10%, less than 5%, less than 2%, or less than 1%) after the standard abrasion test.",
                                "In some embodiments, the microparticles of the hydrophobic or superhydrophobic coating can encapsulate a small molecule, such as a fluorescent dye or a luminophore, such that the small molecule can be entrapped on the surface of a coated article, when the microparticles of the hydrophobic or superhydrophobic coating are covalently bound to the surface of the coated article.",
                                "The surface that is coated with the hydrophobic or superhydrophobic coating can be any surface, such as a fabric surface, a paper/cardboard surface, a glass surface, a (synthetic or natural) wood surface, a plastic or polymer surface, a metal surface, a leather surface, a suede surface, a fiberglass surface, or any combination thereof. In some embodiments, the surface is porous and/or gas-permeable, such as a fabric or wood, and preserves the gas-permeability when coated with the hydrophobic or superhydrophobic coating. The articles can be any article where hydrophobicity or waterproofing properties are desirable, such as an article that includes a material such as fabric, glass, wood, plastic or polymer (e.g., nylon, polyester, acrylic), metal, leather, suede, fiberglass, paper, cardboard, natural and synthetic fibers (e.g., acrylic, wool, rayon, bamboo, cotton, spandex, elastane, polyester, angora, etc.). The articles can be, for example, clothing, a tent, a sleeping bag, an outdoor equipment, a shelter, a window, an awning, winter clothing, footwear, bags, headwear, knitted garments, wicking linings, bevy sacks, outdoor furniture, boat covers, sporting equipment, marine equipment (e.g., boats, buoys), a construction material, stone, concrete, wood, cement, steel, etc. The hydrophobic or superhydrophobic coating-coated article can be permeable to gas, such as oxygen and/or a water vapor, which can be advantageous for breathability and comfort (e.g., in the case of clothing).",
                                "In certain embodiments, the article that is coated with the hydrophobic or superhydrophobic coating is self-cleaning. In some embodiments, the article that is coated with the hydrophobic or superhydrophobic coating is non-fouling.",
                                "In some embodiments the article that is coated with the hydrophobic or superhydrophobic coating does not undergo a change of greater than 20% (e.g., greater than 15%, or greater than 10%) in microparticle shape, average microparticle size, and/or average microparticle density; does not undergo a change of greater than 10% (e.g., a change of greater than 5%, a change of greater than 2%, or a change of greater than 1%) in water contact angle; and/or a does not undergo a change of greater than 1000% (e.g., greater than 500%, greater than 100%, greater than 50%, greater than 20%, greater than 10%, greater than 5%, or greater than 2%) in sliding angle, upon storage under ambient conditions for an extended period of time (e.g., for at least 12 months, at least 18 months, or at least 24 months and/or up to 48 months, up to 36 months, or up to 24 months). As used herein, ambient conditions refer to a temperature of between 20° C. to 25° C., at 1 atmosphere, under full-spectrum daylight, and at a humidity of 10% to 80%."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce hydrophobic coating",
                                "describe microparticle composition",
                                "specify hierarchical morphology",
                                "detail fiber composition",
                                "list alkylhalosiloxane options",
                                "list fluoroalkylhalosiloxane options",
                                "specify halo substituent ratio",
                                "describe fiber diameter range",
                                "specify microparticle diameter range",
                                "describe water contact angle range",
                                "describe sliding angle range",
                                "specify pore size range",
                                "describe coating density range",
                                "detail fiber entanglement and crosslinking",
                                "describe microparticle binding to surface",
                                "specify abrasion test conditions",
                                "describe water immersion test conditions",
                                "describe tissue wiping test conditions",
                                "specify standard abrasion test conditions",
                                "describe small molecule encapsulation",
                                "list surface types for coating",
                                "describe article types for coating",
                                "specify gas permeability",
                                "describe self-cleaning properties",
                                "describe non-fouling properties",
                                "specify coating stability over time",
                                "describe microparticle shape and size stability",
                                "describe water contact angle and sliding angle stability"
                            ],
                            "num_characters": 14524,
                            "outline_medium": [
                                "introduce hydrophobic coating",
                                "describe microparticle composition",
                                "detail fiber composition",
                                "specify alkylhalosiloxane properties",
                                "specify fluoroalkylhalosiloxane properties",
                                "describe microparticle size and shape",
                                "describe hydrophobic coating properties",
                                "specify water contact angle",
                                "specify sliding angle",
                                "describe microparticle density",
                                "describe fiber entanglement and crosslinking",
                                "describe coating durability",
                                "describe coating applications",
                                "describe article properties"
                            ],
                            "outline_short": [
                                "introduce hydrophobic coating",
                                "describe microparticle composition",
                                "specify fiber composition",
                                "detail microparticle size and shape",
                                "describe coating properties",
                                "specify coating durability",
                                "provide examples of coated articles"
                            ]
                        },
                        {
                            "title": "Coating Formulations",
                            "paragraphs": [
                                "The present disclosure features a hydrophobic or superhydrophobic coating formulation, including a suspension that includes a microparticle (e.g., a plurality of microparticles) suspended in a continuous phase. The microparticle is as described herein in the section entitled “Hydrophobic and Superhydrophobic Coatings and Coated Articles.” For example, the microparticle can be porous and include a hierarchical morphology; the microparticle can include an agglomerated plurality of fibers (e.g., nanofibers), and the fibers (e.g., nanofibers) can include a C12-C18 alkylhalosiloxane, C6-C18 fluoroalkylhalosiloxane, or any combination thereof.",
                                "The continuous phase can include an organic solvent, an alkyltrihalosilane, a fluoroalkyltrihalosilane, or a combination thereof. For example, the organic solvent can include hexanes, mineral spirits, petroleum ether, toluene, ethyl acetate, acetone, dichloromethane, and/or chloroform, or any organic solvent that is volatile at 21° C. and at 1 atm. For example, the organic solvent can have a boiling point of less than 300° C. and a vapor pressure of about 100 Pa to 10 MPa. The continuous phase does not dissolve the microparticles. The alkyltrihalosilane can include a C12-C18 alkyltrihalosilane. The fluoroalkyltrihalosilane can include a C6-C18 fluoroalkyltrihalosilane. Examples of fluoroalkyltrihalosilanes include, (1H,1H,2H,2H-perfluorooctyl)halosilane, (1H,1H,2H,2H-perfluorododecyl)halosilane, (1H,1H,2H,2H-perfluorodecyl)halosilane, and the like.",
                                "In some embodiments, the microparticles are present in the suspension at a concentration of from 0.1% m/m (e.g., from 0.2% m/m, from 0.5% m/m, from 1% m/m, from 5% m/m, from 10% m/m, from 20% m/m, from 30% m/m, or from 40% m/m) to 50% m/m (e.g., to 40% m/m, to 30% m/m, to 20% m/m, to 10% m/m, to 5% m/m, to 1% m/m, to 0.5% m/m, or to 0.2% m/m), where % m/m refers to the mass of the microparticles relative to the mass of the suspension. In certain embodiments, the microparticles are present in the suspension at a concentration of from 0.1% m/m to 50% m/m (e.g., from 0.2% m/m to 30% m/m, or from 0.5% m/m to 20% m/m), where % m/m refers to the mass of the microparticles relative to the mass of the suspension."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce coating formulation",
                                "describe microparticle composition",
                                "specify continuous phase composition",
                                "describe microparticle concentration range"
                            ],
                            "num_characters": 2223,
                            "outline_medium": [
                                "introduce coating formulation",
                                "describe continuous phase composition"
                            ],
                            "outline_short": [
                                "describe coating formulation composition"
                            ]
                        },
                        {
                            "title": "Methods of Making the Hydrophobic or Superhydrophobic Coatings",
                            "paragraphs": [
                                "The present disclosure also describes methods of making a hydrophobic or superhydrophobic coating. The method includes providing a mixture of water and a C12-C18 alkyltrihalosilane, water and a C6-C18 fluoroalkyltrihalosilane, or water and a C12-C18 alkyltrihalosilane and a C6-C18 fluoroalkyltrihalosilane; mixing the mixture to provide an emulsion of droplets (e.g., nanodroplets), reacting the water and the C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosilane in the mixture to provide a plurality of fibers (e.g., nanofibers) including a C12-C18 alkylhalosiloxane and/or C6-C18 fluoroalkylhalosiloxane, and agglomerating the plurality of fibers (e.g., nanofibers) to provide a suspension of porous microparticles in a continuous phase of the C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosilane.",
                                "In some embodiments, the droplets (e.g., nanodroplets) have a diameter of from 1 nm (e.g., from 5 nm, from 10 nm, from 25 nm, from 50 nm, from 100 nm, from 250 nm, from 500 nm, from 750 nm, or from 900 nm) to 1000 nm (e.g., to 900 nm, to 750 nm, to 500 nm, to 250 nm, to 100 nm, to 50 nm, to 25 nm, to 10 nm, or to 5 nm). In certain embodiments, the nanodroplets have a diameter of from 10 nm to 500 nm. In certain embodiments, the nanodroplets have a diameter of from 50 nm to 250 nm. The diameter of the droplets in solution can be determined using dynamic light scattering.",
                                "In some embodiments, the emulsion includes water nanodroplets in a continuous phase of the C12-C18 alkyltrihalosilane. The C12-C18 alkyltrihalosilane continuous phase can include any one of the C12-C18 alkyltrihalosilane; or can include a mixture of C12 alkyltrihalosilane, C14 alkyltrihalosilane, C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane (e.g., C14 alkyltrihalosilane, C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane; C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane; or C18 alkyltrihalosilane). In some embodiments, the fiber (e.g., nanofiber) consists essentially of, or consists of, the C12-C18 alkylhalosiloxane, or any combination thereof. In some embodiments, the continuous phase consists essentially of, or consists of, a mixture of C12 alkyltrihalosilane, C14 alkyltrihalosilane, C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane (e.g., C14 alkyltrihalosilane, C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane; C16 alkyltrihalosilane, and/or C18 alkyltrihalosilane; or C18 alkyltrihalosilane). In some embodiments, the continuous phase consists essentially of, or consists of, the C12-C18 alkyltrihalosilane, or any combination thereof.",
                                "In some embodiments, the emulsion includes water nanodroplets in a continuous phase of the C6-C18 fluoroalkyltrihalosilane. The continuous phase of the C6-C18 fluoroalkyltrihalosilane can include any one of C6-C18 fluoroalkyltrihalosilane, or a mixture of C6 fluoroalkyltrihalosilane, C8 fluoroalkyltrihalosilane, C10 fluoroalkyltrihalosilane, C12 fluoroalkyltrihalosilane, C14 fluoroalkyltrihalosilane, C16 fluoroalkyltrihalosilane, and/or C18 fluoroalkyltrihalosilane (e.g., C6 fluoroalkyltrihalosilane, C8 fluoroalkyltrihalosilane, C10 fluoroalkyltrihalosilane, C12 fluoroalkyltrihalosilane, and/or C14 fluoroalkyltrihalosilane; C6 fluoroalkyltrihalosilane, C8 fluoroalkyltrihalosilane, C10 fluoroalkyltrihalosilane, and/or C12 fluoroalkyltrihalosilane; C6 fluoroalkyltrihalosilane and/or C8 fluoroalkyltrihalosilane; or C8 fluoroalkyltrihalosilane). In some embodiments, the continuous phase consists essentially of, or consists of, the C6-C18 fluoroalkyltrihalosilane, or any combination thereof. In some embodiments, the continuous phase consists essentially of, or consists of C6 fluoroalkyltrihalosilane and/or C8 fluoroalkyltrihalosilane. In some embodiments, the continuous phase consists essentially of, or consists of, the C6-C8 fluoroalkyltrihalosilane, or any combination thereof. Examples of fluoroalkyltrihalosilanes include, trichloro(1H,1H,2H,2H-perfluorooctyl)silane, trichloro (1H,1H,2H,2H-perfluorododecyl)silane, trichloro (1H,1H,2H,2H-perfluorodecyl)silane, and the like.",
                                "The mixture of water and C12-C18 alkyltrihalosilane (or the mixture of water and C6-C18 fluoroalkyltrihalosilane, or the mixture of water with C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) can have a mole ratio of from 0.01:1 (e.g., from 0.05:1, from 0.1:1, from 0.5:1, from 1:1, from 3:1, or from 5:1) to 10:1 (e.g., to 5:1, to 3:1, to 1:1, to 0.5:1, to 0.1:1, or to 0.05:1) water:C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane). In some embodiments, the mixture can include a water:C12-C18 alkyltrihalosilane (or a water:C6-C18 fluoroalkyltrihalosilane; or a water:(C12-C18 alkyltrihalosilane+C6-C18 fluoroalkyltrihalosilane)) mole ratio of from 0.01:1 to 5:1. In certain embodiments, the mixture can include a water:C12-C18 alkyltrihalosilane (or a water:C6-C18 fluoroalkyltrihalosilane; or a water:(C12-C18 alkyltrihalosilane+C6-C18 fluoroalkyltrihalosilane)) mole ratio of from 0.01:1 to 3:1. In some embodiments, the mixture includes a mole ratio of 1:2 water:C12-C18 alkyltrihalosilane (or a water:C6-C18 fluoroalkyltrihalosilane; or a water:(C12-C18 alkyltrihalosilane+C6-C18 fluoroalkyltrihalosilane)).",
                                "The mixture can include from 0.01% (e.g., from 0.02%, from 0.05%, from 0.1%, from 0.25%, from 0.5%, from 1%, from 3%, from 5%, from 7%, or from 9%) to 10% (e.g., to 9%, to 7%, to 5%, to 3%, to 1%, to 0.5%, to 0.25%, to 0.1%, to 0.05%, to 0.02%) by volume of water in C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane). In some embodiments, the mixture includes from 0.01% to 8.00% by volume of water in C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane). In certain embodiments, the mixture includes from 0.01% to 5.00% by volume of water in C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane). In certain embodiments, the mixture includes 2% by volume of water in C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane).",
                                "In any of the embodiments herein, the C12-Cis alkyltrihalosilane can include a C12-C18 alkyltrichlorosilane. In some embodiments, the continuous phase includes a C18 alkyltrihalosilane, such as a C18 alkyltrichlorosilane.",
                                "In any of the embodiments herein, the C12-Cis alkyltrihalosilane can include a C12-C18 alkyltrifluorosilane. In some embodiments, the continuous phase includes a C18 alkyltrihalosilane, such as a C18 alkyltrifluorosilane.",
                                "In any one of the embodiments herein, the C6-C18 fluoroalkyltrihalosilane can include a trichloro C6-C18 fluoroalkylsilane. In some embodiments, the continuous phase includes a trichloro C6 fluoroalkylsilane, a trichloro C8 fluoroalkylsilane, a trichloro C10 fluoroalkylsilane, a trichloro C10 fluoroalkylsilane, a trichloro C12 fluoroalkylsilane, a trichloro C14 fluoroalkylsilane, a trichloro C16 fluoroalkylsilane, and/or a trichloro C18 fluoroalkylsilane.",
                                "In some embodiments, the mixture of water and C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) can further include a small molecule to be encapsulated by the nanodroplets, and in turn the fibers (e.g., nanofibers) and microparticles. As used herein, a “small molecule” has a molecular weight of less than 2000 Daltons. Examples of small molecules include fluorescent dyes, colored molecules, luminophores, inorganic salts, graphite, metal nanoparticles, organic molecules, or inorganic molecules. In some embodiments, the mixture of water and C12-C18 alkyltrihalosilane (or water and C6-C18 fluoroalkyltrihalosilane; or water and C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) can further include a molecule and/or particles to be encapsulated by the nanodroplets, such as graphene.",
                                "Mixing the mixture can include any method suitable to generate the emulsion including the nanodroplets in a continuous phase. For example, mixing the mixture can include one or more steps of vortexing at an rpm of from 10 (e.g., from 100, from 1,000, from 2,500, from 5,000, or from 7,500) to 10,000 (e.g., to 7,500, to 5,000 to 2,500, to 1,000, or 100) for a duration of from 0.1 second (s) (e.g., from 1 second, from 2 seconds, from 5 seconds, from 10 seconds, from 30 seconds, from 1 minute, from 5 minutes, from 10 minutes, from 30 minutes, from 45 minutes) to 1 hour (h) (e.g., to 45 minutes, to 30 minutes, to 10 minutes, to 5 minutes, to 1 minute, to 30 seconds, to 10 seconds, to 5 seconds, to 2 seconds, or to 1 second), and/or one or more steps of ultrasonicating at a frequency of from 5 kHz (e.g., from 10 kHz, from 15 kHz, from 18 kHz, from 30 kHz, from 100 kHz, from 1 MHz, or from 30 MHz) to 50 MHz (e.g., to 30 MHz, to 1 MHz, to 100 kHz, to 30 kHz, to 18 kHz, to 15 kHz, or to 10 kHz) for a duration of from 0.1 second (s) (e.g., from 1 second, from 2 seconds, from 5 seconds, from 10 seconds, from 30 seconds, from 1 minute, from 5 minutes, from 10 minutes, from 30 minutes, from 45 minutes) to 1 hour (h) (e.g., to 45 minutes, to 30 minutes, to 10 minutes, to 5 minutes, to 1 minute, to 30 seconds, to 10 seconds, to 5 seconds, to 2 seconds, or to 1 second). In some embodiments, mixing the mixture can include one or more steps of vortexing at an rpm of from 100 to 5000 (e.g., 500 to 5000) for a period of 1 second to 10 min (e.g., from 1 second to 1 minute), and/or one or more steps of ultrasonicating at a frequency of from 5 kHz (e.g., from 10 kHz, from 15 kHz, from 18 kHz, from 30 kHz, from 100 kHz, from 1 MHz, or from 30 MHz) to 50 MHz (e.g., to 30 MHz, to 1 MHz, to 100 kHz, to 30 kHz, to 18 kHz, to 15 kHz, or to 10 kHz) for a duration of from 1 second to 10 minutes (or from 1 second to 1 minute).",
                                "In some embodiments, mixing the mixture includes vortexing at an rpm of from 10 (e.g., from 100, from 1,000, from 2,500, from 5,000, or from 7,500) to 10,000 (e.g., to 7,500, to 5,000 to 2,500, to 1,000, or 100) for a duration of from 0.1 second (s) (e.g., from 1 second, from 2 seconds, from 5 seconds, from 10 seconds, from 30 seconds, from 1 minute, from 5 minutes, from 10 minutes, from 30 minutes, from 45 minutes) to 1 hour (h) (e.g., to 45 minutes, to 30 minutes, to 10 minutes, to 5 minutes, to 1 minute, to 30 seconds, to 10 seconds, to 5 seconds, to 2 seconds, or to 1 second); ultrasonicating at a frequency of from 5 kHz (e.g., from 10 kHz, from 15 kHz, from 18 kHz, from 30 kHz, from 100 kHz, from 1 MHz, or from 30 MHz) to 50 MHz (e.g., to 30 MHz, to 1 MHz, to 100 kHz, to 30 kHz, to 18 kHz, to 15 kHz, or to 10 kHz) for a duration of from 0.1 second (s) (e.g., from 1 second, from 2 seconds, from 5 seconds, from 10 seconds, from 30 seconds, from 1 minute, from 5 minutes, from 10 minutes, from 30 minutes, from 45 minutes) to 1 hour (h) (e.g., to 45 minutes, to 30 minutes, to 10 minutes, to 5 minutes, to 1 minute, to 30 seconds, to 10 seconds, to 5 seconds, to 2 seconds, or to 1 second); then vortexing the mixture at an rpm of from 10 (e.g., from 100, from 1,000, from 2,500, from 5,000, or from 7,500) to 10,000 (e.g., to 7,500, to 5,000 to 2,500, to 1,000, or 100) for a duration of from 0.1 second (s) (e.g., from 1 second, from 2 seconds, from 5 seconds, from 10 seconds, from 30 seconds, from 1 minute, from 5 minutes, from 10 minutes, from 30 minutes, from 45 minutes) to 1 hour (h) (e.g., to 45 minutes, to 30 minutes, to 10 minutes, to 5 minutes, to 1 minute, to 30 seconds, to 10 seconds, to 5 seconds, to 2 seconds, or to 1 second). In some embodiments, the vortexing steps can each be at an rpm of from 100 to 5000 (e.g., 500 to 5000) for a period of 1 second to 10 min (e.g., from 1 second to 1 minute). In some embodiments, the ultrasonicating step is at a frequency of from 5 kHz (e.g., from 10 kHz, from 15 kHz, from 18 kHz, from 30 kHz, from 100 kHz, from 1 MHz, or from 30 MHz) to 50 MHz (e.g., to 30 MHz, to 1 MHz, to 100 kHz, to 30 kHz, to 18 kHz, to 15 kHz, or to 10 kHz) for a duration of from 1 second to 10 minutes (or from 1 second to 1 minute). In some embodiments, the ultrasonicating step is at a frequency of from 15 kHz to 30 MHz (e.g., 18 kHz to 100 kHz) for a duration of from 1 second to 10 minutes (or from 1 second to 1 minute).",
                                "Reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) can include agglomerating the fibers (e.g., nanofibers), which can be contemporaneous with the reaction between the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane). In some embodiments, the reacting and agglomerating can occur over a duration of from 0.1 second (e.g., from 1 second, from 10 seconds, from 1 minute, from 10 minutes, from 100 minutes, from 1,000 minutes, from 5,000, or from 7,000) to 10,000 minutes (e.g., to 7,000 minutes, to 5,000 minutes, to 1,000 minutes, to 100 minutes, to 10 minutes, to 1 minute, to 10 seconds, to 1 second). In certain embodiments, the reacting and agglomerating can occur over a duration of from 0.1 second to about 1440 minutes. In some embodiments, the reacting and agglomerating can occur over a duration of from 0.5 second to about 600 minutes.",
                                "In some embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a temperature of from 0° C. (e.g., from 10° C., from 20° C., from 30° C., from 50° C., from 75° C., from 100° C., from 125° C., from 150° C., or from 175° C.) to 200° C. (e.g., to 175° C., to 150° C., to 125° C., to 100° C., to 75° C., to 50° C., to 30° C., to 20° C., or to 10° C.), and/or at a pressure of from 10 kPa (e.g., 100 kPa, 1 mPa, or 5 mPa) to 10 mPa (e.g., 5 mPa, 1 mPa, or 100 kPa). In certain embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a temperature of from 10° C. to 100° C. In certain embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a temperature of from 18° C. to 80° C. In some embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at atmospheric pressure. In some embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a pressure of 50 kPa to 500 kPa. In certain embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a pressure of 80 kPa to 300 kPa. In some embodiments, reacting the water and the C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) to provide the fibers (e.g., nanofibers) and/or agglomerating the fibers (e.g., nanofibers) is conducted at a temperature of about 20° C. to 25° C., at 1 atmosphere (i.e., about 100 kPa).",
                                "Thus, the present disclosure describes a small amount of water mixed with bulk C12-C18 alkyltrihalosilane (or C6-C18 fluoroalkyltrihalosilane, or C12-C18 alkyltrihalosilane and C6-C18 fluoroalkyltrihalosilane) at a predetermined stoichiometric ratio to generate fibers (e.g., nanofibers) which in turn aggregate to form microparticles. The microparticles are then diluted and applied onto the surface of an article, for example, by dipping or spraying. In the present disclosure, the organosilane forms hierarchical micro/nanostructures with low surface tension in a single step. In some embodiments, the coatings of the present disclosure have a water contact angler of greater than or equal to 170°. Thus, the coatings of the present disclosure are different from existing coatings."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe method of making hydrophobic or superhydrophobic coating",
                                "provide mixture of water and C12-C18 alkyltrihalosilane or C6-C18 fluoroalkyltrihalos",
                                "mix mixture to form emulsion of droplets",
                                "react water and C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosil",
                                "form fibers including C12-C18 alkylhalosiloxane and/or C6-C18 fluoroalkylhalosilox",
                                "agglomerate fibers to form suspension of porous microparticles",
                                "specify diameter of droplets",
                                "describe emulsion including water nanodroplets in continuous phase",
                                "specify composition of continuous phase",
                                "specify mole ratio of water to C12-C18 alkyltrihalosilane or C6-C18 fluoroalkyltrihal",
                                "specify percentage of water in C12-C18 alkyltrihalosilane or C6-C18 fluoroalkyltrihal",
                                "provide examples of fluoroalkyltrihalosilanes",
                                "specify alkyltrihalosilane",
                                "specify fluoroalkyltrihalosilane",
                                "include small molecule",
                                "include molecule and/or particles",
                                "mix mixture",
                                "vortex mixture",
                                "ultrasonicate mixture",
                                "combine vortexing and ultrasonication",
                                "specify vortexing parameters",
                                "specify ultrasonication parameters",
                                "react water and alkyltrihalosilane",
                                "agglomerate fibers",
                                "specify reaction duration",
                                "specify reaction temperature",
                                "specify reaction pressure",
                                "conduct reaction at atmospheric pressure",
                                "conduct reaction at specific pressure range",
                                "describe resulting fibers and microparticles",
                                "apply microparticles to article surface",
                                "form hierarchical micro/nanostructures",
                                "describe coating properties"
                            ],
                            "num_characters": 17007,
                            "outline_medium": [
                                "describe method of making hydrophobic coating",
                                "specify mixture composition",
                                "define droplet size",
                                "detail emulsion composition",
                                "specify mole ratio of water to silane",
                                "define volume percentage of water in silane",
                                "specify alkyltrihalosilane",
                                "specify fluoroalkyltrihalosilane",
                                "describe mixture composition",
                                "describe mixing methods",
                                "describe reacting and agglomerating",
                                "specify reaction conditions",
                                "describe fiber formation",
                                "describe microparticle formation",
                                "describe coating application",
                                "describe coating properties"
                            ],
                            "outline_short": [
                                "describe method of making hydrophobic coating",
                                "specify emulsion composition and properties",
                                "detail mixture ratios and concentrations",
                                "specify alkyltrihalosilane and fluoroalkyltrihalosilane",
                                "describe mixture preparation",
                                "outline mixing methods",
                                "detail reaction and agglomeration conditions",
                                "summarize coating formation and properties"
                            ]
                        },
                        {
                            "title": "Methods of Making Coated Articles",
                            "paragraphs": [
                                "The present disclosure features a method of coating an article to provide a coated hydrophobic or superhydrophobic article, including diluting a suspension of microparticles in an organic solvent to provide a dilution of microparticles; and applying the dilution of microparticles to a surface of an article to provide the coated hydrophobic or superhydrophobic article. Applying the dilution can include dipping the article in the dilution of microparticles, spraying the dilution of microparticles onto the surface of the article, painting the dilution of microparticles onto the surface of the article, and/or any method that can coat a surface of an article. The coated surface of the article can have superhydrophobicity (e.g., a water contact angle of greater than or equal to 150°; and can be resistant to mechanical abrasion, where the microparticle coating density does not decrease by more than 50% (e.g., by more than 40%, by more than 30%, by more than 20%, or by more than 10%) when subjected to sand abrasion (4.5 kJ) for 10 min, water jetting (90 kJ) for 10 min, tissue wiping for 20 times, and/or moving 50 cm linearly on sandpaper under a load of 2.5 kPa.",
                                "Unlike existing coating methods, in some embodiments, the coating methods of the present disclosure does not include coating a substrate with candle soot, the use of fluorinated compounds different than the C6-C18 fluoroalkyltrihalosilanes as described herein (e.g., polytetrafluoroethylene nanoparticles, perfluoropolyether, fluorinated amine), the use of an adhesive and/or resins (e.g., epoxy-resin-based adhesive), micro-pyramidal arrays, porous foams (e.g., copper foam), nano- and/or micro-silica, polydimethylsiloxane, a prepolymer and/or a curing agent, silica sols, waxes (e.g., carnauba wax), silica nanoparticles coated with organosilanes, and/or the formation of microscale features within a surface (e.g., by lithography, etching, or through the use of laser).",
                                "In some embodiments, the coatings of the present composition do not include a self-assembled monolayer on a surface, such as a self-assembled monolayer formed of organosilanes (e.g., an alkoxy silane) on a surface (e.g., a glass surface and/or a silicon surface); a coating formed by contacting a surface with a solution of organosilanes (e.g., an alkoxy silane that optionally does not include an organosiloxane); preforming micro/nano morphological structures on a surface before coating the surface with organosilanes; pre-functionalizing a surface with reactive groups, such as epoxide groups, then reacting the surface with particles, such as amino-functionalized silica particles, followed by coating with an organosilane to provide a coating; modifying preformed nanowire nanowall surfaces with an organosilane followed by a second coating of a hydrocarbon (e.g., n-octadecane) onto flat substrates; and/or coating preformed nanoparticles (e.g., silica nanoparticles) with one or more organosilanes, then using the coated nanoparticles in a coating formulation to provide a coating material.",
                                "In some embodiments, the coatings of the present disclosure do not require pretreatment of the underlying article before coating with coating formulation (e.g., pretreatment of wood with FeSO4 and CoCl2, followed by immersion in an organosilane); nor the use of adhesives such as epoxy resins; or pre-coating a surface with particles followed by treatment with an organosilane. In some embodiments, the coatings of the present disclosure do not require post-coating treatment of the coated article to provide a hydrophobic or superhydrophobic surface.",
                                "Compared to existing products for repelling water (e.g., Woods™ waterproof silicone spray, Grangers™ footwear repel, Woods™ instant waterproof spray, KIWI™ Protect-All™ leather & fabric footwear, Nikwax TX. direct spray-on, Scotchgard™ water shield heavy-duty water-repellent spray, KIWI™ camp dry heavy-duty water repellent, NeverWet®), the coating compositions of the present disclosure offer significant cost savings and greater hydrophobicity, as evidenced by the greater contact angle.",
                                "The Example below describe hydrophobic and superhydrophobic coatings and their characterizations."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce coating method",
                                "describe application methods",
                                "specify coated surface properties",
                                "limitations of existing coating methods",
                                "exclude specific coating materials",
                                "exclude specific coating processes",
                                "compare to existing products",
                                "introduce example descriptions"
                            ],
                            "num_characters": 4191,
                            "outline_medium": [
                                "define coating method",
                                "limitations of existing methods",
                                "exclude specific coating methods",
                                "compare with existing products"
                            ],
                            "outline_short": [
                                "outline coating method",
                                "distinguish from existing methods"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce hydrophobic and superhydrophobic coatings",
                        "describe properties and applications"
                    ],
                    "num_characters": 1113,
                    "outline_medium": [
                        "introduce hydrophobic and superhydrophobic coatings"
                    ],
                    "outline_short": [
                        "introduce hydrophobic and superhydrophobic coatings"
                    ]
                },
                {
                    "title": "EXAMPLE",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1: Functional and Versatile Superhydrophobic Coatings",
                            "paragraphs": [
                                "In the present Example, octadecyltrichlorosilane (OTS) is the only reagent required other than water and a solvent (e.g., hexane) for coating fabrication. Its fluorine-free composition minimizes potential environmental and health hazards. Conventionally, chlorosilane derivatives are reputed to vigorously react with even trace amounts of water and create large aggregates that are futile for obtaining high-quality monolayer coatings. Thus, when adopting chlorosilanes for surface modification, a rigorously controlled humidity is generally required. However, for OTS, its C18 long alkyl chain can sterically reduce the reaction rate when exposed to water or moisture. With the reaction being kinetically controllable, the present Example unorthodoxly harnesses the aggregation of OTS to create the desired surface coating upon reacting with a stoichiometric amount of water. Different from existing studies, the stoichiometric reaction between OTS and water explored herein not only creates the required hierarchical micro/nanostructures but also results in low surface tension. Superhydrophobicity can be achieved in a single step with an organotrihalosilane as the only precursor (vide infra) besides water and solvent for dilution. This present Example is conceptually different from conventional sol-gel processes, for which less-reactive organosilanes (e.g., tetraethoxysilane) were mixed with a bulk amount of water to create solid materials.",
                                "Sample Preparation",
                                "For the initial preparation of the coating solution as described in FIG. 1A, 20 μL water was added to 1.0 mL pure OTS in a 1.7 mL microcentrifuge tube. The tube was then capped and immediately put on a vortex mixer (Fisher Scientific, Model 9454FIALUS) at 3200 rpm for 10 s, followed by sonication in an Ultrasonic cleaner (Aquaponic, Model 50T) for 10 s (uncapped) and another round of vortex mixing for 10 s (capped). Immediately after, 500 μL of the resulted emulsion was transferred to a 20 mL scintillation vial (with cap on but not airtight). After 2 h, 10 mL hexane was added to the vial and mixed by shaking before use.",
                                "For the surface modification, all solid substrates were cut into small pieces (1×3 cm2) and immersed in the coating solution prepared according to steps described herein for overnight. The treated sample was then removed from the solution and washed three times with hexane and then dried in air. For the spray coating experiments, all samples were used in their original form without any pretreatments besides washing with water and drying. An exemption is for glass samples, for which an additional cleaning step was performed with an UV-Ozone cleaner (PSD-UV, Novascan Technologies Inc.) for 30 min.",
                                "For the “gold-tracking” and chromophore encapsulation experiments, 60 mg chloroauric acid was dissolved in 100 μL water or 15 mg of rhodamine B was dissolved in 1.0 mL water; the prepared solution was then used in place of water in the steps described herein to prepare the coating solution.",
                                "For the large-scale preparation and for spray experiments, 200 μL deionized water was added to 10 mL of OTS in a glass vial. Followed by the same preparation procedures as described herein. After 2-h incubation of the mixture, the solution was diluted with 200 mL of mineral spirit. Then the solution was transferred to a plastic spray bottle. The spraying was performed herein the sample at a 30° angle toward the sample to be treated.",
                                "Sample Characterization",
                                "Photos and normal speed videos were captured with a Sony mirrorless digital camera (Alpha a7RII, Japan) with a Canon macro lens (EF 100 mm f/2.8 L IS USM, Japan). The slow-motion video was captured with a high-speed camera (Promon U750) from AOS Technologies AG (Baden, Switzerland).",
                                "Water contact angles (WCA) were measured with an optical goniometer (AST VCA system, Billerica, MA). A 1.0 μL droplet was held with a syringe needle, slowly moved down to contact the sample surface. At least three samples prepared under the same condition were tested; for each sample, 5 different regions were examined.",
                                "The morphology of the treated samples was imaged with a FEI Nova NanoSEM 430 system (FEI Company, Hillsboro, OR). The substrates were first sputtered with iridium (5 nm) with a Leica EM ACE600 (Wetzlar, Germany) deposition chamber to improve the conductivity. The cross-section view of the samples was obtained either using a FEI Strata DualBeam DB235 (FEI Company, Hillsboro, OR) or a FEI Helios NanoLab 650 SEM/FIB System. The substrates were coated with carbon (15 nm) in this case. During the imaging, the samples were tilted for 52° following by a gallium ion beam (30 pA) cutting for 15 min. Transmission electron microscopy (TEM) was carried out with a FEI Tecnai Osiris S/TEM (FEI Company, Hillsboro, OR) at 200 kV. The nanospheres were prepared as described herein, then dissolved in hexane and transferred to a Cu-grid for imaging.",
                                "Elemental analysis was acquired with an EDAX detector installed on the FEI Strata DualBeam DB235 system. The element mapping was performed using the EDAX detector installed on the FEI Helios NanoLab 650 SEM/FIB System (with the energy at 8 kV). XPS data were obtained on an Axis Ultra DLD spectrometer (Kratos Analytical, Manchester, UK), with a monochromatic aluminum source (Al Kα 1486.6 eV) at a power of 150 W (10 mA/15 kV). The FTIR spectrum was acquired with on a Perkin Elmer Spectrum Two Spectrometer with an ATR attachment. The dynamic light scattering (DLS) data were obtained using a Zetasizer Nano ZS system (model ZEN 3600) from Malvern Instruments, UK. The viscosity of OTS (14.674 mPa·s at 20° C.) was determined with a μVisc viscometer (RheoSense, Inc., San Ramon, CA); its refractive index (1.5122 at 532 nm) was determined with a Metricon refractometer (Model 2010/M, Pennington, NJ)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce OTS-based superhydrophobic coatings",
                                "describe reaction mechanism with water",
                                "outline sample preparation procedure",
                                "detail coating solution preparation",
                                "describe surface modification process",
                                "outline additional steps for gold-tracking and chromophore encapsulation",
                                "describe large-scale preparation and spray experiments",
                                "summarize sample characterization methods",
                                "detail water contact angle measurement",
                                "outline morphology imaging and elemental analysis",
                                "summarize additional characterization methods"
                            ],
                            "num_characters": 5813,
                            "outline_medium": [
                                "introduce OTS-based coating fabrication",
                                "describe sample preparation",
                                "outline surface modification and coating application",
                                "detail sample characterization methods",
                                "list characterization results"
                            ],
                            "outline_short": [
                                "prepare superhydrophobic coating solution",
                                "characterize coating properties"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "DISCUSSION",
                    "paragraphs": [
                        "The coating mixture was prepared by directly reacting water with pure OTS, followed by dilution with hexane. As shown in FIG. 1A, the consecutive photos depicted a trial experiment of adding water to OTS with a mole ratio of 1:2, for example, 40 μL (2.2 micromole) of water was required for 2.0 mL of OTS (4.4 micromole), which was exactly ⅓ of the amount of water needed to complete the hydrolysis of OTS. The addition of water was followed by immediate mechanical mixing, including vortex and sonication. The mixture was then diluted with hexane (5% v/v OTS/hexane) before being applied on a number of solid surfaces (vide infra). Remarkably, the reaction between water and OTS was rather mild with minimal volume increase and gas (HCl) release. The modification of standard microscope glass slides, an intrinsically flat substrate, was first investigated. As shown in FIG. 1B, a 5.0 μL of water droplet stayed as a near-perfect sphere on the surface and easily slid off. The water contact angle of the modified glass was measured to be 172±1°, with an ultralow sliding angle of 0.7±0.2°. The surface was also tested dynamically with a 5.0 μL water droplet at a speed of 1 m/s (momentum energy of 2.5 μJ), and the droplet bounced off the surface freely without pinning onto it. As captured by a high-speed camera, a water droplet freely jumped from one side to the other side of the superhydrophobic glass slide. Apparently, both the ultrahigh water contact angle and ultralow sliding angle (minimum wetting hysteresis) warrant the excellent water-repellency (non-sticky property) of the coated (also referred to as modified herein) glass surface.",
                        "After modification, the glass slide was covered with a layer of uniform, microparticles with diameters ranging from 2 to 20 μm (FIG. 1B). The high-resolution SEM showed that these microparticles are, in fact, formed from entangled nanofibers (150 to 200 nm in diameter and 2 to 10 μm in length), which beautifully mimicked the micro-to-nanoscale hierarchical morphology on lotus leaves. More impressively, the hierarchical model could be adapted for simulating such an extreme hydrophobicity:",
                        "cos θapp=fs(L/l)D-2 cos θ−fv  (1)",
                        "The value of D (fractal dimension) in three-dimensional space was 2.2618. For the modified glass surface (FIG. 1B), the average value of fs was estimated to be 0.2 (fv=0.8), L is 10 μm and l being 175 nm. The calculated water contact angle was 171°, which matched the experimental determination very well (172±1°). This result affirmed that the extreme hydrophobicity of the modified surfaces should be attributed to the lotus-leaf like micro-to-nanoscale hierarchical roughness.",
                        "Besides the glass surface discussed herein, the coating solution could be applied to many other different materials regardless of roughness, composition and rigidity. Particularly, the coating method described herein was demonstrated on (1) paper (laboratory filter paper), (2) fabric (100% cotton shirting fabric) (3) wood (maple plywood), (4) metal (aluminum thin sheet), and (5) plastics (polyethylene terephthalate, PET) as examples. As shown in FIG. 2, all solid substrates that were treated with the coating solution resulted in high water contact angles (168-171°) and very low sliding angles (0.5°-1.0°). The aforementioned micro-to-nanoscale hierarchical structure was also confirmed on other substrates (e.g., porous filter paper, FIG. 5). Their superior water-repellency property was further illustrated with a movie to show how water droplets bounce off these treated surfaces.",
                        "Besides the superior water-repellent property, the nature of such an unconventional alkylsilane/water reaction was intriguing. As shown in FIG. 3A, an important factor was the amount of water added to the OTS, i.e., at a molar ratio of 1:2 (water:OTS) the best performance was achieved. Less or more water could lead to a decrease in the water contact angle of the treated surface. As mentioned herein, this stoichiometrically-controlled hydrolysis and condensation of OTS was conceptually different from either the monolayer formation with long-chain alkylsilanes (which is performed under a strictly controlled humidity) or the conventional sol-gel processes (which mix less-reactive organosilanes with a bulk amount of water). Although the molar ratio between the two reactants was 1:2, the volume percent of water in the mixture was only ˜2%. After applying mechanical dispersion, such a small amount of water mixed well with OTS and quickly decreased to submicron-to-nanometer sized droplets. This led to the formation of a stable and uniform water-OTS emulsion with the hydrophilic end of OTS molecules orienting towards water droplets and the hydrophobic chain facing outward (FIG. 6A). The continued hydrolysis and subsequent condensation of OTS consumed water and generated HCl gas, which created an acidic condition for further catalyzing the reaction. Consequently, spherical nanoparticles (100-200 nm) were formed with the surface covered with alkyl chains (FIG. 3D, FIG. 7A, and FIGS. 8A and 8B). Next, nanoparticles tend to form head-to-head linear fibers (FIG. 3E and FIG. 7B), because of the energy barriers encountered during aggregation. Then, linear fibers further aggregated and eventually formed microparticles (FIG. 3F, FIG. 6B, and FIG. 7C). This silanization reaction could last for approximately 6 h (FIG. 9), although the highest water contact angle (172°) was achieved after 2 h (FIG. 3B). The continued variation of the resulting water contact angles after this point indicated that the reaction was not complete, i.e., reactive sites (—Si—OH or —Si—Cl) on the particles still existed. Therefore, micro-aggregates could covalently bond to the substrates provided that hydroxyl groups are present, i.e., the particles would bond to the surface and form hierarchical structures. In FIG. 3F, the “FIB-cut” cross-section of a particle that was “anchored” on the substrate surface was shown (also shown in FIG. 7D and FIGS. 10A-10D).",
                        "To examine the composition of the superhydrophobic coatings, Fourier transform infrared (FT-IR) spectroscopy and X-ray photoelectron spectrum (XPS) were acquired on modified aluminum and glass samples, respectively. The band at 1003 cm−1 in the FTIR spectrum was due to the bending vibration of Si—O—Al, which verified the formation of chemical bonding on the surface (FIG. 11). For the XPS results, the C/O/Si atomic ratio changed from 7.41/66.43/26.16% to 86.37/9.10/4.53%. The significant increase in the CIs peak intensity after the modification confirmed the existence of OTS aggregates on the surface (FIG. 12). The hypothesis for the formation of the hierarchic structure was further confirmed by adding HAuCl4 in water when preparing the coating mixture to trace the entire process. The existence of gold elements was detected in the emulsion and therefore verified the presence of water (FIGS. 10A and B) in the fibers formed from siloxane particles. Meanwhile, in between particles, the surface was covered with small particles (FIGS. 10C and 10D). The entire reaction was performed in a controlled manner. The other important fabrication step was the dilution of the stock solution (FIG. 1A), which could utilize common organic solvents (hexane or mineral spirit) of preference. As shown in FIG. 3C the optimal concentration of the dilution was determined to be 5.0% (v/v). This relatively low concentration enables the potential for large-scale fabrication of the coating.",
                        "As mentioned herein, gold nanoparticles could be encapsulated in the coating (FIGS. 10A-10D). To further test and visualize this capability, water-soluble fluorescent dye (Rhodamine B) was tested as a trial luminescent chromophore. The ring-open structure of Rhodamine B makes the molecule polar and soluble in water but not in organic solvents. The solution of Rhodamine B (30 mM), instead of pure water, was added to the OTS in the procedure mentioned herein (FIG. 1A) and the coating mixture was then applied onto laboratory filter paper. The resulted surface displayed a pink color under ambient light; the color remains after washing with water and organic solvents, which indicating that the dye molecules were not physically adsorbed on the surface. As shown in FIG. 4A, a water droplet (dyed with a different water-soluble fluorescent dye, pyranine) sat perfectly atop, which confirmed the unperturbed superhydrophobicity (FIG. 4A, left photo). It was more remarkable that under UV light (λ=254 nm), this superhydrophobic filter paper displayed bright red emission, while strong green fluorescence observed from the water droplet (right picture of FIG. 4A). The reflections from air bubbles trapped under the water droplet validated the Cassie-Baxter wetting state. The fact that the encapsulation of chromophores did not influence either ultrahigh water contact angle or the sliding angle, warranted application potentials such as designing colorful and luminescent waterproof coatings.",
                        "The other intriguing property of superhydrophobic surfaces was the self-cleaning capability, which could be adapted to various daily life scenarios such as building construction, clothing, and machining materials. In FIG. 4B, a series of photos taken at different timeframes demonstrated that a water droplet readily rolled off a slightly tilted (˜0.75°) glass slide prepared as described herein and carried away dust (MnO particles) from the coated surface.",
                        "In addition to the application versatility, mechanical stability was considered as a vital criterion for surface coatings. To apply the coating in daily life, superhydrophobic surfaces were desired to survive under harsh weather conditions. The mechanical stability of surface coatings was tested by sand abrasion and water jetting experiments. As shown in FIG. 4C, the modified superhydrophobic glass substrate remained superhydrophobic (>160°) after sand abrasion (4.5 kJ) for 10 min or water jetting (90 kJ) for 10 min. It was also confirmed that water immersing for three days and tissue wiping for 20 times did not change the surface hydrophobicity significantly (i.e., the water contact angle is maintained above 150°. An abrasion test, in which the modified glass substrate was pressed onto a piece of silicon carbide sandpaper (Grit No. 400) under a pressure of 2.5 kPa, and then abraded for a distance of 50 cm was also conducted (FIG. 13). The glass slide retained a high contact angle (161±2°) and a low sliding angle (˜1°) after the abrasion test. Without wishing to be bound by theory, it is believed that such an exceptional anti-abrasion property could be explained by covalently bound siloxane aggregates on the surface. As shown in FIG. 3F and FIGS. 14A-14D, the SEM image with a FIB cut showed that the hierarchical particles and the solid substrate were “merged” together due to the continued formation of siloxane compounds (as discussed herein). The chemical bonding provided higher stability compared with physical adsorption or deposition, leading to the strengthened robustness of the superhydrophobic coating. In addition, the anti-abrasion property could be also attributed to the fiber-entangled porous structure of the micro-size particles. As illustrated with SEM imaging (FIGS. 15A-15D), the abrasion test partially removed entangled nanofibers at the top surface, but the substrate was still coated with similar hierarchical nano/microstructures. That is, the remaining structure resembled the original surface prior to abrasion (FIG. 16). Thus, the combination of chemical bonding and self-similar structural strategy could achieve the superior anti-abrasion property shown in the present Example. Such mechanically robust coating is useful for building and ship construction, and outdoor gear, which typically sustains harsh conditions from wind, rain, or wear and tear. Further, the coating is also thermally stable. After subjecting coated samples to 50° C. for two weeks, the water contact angle remained high, averaging 157.8°.",
                        "The coating method can be scaled industrially, which is a key factor in practice. To mimic the mass production of such coating in clothing industry, a cotton T-shirt was treated with the coating solution and exhibited an excellent water repellency (FIG. 4D). Water (with green dye) readily bounced off the surface, leaving the T-shirt clean and dry. It was noteworthy that the superhydrophobic fabrics retained good air permittivity, augmenting the potential to make commercial waterproof, breathable coating products from porous and flexible materials. FIGS. 17A-17C demonstrates gas penetration into a fabric, where the generated H2S gas could penetrate through the fabric, reach the other side of fabric, react with CuSO4 and form the dark color CuS.",
                        "A comparison of two alternative application methods was carried out: dipping the substrate into the coating solution and spraying the coating solution onto the substrate. For any same type of solid materials, no significant differences were observed in the wetting performance when different methods were used to prepare the samples. Different organic solvents were tested (FIG. 18) were tested for the preparation of a spray solution, and it was found that the wetting performance was better using solvents with lower polarity. A widely used spray coating solvent, mineral spirit, was employed in an exemplary dilution step (FIG. 1A-4). The performance of the spray coated samples was compared with coating products from several commercial brands, namely Wood™, Grangers®, Kiwi®, Nikwax®, Neverwet™ and Scotchgard™, on glass and cotton fabrics. The surfaces treated with the coating solution of the present Example (sprayed and air dried for 2 h) showed superior waterproof properties, and superhydrophobicity was achieved on both types of material (162°-165°). On the other hand, the tested commercial products reached the level of hydrophobicity (900 to 120°). The coating solution was also sprayed on a large piece of pine wood (0.3 m×0.5 m) to further demonstrate the scale-up capability; as shown in FIG. 4D (right), water would not stick to the treated wood surface and ran off readily.",
                        "The aging effect, anti-icing property, and cost-effectiveness of the coating solution were examined. After exposure to ambient conditions for 18 months, the coating applied on a number of surfaces demonstrated no sign of degradation. Particularly, treated cotton fabric and plywood samples tested after various periods of storage time consistently remained superhydrophobic (FIG. 19).",
                        "The cost for producing large waterproof surfaces with the present coating method was inexpensive since there were no intricate instrumentation nor expensive materials involved in the production process. It was estimated that more than 100 kg of the coating solution could be produced with a material cost of about 300 US$ and the production could be carried out per operator on a daily basis under ambient conditions. Furthermore, this new protocol is based on a simple, mild hydrolysis and condensation reaction of organosilanes. The only byproduct is HCl gas, which could be recycled for producing the precursor. Therefore, there is minimal environmental impact, and the simple synthesis and instrument-free production warrant large-scale industrial production.",
                        "Comparing with other state-of-the-art coating methods, the present method used only OTS and water to create hierarchical micro/nanostructure template with low surface tension in a single step and demonstrated superior wettability and anti-abrasion property compared to existing technology. In comparison, most other existing strategies relied on the modification of “pre-made” rough structures with low surface tension coatings. Therefore, with the present unique stoichiometric salinization approach the fabrication procedure is simplified, the chemical reagents are readily accessible, and the preparation is scalable for industrial applications.",
                        "Other alkyltrichlorosilanes were also tested to compare the resulting wetting property of treated samples with that of OTS. It was found that alkyltrichlorosilanes with slightly shorter chains, namely hexadecyltrichlorosilane (HTS, C16) and dodecyltrichlorosilane (DTS, C12), could be adapted with the same protocol developed for OTS to modify various solid substrates. The much shorter ones, such as methyltrichlorosilane (MTS), were more reactive and could be used with the exact same protocol. A summary of the resulting wettability for filter paper modified with alkyltrichlorosilanes of varying chain lengths was presented in FIG. 20. The stoichiometric silanization with HTS (C16) and DTS (C12) could modify filter papers to be hydrophobic (137±5° and 125±6°). The modification with other types of organosilanes (e.g., trichloro(1H,1H,2H,2H-perfluorooctyl)silane, trimethoxyoctadecylsilane) was explored as well, however, their hydrolysis reaction was too slow; for example, they could not effectively form micelles in the presence of the stochiometric amount of water.",
                        "Anti-icing property was investigated. The tests indicated that ice formed with the same amount of water (30 μL) had less contact with the modified superhydrophobic substrate (FIGS. 21A and 21B), the adhesive force decreased ˜30%, from 895±69 kPa to 636±36 kPa. The present coating therefore exhibited anti-icing property.",
                        "In summary, the developed superhydrophobic coating technique, based on an unconventional, stoichiometrically controlled aggregation of organosilanes, was a versatile and practical method for surface modification at industrial scales for real-life applications. This protocol removed many limitations of existing waterproof coating methods, such as expensive materials and time-consuming preparation procedures.",
                        "By example and without limitation, embodiments are disclosed according to the following enumerated paragraphs:",
                        "A1. An article, comprising:\n\n\n- - a hydrophobic coating comprising a microparticle,\n  - wherein:\n    - the microparticle is disposed on and covalently bound to a surface\n      of the article,\n    - the microparticle is porous and comprises a hierarchical\n      morphology,\n    - the microparticle comprises an agglomerated plurality of fibers,\n      and\n    - the fiber comprises a C₁₂-C₁₈ alkylhalosiloxane, a C₆-C₁₈\n      fluoroalkylhalosiloxane, or any combination thereof.",
                        "A2. The article of Paragraph A1, wherein the fiber consists essentially of the C12-C18 alkylhalosiloxane, or any combination thereof.",
                        "A3. The article of Paragraph A1, wherein the fiber comprises a C12-C18 alkylchlorosiloxane.",
                        "A4. The article of Paragraph A1, wherein the fiber comprises a C18 alkylhalosiloxane.",
                        "A5. The article of Paragraph A1 or Paragraph A4, wherein the fiber comprises a C18 alkylchlorosiloxane.",
                        "A6. The article of any one of Paragraphs A1, A2, and A4, wherein the C12-C18 alkylhalosiloxane or the C18 alkylhalosiloxane comprises less than 3 halo substituents per Si atom.",
                        "A7. The article of any one of the preceding Paragraphs, wherein the fiber has an average diameter of from 50 nm to 10000 nm.",
                        "A8. The article of any one of the preceding Paragraphs, wherein the fiber comprises a nanofiber having an average diameter of from 50 nm to less than 1000 nm.",
                        "A9. The article of any one of the preceding Paragraphs, wherein the microparticle has an average diameter of from 0.1 μm to 1000 μm.",
                        "A10. The article of any one of the preceding Paragraphs, wherein the hydrophobic coating has a water contact angle of from 900 to 180°.",
                        "A11. The article of any one of the preceding Paragraphs, wherein the microparticle comprises pores having a maximum dimension of from 0.05 μm to 1 μm.",
                        "A12. The article of any one of the preceding Paragraphs, wherein the microparticle further encapsulates a small molecule.",
                        "A13. The article of any one of the preceding Paragraphs, wherein the coating comprises a density of from 1 to 10,000,000,000 microparticles per square centimeter.",
                        "A14. The article of any one of the preceding Paragraphs, wherein the fibers are physically entangled and chemically crosslinked.",
                        "A15. The article of any one of the preceding Paragraphs, wherein the surface comprises fabric, glass, wood, plastic, metal, leather, suede, fiberglass, or any combination thereof.",
                        "A16. The article of any one of the preceding Paragraphs, wherein the article is self-cleaning.",
                        "A17. The article of any one of the preceding Paragraphs, wherein the article comprises a fabric and is permeable to gas (e.g., water vapor).",
                        "A18. A hydrophobic coating formulation, comprising:\n\n\n- - a suspension, comprising a microparticle suspended in a continuous\n    phase,\n  - wherein\n    - the microparticle is porous and comprises a hierarchical\n      morphology,\n    - the microparticle comprises an agglomerated plurality of fibers,\n      and\n    - the fiber comprises a C₁₂-C₁₈ alkylhalosiloxane, a C₆-C₁₈\n      fluoroalkylhalosiloxane, or any combination thereof; and\n  - wherein the continuous phase comprises an organic solvent, an\n    alkyltrihalosilane, or a combination thereof.",
                        "A19. A method of making a hydrophobic coating, comprising:\n\n\n- - providing a mixture of water, and a C₁₂-C₁₈ alkyltrihalosilane\n    and/or a C₆-C₁₈ fluoroalkyltrihalosilane;\n  - mixing the mixture to provide an emulsion of nanodroplets comprising\n    a diameter of from 1 nm to 1000 nm;\n  - reacting the water, and the C₁₂-C₁₈ alkyltrihalosilane and/or a\n    C₆-C₁₈ fluoroalkyltrihalosilane in the mixture to provide a\n    plurality of fibers comprising C₁₂-C₁₈ alkylhalosiloxane and/or\n    C₆-C₁₈ fluorohalosiloxane; and\n  - agglomerating the plurality of fibers to provide porous\n    microparticles suspended in C₁₂-C₁₈ alkyltrihalosilane and/or C₆-C₁₈\n    fluoroalkyltrihalosilane.",
                        "A20. The method of Paragraph A19, wherein the emulsion comprises water nanodroplets in a continuous phase of the C12-C18 alkyltrihalosilane.",
                        "A21. The method of Paragraph A19 or Paragraph A20, wherein the mixture comprises a mole ratio of from 0.01:1 to 10:1 water:C12-C18 alkyltrihalosilane.",
                        "A22. The method of any one of Paragraph A19 to Paragraph A21, wherein the mixture comprises a mole ratio of 1:2 water:C12-C18 alkyltrihalosilane.",
                        "A23. The method of any one of Paragraphs A19 to A22, wherein the mixture comprises from 0.01% to 10% by volume of water in C12-C18 alkyltrihalosilane.",
                        "A24. The method of any one of Paragraph A19 to Paragraph A23, wherein the mixture comprises 2% by volume of water in C12-C18 alkyltrihalosilane.",
                        "A25. The method of any one of Paragraph A19 to Paragraph A24, wherein mixing the mixture comprises one or more steps of vortexing at an rpm of from 10 to 10000 for a duration of from 0.1 s to 1 h, one or more steps of ultrasonicating at a frequency of 5 kHz to 50 MHz for a duration of from 0.1 s to 1 h, or a combination thereof.",
                        "A26. The method of any one of Paragraph A19 to Paragraph A25, wherein mixing the mixture comprises vortexing at an rpm of from 100 to 10000 for a duration of from 0.1 s to 1 h, ultrasonicating at a frequency of 5 kHz to 50 MHz for a duration of from 0.1 s to 1 h, then vortexing the mixture at an rpm of from 10 to 10,000 for a duration of from 0.1 s to 1 h.",
                        "A27. The method of any one of Paragraph A19 to Paragraph A26, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and agglomerating the fibers together occur over a duration for from 0.1 second to 10,000 minutes.",
                        "A28. The method of any one of Paragraph A19 to A27, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and/or agglomerating the fibers is conducted at a temperature of 0° C. to 200° C., at a pressure of from 10 kPa to 10 mPa.",
                        "A29. The method of any one of Paragraph A19 to A28, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and/or agglomerating the fibers is conducted at a temperature of about 20° C. to 25° C., at 1 atmosphere.",
                        "A30. A method of making a hydrophobic article, comprising:\n\n\n- - diluting a suspension of microparticles of any one of Paragraph A18\n    to A29 in an organic solvent to provide a dilution of\n    microparticles; and\n  - applying the dilution of microparticles to a surface of an article\n    to provide the hydrophobic article.",
                        "A31. The method of Paragraph A30, wherein applying the dilution comprises dipping the article in the dilution of microparticles, spraying the dilution of microparticles onto the surface of the article, painting the dilution of microparticles onto the surface of the article, or any combination thereof.",
                        "While illustrative embodiments have been illustrated and described, it will be appreciated that various changes can be made therein without departing from the spirit and scope of the disclosure."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "prepare coating mixture",
                        "describe trial experiment of adding water to OTS",
                        "discuss modification of standard microscope glass slides",
                        "measure water contact angle and sliding angle",
                        "test dynamic water-repellency property",
                        "describe formation of microparticles on glass surface",
                        "apply coating solution to various materials",
                        "measure water contact angles and sliding angles on different substrates",
                        "illustrate superior water-repellency property",
                        "discuss nature of alkylsilane/water reaction",
                        "examine effect of water amount on OTS reaction",
                        "describe formation of stable and uniform water-OTS emulsion",
                        "discuss continued hydrolysis and condensation of OTS",
                        "form spherical nanoparticles with alkyl chains",
                        "form head-to-head linear fibers",
                        "form microparticles",
                        "discuss silanization reaction",
                        "examine composition of superhydrophobic coatings",
                        "acquire FT-IR spectroscopy and XPS results",
                        "verify formation of chemical bonding on surface",
                        "confirm existence of OTS aggregates on surface",
                        "discuss fabrication step of dilution of stock solution",
                        "determine optimal concentration of dilution",
                        "encapsulate gold nanoparticles in coating",
                        "test and visualize capability of encapsulation",
                        "discuss self-cleaning capability of superhydrophobic surfaces",
                        "test mechanical stability of surface coatings",
                        "perform sand abrasion and water jetting experiments",
                        "test water immersing and tissue wiping",
                        "perform abrasion test",
                        "discuss anti-abrasion property",
                        "discuss thermal stability of coating",
                        "scale up coating method industrially",
                        "compare alternative application methods",
                        "test different organic solvents for spray solution",
                        "compare with commercial products",
                        "discuss aging effect, anti-icing property, and cost-effectiveness",
                        "define fiber diameter range",
                        "define nanofiber diameter range",
                        "define microparticle diameter range",
                        "define hydrophobic coating properties",
                        "define microparticle pore size",
                        "define microparticle encapsulation",
                        "define coating density",
                        "define fiber entanglement and crosslinking",
                        "define surface materials",
                        "define article properties",
                        "describe methods of making hydrophobic coating and article"
                    ],
                    "num_characters": 24799,
                    "outline_medium": [
                        "prepare coating mixture",
                        "describe trial experiment of adding water to OTS",
                        "describe modification of standard microscope glass slides",
                        "measure water contact angle and sliding angle",
                        "describe dynamic test with water droplet",
                        "describe SEM image of microparticles",
                        "apply coating solution to various materials",
                        "describe water contact angles and sliding angles on different substrates",
                        "describe nature of alkylsilane/water reaction",
                        "describe effect of water amount on water contact angle",
                        "describe formation of stable and uniform water-OTS emulsion",
                        "describe formation of spherical nanoparticles and microparticles",
                        "describe silanization reaction and formation of hierarchical structures",
                        "examine composition of superhydrophobic coatings using FT-IR and XPS",
                        "describe encapsulation of gold nanoparticles and fluorescent dye",
                        "describe self-cleaning capability of superhydrophobic surfaces",
                        "test mechanical stability of surface coatings",
                        "discuss application versatility and industrial scalability",
                        "define hydrophobic coating formulations",
                        "describe methods of making hydrophobic coatings",
                        "specify properties of fibers and microparticles",
                        "outline methods of making hydrophobic articles",
                        "provide general statements on embodiments"
                    ],
                    "outline_short": [
                        "prepare coating mixture",
                        "apply coating to various surfaces",
                        "describe water-repellent properties",
                        "explain formation of hierarchical structure",
                        "analyze composition of superhydrophobic coatings",
                        "demonstrate self-cleaning capability",
                        "test mechanical stability",
                        "scale up coating method industrially",
                        "compare with other coating methods",
                        "define hydrophobic coating embodiments",
                        "describe methods of making hydrophobic coatings and articles"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An article, comprising:\na hydrophobic coating comprising a microparticle,\nwherein:\nthe microparticle is disposed on and covalently bound to a surface of the article,\nthe microparticle is porous and comprises a hierarchical morphology,\nthe microparticle comprises an agglomerated plurality of fibers, and\nthe fiber comprises a C12-C18 alkylhalosiloxane, a C6-C18 fluoroalkylhalosiloxane, or any combination thereof.",
        "2. The article of claim 1, wherein the fiber consists essentially of the C12-C18 alkylhalosiloxane, or any combination thereof.",
        "3. The article of claim 1, wherein the fiber comprises a C12-C18 alkylchlorosiloxane.",
        "4. The article of claim 1, wherein the fiber comprises a C18 alkylhalosiloxane.",
        "5. The article of claim 1, wherein the fiber comprises a C18 alkylchlorosiloxane.",
        "6. The article of claim 1 wherein the C12-C18 alkylhalosiloxane or the C18 alkylhalosiloxane comprises less than 3 halo substituents per Si atom.",
        "7. The article of claim 1, wherein the fiber has an average diameter of from 50 nm to 10000 nm.",
        "8. The article of claim 1, wherein the fiber comprises a nanofiber having an average diameter of from 50 nm to less than 1000 nm.",
        "9. The article of claim 1, wherein the microparticle has an average diameter of from 0.1 μm to 1000 μm.",
        "10. The article of claim 1, wherein the hydrophobic coating has a water contact angle of from 900 to 180°.",
        "11. The article of claim 1, wherein the microparticle comprises pores having a maximum dimension of from 0.05 μm to 1 μm.",
        "12. The article of claim 1, wherein the microparticle further encapsulates a small molecule.",
        "13. The article of claim 1, wherein the coating comprises a density of from 1 to 10,000,000,000 microparticles per square centimeter.",
        "14. The article of claim 1, wherein the fibers are physically entangled and chemically crosslinked.",
        "15. The article of claim 1, wherein the surface comprises fabric, glass, wood, plastic, metal, leather, suede, fiberglass, or any combination thereof.",
        "16. The article of claim 1, wherein the article is self-cleaning.",
        "17. The article of claim 1, wherein the article comprises a fabric and is permeable to gas",
        "18. A hydrophobic coating formulation, comprising:\na suspension, comprising a microparticle suspended in a continuous phase,\nwherein\nthe microparticle is porous and comprises a hierarchical morphology,\nthe microparticle comprises an agglomerated plurality of fibers, and\nthe fiber comprises a C12-C18 alkylhalosiloxane, a C6-C18 fluoroalkylhalosiloxane, or any combination thereof; and\n\nwherein the continuous phase comprises an organic solvent, an alkyltrihalosilane, or a combination thereof.",
        "19. A method of making a hydrophobic coating, comprising:\nproviding a mixture of water, and a C12-C18 alkyltrihalosilane and/or a C6-C18 fluoroalkyltrihalosilane;\nmixing the mixture to provide an emulsion of nanodroplets comprising a diameter of from 1 nm to 1000 nm;\nreacting the water, and the C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosilane in the mixture to provide a plurality of fibers comprising C12-C18 alkylhalosiloxane and/or C6-C18 fluoroalkylhalosiloxane; and\nagglomerating the plurality of fibers to provide porous microparticles suspended in C12-C18 alkyltrihalosilane and/or C6-C18 fluoroalkyltrihalosilane.",
        "20. The method of claim 19, wherein the emulsion comprises water nanodroplets in a continuous phase of the C12-C18 alkyltrihalosilane.",
        "21. The method of claim 19, wherein the mixture comprises a mole ratio of from 0.01:1 to 10:1 water:C12-C18 alkyltrihalosilane.",
        "22. The method of claim 19, wherein the mixture comprises a mole ratio of 1:2 water:C12-C18 alkyltrihalosilane.",
        "23. The method of claim 19, wherein the mixture comprises from 0.01% to 10% by volume of water in C12-C18 alkyltrihalosilane.",
        "24. The method of claim 19, wherein the mixture comprises 2% by volume of water in C12-C18 alkyltrihalosilane.",
        "25. The method of claim 19, wherein mixing the mixture comprises one or more steps of vortexing at an rpm of from 10 to 10,000 for a duration of from 0.1 s to 1 h, one or more steps of ultrasonicating at a frequency of 5 kHz to 50 MHz for a duration of from 0.1 s to 1 h, or a combination thereof.",
        "26. The method of claim 19, wherein mixing the mixture comprises vortexing at an rpm of from 100 to 10,000 for a duration of from 0.1 s to 1 h, ultrasonicating at a frequency of 5 kHz to 50 MHz for a duration of from 0.1 s to 1 h, then vortexing the mixture at an rpm of from 10 to 1000 for a duration of from 0.1 s to 1 h.",
        "27. The method of claim 19, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and agglomerating the fibers together occur over a duration for from 0.1 second to 10,000 minutes.",
        "28. The method of claim 19, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and/or agglomerating the fibers is conducted at a temperature of 0° C. to 200° C., at a pressure of from 10 kPa to 10 mPa.",
        "29. The method of claim 19, wherein the steps of reacting the water and the C12-C18 alkyltrihalosilane to provide the fibers and/or agglomerating the fibers is conducted at a temperature of about 20° C. to 25° C., at 1 atmosphere.",
        "30. A method of making a hydrophobic article, comprising:\ndiluting a suspension of microparticles of claim 18 in an organic solvent to provide a dilution of microparticles; and\napplying the dilution of microparticles to a surface of an article to provide the hydrophobic article.",
        "31. The method of claim 30, wherein applying the dilution comprises dipping the article in the dilution of microparticles, spraying the dilution of microparticles onto the surface of the article, painting the dilution of microparticles onto the surface of the article, or any combination thereof."
    ]
}