{
    "id": "US20220187173",
    "authors": [
        "Valentina Cappello",
        "Giovanni Signore",
        "Sebastiano Di Pietro",
        "Melissa Santi",
        "Aldo Moscardini",
        "Mauro Gemmi"
    ],
    "title": "CONTRAST SOLUTION FOR THE CHARACTERISATION OF BIOLOGICAL SAMPLES BY ELECTRON OR CORRELATIVE MICROSCOPY",
    "date": "2020-01-24 00:00:00",
    "abstract": "The invention relates to a solution comprising: a heteropolyacid and a lanthanide salt in a solvent consisting of a water/organic solvent mixture or an organic solvent. Optionally, the solution can also comprise an organic or inorganic buffer with a pH comprised in the interval of 4-6 or a strong base or acid. The object of the present invention also includes a use of said solution and any products of the reaction between the components thereof as a contrast medium for biological samples and a method for preparing biological samples that uses said solution in at least one step, for analysis by either correlative microscopy (CLEM) and electron microscopy (EM).",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present invention relates to the field of substances used in the preparation of biological samples that must be characterised by means of electron or correlative microscopy. More precisely, the invention relates to a contrast solution that is alternative to uranyl acetate for the characterisation of biological samples by either correlative microscopy (CLEM) or electron microscopy (EM)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce field of substances for biological sample characterisation"
                    ],
                    "num_characters": 392,
                    "outline_medium": [
                        "introduce field of substances for biological sample characterisation"
                    ],
                    "outline_short": [
                        "introduce field of substances for biological sample characterisation"
                    ]
                },
                {
                    "title": "PRIOR ART",
                    "paragraphs": [
                        "In recent years, correlative microscopic characterisation methods have attracted great interest in the field of diagnosis and research, thanks above all to the possibility of integrating information coming from different microscopic methods. One of the most interesting techniques is so-called correlative light-electron microscopy (CLEM), a technology that combines fluorescence microscopy (FM) or light microscopy (LM) and electron microscopy (EM). This technique enables the extrapolation, from a single sample, of data that are normally not correlatable with one another, thus introducing the possibility of simultaneously comprehending the function and structure of the biological samples analysed in a single experiment. For example, the CLEM technique can be used to obtain the location of specific molecules within a cell and tissue sample to be correlated with information relating to the ultrastructure of the sample. As in the case of biological sample characterisation by “conventional” electron microscopy, the CLEM technique requires that the ultrastructure and contrast be preserved, but at the same time the use of this technique introduces the need to preserve the fluorescence signal of the samples. In order to attain this objective, one of the aspects to be taken into consideration regards the fact that the ultrastructure of the sample must be completely preserved by fixing. Fixing operations are generally based on physical and/or chemical approaches (generally comprising treatment with aldehydes—chemical; or freezing processes—physical) implemented for the purpose of fixing the molecules present in the biological sample in their natural state and in the position in which they are found in vivo, while preventing their decomposition at the same time.",
                        "In the case of the CLEM technique, the optimal fixing approach appears to be high-pressure freezing/substitution of water with an organic solvent at cryogenic temperatures (HPF/FS—high-pressure freezing/freeze substitution). This technique is based on reducing the overall concentration of aldehyde compounds and, by exploiting the cryogenic approach, i.e. a physical fixing method, it enables the fluorescence signal to be preserved while simultaneously maintaining intact the ultrastructure of the biological samples analysed.",
                        "However, this and other similar approaches presently used in the sector do not produce satisfactory results in the case of correlative microscopy, since they do not provide contrast that is sufficient to allow visualisation of the sample by electron microscopy (EM) and necessarily require the presence of contrast agents containing heavy atoms.",
                        "As is well known, in electron microscopy the contrast depends on the atomic number of the atoms present in the sample. The higher the atomic number is, the more scattered the electrons will be and the greater the contrast obtained. Biological molecules are composed of atoms with a very low atomic number (carbon, hydrogen, oxygen, nitrogen, phosphorous, sulphur, etc.) and, for this reason, high concentrations of contrast agents containing heavy metals are generally used.",
                        "In the prior art, the contrast medium (or contrast agent) of reference conventionally used as a contrast medium for biological samples in electron microscopy is uranyl acetate. However, the radioactive nature of uranyl acetate and the derivatives thereof causes severe restrictions from a safety standpoint. Furthermore, the delivery and disposal of uranyl acetate derivatives is extremely costly due to the increasingly strict regulations they are subject to.",
                        "Furthermore, this type of contrast agent is unsuitable for optical microscopy and thus also for correlative microscopy, due both to an ample background (auto)fluorescence in the red and green region of the spectrum and the quenching action of the majority of synthetic and protein-based fluorophores on the fluorescence signal.",
                        "On the basis of these considerations, it is clear that the use of traditional contrast agents based on uranyl acetate has two opposite effects on the sample: on the one hand, it enables better visualisation in the case of electron microscopy, on the other hand it negatively influences the optical detection of fluorescence, thus inhibiting the possibility of carrying out correlative microscopy experiments.",
                        "Nonetheless, to date uranyl acetate remains the contrast agent most commonly used also for correlative purposes, even though it is not optimal for this technique, as it must be used in relatively high concentrations which, because of the high background signal, are not fully compatible with fluorescence-based techniques. In this regard, in the present state of the art, the most commonly used expedient is to maintain the concentration of the contrast agent as low as possible, to the detriment, however, of sample contrast, since it is known that uranyl acetate (UA) does not provide satisfactory results if used at low concentrations.",
                        "As regards the presently commercially available contrast media that are alternatives to uranyl acetate (such as, for example, “Uranyless”, “336 uranyl acetate alternative”, “NanoW” and “platinum blue”), although they enable the problem of handling radioactive materials to be overcome, they perform poorly in terms of contrast efficiency and their use is thus even more disadvantageous in the case of correlative microscopy.",
                        "Therefore, there is a strongly felt need in the sector to identify contrast media that are suitable both in the case of conventional electron microscopy and correlative microscopy, and above all to identify contrast media that are not derived from depleted uranium and show a greater contrast efficiency than the uranyl acetate used until now, but which can at the same time give satisfactory results in fluorescence microscopy and thus also be used in correlative microscopy experiments.",
                        "Biological sample contrast and negative contrast procedures using substances other than uranyl acetate and the analogues thereof (for example, uranyl formate) have been studied and developed since the beginning of the 1970s. The procedures currently most widely used as alternatives to uranyl acetate are described in the publication Basic techniques for transmission electron microscopy (M. A. Hayat, Academic Press, 1986) and are mainly based on the use of transition metals.",
                        "Possible contrast media that can substitute for uranyl acetate and have properties similar to that compound have recently been the subject of study. For example, in the study New versatile staining reagents for biological transmission electron microscopy that substitute for uranyl acetate. Nakatoshi et al. Journal of Electron Microscopy 60(6): 401-407 (2011), the authors tested samarium and gadolinium in the form of acetate salts for contrasting both animal samples and plant samples, since the dimensions of these two elements in terms of atomic radius are similar to those of uranium. In the discussion of the results, it is stated that the tested compounds could be excellent substitutes for uranyl acetate in thin section contrast (post-sectioning staining), but, as regards contrast efficiency, they provided only fair results. Furthermore, the tested compounds demonstrated to be devoid of the fixative properties of uranyl acetate.",
                        "In order to improve the contrasting capability of the tested compounds, the authors suggest the inclusion of supplementary substances that could have a positive influence. However, in the prior art it is difficult to identify substances which, when added to lanthanide salts, are capable of forming chemically stable solutions with a low chemical risk and which make it possible to obtain better images, at least as far as electron microscopy is concerned, or at least ones that are comparable to those obtainable with uranyl acetate. In this regard, phosphotungstic acid (abbreviated with the acronym PTA) has very often been used with good results in optical microscopy as a stain in combination with other substances, as is reported, for example, in patent application GB2372811. In this document, PTA is used in an alcoholic solution combined with eosin or synthetic azo dyes, but in no case with lanthanides or salts thereof. Considering, on the other hand, the use of PTA in contrast techniques in transmission electron microscopy (TEM), the scientific publication Examination of electron stains as a substitute for uranyl acetate for the ultrathin sections of bacterial cells. Tgamuchu et al. Journal of Electron Microscopy 59(2): 113-118 (2010) reports a comparative study between PTA and other contrast agents that are alternatives to uranyl acetate. From this study it emerges that none of the tested compounds (namely, in addition to PTA, platinum blue, oolong tea extract and potassium permanganate) provide contrast results comparable to those of uranyl acetate. In particular, PTA provided low quality images in tests with both Gram-positive and Gram-negative bacteria.",
                        "Patent WO2017/017428 relates to the preparation of samples, in particular histological samples, for the characterisation thereof by scanning electron microscopy (SEM) or transmission electron microscopy (TEM). In particular, this publication envisages the possibility of incorporating a secondary electron generator (such as, for example, a compound selected from among AlCl3, TiCl3, TiCl4, CrCl3, GaCl3, YCl3, MoCl3, AgCl, InCl3, SbCl3, HfCl3, TaCl3, WCl3, OsCl3, IrCl3, AuCl, HauCl4, HgCl2, CeCl3, NdCl3 and ErCl3) and possibly a contrast agent (such as, for example, phosphotungstic acid, phosphomolybdic acid, lanthanum nitrate and/or a combination thereof) into the sample to be analysed, for the purpose of increasing the resolution of the images obtained by electron microscopy. Said patent also envisages the possibility of incorporating a self-healing material in order to reduce the possible collateral damage caused to the sample during imaging.",
                        "None of these alternatives, however, have yet been thoroughly tested in the field of correlative microscopy, since, as mentioned previously, the contrast agents presently available for electron microscopy are not always suitable for an optimal implementation of the CLEM technique. In fact, an ideal contrast agent in this field must be able to completely preserve the contrast also at relatively low concentrations, while at the same time enabling an excellent sensitivity in fluorescence measurements.",
                        "The present invention solves this problem by providing a solution based on lanthanide salts and heteropolyacids and a use thereof as a contrast solution both in correlative microscopy (CLEM) and in conventional electron microscopy (EM).",
                        "The Applicant has in fact found that by combining lanthanide salts with heteropolyacids, which are generally used in optical microscopy, but at the same time considered to perform poorly in electron microscopy, it is possible to obtain a contrast efficiency that is not only comparable to that of the standard uranyl acetate, but even better.",
                        "The Applicant has thus developed a new contrast agent comprising a heteropolyacid and a lanthanide salt in a suitable water/organic solvent mixture or an organic solvent, which benefits from a synergistic effect between the aforesaid ingredients. The surprising results obtained demonstrate that the contrast solution of the present invention not only provides better results than other contrast solutions that are alternatives to uranyl acetate, but even surpasses the performance of uranyl acetate itself in terms of contrast efficiency, while maintaining a good level of the signal in fluorescence images. In fact, the better efficiency of the contrast solution of the present invention enables its use also in low concentrations, thus preserving the possibility of characterisation by correlative microscopy.",
                        "The solution of the present invention can thus substitute for the commercial alternatives presently available on the market of contrast agents for both correlative CLEM characterisation and EM characterisation, and furthermore represents an economical alternative to the uranyl acetate-based contrast agents presently on the market."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce correlative microscopy",
                        "describe CLEM technique",
                        "explain need for preserving ultrastructure and contrast",
                        "describe fixing operations",
                        "introduce HPF/FS technique",
                        "explain limitations of HPF/FS",
                        "describe need for contrast agents",
                        "explain atomic number and contrast",
                        "introduce uranyl acetate",
                        "describe limitations of uranyl acetate",
                        "introduce alternative contrast agents",
                        "describe limitations of alternative contrast agents",
                        "introduce samarium and gadolinium",
                        "describe results of samarium and gadolinium",
                        "suggest supplementary substances",
                        "introduce phosphotungstic acid",
                        "describe use of phosphotungstic acid in optical microscopy",
                        "describe use of phosphotungstic acid in TEM",
                        "introduce patent WO2017/017428",
                        "describe preparation of samples for SEM or TEM",
                        "introduce secondary electron generator",
                        "describe contrast agents",
                        "describe self-healing material",
                        "summarize limitations of prior art"
                    ],
                    "num_characters": 12190,
                    "outline_medium": [
                        "introduce correlative microscopy",
                        "describe CLEM technique",
                        "explain need for contrast agents",
                        "describe limitations of uranyl acetate",
                        "discuss alternative contrast agents",
                        "describe phosphotungstic acid",
                        "discuss use of lanthanides as contrast agents",
                        "describe patent WO2017/017428",
                        "discuss limitations of prior art contrast agents",
                        "describe need for new contrast agent",
                        "introduce lanthanide salts and heteropolyacids",
                        "describe surprising results of new contrast agent"
                    ],
                    "outline_short": [
                        "describe correlative microscopy technique",
                        "explain need for contrast agents in electron microscopy",
                        "discuss limitations of uranyl acetate",
                        "describe alternative contrast agents",
                        "discuss their limitations",
                        "highlight need for new contrast agents"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a solution comprising: a heteropolyacid and a lanthanide salt in a solvent consisting of a water/organic solvent mixture or an organic solvent. Optionally, the solution can also comprise an organic or inorganic buffer with a pH comprised in the interval of 4-6 or a strong base or acid. The object of the present invention also includes a use of said solution and of any products of the reaction between the components thereof as a contrast medium for biological samples and a method for preparing biological samples which uses said solution in at least one step, for analysis by either correlative microscopy (CLEM) or conventional electron microscopy (EM)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce solution comprising heteropolyacid and lanthanide salt"
                    ],
                    "num_characters": 691,
                    "outline_medium": [
                        "introduce solution comprising heteropolyacid and lanthanide salt"
                    ],
                    "outline_short": [
                        "introduce solution comprising heteropolyacid and lanthanide salt"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "“Conventional electron microscopy”, means microscopy that does not exploit light as the source of radiation, but rather an electron beam. Examples of “conventional electron microscopy” are scanning electron microscopy (SEM) and transmission electron microscopy (TEM). The term “conventional electron microscopy” is thus used, for the purposes of the present invention, as a synonym of “electron microscopy (EM)” according to the definition given above.",
                        "“Organic solvent”, for the purposes of the present invention, means any organic solvent having a degree of purity, relative to the content of organic and inorganic compounds, comprised between 70 and 100% (v/v) (so-called “absolute”), and having a water content comprised between 50 and 0% (v/v) (so-called “anhydrous”).",
                        "In a first aspect, the present invention relates to a solution comprising:\n\n\n- - a) a heteropolyacid with the general formula H₃PM₁₂O₄₀, wherein M is\n    tungsten or molybdenum;\n  - b) a lanthanide salt with the general formula Ln(III)A_(x)\\*nH₂O,\n    wherein Ln is an element belonging to the series of lanthanides\n    other than promethium, A is an organic or inorganic anion, x is a\n    whole number greater than or equal to 1, and n is a whole number\n    greater than or equal to 0;\n  - c) a solvent consisting of a water/organic solvent mixture or an\n    organic solvent, wherein said organic solvent is selected from a\n    ketone and an alcohol and, in the case of a water/organic solvent\n    mixture, is present in an amount comprised from 1 to 99% (v/v),\n    preferably from 20 to 99% (v/v), more preferably from 90 to 95%\n    (v/v) relative to the total volume of the mixture in the case of\n    ketone, or in an amount comprised from 71 to 99% (v/v), preferably\n    from 80 to 95% (v/v), more preferably from 90% to 95% (v/v) relative\n    to the total volume of the mixture in the case of alcohol.",
                        "The heteropolyacid, or complex acid, as per point a) is preferably phosphotungstic acid, with the formula H3PW12O40, or phosphomolybdic acid, with the formula H3PMo12O40, which are commercially available, or known precursors thereof containing phosphorous and tungsten or phosphorous and molybdenum, such as, for example: sodium tungstate with the formula Na2WO4 or sodium molybdate with the formula Na2MoO4, both to be mixed with orthophosphoric acid and hydrochloric acid. The lanthanide salt as per point b) preferably has an element selected from ytterbium, europium, terbium and gadolinium as a cation; ytterbium is particularly preferred.",
                        "The corresponding anion is preferably a halide, even more preferably it is chloride. The lanthanide salt can be either in an anhydrous form, in the event that n is equal to 0, or in a hydrated form. In the latter case, said salt preferably contains a number n equal to 6 molecules of water of crystallisation.",
                        "The molar ratio between the component a) and the component b) of the present solution (b/a molar ratio) is preferably comprised in the interval of 0.1-100, preferably 1-50, even more preferably 1-15.",
                        "The concentration of the component b) in the solvent c) is preferably comprised from 0.01 to 250 mM, preferably from 0.1 to 100 mM, even more preferably from 1 to 50 mM. Outside these intervals, in fact, one observes an increase in the nonspecific contrast of the samples, which leads to a reduction in the signal-to-noise ratio.",
                        "In a preferred embodiment of the invention, the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is a ketone and wherein, in the case of the water/organic solvent mixture, the organic solvent is present in an amount comprised from 1 to 99% (v/v), preferably from 20 to 99% (v/v), more preferably from 90 to 95% (v/v) relative to the total volume of the water/ketone mixture.",
                        "Said ketone is selected from a ketone with a number of carbon atoms comprised from 1 to 4, preferably from 1 to 3. Preferably, said ketone is acetone.",
                        "In one embodiment of the invention, the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is an alcohol and wherein, in the case of the water/organic solvent mixture, the organic solvent is present in an amount comprised from 71 to 99% (v/v), preferably from 80 to 95% (v/v), more preferably from 90 to 95% (v/v) relative to the total volume of the water/alcohol mixture. Said alcohol is selected from an alcohol with a number of carbon atoms comprised from 1 to 4, preferably from 1 to 3. Said alcohol is preferably selected from methanol and ethanol.",
                        "The water and organic solvent mixture has the advantage of optimising the penetration of the contrast agent into the biological sample, and the aqueous part of said mixture makes the preparation of the contrast solution simpler in terms of the dissolution of the above-described components a) and b).",
                        "Optionally, in some embodiments of the invention, in addition to the intrinsic buffering power of the component a), a buffer solution or a strong acid or base can be used to reach the pH interval of 4-6. In the case of a buffer solution, it is selected from the ones known to the person skilled in the art and can be an organic or inorganic buffer, such as, for example, 2-[N-morpholino]ethanesulfonic acid (MES), cacodylate, acetate or formate. In a particularly preferred embodiment, the solution according to the present invention comprises:\n\n\n- a) phosphotungstic acid, with the formula H₃PW₁₂O₄₀;\n- b) ytterbium chloride hexahydrate, with the formula YbCl₃\\*6H₂O;\n- c) a solvent consisting of a water/acetone mixture containing from 90%\n  to 95% (v/v) acetone relative to the total volume of the water/acetone\n  mixture;",
                        "The solution described thus far, comprising the components a) to c), has application as a contrast medium for the characterisation of biological samples in a suspension (negative contrast) or embedded in resin, processed for correlative microscopy (CLEM) or conventional electron microscopy (EM).",
                        "In a second aspect, the present invention relates to the use of a compound obtainable from the reaction between the above-described components a) and b), under ambient pressure and temperature conditions and at a pH comprised in the interval of 4-6, as a contrast medium for biological samples for analysis by either correlative microscopy (CLEM) or conventional electron microscopy (EM).",
                        "A compound obtainable from a reaction between the components a) and b) means a chemical species containing atoms of oxygen, phosphorous and M originating from the component a) and Ln originating from the component b), and which manifests itself as thermodynamically stable in the solution of the solvent c) under the aforesaid conditions and can be used both in the correlative microscopy (CLEM) technique and in conventional electron microscopy (EM), preferably in the correlative microscopy (CLEM) technique.",
                        "According to a preferred embodiment, said compound is obtained from the reaction between equimolar amounts of phosphotungstic acid as component a) and ytterbium chloride as component b) and has the formula [YbPW9O34]6−. This species is defined as a lanthanide polyoxometalate.",
                        "In a third aspect, the present invention relates to a method for preparing biological samples for analysis by either correlative microscopy (CLEM) or conventional electron microscopy (EM) and comprising the following steps:\n\n\n- - i) performing a physical fixation of the biological sample to be\n    analysed, following the high pressure freezing (HPF) method;\n  - ii) performing the technique of substituting water with an organic\n    solvent at cryogenic temperatures (FS—freeze substitution) in a\n    frozen biological sample obtained in step (i), where the\n    substitution medium is the solution comprising the components a)\n    to c) as defined above.",
                        "The solution as per step ii) proves to be particularly effective when it has a concentration of the component b) comprised from 0.01 to 250 mM, preferably from 0.1 to 100 mM, even more preferably from 1 to 50 mM. Outside these intervals, in fact, one observes an increase in the nonspecific contrast of the samples, which leads to a reduction in the signal-to-noise ratio.",
                        "In one embodiment, the solution as per step ii), comprising the components a) to c) according to the present invention, can be obtained starting from a solution comprising the components a) and b) dissolved in a solvent c′), wherein said solvent c′) is an aqueous or hydroalcoholic solvent containing up to 70% (v/v) alcohol, preferably a hydroalcoholic solvent containing up to 70% (v/v) ethanol. Said solution comprising the components a), b) and c′) represents an intermediate solution and is called, for the purposes of the present invention, a “stock solution”. In a preferred embodiment of the method for preparing biological samples according to the present invention, said stock solution is in fact dried, preferably by freeze-drying, and subsequently reconstituted in a suitable amount of the solvent c) as previously defined, thus obtaining the solution comprising the components a)-c) according to the present invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define conventional electron microscopy",
                        "define organic solvent",
                        "introduce heteropolyacid",
                        "introduce lanthanide salt",
                        "describe solvent",
                        "describe preferred heteropolyacid",
                        "describe preferred lanthanide salt",
                        "describe molar ratio",
                        "describe concentration of lanthanide salt",
                        "describe preferred solvent",
                        "describe ketone",
                        "describe alcohol",
                        "describe buffer solution",
                        "describe strong acid or base",
                        "introduce ytterbium chloride hexahydrate",
                        "describe application of solution",
                        "introduce compound obtainable from reaction",
                        "describe method for preparing biological samples"
                    ],
                    "num_characters": 9140,
                    "outline_medium": [
                        "define conventional electron microscopy",
                        "define organic solvent",
                        "describe solution composition",
                        "describe heteropolyacid",
                        "describe lanthanide salt",
                        "describe solvent",
                        "describe molar ratio and concentration",
                        "describe optional buffer solution",
                        "describe application of solution"
                    ],
                    "outline_short": [
                        "define conventional electron microscopy",
                        "describe solution composition",
                        "discuss preferred embodiments",
                        "outline method for preparing biological samples"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "Preparation of the PTA-YbCl3 Solution (Stock Solution)",
                                "A solution of phosphotungstic acid (concentration 3.2 mM) in 10 ml of water/ethanol containing 20% (v/v) ethanol was prepared. The pH of this solution was brought to around 5 with sodium hydroxide 1 M. This solution had added to it an equal volume of an ytterbium chloride hexahydrate 48 mM (final concentration) solution in ethanol/water containing 20% (v/v) ethanol. The pH was again adjusted to 5 with sodium hydroxide 1 M. The mixture was kept under stirring overnight at room temperature. The solution thus obtained was called “X solution 1.5” and manifested a precipitate. The precipitate was removed by filtration and the pH was again adjusted to around 5 by adding a 20 mM solution of MES. The solution was then again kept under stirring overnight and again filtered, this time through a membrane with a pore size of 200 nm so as to obtain a solution free of precipitate and called “stock solution”. The stock solution was then stored in the dark at a temperature of 4° C. until the time of use."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare PTA-YbCl3 solution",
                                "filter and store stock solution"
                            ],
                            "num_characters": 1059,
                            "outline_medium": [
                                "prepare PTA-YbCl3 stock solution"
                            ],
                            "outline_short": [
                                "prepare PTA-YbCl3 stock solution"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "Use of the Solution According to the Present Invention as a Contrast Agent for Characterisation by Correlative Microscopy (CLEM) Using the HPF/FS Protocol for Biological Samples.",
                                "The stock solution obtained as per example 1 (0.2 ml) was freeze-dried and reconstituted in 2 ml (“X Sol 1/10”), 3.2 ml (“X Sol 1/16”) or 6 ml (“X Sol 1/30”) of a water/acetone mixture containing 95% (v/v) acetone in order to obtain the solution according to the present invention, in three different concentrations, respectively.",
                                "Each solution was centrifuged and the supernatant was used as the substitution medium in the standard HPF/FS protocol (illustrated in FIG. 1) on line cell stably transfected with a fluorescent protein conjugated to the endoplasmic reticulum. These were used as the standard sample for the correlative protocols. The cells embedded with this protocol were processed by means of the technique of high-pressure freezing/substitution of water with an organic solvent at cryogenic temperatures (HPF/FS). The correlative analysis was performed on sample sections (cut by using an ultramicrotome) and collected on supports for electron microscopy (copper grids). The same grid on which the above-mentioned sections were collected was analysed both by confocal optical microscopy for the selection of the fields of interest and, subsequently, by means of an ultrastructural approach. The correlation between the two types of images originating from the same sample is the basic principle of correlative methods, that is, the association of functional data (marking of the endoplasmic reticulum) with structural data (as the same cells appear positive for the fluorescence signal).",
                                "The various samples obtained were observed using both the confocal optical microscopy technique (FIG. 2) and the transmission electron microscopy TEM (FIG. 3) technique and the results were compared with those obtained using uranyl acetate (“UA”) as the contrast agent or in the absence of a contrast agent (“unstained”).",
                                "FIG. 4 shows the TEM images of the samples with the preferred contrast solution according to the present invention, i.e. the solution obtained starting from the stock solution described in example 1, freeze-dried and reconstituted in acetone in a 1/10 (v/v) ratio relative to the volume of the solution prior to freeze-drying. In these images it is possible to observe how the cellular ultrastructure is extremely well resolved thanks precisely to the increase in contrast efficiency. In particular, in this case, using the solution according to the present invention makes it possible to visualise subcellular details (such as, for example, the cytoskeleton) that are not generally observable using traditional contrast agents, for example based on uranyl acetate."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "reconstitute stock solution",
                                "use as contrast agent in HPF/FS protocol",
                                "perform correlative analysis",
                                "compare with uranyl acetate and unstained samples",
                                "show TEM images with improved contrast"
                            ],
                            "num_characters": 2774,
                            "outline_medium": [
                                "prepare contrast agent solution",
                                "demonstrate CLEM using HPF/FS protocol"
                            ],
                            "outline_short": [
                                "use stock solution as contrast agent for CLEM"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "Use of the Solution According to the Present Invention as a Contrast Agent for Characterisation by Correlative Microscopy (CLEM) with the HPF/FS Protocol for Biological Samples (Drosophila Oocyte)",
                                "An experiment similar to the one described in Example 2 was carried out using Drosophila oocytes as the biological sample and using ethanol as an organic solvent in the place of acetone. The images obtained are shown in FIG. 5.",
                                "The images obtained thus show that the solution of the present invention enables comparable results to be obtained in terms of fluorescence emission, while at the same time ensuring, however, better contrast than when a solution containing uranyl acetate is used, thus proving more effective in the case of characterisation by correlative microscopy (CLEM)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "repeat experiment with Drosophila oocytes and ethanol"
                            ],
                            "num_characters": 784,
                            "outline_medium": [
                                "demonstrate CLEM using HPF/FS protocol with Drosophila oocyte"
                            ],
                            "outline_short": [
                                "use stock solution as contrast agent for CLEM with Drosophila oocyte"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A solution comprising:\na) a heteropolyacid with the general formula H3PM12O40, wherein M is tungsten or molybdenum,\nb) a lanthanide salt with the general formula Ln(III)Ax*nH2O, wherein Ln is an element belonging to the series of lanthanides other than promethium, A is an organic or inorganic anion, x is a whole number greater than or equal to 1, and n is a whole number greater than or equal to 0;\nc) a solvent consisting of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is selected from a ketone and an alcohol and, in the case of a water/organic solvent mixture, is present in an amount comprised from 1 to 99% (v/v) relative to the total volume of the mixture in the case of ketone, or in an amount comprised from 71 to 99% (v/v) relative to the total volume of the mixture in the case of alcohol.",
        "2. The solution according to claim 1, wherein the molar ratio between the component a) and the component b) (b/a molar ratio) is comprised in the interval of 0.1-100.",
        "3. The solution according to claim 1, wherein the concentration of the component b) in the solvent c) is comprised from 0.01 to 250 mM.",
        "4. The solution according to claim 1, wherein the component b) has an element selected from ytterbium, europium, terbium and gadolinium as a cation.",
        "5. The solution according to claim 1, wherein the component b) has a halide as an anion.",
        "6. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is selected from a ketone and a alcohol and is present, in the case of the water/organic solvent mixture, in an amount comprised from 20 to 99% (v/v), relative to the total volume of the mixture in the case of ketone, or in an amount comprised from 80 to 95% (v/v), relative to the total volume of the mixture in the case of alcohol.",
        "7. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture in which said organic solvent is a ketone with a number of carbon atoms comprised from 1 to 4, or an alcohol with a number of carbon atoms comprised from 1 to 4.",
        "8. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is selected from acetone, methanol and ethanol.",
        "9. A method for the characterisation of biological samples in suspension (negative contrast) or embedded in resin by means of correlative microscopy (CLEM) or electron microscopy (EM) with the solution according to claim 1 as a contrast medium.",
        "10. The method according to claim 9, with the compound obtained from the reaction between the components a) and b) according to claim 1 under ambient pressure and temperature conditions and at a pH comprised in the interval of 4-6, wherein said compound has the formula [YbPW9O34]6−.",
        "11. A method for preparing biological samples for analysis by correlative microscopy (CLEM) or electron microscopy (EM), comprising the following steps:\ni) performing a physical fixation of the biological sample to be analysed, following the high pressure freezing (HPF) method;\nii) performing the technique of substituting water with an organic solvent at cryogenic temperatures (FS—freeze substitution) in a frozen biological sample obtained in step (i), where the substitute medium is the solution comprising the components a) to c) according to claim 1.",
        "12. The method according to claim 11, wherein said solution as per step ii) is obtained starting from an intermediate solution comprising the components a) and b) in a solvent c′), said solvent c′) being an aqueous or hydroalcoholic solvent containing up to 70% (v/v) alcohol, said intermediate solution then being dried and subsequently reconstituted in the solvent c).",
        "13. The solution according to claim 1 wherein the molar ratio between the component a) and the component b) (b/a molar ratio) is comprised in the interval of 1-50.",
        "14. The solution according to claim 1 wherein the molar ratio between the component a) and the component b) (b/a molar ratio) is comprised in the interval of 1-15.",
        "15. The solution according to claim 1, wherein the concentration of the component b) in the solvent c) is comprised from 0.1 to 100 mM.",
        "16. The solution according to claim 1, wherein the concentration of the component b) in the solvent c) is comprised from 1 to 50 mM.",
        "17. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is selected from a ketone and a alcohol and is present, in the case of the water/organic solvent mixture, in an amount comprised from 90 to 95% (v/v), relative to the total volume of the mixture in the case of ketone, or in an amount comprised from 90 to 95% (v/v) relative to the total volume of the mixture in the case of alcohol.",
        "18. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture in which said organic solvent is a ketone with a number of carbon atoms comprised from 1 to 3, or an alcohol with a number of carbon atoms comprised from 1 to 3.",
        "19. The solution according to claim 1, wherein the solvent c) consists of a water/organic solvent mixture or an organic solvent, wherein said organic solvent is acetone."
    ]
}