{
    "id": "US20090176259",
    "authors": [
        "Markus Kalkum",
        "Karine Bagramyan"
    ],
    "title": "METHODS FOR DETECTION OF BOTULINUM NEUROTOXIN",
    "date": "2008-06-05 00:00:00",
    "abstract": "Provided herein is a large immuno-sorbent surface area assay (ALISSA) for rapid and sensitive detection of toxin or enzyme activity. This assay is designed to capture a low number of toxin or enzyme molecules and to measure their intrinsic protease activity via conversion of a fluorigenic or luminescent substrate. The ALISSA is significantly faster and more sensitive than methods routinely utilized in the art. This assay is applicable for use for detection of a variety of toxins or enzymes having proteolytic activity, such as botulinum neurotoxin, bacillus anthracis lethal factor, human chitinases, and aspergillus fumigatus proteases. Also provided are methods for constructing and identifying novel luminescent or fluorescent substrates suitable for use with the ALISSA method.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Botulinum neurotoxins (BoNTs) are important medical agents, used to treat dystonias, blepharospasms, hyperhidrosis and other neurological diseases. However, BoNTs also represent the most toxic substances known and their potential abuse as a threat agent is feared (Amon 2001; Wein 2005). The detection of Botulinum neurotoxin (BoNT) in complex samples such as foods or clinical specimens represents an analytical challenge. The current “gold standard” in the art for detecting BoNT is the mouse toxicity assay, which can detect as little as 10 pg BoNT (Ferreira 2003). However, BoNT can be lethal to humans in systemic doses as low as 1 to 2 ng/Kg body weight (Amon 2001). Therefore, there is a need in the art for more sensitive assays for detecting the presence of BoNT in a sample."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce botulinum neurotoxins"
                    ],
                    "num_characters": 784,
                    "outline_medium": [
                        "introduce botulinum neurotoxins and detection challenges"
                    ],
                    "outline_short": [
                        "introduce botulinum neurotoxins and detection challenges"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "In certain embodiments, methods are provided for detection of BoNT in complex biological samples with high sensitivity and specificity. In certain of these embodiments, the methods are based on specific affinity enrichment of a target toxin or target enzyme (“target”) onto a solid support followed by fluorometric or luminescent readout. In certain of these embodiments, the assays have a sensitivity of at least about 0.5 femtograms target per one mL sample or about 300 target molecules per sample. In certain of these embodiments, the solid support is a bead matrix that contains immobilized, anti-enzyme-specific antibodies and/or anti-toxin-specific antibodies. In other embodiments, capture or immobilization of the target toxin or enzyme such that the toxin or enzyme's activity on its substrate is accelerated. In certain embodiments, capture or immobilization of the target toxin or enzyme is achieved without resulting in inactivation or reduction of the target activity on its substrate. For example, antibodies may be BoNT-specific antibodies that capture BoNT but do not inactivate BoNT-specific enzymatic activity. Also, antibodies may be BoNT-specific antibodies that capture BoNT such that the BoNT activity is accelerated.",
                        "In certain of these embodiments, the fluorometric readout is based on specific cleavage of a fluorogenic substrate. For example, BoNT-specific cleavage of a fluorogenic BoNT substrate such as the SNAPtide described in U.S. Pat. No. 6,504,006 as well as other coumarin derivatives are useful in certain embodiments. Additional suitable substrates include various soluble NSF attachment protein receptor (SNARE), or one or more fluorogenic toxin or enzyme peptide substrate.",
                        "The methods provided herein may be used to detect BoNT type A, B, C, D, E, F, and/or G, or their subtypes. In certain embodiments, methods are provided for detection of BoNT serotypes including subtypes with attomolar sensitivity. The assays include use of a BoNT serotype A assay with a large immuno-sorbent surface area (BoNT/A ALISSA) that has attomolar sensitivity in biological samples such as complex samples, serum and liquid foods.",
                        "In other embodiments, luminescent based readout assays are provided for detection of BoNT. The methods include use of bioluminescent BoNT/A substrates including genetically engineered variants of recombinant luciferase proteins. In certain embodiments, bioluminescent assays include use of luminescent proteins able to emit light at multiple wavelength for multiplexed simultaneous detection of one or more serotype.",
                        "In certain embodiments, the methods and assays include development and use of novel fluorogenic or bioluminescent substrates for toxin or enzyme detection. Such novel substrates include those having resistance to non-BoNT proteases while remaining cleavable by the target toxin or enzyme.",
                        "The methods and assays provided are broadly useful and as such may be used to detect a wide variety of toxins and/or other enzymes such as anthrax lethal factor, human chitinases (e.g. CHIT1 or AMCase) and proteases such as fungal protease Pep1 and Pep2 from Aspergillus fumigatus. The ALISSA methods may be expanded for use in detection of any toxin or enzyme including all BoNT serotypes.",
                        "The systems, methods and kits provided herein may be used to detect and/or measure toxin or enzyme levels in a variety of samples. In certain embodiments, the methods may be used to measure toxin or enzyme distribution in systemic circulation, in a biological fluid sample, cell, tissue and/or organ of an animal or human. The sensitivity, specificity, speed and simplicity of the methods provided herein are particularly useful for diagnostic, biodefense and pharmacological applications.",
                        "In addition to the exemplary embodiments described above, further embodiments and aspects will become apparent by reference to the drawings and by study of the following descriptions."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce methods for detecting BoNT",
                        "describe affinity enrichment of target toxin",
                        "describe fluorometric or luminescent readout",
                        "describe capture or immobilization of target toxin",
                        "describe detection of BoNT serotypes",
                        "describe use of novel fluorogenic or bioluminescent substrates",
                        "describe applications of methods"
                    ],
                    "num_characters": 3931,
                    "outline_medium": [
                        "introduce methods for detecting BoNT in complex biological samples",
                        "describe fluorometric and luminescent readout assays",
                        "highlight sensitivity and specificity of methods"
                    ],
                    "outline_short": [
                        "summarize methods for detecting botulinum neurotoxins"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The following description of the invention is merely intended to illustrate various embodiments of the invention. As such, the specific modifications discussed are not to be construed as limitations on the scope of the invention. It will be apparent to one skilled in the art that various equivalents, changes, and modifications may be made without departing from the scope of the invention, and it is understood that such equivalent embodiments are to be included herein.",
                        "Natural BoNT resides within ˜300, 500 or 900-kDa protein complexes together with other non-toxic components, the neurotoxin associated proteins (NAPs) (Sakaguchi 1982; Chen 1998; Sharma 2003; Melling 1988; Zhang 2003; Aoki 2001). Several structurally distinct serotypes of BoNT (types A to G) have been discovered. BoNT Type A (BoNT/A) is most prevalent in the Western United States (Smith 1978) and is causatively involved in approximately 60% of the IB cases in California (the rest being mostly attributed to type B) (Amon 2001). The toxin itself is a 150-kDa zinc-binding metalloprotease that, following expression, is endogenously cleaved into a 100-kDa heavy and a 50-kDa light chain connected by a reducible disulphide bond (Schiavo 2000) and by a belt-like extension of the heavy chain that loops around the light chain (Lacy 1998). The catalytic site is located on the light chain (Kurazono 1992). Reduction of the chain-bridging disulphide bond exposes the catalytic site and enhances its activity (Lacy 1998), also referred to as “activation” of the toxin by some authors and toxin manufacturers (Cai 1999; Cai 2001). The potency of BoNT results from its ability to cleave on or more of the three SNARE proteins involved in fusing acetylcholine-containing synaptic vesicles with terminal motor neurons membrane, triggering muscle contraction (Shiavo 2000).",
                        "Detection of low levels of BoNT in a sample using prior art methods is difficult. However, due to the enormous potency of the toxin, which can be lethal for humans in systemic doses of 1 to 2 ng/Kg body weight (Amon 2001), these low levels can be extremely dangerous. For example, in infant botulism (IB), a condition in which a baby's intestines have become colonized by toxin-secreting Clostridium botulinum bacteria, it is possible to detect BoNT in stool samples (Amon 2006). However, attempts to diagnose IB serologically via detection of BoNT in the blood have been deemed unreliable (Schantz 1992). Nevertheless, the systemic presence of the toxin in IB cannot be disputed, because of its apparent quick distribution throughout the infant's entire body, by which it efficiently shuts down motor neurons distant from the intestinal source. The resulting symptoms can include complete paralysis and respiratory failure.",
                        "The definite diagnosis of botulism requires detection of BoNTs in clinical specimens. Most commonly used and relied on is the life mouse assay. This assay can detect as little as 10 pg BoNT (Ferreira 2003). In the life mouse assay, mice are injected intraperitoneally (i.p.) with 0.5 mL/mouse of sample, treated with type A or B antitoxin, and observed for signs of botulism or death, typically over a 48 hour period. Toxicity is expressed by the number of hours until death (Kautter 1977; Sharma 2006). As in many animal experiments, the results of the mouse assay may vary. Four- to five-fold differences in response to a given dose are typical (Sugiyama 1980). Other and generally faster methods for BoNT detection include use of fluorescence resonance energy transfer (FRET) substrates for BoNT (U.S. Pat. No. 6,504,006), various enzyme-linked immunosorbent assays (ELISAs) (Sharma 2006), Enzyme-amplified protein micro arrays with a “fluidic renewable surface fluorescence immunoassay” (Varnum 2006), mass spectrometric assays (Barr 2005; Kalb 2005; Boyer 2005; Kalb 2006), immuno-PCR detection (Chao 2004), and recently, a real-time PCR-based assay that utilizes reporter DNA-filled liposomes which bind to immobilized BoNT/A via gangliosides (Mason 2006a; Mason 2006b). Reported detection limits and sample types for these various methods are summarized in Table 1. Except for the PCR-based assays, most assays are not well suited to provide the desired detection of less than 1 pg/mL BoNT in a complex sample. By approximation, 1 pg/mL corresponds to the lethal concentration under presumed equal distribution throughout the human body.",
                        "Provided herein is a simple laboratory method for detecting the activity of a toxin or enzyme that utilizes common lab equipment and commercially available reagents, and is therefore expected to be reproducible by any reasonably well equipped biological laboratory. This method is referred to herein as a Assay with a Large Immuno-sorbent Surface Area (ALISSA). The examples set forth herein provide a detailed protocol for the ALISSA, as well as an analysis of the effect of various experimental parameters on the assay. In certain embodiments, the ALISSA is employed for the detection of botulinum toxin A (BoNT/A). For example, the exemplary experimental results disclosed herein show that the assay can detect less than 0.5 fg of BoNT/A holotoxin in 1 mL serum, milk, or GP-diluent. Based on these results, the ALISSA is at least about 32,000-fold more sensitive than the life mouse assay and about 160.000-fold more sensitive than the Enzyme-linked Immunosorbent Assay (ELISA). In certain embodiments, the turnaround time for the ALISSA is one to two hours, which is significantly faster than the life mouse assay (˜48 hours) and faster than ELISA (˜3 hours). The exemplary experimental results obtained herein were obtained with BoNT type A (BoNT/A), but could be applied just as easily to other BoNT serotypes or other toxins as well as enzymes.",
                        "The ALISSA avoids interference with other sample components by using a highly specific affinity matrix and exploiting the natural catalytic activity of the toxin or enzyme (“target”) with a target-specific substrate. Both of these steps amplify the signal via localized enrichment of the toxin and enzymatic conversion of multiple substrate molecules per toxin molecule.",
                        "In certain embodiments, ALISSA consists of two main steps: 1) capture and enrichment of toxin or enzyme on a bead-based immuno-affinity matrix and removal of unspecific binding molecules, and 2) determination of the enzymatic activity of the immobilized toxin or enzyme based on cleavage of a specific fluorigenic or bioluminescent substrate. In certain embodiments, the immuno-affinity matrix consists of protein-A conjugated sepharose beads coupled and cross-linked to anti-toxin or anti-enzyme antibodies. For example, the immunoaffinity matrix can consist of protein-A conjugated sepharose beads coupled and cross-linked to anti-BoNT antibodies. The immunosorbent support provided herein can be comprised of either loose beads or one or more fixed column.",
                        "As used herein, the term “target” when used to refer to a toxin or enzyme, is used to refer to any chemical, biochemical or biological species or compound that is known or referred to in the art as a toxin or an enzyme. A target toxin or target enzyme includes those compounds having proteolytic, catalytic or enzymatic activity. A target toxin or target enzyme includes those compounds able to modify a substrate so as to alter or change the substrate's chemical structure or apparent structure or activity. For example, a botulinum neurotoxin type A is a “target” toxin that has proteolytic activity and is able to cleave its specific substrates. As another example, a chitinase is a “target” enzyme that has enzymatic activity.",
                        "As used herein, the term “substrate” is used to refer to any chemical, biochemical or biological species or compound that complexes with, reacts, with, is capable of being modified by, or otherwise interacts with a toxin or enzyme having bioactivity. For example, a botulinum type toxin is a protease able to enzymatically cleave specific protein substrates such as synaptic membrane proteins, SNARE proteins or SNAP-25 proteins. As another example, a chitinase substrate interacts with a chitinase enzyme such as endochitinase or exochitinase.",
                        "As used herein, the term “fluorogenic substrate”, and “fluorophore” may be used interchangeably to describe a substrate that is hydrolyzed by or otherwise reacted with a target toxin upon contact therewith, producing a complex, product or other derivative thereof which liberates fluorescence upon excitation by a suitable light source.",
                        "As used herein the term “bioluminescent substrate”, “luminescent substrate”, and “luminogenic” protein may be used interchangeably to describe a substrate that is activated by or otherwise interacts or reacts with a target toxin upon contact therewith, producing a complex, product, or other derivative thereof which emits light at distinct wavelengths suitable for detection as desired.",
                        "In accordance with the method of the invention, one or more sample from a source suspected of containing a toxin is obtained and then contacted with a substrate composition comprising a toxin substrate, such as a fluorogenic or luminogenic substrate or a mixture thereof, for a period of time and under conditions sufficient to permit the toxin to react with the toxin substrate to cause a measurable change in a property such as fluorescence or light emission, or the resulting reaction product.",
                        "In general, the toxin or enzyme contained in the sample is first captured on an enrichment matrix such as a bead-based immuno-affinity matrix containing immobilized anti-toxin specific antibodies. Immobilization of the antibodies to the matrix can be by a variety of methods, including, for example by covalent crosslinking of the Fc region of the antibody to the beads. Once captured, the toxin or enzyme molecules retain enzymatic function and specificity for its substrate.",
                        "The natural substrate of BoNT/A is the 25-kDa synaptosomal-associated protein (SNAP 25), which it cleaves at distinct sites, thereby preventing the release of neurotransmitters (Schiavo 1993a; Schiavo 1993b). In those embodiments wherein BoNT/A is being detected, the enzymatic activity of BoNT/A may be utilized to cleave the fluorigenic substrate SNAPtide, which is a synthetic, commercially available, 13-amino acid peptide that contains the native SNAP-25 cleavage site for BoNT/A (U.S. Pat. No. 6,504,006). In those embodiments wherein a BoNT type other than type A is being detected, the fluorogenic substrate may be any substrate that is specifically cleaved by the BoNT type being detected. In those embodiments were a different class or type of toxin other than a BoNT is being detected, the substrate may be any substrate that is specifically cleaved or catalyzed by the toxin being detected.",
                        "The present invention provides a method for detecting toxin or enzyme which avoids interference with other sample components by use of high toxin-specific affinity matrix and toxin-specific substrates. For example, use of a high affinity BoNT/A specific matrix and a BoNT/A-specific substrate reduces or avoids interference by other components present within a sample thus amplifying the signal and increasing the assay's sensitivity. Use of a toxin-specific substrate also exploits the natural proteolytic activity of the toxin. Signal amplification is achieved by localized enrichment of the toxin and through enzymatic conversion of substrate molecules. In certain embodiments, the capture matrix is designed to stably enrich the toxin while retaining enzymatic activity. The capture matrix may also purify toxin from non-specific components or proteases present within the sample. Use of a beaded protein A matrix to bind anti-toxin antibodies via FC-region allows orientation of the antibody binding domains away from the bead surface and into the surrounding fluid. This augments and provides increased accessibility for toxin molecules. Use of a bead-based assays also allows for wash steps that diminish interference by other proteases. The present invention provides a considerably faster and more sensitive method for detecting toxin and its activity.",
                        "Detection of all BoNT serotypes including subtypes is also achieved utilizing novel fluorogenic or luminogenic substrates. The botulinum neurotoxins cleave a variety of vertebral SNARE (Soluble NSF attachment protein receptor) in vivo and in vitro. While some fluorogenic BoNT substrates based on natural SNARE sequence are known (Schmidt 2003), the possible interference by sterically demanding fluorophore or quencher moieties on the catalytic cleavage reaction of such fluorogenic peptides remains a concern. The present invention provides novel substrates that achieve higher chemical stability and comparable or superior sensitivity as compared to prior peptides. Preferably, fluorophore substrates that allow for efficient cleavable fluorophore and quencher combinations are selected for use in the ALISSA assay. Generally, fluorophore and quencher require proximities of about 10 nm or less to allow sufficient FRET-mediated quenching. Closer distances are also preferred to reduce background fluorescence from the quenched substrates. In certain embodiments, use of bioluminescent substrates to allow for luminescent BoNT detection may be desired. Luminescent based assays can reduce or omit the requirement for a light source and provide greater signal-to-noise ratios. Bioluminescent light in particular, can be detected using less complex means such as with miniaturized photomultipliers or microscopic avalanche photodiodes. Furthermore, potential interference from background fluorescence due to inert components of a microfluidic device are alleviated.",
                        "Novel fluorogenic substrates for BoNT serotypes such as serotypes A to G are designed through use of peptide libraries having proteinogenic and as well as non-proteinogenic amino acids. Preferably, those substrates having resistance to non-BoNT proteases are selected for use with the ALISSA or other immobilized antibody matrix based assay. More preferably, substrates designed so as to be more specifically and readily cleaved by BoNT are also provided. Thus, the present invention includes methods for detecting BoNT of all serotypes and subtypes in one or more biological sample, in vitro or in vivo using affinity capture of BoNT on microscopic beads coated with antibodies specific to the toxin. The antibody captured toxin retains its metalloprotease activity. The method includes use of a reporter molecule such as a fluorogenic or bioluminescent substrate that is cleavable by one or more molecules of the captured BoNT. Fluorescence is then detected using a handheld ultraviolet (UV) light, a fluorescence excitation and/or detecting tool, device or any suitable commercially available fluorometer. Luminescence is detected using any suitable commercially available luminometer.",
                        "The present invention provides an inexpensive, robust method providing high analytical specificity and attomolar sensitivity for detection of toxin or enzyme in complex biological samples. The ALISSA will improve the diagnosis of botulism and other toxins significantly and could serve to protect humans in biomedical and bio-defense scenarios. The method may also be applied for the routine testing of foods and for forensic investigation.",
                        "The present invention also provides methods for identifying novel fluorogenic and luminogenic substrates useful for detecting the presence and/or activity of a toxin or enzyme. Such toxin-specific substrates are useful for detecting, identifying and/or assaying for the presence or activity of a toxin or enzyme in a sample at attomolar levels of sensitivity. For example, it is known that botulinum neurotoxins cleave a variety of SNARE proteins. Sequences of natural SNARE proteins have been used to produce fluorogenic BoNT peptide substrates. Such methods generally entail use of terminal fluorophore and quencher molecule pairing (fluorescence through resonance energy transfer), or FRET moieties. It is difficult, however, to predict the effect that sterically demanding fluorophore or quencher moieties will have on the ability of the toxin to effectively cleave the resulting fluorophore modified substrate molecule. The present invention provides novel fluorogenic substrate peptides by employing synthetic peptide libraries to screen for those substrates that readily contain fluorophore and quencher combinations.",
                        "The present invention also provides methods for the identification of novel luminogenic protein substrates. Using recombinant methodology, genetically engineered variants of recombinant luciferase proteins that become activated by specific BoNT cleavage reactions are provided. Thus, the methods provide luminescent substrates specific for all serotypes and subtypes of botulinum toxin.",
                        "The present invention employs two general approaches to exploiting bioluminescence for identifying novel bioactive luminogenic substrates. The first includes use of complementation of inactive luciferase fragments to restore active luciferase molecules. The second includes use of specific reactions that release D-luciferin as a substrate for firefly luciferase (FFL from Photinus pyralis). Complementation assays for luciferase are described by Paulmurugan et al., “Combinatorial library screening for developing an improved split-firefly luciferase fragment-assisted complementation system for studying protein-protein interactions,” Anal Chem., 79:2346-2353 (2007); and Paulmurugan et al., “Firefly luciferase enzyme fragment complementation for imaging in cells and living animals,” Anal. Chem. 77:1295-1302 (2005). Using described complementation assays, split luciferase constructs are designed for use in detecting the presence of specific enzymatic activity. Whereas such constructs are inactive when in their fused, non cleaved state, upon interacting with a target toxin such as BoNT, the proteolytic activity of the toxin cleaves the luminogenic substrate thereby releasing a detectable luminescent signal. Luminogenic substrates for all toxins and enzymes as well as the seven serotypes (A to G) of BoNT can be detected by such specific substrates.",
                        "The novel substrates can also be obtained by the usual methods of solid-phase synthesis according to the Merrifield method on an automatic synthesizer such as, for example, the 431A synthesizer from Applied Biosystems. The chemistry used corresponds to Fmoc technology and protection of the side chains allowing cleavage thereof with trifluoroacetic acid, as described by E. Atherton and R. C. Sheppard (1989) in “Solid Phase Peptide Synthesis: a practical approach, IRL Press, Oxford”."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce natural BoNT",
                        "describe BoNT structure",
                        "describe catalytic site",
                        "describe potency of BoNT",
                        "describe detection of low levels of BoNT",
                        "describe prior art methods",
                        "introduce ALISSA method",
                        "describe ALISSA protocol",
                        "describe effect of experimental parameters",
                        "describe detection of BoNT/A",
                        "describe sensitivity of ALISSA",
                        "describe turnaround time of ALISSA",
                        "describe avoidance of interference",
                        "describe use of affinity matrix",
                        "describe use of target-specific substrate",
                        "describe immobilization of antibodies",
                        "describe capture of toxin or enzyme",
                        "describe removal of unspecific binding molecules",
                        "describe determination of enzymatic activity",
                        "describe use of fluorigenic or bioluminescent substrate",
                        "define target toxin or enzyme",
                        "define substrate",
                        "define fluorogenic substrate",
                        "define bioluminescent substrate",
                        "describe contacting sample with substrate composition",
                        "describe capture of toxin or enzyme on enrichment matrix",
                        "describe immobilization of antibodies",
                        "describe use of SNAPtide as substrate",
                        "describe use of novel fluorogenic or bioluminescent substrates",
                        "describe detection of all BoNT serotypes",
                        "describe design of novel substrates",
                        "describe use of peptide libraries",
                        "describe use of bioluminescent substrates",
                        "describe use of recombinant luciferase proteins",
                        "describe use of complementation assays",
                        "describe use of split luciferase constructs",
                        "describe applications of methods"
                    ],
                    "num_characters": 18713,
                    "outline_medium": [
                        "describe natural BoNT and its structure",
                        "introduce BoNT serotypes and their prevalence",
                        "describe catalytic site and activation of toxin",
                        "discuss detection challenges and prior art methods",
                        "introduce ALISSA method for detecting BoNT",
                        "describe ALISSA protocol and experimental results",
                        "compare ALISSA sensitivity to prior art methods",
                        "define target toxin or enzyme and substrate",
                        "describe fluorogenic and bioluminescent substrates",
                        "introduce immuno-affinity matrix and its preparation",
                        "describe capture and enrichment of toxin or enzyme",
                        "discuss signal amplification and interference reduction",
                        "introduce novel fluorogenic and luminogenic substrates",
                        "describe design and selection of substrates",
                        "discuss bioluminescent substrates and their advantages",
                        "introduce methods for identifying novel substrates",
                        "describe complementation assays for luciferase",
                        "discuss applications of ALISSA method"
                    ],
                    "outline_short": [
                        "describe natural botulinum neurotoxins",
                        "discuss limitations of prior art detection methods",
                        "introduce ALISSA method for detecting botulinum neurotoxins",
                        "describe ALISSA protocol and experimental results",
                        "define terms used in the invention",
                        "describe fluorogenic and bioluminescent substrates",
                        "discuss advantages of ALISSA method",
                        "describe novel fluorogenic and luminogenic substrates",
                        "discuss applications of the invention"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Materials and Methods**",
                                "The pure 150 kDa BoNT A toxin (holotoxin) was purchased from two distinct commercial sources: from the List of Biological Laboratories (Campbell, Calif.) and Metabiologics Inc. (Madison, Wis.). BoNT/A complex, IP and IV mouse assays in 50 mM citrate buffer, pH 5.5 was received from Dr E. Jonson's laboratory, Food Research Institute of the University of Wisconsin-Madison. The intact BoNT/A toxin complex and BoNT/A toxoid were from MetaBiologics. SNAPtide™ (FITC/DABCYL), synthetic peptide containing the native cleavage site for Botulinum toxin type A and SNAPtide®, unquenched calibration peptide for SNAPtide™(FITC/DABCYL), were purchased from the List of Biological Laboratories. The latter contains the FITC bound to the N-terminal cleaved fragment of SNAPtide; it was used as a calibrant to convert fluorescence intensity units to changes in the molar ratio of peptide cleavage product. All types of BoNT/A toxin were from Hall A, Clostridium botulinum producing strain. In one example, the BoNT/A subtype used was A1. Toxin activities for the holotoxin and the complex were 2.1×108 MLD50/mg and 3.6×107 MLD50/mg, respectively, according to Metabiologics.",
                                "In certain embodiments, the fluorogenic peptide is SNAPtide (U.S. Pat. No. 6,504,006) which is a molecular derivative of SNAP25, the natural substrate of BoNT/A. SNAPtide is cleaved by BoNT/A between a fluorophore and a quencher (FRET pair) releasing unquenched fluorophore. The SNAPtide contains a conjugated fluorescein thiocarbamoyl (FITC) quenched by a 4-(dimethylaminoazo) benzene-4-carboxyl (DABCYL)-moiety. The fluorogenic peptide SNAPtide (FITC/DABCYL, product #521) and the unquenched calibration peptide, containing an N-terminally FITC-labeled fragment of SNAPtide (product #528, synthetic, but sequence identical to the BoNT/A cleaved product), were from List Biological Laboratories. In other embodiments, the substrate comprises a SNAPtide peptide wherein the N-terminal fluorescein isothiocyanate was replaced with 5-carboxy fluorescein. Such labeling improves stability of the substrate. In certain embodiments, 4-methylumbelliferone labeling was utilized allowing use of a substrate having blue fluorescence.",
                                "Affinity purified Rabbit polyclonal to Clostridium botulinum A Toxoid (formaldehyde inactivated Type A Neurotoxin (C. botulinum) antibodies were purchased from Abcam (Cambridge, UK). Purified rabbit IgG was from (ICN Biomedical Inc., Aurora, Ohio), Seize® X Protein A Immunoprecipitation Kit was from Pierce (Rockford, Ill.), Trypsin was from Promega, Fetal Bovine Serum was from Invitrogen (Carlsbad, Calif.). Human serum was from Sigma (cat. #H4522) and carrot juice was from Bolthouse Farms (Organics, 100% carrot juice, 1 liter bottle). Other reagents were from Sigma unless indicated. Concentrations of the toxins were determined according to the extinction coefficient (Ahmed et al., 2001) or by Bicinchoninic Acid (BCA, Pierce) Protein Assay, a Micro Assay for dilute protein solutions, with BSA as standard. Both methods gave the same result. The product was exclusively the dichain form of the toxin as judged by the 12% sodium dodecyl sulfate-polyacrylamide gel electrophoresis at room temperature (25° C.) under reducing conditions. Gels were analyzed by Western Blot using Rabbit polyclonal to Clostridium botulinum A Toxoid (Abcam). The bands on the gels were visualized by Coomassie Blue or Silver staining or with the SimplyBlue SafeStain kit from Invitrogen (Carlsbad, Calif.)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "purchase materials",
                                "describe BoNT/A toxin and its subtypes",
                                "describe SNAPtide and its variants",
                                "describe antibodies and their sources",
                                "describe reagents and their sources",
                                "determine concentrations of toxins",
                                "analyze gels by Western Blot"
                            ],
                            "num_characters": 3512,
                            "outline_medium": [
                                "list materials and methods",
                                "describe preparation of BoNT/A toxin and substrate",
                                "detail Western Blot analysis"
                            ],
                            "outline_short": [
                                "describe materials and methods"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "**Assay Design**",
                                "Preparation of the Immunomatrix.",
                                "BoNT/A was captured and enriched on a bead-based immuno-affinity matrix and cleansed from unspecific binding molecules. The enrichment matrix consisted of protein-A conjugated sepharose beads coupled and cross-linked to polyclonal anti-BoNT/A antibodies (FIG. 1a). Anti-BoNT/A antibodies were bound and then covalently cross-linked to the bead-immobilized protein A molecules to prevent bleeding off when mixed with sample. The release of antibodies into the sample may otherwise lower the sensitivity of the assay. Capture antibodies were directly and covalently linked to the Protein A support (agarose beads) using the SeizeX Immunoprecipitation Kit (Pierce) as described in the supplier's protocol. Briefly, 125 μg of Clostridium botulinum A Toxoid, formaldehyde inactivated Type A neurotoxin (ab 20641) prepared in 0.4 mL of Binding/Wash buffer contained 0.14 M NaCl, 0.008 M sodium phosphate, 0.002 M potassium phosphate and 0.01 M KCl, pH 7.4, were bound and immobilized to a Protein A support using cross-linker Disuccinimidyl suberate (DSS). 25 μL DSS, dissolved in DMSO immediately before use, was added to the spin cup containing the bound antibody support and gently mixed for 30-60 minutes, centrifuged and washed 4 times with 500 μL of Immunopure Gentle Elution Buffer (Product No. 21027) with a high-salt, neutral pH elution system to quench the reaction and to remove excess DSS and uncoupled antibody. Alternatively, the beads were centrifuged and washed three times with 500 ul Gentle Elution Buffer and two times with 500 ul Gentle Binding Buffer (Pierce Product No. 21030). The Handee™ Spin Cup Columns with functionalized beads were wrapped with laboratory film to prevent gel from drying and stored at 4° C. until used in experiments. The number of beads varying in sizes between 10-100 μm was estimated microscopically with Reichert Bright-Line Metallized Hemacytometer (Hausser Scientific, USA). The immobilized polyclonal rabbit antibody used herein exhibited binding affinity to the light and heavy chain of BoNT/A, as confirmed by Western blot (FIG. 2b).",
                                "BoNT/A assay with a large immuno-sorbent surface area (ALISSA). The enzymatic activity of the immobilized BoNT/A was determined by cleavage of the specific fluorigenic substrate SNAPtide, a synthetic, commercially available, 13-amino acid peptide that contains the native SNAP-25 cleavage site for BoNT/A (Schmidt 2003; U.S. Pat. No. 6,504,006) (FIG. 1b). BoNT/A holotoxin or its complex, were pre-incubated (where indicated) in 5 mM dithiothreitol (DTT) for 30 minutes at 37° C. in order to reduce and pre-activate the enzyme, immediately following reconstitution in the buffer containing 20 mM HEPES, pH 8.0, 0.05% Tween-20, 0.3 mM ZnCl2, and 1.0 mg/mL BSA to recover of BoNT/A. Pre-activated toxin was used immediately after reconstitution with the buffer. Enzyme was immobilized on the antibodies-bound beads in 1 mL of 3% Carnation non-fat milk in PBS or in a 10% Fetal Bovine Serum (heat inactivated). After the addition of immunomatrix samples were incubated with the food matrix or serum. Suspensions were rotated for indicated times at 8 rpm on a Labquake Shaker/Rotisserie (BarnsteadInternational, Dubuque, Iowa). The antibody-bound beads with immobilized enzymes were separated by the centrifugation, washed three times with 500 μl PBS buffer, collected and re-suspended in 300 μl of 20 mM HEPES buffer, containing 0.3 mM ZnCl2, 1.25 mM DTT and 0.1% TWEEN-20, pH 8.0. Unbound material was then removed by washing and synthetic peptide was added. Reaction was started by rotating and adding various concentrations of SNAPtide. For assays 4 mM DMSO-stock solution was diluted in 20 mM HEPES, pH 8.0, and a 100 μM stock solution was used. Assays were performed for indicated times in a dark; reaction was stopped by transfer to ice and addition of a 20 mM ethylenediaminetetraacetate (EDTA) (pH 8.0), which was equally effective in blocking the proteolytic activity of both holotoxin and complexed BoNT/A. For work without antibodies-bound beads, the toxin was combined with the same number of beads with no antibodies or with the rabbit IgG-beads.",
                                "Conversion of SNAPtide releases the N-terminal fluorophore, fluorescein-thiocarbomoyl (FITC), which is initially quenched by the C-terminal chromophore, 4-((4-(dimethylamino)phenyl)azo)benzoic acid, succinimidyl ester DABCYL, was recorded with Wallac 1420 Multilabel Counter Victor2™ spectrophotometer (PerkinElmer) or with SpectraMax M2 (Molecular Device Corp.) at 485 nm/535 nm as an excitation and emission wavelengths, respectively. The increase in fluorescence intensity is directly proportional to the amount of cleavage that has occurred and thus allows for accurate measurement of botulinum toxin enzymatic activity. Before experiments the beads with cleaved SNAPTide were observed on the glass slides mounted on fluorescent microscope (Olympus BH2-RFCA, Japan). The immobilized polyclonal rabbit antibody used herein did not significantly inhibit the specific proteolytic activity of BoNT/A (FIG. 2a)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "prepare immunomatrix",
                                "describe antibody immobilization",
                                "describe BoNT/A assay design",
                                "pre-activate toxin",
                                "immobilize enzyme on beads",
                                "incubate with food matrix or serum",
                                "wash and separate beads",
                                "add synthetic peptide",
                                "measure fluorescence intensity",
                                "stop reaction with EDTA"
                            ],
                            "num_characters": 5103,
                            "outline_medium": [
                                "describe preparation of immunomatrix",
                                "detail BoNT/A assay with large immuno-sorbent surface area (ALISSA)",
                                "explain immobilization of BoNT/A on antibodies-bound beads",
                                "describe measurement of enzymatic activity",
                                "detail observation of beads with cleaved SNAPtide"
                            ],
                            "outline_short": [
                                "describe assay design",
                                "describe BoNT/A assay with a large immuno-sorbent surface area (ALISSA)"
                            ]
                        },
                        {
                            "title": "Example 3",
                            "paragraphs": [
                                "**Assay Optimization**",
                                "The conditions of bead-based assay were optimized to maximize its sensitivity and specificity for one- and ten-attomolar toxin concentrations in 1-mL sample volumes (FIG. 3). Therefore, assay sensitivity was repeatedly measured using serial dilutions of BoNT/A in 10% fetal bovine serum (FBS), and the following parameters were evaluated: antibody-protein A cross-linking conditions, post cross-linking bead wash buffers, number of beads, toxin-antibody binding times and temperature, wash buffers for the removal of non-specific antibody binders, SNAPtide concentration, SNAPtide conversion time and the effect of temperature during reaction. For each BoNT/A dilution, the fluorescence intensity was plotted against the variant parameter (FIG. 3). Due to the asymptotic nature of the resulting curves, there are no optima for several parameters. However, by analyzing the change in signal gain as a function of a given parameter, efficient values for each parameter which produce the steepest increase in signal gain have readily been achieved, and the assay's performance has become robust and predictable.",
                                "During synthesis of the bead-based immunomatrix, use of a neutral wash buffer after binding and cross-linking of the antibody to the protein A beads was found to be critical. When an alternative acidic wash buffer (pH 2.8) was used instead, the antibodies were altered such that they became inactive when exposed to nanomolar concentrations of the toxin, probably through toxin-induced proteolytic cleavage.",
                                "The assay performed efficiently and with high sensitivity when using about 100 μL/well SNAPtide in concentrations of about 25 μg/mL (FIG. 3a) and 1 uM. A reaction time of one hour for the conversion of the fluorigenic SNAPtide at room temperature (25° C.) was appropriate (FIG. 3b). Within limits, the signal-gain of the assay can be enhanced by increasing the number of beads mixed with the sample (FIG. 3c) and by extending the enzyme enrichment time as demonstrated in FIG. 3d. The most efficient bead concentrations lie between about 100,000 and about 120,000 beads/mL, which correspond to a bead bed volume of approximately 8.7-10.4 μl or approximately 10-12 μl, when left to settle. Further increase of the bead concentration to 500,000/mL raised the signal intensity only by another 28% (FIG. 3c). The effect of temperature on the toxin capturing step was also investigated. Sufficient binding required about 3 hrs at about 25° C. incubation for the substrate with the beads, and about one hour when at about 37° C. The measured toxin activity was significantly diminished at about 55° C. (FIG. 3e), likely due to toxin deactivation rather then due to decreased antibody binding. An increase in temperature from about 25° C. to about 37° C. during the SNAPtide-conversion reaction improved the signal and reliable readings were obtained for reaction times of about 1 hour.",
                                "Pre-activation of the toxin on the beads during the wash step was achieved with 5 mM DTT and produced slightly higher signals when compared to the non-pre-activated toxin (FIG. 4a). However, the subsequent reaction with the fluorigenic reporter had to be performed in 1.25 mM DTT in order to avoid denaturation of the immunoaffinity matrix and because prolonged exposure to the more concentrated reductive agent inactivated the toxin considerably (tested on bead-free toxin)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "optimize assay conditions",
                                "evaluate antibody-protein A cross-linking",
                                "evaluate wash buffers and bead numbers",
                                "evaluate toxin-antibody binding times and temperature",
                                "evaluate SNAPtide concentration and conversion time",
                                "analyze signal gain as a function of parameters"
                            ],
                            "num_characters": 3399,
                            "outline_medium": [
                                "optimize conditions for bead-based assay",
                                "evaluate parameters for assay sensitivity and specificity",
                                "analyze signal gain as a function of parameters"
                            ],
                            "outline_short": [
                                "describe assay optimization"
                            ]
                        },
                        {
                            "title": "Example 4",
                            "paragraphs": [
                                "**Assay Performance: Sensitivity**",
                                "The 150-kDa BoNT/A holotoxin (from two different commercial sources) and the 500-kDa BoNT/A complex were serially diluted and tested by BoNT/A ALISSA in 10% fetal bovine serum (FBS) (FIG. 4A). Significant signals of several thousand relative fluorescence units (RFU) were still observed for concentrations of one attomol/L in 1-mL sample volumes. Signals for toxin complex were always stronger then for identical molar concentrations of holotoxin. The practical detection limit in the diluted serum was extrapolated to be ˜0.5 attomol/L, which corresponds to 250 attogram toxin complex in 1 mL sample (FIGS. 3, 4a). To determine ALISSA use in complex samples, the assay's sensitivity for the toxin complex was also determined in spiked undiluted human serum, carrot juice, reconstituted non-fat powdered milk, fresh milk, and gelatin phosphate (GP) diluent (FIG. 4B). GP diluent is typically used in the life mouse toxicity bioassay. Although somewhat lower than in toxin-spiked samples with 10% FBS, discernable fluorescent intensities above background were still detected for 1 attomol/L toxin complex, with signal intensities of ˜14,800, ˜14,750, ˜3100, ˜2500 and ˜650 RFU above background in undiluted human serum, 50% carrot juice, GP diluent, non-fat milk and fresh milk, respectively. A fat-solubilizing wash buffer (with HEPES) was required for analyses of fresh milk samples. Overall, the ALISSA signals correlate proportionally with the toxin concentration over several orders magnitude (FIG. 4).",
                                "The ALISSA performed with comparable sensitivities in undiluted human serum, 50% carrot juice (adjusted to pH 7.5 with binding buffer), reconstituted powdered milk, fresh milk and GP-diluent. In direct comparison with the mouse assay, the ALISSA was considerably faster and 4-5 orders of magnitude more sensitive."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "test assay sensitivity",
                                "test assay performance in complex samples",
                                "compare ALISSA with mouse assay"
                            ],
                            "num_characters": 1857,
                            "outline_medium": [
                                "describe assay performance: sensitivity"
                            ],
                            "outline_short": [
                                "describe assay performance: sensitivity"
                            ]
                        },
                        {
                            "title": "Example 5",
                            "paragraphs": [
                                "**Assay Performance: Specificity and Kinetics**",
                                "Specificity of the assay and sensitivity and kinetics of the bead-based ALISSA compared to those of the bead-free conversion of the reporter peptide were tested. To test non-specific agents, serum samples were utilized with: 1) beads conjugated to purified nonspecific rabbit IgG; 2) trypsin, because it is also able to cleave SNAPtide, but cannot be enriched on the beads; 3) BoNT type B complex; 4) BoNT type E complex; 5) type A toxoid, which is a non-toxic, antibody-binding formaldehyde inactivated derivative of BoNT/A; and 6) a toxin-free control (FIG. 5a, 5b). The bead-based assay produced low intensity signals with the non-specific agents trypsin, BoNT/A toxoid, BoNT/B and E) and only at the highest tested concentrations of 10-100 pmol/L. The bead-free reaction mixture yielded signals only with trypsin and BoNT/A for concentrations of 1 pmol/L or greater, and these signals were weak. Equimolar trypsin concentrations led to even higher signals than the BoNT/A complex. Toxin type B and E complexes, for which the peptide substrate does not contain specific cleavage sites, produced very weak signals only at the 10 and 100-picomolar concentrations that were even lower than those obtained with the bead-based assay. Interestingly, the bead-based detection of BoNT/A produced significantly higher signals—at any given toxin dilution step—than did the bead-free reaction mixture. For the bead-free reaction mixture discernable signals were only obtained for BoNT/A concentrations greater or equal to 1 pmol/L. In contrast, strong signals were obtained with BoNT/A at concentrations as low as 1 attomol/L when used in the bead-based assay. For the comparison of bead-free versus bead-based assay, toxin concentrations and total toxin amounts were identical in each dilution step.",
                                "This remarkable enhancement of the substrate cleavage reaction as a response to BoNT/A immobilization prompted a determination of the kinetic parameters of the SNAPtide conversion reaction. For comparative purposes, fixed total BoNT/A complex concentrations of 100 pmol/L were used in 1-mL sample volumes for both the reactions with the free and with the bead-immobilized toxin. At this concentration, BoNT/A is safely detected with either method. Kinetic constants were obtained from plots of initial rates versus eight concentrations of substrate ranging 0.0125 to 5 μM. (Blanch and Clark, 1997; Liu et al., 1999). Initial velocity for reactions were calculated from linear regression analysis as μM of cleaved SNAPTide/min/mg enzyme. The values are the averages of 4 independent determinations±error propagation. The Km value for the BoNT/A was calculated from the Lineweaver—Burk double reciprocal plot. No-enzyme reference was applied in establishing baseline RFU when there is no enzyme activity. This control contained all components of the BoNT/A reaction mixture except the enzyme, replaced with the equivalent volume of reaction buffer. Background fluorescence was determined by using wells with only SNAPtide. Results are the averages of triplicate determinations",
                                "The hydrolysis of SNAPtide by BoNT/A obeys Michaelis-Menten kinetics and is characterized by a linear relationship between the reciprocal substrate concentration and the activity of the enzyme (FIGS. 5c, 5d). Michaelis constancies (Km) and maximal conversion rates (Vmax) were calculated from the linear regression of the reciprocal SNAPtide concentration 1/[SNAPtide] versus the reciprocal reaction rate (1/V). The Km of the immobilized enzyme is 3.2-fold lower than for the free enzyme, suggesting a slightly higher enzyme/substrate affinity. Interestingly, the main effect was found in the rate of catalysis: the immobilized BoNT/A is capable of converting its substrate with an 18-fold increased maximal conversion rate than the free toxin. The corresponding values for Vmax at 25° C. were 0.79±0.04 μM/min/μg and 14.49±0.27 μM/min/μg for free (non-immobilized) and immobilized enzymes, respectively."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "test assay specificity",
                                "test non-specific agents",
                                "compare bead-based and bead-free assays",
                                "determine kinetic parameters",
                                "calculate Km and Vmax values",
                                "analyze Lineweaver-Burk plot",
                                "determine Michaelis-Menten kinetics",
                                "compare immobilized and free enzymes"
                            ],
                            "num_characters": 4023,
                            "outline_medium": [
                                "test specificity of assay",
                                "compare bead-based and bead-free assays",
                                "determine kinetic parameters of SNAPtide conversion reaction",
                                "analyze Michaelis-Menten kinetics"
                            ],
                            "outline_short": [
                                "describe assay performance: specificity and kinetics",
                                "determine kinetic parameters of the SNAPtide conversion reaction"
                            ]
                        },
                        {
                            "title": "Example 6",
                            "paragraphs": [
                                "**Assay Performance**",
                                "Comparison of BoNT/A ALISSA with the Live Mouse Assay.",
                                "A split aliquot of 100 ng BoNT/A toxin complex was shipped in a refrigerated hazmat container to collaborators at the Infant Botulism Treatment and Prevention Program of the California Department of Public Health (CDPH) in Richmond for use in the diagnostic life mouse bioassay. Identical dilution series of the toxin in GP-diluent were prepared concurrently in pre-prepared and weighed vials at both institutions. The approximate time of the i.p. mouse injections at the two locations coincided by a margin of minutes. Mice weighing 18-22 g each were injected i.p. with 0.5 mL/mouse of sample and watched for signs of botulism or death for the standard 96 hour observation period. The results of BoNT/A ALISSA became available after ˜2.5 hours and mice were observed for three days (Table 2).",
                                "The mouse assay was positive for the highest test concentrations of 300 and 60 pg/mL (0.5 mL injected per mouse). Mild symptoms of botulism developed within 96 hours in three of five mice that received one hundreds of the theoretical LD50 (0.3 pg). All other animals that received 10−4 or 10−5 LD50 remained completely disease free and asymptomatic. BoNT/A ALLISA produced clear signals throughout the dilution series. The lowest BoNT/ALLISA fluorescence signal at the lowest test concentration was 0.6 fg/mL (10−5 LD50), which is still ˜3,100 units above background levels.",
                                "The BoNT/A ALISSA avoids interference with other sample components by using a highly BoNT/A-specific affinity matrix and by using a BoNT/A-specific substrate to exploit the natural proteolytic activity of the toxin. Both steps also amplify the signal by 1) localized enrichment of the toxin; and 2) through enzymatic conversion of billions of substrate molecules per toxin molecule. The capture matrix is designed to stably enrich the toxin, while retaining its enzymatic activity and by purifying the toxin from other non-specific proteases contained in the sample. The beaded-protein A matrix binds to the antibodies via the Fc regions, orienting the antigen binding domains away from the bead surface and into the surrounding sample fluid. This provides higher accessibility to target toxin molecules.",
                                "The plateaus observed in the assay's response curves used to optimize substrate concentration and size and volume proportions of the immunosorbent matrix represent saturation effects that indicate when the substrate concentration is no longer rate-limiting. Antibody binding capacity was about 50 ug antibody per one million beads which estimates to an antibody dissociation constant kD at half maximum saturation to be approximately 15 nM. Use of antibodies having higher binding affinity will increase assay sensitivity. High affinity anti-BoNT antibodies have been used as antitoxins to neutralize systemic botulinum toxin in botulism patients (Marks 2004; Garcia-Rodriguez 2007). This mode of “neutralization” however, should not be confused with inactivation of the toxin's enzymatic activity by steric hindrance of the catalytic site resulting from antibody binding. Antibody-mediated “neutralization” of toxin in vivo depends on formation of antibody-antigen complex and hepatic accumulation and clearance (Ravichandran 2006; Simpson 2001).",
                                "Use of a standard curve to measure concentration-dependent intensity of fluorescence signal of un-quenched calibration peptide (FIG. 6) allowed determination of the molar conversion rate for the substrate molecules. A calculated substrate conversion rate of approximately two billion substrate molecules per one immobilized toxin molecule per hour was calculated for the 10 attomolar toxin concentration. The reaction being limited by the rate at which the toxin becomes inactivated. Factors such as chelation of the zinc atom by DTT, denaturation of the toxin by the reducing buffer, or proteolytic degradation of the toxin either through autoproteolysis or by a contaminant protease may also contribute to inactivation of the toxin.",
                                "In certain embodiments, optimal temperature is 37° C. coincident with the temperature at which the natural action of the toxin occurs and at which IgG antibody binding may be optimal. Higher temperatures may inactivate the toxin. Preferably, the pH of the sample is approximately neutral (between about 6 and about 8). Assay sensitivity may also be further increased by reducing background fluorescence of uncleaved substrate such as uncleaved SNAPtide.",
                                "In certain embodiments, a peptide conjugated FRET pair with a 2,4-dinitrophenyl acceptor and a 4-methyl-7-dimethylamino-coumarin donor may be used as a substrate. These and other FRET pairs having better spectral overlap can allow lower background fluorescence with good kinetic properties.",
                                "In certain embodiments, an approximately 18-fold increase in maximum conversion rate vmax and a three-fold higher affinity to the substrate (three-fold lower kM) for the immobilized toxin was observed as compared to free toxin in solution (FIGS. 5C and 5D). The average bead surface area in the ALISSA assay is approximately 7.85 cm2 per sample (based on a 50 μm average bead diameter) whereas the antigen-binding surface area in a conventional solid-phase or solid-state ELISA with a 96-well flat-bottom microplate measures only about 0.256 cm2 per well. Thus, the available reaction surface area in the ALISSA is about 30-fold greater than provided by prior art methods. Such immobilized toxin is also better protected from proteolysis and aggregation. Molecules of unstable BoNT/A light chain are sufficiently separated to diminish any autocatalytic degradation. Use of bead-based assay also allows for more stringent wash procedures thereby diminishing interference by other proteases. This was demonstrated for BoNT/A when compared to equimolar concentrations of trypsin, BoNT/B and BoNT/E. The increased reaction surface area and control of diffusion through more frequent substrate-enzyme interactions also contributes to the improved enzymatic activity."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "compare BoNT/A ALISSA with live mouse assay",
                                "describe split aliquot of BoNT/A toxin complex",
                                "detail identical dilution series of toxin in GP-diluent",
                                "describe i.p. mouse injections and observation period",
                                "present results of BoNT/A ALISSA and mouse assay",
                                "motivate use of highly BoNT/A-specific affinity matrix",
                                "describe capture matrix design and function",
                                "explain optimization of substrate concentration and size",
                                "discuss antibody binding capacity and dissociation constant",
                                "describe use of standard curve to measure fluorescence signal",
                                "calculate substrate conversion rate for immobilized toxin",
                                "discuss factors affecting toxin inactivation"
                            ],
                            "num_characters": 6049,
                            "outline_medium": [
                                "compare BoNT/A ALISSA with live mouse assay",
                                "describe assay performance",
                                "explain BoNT/A ALISSA's interference avoidance",
                                "discuss optimization of substrate concentration",
                                "describe antibody binding capacity",
                                "discuss factors affecting toxin inactivation"
                            ],
                            "outline_short": [
                                "compare BoNT/A ALISSA with live mouse assay",
                                "describe BoNT/A ALISSA assay performance",
                                "discuss optimization of assay conditions"
                            ]
                        },
                        {
                            "title": "Example 7",
                            "paragraphs": [
                                "**Fluorogenic Substrates**",
                                "Fluorogenic peptides were synthesized using standard Fmoc chemistry methodology well known in the art. Commercial SNAPtide (List Biological Laboratories) contains a fluorescein isothiocyanate (FITC)-labeled N-terminus and a thiourea group that is unstable over time or when in the presence of acids. This can result in undesired background signal. To avoid this, different SNAPtide-like peptides that were N-terminally labelled with either 5-carboxyfluorescein (5-FAM)- or 4-Methylumbelliferone (4-MU) were synthesized. The resulting BoNT substrates contain stable peptide bonds and are readily cleaved by BoNT/A (FIG. 8).",
                                "The effect of the substrate's C-terminal amino acid corresponding to M202 in the native human SNAP-25 sequence was also determined. Commercial SNAPtide replaces the M202 in the native sequence with a Norleucine residue. This Norleucine residue provided efficient cleavage of the substrate as deletion or replacement with aminohexanoid acid greatly diminished the efficiency of the BoNT/A-mediated cleavage reaction (FIG. 8). The Norleucine used is a non-oxidizeable surrogate for the methionine residue located at 202.",
                                "By applying a molecular modelling and docking approach, several novel substrates were produced (Tables 3-5; SEQ ID NOS: 12-14). The chemical structures (identified as “1”, “2” and “3”) of each exemplary substrate is depicted below its corresponding table listing of amino acid sequence. In the below exemplary embodiments, each of the novel peptide substrates contained 12 amino acid residues. In addition, a control peptide having and RA to EL mutation (indicated in bold text) was produced (Table 6; SEQ ID NO: 15). The BoNT/A protease cannot efficiently cleave this peptide while other proteases are able to cleave this peptide, making this a suitable control peptide for use in the ALISSA. The control peptide (Table 6; SEQ ID NO: 15) allows compensation for the background signal resulting from non-BoNT/A protease activity or non-target protease activity.",
                                "This exemplary control peptide cannot be efficiently cleaved by botulinum neurotoxin serotype A, but can be cleaved by other proteases. Hence it can be used in the ALISSA assay as a control for non-specific (non-BoNT/A) protease activity. Below is the structure of one of three possible versions of the control peptide.",
                                "By employing the above-described methods, several new substrates were identified for use in the ALISSA assay. The substrates contain 12 amino acid residues and exhibited higher chemical stability and high sensitivity for BoNT detection when used as substrate. Peptides useful as control substrates were also generated by employing the above-described methods."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe synthesis of fluorogenic peptides",
                                "detail effect of C-terminal amino acid on substrate cleavage",
                                "apply molecular modeling and docking approach",
                                "produce novel substrates with improved properties",
                                "describe control peptide for non-BoNT/A protease activity"
                            ],
                            "num_characters": 2715,
                            "outline_medium": [
                                "synthesize fluorogenic peptides",
                                "determine effect of substrate's C-terminal amino acid"
                            ],
                            "outline_short": [
                                "describe synthesis and characterization of fluorogenic substrates"
                            ]
                        },
                        {
                            "title": "Example 8",
                            "paragraphs": [
                                "**Bioluminescent Substrates**",
                                "A series of protein engineering experiments were conducted to determine whether extended sequences of recombinant SNAP25 can be expressed in bacteria and remain cleavable by BoNT. Experiments were also conducted to determine whether recombinant firefly luciferase (FFL) with C-terminal histidine tags or other modifications remain functional. Functional recombinant SNAP25 (rSNAP25) was expressed using commercial brain cDNA library. Gel-shift experiment demonstrated that rSNAP25 is readily cleaved by BoNT/A (FIG. 9) while having a C-terminal hexahistidine tag. The rSNAP25 was also cleaved at a faster rate as compared to fluorogenic peptide SNAPtide. To generate recombinant FFL, a firefly luciferase yeast plasmid (pGAL-FFL) was obtained from a gene depository and used as a template to construct a pET-vector based on recombinant firefly luciferase expression system. The recombinant FFL had a C-terminal hexahistidine tag and was readily expressed in E. coli. When FFL-expressing bacteria were combined with 5-fluoroluciferin, the resulting light signal was strong enough to be visible with the naked eye indicating that the protein was functional (FIG. 9). The signal exceeded the maximally permissible luminescence signal strength of a Victor luminometer plate reader.",
                                "Fluorogenic peptide library for producing substrates was established using previously described methods (Aina 2007; Juskowiak 2004; Rosse 2000). Synthetic peptide libraries are generated using natural and non-natural or non-proteinogenic amino acids to improve resistance toward non-target proteases. As described further below, a beaded synthesis resin support was used to perform a one-bead-one-compound approach in which each bead contains only one type of peptide in picomolar quantities. The method used was as described previously (Aina 2005; Lam 2003). On-bead conversion of the substrate was performed for several cycles of selection by first incubating the peptide bead library without BoNT in presence of a relevant sample type (e.g. serum or homogenized mouse organs) for extended periods of time. Peptides containing unstable peptides become fluorescent and were removed by particle sorting using a flow cytometer. The beads that remained non-fluorescent were then exposed to BoNT. Beads that became rapidly fluorescent in presence of BoNT were separated with either a micromanipulator (tetrad dissection microscope at COH) or flow cytometer. The library was constructed such that the peptides can be dissociated from the beads readily (e.g. by CNBr cleavage) in order to allow decoding of the sequence of the fluorogenic substrate by mass spectrometry."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "express recombinant SNAP25 in bacteria",
                                "demonstrate cleavage of rSNAP25 by BoNT/A",
                                "express recombinant firefly luciferase in E. coli",
                                "describe fluorogenic peptide library generation",
                                "detail on-bead conversion and selection of substrates"
                            ],
                            "num_characters": 2675,
                            "outline_medium": [
                                "express recombinant SNAP25",
                                "generate recombinant firefly luciferase"
                            ],
                            "outline_short": [
                                "describe expression and characterization of bioluminescent substrates"
                            ]
                        },
                        {
                            "title": "Example 9",
                            "paragraphs": [
                                "**One-Bead-One-Peptide Libraries**",
                                "One-bead-one-peptide libraries were generated by Fmoc (fluoren-9-ylmethoxycarbonyl) chemistry. Using a split and mix approach, the synthetic peptides begin with a block of 3 D-amino acids followed by 5 randomized L-amino acids and another block of 3-D-amino acids. Addition of 3 D-amino acids to the N- and C-termini of a peptide increases its stability. Natural proteinogenic, D-amino acids, rare as well as unnatural amino acids (Table 7) are used. The number of beads used are about three times greater than the number of possible permutations to obtain statistically relevant and reproducible results. For example, if 13 different amino acids are used for synthesis of randomized 5-mer peptides, 1.6 billion compounds are obtained and therefore 3.6 billion beads are screened. When testing a suitable linker with an existing substrate, where an undesired amount of the cleaved fluorophore containing peptide remains on the resin beads used to generate the library, the linker will be tested with existing substrate and if desired, the order of fluorophore and quencher can be reversed. Decoding of the novel fluorogenic substrate sequence is then performed by mass spectrometry analysis.",
                                "Listed below in Table 7 are commercially available (e.g. Sigma Chemicals), non-natural amino acids that are suitable for use in generating one or more library of fluorogenic peptides.",
                                "Use of purified fusion proteins as substrates will allow for further characterization of the novel fusion substrates. Mass spectrometry and gel electrophoresis will be used on the purified proteins to measure the efficiency of the cleavage reaction.",
                                "**Example 10**",
                                "**Identification of Luminogenic Protein Substrates**",
                                "Genetically engineered variants of recombinant luciferase protein that become activated by specific cleavage reactions are obtained using the following strategies: 1) complementation of inactive luciferase fragments to restore active luciferase molecules; and 2) specific reactions to release the D-luciferin as a substrate for firefly luciferase (FFL from Photinus pyralis).",
                                "Split FFL constructs are designed and used to detect presence of a specific proteolytic activity. Mutants of FFL can be used to emit light at distinct wavelength varying from greenish-yellow (˜560 nm) to orange and red (605 to 613 nm) which allows multiplex detection of several agents on a single device. Also, the color of the light emitted by Renilla reniformis (sea pansy) luciferase (RLuc) can be tuned by the chemical environment in which the light-emitting coelenterazine oxidation is performed (Miyaki et al., “Bringing bioluminescence into the picture,” Nature Methods, 4:616-617 (2007)).",
                                "Using this cloning strategy, a set of rSNAP-25/FFL fusion constructs were generated with pETblue-2 and pET28a expression vectors. Because co-expression of overlapping split FFL domains reconstitutes active FFL, an overlapping FFL fusion construct that is interrupted by an integral SNAP-25 sequence containing the BoNT/A cleavage site (within SNAP-25 residues 187 to 206) was cloned and expressed. The resulting fusion protein encompasses FFL[1-475]SNAP-25[187-206]FFL[265-550] (brackets denote the amino acid ranges). In addition an overlapping FFL fusion protein encompassing FFL[1-478]SNAP-25[187-206]FFL[265-550] was constructed (SEQ ID NO: 3) and expressed as product (SEQ ID NO: 4).",
                                "A fusion protein containing N-terminal SNAP25[187-206] followed by full length FFL[1]550] was also designed and tested to determine whether N-terminal SNAP-25 can alter FFL activity. Strong signals were obtained from bacterial expressing the fusion protein SNAP-25[187-206]-FFL[1-550], with signal doubling in intensity when in presence of BoNT/A complex. Overlapping split FFL construct FFL[1-475]-SNAP25[187-206]-FFL[265-550] also produced a clear nearly two-fold signal increase in presence of BoNT/A. Overlapping split FFL construct FFL[1-478]-SNAP25[187-206]-FFL[265-550] (SEQ ID NO: 4) also produced a significant increased signal in presence of BoNT/A. The construct FFL[1-475]-SNAP25[187-206] produced an insignificant signal when in presence or absence of BoNT/A treatment.",
                                "FIG. 12 provides a synthesis schematic for recombinant overlapping luciferase fragments having an interspaced SNAP25 sequence for BoNT/A detection. For other BoNT serotypes, the corresponding sequences from the appropriate SNARE complex molecule are used.",
                                "**Example 11**",
                                "**Expandable Bioluminescent Detection System**",
                                "A dual-strategy approach was employed to create an expandable bioluminescent detection system for the detection of toxin or protease activity. This system was initially developed for detection of BoNT/A as a model, and can readily expandable to detection of all BoNT classes and subtypes as well as other toxins or enzymes having measurable activity. Strategy 1 comprises a dual reaction chamber including 2 vials and two types of beads (FIG. 11A). This strategy uses FFL fusion proteins to recombine and to restore FFL activity similar to previously described methods (Paulmurugan et al., “Combinatorial library screening for developing an improved split-firefly luciferase fragment-assisted complementation system for studying protein-protein interactions,” Anal Chem 79:2346-2353 (2007); Paulmurugan et al., “Firefly luciferase enzyme fragment complementation for imaging in cells and living animals,” Anal Chem 77:1295-1302 (2005)). The N-terminal region of FFL that is unable to support bioluminescent reactivity (residues 1 to 475 or shorter) was fused to the binding domain of a known protein having a well characterized binding affinity for another binding partner. The other binding partner was fused to the C-terminal portion of FFL (residues 476 to 550) and to a BoNT/A cleavable SNAP25 sequence (FIG. 11A1). The modified C-terminal FFL fusion was attached to beads via the SNAP25 domain and maintained in a macrofluidic reaction chamber that is capable of interfacing to 1 ml sized sample volumes. Interaction with BoNT/A cleaves the C-terminal FFL fusion, leaving the substrate on the bead surface, to which it has a specific affinity (e.g. by use of a histidine-tag) (FIG. 11A2). Alternatively, the cleaved substrate can be captured on a specific enrichment column. After sufficient exposure to the sample, the accumulated cleaved substrate was eluted and transferred to a microfluidic reaction chamber where it encountered the immobilized N-terminal FFL domain fusion protein. Combination of the FFL fragments occurs through dimerization of the binding protein domains and bioluminescence is detected in the presence of adenosine triphosphate (ATP) and luciferin. The advantage of the dual chamber is that accumulation of cleaved substrate can be obtained over time for samples that do not require further purification, such as, for example, clear serum samples. Turbid samples may require additional purification such as by immuno-capture of the toxin, for which a single chamber (described below) may be more suitable.",
                                "In Strategy 2, a single chamber system is employed wherein a luminogenic FFL derivative is directly exposed to affinity-enriched toxin such as BoNT/A (FIG. 11B). The luminogenic FFL derivative can either be constructed directly to the fusion protein or with a fusion of overlapping FFL fragments that are spaced by a cleavable SNAP25 sequence. We have found that the overlapping FFL fragments (1-478) and (265-550) recombine to produce up to 4% of the activity of FFL, possibly by formation of a heterodimer.",
                                "**Example 12**",
                                "**Detection of Systemic BoNT**",
                                "Using the ALISSA method described herein, BoNT/A levels were measured in serum and organs of intoxicated mice. The ALISSA was performed on serum, lung and liver of mice that had been intraperitoneally injected with different doses of BoNT/A complex or with a mock injection of buffer only (control mice). (FIG. 10). Organs were homogenized using the Whirl bag method (Walsh et al., “Tissue homogenization with sterile reinforced polyethylene bags for quantitative culture of Candida albicans,” J. Clin Microbiol. 25:931-932 (1987). BoNT/A was detected systemically as shown in FIG. 10. BoNT/A was detected in blood and liver harvested two hours after injection with toxin. BoNT/A levels in the lung remained low.",
                                "**Example 13**",
                                "**ALISSA Technology on Additional Targets**",
                                "The ALISSA technology is also applicable for use with targets such as enzymes or toxins other than BoNT. Using commercial fluorogenic MAPKKide (List Biological Laboratories) and anthrax lethal factor (LF) as toxin, nanomolar detection limits were achieved. When LF was immobilized on anti-LF-agarose beads, the enzymatic activity of LF was accelerated and detection of femtomolar and lower concentrations was achieved. The ALISSA technology was also extended to detection of human chitinases (e.g. CHIT1 and AMCase) (FIG. 16) and non-metalloproteases (Pep1 and Pep2 of Aspergillus fumigatus) (FIG. 17). As shown in FIGS. 16 and 17, the ALISSA technology is applicable for use with a wide variety of targets including non-toxin targets and enzymes.",
                                "The examples disclosed herein are provided to better illustrate the claimed invention and are not to be interpreted as limiting the scope of the invention. To the extent that specific materials are mentioned, it is merely for purposes of illustration and is not intended to limit the invention. One skilled in the art may develop equivalent means or reactants without the exercise of inventive capacity and without departing from the scope of the invention. It will be understood that many variations can be made in the procedures herein described while still remaining within the bounds of the present invention. It is the intention of the inventors that such variations are included within the scope of the invention. All references cited herein are incorporated by reference as if fully set forth herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "generate one-bead-one-peptide libraries",
                                "describe Fmoc chemistry and split and mix approach",
                                "detail use of natural and non-natural amino acids",
                                "explain addition of D-amino acids for stability",
                                "describe use of rare and unnatural amino acids",
                                "detail number of beads used for statistically relevant results",
                                "describe testing of suitable linker with existing substrate",
                                "detail decoding of novel fluorogenic substrate sequence",
                                "describe use of purified fusion proteins as substrates",
                                "detail mass spectrometry and gel electrophoresis analysis",
                                "describe genetically engineered variants of luciferase",
                                "detail complementation of inactive luciferase fragments",
                                "describe specific reactions to release D-luciferin",
                                "detail use of mutants of FFL for multiplex detection",
                                "describe tuning of light emission by chemical environment",
                                "detail cloning strategy for rSNAP-25/FFL fusion constructs",
                                "describe expression of overlapping FFL fusion constructs",
                                "detail signal increase in presence of BoNT/A",
                                "describe synthesis schematic for recombinant luciferase fragments"
                            ],
                            "num_characters": 9932,
                            "outline_medium": [
                                "establish fluorogenic peptide library",
                                "describe one-bead-one-compound approach",
                                "perform on-bead conversion of substrate",
                                "separate beads by particle sorting",
                                "decode sequence of fluorogenic substrate",
                                "generate one-bead-one-peptide libraries",
                                "describe use of non-natural amino acids",
                                "test linker with existing substrate",
                                "decode novel fluorogenic substrate sequence"
                            ],
                            "outline_short": [
                                "describe generation of fluorogenic peptide library",
                                "discuss on-bead conversion and selection of substrates",
                                "describe decoding of substrate sequences by mass spectrometry",
                                "discuss use of purified fusion proteins as substrates"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1-31. (canceled)",
        "32. A method for detecting the presence of a toxin or enzyme in a sample comprising:\na) providing an enrichment matrix and a toxin or enzyme specific substrate; wherein coupled to the matrix is at least one antibody that is specific to the toxin or enzyme, and the substrate is capable of eliciting a detectable fluorogenic or luminogenic signal when modified by the toxin or enzyme;\nb) exposing a sample putatively containing a toxin or enzyme to the matrix and the substrate, wherein the exposure occurs under conditions permitting binding of the toxin or enzyme to the antibody; and\nc) detecting the presence of the toxin or enzyme by measuring the signal elicited by the modified substrate.",
        "33. The method of claim 32 wherein the exposure of the sample to the matrix occurs prior to the exposure of the sample to the substrate.",
        "34. The method of claim 32 wherein the toxin or enzyme retains measurable enzymatic activity subsequent to its binding by the antibody.",
        "35. The method of claim 32 wherein binding of the toxin or enzyme to the antibody results in an acceleration of the toxin or enzyme's activity on its specific substrate.",
        "36. The method of claim 32 wherein the toxin or enzyme is selected from the group consisting of a botulinum neurotoxin, a bacillus anthracis lethal factor, a human chitinase, and an aspergillus fumigatus protease.",
        "37. The method of claim 36 wherein said toxin is botulinum neurotoxin serotype A (BoNT/A).",
        "38. The method of claim 32 wherein the enrichment matrix comprises anti-BoNT/A antibodies bound to bead-immobilized protein A molecules.",
        "39. The method of claim 32 wherein the matrix is an immunosorbent support comprised of loose beads or a fixed column.",
        "40. The method of claim 32 wherein the substrate has a chemical formula selected from the group consisting of C94H127N23O26, C115H137N23O32, C98H134N26O28, C89H132N98O26, and C96H128N20O28.",
        "41. The method of claim 32 wherein the substrate is selected from the group consisting of:",
        "42. An isolated botulinum toxin serotype A (BoNT/A) substrate comprising: (a) a donor fluorophore; (b) an acceptor having an absorbance spectrum overlapping the emission spectrum of said donor fluorophore; and (c) a 12 or fewer, amino acid BoNT/A recognition sequence comprising a cleavage site, said recognition sequence comprising KIDEANQRATKX, wherein X is norleucine.",
        "43. The substrate of claim 42 having a chemical formula selected from the group consisting of C94H127N23O26, C115H137N23O32, and C96H128N20O28.",
        "44. The substrate of claim 42 wherein the substrate is selected from the group consisting of:",
        "45. A compound for use as a control substrate in a neurotoxin detection assay having a chemical formula selected from the group consisting of: C96H128N20O28; C98H134N26O28, and C89H132N98O26.",
        "46. The compound of claim 45 wherein the substrate is 5-Fam-Lys[5-Fam]IleAspGluAlaAsnGlnGluLeuThrLys[DABCYL]Nle (SEQ ID NO:15).",
        "47. The compound of claim 45 wherein the substrate is 5-Fam-LysileAspGluAlaAsnGlnGluLeuThrLys[DABCYL]Nle (SEQ ID NO: 17)",
        "48. The compound of claim 45 wherein the substrate is Lys[5-Fam]IleAspGluAlaAsnGlnGluLeuThrLys[DABCYL]Nle (SEQ ID NO: 18)",
        "49. A method for identifying a botulinum toxin serotype (BoNT)-specific luminogenic substrate comprising:\n(a) contacting a putative luminogenic substrate with a botulinum toxin; wherein the putative luminogenic substrate comprises a luciferase-BoNT cleavage site fusion protein;\n(b) measuring the luminescence emitted in the presence and in the absence of the botulinum toxin; wherein the presence of, or an increase in, the luminescence emitted in the presence of the botulinum toxin identifies the putative substrate as a botulinum toxin-specific luminogenic substrate.",
        "50. The method of claim 49 wherein the fusion protein is comprised of overlapping luciferase fragments and an intervening BoNT cleavage site.",
        "51. The method of claim 50 wherein the luciferase is firefly luciferase.",
        "52. The method of claim 49 wherein the fusion protein comprises: a first firefly luciferase fragment (1-475) fused to a SNAP protein having a BoNT cleavage site, and a second firefly luciferase fragment (265-550).",
        "53. The method of claim 49 wherein the fusion protein is encoded by a nucleic acid sequence having at least 90% homology to SEQ ID NO: 3.",
        "54. A method for detecting the presence of a toxin or enzyme in a sample comprising:\n(a) providing an N-terminal domain of a luciferase protein and a substrate having a modification site that is fused to an overlapping C-terminal domain of the luciferase protein, wherein when the substrate is modified, the overlapping C-terminal domain is released and an increase in luminescent signal is produced;\n(b) mixing a sample with the substrate and the N-terminal domain luciferase; and\n(c) detecting the presence of the toxin or enzyme by measuring an increase in luminescent signal.",
        "55. The method of claim 54 wherein mixing of the sample with the substrate occurs separate from and prior to mixing of the modified substrate with the N-terminal domain.",
        "56. The method of claim 54 wherein the substrate is a protein comprising the sequence identified as SEQ ID NO: 4.",
        "57. A method for identifying a botulinum toxin (BoNT)-specific fluorogenic substrate comprising:\n(a) providing a putative BoNT-specific peptide obtained by screening one or more synthetic combinatorial peptide library, wherein the peptide has a fluorescent label;\n(b) contacting a sample of the putative BoNT-specific peptide with a botulinum toxin;\n(c) measuring the fluorescence of the sample in the presence and in the absence of the botulinum toxin; wherein an increase in the fluorescence of the sample when in the presence of the botulinum toxin identifies the peptide as a botulinum toxin-specific fluorogenic substrate.",
        "58. The method of claim 57 wherein the peptide is labelled with 5-carboxyfluorescein (5-FAM) or 4-methylumbelliferone (4-MU) at its N-terminal.",
        "59. A toxin or enzyme detection kit comprising:\na) an enrichment matrix comprised of one or more immunoaffinity beads to which at least one toxin or enzyme specific antibody is bound; and\nb) at least one substrate, wherein upon interaction of the substrate with the toxin or enzyme, a detectable fluorescent or luminescent signal is produced.",
        "60. The kit of claim 59 wherein the substrate has a 12 or fewer, amino acid sequence selected from the group consisting of: a SNARE protein, a synaptic protein, and a vesical-associated membrane protein.",
        "61. The kit of claim 60 wherein the synaptic protein is a SNAP-25, a synaptobrevin or a syntaxin.",
        "62. The kit of claim 59 wherein the substrate is selected from the group consisting of:",
        "63. The kit of claim 62 wherein the toxin is a botulinum neurotoxin and the substrate is used as a control substrate for the detection of non-specific botulinum neurotoxin activity and the substrate is selected from the group consisting of:",
        "64. The kit of claim 62 wherein the toxin or enzyme is selected from the group consisting of: botulinum neurotoxin, bacillus anthracis lethal factor, human chitinase, and aspergillus fumigatus protease.",
        "65. The kit of claim 62 wherein the substrate has a chemical formula selected from the group consisting of C94H127N23O26, C115H137N23O32, C98H134N26O28, C89H132N98O26, and C96H128N20O28.",
        "66. The kit of claim 62 wherein the substrate is a protein identified as SEQ ID NO:4.",
        "67. The compound of claim 45 wherein the substrate is (5-Fam)-ThrArgIleAspGluAlaAsnGlnArgAlaThrLys[DABCYL]Hex (SEQ ID NO: 19), wherein Hex is 6-aminohexanoic acid; or\n(4-MU)-ThrArgIleAspGluAlaAsnGlnArgAlaThrLys[DABCYL]Hex (SEQ ID NO: 5), wherein Hex is 6-aminohexanoic acid."
    ]
}