{
    "id": "US20230120408",
    "authors": [
        "Changsub Kim",
        "Daniel P. Cunnane"
    ],
    "title": "WAFER SCALE PRODUCTION OF SUPERCONDUCTING MAGNESIUM DIBORIDE  THIN FILMS WITH HIGH TRANSITION TEMPERATURE",
    "date": "2022-10-18 00:00:00",
    "abstract": "A method of making a film comprising depositing magnesium and boron on a substrate; depositing a capping layer to form a capped film; and cooling the capped film so as to form a magnesium diboride film. The depositing may comprise tuning a ratio of the Mg to the B so as to tailor a resistivity of the magnesium diboride film anywhere in the range 10 μΩ*cm≤ρ≤500 mΩ*cm, and so as to form the magnesium diboride film comprising a superconductive film having a critical temperature greater than 10K or in a range 10K-40K. The magnesium diboride film can have an area greater than or equal to a circular area having a diameter of at least 4 inches; a thickness and sheet resistance varying by less than 10% over an entirety of the area; and a surface roughness less than 2 nm over the entirety of the area.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "1. Field of the Invention",
                            "paragraphs": [
                                "This invention relates to superconducting magnesium diboride films and methods of making the same."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define field of invention"
                            ],
                            "num_characters": 98,
                            "outline_medium": [
                                "define field of invention"
                            ],
                            "outline_short": [
                                "define field of invention"
                            ]
                        },
                        {
                            "title": "2. Description of the Related Art",
                            "paragraphs": [
                                "Magnesium diboride (MgB2) is a material that can have a superconducting transition temperature as high as 39 Kelvin. However, conventional fabrication techniques cannot manufacture magnesium diboride films with mechanical and electrical properties that enable commercially practical fabrication of devices from the films. The present invention satisfies these needs by providing the superconducting films with improved mechanical properties such as wafer-scale smoothness and uniformity."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe limitations of conventional techniques"
                            ],
                            "num_characters": 487,
                            "outline_medium": [
                                "describe limitations of prior art"
                            ],
                            "outline_short": [
                                "describe limitations of prior art"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "Example methods, wafers, and compositions of matter according to embodiments described herein include, but are not limited to, the following.",
                        "1. A wafer, comprising:",
                        "a superconducting MgB2 film, wherein the MgB2 film:",
                        "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                        "sheet resistance and a thickness varying by less than 10% over an entirety of the area; and",
                        "a surface roughness less than 1.5 nanometers (nm) over the entirety of the area.",
                        "2. The wafer of example 1, wherein the film has a resistivity ρ above 100 μΩ*cm or 100 μΩ*cm≤ρ≤10 mΩ*cm across an entirety of the area.",
                        "3. The wafer of example 1 or 2, wherein the MgB2 film has a critical temperature of at least 15 Kelvin (K).",
                        "4. The wafer of any of the examples 1-3, further comprising a capping layer comprising Ta or B on the MgB2 film.",
                        "5. A wafer, comprising:",
                        "a superconducting MgB2 film, wherein the MgB2 film:",
                        "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                        "a resistivity ρ 25 μΩ*cm≤ρ≤50 μΩ*cm across an entirety of the area",
                        "a surface roughness of 2 nm or less across an entirety of the area,",
                        "a thickness and sheet resistance varying by less than 10% across the entirety of the area; and a critical temperature greater than 15K across the entirety of the area.",
                        "6. The wafer of example 5, wherein the MgB2 film comprises a superconductive film having the critical temperature above 30 K.",
                        "7. The wafer of example 5 or 6, further comprising a capping layer comprising Ta or B on the MgB2 film.",
                        "8. A method of making a film comprising magnesium diboride, comprising:",
                        "depositing magnesium (Mg) and boron (B) on a substrate so as to form an Mg—B composite;",
                        "depositing a capping layer to form a capped film, wherein the capping layer has a first melting temperature higher than a second melting temperature of the magnesium;",
                        "thermally annealing the capped film at a temperature; and",
                        "cooling the capped film so that a MgB2 film is made.",
                        "9. The method of example 8, further comprising tuning a ratio of the Mg to the B so as to tailor:",
                        "a resistivity of the MgB2 film anywhere in the range 10 μΩ*cm≤ρ≤500 mΩ*cm, and",
                        "a critical temperature of the MgB2 film greater than 10K or in a range 10K-40K.",
                        "10. The method of example 8, further comprising selecting at least one of a thickness of the MgB2 film or the Mg—B composite, a surface area of the substrate, a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the MgB2 film comprising a superconductor, wherein the MgB2 film:",
                        "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                        "the thickness varying by less than 10% over an entirety of the area;",
                        "a surface roughness less than 1.5 nm over the entirety of the area; and",
                        "a resistivity of the MgB2 film in the range 50 μΩ*cm≤ρ≤100 mΩ*cm.",
                        "11. The method of example 8, further comprising selecting at least one of a thickness of the MgB2 film or the Mg—B composite, a surface area of the substrate; a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the MgB2 film comprising a superconductor, wherein the MgB2 film:",
                        "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                        "a resistivity 25 μΩ*cm≤ρ≤50 μΩ*cm across an entirety of the area",
                        "a surface roughness of 2 nm or less across an entirety of the area,",
                        "a thickness varying by less than 10% across the entirety of the area; and",
                        "has a critical temperature greater than 15K across the entirety of the area.",
                        "12. The method of any of the examples 8-11, wherein the depositing comprises sputtering, atomic layer deposition, chemical vapor deposition, or electron beam deposition.",
                        "13. The method of any of the examples 8-12, wherein the annealing is:",
                        "at the temperature above the second melting temperature but below the first melting temperature so as to form the MgB2 film into a superconductive film having a critical temperature above 30 Kelvin, or",
                        "at the temperature below both the second melting temperature so as to form a smoother MgB2 film having a surface roughness of less than 2 nm.",
                        "14. The method of any of the examples 8-13, wherein the depositing comprises depositing alternating layers of the boron and the magnesium under magnesium rich conditions, and selecting at least one of a thickness of the MgB2 film or a number of the layers to increase a critical temperature of the film above 15 K.",
                        "15. The method of any of the examples 8-14 further comprising controlling a hold time at the temperature depending on a thickness of the capping layer and so as to obtain a desired critical temperature for the MgB2 film, wherein the hold time is maintained for a time long enough to promote growth of grains of the MgB2 while avoiding escape of the Mg through the capping layer.",
                        "16. The method of any of the examples 8-15, wherein the capping layer comprises boron or Ta.",
                        "17. The method of any of the examples 8-16, further comprising selecting the capping layer having a thickness in a range 1-100 nm depending on at least one of:",
                        "a thickness of the MgB2 film,",
                        "whether the boron and magnesium are co-deposited or as alternating layers,",
                        "the temperature of annealing and a hold time at the temperature, and wherein a thinner cap layer is used for at least one of a shorter hold time, a lower temperature, or a thinner MgB2 film.",
                        "18. The method of any of the examples 8-16, wherein the depositing comprises depositing alternating layers of the boron and the magnesium to form the MgB2 film with a higher surface roughness above 2 nm and a higher critical temperature above 15K.",
                        "19. The method of any of the examples 8-17, wherein the magnesium and the boron are co-deposited.",
                        "20. The method of any of the examples claim 8-19 further comprising co-depositing the boron and the magnesium and controlling a duration of the heating to form the film having a surface roughness below 2 nm.",
                        "21. The method of any of the examples 1-20, further comprising removing the capping layer.",
                        "22. A device manufactured from the film manufactured using method of any of the examples 8-21, wherein the device comprises a transmission line, a detector, a Josephson mixer, or a kinetic inductance device.",
                        "23. A composition of matter, wafer, or film manufactured using the method of any of the examples 8-21."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce wafer with superconducting MgB2 film",
                        "specify sheet resistance and thickness uniformity",
                        "specify surface roughness",
                        "specify resistivity range",
                        "introduce wafer with superconducting MgB2 film (alternative)",
                        "specify critical temperature",
                        "introduce capping layer",
                        "introduce method of making MgB2 film",
                        "tune Mg to B ratio",
                        "select deposition and annealing conditions",
                        "specify film properties",
                        "specify deposition methods",
                        "specify annealing conditions"
                    ],
                    "num_characters": 6787,
                    "outline_medium": [
                        "introduce wafer with superconducting MgB2 film",
                        "describe film properties",
                        "introduce method of making film",
                        "describe method steps",
                        "introduce variations of method",
                        "describe applications of film"
                    ],
                    "outline_short": [
                        "summarize wafer embodiments",
                        "summarize method embodiments",
                        "summarize device and composition embodiments"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "In the following description of the preferred embodiment, reference is made to the accompanying drawings which form a part hereof, and in which is shown by way of illustration a specific embodiment in which the invention may be practiced. It is to be understood that other embodiments may be utilized, and structural changes may be made without departing from the scope of the present invention."
                    ],
                    "subsections": [
                        {
                            "title": "Technical Description",
                            "paragraphs": [
                                "Example MgB2 Film Synthesis",
                                "FIGS. 1A-1C is illustrates an example method and reactor/apparatus for making a film comprising a magnesium diboride film. The method comprises the following steps.",
                                "FIG. 1A represents depositing magnesium and boron on a substrate. Any substrate compatible with deposition of magnesium and boron, or MgB2 formation, such as SiNx, silicon, or boron, can be used. Although FIG. 1A illustrates a sputtering (specifically co-sputtering) method and apparatus, the depositing can be performed using a variety of deposition techniques (and associated reactors) including, but not limited to, other types of sputter deposition, atomic layer deposition, metal organic chemical vapor deposition, chemical vapor deposition, and electron beam deposition.",
                                "The step comprises selecting an amount of the magnesium and boron that will initiate a reaction forming the MgB2 film, during a subsequent annealing step. Amounts include stoichiometric amounts of magnesium, boron rich, or magnesium rich amounts.",
                                "The step further comprises tuning or selecting a ratio of the magnesium and the boron to form the MgB2 film (after the subsequent annealing step) having a desired resistivity and superconducting transition temperature. For example, the resistivity can be tailored or tuned over a range from 10 μΩ*cm to 500 μΩ*cm by controlling the Mg/B ratio during the deposition process. In one or more examples, the Mg/B ratio is tuned such that for a resistivity in the range 50-500 μOhm*cm, the critical temperature Tc only varies from 26K-32K.",
                                "The boron and the magnesium may be deposited as alternating boron and magnesium layers, or co-deposited (e.g., co-sputtered). The deposition method, the amount of magnesium the number of alternating layers, and/or the thickness of the film, may be selected depending on the desired properties of the film.",
                                "For example, a thicker Mg layer (e.g., deposited under Mg rich conditions and/or in a structure comprising alternating Mg and Boron layers) may result in larger MgB2 grain size and therefore higher critical temperature. Thus, the number of Mg and B layers and/or the thickness of the film may be selected to promote growth of MgB2 grains and/or tune the critical temperature of the film.",
                                "In another example, depositing alternating layers of the boron and the magnesium forms an MgB2 film (after the annealing step) with higher roughness and higher critical temperature, whereas co-depositing the magnesium and boron results in a smoother film and optionally lower critical temperature.",
                                "In one or more examples, the magnesium and boron are deposited to form a film having a thickness in a range of 1-1000 nm.",
                                "In typical examples, the film after the depositing step of FIG. 1A comprises a composite of magnesium and boron (e.g. Mg—B composite) which may comprise unreacted magnesium and boron.",
                                "FIG. 1B illustrates represents depositing a capping layer on the film comprising magnesium and boron to form a capped film, wherein the capping layer has a first melting temperature higher than a second melting temperature of the magnesium. Although FIG. 1B illustrates a sputter deposition technique, the depositing can be performed using a variety of deposition techniques (and associated reactors) including, but not limited to, atomic layer deposition, metal organic chemical vapor deposition, chemical vapor deposition, and electron beam deposition.",
                                "Without being bound by a particular scientific theory, boron capping layer is used to prevent evaporation or escape of Mg from the film, film decomposition, or other film degradation during the thermal annealing process. In some examples, stress from the capping layer (e.g., boron) can reduce roughness in the final product. Thus, capping layer thickness may be selected depending on the annealing conditions. For example, shorter annealing times, and/or lower annealing temperatures (e.g., <600° C.), and/or thinner MgB2 films may require a thinner cap layer.",
                                "In various examples, the capping layer may have a thickness in a range of 1-1000 nm depending on the thickness of the MgB2 layer and whether the boron and magnesium are deposited using co-sputtering or as alternating layers.",
                                "In various examples, the capping layer comprises, consists of, or consists essentially of at least one of boron, tantalum, a material that does not react with magnesium or boron and has a high melting temperature (e.g., above 1000° C.). In some examples, the capping layer comprises or consists of material that are less susceptible to oxidation.",
                                "In typical examples, the structure on the substrate after depositing the capping layer comprises the Mg—B composite comprising the magnesium, the boron, and the capping layer on top of the Mg—B composite.",
                                "FIG. 1C illustrates heating (e.g., thermally annealing) the capped film. Without being bound by a particular scientific theory, in this step, the magnesium and boron in the capped film may react to form MgB2.",
                                "In one example, the thermal annealing is at an annealing temperature above 400° C. but below the first melting temperature of the capping layer, so as to form the MgB2 film comprising a superconductive film having a critical temperature above 30 Kelvin.",
                                "In another example, the thermal annealing is at the annealing temperature (e.g., 600° C.) below both the second melting temperature (of the magnesium) and the first melting temperature (of the capping layer) so as to form a smoother superconductive MgB2 film having a surface roughness of less than 2 nm.",
                                "The annealing temperature and hold time (time duration at the annealing temperature) can be varied to modify the properties of the film. Mg and Boron typically react quickly to form MgB2 and it may be advantageous to promote continued growth of MgB2 grains by extending the hold time. In some examples, higher Tc of the MgB2 film is associated with larger grains which can be achieved using longer hold times. For example, hold time may be in a range of 5-10 minutes and/or depends on the thickness of the capping layer. In some examples, increasing the hold time promotes growth of the Mg grains (thereby increasing the critical temperature). In one or more examples, hold times above 10 minutes result in undesirable Mg escapes through the cap layer and degradation of MgB2 film properties. After annealing, the MgB2 film is cooled. In some examples, the capped MgB2 film is cooled at a slower rate to avoid cracking of the film.",
                                "FIGS. 2A-2B represent the end result, a composition of matter 200 comprising a wafer 202 comprising a film 204 including magnesium and boron (typically as MgB2), and the capping layer. FIG. 2A is a top view, and FIG. 2B shows a side view illustrating the wafer comprises the one or more layers 206 comprising the magnesium and boron (e.g., MgB2 film 206) and the capping layer 208 on top. Without being bound by scientific theory, the composition of matter may comprise a superconductor or superconducting film 206 comprising the magnesium and the boron layer(s) 206 (e.g., MgB2); and the capping layer 208 or capping material (e.g., boron or tantalum) on top.",
                                "In some examples, the capping layer is subsequently removed so that the superconductor/superconductive film comprising the MgB2 film remains. In yet further examples, the substrate 210 may also be at least partially removed. In yet further examples, additional elements may be added to further tailor the properties of the film.",
                                "FIG. 3 illustrates the effect of capping layer and thermal annealing on superconductive properties of the film.",
                                "FIGS. 4A-4B show the uniformity (of thickness T and sheet resistance) of the film 204 (comprising magnesium and boron (as an Mg—B composite or MgB2 film) and the capping layer) measured using eddy current mapping (sheet resistance throughout wafer).",
                                "FIG. 5 shows how the resistivity of the film 204 (e.g., MgB2 film 206) can be tuned using the Mg:B ratio during deposition (in this case the power used for the Mg source during sputtering).",
                                "FIG. 6 illustrates measured surface roughness of the film 204 comprising (e.g., comprising the superconducting MgB2 206 and the capping layer 208) which is representative of the surface roughness across an entirety of the wafer.",
                                "FIG. 7 illustrates the superconductive properties of the film 204 comprising the MgB2 film 205.",
                                "The results shown in FIGS. 4A-4B and 6-7 were obtained by sputter depositing 1:2 atomic ratio of Mg:B onto a substrate. However, other Mg:B ratios in the range of 0.8:2 to 1.5:2 are also effective and producing uniform superconductive films with roughness less than 2 nm and critical temperature above 15K and resistivities in the range shown in FIG. 5. Note that deposition conditions should take into account that magnesium readily oxidizes in the existence of even the slightest trace amount of oxygen inside the vacuum chambers—i.e. depending on the base pressure of the chamber, the total amount of elemental magnesium may vary. For the examples measured in FIGS. 4A-4B and 6-7, the total thickness of Mg—B composite film was 50 nm and a thin (20 nm) layer of boron was sputtered to cap the Mg—B composite film, and the film was then annealed inside a rapid thermal processor (RTP) at 600° C. for 10 minutes using a ramp rate of 1 degree per second. However, other temperatures in the range: 500˜630° C. and typical annealing times in the range: 3˜30 minutes can be used (shorter times for thinner films, and longer times for thicker films).",
                                "The results in FIGS. 4A-4B, 6, and 7 were obtained for the same wafer 202. Because boron in the capping layer is insulating, it does not show up (or affect) the resistivity/sheet resistance/superconducting transition measurements. The measured roughness and thickness uniformity is for the MgB2 film (since boron capping layer roughness will be flat without MgB2).",
                                "Thickness (unless otherwise stated) refers to Mg—B composite (pre-annealed) or MgB2 thickness (post-annealed).",
                                "Example films, compositions of mater, wafers, and methods include, but are not limited to, the following examples.",
                                "1. FIGS. 2 and 4-7 illustrate a composition of matter 200, wafer 202, or film 204, comprising or consisting essentially of magnesium, boron, and optionally a capping layer 208 or capping material. The composition of matter 200 may comprise magnesium and boron, or a compound comprising magnesium and boron comprising a superconductor, or a film or superconductor comprising magnesium and boron, or film or superconductor comprising a compound including magnesium and boron. The magnesium and boron are typically reacted to form MgB2 so that the film 204 comprises an MgB2 film 206 and the capping layer 208 optionally on the MgB2 film 206. The film 204, 206 has an area A defined by a diameter D of at least 4 inches (e.g., 4≤D≤12 inches), or an equivalent area, a uniform sheet resistance and uniform thickness T1 or T2 as characterized by the sheet resistance and thickness T1 or T2 varying by less than 10% or less than 3% (e.g., 1%≤thickness variation≤10%) over the area, and a surface roughness Ra less than 1.5 nm over an entirety of the area (e.g., 0.2 nm≤R≤1.5 nm).",
                                "2. The composition of matter of example 1, wherein the film 204 (typically the MgB2 film 206) has a resistivity ρ above 100 μΩ*cm or 100 μΩ*cm≤ρ≤500 μΩ*cm or 100μΩ*cm≤ρ≤10 mΩ*cm (see e.g. FIG. 5).",
                                "3. The composition of matter of example 1 or 2, comprising the film 204 comprises a superconductor or superconductive film 206 (MgB2 film) having a critical temperature above 15K (see e.g. FIG. 7). FIG. 3 illustrates how the use of the capping layer 208 results in a film having increased critical temperature without compromising resistivity properties.",
                                "4. FIGS. 2 and 4-7 illustrate a composition of matter 200 or wafer 202 comprising a film 204, 206 comprising or consisting essentially of magnesium, boron, and optionally a capping layer 208. The composition of matter 200 may comprise magnesium and boron, or a compound comprising magnesium and boron comprising a superconductor, or a film or superconductor comprising magnesium and boron, or film or superconductor comprising a compound including magnesium and boron. In typical examples, the magnesium and boron are reacted to form MgB2 so that the film 204, 206 comprises or consists essentially of an MgB2 film 206 and the capping layer optionally on the MgB2 film. The film 204, 206 has an area defined by a diameter D of at least 4 inches (e.g., 4≤D≤12 inches), a resistivity between 25-50 microohmcm (25 μΩ*cm≤ρ≤50 μΩ*cm), a surface roughness of 2 nm or less (e.g., 0.2 nm≤R≤2 nm) over an entirety of the area of the film 202, a uniform sheet resistance and uniform thickness T1, T2 as characterized by the thickness T1 or T2 varying by less than 10% or less than 3% over an entirety of the area (e.g., 1%≤thickness variation≤10%), and the film 204, 206 comprises a superconductor having a critical temperature greater than 15 K.",
                                "5. The composition of matter of example 4, wherein the film 204 comprises the MgB2 film 206 having a critical temperature above 30 K, as illustrated in FIG. 7.",
                                "6. The composition of matter of any of the examples 1-5, further comprising a wafer 202 comprising the film 204.",
                                "7. The composition of matter of example 6, wherein the film 204 is on a substrate.",
                                "8. A method of making a film comprising magnesium and boron (magnesium diboride), comprising:",
                                "depositing magnesium and boron on a substrate so as to form an Mg—B composite;",
                                "depositing a capping layer to form a capped film, wherein the capping layer has a first melting temperature higher than a second melting temperature of the magnesium;",
                                "thermally annealing the capped film at a temperature; and",
                                "cooling the capped film, so that a MgB2 film is made.",
                                "9. The method of example 8, further comprising tuning a ratio of the Mg to the B so as to tailor:",
                                "a resistivity of the MgB2 film anywhere in the range 10 μΩ*cm≤ρ≤500 mΩ*cm, and a critical temperature of the MgB2 film greater than 10K or in a range 10K-40K.",
                                "10. The method of example 8, further comprising selecting at least one of a thickness of the Mg—B composite or the MgB2 film, a surface area of the substrate, a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the film comprising a superconductor, wherein the MgB2 film (e.g., with or without the capping layer):",
                                "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                                "the thickness and sheet resistance varying by less than 10% over an entirety of the area;",
                                "a surface roughness less than 1.5 nm over the entirety of the area; and",
                                "a resistivity of the film (comprising magnesium and boron, e.g., MgB2) in the range 50 μΩ*cm≤ρ≤100 mΩ*cm.",
                                "11. The method of example 8, further comprising selecting at least one of a thickness of the Mg—B composite or the MgB2 film, a surface area of the substrate; a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the film comprising a superconductor, wherein the MgB2 film (e.g., with or without the capping layer):",
                                "has an area greater than or equal to a circular area having a diameter of at least 4 inches;",
                                "a resistivity 25 μΩ*cm≤ρ≤50 μΩ*cm across an entirety of the area",
                                "a surface roughness of 2 nm or less across an entirety of the area,",
                                "a thickness and sheet resistance varying by less than 10% across the entirety of the area; and",
                                "the superconductor has a critical temperature greater than 15K across the entirety of the area.",
                                "12. The method of any of the examples 8-11, wherein the depositing comprises sputtering, atomic layer deposition, chemical vapor deposition, or electron beam deposition.",
                                "13. The method of any of the examples 8-11, wherein the annealing is:",
                                "at the temperature above the second melting temperature but below the first melting temperature so as to form the MgB2 film comprising the superconductor having a critical temperature above 30 Kelvin, or",
                                "at the temperature below both the second melting temperature so as to form a smoother MgB2 film having a surface roughness of less than 2 nm.",
                                "14. The method of any of the examples claim 8-13, wherein the depositing comprises depositing alternating layers of the boron and the magnesium under magnesium rich conditions, and selecting at least one of a thickness of the Mg—B composite or the MgB2 film and/or a number of the layers to increase a critical temperature of the MgB2 film above 15 K.",
                                "15. The method of any of the examples claim 8-14 further comprising controlling a hold time at the temperature depending on a thickness of the capping layer and so as to obtain a desired critical temperature for the superconductor/MgB2 film, wherein the hold time is maintained for a time long enough to promote growth of grains of the MgB2 while avoiding escape of the Mg through the capping layer.",
                                "16. The method of any of the examples claim 8-15, wherein the capping layer comprises boron or Ta.",
                                "17. The method of claim 12, further comprising selecting the capping layer having a thickness in a range 1-100 nm depending on at least one of:",
                                "a thickness of the film/MgB2 film,",
                                "whether the boron and magnesium are co-deposited or as alternating layers,",
                                "the temperature of annealing and a hold time at the temperature, and wherein a thinner cap layer is used for at least one of a shorter hold time, a lower temperature, or a thinner film.",
                                "18. The method of any of the examples claim 8-17, wherein the depositing comprises depositing alternating layers of the boron and the magnesium to form the MgB2 film with a higher surface roughness above 2 nm and a higher critical temperature above 15K.",
                                "19. The method of any of the examples 8-17, wherein the magnesium and the boron are co-deposited.",
                                "20. The method of any of the examples claim 8-19 further comprising co-depositing the boron and the magnesium and controlling a duration of the heating to form the MgB2 film having a surface roughness below 2 nm.",
                                "21. The method of any of the examples 1-20, further comprising removing the capping layer.",
                                "22. The composition of matter of any of the examples 1-7, wherein the composition of matter 200 comprises or consists essentially of the magnesium, the boron, and optionally tantalum or a capping moiety or capping material or additional boron.",
                                "23. The composition of matter of any of the examples 1-7, comprising a superconductor 206 comprising the magnesium and the boron.",
                                "24. The composition of matter of any of the examples 1-7 or 22-23, wherein the magnesium and the boron form MgB2.",
                                "25. The composition of matter of any of the examples 1-7 or 22-25, wherein the sheet resistance of the MgB2 film 206 or superconductor varies by less than 10% or less than 3% (e.g., 1%≤sheet resistances≤10%) over the area.",
                                "26. A composition of matter, wafer, or film manufactured using the method of any of the examples 8-21.",
                                "27. A device manufactured from the film manufactured using method of any of the examples 8-21 or from the composition of matter of any of the examples 1-7 or 22-25, wherein the device comprises a transmission line, a detector, a Josephson mixer, or a kinetic inductance device.",
                                "28. The device, wafer, method, or composition of matter of any of the examples, wherein the transition temperature comprises the critical temperature Tc below which a resistance of the film drops to zero.",
                                "29. The composition of matter of any of the examples, wherein the film 204 does not include the capping layer (capping layer has been removed).",
                                "30. The composition of matter of any of the examples, wherein the film 204 includes a capping layer 208.",
                                "Example Device Fabrication",
                                "FIG. 8 is a flowchart illustrating a method of making a device using the wafer manufactured according to the methods described herein.",
                                "Block 800 represents optionally removing the capping layer from the MgB2 film. (e.g., using argon ion milling).",
                                "Block 802 represents optionally etching (e.g., using argon ion milling) so as to thin the MgB2 film, e.g., to a thickness below 10 nm.",
                                "Block 804 represents patterning the film into a device. In one or more examples, the patterning comprises depositing a hardmask (e.g., titanium) on the thinned superconductive film, wherein the hardmask comprises a material etched at a much slower rate than the MgB2 using argon ion milling, and etching a pattern into the film using the hardmask. In one example, the patterning comprises depositing a hardmask comprising a bilayer comprising a titanium layer on top of a gold layer; removing the titanium layer using a reactive ion etch (RIE); and removing the gold and portions of the MgB2 using argon ion milling.",
                                "Block 806 represents the end result, a device comprising the MgB2 film synthesized in accordance with the methods described herein. Example devices include, but are not limited to, a transmission line, a superconducting interferometer [1], a detector (e.g., a hot electron bolometer or a superconducting single photon detector [2], [3], a kinetic inductance bolometer [4], a Josephson mixer, a superconducting amplifier [5] or a kinetic inductance frequency multiplier (FIG. 9)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "deposit magnesium and boron on a substrate",
                                "describe co-sputtering method and apparatus",
                                "select amount of magnesium and boron for reaction",
                                "tune Mg/B ratio for desired resistivity and superconducting transition temperature",
                                "deposit boron and magnesium as alternating layers",
                                "describe effect of layer thickness on film properties",
                                "deposit capping layer on film",
                                "describe purpose of capping layer",
                                "select capping layer material and thickness",
                                "thermally anneal capped film",
                                "describe reaction of magnesium and boron during annealing",
                                "select annealing temperature and hold time",
                                "describe effect of annealing conditions on film properties",
                                "cool capped film",
                                "describe resulting composition of matter",
                                "illustrate composition of matter with FIGS. 2A-2B",
                                "describe properties of MgB2 film",
                                "illustrate effect of capping layer and thermal annealing on superconductive properties",
                                "illustrate uniformity of film thickness and sheet resistance",
                                "illustrate tunability of resistivity using Mg:B ratio",
                                "illustrate surface roughness of film",
                                "illustrate superconductive properties of film",
                                "describe example films and compositions of matter",
                                "describe example 1: film with uniform sheet resistance and thickness",
                                "describe example 2: film with resistivity above 100 μΩ*cm",
                                "describe example 3: film with critical temperature above 15K",
                                "describe example 4: film with resistivity between 25-50 microohmcm",
                                "describe example 5: film with critical temperature above 30 K",
                                "describe method of making a film",
                                "describe depositing magnesium and boron",
                                "describe depositing capping layer",
                                "describe thermal annealing",
                                "describe cooling",
                                "describe tuning Mg:B ratio",
                                "describe selecting film thickness and surface area",
                                "describe selecting capping layer thickness and material",
                                "describe selecting annealing temperature and hold time",
                                "describe co-depositing boron and magnesium",
                                "describe depositing alternating layers of boron and magnesium",
                                "describe controlling hold time at annealing temperature",
                                "describe removing capping layer",
                                "describe manufacturing device using film"
                            ],
                            "num_characters": 21533,
                            "outline_medium": [
                                "deposit magnesium and boron on a substrate",
                                "select amount of magnesium and boron for reaction",
                                "tune Mg/B ratio for desired resistivity and superconducting transition temperature",
                                "deposit boron and magnesium as alternating layers or co-deposit",
                                "select deposition method and reactor",
                                "deposit capping layer on film",
                                "select capping layer material and thickness",
                                "thermally anneal capped film",
                                "select annealing temperature and hold time",
                                "cool capped film",
                                "describe resulting composition of matter",
                                "illustrate end result with figures",
                                "describe effect of capping layer and thermal annealing on superconductive properties",
                                "illustrate uniformity of film thickness and sheet resistance",
                                "illustrate resistivity tuning using Mg:B ratio",
                                "illustrate surface roughness of film",
                                "illustrate superconductive properties of film",
                                "describe example films and compositions of matter",
                                "describe method of making film",
                                "describe variations of method",
                                "describe resulting film properties"
                            ],
                            "outline_short": [
                                "deposit magnesium and boron on substrate",
                                "select amount of magnesium and boron for reaction",
                                "tune Mg/B ratio for desired resistivity and superconducting transition temperature",
                                "deposit capping layer on film",
                                "thermally anneal capped film",
                                "cool capped film",
                                "describe effect of capping layer and thermal annealing on superconductive properties",
                                "describe uniformity of film thickness and sheet resistance",
                                "describe tuning of resistivity using Mg:B ratio",
                                "describe surface roughness of film"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce MgB2 film synthesis"
                    ],
                    "num_characters": 395,
                    "outline_medium": [
                        "introduce MgB2 film synthesis"
                    ],
                    "outline_short": [
                        "describe MgB2 film synthesis method"
                    ]
                },
                {
                    "title": "CONCLUSION",
                    "paragraphs": [
                        "This concludes the description of the preferred embodiment of the present invention. The foregoing description of one or more embodiments of the invention has been presented for the purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise form disclosed. Many modifications and variations are possible in light of the above teaching. It is intended that the scope of the invention be limited not by this detailed description, but rather by the claims appended hereto."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "conclude description of preferred embodiment"
                    ],
                    "num_characters": 529,
                    "outline_medium": [
                        "conclude description of invention"
                    ],
                    "outline_short": [
                        "conclude description of preferred embodiment"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A wafer, comprising:\na superconducting MgB2 film, wherein the MgB2 film:\nhas an area greater than or equal to a circular area having a diameter of at least 4 inches;\na sheet resistance and a thickness varying by less than 10% over an entirety of the area; and\na surface roughness less than 1.5 nanometers (nm) over the entirety of the area.",
        "2. The wafer of claim 1, wherein the film has a resistivity ρ above 100 μΩ*cm or 100 μΩ*cm≤ρ≤10 mΩ*cm across an entirety of the area.",
        "3. The wafer of claim 2, wherein the film has a critical temperature of at least 15K.",
        "4. The wafer of claim 1, further comprising a capping layer comprising Ta or B on the MgB2 film.",
        "5. A wafer, comprising:\na superconducting MgB2 film, wherein the MgB2 film:\nhas an area greater than or equal to a circular area having a diameter of at least 4 inches;\na resistivity ρ 25 μΩ*cm≤ρ≤50 μΩ*cm across an entirety of the area\na surface roughness of 2 nm or less across an entirety of the area,\na sheet resistance and a thickness varying by less than 10% across the entirety of the area; and\na critical temperature greater than 15K across the entirety of the area.",
        "6. The wafer of claim 5, wherein the MgB2 film comprises a superconductive film having the critical temperature above 30 K.",
        "7. The wafer of claim 5, further comprises a capping layer comprising Ta or B on the MgB2 film.",
        "8. A method of making a film comprising magnesium diboride, comprising:\ndepositing magnesium and boron on a substrate so as to form an Mg—B composite;\ndepositing a capping layer to form a capped film, wherein the capping layer has a first melting temperature higher than a second melting temperature of the magnesium;\nthermally annealing the capped film at a temperature; and\ncooling the capped film so that a MgB2 film is made.",
        "9. The method of claim 8, further comprising tuning a ratio of the Mg to the B so as to tailor:\na resistivity of the MgB2 film anywhere in the range 10 μΩ*cm≤ρ≤500 mΩ*cm, and\na critical temperature of the MgB2 film greater than 10K or in a range 10K-40K.",
        "10. The method of claim 8, further comprising selecting at least one of a thickness of the MgB2 film or the Mg—B composite, a surface area of the substrate, a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the MgB2 film comprising a superconductor, wherein the MgB2 film:\nhas an area greater than or equal to a circular area having a diameter of at least 4 inches;\nthe thickness varying by less than 10% over an entirety of the area;\na surface roughness less than 1.5 nm over the entirety of the area; and\na resistivity of the MgB2 film in the range 50 μΩ*cm≤ρ≤100 mΩ*cm.",
        "11. The method of claim 8, further comprising selecting at least one of a thickness of the MgB2 film or the Mg—B composite, a surface area of the substrate; a thickness of the capping layer, a ratio of the Mg to the B during the depositing, the temperature of the annealing, a hold time at the annealing temperature, co-depositing the B and the Mg or depositing the Mg and the B as alternating layers, and a cooling rate of the cooling, so as to form the MgB2 film comprising a superconductor, wherein the MgB2 film:\nhas an area greater than or equal to a circular area having a diameter of at least 4 inches;\na resistivity 25 μΩ*cm≤ρ≤50 μΩ*cm across an entirety of the area\na surface roughness of 2 nm or less across an entirety of the area,\na thickness varying by less than 10% across the entirety of the area; and\nhas a critical temperature greater than 15K across the entirety of the area.",
        "12. The method of claim 8, wherein the depositing comprises sputtering, atomic layer deposition, chemical vapor deposition, or electron beam deposition.",
        "13. The method of claim 8, wherein the annealing is:\nat the temperature above the second melting temperature but below the first melting temperature so as to form the MgB2 film into a superconductive film having a critical temperature above 30 Kelvin, or\nat the temperature below both the second melting temperature so as to form a smoother MgB2 film having a surface roughness of less than 2 nm.",
        "14. The method of claim 8, wherein the depositing comprises depositing alternating layers of the boron and the magnesium under magnesium rich conditions, and selecting at least one of a thickness of the MgB2 film or a number of the layers to increase a critical temperature of the film above 15 K.",
        "15. The method of claim 8 further comprising controlling a hold time at the temperature depending on a thickness of the capping layer and so as to obtain a desired critical temperature for the MgB2 film, wherein the hold time is maintained for a time long enough to promote growth of grains of the MgB2 while avoiding escape of the Mg through the capping layer.",
        "16. The method of claim 8, wherein the capping layer comprises boron or Ta.",
        "17. The method of claim 12, further comprising selecting the capping layer having a thickness in a range 1-100 nm depending on at least one of:\na thickness of the MgB2 film,\nwhether the boron and magnesium are co-deposited or as alternating layers,\nthe temperature of annealing and a hold time at the temperature, and wherein a thinner cap layer is used for at least one of a shorter hold time, a lower temperature, or a thinner MgB2 film.",
        "18. The method of claim 8, wherein the depositing comprises depositing alternating layers of the boron and the magnesium to form the MgB2 film with a higher surface roughness above 2 nm and a higher critical temperature above 15K.",
        "19. The method of claim 8, wherein the magnesium and the boron are co-deposited.",
        "20. The method of claim 8 further comprising co-depositing the boron and the magnesium and controlling a duration of the heating to form the MgB2 film having a surface roughness below 2 nm."
    ]
}