{
    "id": "US20170250447",
    "authors": [
        "Hanqing Jiang",
        "Zeming Song",
        "Hongyu Yu",
        "Xu Wang"
    ],
    "title": "STRETCHABLE BATTERIES",
    "date": "2015-09-25 00:00:00",
    "abstract": "The invention is directed to a flexible and stretchable battery which is formed of an assembly having anode side and a cathode side separated by a separator and sealed in a packaging. The assembly is in a folded configuration and contains at least one cut therein, such that when the assembly is unfolded and subjected to subsequent deformation, a final folded state of the battery is able to stretch beyond a flat planar state of the battery in all dimensions.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to a flexible and stretchable battery and a method for producing the same."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 104,
                    "outline_medium": [
                        "define flexible battery field"
                    ],
                    "outline_short": [
                        "define flexible battery field"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Due to the recent spread of portable (including wearable) electronic devices with compact designs, batteries for supplying electric power to those devices are required to be thinner, more flexible, and more stretchable. Energy storage devices, such as supercapacitors and lithium-ion batteries (LIBs), which are able to sustain large strains (much greater than 1%) under complex deformations (for instance, bending, tension/compression, and torsion) are indispensable components for flexible, stretchable electronics. Recently, wearable electronics, such as flexible displays, stretchable circuits, hemispherical electronic eyes, and epidermal electronics have emerged. Various approaches have been employed to achieve flexible and stretchable energy storage devices, such as thin film based bendable supercapacitors and batteries, buckling-based stretchable supercapacitors, and island-serpentine-based stretchable LIBs. Recently, an origami-based approach was adopted to develop highly deformable LIBs, where standard LIBs were produced followed by designated origami folding. The folding endows the origami LIB with a high level of deformability by changing the LIB from a planar state to a folded state. In this way, the LIBs are capable of being incorporated into portable and wearable electronic devices.",
                        "However, previously developed origami-based flexible and stretchable devices have two disadvantages. First, their stretchability is limited from the folded state to the planar state. Although it can be tuned by different folding patterns, the constraint is still prescribed by the planar state. As such, their deformability is limited and, as such, their use is limited. Second, the folded state involves uneven surfaces, which may introduce inconvenience when integrating with functional devices.",
                        "Therefore, there remains a need for a flexible and stretchable battery that is stretchable beyond its planar state while still remaining functional. Further, flexible and stretchable batteries that can be integrated within portable and wearable electronic devices are desired."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate flexible batteries",
                        "describe limitations of prior art",
                        "summarize prior art approaches",
                        "identify need for improvement"
                    ],
                    "num_characters": 2087,
                    "outline_medium": [
                        "motivate flexible energy storage",
                        "limitations of prior art"
                    ],
                    "outline_short": [
                        "motivate flexible energy storage devices"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention provides flexible and stretchable batteries by combining folding and cutting to define patterns that form an even (or close to even) surface after stretching, whereby the stretchability is not limited by the planar state of the battery. The art of folding and cutting to form various shapes is known as kirigami. The principle of the invention is to utilize rotation and/or bending of the interconnection and structure to release the stress during stretching and twisting the system to produce stretchability. One way to produce such a battery is by folding the flat sheet battery, and then cutting the battery so that when the battery is unfolded it is able to stretch beyond its planar state. Alternative ways may include the process sequences of a combination of zero or multiple times of cutting, folding and unfolding following designed patterns. Any cutting patterns that allow for stretching of the battery beyond its flat planar dimension are appropriate. In this application, the word “stretch” includes deformation formats of stretching and contracting, and the word “stretchability” includes deformation capability of stretching and contracting.",
                        "Accordingly, an object of the invention is to provide a flexible and stretchable battery that contains a cutting pattern that enables the battery to stretch beyond its planar state in all dimensions. The flexible and stretchable battery includes an assembly having an anode side and a cathode side separated by a separator and sealed in a packaging. The assembly is in a folded configuration and contains at least one cut therein, such that when the assembly is unfolded, it is able to stretch beyond its flat planar state in all dimensions.",
                        "Another object of the present invention is to provide a method of making a flexible and stretchable battery. The method involves forming an assembly having an anode side and a cathode side separated by a separator and sealed in a packaging. The assembly is folded and cut, such that when the assembly is unfolded, it is able to stretch beyond its flat planar state in all dimensions.",
                        "Alternatively, some methods involve providing a battery in a flat planar form, processing the battery with the sequence of combination of zero or multiple times of cutting, folding and unfolding following designed patterns to allow the battery to be stretched beyond its planar state in all dimensions. According to one aspect, the battery is folded into a corrugated pattern before cutting. The cutting is such that it produces a cutting pattern on the battery. The cutting is based on the art of kirigami which starts with a folded base which is then cut. The cuts are then opened and flattened to make the finished kirigami which contains symmetrical and repeated cutting patterns.",
                        "A further object of the invention is to provide an electronic device containing the flexible and stretchable battery of the invention. The device can be, for example, a smart watch, a smart arm band, a smart bracelet, a smart head band, and so on."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce kirigami-based battery",
                        "describe folding and cutting process",
                        "explain stress release mechanism",
                        "define stretchability",
                        "describe battery assembly",
                        "outline method of making battery"
                    ],
                    "num_characters": 3041,
                    "outline_medium": [
                        "introduce kirigami-based battery",
                        "describe stretchable battery structure",
                        "outline method of making battery"
                    ],
                    "outline_short": [
                        "introduce kirigami-based stretchable battery"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS",
                    "paragraphs": [
                        "Five kirigami patterns are utilized, as illustrated in FIGS. 1(a)-(e), with (a) a zigzag-cut pattern, (b) a cut-N-twist pattern, (c) a cut-N-shear pattern; (d) a cut-N-rotate pattern; and (e) a spiral cut pattern. The first three patterns are the focus of the invention.",
                        "The zigzag-cut pattern (FIG. 1(a)) represents one of the most commonly seen kirigami patterns and is produced by cutting a folded stack of foil asymmetrically between the neighboring creases, which defines zigzag-like cuttings in the longitudinal direction. The zigzag pattern can be stretched beyond its length in the planar state, which is the desired advantage of kirigami. To accommodate stretching, the out-of-plane deformation (or equivalently, buckling) occurs at the vicinity of cuts. The level of stretchability depends on the length of the cut and is a function of buckling amplitude.",
                        "To eliminate the out-of-plane deformation, the cut-N-twist pattern (FIG. 1(b)) is utilized, in which a folded stack of foil is symmetrically cut at all creases, and then unfolded to a planar state, followed by twisting at the two ends. The twisted structure is shown in the bottom panel of FIG. 1(b) and is analogous to a twisted telephone cord. This pattern represents a locked structure in a sense that the out-of-plane deformation, induced by stretching, is constrained, and rotation and bending occurs at the cuts to accommodate stretching. The packing density of a cut-N-twist pattern is defined by the width of each face. Electrochemical and mechanical characterization results for LIB s using a cut-N-twist pattern show that the stretchability of a kirigami LIB is over 100% as compared to its most compact state. It should be noted that there is no significant change in the thickness (h) of this LIB between its most compact state (h=1.31 mm) and its most stretched state (h=1.07 mm).",
                        "To increase the packing density, the cut-N-shear pattern (FIG. 1(c)) is introduced, where folding is employed after symmetric cutting and then the folded structure is subjected to shear to form the cut-N-shear pattern as shown in FIG. 1(c). Thus, the packing density doubles compared with that for the cut-N-twist pattern. The stretching is also realized by the rotations and bending of the cuts and no out-of-plane deformation is involved.",
                        "Kirigami LIBs, specifically the LIBs using cut-N-twist, cut-N-shear, zigzag-cut patterns illustrated in FIGS. 1(a)-(c), are demonstrated. Conventional materials and approaches for LIB preparation were used, specifically utilizing graphite (available commercially from Fisher Scientific Inc.) and LiCoO2 (LCO, available commercially from MTI Corp.) as anode and cathode active materials, respectively. Conventional slurries of these active materials were prepared and used to coat the current collectors, where copper (Cu) and aluminum (Al) served as the anode and cathode current collectors, respectively. The battery cells were assembled by following designated folding and cutting based on the kirigami patterns of FIGS. 1(a)-(c) in an argon-filled glovebox using polypropylene (available commercially as Celgard 2500), 1 M LiPF6 in EC:DMC:DEC(1:1:1) (available commercially from MTI Corp.), and aluminized polyethylene (PE) (available commercially from Sigma-Aldrich Corp.) as separator, electrolyte, and packaging materials, respectively. Extra care was taken to ensure no short circuits or leakage at the cuts during assembly.",
                        "FIG. 2(a) is a graph illustrating the electrochemical cycling results of the kirigami LIB disclosed in FIG. 1(b) (a cut-N-twist pattern) at its most compact state (for the 1st to 5th cycles), followed by that at its most stretched state (for the 6th to 10th cycles), then that at its most compact state again (for the 11th to 15th cycles), and then that at its most stretched state again (for the 16th to 20th cycles) under the current density of 50 mA g−1. Well-defined plateaus at around 3.7V are observed along with fairly stable charge/discharge behaviors under compact and stretched states. The present mass loading gives this kirigami LIB about 35 mAh energy capacity. The mass loading of LiCoO2 (LCO) (specific capacity of 145 mAh g−1) and graphite (specific capacity of 372 mAh g−1) were 0.12 g and 0.28 g, respectively, which gave the LIB the capacity of 35 mAh.",
                        "FIG. 2(b) is a graph illustrating the capacity and Coulombic efficiency as a function of the cycle number of a kirigami LIB prepared using a cut-N-twist pattern for a current density of 50 mAg−1. It shows the reasonable cyclic stability of the LIBs up to 20 cycles. It should be emphasized that this result represents the stability of this kirigami LIB at mixed states, i.e., both compact and stretched states. Another important point is that the energy density (in the unit of Wh/kg) in FIG. 2(d) is calculated using all materials in this LIB, including active materials, current collectors, electrolyte, and packaging. This energy density is comparable to the present commercially available LIBs. The mass accounts for all the materials involved in a cell, which is 1.49 g.",
                        "FIG. 2c shows the rate performance of a kirigami LIB prepared using a cut-N-twist pattern when the charge/discharge rate varied in the sequence of C/3, C/2, C and C/3 again at both compact and stretched state. When discharge rates increase, as expected, the capacity decreases from 29.3 mAh for C/3 rate to 26.5 mAh for C/2 rate, and 21.4 mAh for discharge rate C. However, the capacity recovered to the 27.6 mAh when the discharge rate resumed to C/3 after 30 cycles charge/discharge at the both compact the stretched state under varies C-rates, which indicates good rate performance of this kirigami LIB.",
                        "FIG. 2(d) provides the results for electrochemical impedance spectroscopy (EIS) studies during the first discharge cycle at the most compact state before stretching and stretched state after 100 cycles of mechanical stretching for a kirigami LIB prepared using a cut-N-twist pattern. EIS studies were performed by applying a small perturbation voltage of 5 mV in the frequency range of 0.1 Hz to 100 kHz. Typical impedance spectrum, with high-to-middle frequency range flat curve and a relative straight line representing the low frequency range, was observed. No obvious semicircle was observed because of the low internal resistance. There are no significant changes in the impedance before and after mechanical deformation.",
                        "The mechanical characteristics of the fully charged kirigami LIB using the cut-N-twist pattern of FIG. 1(b) are then examined. At different stretchability levels, namely, 0%, 40%, and 90%, the output voltage remained steady at 3.8 V. FIG. 2(e) shows the maximum output power of the kirigami LIB as a function of stretchability, εstretch, under different cycles of stretching. Here, the internal resistance of the battery was measured to be about 1.8 Ω. Over 1,000 stretching cycles and a stretchability εstretch of up to 90%, it is found that the output power is quite stable and shows no noticeable decay. The output power of 4.1 W is sufficient to operate commercial light-emitting diodes (LEDs). LEDs driven by a kirigami LIB formed using a cut-N-twist pattern do not show noticeable dimming upon cyclic stretching, from 0% (its most compact state) to 30% stretching to 70% stretching.",
                        "FIGS. 2(f)-(g) show scanning electron micrographs (SEMs) for the anode current collectors (e.g., copper foil) at the cuts before charging, and after discharge and 100 cycles of mechanical deformation for the cut-N-twist pattern of FIG. 1(b). Similar SEM images are given for the cathode current collectors (e.g., aluminum foils), as shown in FIGS. 2(h) and 2(i). There appear to be no cracks after cyclic mechanical stretching, which contributes to the robust electrochemical and mechanical characterizations.",
                        "This phenomenon is consistent with the theoretical analysis and a simplified model as shown in FIG. 3(a), where two pre-existing cracks are presumably caused by initial folding and/or cutting, and are located at the present positions when a pair of concentrated moment M is applied at the end of the strip with length L and width H. The concentrated moment M is utilized to characterize the applied stretching deformation that causes bending about the folding creases. Angle θ is used to denote the relative positions of two strips with θ=0 for the initially folded position. When the moment M is applied, there exist two modes of deformation. The first mode causes the growth of the pre-existing cracks from a to α+Δα, while maintaining the angle θ unchanged, which refers to “crack growth”. The second mode leads to plastic deformation of the thin foil at the vicinity of the fold by altering θ to θ+Δθ, which refers to “plastic rolling”.",
                        "The critical condition for “crack growth” is given by the Griffith's criterion. The driving force, or the release of the elastic energy due to the propagation of cracks, Aσ2α/E equates to the resistance of the crack growth, defined by 2 γ. Here A is a non-dimensional geometrical factor that depends on angle θ, i.e., A=A(θ); σ is the normal traction applied on the crack surface and related to the moment M by σ=6M/H2; E is the elastic modulus; and γ [unit: Newton/meter] is the surface energy. Thus the critical moment for “crack growth” is given by Mcrcrack growth=H2√{square root over (Eγ/(2Aα))}/3. For “plastic rolling”, the rate of energy dissipation due to the plastic deformation during the rolling about the creases provides the resistance, given by βH2(1+tan2θ)/4; and the driving force is the rate of release of potential energy due to the increase of θ, given by M/2. Here β [unit: Newton/meter2] is the dissipated energy per unit area due to plastic rolling, which is related to the extent of the plastic deformation (i.e., hard crease versus soft crease) and can be associated with the yield stress of plastic materials. The critical condition for “plastic rolling” is given by Mcrplastic rolling=βH2(1+tan2 θ)/2. When M is applied, the smaller one between Mcrcrack growth and Mcrplastic rolling is activated as the critical moment during deformation, which leads to either “crack growth” mode, when Mcrcrack growth<Mcrplastic rolling, or “plastic rolling” mode, when Mcrplastic rolling<Mcrcrack growth.",
                        "Finite element simulations were conducted using the commercially available package ABAQUS to analyze these two deformation modes. Because in an LIB, Al foil tends to crack due to its low fracture toughness, the material parameters of Al were used in the analysis, with the surface energy γ 0.868 N/m, elastic modulus E 69 GPa, and Poisson's ratio v 0.33. The geometry is H=3 mm, and L=10 mm to match with the experiments. The pre-existing crack is assumed small as compared with the width H. β, dissipated plastic energy per area, is calculated by folding a 10 μm-thick Al foil (the same thickness as that used in LIB) with different folding radius via finite element simulations.",
                        "FIG. 3(b) illustrates the “safe zone” (i.e., Mcrcrack growth/Mcrplastic rolling>1)and the “fracture zone” (i.e., Mcrcrack growth/Mcrplastic rolling<1) as a function of 0 for various α and β. For example, α=0.03 mm (i.e., 1% of H, the width of strip) and β=20 MPa, corresponds to making a sharp crease of a 10 μm-thick Al foil with bending diameter of 70 μm (see FIG. 13), “safe mode” is activated for all angles of θ. The results also show that for a larger β (or equivalently shaper crease) or a (i.e., larger initial crack), “fracture mode” tends to occur. It is important to note from FIG. 12 that for the present battery setup (i.e., bending diameter ranging from 500 μm to 800 μm), β is on the order of 1 MPa, which indicates that it is always the scenario to activate the “safe mode”. Thus, this analysis verifies that the robust electrochemical and mechanical performance of the kirigami LIB is due to the activated “safe mode”.",
                        "The stretchable kirigami LIBs disclosed herein are able to power an electronic device, e.g., a Samsung Gear 2 smart watch. The original LIB with an energy capacity of 300 mAh was removed from the Samsung Gear 2 device and a kirigami LIB using cut-N-twist pattern as disclosed herein was connected to the device. The mass loading for active materials are 0.26 g for graphite, 0.65 g for LCO, which gives the energy capacity 80 mAh. At the compact state, the kirigami LIB is 51.3 mm in length, 27 mm in width, and 2.6 mm in thickness. The produced kirigami LIB was sewn between two elastic bands at its two ends and wrapped around the wrist, allowing the elastic bands to function as an elastic watch strap. By sewing the kirigami LIB to the elastic band at the two ends, the LIB can be stretched and contracted, driven by the elasticity of the band. When the elastic band and the kirigami LIB were at their most compact states, the Samsung Gear 2 was just turned on (at the wrist of the user). Then, while the elastic band was stretched from the wrist to the upper arm, the Samsung Gear 2 was working normally. It is estimated from the circumferences of the wrist and upper arm, the kirigami LIB was subjected to a strain of 30%, lower than its full stretchability. While the elbow was bent and straightened, the smart watch was able to maintain normal functionality, and even display a video. During bending and straightening of the elbow, the biceps introduced an additional 15% strain to the kirigami LIB. Finally, the kirigami LIB was removed from the elastic bands and stretched directly while powering the smart watch. This experiment demonstrates the promises of using a kirigami LIB to replace present rigid and bulky batteries and to power a commercial smart watch, which has been a bottle-neck to develop compact wearable devices. It is worth mentioning that if the kirigami LIB is scaled up to cover the entire area of the elastic band (25 cm in length, 3 cm in width), the energy capacity is about 700 mAh, which significantly exceeds the current LIB used in most smart watches by using the space of the watch strap instead of using the limited space of watch body, and may disruptively impact the field of wearable electronics by offering extra physical and functionality design space. For a fully charged kirigami battery with 80 mAh capacity that was connected with a Samsung Gear 2 smart watch, the standby time was measured to be 24.5 hours. When the smart watch was paired with a Samsung Galaxy S5 cell phone with a Bluetooth connection when they were separated by 30 cm, the smart watch was able to make calls through the Bluetooth connection. The calling time was measured to be 90 minutes. To simulate the standby and calling tests, quantitative discharge characterizations were also conducted by applying the corresponding constant discharge currents for standby (2.9 mA) and calling (48 mA) using an Arbin electrochemical workstation. The stopping voltage of the smart watch was measured to be 3.6 V. As shown in FIG. 4(a) for the simulated standby test, the calling time (when the voltage drops to the stopping voltage 3.6 V) is 25.8 hours, which is consistent with the direct test. For the simulated calling test (FIG. 4(b)), the calling time is 90 minutes, which perfectly matches the direct test.",
                        "The demonstration of stretchable kirigami LIBs as set forth above only represents one application of this type of stretchable energy sources that fully utilize the mainstream manufacturing capability. Other applications may include smart bracelets and smart headbands among many others. It is expected that the kirigami LIBs are able to resolve one of the bottlenecks on the development of wearable devices by providing a scalable solution for a stretchable energy source. The competing mechanisms between “crack growth” and “plastic rolling” also provide a much broader spectrum of employing the concept of kirigami to other fields, such as in microelectromechanical systems (MEMS) where robust interconnects can be placed at the cut/fold locations and the functional devices are fabricated on the rigid faces, which leads to stretchable devices using standardized procedures. These areas appear promising for further research.",
                        "FIG. 5 outlines the assembly of the battery of the present invention. First, the battery is designed with a specific cut pattern. The separator, anode side, and cathode side of the battery are prepared separately according to the specific cut patterns. Those components are then assembled and sealed inside the packaging material. The battery is then folded and cut to the designed pattern. Alternatively, the battery is then cut and folded to the designed pattern. Further alternatively, that battery is then processed with the designed sequence of combination of zero to multiple times of cutting, folding, and unfolding following designed patterns for a stretchable battery.",
                        "The packaging process ensures the good alignment of these multiple component layers. The packaging layers cover all the edges of battery, including cutting edges, to ensure leakage tight sealing of the packaging. The cutting pattern for each of the component layers of the battery may or may not be the same. The design of the patterns of different layers will ensure (1) the leak-tight sealing at the edges, (2) the integrity of the crease during the folding and unfolding of the kirigami battery, and (3) the integrity of the battery during the stretching.",
                        "FIG. 6 shows a flat planar schematic of the battery of the present invention. The battery 600 illustrated in the figure includes a sheet-like stacking of several layers including: an anode current collector 602 in electrical connection with an anode electrode lead 604, an anode electrode 606, a separator 608, a cathode electrode 610, and a cathode current collector 612 in electrical connection with a cathode electrode lead 614. Essentially, the separator 608 separates the anode side of the battery 600 from the cathode side of the battery. A packaging material 616 is used to hermetically seal the stacking layers. Although the anode electrode lead 604 and cathode electrode 614 are noted in the Figure as anode electrode lead and the cathode electrode lead, respectively, other material can be used as known in the art. The anode and cathode electrode leads 604, 614 contain portions that extend outside of the packaging. Those extended portions function as a negative electrode terminal and a positive electrode terminal. The shape of the battery pack may be flat-plate like or curved-plate like. The thickness of the whole battery pack is less than about 10 mm, preferably from about 100 μm to 3 mm.",
                        "Sheet-like electrodes suitable for a thin battery are preferably used in the present invention. The plane shape of the electrode is not particularly limited, but is preferably circular, elliptic, belt-like, rectangular, or approximately rectangular. An “approximately rectangular” shape is, for example, a rectangular shape with four corners chamfered, or a rectangular shape with four corners rounded into arcs.",
                        "The anode side of the battery includes a negative electrode current collector and an anode electrode material layer adhering to one surface or both surfaces of the anode current collector 602, or the stack of multiple combinations of collector and electrode material layer. The anode electrode layer may be formed by: press-fitting or vapor-depositing a negative electrode active material to or on the negative electrode current collector; or alternatively, applying a material mixture including a negative electrode active material onto the anode current collector 602, followed by rolling.",
                        "The anode electrode material may be selected as appropriate from known materials and compositions. For example, a lithium-based negative electrode, various natural and artificial graphites, a silicide, a silicon oxide, or various alloy materials may be used to produce a thin battery with high energy density.",
                        "In the case of a lithium-based anode electrode, the negative electrode layer is preferably a lithium metal layer or a lithium alloy layer, which has a high capacity. Examples of the lithium alloy include Li—Si alloy, Li—Sn alloy, Li—Al alloy, Li—Ga alloy, Li—Mg alloy, and Li—In alloy. In view of improving the negative electrode capacity, the content of elements other than Li in the lithium alloy is preferably 0.1 to 10 mass %, and the content of lithium in the alloy is preferably 90 to 99.9 mass %.",
                        "The anode current collector 602 may be a metal foil, such as an electrolytic metal foil obtained by electrolysis or a rolled metal foil obtained by rolling. The electrolytic metal foil is obtained, for example, by immersing a drum (simulating an electrode) in an electrolytic bath containing a predetermined metal ion, passing a current through the drum while being rotated to deposit a predetermined metal on the surface of the drum, and separating the deposited metal from the drum. The electrolysis process is advantageous for excellent mass-productivity, and comparatively low production cost. The rolling process is advantageous for easy production of a thin metal foil, and weight reduction. The rolled metal foil, in which the crystals are oriented in the rolling direction, is excellent in bending resistance, and is suitably used for a thin battery.",
                        "The cathode side of the battery includes a cathode electrode current collector and a cathode electrode adhering to one surface or both surfaces of the cathode current collector, or a stack of multiple combinations of collector and electrode material. The cathode electrode layer is preferably formed by: vapor-depositing a positive electrode active material on the cathode current collector, or alternatively, applying a material mixture including a cathode electrode material onto the cathode current collector; and then rolling. The cathode electrode material mixture may further include a binder in addition to a cathode electrode material, and further includes a conductive agent, as needed.",
                        "Examples of the cathode electrode material include manganese dioxide; fluorinated carbons; organic or inorganic sulfides; lithium-containing composite oxides; metal oxides such as vanadium oxide or niobium oxide, or lithiated products thereof; conjugated organic polymer with conductivity; Chevrel-phase compounds; and olivine-type compounds. Preferred among them are manganese dioxide, fluorinated carbons, sulfides, and lithium-containing composite oxides, and particularly preferred is manganese dioxide.",
                        "Given that the reaction of manganese dioxide in the battery is a one-electron reaction, the theoretical capacity per mass of the positive electrode active material is 308 mAh/g, which is a high capacity. In addition, manganese dioxide is inexpensive. A particularly preferred manganese dioxide is electrolytic manganese dioxide because it is easily available. Manganese dioxide may contain a very small amount of impurities which have inevitably entered in the production process. The positive electrode active material may be a mixture which is mainly composed of manganese dioxide and contains a material other than manganese dioxide, such as a fluorinated carbon, vanadium oxide, or olivine-type compound.",
                        "Examples of the fluorinated carbons include fluorinated graphite represented by (CFw)m, where m is an integer of one or more, and 0<w≦1. Examples of the sulfides include Ti6, Mo6, and Fe6. Examples of the lithium-containing composite oxides include LixaCoO2, LiNiO2, LixaMnO2, LixaCoyNi1-yO2, LixaCoyMi1-yOz, LixaNi1-yMyOz, LixbMn2O4, and LixbMn2O4. In the above formulae, M is at least one selected from the group consisting of Na, Mg, Sc, Y, Mn, Fe, Co, Ni, Cu, Zn, Al, Cr, Pb, Sb, and B; xa=0 to 1.2; xb=0 to 2; y=0 to 0.9; and z=2 to 2.3. The values of xa and xb are values before the start of charge and discharge, and increases and decreases during charge and discharge.",
                        "Examples of the conductive agent include graphites, such as natural graphite and artificial graphite; carbon blacks, such as acetylene black, Ketjen black, channel black, furnace black, lamp black, and thermal black; conductive fibers, such as carbon fiber and metallic fiber; metal powders, such as aluminum powder; conductive whiskers, such as zinc oxide whisker and potassium titanate whisker; conductive metal oxides, such as titanium oxide; and organic conductive materials, such as a phenylene derivative. The conductive agents may be used singly or in combination of two or more. In view of improving the conductivity of the cathode electrode layer and ensuring the positive electrode capacity, the content of the conductive agent in the positive electrode active material layer is preferably 1 to 30 parts by mass per 100 parts by mass of the positive electrode active material.",
                        "Examples of the binder include polyvinylidene fluoride (PVDF), polytetrafluoroethylene, polyethylene, polypropylene, aramid resin, polyamide, polyimide, polyamide-imide, polyacrylonitrile, polyacrylic acid, polymethyl acrylate, polyethyl acrylate, polyhexyl acrylate, polymethacrylic acid, polymethyl methacrylate, polyethyl methacrylate, polyhexyl methacrylate, polyvinyl acetate, polyvinylpyrrolidone, polyether, polyether sulfone, hexafluoropolypropylene, styrene-butadiene rubber, and carboxymethyl cellulose. The binders may be used singly or in combination of two or more. In view of improving the bonding property of the cathode electrode and ensuring the cathode electrode capacity, the content of the binder in the positive electrode active material layer is preferably 1 to 15 parts by mass per 100 parts by mass of the positive electrode active material.",
                        "The binder may be a polymer electrolyte. The presence of a polymer electrolyte in the cathode electrode layer facilitates diffusion of lithium ions, allowing for smooth transfer of lithium ions between the cathode current collector and the cathode electrode. The polymer electrolyte may be used singly as a binder, or in combination with another binder.",
                        "The positive electrode current collector may be, for example, a metal film, a metal foil, and a non-woven fabric made of a metal fiber. Examples of a metal material constituting the cathode current collector include silver, nickel, palladium, gold, platinum, aluminum, aluminum alloy, and stainless steel. One of them may singly constitute the current collector, or a combination of two or more of them may constitute the current collector.",
                        "The packaging material is preferably composed of a highly flexible material with excellent flex resistance (e.g., a film-like material). Preferably, the packaging material is composed of a laminated film, which includes a water-vapor barrier layer and a resin layer provided on one surface or both surfaces of the barrier layer. The barrier layer is preferably a metal layer or a ceramics layer.",
                        "The metal layer is preferably made of aluminum, titanium, nickel, stainless steel, gold, or silver for strength and bending resistance. The ceramic layer is preferably made of silicon oxide, magnesium oxide, or aluminum oxide. Among them, aluminum, aluminum oxide, and silicon oxide are particularly preferred due their low production cost and excellent barrier property.",
                        "The thickness of the barrier layer is preferably 10 to 70 μm. The thickness of the resin layer, both on the inside and the outside of the housing, is preferably 20 to 80 μm. The thickness of the laminated film is preferably 30 to 150 μm. By using a laminated film having such a thickness, it is possible to reduce the thickness of the thin battery, while ensuring the strength and flexibility of the packaging material.",
                        "In view of the strength, impact resistance, and electrolyte resistance, the resin layer on the inside of the packaging is preferably made of, for example, polyolefin such as polyethylene (PE) or polypropylene (PP), a modified product thereof, polyethylene terephthalate (PET), polybutylene terephthalate (PBT), polyamide, polyurethane, polyethylene-vinyl acetate copolymer (EVA), or an ionomer resin.",
                        "In view of the strength, impact resistance, and chemical resistance, the resin layer on the outside of the housing is preferably made of, for example, polyamide (PA) such as 6,6-nylon or 6-nylon, or polyester such as PET or PBT.",
                        "Preferably, the housing is made of, for example, an acid-modified-PP/PET/Al/PET laminated film, an acid-modified-PE/PA/Al/PET laminated film, an ionomer-resin/Ni/PE/PET laminated film, an EVA/PE/Al/PET laminated film, or an ionomer-resin/PET/Al/PET laminated film. The Al layer and Ni layer may be replaced with a ceramics layer such as an Al2O3 layer or SiO2 layer.",
                        "The separator layer has a function of separating the anode side from the cathode side of the battery, and contains an electrolyte that allows for ion migration. The electrolyte may be liquid, gel or solid. A non-aqueous electrolyte is most preferred because it has a wide potential window. The separator layer may contain any component in addition to the electrolyte, as long as the purpose thereof is not impaired. For example, for the purpose of improving the strength, homogeneity, and ion conductivity of the electrolyte, a filler such as inorganic particles or resin particles may be added to the electrolyte. Examples of the inorganic particles include alumina fine particles and silica fine particles.",
                        "The separator 608 preferably has ion permeability, as well as excellent mechanical strength and insulating property. Examples of a material for such a separator include polypropylene, polyethylene, cellulose, polyethylene terephthalate, polyphenylene sulfide, polyamide, and polyimide. A preferred oriented sheet is a microporous film containing either polypropylene or polyethylene, or both. A separator including such a microporous film and a highly heat resistant layer of polyamide or the like laminated thereon has a shutdown function and is excellent in short-circuit resistance.",
                        "A liquid electrolyte may be a solution comprising a solvent and a solute (a supporting salt) dissolving in the solvent, and further comprising various additives, if necessary.",
                        "A gel electrolyte (a gel polymer electrolyte) is generally a gel containing a liquid electrolyte and a polymer material therewith serving as a matrix. The gel polymer electrolyte may be any polymer material that can be gelled by absorbing a liquid electrolyte. Examples of such a polymer material include: poly(meth)acrylate polymers having an ester unit, such as silicone, acrylic acid, acrylic acid ester, methacrylic acid, or methacrylic acid ester, as a principal component (e.g., 90 mol % or more); polyacrylonitrile; polyphosphazene; polyethylene oxide; polypropylene oxide; and fluorine polymer. These polymer materials may be used singly or as a mixture or composite of two or more. Furthermore, these polymer materials may be cross-linked or modified, as appropriate.",
                        "Among the above-exemplified polymer materials, a fluorine polymer, in particular, is highly resistive to oxidation and reduction, and thus is suitable for allowing a liquid non-aqueous electrolyte to be absorbed therein. It is preferable to use, for example, polyvinylidene fluoride, vinylidene fluoride-hexafluoropropylene copolymer, vinylidene fluoride-trifluoroethylene copolymer, or vinylidene fluoride-tetrafluoroethylene copolymer, singly or as a mixture of two or more.",
                        "A solid electrolyte may be a powder or deposited film of various inorganic solid electrolytes, or a dry polymer electrolyte. Examples of the inorganic solid electrolytes include: lithium halides such as lithium iodide, and derivatives thereof; lithium nitride; oxyacid salt-based materials; and sulfide-based materials. The dry polymer electrolyte is a polymer material with a solute (supporting salt) added thereto, and is free of solvent.",
                        "Examples of the polymer material serving as a matrix of the dry polymer electrolyte include: ether polymers such as polyethylene oxide, and cross-linked products thereof; and poly(meth)acrylate polymers. These may be a polymer of one monomer, or a copolymer of two or more monomers. These polymer materials may be used singly or as a mixture or composite of two or more.",
                        "Among the above examples, a separator containing a dry polymer electrolyte or gel polymer electrolyte is preferred, in view of preventing the electrolyte components from leaking outside in the event the packaging is damaged. Various fillers may be added to the dry polymer electrolyte or gel polymer electrolyte. Alternatively, the dry polymer electrolyte or gel polymer electrolyte is impregnated into or allowed to adhere to the separator serving as a support, to form an electrolyte layer.",
                        "When a dry polymer electrolyte or gel polymer electrolyte is used, it may not be necessary to provide a means for preventing the leakage of electrolyte. Therefore, it is possible to easily make the thin battery smaller in size, lighter in weight, and further thinner in thickness. Furthermore, by using a dry polymer electrolyte or gel polymer electrolyte, the separator layer becomes amenable to bending. As such, the adhesion between the electrodes may be further improved, and variations and deterioration of the battery performance are significantly suppressed even after repeated bending."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "LIBs were produced by the standard packaging procedure and slurry coating (using graphite as an anode and LiCoO2 as a cathode), followed by designated folding and cutting procedures to achieve particular kirigami patterns. Over 150% stretchability and 87 Wh/kg energy density have been achieved and the produced kirigami LIBs have been demonstrated to power a Samsung Gear 2 smart watch.",
                                "Additional LIBs were formed using the other two kirigami patterns of FIGS. 1(a) and 1(c), namely zigzag-cut patterns and cut-N-shear patterns, respectively. Very similar electrochemical and mechanical characteristics were exhibited during testing of these kirigami LIBs. The LIB using the cut-N-shear pattern (FIG. 1(c)) exhibited double the energy capacity compared with that using the cut-N-twist pattern (FIG. 1(b)) for a given length, and its stretchability was determined to be up to 150%.",
                                "**Fabrication of Kirigami Lithium-Ion Batteries**",
                                "The multilayer stacking structures as shown in FIG. 6 were used to fabricate the exemplary lithium-ion batteries (LIBs), where graphite (commercially available from Fisher Scientific Inc.) and LiCoO2 (LCO, commercially available from MTI Corp.) were used as active materials for anode and cathode electrodes, respectively. Copper (Cu) and aluminum (Al) were used as the anode and cathode current collectors, respectively. Polypropylene (commercially available as Celgard 2500) was used as the separator, 1 M LiPF6 in EC:DMC:DEC (1:1:1) as the electrolyte, and aluminized polyethylene (PE) (commercially available form Sigma-Aldrich Corp.) was the packaging material. Cathode slurries were prepared by mixing the LCO, PVDF (commercially available from MTI Corp.), Carbon black (commercially available as Super C45) and N-Methyl-2-pyrrolidone solvent (commercially available from CreoSalus, Inc.) with a ratio of 8:1:1:5 by weight. The slurry was uniformly coated on a 10 μm-thick Al foil (commercially available as Reynolds Wrap), and then dried on a hot plate at 130° C. for 5 hours in room environment. Anode slurries were prepared by mixing the graphite, carbon black (commercially available as Super C45), Carboxymethyl cellulose (commercially available from Fisher Scientific), Styrene Butadiene Rubber (commercially available from Fisher Scientific) and deionized water with a ratio of 95:2.5:1.25:1.25:200 by weight. The slurry was uniformly coated on a 20 μm-thick Cu foil (CF-T8G-UN, commercially available from Pred Materials International, Inc.), and then dried on a hot plate at 130° C. for 5 hours in room environment. A mass ratio for graphite:LCO was around 1:2.5. The anode and cathode electrodes were pressed to make condensed electrodes. The multilayer structures shown in FIG. 6 were subjected to folding and cutting following the three patterns illustrated in FIGS. 1(a)-(c).",
                                "**Electrochemical Characterization**",
                                "An electrochemical workstation available from Arbin Instruments, Inc. with a cutoff voltage of 2.5-4.2 V at room temperature was used to conduct cyclic galvanostatic charge and discharge of the kirigami batteries at the most compact and the stretched states. The maximum output power of the fully charged battery was calculated by V2/2Ri, where V is the open circuit voltage and Ri is the internal resistance as a function of system-level mechanical strain and cycles of mechanical loading. The values of voltage of the exemplary kirigami batteries were measured using a voltmeter. The electrochemical impedance spectroscopy (EIS) characterizations were performed by applying a small perturbation voltage of 5 mV in the frequency range of 0.1 Hz to 100 kHz during the first discharge cycle before and after stretching, using a Gamry Echem Analyst. The analysis of the impedance spectra was conducted using equivalent circuit software provided by the manufacturer.",
                                "**Electrochemical and Mechanical Characterization of Kirigami Lithium-Ion Batteries Using Cut-N-Shear Pattern**",
                                "FIGS. 7(a)-(i) relate to exemplary LIBs prepared using the cut-N-shear pattern. An exemplary LIB prepared using the cut-N-shear pattern was shown to be stretchable up to 150% using the most compact state as the reference. The thickness change, from 4.30 mm at the most compact state to 2.7 mm at the most stretched state, is noticeable.",
                                "FIG. 7(a) shows the electrochemical cycling (galvanostatic charge and discharge) results of an LIB using the cut-N-shear pattern at its most compact state (for the 1st to 5th cycles), followed by that at its most stretched state (for the 6th to 10th cycles), then that at its most compact state again (for the 11th to 15th cycles) and finally followed by that at its most stretched state again (for the 16th to 20th cycles) under C/3 charge/discharge rate. Fairly stable charge/discharge behaviors under the compact and stretched states are observed. The present mass loading gives this kirigami LIB about 75 mAh energy capacity. The mass loading of LiCoO2 (LCO) (specific capacity of 145 mAh g−1) and graphite (specific capacity of 372 mAh g−1) were 240 mg and 650 mg, respectively, which gave LIB the capacity of 75 mAh.",
                                "FIG. 7(b) shows the cyclic stability of the LIBs up to 20 cycles, illustrating capacity and Coulombic efficiency as a function of cycle number for a C/3/ charge/discharge rate. The mass accounts for all the materials involved in the cell, which is 2.98 g.",
                                "FIG. 7(c) shows the excellent rate performance of the exemplary kirigami battery when the charge/discharge rate varied in the sequence of C/3, C/2, C and C/3 again at both compact and stretched state. When discharge rates increase, as expected, the capacity decreases from 90.8 Wh/kg for C/3 rate to 82.4 Wh/kg for C/2 rate, and 70.2 Wh/kg for discharge rate C. However, the capacity recovered to the 87.8 Wh/kg when the discharge rate resumed to C/3 after 30 cycles charge/discharge at the both compact the stretched state under varies C-rates, which indicates excellent rate performance of this kirigami battery.",
                                "FIG. 7(d) provides the results for electrochemical impedance spectroscopy (EIS) studies during the first discharge cycle at the most compact state before the stretching and stretched states after 100 cycles of stretching. EIS studies were performed by applying a small perturbation voltage of 5 mV in the frequency range of 0.1 Hz to 100 kHz. Typical impedance spectrum, with high-to-middle frequency range flat curve and a relative straight line representing the low frequency range, was observed. No obvious semicircle was observed because of the low internal resistant. There are no significant changes in the impedance before and after mechanical deformation.",
                                "The mechanical characteristics of the fully charged kirigami LIB using cut-N-shear were examined. At different stretchability levels, namely 0%, 40%, and 90%, the output voltage remained steady at 3.87 V. FIG. 7(e) shows the maximum output power of the kirigami LIB as a function of stretchability, εstretch , under different cycles of stretching. The internal resistance of the battery is measured to be about 1.5 Ω. Over 1,000 stretching cycles and up to a stretchability εstretch of 83%, there is insignificant decrease of the power. The maximum output power is 4.7 W and is sufficient to operate commercial light-emitting diodes (LEDs). LEDs driven by this kirigami LIB do not show noticeable dimming upon cyclic stretching.",
                                "FIGS. 7(f)-(g) show the scanning electron micrographs (SEMs) for the anode current collectors (e.g., Cu foil) at the cuts before charging, and after discharge and 100 cycles of mechanical deformation. Similar SEM images are given for the cathode current collectors (e.g., Al foils) in FIGS. 7(h)-(i). There are no cracks after cyclic mechanical stretching.",
                                "Electrochemical and Mechanical Characterization of the Kirigami Lithium-Ion Batteries using Zigzag-Cut Pattern",
                                "FIGS. 8(a)-(i) relate to exemplary LIBs prepared using the zigzag-cut pattern. The LIB prepared using a zigzag-cut pattern exhibited relatively small stretchability, approximately 46% measured from the most compact state to the most stretched state, and out-of-plane deformation can be observed when stretched.",
                                "FIG. 8(a) shows the electrochemical cycling (galvanostatic charge and discharge) results of an LIB using the zigzag-cut pattern at its most compact state (for the 1st to 5th cycles), followed by that at its most stretched state (for the 6th to 10th cycles), then that at its most compact state again (for the 11th to 15th cycles) and finally followed by that at its most stretched state again (for the 16th to 20th cycles) under C/3 charge/discharge rate. Fairly stable charge/discharge behaviors under the compact and stretched states are observed. The present mass loading gives this kirigami LIB 55 mAh energy capacity. The mass loading of LiCoO2 (LCO) (specific capacity of 145 mAh g−1) and graphite (specific capacity of 372 mAh g−1) were 174 mg and 457 mg, respectively, which gave LIB the capacity of 55 mAh.",
                                "FIG. 8(b) shows the cyclic stability of the LIBs up to 20 cycles, illustrating capacity and Coulombic efficiency as a function of cycle number for a C/3/ charge/discharge rate. The mass accounts for all the materials involved in the cell, which is 2.10 g.",
                                "The rate performance of the exemplary kirigami battery when the charge/discharge rate varied in the sequence of C/3, C/2, C and C/3 again at both compact and stretched state is illustrated in FIG. 8(c). When discharge rates increase, as expected, the capacity decreases from 92.8 Wh/kg for C/3 rate to 88.3 Wh/kg for C/2 rate, and 77.2 Wh/kg for discharge rate C. However, the capacity recovered to the 91.0 Wh/kg when the discharge rate resumed to C/3 after 30 cycles charge/discharge at the both compact the stretched state under varies C-rates, which indicates excellent rate performance of this kirigami battery.",
                                "Electrochemical impedance spectroscopy (EIS) studies during the first discharge cycle at the most compact state before the stretching and stretched states after 100 cycles of stretching are shown in FIG. 8(d). EIS studies were performed by applying a small perturbation voltage of 5 mV in the frequency range of 0.1 Hz to 100 kHz. Typical impedance spectrum, with high-to-middle frequency range flat curve and a relative straight line representing the low frequency range, was observed. No obvious semicircle was observed because of the low internal resistant. There are no significant changes in the impedance before and after mechanical deformation.",
                                "The mechanical characteristics of the fully charged kirigami LIB formed using the zigzag-cut were examined. At different stretchability levels, namely, 0%, 40%, and 90%, the output voltage remained steady at 3.86 V. FIG. 8(e) shows the maximum output power of the kirigami LIB as a function of stretchability, εstretch , under different cycles of stretching. The internal resistance of the battery is measured to be about 1.7 Ω. Over 1,000 stretching cycles and up to a stretchability εstretch of 35%, there is no obvious output power decay. The output power of 4.7 W is sufficient to operate commercial light-emitting diodes (LEDs). LEDs driven by this kirigami LIB do not show noticeable dimming upon cyclic stretching.",
                                "FIGS. 8(f)-(g) show the scanning electron micrographs (SEMs) for the anode current collectors (e.g., Cu foil) at the cuts before charging, and after discharge and 100 cycles mechanical deformation. Similar SEM images are given for the cathode current collectors (e.g., Al foils) in FIGS. 8(h)-(i). No cracks are observed after cyclic mechanical stretching.",
                                "Theoretical Analysis of the Two Competing Mechanisms, “Crack Growth” versus “Plastic Rolling”",
                                "According to the Griffith's criterion for linear elastic fracture, potential energy takes this form πcrack growth˜σ2α2/E, where σ is the normal stress on the crack, α is the size of the crack and E is the elastic modulus. The energy releasing rate due to the crack growth is then given by J=∂πcrack growth/∂α˜σ2α/E. Here J is the J-integral which equals to the energy release per unit area. For the present scenario that has different geometrical setup as that in the Griffith's criterion, the geometry factors are taken into account. The form of J is speculated to be Aσ2α/E, where A characterizes the geometrical effects and is determined by finite element simulations. A is assumed to be a function of θ.",
                                "In finite element simulations using commercial package ABAQUS, the values of σ, α and E are fixed while θ changes from 0 to π/3. Plane stress model was applied as the structure has very low thickness compared to its in-plane dimensions. Mesh was refined around the crack tip, which is shown in FIG. 9 for θ=π/4. About 200,000 CPS4R (4-node bilinear plane stress quadrilateral, reduced integration) elements were used to obtain accurate and converged results. J-integral was obtained by numerical integration along the elements on a circle with the crack tip as its center. After obtaining the values of J-integral for different angles θ, the value of A can be calculated by the expression of J as mentioned above, i.e. J=Aσ2α/E . Substitute A into the expression of Mcrcrack growth and the final expression of Mcrcrack growth is thus obtained.",
                                "During the plastic rolling (i.e., the angle θ changes), the plastic zone is highlighted by the shaded area as shown in FIG. 10. The area of the plastic zone is H2 tanθ/4, so the critical moment Mcrplastic rolling for plastic rolling can be obtained by Mcrplastic rolling=∂πplastic rolling/∂θ=∂(βH2 tan θ/4)/∂θ=βH2(1+tan2 θ)/2.",
                                "For plastic rolling, β, the dissipated plastic energy density, was calculated by simulating folding a thin foil by a prescribed folding thickness. This problem was modeled by bending a thin film around a rigid circular die as illustrated in FIG. 11. The diameter of the rigid circular die corresponds to the folding thickness. The material parameters of Al were used in the analysis. Contact was defined between the deformable thin foil and the rigid die. 1,571 B22 (3-node quadratic beam) elements were used in the analysis. Once the thin foil enters the plastic zone, the plastic energy density was then calculated.",
                                "FIG. 12 shows β as a function of the ratio between the folding thickness and foil thickness Hfolding/hfoil. It is found that as the ratio Hfolding/hfoil increases, β decreases. For the real battery setup, Al foil is 10 μm in thickness, while the entire battery cell is 500 μm-800 μm in thickness depending on the mass loading of the active materials, which gives the ratio Hfolding/hfoil about 50 to 80. Within this range, FIG. 12 shows that β is on the order of 1 Mpa.",
                                "Although certain presently preferred embodiments of the invention have been specifically described herein, it will be apparent to those skilled in the art to which the invention pertains that variations and modifications of the various embodiments shown and described herein may be made without departing from the spirit and scope of the invention. Accordingly, it is intended that the invention be limited only to the extent required by the appended claims and the applicable rules of law."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "produce LIBs with kirigami patterns",
                                "achieve 150% stretchability and 87 Wh/kg energy density",
                                "demonstrate powering a Samsung Gear 2 smart watch",
                                "form LIBs using zigzag-cut and cut-N-shear patterns",
                                "exhibit similar electrochemical and mechanical characteristics",
                                "fabricate LIBs using multilayer stacking structures",
                                "use graphite and LiCoO2 as active materials",
                                "prepare cathode and anode slurries",
                                "coat and dry slurries on Al and Cu foils",
                                "press electrodes to make condensed electrodes",
                                "fold and cut multilayer structures",
                                "conduct cyclic galvanostatic charge and discharge",
                                "calculate maximum output power",
                                "perform electrochemical impedance spectroscopy",
                                "analyze impedance spectra using equivalent circuit software",
                                "show electrochemical cycling results for cut-N-shear pattern",
                                "illustrate cyclic stability and rate performance",
                                "provide electrochemical impedance spectroscopy results",
                                "examine mechanical characteristics of kirigami LIB",
                                "show scanning electron micrographs for anode and cathode current collectors",
                                "show electrochemical cycling results for zigzag-cut pattern",
                                "illustrate cyclic stability and rate performance",
                                "provide electrochemical impedance spectroscopy results",
                                "examine mechanical characteristics of kirigami LIB",
                                "show scanning electron micrographs for anode and cathode current collectors",
                                "analyze crack growth mechanism",
                                "perform finite element simulations",
                                "calculate J-integral and critical moment",
                                "analyze plastic rolling mechanism",
                                "calculate dissipated plastic energy density"
                            ],
                            "num_characters": 15143,
                            "outline_medium": [
                                "fabricate kirigami LIBs with different patterns",
                                "achieve 150% stretchability and 87 Wh/kg energy density",
                                "demonstrate powering a Samsung Gear 2 smart watch",
                                "fabricate LIBs using zigzag-cut and cut-N-shear patterns",
                                "exhibit similar electrochemical and mechanical characteristics",
                                "exhibit double energy capacity with cut-N-shear pattern",
                                "fabricate multilayer stacking structures for LIBs",
                                "prepare cathode and anode slurries",
                                "coat and dry slurries on Al and Cu foils",
                                "press electrodes to make condensed electrodes",
                                "fold and cut multilayer structures to achieve kirigami patterns",
                                "conduct electrochemical characterization of kirigami LIBs",
                                "analyze impedance spectra using equivalent circuit software",
                                "analyze mechanical characteristics of kirigami LIBs",
                                "provide theoretical analysis of crack growth and plastic rolling mechanisms"
                            ],
                            "outline_short": [
                                "fabricate kirigami LIBs with different patterns",
                                "describe electrochemical characterization of kirigami LIBs",
                                "detail electrochemical and mechanical characterization of kirigami LIBs using cut-N-shear pattern",
                                "detail electrochemical and mechanical characterization of kirigami LIBs using zigzag-cut pattern",
                                "analyze two competing mechanisms: crack growth and plastic rolling",
                                "simulate crack growth using finite element method",
                                "discuss limitations and variations of the invention"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce kirigami patterns",
                        "describe zigzag-cut pattern",
                        "explain out-of-plane deformation",
                        "introduce cut-N-twist pattern",
                        "describe twisted structure",
                        "define packing density",
                        "introduce cut-N-shear pattern",
                        "describe folding and shear process",
                        "demonstrate kirigami LIBs",
                        "describe conventional materials and approaches",
                        "assemble battery cells",
                        "illustrate electrochemical cycling results",
                        "show capacity and Coulombic efficiency",
                        "illustrate rate performance",
                        "provide electrochemical impedance spectroscopy results",
                        "examine mechanical characteristics",
                        "show maximum output power",
                        "illustrate SEMs for anode current collectors",
                        "illustrate SEMs for cathode current collectors",
                        "analyze deformation modes",
                        "describe Griffith's criterion",
                        "define critical moment for crack growth",
                        "describe plastic rolling mode",
                        "define critical moment for plastic rolling",
                        "conduct finite element simulations",
                        "illustrate safe zone and fracture zone",
                        "verify robust electrochemical and mechanical performance",
                        "power electronic device",
                        "connect kirigami LIB to Samsung Gear 2 smart watch",
                        "estimate strain on kirigami LIB",
                        "demonstrate functionality of smart watch",
                        "measure standby time and calling time",
                        "conduct quantitative discharge characterizations",
                        "simulate standby and calling tests",
                        "outline assembly of battery",
                        "design cut pattern",
                        "prepare separator, anode, and cathode sides",
                        "assemble and seal components",
                        "fold and cut battery to designed pattern",
                        "illustrate flat planar schematic of battery",
                        "describe anode current collector materials",
                        "describe electrolytic metal foil production",
                        "describe rolling process advantages",
                        "describe cathode electrode layer formation",
                        "describe cathode electrode material examples",
                        "motivate manganese dioxide",
                        "describe manganese dioxide advantages",
                        "describe fluorinated carbons",
                        "describe sulfides",
                        "describe lithium-containing composite oxides",
                        "describe conductive agents",
                        "describe binder examples",
                        "describe binder properties",
                        "describe polymer electrolyte",
                        "describe cathode current collector materials",
                        "describe packaging material requirements",
                        "describe laminated film structure",
                        "describe barrier layer materials",
                        "describe resin layer materials",
                        "describe laminated film thickness",
                        "describe resin layer properties",
                        "describe separator layer function",
                        "describe electrolyte types",
                        "describe separator materials",
                        "describe gel polymer electrolyte"
                    ],
                    "num_characters": 33259,
                    "outline_medium": [
                        "introduce kirigami patterns",
                        "describe zigzag-cut pattern",
                        "describe cut-N-twist pattern",
                        "describe cut-N-shear pattern",
                        "demonstrate kirigami LIBs",
                        "describe conventional materials and approaches for LIB preparation",
                        "describe assembly of battery cells",
                        "illustrate electrochemical cycling results",
                        "illustrate capacity and Coulombic efficiency",
                        "illustrate rate performance",
                        "illustrate electrochemical impedance spectroscopy results",
                        "examine mechanical characteristics",
                        "illustrate maximum output power",
                        "show scanning electron micrographs",
                        "describe theoretical analysis and simplified model",
                        "describe finite element simulations",
                        "illustrate \"safe zone\" and \"fracture zone\"",
                        "demonstrate stretchable kirigami LIBs powering electronic devices",
                        "describe assembly of battery",
                        "illustrate flat planar schematic of battery",
                        "describe anode current collector materials",
                        "describe cathode electrode layer formation",
                        "list cathode electrode materials",
                        "describe manganese dioxide properties",
                        "list conductive agents",
                        "list binders",
                        "describe cathode current collector materials",
                        "describe packaging material composition",
                        "describe separator layer function",
                        "list separator materials",
                        "describe electrolyte types",
                        "describe gel polymer electrolyte composition"
                    ],
                    "outline_short": [
                        "illustrate kirigami patterns",
                        "describe zigzag-cut pattern",
                        "describe cut-N-twist pattern",
                        "describe cut-N-shear pattern",
                        "demonstrate kirigami LIBs",
                        "show electrochemical cycling results",
                        "analyze mechanical characteristics",
                        "provide theoretical analysis of deformation modes",
                        "demonstrate powering of electronic device",
                        "outline assembly and packaging process",
                        "describe anode current collector materials",
                        "describe cathode electrode materials and their properties",
                        "describe conductive agents and binders for cathode electrode",
                        "describe cathode current collector materials and packaging materials",
                        "describe separator layer materials and properties",
                        "describe electrolyte types and materials"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A flexible and stretchable battery comprising an assembly having an anode side and a cathode side separated by a separator and sealed in a packaging, wherein the assembly is in a folded configuration and contains at least one cut therein, such that when the assembly is unfolded and subjected to subsequent deformation, a final folded state of the battery is able to stretch beyond a flat planar state of the battery in all dimensions.",
        "2. The flexible and stretchable battery of claim 1, wherein the cut forms a zigzag-cut pattern, a cut-N-twist pattern, a cut-N-shear pattern, a cut-N-rotation pattern, a spiral pattern, or combinations thereof, when the assembly is in a flat planar position.",
        "3. The flexible and stretchable battery of claim 1, wherein the anode side is formed of an anode current collector in electrical connection with an anode electrode lead and an anode electrode.",
        "4. The flexible and stretchable battery of claim 3, wherein the anode current collector is formed of a graphite-coated copper material.",
        "5. The flexible and stretchable battery of claim 3, wherein the anode electrode is formed of a lithium, graphite, silicide, or silicon oxide material.",
        "6. The flexible and stretchable battery of claim 5, wherein the anode electrode is formed of lithium metal or a lithium-based alloy selected from lithium-silicon alloy, lithium-tin alloy, lithium-aluminum alloy, lithium-gallium alloy, lithium-magnesium alloy, or lithium-indium alloy.",
        "7. The flexible and stretchable battery of claim 6, wherein the content of lithium in the lithium-based alloy is 90 to 99.9 mass %.",
        "8. The flexible and stretchable battery of claim 1, wherein the cathode side is formed of a cathode current collector in electrical connection with a cathode electrode lead and a cathode electrode.",
        "9. The flexible and stretchable battery of claim 5, wherein the cathode current collector is formed of a LiCoO2-coated aluminum material.",
        "10. The flexible and stretchable battery of claim 8, wherein the cathode electrode is formed of manganese dioxide, fluorinated carbons, organic or inorganic sulfides, lithium-containing composite oxides, metal oxides or lithiated products thereof, conjugated organic polymer, Chevrel-phase compounds, olivine-type compounds, or combinations thereof.",
        "11. The flexible and stretchable battery of claim 10, wherein the cathode electrode is formed of manganese dioxide, fluorinated carbons, sulfides, lithium-containing composite oxides, or combinations thereof.",
        "12. The flexible and stretchable battery of claim 3, wherein the anode electrode lead contains a portion that extends outside of the packaging to function as a negative electrode terminal",
        "13. The flexible and stretchable battery of claim 8, wherein the cathode electrode lead contains a portion that extends outside of the packaging to function as a positive electrode terminal.",
        "14. The flexible and stretchable battery of claim 1, wherein the packaging material is formed of laminated film having a water-vapor barrier layer and a resin layer provided on at least one surface of the water-vapor barrier layer.",
        "15. The flexible and stretchable battery of claim 1, wherein the separator is formed of polypropylene, polyethylene, cellulose, polyethylene terephthalate, polyphenylene sulfide, polyamide, polyimide, and combinations thereof.",
        "16. The flexible and stretchable battery of claim 1, wherein a stretchability of the battery is produced by utilizing rotation and/or bending of an interconnection to release stress during stretching and twisting of the battery.",
        "17. The flexible and stretchable battery of claim 1, wherein the assembly has a flat-plate or curved-plate shape.",
        "18. A method of making a flexible and stretchable battery, comprising the steps of:\nforming an assembly having an anode side and a cathode side separated by a separator and sealed in a packaging;\nfolding the assembly; and\ncutting the assembly, such that when the assembly is unfolded and subjected to subsequent deformation, a final folded state of the battery is able to stretch beyond a flat planar state of the battery in all dimensions.",
        "19. The method of claim 18, wherein the cut assembly forms a zigzag-cut pattern, a cut-N-twist pattern, a cut-N-shear pattern, a cut-N-rotation pattern, a spiral pattern, or combinations thereof, when it is in a flat planar position.",
        "20. An electronic device comprising:\nelectronics; and\nat least one flexible and stretchable battery that provides power to the electronics, the at least one flexible and stretchable battery comprising an assembly having an anode side and a cathode side separated by a separator and sealed in a packaging, wherein the assembly is in a folded configuration and contains at least one cut therein, such that when the assembly is unfolded and subjected to subsequent deformation, a final folded state of the battery is able to stretch beyond a flat planar state of the battery in all dimensions."
    ]
}