{
    "id": "https://semopenalex.org/work/W2082680333",
    "authors": [
        "Peter ten Dijke",
        "Slobodan Vukičević",
        "R.K. Suto",
        "Carola Krause",
        "Maarten van Dinther",
        "Marilyn Patterson",
        "Lovorka Grgurević",
        "Moulay Hicham Alaoui-Ismaili",
        "Dean Falb",
        "Kening Song",
        "Songting Shi"
    ],
    "title": "Identification of a Key Residue Mediating Bone Morphogenetic Protein (BMP)-6 Resistance to Noggin Inhibition Allows for Engineered BMPs with Superior Agonist Activity",
    "date": "2010-04-01",
    "abstract": "Bone morphogenetic proteins (BMPs) are used clinically to induce new bone formation in spinal fusions and long bone non-union fractures. However, large amounts of BMPs are needed to achieve these effects. BMPs were found to increase the expression of antagonists, which potentially limit their therapeutic efficacy. However, the relative susceptibility of osteoinductive BMPs to different antagonists is not well characterized. Here we show that BMP-6 is more resistant to noggin inhibition and more potent in promoting osteoblast differentiation in vitro and inducing bone regeneration in vivo when compared with its closely related BMP-7 paralog. Noggin was found to play a critical role as a negative feedback regulator of BMP-7 but not BMP-6-induced biological responses. Using BMP-6/7 chimeras, we identified lysine 60 as a key residue conferring noggin resistance within the BMP-6 protein. A remarkable correlation was found between the presence of a lysine at this position and noggin resistance among a panel of osteoinductive BMPs. Introduction of a lysine residue at the corresponding positions of BMP-2 and BMP-7 allowed for molecular engineering of recombinant BMPs with increased resistance to noggin antagonism.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Materials-HEK293T, C2C12, COS, and A549 cells were obtained from ATCC (Manassas, VA). ROS 17/2.8 cells were kindly provided by R. J. Majeska and G. A. Rodan (University of Connecticut, Farmington, CT). Recombinant human BMP-2, BMP-6, and BMP-7 were produced in Chinese hamster ovary cells. Human BMP-4, BMP-5, BMP-9, and noggin-Fc were purchased from R&D Systems (Minneapolis, MN). Tissue culture media, sera, Geneticin, and precast NuPAGE gels were purchased from Invitrogen. Bright-Glo luciferase assay reagent was purchased from Promega (Madison, WI). IRDye-labeled secondary antibodies and molecular weight markers were from Li-Cor Biosciences (Lincoln, NE). FuGENE 6 and HD were purchased from Roche Applied Science. Polyclonal anti-human BMP-7 antibodies against the mature BMP-7 region were raised in rabbits. The BCA protein assay kit was from Fisher. KOD hot start DNA polymerase and custom oligonucleotides were purchased from EMD (Gibbstown, NJ) and IDT (Coralville, IA), respectively.",
                "Cell Culture-COS, C2C12, and HEK293T cells were maintained in DMEM supplemented with 10% FBS and penicillin/ streptomycin. A549 and A549-BRE cells were maintained in F12K medium supplemented with 10% FBS. ROS 17/2.8 cells were maintained in F-12 medium supplemented with 5% FBS, 2 mM L-glutamine, and 0.8 mM CaCl 2 . Cells were grown at 37 °C in a humidified incubator under 5% CO 2 .",
                "Plasmids-Wild type full-length BMP-7 expression plasmid, BMP-7 WT, was constructed by inserting the XmaI/BamHI fragment encoding the full-length human BMP-7 (GenBank TM accession number NM_001719) open reading frame into a proprietary mammalian expression vector. BMP-7 mutants were generated by site-directed mutagenesis of the BMP-7 WT construct, using the QuikChange protocol, under the conditions suggested by the manufacturer (Stratagene, La Jolla, CA). DNA segments encoding residues 1-40, 45-80, and 90 -120 of the mature BMP-7 domain were replaced by their corresponding regions in BMP-6 to generate three chimeras, 40-1, 80-1, and 90-1, respectively. A PCR-based method was used to generate these chimeras. Briefly, for each chimera, overlapping 5Ј and 3Ј BMP-7 DNA fragments as well as the middle BMP-6 region were amplified by PCR. DNA plasmids containing the wild type human BMP-7 and BMP-6 open reading frames were used as templates for these PCRs (DNA primers used are available upon request). For each chimera, the three PCR fragments generated in this fashion were subsequently used as a template to amplify a chimeric region spanning the entire mature domain. The assembled chimeric DNA was subsequently substituted for its corresponding BMP-7 wild type sequence, downstream of the pro-domain-encoding region, in the BMP-7 WT construct described above. Four copies of the BMP response element (BRE), as previously described by Korchynskyi and ten Dijke (28), were cloned into TA-Luc (Panomics, Fremont, CA) at the NheI site to generate the BMP reporter construct, BRE 4xR-luc. Human ALK2, ALK6 (hemagglutinin-tagged), BMPR-II, and ActR-II have been described previously (7,8).",
                "Expression of Recombinant BMPs in HEK293 T Cells-HEK293T cells were seeded in Dulbecco's modified Eagle's medium supplemented with 10% FBS. The next day cells were transfected with the appropriate expression construct, using FuGENE 6 or FuGENE HD, according to the manufacturer's recommendations. 24 h post-transfection, the culture medium was replaced with fresh Dulbecco's modified Eagle's medium supplemented with 0.5% FBS. Conditioned media were collected 48 -72 h post-transfection. Small scale expression of recombinant BMPs was carried out on 6-well plates, whereas medium/large scale expression was performed in 150-and 225cm 2 flasks.",
                "Purification of the 80-1 and BMP-7 E60K Proteins-HEK293T cells were seeded in 225-cm 2 flasks and transfected with plasmids encoding either the 80-1 (20 flasks) or the BMP-7 E60K (30 flasks) proteins. Recombinant proteins secreted in the conditioned medium (0.8 -1.2 liters) were first precipitated with ammonium phosphate (50% saturation) overnight at 4 °C. Precipitated proteins were subsequently reconstituted in 20 mM HEPES buffer containing 0.5 M NaCl and 10 mM imidazole (pH 7.2). Proteins were then loaded onto a nickel-IMAC (GE Healthcare) column. Bound proteins were eluted with 20 mM HEPES buffer, containing 0.5 M NaCl and 6 M urea (pH 7.2). The fractions containing BMP activity were pooled and further purified by HPLC. HPLC fractions were analyzed by SDS-PAGE and silver staining and by Western blot. Fractions containing the BMP of interest were pooled, lyophilized, and stored until further use.",
                "siRNA-mediated Silencing of Noggin Expression-Knockdown of noggin was performed using siRNAs from Dharmacon. Transfections were performed according to the manufacturer's instructions using Dharmafect 3 as transfection reagent.",
                "BMP Reporter Cell Line-An A549 reporting line was generated by stably transfecting A549 cells with the reporter construct, BRE 4xR-luc, which contains the firefly luciferase gene driven by four copies of BRE (see above). Clones were selected in the presence of Geneticin and tested for BMP-induced lucif-erase activity. A clone, A549-BRE, showing high signal-to-noise ratio was selected, expanded, and used for future studies.",
                "Reporter Gene Assays Using A549-BRE Cells-BMP activity and susceptibility to noggin inhibition was assessed using a reporter gene assay, in the presence or absence of noggin. In brief, A549-BRE cells (see above) were seeded onto 96-well plates in F12K medium supplemented with 1% FBS. Reporter gene expression was induced upon the addition of BMPs, in the presence or absence of noggin, in a 25-l volume. Cells were incubated at 37 °C for 24 h, and luciferase activity was measured using the Bright-Glo reagent (Promega) following the manufacturer's recommendations. Luciferase activity was subsequently normalized to total protein using a BCA assay (Fisher) following the manufacturer's protocol, and data were analyzed using the SoftMax Pro software (Molecular Devices). Alternatively, BRE-luc assays were performed as described previously (28).",
                "The effect of noggin on BMP activity was quantified by calculating either the percentage inhibition or the residual BMP activity. The percentage inhibition was determined using the following formula,",
                "where A represents the activity in the absence of noggin, and B the activity in the presence of noggin. The residual BMP activity was determined by calculating the ratio of the normalized luciferase activity (relative luciferase units/mg of total protein) measured in the presence of noggin to that in the absence of noggin.",
                "Western Blot Analysis-Protein samples were resolved on precast NuPAGE 4 -12% BisTris minigel and transferred to nitrocellulose membranes with a semidry transfer cell, Trans- BMP-4, BMP-5, BMP-6, BMP-7, GDF-5/BMP-14, and GDF-6/BMP-13) were tested for their ability to induce ALP activity in the rat osteosarcoma cell line, ROS 17/2.8. Each growth factor response was examined in a nine-point dose response in triplicates. Potency was assessed based on the EC 50 derived from the non-linear regression of the mean result. B, BMP-6 is more potent than BMP-7 in stimulating BRE-transcriptional activity and alkaline phosphatase activity. Serum-starved C2C12 cells were transfected with BRE-luc reporter and stimulated with 25 ng/ml BMP-6, 25 ng/ml BMP-7, or vehicle control, and luciferase activity was analyzed 24 h post-transfection. Right panel, serum-starved C2C12 cells were stimulated with 100 ng/ml BMP-6, 100 ng/ml BMP-7, or vehicle control, and alkaline phosphatase activity was analyzed 48 h post-transfection. C, BMP-6 is more potent than BMP-7 in ectopic bone formation. Shown is an x-ray of critical size defects of rabbit ulnae treated with a collagen sponge (Helistat) alone (control; top), with rhBMP-6 (100 g; middle), and with rhBMP-7 (100 g; bottom) in vivo for 2 and 6 weeks after surgery. Micro-CT (CT) analyses of critical size defects were performed in vivo at 8 weeks after surgery (cross-sections were horizontal and vertical). A, p Ͻ 0.05 versus C; B, p Ͻ 0.05 versus A (analysis of variance; Dunnett's test). RLU, relative luciferase units.",
                "Blot SD (Bio-Rad). Membranes were blocked in Odyssey blocking reagent (Li-Cor Biosciences) for 3 h and then incubated in primary antibody in blocking reagent overnight at room temperature. After washing in TBST, membranes were incubated in IRDye-labeled secondary antibody for 45 min, washed, and then scanned and analyzed with the Odyssey infrared imaging system (Li-Cor Biosciences). Smad phosphorylation was detected using PS1 antibody recognizing phosphorylated Smad1, phosphorylated Smad5, and phosphorylated Smad8 (29). Total Smad1 was detected using anti-Smad1 antibody (Zymed Laboratories Inc.).",
                "RNA Isolation and Quantitative Real-time PCR-Total DNA-free cellular RNA was extracted with the RNeasy kit (Macherery-Nagel). A reverse transcription-PCR was performed using the RevertAid H minus first strand cDNA synthesis kit (Fermentas) according to the manufacturer's instructions. The oligonucleotide primers for PCR were designed using Primer Express software (Applied Biosystems). The sequences of the PCR primers used in this study are available upon request. Taqman PCRs were performed using the StepOne Plus real-time PCR system (Applied Biosystems). All samples were plated in duplicate. Gene expressions were determined with the comparative ⌬Ct method using glyceraldehyde-3-phosphate dehydrogenase as reference, and the non-stimulated condition was set to 1.",
                "Alkaline Phosphatase (ALP) Assays-ROS 17/2.8 cells were seeded at 3.7 ϫ 10 4 cells/well on 96-well plates in 200 l of F-12 medium, supplemented with 0.2% bovine serum albumin, and incubated for 24 h at 37 °C under 5% CO 2 in a humidified incubator. Alkaline phosphatase activity was induced upon the addition of BMPs, in the presence or absence of noggin, in a 50-l volume. Following a 24-h incubation, 150 l of medium was removed, and cells were lysed by adding 100 l of 2% Triton X-100. The lysate was cleared by centrifugation, and 20 l (supernatant) was transferred to a clear plate. 100 l of 1:5 pNPP was added to the lysate and incubated for 10 min at 37 °C. 75 l of 0.5 N NaOH was then added to each well to stop the reaction. The plates were scanned and analyzed using a Molecular Devices plate reader. Alternatively, the ALP assay was performed as described previously (30)."
            ],
            "subsections": [
                {
                    "title": "Analysis of BMP Binding to Noggin-Fc-derivatized Sensor",
                    "paragraphs": [
                        "Surfaces by Surface Plasmon Resonance (BIAcore)-Sensor surface CM4 was selected and derivatized as follows. Anti-mouse immunoglobulins were diluted to 30 g/ml in 10 mM acetate, pH 5.0, coupling buffer. The surfaces of both control and active flow cells were activated for 7 min with a 1:1 mixture of 0.1 M N-hydroxysuccinimide and 0.4 M N-ethyl-NЈ-(3-dimethylaminopropyl) carbodiimide hydrochloride at flow rate of 10 l/min. Anti-mouse immunoglobulins were then injected for 7 min at a flow rate of 10 l/min, and this was followed by an injection of 1 M ethanolamine, pH 8.5, for 7 min at a flow rate of 10 l/min. The surface containing immobilized anti-mouse immunoglobulins was then conditioned with three 2-min injections of 10 mM glycine-HCl, pH 1.7. Kinetic measurements were performed at 25 °C in a buffer containing 50 mM HEPES, pH 7.4, 150 mM NaCl, 1 mg/ml bovine serum albumin, and FIGURE 2. BMP-7 is more potent in inducing noggin mRNA expression than BMP-6. A and B, serum-starved C2C12 cells were stimulated with BMP-6 (50 ng/ml) or BMP-7 (50 ng/ml) or vehicle control for 18 h. Total RNA was extracted, and cDNA was prepared and expression of noggin was determined using quantitative PCR with expression being normalized to glyceraldehyde-3-phosphate dehydrogenase and expressed as -fold change relative to control. Non-stimulated controls are indicated with gray bars for BMP-6 and hatched bars for BMP-7. C, BMP-6-induced Smad1 phosphorylation is more sustained than BMP-7-induced Smad1 phosphorylation. Serum-starved C2C12 cells were stimulated with BMP-6 (50 ng/ml) or BMP-7 (50 ng/ml) for the indicated times, and cell lysates were analyzed by immunoblotting with phospho-Smad1/5 and total Smad1 antibodies. Upon noggin knockdown, BMP-7-induced responses are comparable with BMP-6-induced levels of Smad1 phosphorylation (D), BRE-luc activity (E), and ALP activity (F). C2C12 cells transfected with control siRNA or noggin siRNA were stimulated with BMP-6, BMP-7, or vehicle control. For Western blotting, cell lysates were analyzed by immunoblotting with phosphorylated Smad1/5 or total Smad1 antibody (E). For BRE-luc response, C2C12 cells were transfected with BRE-luc and analyzed for luciferase activity (E). For ALP activity, cell extracts were analyzed (F). Non-stimulated controls are indicated with gray bars for BMP-6 and hatched bars for BMP-7. RLU, relative luciferase units."
                    ],
                    "subsections": [
                        {
                            "title": "TABLE 1 In vivo x-ray and ex vivo micro-CT analysis of critical size defects of rabbit ulna treated with bovine collagen alone (control), bovine collagen plus rhBMP-6 (BMP-6), and bovine collagen plus rhBMP-7 (BMP-7)",
                            "paragraphs": [
                                "At 2 weeks, representative x-rays of both BMP doses of 100 and 500 g are shown.",
                                "Healing efficacy was analyzed by radiographic grading scores (0 -6) and bone volume/tissue volume values were determined by micro-CT. Results are presented as mean Ϯ S.D. 0.05% surfactant P20. Each sample cycle consisted of the following steps. Noggin-Fc was injected at 0.5 g/ml for 45 s at 10 l/min over the active flow cell, which was followed by a 30-s stabilization phase. The BMP sample was then injected at the indicated concentration, at 75 l/min for 180 s (over both the active and control flow cells), followed by a 300-s undisturbed dissociation phase. For at least one concentration of each sample, the dissociation phase was extended to 1200 s to ensure accurate measurement of slow dissociation constants. Iodination of BMP Ligands and Affinity Labeling of BMP Receptors-Iodination of BMP-6 or BMP-7 was performed according to the choramine T method, and subsequently trans-fected COS cells were affinity-labeled with the radioactive ligand as described previously (8). In brief, cells were incubated on ice for 3 h with the radioactive ligand in the absence or presence of noggin. After incubation, cells were washed, and cross-linking was performed with 54 mM disuccinimidyl suberate and 3 mM bis(sulfosuccimidyl suberate (Pierce) for 15 min. Cells were washed, scraped, and lysed. Lysates were incubated with the respective antisera overnight, and immune complexes were precipitated by adding Protein A-Sepharose (Amersham Biosciences). Samples were washed, boiled in SDS sample buffer, and subjected to SDS-PAGE. Gels were dried and scanned with the STORM imaging system. FIGURE 3. BMP-6 induction of downstream genes in primary human bone marrow-derived mesenchymal stem cells (hMSCs) is less susceptible to noggin inhibition than BMP-7. A, in order to compare BMP susceptibility to noggin inhibition, BMP-6, BMP-7, BMP-2, and BMP-4 were tested by an ALP assay in the ROS cells, in the presence of increasing concentrations of noggin. Each condition was tested in triplicates, and noggin dose-response curves were derived by fitting the data to a non-linear regression. The IC 50 for noggin corresponding to each BMP was then calculated. These results indicate that the four BMPs tested are affected differently by noggin. BMP-4 is the most susceptible, followed by BMP-2, BMP-7, and then BMP-6. Although BMP-4, BMP-2, and BMP-7 are clearly sensitive to noggin inhibition, BMP-6 demonstrated marked resistance to noggin inhibition, with an IC 50 value 4 -16 times higher than that of other BMPs tested. B, BMP-6, but not BMP-7, is resistant to noggin-mediated inhibition. C2C12 cells transfected with BRE-luc reporter were challenged with BMP-6 or BMP-7 in the absence or presence of the indicated amounts of noggin and analyzed for luciferase activity. C, human mesenchymal stem cells were stimulated with BMP-6 or BMP-7, and effects on target genes, including Id-1, Dlx-5, Msx-2, and noggin, were measured by quantitative PCR. Induction of these target genes by BMP-7 was significantly inhibited by noggin in all cases. In particular, noggin inhibits its own induction by BMP-7 to a greater degree than other genes. In contrast, noggin did not affect induction of Id-1, Dlx-5, and noggin transcription induced by BMP-6. Noggin only marginally decreased the induction of Msx-2 by BMP-6. RLU, relative luciferase units."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Therapy",
                            "paragraphs": [
                                "Critical Size Defect of Rabbit Ulna-An ulnar critical size defect model was used to evaluate the efficacy of BMP-6 and BMP-7 in a model of bone healing of adult male New Zealand White rabbits (3-4 kg weight) as described previously (24). BMP-6 and BMP-7 (100 and 500 g) were added on to the bovine collagen hemostatic sponge (Helistat) and left at room temperature for 2 h. Animals were divided into five groups: (a) control, defect filled with Helistat only (n ϭ 10); (b) defect filled with Helistat and BMP-6 (100 g; n ϭ 11); (c) defect filled with Helistat and BMP-6 (500 g; n ϭ 9); (d) defect filled with Helistat and BMP-7 (100 g; n ϭ 10); (e) defect filled with Helistat and BMP-7 (500 g; n ϭ 8). X-rays were taken biweekly and scored as described (32). The protocol was approved by the institutional Ethics and Animal Committee.",
                                "Micro-CT-The microcomputerized tomography apparatus (CT 40) and the analyzing software used in these experiments were obtained from SCANCO Medical AG (Bassersdorf, Swit-zerland). The bone was scanned in the dorsoventral direction as described (33).",
                                "Statistical Analysis-Values are expressed as mean Ϯ S.E. For statistical comparison of two samples, a two-tailed Student's t test was used. p Ͻ 0.05 was considered significant. Oneway analysis of variance (Dunnet's test) was performed to determine the effect of BMP-6 on in vivo regeneration of bone defects by micro-CT."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Comparative Analysis of the Osteogenic Activity of a BMP Panel Revealed a Significant Difference in Activity between BMP-6 and BMP-7-To compare the potency of different",
                    "paragraphs": [
                        "BMPs to promote osteoblast differentiation, we tested a panel of BMPs for their ability to induce an early marker of osteoblast differentiation, ALP activity, in the rat osteosarcoma cell line, ROS 17/2.8 (Fig. 1A). Among the growth factors tested, BMP-6 showed the highest potency (EC 50 ϭ 14 ng/ml), followed by, in FIGURE 4. Affinity measurements of noggin for BMPs using surface plasmon resonance. The affinity of recombinant noggin to BMPs was determined using surface plasmon resonance (BIAcore). Noggin-Fc was immobilized onto the sensor surface as described under \"Experimental Procedures.\" Free BMP-2, BMP-4, BMP-6, or BMP-7 was then applied at the indicated concentrations, at 75l/min for 180 seconds followed by a 300-second dissociation phase. Blank buffer was used as a negative control. The dissociation constant K d and the association constant K a for each BMP were determined. The affinity to noggin-FC (K D ) for each BMP was then calculated (listed in the table). RU, response units.",
                        "descending order, BMP-7, BMP-4, BMP-2, and BMP-5. GDF-5 (growth and differentiation factor-5) and GDF-6/BMP-13 showed only marginal activity in this assay. Interestingly, the dose-response curves for BMP-2 and BMP-4 had shallower slopes compared with those for BMP-5, BMP-6, and BMP-7, suggesting a potentially more pronounced negative regulatory mechanism for BMP-2 and BMP-4. The difference in potency observed between the highly related BMP-6 and BMP-7 (73% amino acid identity) triggered our interest initially. We confirmed this difference in C2C12 myoblasts using both alkaline phosphatase activity and BRE-driven luciferase reporter gene expression as readouts (Fig. 1B). This difference in potency was also confirmed in BMP-treated C3H10T1/2 mesenchymal osteoprogenitor cells (data not shown). Importantly, using a critical size defect model of rabbit ulna, we showed that implantation of 100 g of BMP-6, on a bovine collagen sponge, induced faster and more robust bone regeneration as compared with a similar dose of BMP-7 (Fig. 1C). Two weeks following implantation of BMP-6, partial defect bridging with material of non-uniform radiodensity was apparent (Fig. 1C). At the same time point, only flocculent radiodensity with flecks of calcification and no defect bridging was observed in rabbits treated with the 100-g dose of BMP-7. Bone formation, comparable with that induced with BMP-6 (100 g), was found in animals treated with a 5-fold higher dose (500 g) of BMP-7 (Table 1). At 6 weeks postsurgery, BMP-6 induced significantly more bone repair as compared with BMP-7, and by 8 weeks, micro-CT analyses revealed that almost 2 times more bone was formed with BMP-6 as compared with the same amount of BMP-7 (Fig. 1C and Table 1).",
                        "BMP-6 and BMP-7 Induce Noggin Expression with Different Potencies-We next set out to determine the mechanism underlying the differential in vitro and in vivo potency between BMP-6 and BMP-7. Noggin, a natural extracellular BMP inhibitor, has been shown to be induced by BMPs and to antagonize their activity by direct binding and interfering with BMP-BMP receptor interaction (11). To investigate a potential difference in noggin negative feedback regulation of BMP-6 and BMP-7, we initially examined the effect of both BMPs on noggin expression. In C2C12 cells, BMP-7 induced noggin mRNA (Fig. 2A) and protein (Fig. 2B) expression more potently than BMP-6. As a result, we found a more sustained Smad1 phosphorylation in BMP-6-treated C2C12 cells (Fig. 2C) and MC3T3 preosteoblasts (data not shown) compared with BMP-7. Upon siRNA-mediated noggin knockdown, BMP-7-induced Smad1 phosphorylation became more sustained and mimicked the BMP-6-induced response that was also slightly elevated under these conditions (Fig. 2D). Consistent with this result, noggin knockdown also increased BMP-7 effects on downstream effectors, such as BREluciferase reporter gene expression and ALP activity, to BMP-6 levels (Fig. 2, E andF). Taken together, these results indicate that the differential induction of noggin expression by BMPs is a key component of the negative feedback loop regulation of their biological activities.",
                        "BMP-6 Is More Resistant to Noggin Inhibition than BMP-7-In order to compare the susceptibility of BMP-6 and BMP-7 to inhibition by exogenous noggin, both BMPs were tested, along with BMP-2 and BMP-4, for their ability to promote ALP activ-ity in ROS 17/2.8 cells in the presence of increasing concentrations of noggin. Of the BMPs tested, BMP-4 was the most sensitive to noggin inhibition, followed by BMP-2 and then BMP-7 (Fig. 3A). BMP-6 demonstrated the highest resistance (IC 50 Ͼ 5,000 ng/ml) to noggin inhibition (Fig. 3A), even compared with its closest homolog BMP-7 (IC 50 ϭ 800 ng/ml). This differential sensitivity was confirmed using a BRE reporter gene assay in C2C12 cells (Fig. 3B) and A549-BRE cells (data not shown). Similarly, in primary bone marrow-derived human mesenchymal stem cells, QPCR analysis showed that BMP-6 induction of the osteoblast marker genes Id-1, Dlx-5, and Msx-2, in addition to noggin, was less susceptible to noggin inhibition compared with BMP-7 (Fig. 3C). Therefore, the relative BMP-6 resistance to noggin inhibition is not restricted to a particular cell or assay system but is rather an intrinsic characteristic of BMP-6.",
                        "BMP-6 and BMP-7 have Binding Characteristics Comparable with Those of Immobilized Fc-Noggin Using a Biosensor Assay-One possible explanation for the lower susceptibility to noggin inhibition is that affinity of noggin for BMP-6 is significantly lower than for BMP-7. To test this hypothesis, we profiled the affinity of recombinant noggin on a panel of BMPs, using surface plasmon resonance (BIAcore). Recombinant Fc-noggin protein was immobilized on the Biacore chip surface, and free BMP-2, -4, -6, or -7 was added at various concentrations. BMP binding to Fc-noggin was observed for all four BMPs and was dose-dependent. Noggin bound with the highest affinity to BMP-4 (Fig. 4). Surprisingly, in this experimental paradigm, BMP-6 apparent affinity to noggin (K D ϭ 1.3 ϫ 10 Ϫ11 M) was higher than that of BMP-7 (K D ϭ 1.8 ϫ 10 Ϫ10 M) (Fig. 4). This paradoxical result was in conflict with the functional data presented in Fig. 3. Interestingly, close analysis of the biosensor data showed that this apparent higher affinity for BMP-6 is driven mainly by its apparent low dissociation rate (K d of 6 ϫ 10 Ϫ5 s Ϫ1 for BMP-6 compared with 1 ϫ 10 Ϫ3 s Ϫ1 for BMP-7). In fact, the dissociation rate observed for all ligands in this experiment was unusually low. In contrast, the on-rate for BMP-6 was slightly lower than that of BMP-7 (K a of 4.7 ϫ 10 6 FIGURE 5. Noggin inhibits BMP-7 but not BMP-6 binding to BMP receptors. The indicated BMP receptors were transfected into COS cells and affinity-labeled by cross-linking with radiolabeled BMP-6 or BMP-7 in the absence or presence of noggin. Affinity-labeled BMP-BMP receptors were immunoprecipitated (IP) from cell extracts with ALK2-or ALK6-specific antibodies. Samples were washed, boiled in SDS sample buffer, and subjected to SDS-PAGE. Gels were dried and scanned with the STORM imaging system (Amersham Biosciences). BMPR-II, BMPR-II-BMP cross-linked complex; ALK2 and ALK6, ALK2-BMP and ALK6-BMP cross-linked complexes, respectively.",
                        "1/Ms for BMP-6 compared with 5.6 ϫ 10 6 1/Ms for BMP-7). Moreover, at comparable concentrations, more BMP-7 was bound to Fc-noggin compared with BMP-6, as judged by the response units measured by the instrument (Fig. 4). These results suggest that the binding characteristics of BMP-6 and BMP-7 to immobilized Fc-noggin fusion protein are significantly different.",
                        "Noggin Inhibition of BMP Binding to Cell Surface BMP Receptors Is More Pronounced in the Case of BMP-6 Compared with BMP-7-In order to further validate the functional data presented in Fig. 3 and to investigate noggin interactions with BMP-6 and BMP-7 using an alternative method to Biacore, we measured the effect of noggin on the binding of BMP-6 or BMP-7 to cell surface BMP type I and type II receptors. To accomplish this, we overexpressed BMPR-II on the surface of COS cells, in conjunction with either BMP type I receptor FIGURE 6. Identification of region in BMP-6 that is responsible for increased resistance to noggin inhibition. A, alignment of BMP-6 and BMP-7 mature domains. Shared amino acid residues are shaded. B, schematic representation of BMP-6 (shaded), BMP-7 (black), and BMP-6/7 chimeras. C, the chimera 80-1 is as resistant to noggin inhibition as BMP-6. D, the sensitivity of purified recombinant 80-1 chimera to noggin inhibition is comparable with that of BMP-6. 80-1 chimera was purified from the conditioned medium of transfected HEK 293 cells, and BMP-7 and BMP-6 were purified from stable Chinese hamster ovary expressing cell lines. A549-BRE cells were challenged with either BMP-6, BMP-7, or 80-1 proteins in the presence of increasing concentrations of noggin. Luciferase activity was measured 24 h post-BMP treatment, and the percentage inhibition was calculated for each noggin concentration. expressed by transient transfection in HEK293T cells and secreted in the conditioned medium (supplemental Fig. 1B). The susceptibility of each of these BMP-7 mutants to noggin inhibition was tested as described above for the revertant proteins. Of the BMP-7 mutants tested, E60K was significantly more resistant to noggin compared with wild type, whereas Y65N had a marginal effect (Fig. 7C; only data for the highest noggin concentration is shown). A triple mutant BMP-7 protein, R48Q/E60K/Y65N, was also generated and was not significantly more resistant to noggin when compared with E60K (Fig. 7C). These results further support the finding that Lys 60 plays a major role in mediating noggin resistance in BMP-6."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mutation of BMP-2 at a Position",
                    "paragraphs": [
                        "Analogous to BMP-7 Glu 60 Yields a BMP-2 Variant with Increased Resistance to Noggin-Sequence alignment of BMP-2, 4, 5, 6, 7, and 9 revealed that only BMP-6 and BMP-9 have a lysine residue at the position corresponding to BMP-6 Lys 60 (Fig. 8A). Interestingly, side by side comparison of the sensitivity of purified recombinant BMP-2, BMP-6, BMP-7, BMP-9, and BMP-7 E60K proteins to noggin (Fig. 8B) revealed that BMP-9 is also highly resistant to noggin inhibition. This finding is in agreement with the recent finding by Rosen (33). Moreover, these data confirm the increased resistance of BMP-7 E60K protein to noggin inhibition because a purified form of this protein was used rather the conditioned medium from transfected cells. BMP amino acid sequence alignment also showed that a proline residue is found at the corresponding Lys 60 position in BMP-2 and BMP-4 (Fig. 8A). This prompted us to test if a proline to lysine mutation at this position in BMP-2 (BMP-2 P36K) could yield a BMP-2 variant with increased noggin resistance. Such a mutant BMP-2 was generated and tested for noggin resistance. As expected, this BMP-2 variant demonstrated a significant increase in noggin resistance compared with its wild type counterpart, although the magnitude of effect was less pronounced than in the case of BMP-7 (Fig. 8C). Taken together, these data suggest that the function of BMP-6 lysine 60 in mediating noggin resistance can be transferred to other BMPs, making them more resistant to this BMP antagonist."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "Recombinant human BMP-2 and BMP-7 proteins have been used clinically for many years to induce new bone formation in spinal fusion (34) and long bone non-union fractures (26,35). Despite their safety and clinical efficacy, these proteins still have significant shortcomings (36). The most intriguing of these are the relatively high doses of BMPs needed to achieve clinical success. We postulated that the strong negative feedback loop mechanisms built into the biology of these growth factors play a major role in attenuating their function following surgical implantation. The inset shows an enlarged view of the location of Glu 60 , Arg 48 , and Gln 48 amino acid residues. B, BMP-7 structure when bound to noggin (green) or in the free state (purple). The inset shows an enlarged view of the location of Glu 60 and Arg 48 amino acid residues. C, BMP-7noggin complex. BMP-7 is displayed as a green secondary structure schematic diagram, and noggin is shown as a molecular surface (white, carbon; red, oxygen; blue, nitrogen; yellow, sulfur). The inset shows an enlarged view of the location of Glu 60 and Arg 48 amino acid residues (stick display). D, BMP-7-ActRII complex. BMP-7 is displayed as a green secondary structure schematic diagram, and ActRII is shown as a molecular surface (white, carbon; red, oxygen; blue, nitrogen; yellow, sulfur). The inset shows an enlarged view of the locations of Glu 60 and Arg 48 residues (stick display).",
                "Here we show that although BMP-6 and BMP-7 are highly similar, BMP-6 is more potent in inducing osteoblast differentiation in vitro and bone formation in vivo. We postulate that a key underlying mechanism for this differential response could be that noggin is more effective as a negative regulator for BMP-7 than for BMP-6. Although BMP-7 induces noggin expression more potently than BMP-6, BMP-6 is more resistant to noggin inhibition than BMP-7. Moreover, siRNA-mediated depletion of noggin sustains BMP-7-induced Smad phosphorylation and cellular differentiation responses at levels similar to BMP-6.",
                "Importantly, we identified a single amino acid in BMP-6 that modulates its susceptibility to noggin inhibition. We show a strong correlation between BMP resistance to noggin inhibition and the presence of a lysine residue at position 60 of the mature domain (BMP-6 numbering). Amino acid sequence alignment of mature BMP-2, -4, -5, -6, -7, -8, -9, -10, -11, and -15 reveals that, in addition to BMP-6 and BMP-9, BMP-11 also has a lysine at this position (data not shown). Our data suggest that it is possible to engineer BMP variants with increased noggin resistance by substituting a lysine for the corresponding residue at position 60. This feature, if combined with others that enhance BMP specificity, stability, and safety, could allow the development of more effective recombinant BMPs in the future.",
                "The crystal structures of BMP-7 (37) and BMP-6 (31, 38) mature domains have both been solved. Despite their remarkable similarities, the overlay of these two structures reveals significant differences at the tips of finger 1 and finger 2 (Fig. 9A). Fingers 1 and 2 mediate BMP binding to both type I and type II BMP receptors. In the case of BMP-7, fingers 1 and 2 are more extended. Moreover, in BMP-6, Lys 60 and Asn 65 form intramolecular hydrogen bonds between fingers 1 and 2, thus increasing the overall rigidity of the molecule. These interactions are missing in BMP-7, making it more flexible than BMP-6. Interestingly, BMP-7 Glu 60 resides at the tip of finger 1. This region undergoes significant conformational change upon binding to noggin (Fig. 9B). In the noggin-bound conformation, Glu 60 forms an intramolecular salt bridge with Arg 48 and interacts with noggin Phe 54 (Fig. 9C). BMP-7 Glu 60 and Arg 48 also engage in direct interactions with type II BMP receptors (Fig. 9D). This interaction is preserved in BMP-6 despite the presence of lysine at position 60. Our functional cell-based studies clearly demonstrate that BMP-6 binding to cell surface receptors is less susceptible to noggin compared with BMP-7. One possible explanation for this difference is that BMP receptors might displace BMP-6 from noggin more efficiently than in the case of the BMP-7-noggin complex. This is supported by the observation that BMP-6 is more rigid than BMP-7 and thus may not undergo as much of a conformational change when bound to noggin, making the complex more unstable in the presence of cell surface receptors. Solving the BMP-6-noggin and BMP-6-BMP receptor ternary complex crystal structures could provide additional insight into the differential mechanisms of BMP-7 and BMP-6 inhibition by noggin.",
                "In conclusion, a key determinant for the increased potency of BMP-6 compared with BMP-7 is the lower sensitivity of BMP-6 to noggin-mediated inhibition. Identification of Lys 60 in BMP-6 that confers noggin resistance allowed us to generate BMPs with superior agonistic activity that hold promise for future clinical benefit."
            ],
            "subsections": [
                {
                    "title": "* This work was supported in part by Netherlands Organization for Scientific",
                    "paragraphs": [
                        "Research Grant 918.66.606, Innovation-oriented Research Program Genomics Grant IGE07001, and a grant from the Center for Biomedical Genetics (to P. D.). This work was also supported by a grant from the Croatian Ministry of Science, Education, and Sports (to S. V.). □ S The on-line version of this article (available at http://www.jbc.org) contains supplemental Figs. 1 and 2."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}