{
    "id": "https://semopenalex.org/work/W4226049669",
    "authors": [
        "Stefano Leonardi",
        "Shervin Bagheri",
        "Johan Sundin",
        "Marcus Hultmark",
        "Umberto Ciri"
    ],
    "title": "Heat transfer increase by convection in liquid-infused surfaces for laminar and turbulent flows",
    "date": "2022-04-26",
    "abstract": "Liquid-infused surfaces (LIS) can reduce friction drag in both laminar and turbulent flows. However, the heat transfer properties of such multi-phase surfaces have still not been investigated to a large extent. We use numerical simulations to study conjugate heat transfer of liquid-filled grooves. It is shown that heat transfer can increase for both laminar and turbulent liquid flows due to recirculation in the surface texture. For the increase to be substantial, the thermal conductivity of the solid must be similar to the thermal conductivity of the fluids, and the recirculation in the grooves must be sufficiently strong (P'eclet number larger than 1). The ratio of the surface cavity to the system height is an upper limit of the direct contribution from the recirculation. While this ratio can be significant for laminar flows in microchannels, it is limited for turbulent flows, where the system scale (e.g. channel height) usually is much larger than the texture height. However, heat transfer enhancement on the order of $10%$ is observed (with a net drag reduction) in a turbulent channel flow at a friction Reynolds number $Re_tau approx 180$. It is shown that the turbulent convection in the bulk can be enhanced indirectly from the recirculation in the grooves.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "The simultaneous increase of heat transfer and reduction of drag in laminar and turbulent fluid flows has turned out to be a considerable challenge. Such technology could lower the power input required for driving the flow in heat exchangers, microprocessors and other thermal systems. A common technique to increase heat transfer in applications is to use rough or modified walls (figure 1a). While roughness, grooves, blades, ridges and corrugations increase the surface heat flux, they also increase the momentum transport, resulting in increased drag (Rohsenow et al. 1998). Enhancement of heat transfer in pipes, channels and ducts can also be achieved by miniaturisation since this increases the surface-to-volume ratio. Effectively, more liquid is then in contact with the surface for a given volume flow rate. However, reduced dimensions also lead to increased wall friction so that the required pressure drop (and pumping power) increases.",
                "Both heat transfer increase and drag reduction can be achieved with complex surfaces having multiple degrees of freedom to tune the surface-flow interaction. One example is a liquid-infused surface (LIS). The infusing liquid creates dynamic interfaces that induce a slipping effect on the external flow while affecting wall-normal velocity fluctuations (figure 1b). The careful design of texture topology, liquid viscosity, thermal conductivity and surface tension enables the precise tuning of transport processes.",
                "In previous studies, superhydrophobic surfaces (SHS) have been used to reduce friction while maintaining the benefits of reduced system size (see the review by Gong et al. 2021). Similar effects could be accomplished with a LIS. An analytical model of heat transfer in pipes with SHS or LIS, taking the reduced friction into account, was recently developed by Hatte & Pitchumani (2021). Indeed, reducing the pipe radius increased the advantage of using SHS and LIS. Ciri & Leonardi (2021) designed LIS and SHS that increased heat transfer and decreased drag in direct numerical simulations of a turbulent channel flow. Out of the many investigated surface configurations, this occurred only for SHS with longitudinal grooves, dynamic interfaces and a gas-liquid thermal conductivity ratio of one. The solid structures were also assumed to have a constant temperature. A thermal conductivity ratio of one and isothermal textures are hard to realise in practice, however.",
                "If the thermal conductivity of the solid texture is similar to a contiguous liquid, the heat flux in neither phase is trivial. These solid-liquid combinations are not rare in applications. For example, water has a higher thermal conductivity than polymer polydimethylsiloxane. LIS made from such materials can be expected to have a very different heat flux compared with LIS with isothermal surface textures. For metal solids, liquid metals may be used as infusing liquids. There has recently been an increased interest in using liquid gallium alloys with low toxicity in stretchable electronics (Dickey 2017). The thermal conductivity of gallium is comparable to that of steel. An overview of some properties of representative solids and liquids is given in table 1.",
                "Using liquid and solid properties similar to those of existing materials, we have investigated whether convection in the texture of LIS with transverse grooves can increase the surface heat flux, considering both laminar and turbulent flows. This mode of heat transfer has either been neglected or has not been evaluated closer in earlier works. The study was performed by numerically solving the equations for the velocity and 941 A9-2  temperature fields. We considered the heat transfer between two external boundaries of different temperature. The heat transport mechanisms of this set-up are shown in figure 2(a). The remainder of the article has the following structure. Governing equations and definitions of relevant quantities are presented in § 2. In § 3, it is shown that the contribution from the convection in the texture to the total heat flux is necessary to consider when the thermal conductivity of the solid structures is similar to the infusing liquid. Setting the solid and liquid thermal conductivities to the same value, the relation between the surface convection, liquid, flow and geometric properties is described in § 4. Results from turbulent flow simulations are presented in § 5. Conclusions are given in § 6."
            ],
            "subsections": []
        },
        {
            "title": "Governing equations",
            "paragraphs": [
                "We consider the momentum, continuity and energy equations for an incompressible system where ρ is the density, t is the time, u is the fluid velocity, P is the pressure, μ is the fluid viscosity, c p is the specific heat capacity, T is the temperature and κ is the thermal conductivity. The streamwise coordinate is x, the wall-normal y, with y = 0 at the surface, and the spanwise z. Equations (2.1) and (2.2) are valid in the domains occupied by the external fluid and the infusing (internal) liquid. In the region occupied by the solid, only (2.3) is valid and u = 0. The differences between the fluid properties can be expressed through the viscosity ratio μ i /μ ∞ , the density ratio ρ i /ρ ∞ , the specific heat capacity ratio c p,i /c p,∞ and the thermal conductivity ratio κ i /κ ∞ , where the subscripts i and ∞ refer to the infusing and external fluids, respectively. For example, Rosenberg et al. (2016) and Van Buren & Smits (2017) used a heptane-water system (among others) with μ i /μ ∞ = 0.43, κ i /κ ∞ = 0.21 and c p,i /c p,∞ = 0.53 (see also table 1). For simplicity and clarity, we have assumed that densities and specific heat capacities in fluids and solid, and thermal conductivities in the fluids, are equal, i.e.",
                "where a subscript s denotes solid properties.",
                "The velocity satisfies the no-slip and impermeability conditions at solid boundaries. Across liquid-liquid interfaces, the velocity and the shear stress are continuous (disregarding surface tension gradients, see Sundin & Bagheri 2022). We have neglected interface deformation, which is equivalent to imposing an infinite surface tension. Consequently, the wall-normal velocity component v is zero at interfaces. The temperature and the (instantaneous and local) heat flux are continuous at solid boundaries and interfaces. Also, the temperature is a passive scalar, i.e. the momentum equation is independent of the energy equation.",
                "The surface-averaged heat flux, q, can be decomposed into different contributions using the Fukagata, Iwamoto and Kasagi (FIK) identity of the energy equation (Fukagata, Iwamoto & Kasagi 2005). In this decomposition, we consider a channel of height h and grooves of depth k with a solid slab of the same thickness beneath (figure 2b). The solid slab allows for temperature variations below the grooves in the simulations. The derivation is outlined in Appendix A. The second term of (2.3) gives rise to two convection terms, and the third term gives rise to three conduction terms. In total, the expression for q is",
                "where χ s is an indicator function equal to 1 in the solid and 0 elsewhere. The operator denotes the average in time and the streamwise and spanwise directions. We have separated the convective flux vT into a dispersive and a random component, ṽ T and v T , respectively (Appendix B). Dispersive fluctuations ( ṽ and T) are time-averaged deviations from the mean due to the spatially varying surface properties, and random fluctuations (v and T ) are the remaining (turbulent) fluctuations.",
                "The first three terms on the last line of (2.5) describe conduction in the external liquid, the solid and the infusing liquid, respectively. The following two terms correspond to convection from random fluctuations and dispersive fluctuations in the vicinity of the surface, respectively. Each of these terms has its counterpart before the equality sign in the same order. They also correspond to the heat transport mechanisms represented in figure 2(a). It is mainly the recirculation in the grooves that gives rise to ṽ T , which results in q conv,d . At every wall-normal location, q needs to be the same since there is no heat source inside the fluids or the solid.",
                "The steady laminar flow problem was solved in an interface unit cell, illustrated in figure 2(b). These simulations were performed using the finite element solver FreeFem++ (Hecht 2012;Lācis et al. 2020). The height of the channel was h = 2k so that the total domain height was 4k. At the upper boundary, we imposed a constant shear stress τ ∞ and no normal stress. In the streamwise direction, periodic boundary conditions were imposed. We applied constant temperatures T u and T l at the upper and the lower boundaries, respectively. More details about the simulation set-up can be found in Appendix C. Details about the turbulent simulations are given in § 5. A Reynolds number and a Péclet number based on the external flow quantities were defined as Re ∞ = ρU ∞ h/μ ∞ and Pe ∞ = ρc p U ∞ h/κ ∞ , respectively, where U ∞ is the resulting (mean) streamwise velocity at the top boundary. The corresponding Prandtl number is"
            ],
            "subsections": []
        },
        {
            "title": "Heat flux for varying solid conductivity",
            "paragraphs": [
                "In laminar flow, there are no random fluctuations that transport heat. It follows that in the decomposition of the heat flux, q conv,r = 0. Equation (2.5) reduces to q = q cond,∞ + q cond,s + q cond,i + q conv,d .",
                "(3.1)",
                "We will use the smooth-wall heat flux as a reference for the LIS simulations. If the surface of the laminar flow is smooth, two additional simplifications can be made. Since there is no spatially varying texture, the dispersive convection is zero. Neither is there infusing liquid conducting heat. The heat flux only depends on the conduction in the solid and the external fluid and can be evaluated to (Appendix A.1)",
                "Notice that q 0 also depends on κ s , meaning that the reference heat flux changes with κ s .",
                "In figure 3(a), q/q 0 is shown for varying solid conductivity ratios, κ s /κ i . The applied shear stress corresponds to Re ∞ = 100 (neglecting the slight increase in U ∞ due to the finite slip velocity). We consider three values of the Prandtl number, Pr ∞ = 1, 10 and 100, and three viscosity ratios, μ i /μ ∞ = 0.1, 1 and 10. For comparison, if the external fluid is water, Pr ∞ = 7, and the range of viscosity ratios covers all liquids of table 1. The pitch (groove centre-to-centre distance) was p = 2k, and the groove width w = k.",
                "When κ s /κ i = 1, there is an increase in q/q 0 from unity because of convection. For smaller κ s /κ i -when the solid is a poor heat conductor compared with the infusing liquid -the average thermal conductivity of the composite surface is higher than for the solid alone, resulting in an even more pronounced increase in q/q 0 . However, when κ s /κ i is increased above unity, there is eventually a decrease in the surface heat flux. At approximately κ s /κ i = 3, the simulations result in q/q 0 < 1, except for the highest Pr ∞ and the smallest viscosity ratio. It is thus necessary that κ s κ i to have an increase in the heat flux.",
                "The different terms of (3.1) are illustrated in figure 3(b) for Pr ∞ = 10, μ i /μ ∞ = 1, and κ s /κ i = 0.5, 1 and 2. In the case of the poor solid conductor (κ s /κ i = 0.5), q/q 0 would be greater than unity even without convection, because of the heat conduction in the infusing 941 A9-5 ",
                "The change in q/q 0 because of varying κ s for three different viscosity ratios and Pr ∞ = 1, 10 and 100 at Re ∞ = 100. Each marker represents a simulation result, and the lines connect markers corresponding to the same μ i /μ ∞ and Pr ∞ . The ratio q/q 0 increases with increasing Pr ∞ for a fixed κ s /κ i and μ i /μ ∞ , indicated by the arrow. The curves for Pr ∞ = 1 are almost on top of each other. The dashed line shows q/q 0 = 1. (b) The different contributions to q for κ s /κ i = 0.5, 1, and 2 at Re ∞ = 100, μ i /μ ∞ = 1 and Pr ∞ = 10. In and around the groove, there is a distortion of the temperature field due to convection. The convection increases heat transfer in all three cases. However, in (a), the higher thermal conductivity in the infusing liquid also increases q/q 0 . In (c), the solid has a higher thermal conductivity, reducing the benefit of the groove. The heat fluxes in and out of the groove are illustrated with arrows in (b).",
                "The attached numbers are the heat fluxes normalised by q.",
                "liquid (q cond,i ). For a good solid conductor (κ s /κ i = 2), the convection (q cond,d ) cannot compensate for the cutout of the solid that is the groove. However, for κ s /κ i = 1, it is the convection that increases q/q 0 above unity. Contour plots of the temperature fields of these three cases are shown in figure 4, together with streamlines. Heat transfer increase by convection from penetrating the texture (Jiménez 2004); this behaviour is enforced by the interface and therefore also holds for larger values of w/k. The contour levels of the temperature field have less spacing in the region of higher conductivity. They are also distorted in and around the grooves due to convection. The convection increases the temperature on the left side of the cavity and decreases it on the right side. We computed the heat fluxes through the different groove walls and the interface for the simulation in figure 4(b). These fluxes are also illustrated with arrows in the figure. Heat is transferred into (out of) the groove through the bottom wall (interface) and the right (left) wall. Through the interface, the heat flux was q I /q = 1.071, i.e. slightly more than the average heat flux of the surface. The heat fluxes through the left, right and bottom walls were q L /q = 0.160, q R /q = 0.209 and q B /q = 1.021, respectively (imbalance |q err |/q = 1.6 × 10 -3 ). The increase of heat flux through the bottom wall, q B > q, and sides, q R , q L > 0 is due to the convection of the cavity vortex. This convection is quantified by q conv,d and provides a net positive contribution to the total heat transfer of the surface (figure 3b)."
            ],
            "subsections": []
        },
        {
            "title": "Properties of the dispersive convection",
            "paragraphs": [
                "In the previous section, it was illustrated how the heat flux depends on κ s /κ i . We now focus on the dependency on the fluid and flow properties expressed through Pr ∞ and Re ∞ . Since q conv,d is responsible for q/q 0 increasing above unity when the thermal conductivities are similar, the discussion is limited to κ s /κ i = 1. The heat then diffuses at the same rate in the solid as in the liquid, and the sum of the conduction terms can be simplified (Appendix A.2), leading to",
                "The sum of the conduction terms is denoted by q cond and corresponds to q 0 (3.2).",
                "The relative contribution from convection to the total heat flux, q conv,d /q, is shown in figure 5(a) as a function of Re ∞ . These results were obtained for μ i /μ ∞ = 1 and Pr ∞ = 0.1, 1, 10 and 100, each curve corresponding to a specific Prandtl number. For a constant Re ∞ , q conv,d /q increases with Pr ∞ , as is indicated in figure 3(a). If q conv,d /q instead is expressed as a function of Pe ∞ = Re ∞ Pr ∞ , the curves collapse, as shown in figure 5(b). In this figure, we also include the results for μ i /μ ∞ = 0.1 and μ i /μ ∞ = 10, however. For a specific Pe ∞ , there is a dependency of q conv,d /q on the viscosity ratio. Even if Re ∞ is constant, the magnitude of the flow inside the groove changes with viscosity ratio, and thereby the dispersive convection. Therefore, we need to define Reynolds and Péclet numbers that better characterise the flow at the surface."
            ],
            "subsections": [
                {
                    "title": "Surface Reynolds and Péclet numbers",
                    "paragraphs": [
                        "A representative velocity of the flow in the grooves is the mean velocity at the interface. If it is averaged over the whole surface, it equals the slip velocity U s , which is u at y = 0, where u is the streamwise velocity component. Using Pe i 10 -3 10 -2 10 -1 10 0 10 1 10 2 10 3  3a). Prandtl numbers are Pr ∞ = 0.1, 1, 10 and 100. The ratio q conv,d /q increases with Pr ∞ for a specific Re ∞ (lines connect markers of identical μ i /μ ∞ and Pr ∞ ). For a certain viscosity ratio, the curves collapse if expressed as a function of Pe ∞ . However, if defined as a function of Pe i , they all collapse.",
                        "The black dash-dotted line in (c) is (4.3).",
                        "scales, respectively, we define Reynolds and Péclet numbers as",
                        "together with a Prandtl number Pr i = Pe i /Re i = c p μ i /κ i . Curves for different viscosity ratios collapse if q conv,d /q is expressed as a function of Pe i , as shown in figure 5(c).",
                        "For Pe i 1, there is a noticeable increase in q conv,d /q. At Pe i = 10, q conv,d /q is greater than 1 %. The simulation results in figure 5(c) are well approximated by a logarithmic function for 10 1 < Pe i < 10 3 . This set of Pe i is the vital interval in practice, as it results in significant increases in heat transfer while still being attainable. The logarithmic function shown in the figure is",
                        "found by fitting the data. This relationship is different from the power laws used for the similar problem of a lid-driven cavity (Moallemi & Jang 1992). Here, the logarithmic expression gives a better fit. For comparison, the root-mean-squared error of the logarithmic expression was 0.0054, whereas, for a power-law fit of α(Pe β i -1), it was 0.011, where α = 0.73k/(h + 2k) and β = 0.11 (with -1 added assuming q conv,d = 0 when Pe i = 1).",
                        "The relationships between Re ∞ and Re i obtained from the simulations are plotted in figure 6 In figure 7, q conv,d /q is shown for other cavity widths and pitches. For p/k = 4 and the same vertical wall thickness, there is a reasonable agreement with (4.3) (figure 7a). This texture corresponds to a solid fraction φ s = 1/4 (i.e. 1w/p). For p/k = 4 and φ s = 1/2, it also holds (figure 7b). However, for φ s = 3/4, the increase of q conv,d /q with Pe i is slower (figure 7c). For p/k = 8, the relation is valid for φ s = 1/8 and φ s = 1/2 but not for φ s = 3/4 (figure 7d-f ). Based on these simulations, it is clear that (4.3) holds at least in the interval 2 ≤ p/k ≤ 8 for φ s ≤ 1/2, 10 1 < Pe i < 10 3 , κ s = κ i = κ ∞ and not too thin vertical walls (pw ≥ k).",
                        "Assuming that ṽ T is approximately zero above the grooves (y ≥ 0) -this is confirmed in figure 10(a) and discussed more later -we obtain,",
                        "This inequality is based on the assumption ρc p ṽ T < q, i.e. d T /dy < 0, which has been seen to be violated locally for high Pr ∞ but by a negligible amount (figure 13f ). The ratio k/(h + 2k) is thus an approximate upper limit of q conv,d /q, and (4.3) cannot be expected to be valid for Pe i 10 3 . For the laminar simulations (h = 2k), the limiting value is 25 %. Moreover, from (2.5), one may see that q conv,d ∝ k/(h + 2k). For the investigated groove widths (1 ≤ w/k ≤ 7), the vertical size of the vortices in the grooves is approximately k. Therefore, the integral of ṽ T scales with k. The definition of q conv,d then results in the scaling with k/(h + 2k) (2.5), which was used in (4.3)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Surface Nusselt number",
                    "paragraphs": [
                        "Since the dispersive convection mainly is contained in the grooves, it is possible to quantify the heat transfer through the LIS by a surface Nusselt number. We consider only the texture, equivalent to h = 0, and define average temperatures at the interface (the slip temperature) and the bottom of the texture, T s = T | y=0 and T lt = T | y=-k , respectively.  3) is also shown (dashed-dotted line). The solver did not converge for some of the higher Re i , so these points have been removed.",
                        "The surface Nusselt number becomes (Appendix E)",
                        "The inequality in (4.4), applied to the texture only, limits Nu i to finite positive values. Heat exchangers can be represented by thermal resistance circuits (Rohsenow et al. 1998). The thermal resistances of the circuit components, proportional to the inverse of their Nusselt numbers, are then evaluated separately. These resistances can then be added to form the total thermal resistance of the system if they are in series. Hatte & Pitchumani (2021) constructed such a model to describe convective heat transfer in pipes with LIS, with the texture and the bulk as components. However, they implicitly neglected the dispersive convection by imposing Nu i = 1. Since Nu i > 1 with convection included (see 4.5), the resulting heat flux of the complete system is higher than their model predicts. In the upper limit of (4.4) applied to the texture, Nu i → ∞. Accordingly, the thermal resistance of the surface becomes zero. Equation (4.5), together with (4.3) to describe q conv,d /q, could be used for a more precise evaluation of Nu i for the parameters and surface geometry considered in this study."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Flow with turbulence",
            "paragraphs": [
                "We have carried out simulations of a turbulent channel flow with LIS using a finite difference method. The bulk Reynolds number was set to flow rate was achieved by applying a uniform volume force in the infusing and external liquids. The simulation domain is illustrated in figure 8. It had dimensions (L x , L y , L z ) = (6.4H, 2H + 2k, 3.2H), and the number of grid points was (N x , N y , N z ) = (640, 384, 640) in the streamwise, wall-normal and spanwise directions. The grid was stretched in the wall-normal direction but uniform in the streamwise and spanwise directions. The smallest wall-normal grid spacing was y + ≈ 0.2, where a superscript + indicates wall units.",
                "We placed transverse grooves with p/k = 4, φ s = 1/4 and k = 0.05H on the lower wall (-0.05H ≤ y ≤ 0), on top of a slab of solid material with the same thickness (-0.1H ≤ y ≤ -0.05H). The groove height corresponds to k + ≈ 9. All wall units were based on the friction velocity of the lower surface, computed from the balance between the applied volume force in the external flow and the wall-shear stress of the smooth upper wall. The wall-unit scaled groove dimensions correspond roughly to LIS used in experiments by Fu et al. (2019). We imposed constant temperatures T u and T l at the upper and lower boundaries, respectively, similar to the laminar configuration. The viscosity ratio was set to μ i /μ ∞ = 0.4, corresponding roughly to heptane-water (table 1). The solid thermal conductivity was κ s = κ i . We performed three simulations with Prandtl numbers Pr ∞ = 1, 2, and 4, respectively. These simulations were also conducted with smooth walls, replacing the grooves with solid material. For more information about the code and grid sensitivity studies, the reader is referred to Ciri & Leonardi (2021), where the same code was used with a similar set-up. The results from the turbulent simulations are summarised in table 2 and will be discussed in the following subsections. Some statistics from the turbulent simulations are given in Appendix F."
            ],
            "subsections": [
                {
                    "title": "Turbulent heat transfer mechanisms",
                    "paragraphs": [
                        "All the terms in (2.5) contribute to the heat flux in a turbulent flow since the flow contains random fluctuations. The change in the heat flux can be written as q q 0 = q cond q 0 + q conv,r q 0 + q conv,d q 0 . (5.1)",
                        "Figure 9 shows the heat flux components for smooth and liquid-infused surfaces. We observe that the contribution of the dispersive term is very small (q conv,d /q 0 ∼ 1 %) for all Prandtl numbers. Nevertheless, the total increase of the heat flux compared with the smooth-wall flow, q/q 0 , was 3.3 %, 7.8 % and 14 % for Pr ∞ = 1, 2 and4,   941 A9 Pr ∞ DR (%) qq 0 q 0 (%) Nu 0 × 10 3 q conv,d q × 10 3 q q 0 τ 0 τ 1 2.8 3. The friction Reynolds number of the smooth channel flow was Re 0 τ = 178.7, and for the flow with LIS, Re τ = 176.1, based on the friction velocity of the textured surface. The drag reduction (DR) was computed by (5.7) and the quantities τ 0 , q 0 , and Nu 0 are wall-shear stress, heat flux and Nusselt number of the smooth-wall simulations, respectively. The heat transfer increase has an uncertainty of ±2 % (Appendix F). q cond /q 0 q conv,r /q 0 q conv,d /q 0 Pr ∞ Figure 9. Contributions to q/q 0 for the different turbulent flow cases. On this scale, q conv,d is hardly visible, corresponding to approximately 1 % or less of q (table 2).",
                        "respectively (table 2). As shown in figure 9, for all these cases, the increase in q conv,r /q 0 dominates the change in the heat flux. However, the main reason behind the enhancement of q conv,r /q 0 is the small but finite value of q conv,d /q, as will be shown later in this section. First, however, we note that if (4.4) is valid also for turbulent flows, then the upper limit of q conv,d /q for the turbulent flow set-up is 2.4 %. For a corresponding symmetric channel, the upper limit would be 4.5 %. The potential contribution from q conv,d /q is, therefore, somewhat restricted for this set-up. Figure 10(a) shows ρc p ṽ T /q = ṽ T + from turbulent and laminar simulations for the same Reynolds number Re i = 29. The agreement between the two systems is reasonably good and we can thus use the laminar flow to interpret the turbulent simulations. This is also corroborated by figure 10(b), where q conv,d /q is compared with (4.3), corresponding to figure 7(a) for the laminar simulations. Indeed, earlier studies indicate that dispersive quantities of rough-wall flow can be reproduced by laminar flow if the offset of the mean velocity in the logarithmic region compared with smooth-wall flow is small ( U + 2) (Abderrahaman-Elena, Fairhall & García-Mayoral 2019). Correspondence between the laminar and turbulent results of ṽ T + is therefore expected here. In the following, we rewrite (5.1) to gain a better insight into the role of the random fluctuations in the heat transfer process. The conduction term corresponds to",
                        "where Nu 0 is the Nusselt number of the smooth-wall flow. Figure 10(a) compares the convective heat flux of a smooth and LIS, where we observe only minor changes in the random component, v T + . We introduce the difference in q conv,r /q between the flow over the LIS and in the smooth channel = q conv,r q -q 0 conv,r q 0 . (5.3) It follows that q conv,r q 0 = q 0 conv,r q 0 q q 0 + q q 0 = 1 -1 Nu 0 q q 0 + q q 0 , (5.4) using q 0 conv,r /q 0 = 1q 0 cond /q 0 and (5.2) in the second step. Assuming = 0, the ratio of the random convection to the total heat flux, q conv,r /q, does not change for the flow over LIS compared with the smooth-wall flow. Accordingly, q conv,r /q 0 is proportional to q/q 0 . Now, using (5.2) and (5.4), (5.1) can be written as q q 0 = 1 + Nu 0 q conv,d q 0 + q q 0 . (5.5) Assuming = 0, we have virtually eliminated q conv,r /q 0 and q cond /q 0 from (5.1); instead Nu 0 acts as amplification factor for q conv,d /q 0 . For a laminar flow Nu 0 = 1, i.e. there is no amplification. On the other hand, if there are random fluctuations in the flow, Nu 0 = q 0 conv,r /q 0 cond + 1, demonstrating how Nu 0 increases due to convection. Hence, Nu 0 is a measure of the amplification of q conv,d /q 0 by the random fluctuations. Indeed, this 941 A9-13 amplification can be substantial. Values measured from the simulations with smooth walls were Nu 0 = 5.8, 7.5 and 9.3 for Pr ∞ = 1, 2 and 4, respectively (table 2). This effect can be expected to increase with increasing bulk Reynolds or Prandtl numbers; Kim & Lee (2020) noticed that Nu 0 increases linearly with Re τ for a channel with smooth isothermal walls. As q/q 0 increases due to the dispersive convection, so does q conv,r /q 0 by (5.4)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Predictions of heat transfer increase",
                    "paragraphs": [
                        "By rearranging (5.5), we get an analytical expression for the change in heat flux as",
                        "(5.6)",
                        "Here, we have performed a Taylor series expansion around = 0. Equation (4.3) has been used in the latter form of the expression (applicable if 10 1 < Pe i < 10 3 ). The Nusselt number Nu 0 (and q 0 ) depends on Pr ∞ and Re b but can be determined without performing simulations of LIS since it is a result of the smooth-wall flow. The other input parameter, Re i , can be computed or estimated using b/p from figure 6(b). Therefore, if is neglected, (5.6) predicts the heat flux of the LIS. Rastegari & Akhavan (2015) and Ciri & Leonardi (2021) constructed similar relationships for drag reduction and heat transfer increase with isothermal solids, respectively. Equation (5.6) is shown in figure 11, both for = 0 and = 2.3 × 10 -3 . The latter corresponds to the measured value for Pr ∞ = 2. For Pr ∞ = 1, was somewhat lower, and for Pr ∞ = 4 slightly higher (see table 2). The positive values of further enhance the heat flux, which is seen from the first form of the expression in (5.6). This expression with = 0 is thus a lower limit of q/q 0 . Since the sum of and q conv,d /q enters the equation, their magnitudes can be compared: q conv,d /q is 2.2, 3.1 and 4.4 times larger for Pr ∞ = 1, 2 and 4, respectively. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Heat flux to drag ratio",
                    "paragraphs": [
                        "The slight increase of v T + is reflected by the wall-normal velocity fluctuations. As shown in figure 12(a), the root-mean-squared value v + rms increases near the surface. Such roughness effects severely reduce the drag benefits for transverse grooves (Ciri & Leonardi 2021). The LIS gave a slight drag reduction compared with the smooth wall DR = τ 0 -τ τ 0 = 0.028, (5.7)",
                        "where τ is the total drag of the lower surface, and τ 0 is the wall-shear stress from the reference simulation with smooth walls. The current DR and the ideal drag reduction relationship by Rastegari & Akhavan (2015) are shown in figure 12(b). This relationship was derived for channels with symmetric walls but can also be applied to asymmetric configurations if DR is computed by (5.7) (Fu et al. 2017;Ciri & Leonardi 2021).",
                        "Without degrading effects, it predicts that the drag reduction would be 8 %. Nevertheless, we achieve DR > 0 together with a heat transfer increase for this geometry. Interface deformations, which have been neglected here, tend to reduce DR and increase convection further (Cartagena et al. 2018;Ciri & Leonardi 2021;Sundin, Zaleski & Bagheri 2021).",
                        "The heat transfer efficiency of the system can be measured by the heat flux to drag ratio or, equally, the Reynolds analogy factor, 2St/C f , where St is the Stanton number and C f is the friction coefficient. According to the Reynolds analogy, 2St/C f = 1 for flow over smooth walls with Pr ∞ = 1 (Kestin & Richardson 1963). Changes in the heat flux to drag ratio when introducing surface modifications at this Prandtl number thus indicate a breakage of the Reynolds analogy. A growth or a reduction equal increased or decreased heat transfer efficiency, respectively. However, the exact value of 2St/C f for smooth-wall flows depends on the normalisation used to form the non-dimensional numbers. The heat flux to drag ratio normalised with the smooth-wall reference values, (q/q 0 )(τ 0 /τ ), is a valid measure of the heat transfer efficiency independently of the Prandtl number. This quantity is reported in table 2. Since both q/q 0 > 1 and τ 0 /τ > 1 for the current set-up, (q/q 0 )(τ 0 /τ ) exceeds unity, having a maximum value of 1.17 for Pr ∞ = 4. For LIS and SHS with isothermal solids, it ranges between 0.9 and 1.2 (Ciri & Leonardi 2021). Rough walls with either irregular (Forooghi, Stripf & Frohnapfel 2018)  (such as transverse bars or rods (Leonardi et al. 2015)) have been seen to reduce the Reynolds analogy factor."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "For LIS with transverse grooves, shear stress due to the external flow induces recirculation in the cavities. This recirculation increases the heat transfer by dispersive convection, contributing q conv,d to the total heat flux. A net increase in the heat flux compared with a smooth surface, q/q 0 > 1, can be achieved in laminar flows if the thermal conductivity of the solid is similar to or smaller than the conductivity of infusing liquid, κ s κ i . If κ s ≈ κ i , q conv,d may be essential. Therefore, we have investigated the convection for κ s = κ i in greater detail. The ratio q conv,d /q can be expressed as a function of the Péclet number based on the slip velocity and the groove height, Pe i . This function resembles a logarithmic function in the interval 10 1 < Pe i < 10 3 , (4.3). The same approximation is also applicable for turbulent external flow.",
                "Dispersive convection occurs only inside and in the vicinity of the surface. Therefore, apart from the dependency on Pe i , q conv,d is proportional to the ratio of the groove height to the total system height. This ratio is also an approximate upper limit of q conv,d /q (4.4). For turbulent flows, the convection from random fluctuations in the bulk flow, q conv,r , dominates. However, q conv,r /q changes only slightly from the smooth-wall flow. Therefore, the dispersive convection can amplify the heat flux considerably even for turbulent flows, as expressed by (5.6).",
                "The convection in the LIS texture could be used in applications to achieve increased heat transfer. Numerous liquids can be used for LIS, whereas constraints on solid surface materials, such as weight, could limit their thermal conductivity. Low weight, for example, has been a driving force in the increased usage of micro heat exchangers (Dixit & Ghosh 2015). In addition to the increased surface heat flux, the slip induced by the LIS leads to reduced friction which lowers the required power input (Hatte & Pitchumani 2021). These two properties make LIS augmented convective heat transfer a promising method for achieving more efficient heat exchangers.",
                "Integration from -2k, corresponding to the bottom of the domain, to y, expresses a balance between convective fluxes and conduction",
                "We integrate a second time from -2k to h",
                "Identifying the heat flux at the bottom of the domain",
                "vT dy. (A4)",
                "The integral of the conduction term can be split into an external fluid and a surface term by considering integration limits from y = 0 to h and y = -2k to 0, respectively. We decompose the convective flux (see Appendix B)",
                "where ṽ T is the dispersive component and v T is the random, external flow component.",
                "This results in q = -1 h + 2k ṽ T dy = q cond,∞ + q cond,s + q cond,i + q conv,r + q conv,d , (A6)",
                "where conductive and convective parts have been identified. The conduction in the solid and the infusing liquid are separated after the equal sign. They can be written as q cond,s = -1 h + 2k "
            ],
            "subsections": []
        },
        {
            "title": "Appendix A. FIK identities",
            "paragraphs": [
                "We begin with the energy equation, (2.3), and assume periodicity in the streamwise and spanwise directions. Taking the average in time and the streamwise and spanwise directions, denoted by the operator , which means -κ∂T/∂y is constant everywhere, and equal to q. Integrating (A9) over the solid and the external fluid",
                "respectively, where",
                "These two expressions give a solution for T s ,",
                "Putting this expression back into (A10)",
                "A.2. Homogeneous thermal conductivity Simplifications of (A6) can be made by assuming",
                "Hence",
                "The first term is equal to (A12), as it corresponds to only the conduction."
            ],
            "subsections": []
        },
        {
            "title": "Appendix B. Flow decomposition",
            "paragraphs": [
                "For the quantity u",
                "starting averaging at some time t and over a time difference t. The extent of the domain in the streamwise and spanwise directions is represented by L x and L z , respectively. We may also introduce an average in time with a zero plane average, ˜, such that",
                "giving the dispersive fluctuations. Since the transverse grooves are aligned in the spanwise direction, spatial averaging in this direction may be applied when computing ",
                "where u are the random fluctuations attributed to the background turbulence. The root-mean-squared value is u rms = (u -U) 2 . The dispersive root-mean-squared value is u rms,d = ũ2 . Also,",
                "where u rms,r = u 2 . The last term is zero since there is no correlation between ũ and u . Such cross-correlations are always zero because ũ is independent of t, whereas the average of u in t is zero. Similarly, for wall-normal velocity and temperature"
            ],
            "subsections": []
        },
        {
            "title": "Appendix C. Simulations with FreeFem++",
            "paragraphs": [
                "The finite element solver FreeFem++ (Hecht 2012) was used to carry out the laminar simulations of the unit cell in two dimensions. We used a built-in tool to generate a triangle mesh with similar spacing in the streamwise and wall-normal directions, conforming to the solid boundaries and the interface. The velocities and the temperature were described by quadratic (P 2 ) and the pressure by linear (P 1 ) finite elements. The momentum and continuity equations were solved simultaneously in an iterative manner until convergence was reached. Afterwards, the equation for the temperature was solved.",
                "We performed a grid convergence study for κ i = κ ∞ = κ s , p/k = 4, w/k = 3 (φ s = 1/4) and μ i /μ ∞ = 0.4, corresponding to the values used in the turbulent simulations. Further, Re ∞ = 270, Re i = 24 and both Pr ∞ = 1 and 100 were tested. The simulations were run with grids generated with N y = 200, 400 and 800 triangles along the wall-normal boundary. The differences in U ∞ and q between the grids were less than 0.1 % for Pr ∞ = 1 and 100. These insignificant differences show that the simulations, to a large extent, are independent of the grid. Plots of relevant quantities are shown in figure 13. Velocities are normalised with the friction velocity, u τ , temperature with T l -T u and vT with q/(ρc p ). The heat flux, q, was assessed at the top boundary. For Pr ∞ = 100, there was a noticeable peak in the total heat flux at the interface, decreasing with increased resolution. It indicates the need for a fine grid to resolve the gradient in vT (figure 13f ). However, because of the consistency in the heat flux elsewhere, all three resolutions were still considered acceptable. For the rest of the simulations, we used N y = 400."
            ],
            "subsections": []
        },
        {
            "title": "Appendix D. Analytical slip length in the Stokes limit",
            "paragraphs": [
                "For constant shear stress, the velocity at",
                "An expression for the slip length in the Stokes limit of both longitudinal and transverse LIS was derived by Schönecker et al. (2014). For transverse grooves, the slip length It is possible to derive a surface Nusselt number by considering only the surface instead of the complete domain. The average temperatures at the interface and the bottom of the texture are T s = T | y=0 and T lt = T | y=-k , respectively. We assume that κ s = κ i and",
                "The expression (4.5) for the surface Nusselt number can be derived from the definition as follows: The different contributions to the surface heat flux, q, for the turbulent flow simulations are shown in figure 9. For these simulations, q was assessed as the sum of the contributions. Deviations in the total heat flux across the channel were generally minor (approximately 2 %). However, at the grooves, the errors were slightly larger. The maximum deviation occurred for Pr ∞ = 4 (Δ = 0.075, cf. ṽ T + in figure 10(a) with a maximum 0.77). If ṽ T + is assumed to have a similar error in the grooves (i.e. q conv,d /q ± Δ • k/(2k + h)), the heat transfer increase is 0.12 ≤ q/q 0 -1 ≤ 0.16 by (5.6). Compared with the value reported in table 2, the bounds correspond to a difference of approximately 2 percentage points, which does not affect any conclusions."
            ],
            "subsections": []
        }
    ]
}