{
    "id": "US20200332345",
    "authors": [
        "Marilynn A. Larson",
        "James C. Baldwin",
        "Michael P. Dempsey"
    ],
    "title": "METHODS OF DETECTING AND TYPING PATHOGENIC STRAINS OF FRANCISELLA TULARENSIS",
    "date": "2020-03-27 00:00:00",
    "abstract": "A method of detecting a presence of Francisella tularensis (F. tularensis). The method includes amplifying a first nucleic acid from said specimen using a first plurality of primers, said first plurality of primers comprising SEQ ID NO 4 and SEQ ID NO 5. When the first nucleic acid is detected, then the presence of F. tularensis is determined.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This application is a continuation of U.S. application Ser. No. 15/908,808, filed Feb. 28, 2018, which claims the benefit of and priority to prior filed co-pending Provisional Application Ser. No. 62/464,666, filed Feb. 28, 2017. The specification of each application is expressly incorporated herein by reference in its entirety."
            ],
            "subsections": [
                {
                    "title": "RIGHTS OF THE GOVERNMENT",
                    "paragraphs": [
                        "The invention described herein may be manufactured and used by or for the Government of the United States for all governmental purposes without the payment of any royalty."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "government use rights"
                    ],
                    "num_characters": 171,
                    "outline_medium": [
                        "government use rights"
                    ],
                    "outline_short": [
                        "government use rights"
                    ]
                },
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates generally to the detection of infectious bacteria and, more particularly, to the detection of Francisella tularensis."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "infectious bacteria detection"
                    ],
                    "num_characters": 147,
                    "outline_medium": [
                        "infectious bacteria detection"
                    ],
                    "outline_short": [
                        "infectious bacteria detection"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Tularemia is a zoonotic disease caused by a facultative intracellular pathogen, Francisella tularensis (hereafter, F. tularensis), that may be easily disseminated by a lethal dose of 10 organisms or less. As such, F. tularensis is a potential bioweapon able to cause a major health impact. F. tularensis is comprised of four subspecies: tularensis (type A), holarctica (type B), mediasiatica, and novicida. The type A subspecies is further separated into subtypes: A.I and A.II. These four subspecies and two subtypes differ considerably in virulence, with the type A.I clade possessing the greatest virulence and subspecies novicida possessing the least.",
                        "F. tularensis is distributed globally, with some stronger geographic associations, and can infect more species than any other known zoonotic pathogen. F. tularensis transmission occurs through oral, cutaneous, and conjunctival routes of exposure. Natural exposures to infected arthropods, animals, water, or food are common modes of infection. The most severe form of this disease is pneumonic tularemia that most likely results from the inhalation of contaminated (natural or man-made) aerosols. Fatality rates as high as 35% from a subtype A.I infection have been reported.",
                        "From a Public Health (“PH”) and DoD Force Health Protection (“FHP”) perspective, it is imperative to know if a potential exposure from a virulent F. tularensis strain, particularly a subtype A.I strain has occurred. However, all forms of tularemia, if untreated, can lead to hematogenous spread and eventual acute renal failure. While appropriate medical management is key for all exposures, rapid, accurate, and stand-alone identification of the F. tularensis subspecies and subtype is imperative to ensure that respiratory protection is considered when appropriate; however, this capability is currently lacking.",
                        "For example, the inability to subspeciate F. tularensis was observed in 2005 at a large gathering on the Capital Mall in Washington, D.C. U.S. Government BioWatch sensors were triggered, and the Centers for Disease and Prevention (“CDC”) issued a health advisory to healthcare personnel of possible tularemia exposure. Specimens obtained at the event were later analyzed and shown to contain signatures from F. tularensis subspecies novicida, a naturally-occurring, non-select agent that is not virulent. Had the subspecies been identified prospectively on-site, the CDC health advisory would have been unnecessary.",
                        "A number of other related, avirulent bacterial strains further complicate the positive identification of F. tularensis, such as Francisella persica (a nonpathogenic tick endosymbiont formally classified as Wolbachia persica).",
                        "Conventional polymerase chain reaction (“PCR”) assays do not offer accurate subspecies and subtype differentiation. These methods are also not able to definitively identify all four subspecies of F. tularensis with sufficient simplicity that identification may be done in or near the point of operations. Research and reference laboratory methods and platforms capable of F. tularensis subspeciation are known, but require a complex scoring matrix and are only able to differentiate three of the four F. tularensis subspecies.",
                        "Thus there remains a need for rapid, portable, and accurate stand-alone detection assays that can differentiate all four F. tularensis subspecies and the two type-A subtypes. Such assays should be suitable for deployment in Joint Biological Agent Identification and Diagnostic System (“JBAIDS”), or for next generation platforms (such as sequencing or dense array PCR) that will eventually replace JBAIDS."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce tularemia",
                        "describe F. tularensis subspecies",
                        "discuss transmission routes",
                        "highlight public health concerns",
                        "describe limitations of current detection methods",
                        "provide example of misidentification",
                        "emphasize need for rapid detection"
                    ],
                    "num_characters": 3627,
                    "outline_medium": [
                        "introduce tularemia",
                        "limitations of current detection methods",
                        "need for rapid and accurate detection"
                    ],
                    "outline_short": [
                        "limitations of current tularemia detection methods"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention overcomes the foregoing problems and other shortcomings, drawbacks, and challenges of rapidly and accurately detecting and differentiating all four F. tularensis subspecies and subtypes using deployable supplies and instruments. While the invention will be described in connection with certain embodiments, it will be understood that the invention is not limited to these embodiments. To the contrary, this invention includes all alternatives, modifications, and equivalents as may be included within the spirit and scope of the present invention.",
                        "According to embodiments of the present invention, a method of detecting a presence of Francisella tularensis (F. tularensis) or nucleic acids thereof includes amplifying a first nucleic acid from said specimen using a first plurality of primers, said first plurality of primers comprising SEQ ID NO 4 and SEQ ID NO 5. When the first nucleic acid is detected, then the presence of F. tularensis or nucleic acids thereof is determined.",
                        "In some aspects of the present invention, a detection assay for detecting the presence of F. tularensis includes a first plurality of primers comprising SEQ ID NO 4 and SEQ ID NO 5.",
                        "Other embodiments of the present invention include a method of detecting a virulent strain of F. tularensis or nucleic acids thereof by amplifying a first nucleic acid from said specimen using a first plurality of primers, said first plurality of primers comprising SEQ ID NO 7, and SEQ ID NO 8. When the first nucleic acid is detected by using a first probe comprising SEQ ID NO 9, then the presence of a virulent strain of F. tularensis or nucleic acids thereof is determined.",
                        "For some aspects of the present invention, a detection assay for detecting the presence of a virulent strain of F. tularensis includes a first plurality of primers comprising SEQ ID NO 7 and SEQ ID NO 8. The assay further includes a first probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 9.",
                        "Yet other embodiments of the present invention include a method of detecting a non-virulent strain of F. tularensis (e.g., subsp. novicida) or nucleic acids thereof by amplifying a first nucleic acid from said specimen using a first plurality of primers and detecting the first nucleic acid using a first probe. The first plurality of primers and corresponding first probe may be selected from the group consisting of SEQ ID NO 22, SEQ ID NO 23, and SEQ ID NO 24; SEQ ID NO 25, SEQ ID NO 26, and SEQ ID NO 27; SEQ ID NO 28, SEQ ID NO 29, and SEQ ID NO 30; and SEQ ID NO 31, SEQ ID NO 32, and SEQ ID NO 33. Detection of the first nucleic acid determines the presence of the non-virulent strain of F. tularensis (e.g., subsp. novicida) or nucleic acids thereof.",
                        "Some aspects of the present invention include a detection assay for detecting the presence of a non-virulent strain of F. tularensis (e.g., subsp. novicida) or nucleic acids thereof. The assay includes a first plurality of primers and a first probe selected from the group consisting of SEQ ID NO 22, SEQ ID NO 23, and SEQ ID NO 24; SEQ ID NO 25, SEQ ID NO 26, and SEQ ID NO 27; SEQ ID NO 28, SEQ ID NO 29, and SEQ ID NO 30; and SEQ ID NO 31, SEQ ID NO 32, and SEQ ID NO 33. A fluorescent reporter dye is coupled to an initial 5′-nucleotide of the first probe.",
                        "According to embodiments of the present invention, a method of detecting a virulent strain of F. tularensis, subspecies tularensis or nucleic acids thereof in a specimen by amplifying a first nucleic acid from said specimen using a first plurality of primers and detecting the first nucleic acid using a first probe. The first plurality of primers and corresponding first probe may be selected from the group consisting of SEQ ID NO 10, SEQ ID NO 11, and SEQ ID NO 12; and SEQ ID NO 13, SEQ ID NO 14, and SEQ ID NO 15. Detection of the first nucleic acid determines the presence of the subspecies tularensis (type A) or nucleic acids thereof.",
                        "In aspects of the present invention, a detection assay for detecting the presence F. tularensis, subspecies tularensis (type A) or nucleic acids thereof. The assay includes a first plurality of primers and a first probe selected from the group consisting of SEQ ID NO 10, SEQ ID NO 11, and SEQ ID NO 12; and SEQ ID NO 13, SEQ ID NO 14, and SEQ ID NO 15. A fluorescent reporter dye is coupled to an initial 5′-nucleotide of the first probe.",
                        "Other embodiments of the present invention are directed to a method of detecting and distinguishing F. tularensis, subspecies tularensis, subtypes A.I or nucleic acids thereof and F. tularensis, subspecies tularensis, A.II in a specimen or nucleic acids thereof. The method includes amplifying a first nucleic acid from said specimen using a first plurality of primers comprising SEQ ID NO 10 and SEQ ID NO 11 and amplifying a second nucleic acid from said specimen using a second plurality of primers comprising SEQ ID NO 13 and SEQ ID NO 14. The first nucleic acid is detected using a first probe comprising SEQ ID NO 12; the second nucleic acid is detected using a second probe comprising SEQ ID NO 15. Detection of the first nucleic acid indicates a presence of F. tularensis, subspecies tularensis, subtype A.I. in the specimen; detection of the second nucleic acid indicates the presence of F. tularensis, subspecies tularensis, subtype A.II. in the specimen.",
                        "Yet other embodiments of the present invention include a method of detecting a presence of F. tularensis, subspecies holarctica or nucleic acids thereof in a specimen by amplifying a first nucleic acid using a first plurality of primers comprising SEQ ID NO 16 and SEQ ID NO 17. When the first nucleic acid is detected using a first probe comprising SEQ ID NO 18, then the presence of F. tularensis, subspecies holarctica or nucleic acids thereof is determined.",
                        "For some aspects of the present invention, a detection assay kit for detecting a presence of F. tularensis, subspecies holarctica or nucleic acids thereof in a specimen includes a first plurality of primers comprising SEQ ID NO 16 and SEQ ID NO 17. The assay kit further includes a first probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 18.",
                        "Still other embodiments of the present invention include a method of detecting F. tularensis, subspecies mediasiatica or nucleic acid thereof in a specimen by amplifying a first nucleic acid from said specimen using a first plurality of primers comprising SEQ ID NO 19, and SEQ ID NO 20. When the first nucleic acid is detected using a first probe comprising SEQ ID NO 21, then the presence of F. tularensis, subspecies mediasiatica or nucleic acid thereof is determined.",
                        "For some aspects of the present invention, a detection assay kit for detecting a presence of F. tularensis, subspecies mediasiatica or a nucleic acid thereof in a specimen includes a first plurality of primers comprising SEQ ID NO 19 and SEQ ID NO 20. The assay kit further includes a first probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 21.",
                        "Other aspects of the present invention include a detection assay kit for detecting F. tularensis or a nucleic acid thereof. The assay kit includes a first assay, a second assay, a third assay, a fourth assay, a fifth assay, a sixth assay, a seventh assay, an eighth assay, a ninth assay, a and a tenth assay. The first assay includes a first plurality of primers comprising SEQ ID NO 4 and SEQ ID NO 5 and a first probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 6. The second assay includes a second plurality of primers comprising SEQ ID NO 7 and SEQ ID NO 8 and a second probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 9. The third assay includes a third plurality of primers comprising SEQ ID NO 10 and SEQ ID NO 11 and a third probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 12. The fourth assay includes a fourth plurality of primers comprising SEQ ID NO 13 and SEQ ID NO 14 and a fourth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 15. The fifth assay includes a fifth plurality of primers comprising SEQ ID NO 16 and SEQ ID NO 17 and a fifth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 18. The sixth assay includes a sixth plurality of primers comprising SEQ ID NO 19 and SEQ ID NO 20 and a sixth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 21. The seventh assay includes a seventh plurality of primers comprising SEQ ID NO 22 and SEQ ID NO 23 and a seventh probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 24. The eighth assay includes an eighth plurality of primers comprising SEQ ID NO 25 and SEQ ID NO 26 and an eighth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 27. The ninth assay includes a ninth plurality of primers comprising SEQ ID NO 28 and SEQ ID NO 29 and a ninth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 30. The tenth assay includes a tenth plurality of primers comprising SEQ ID NO 31 and SEQ ID NO 32 and a tenth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 33.",
                        "According to still other embodiments of the present invention, a method of detecting a presence of the non-virulent subspecies, specifically Francisella tularensis (F. tularensis) subsp. novicida or F. tularensis subsp. novicida nucleic acid in a specimen includes amplifying a first nucleic acid from said specimen using a first plurality of primers, said first plurality of primers comprising SEQ ID NO 22, SEQ ID NO 23; SEQ ID NO 25, SEQ ID NO 26; SEQ ID NO 28, SEQ ID NO 29; SEQ ID NO 31, and SEQ ID NO 32. The first nucleic acid is detected using a first probe comprising SEQ ID NO 24; SEQ ID NO 27; SEQ ID NO 30; and SEQ ID NO 33. Detection indicates the presence of F. tularensis subsp. novicida or F. tularensis subsp. novicida nucleic acid in the specimen.",
                        "Other variations of the present invention include the use of direct DNA sequencing of the PCR products, using some or all of the sequences described in this invention. Sequencing may allow for the measurement of the quantitative and quadrative properties of the product and the additional sequence information may improve both the throughput and accuracy of qPCR based singleplex or multiplex measurements",
                        "Additional objects, advantages, and novel features of the invention will be set forth in part in the description which follows, and in part will become apparent to those skilled in the art upon examination of the following or may be learned by practice of the invention. The objects and advantages of the invention may be realized and attained by means of the instrumentalities and combinations particularly pointed out in the appended claims.",
                        "It should be understood that the appended drawings are not necessarily to scale, presenting a somewhat simplified representation of various features illustrative of the basic principles of the invention. The specific design features of the sequence of operations as disclosed herein, including, for example, specific dimensions, orientations, locations, and shapes of various illustrated components, will be determined in part by the particular intended application and use environment. Certain features of the illustrated embodiments have been enlarged or distorted relative to others to facilitate visualization and clear understanding. In particular, thin features may be thickened, for example, for clarity or illustration."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce invention",
                        "describe method for detecting F. tularensis",
                        "detail primers and probes for detection",
                        "describe detection of virulent strains",
                        "detail primers and probes for virulent strains",
                        "describe detection of non-virulent strains",
                        "detail primers and probes for non-virulent strains",
                        "describe detection of subspecies tularensis",
                        "detail primers and probes for subspecies tularensis",
                        "describe detection of subspecies holarctica",
                        "detail primers and probes for subspecies holarctica",
                        "describe detection of subspecies mediasiatica",
                        "detail primers and probes for subspecies mediasiatica",
                        "describe detection of F. tularensis subspecies",
                        "detail primers and probes for F. tularensis subspecies",
                        "describe detection of F. tularensis subtypes",
                        "detail primers and probes for F. tularensis subtypes",
                        "describe detection assay kit",
                        "detail components of detection assay kit",
                        "describe use of direct DNA sequencing",
                        "highlight advantages of invention",
                        "discuss variations of invention",
                        "emphasize objects and advantages of invention"
                    ],
                    "num_characters": 11799,
                    "outline_medium": [
                        "introduce invention",
                        "detect F. tularensis",
                        "detect virulent strain",
                        "detect non-virulent strain",
                        "detect subspecies tularensis",
                        "detect subspecies tularensis, subtype A.I",
                        "detect subspecies tularensis, subtype A.II",
                        "detect subspecies holarctica",
                        "detect subspecies mediasiatica",
                        "detection assay kit",
                        "alternative detection methods"
                    ],
                    "outline_short": [
                        "overview of invention",
                        "method of detecting F. tularensis",
                        "detection assay for F. tularensis",
                        "method of detecting virulent strain of F. tularensis",
                        "variations of detection methods"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The assays according to embodiments of the present invention comprise a plurality of primers, probes, and assay conditions that provide F. tularensis species-, subspecies-, and subtype-level differentiation via PCR. The various embodiments may be singleplex qPCR (real time PCR, “qPCR,” wherein such methods are similar except as specifically noted) assays or multiplex qPCR assays with sequencing to detect multiple F. tularensis targets. The singleplex qPCR assay embodiments detect each F. tularensis target separately; in the multiplexed qPCR assay embodiments, different targets may be multiplexed in a single tube. The qPCR assays, according to embodiments of the present invention, are operable on the currently fielded DoD JBAIDS (BioFire Defense, Salt Lake City, Utah), the APPLIED BIOSYSTEMS 7500 Fast instrument (Thermo Fisher Scientific, Waltham, Mass.), the 3M Integrated Cycler (Focus Diagnostics of Diasorin Molecular, LLC, Cypress, California), as well as most other real-time PCR instruments. Furthermore, assays according to embodiments of the present invention may be operated by PCR amplification followed by DNA sequence-based genotyping that is compatible on most DNA sequencers, such as but not limited to, the Ion Torrent (Thermo Fisher, formerly Life Technologies, Corp.). Each assay variant is independently capable of identifying and subspeciating F. tularensis to guide and promote the appropriate public health, Force Health Protection, family health public, medical response, or a combination of one of more of these.",
                        "The assays according to embodiments of the present invention detect the qualitatively amplicon exact sequences rather than relying on detection via fluorescent signal with a probe or observing amplicon presence. According to some embodiments, mere detection of a certain qualitative product by sequence is sufficient to be diagnostic for a given F. tularensis subspecies or subtype. The non-specific detector embodiments (those that make amplicon from more than one strain) contain numerous single nucleotide polymorphisms (“SNP”) that are indicative of F. tularensis subspecies.",
                        "Referring now to the figures, and in particular to FIG. 1, a method 20 of detecting the F. tularensis species, a subspecies thereof, a subtype thereof, or a combination thereof is described in greater detail. The method 20 begins with obtaining a suspect specimen that the operator would desire a test for the presence of F. tularensis (or F. tularensis nucleic acid) or related bacteria (or bacterial nucleic acid) (Block 22). Such specimen may be, but is not limited to, food, water, soil, insects, arthropods, and human clinical specimens. Genomic DNA is extracted from the suspected specimen by standard methods or other practical means (Block 24). For PCR, however, and as would be understood by the skilled artisan, the specimen may be directly assessed using such methods without the need for isolation of genomic DNA (Optional Block 26).",
                        "Depending on the method employed (i.e., PCR, qPCR, sequencing) the next steps vary, as would be understood by one having ordinary skill in the art and the benefit of the disclosure provided herein (Decision Block 28).",
                        "For qPCR (“qPCR” branch of Decision Block 28) primers and probes are selected and prepared according to a desired level of detection, wherein the desired detection level may be species, subspecies, or subtype (Block 30). Alternatively, (“PCR SEQUENCE” branch of Decision Block 28), primers are selected and prepared according to a desired level of detection, wherein the desired detection level may be species, subspecies, or subtype (Block 30′). Generally, the composition and formula of the reaction is dependent on the make and model of the instruments to be employed, as well as whether the reaction is performed singleplex or multiplex. Likewise, probe fluorophores (and quenchers in qPCR variants) are selected for detection by the intended instrument. Such compositions, formulations, and preparations are known to those having ordinary skill in the art and the benefit of the disclosure provided herein.",
                        "The desired detection level may be determined by selecting at least one assay from a plurality of assays, each assay comprises sequences for a forward primer, a reverse primer, and a probe (for qPCR) that are specific to a subtype of, a subspecies of, or the F. tularensis species, or to general, related bacteria, broadly. Such sequences are provided in detail below, in Table 1. Specifically, the individual assays of Table 1, “U16S,” “4Pan1,” “3Pan,” “A1d,” “A2c,” “B2,” and “M3,” produce a product corresponding to only with certain F. tularensis variants or related bacteria, generally. By observing products for the selected assays, by any preferred means of visualization, the strain of F. tularensis encountered may be determined.",
                        "The genomic signatures of Table 1 detect only the intended strains of interest, are compatible with the other primers and probes of Table 1, are compatible with other commercially-available primers and probes, and provide specific and sensitive identification of the strain or strains of interest. The primers and probes according to embodiments of the present invention anneal to complementary chromosomal regions in the F. tularensis strain or strains of interest described in greater detail below. The location in the genome of the primers was chosen to provide this desired result without the direct intervention of the operator.",
                        "Each assay yields information such that the encountered strain is determined by deduction. Therefore, each selection includes a negative control assay, a positive control assay, and at least one identifying assay. A product of the negative control assay sequence facilitates a determination of whether a contaminant is present (e.g., DNA template carry over); a product of the positive control assay sequence (i.e., an appropriate DNA target) suggests no inhibitors are present in the reaction and reagents are functioning as expected.",
                        "According to some embodiments of the present invention, the “U16S” assay, provided in Table 1, may be used as the positive control and reveals whether any bacterium is present within the specimen.",
                        "According to embodiments of the present invention, the negative control assay sequence may comprise a small, synthetic plasmid, tailored to pair with appropriate primers.",
                        "Optionally, the absence of inhibitors may be validated by spiking the reaction containing the specimen with the appropriate components, such as the U16S primers and amplicon, and omitting the probe for conventional PCR (or including the probe for qPCR). Such assay will yield a positive product for any sample containing bacterial DNA and provides evidence that the PCR or qPCR reaction was not inhibited. Determination of non-inhibition enables an operator to correctly assess a negative result. Without a proper amplification control, the operator may falsely assume that no product production means that F. tularensis is not present in the sample being tested, when in reality, the assay has failed to work due to the presence of inhibitory compounds or substances.",
                        "The modified, universal 16S ribosomal DNA (rDNA) assay of Table 1 is an endogenous internal control configured to amplify the conserved region in the 16S rRNA gene of the bacterial strains in the sample or, alternatively, for use as an exogenous reagent or assay control. The conventional, universal 16S rDNA probe sequence was slightly modified to accommodate the Francisella genus and Francisella-like organisms.",
                        "The 4Pan1 assay sequences, as shown in Table 1, detect all four F. tularensis subspecies, including avirulent subspecies novicida, in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the 4Pan1 assay is highly conserved in all four F. tularensis subspecies and is located within the ostA1 gene (or the ostA2 gene) or nucleotide sequences with similarity to a region within the F. tularensis locus tag FTT_467. The 4Pan1 assay will only yield a product for a specimen having at least one F. tularensis variant, but not for any closely related bacteria.",
                        "The 3Pan assay sequences, as shown in Table 1, detect the three virulent F. tularensis subspecies and therefore, excludes avirulent subspecies novicida in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing based-assay. The targeted region in the 3Pan assay is present and highly conserved in only the three virulent F. tularensis subspecies (tularensis subtype A.I and A.II, holarctica, and mediasiatica) and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTL 1858. The 3Pan assay will only yield a product for a specimen having at least one of the three virulent F. tularensis subspecies, i.e., tularensis (type A), holarctica (type B), and mediasiatica.",
                        "The A1d assay sequences, as shown in Table 1, detect only the F. tularensis subspecies tularensis subtype A.I strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the A1d assay is present and highly conserved in only F. tularensis subspecies tularensis subtype A.I and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTT_0516. The spatial location where the primers and probe bind the chromosome of F. tularensis subspecies tularensis subtype A.I strains provides the specificity. The A1d assay will only yield a product for a specimen having the F. tularensis subspecies tularensis subtype A.I, which is the most serious threat and the most virulent clad of the F. tularensis species, as well as most other bacterial pathogens.",
                        "The A2c assay sequences, as shown in Table 1, detect only F. tularensis subspecies tularensis subtype A.II strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region of the A2c assay is present and highly conserved in only the F. tularensis subspecies tularensis subtype A.II strains and is located within the gene mviN, which is predicted to encode an integral membrane protein. The nucleotide sequences shares similarity to a region within the F. tularensis locus tag FTW 1702. The A2c assay will only yield a product for a specimen having the moderately virulent F. tularensis subspecies tularensis subtype A.II.",
                        "The B2 assay sequences, as shown in Table 1, detect only F. tularensis subspecies holarctica (type B) strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the B2 assay is present and highly conserved in only the F. tularensis subspecies holarctica (type B) strains and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTS 0806. The B2 assay will only yield a product for a specimen having the moderately virulent F. tularensis subspecies holarctica (type B).",
                        "The M3 assay sequences, as shown in Table 1, detect only F. tularensis subspecies mediasiatica strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the M3 assay is present and highly conserved in only the F. tularensis subspecies mediasiatica strains and is located within nucleotides sequences that shares similarity to a region within the F. tularensis locus tag FTM 1104. The spatial location where the primers bind the chromosome of F. tularensis subspecies mediasiatica strains provides the specificity. The M3 assay will only yield a product for a specimen having the moderately virulent F. tularensis subspecies mediasiatica.",
                        "The N1, N2, N3, and N4 assays will only yield a product for a specimen having the non-virulent F. tularensis subspecies novicida. The N1 assay sequences, as shown in Table 1, detect only F. tularensis subspecies novicida strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region of the N1 assay is present and highly conserved in only the F. tularensis subspecies novicida strains and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTN_0003, a genetic locus predicted to encode a metabolite: H+ symporter protein.",
                        "The N2 assay sequences, as shown in Table 1, detect only F. tularensis subspecies novicida strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the N2 assay is present and highly conserved in only the F. tularensis subspecies novicida strains and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTN_0003, a genetic locus predicted to encode a metabolite: H+ symporter protein.",
                        "The N3 assay sequences, as shown in Table 1, detect only F. tularensis subspecies novicida strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the N3 assay is present and highly conserved in only the F. tularensis subspecies novicida strains and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTN 1015, a genetic locus predicted to encode an isochorismatase family protein.",
                        "The N4 assay sequences, as shown in Table 1, detect only F. tularensis subspecies novicida strains in a PCR-based assay, a singleplex qPCR assay, a nonmatrix-based (or matrix-based) multiplex qPCR assay, or a sequencing-based assay. The targeted region in the N4 assay is present and highly conserved in only the F. tularensis subspecies novicida strains and is located within nucleotide sequences that shares similarity to a region within the F. tularensis locus tag FTN 0730, a genetic locus predicted to encode an acyl-coenzyme A synthetase/AMP (fatty) acid ligase protein.",
                        "Collectively the primers, with or without the associated probes of the assays may, be employed to amplify a product ranging from 80 bp to 206 bp.",
                        "FIGS. 2 and 3 include a flowchart 32 illustrating a method of analyzing results from the assays denoted in Table 1 according to an embodiment of the present invention. The flowchart 32 may be used in determining which assays are selected. At start, a determination as to whether contamination is present within the specimen is made (Decision Block 34), which may also be considered to be a quality control check of the sample preparation. If a product results (“YES” Branch of Decision Block 34), then a contaminant may be present and the sample preparation fails quality control (Block 36). If no (“NO” Branch of Decision Block 34), then a determination as to whether a bacterium is present within the specimen is made (Decision Block 38). If no product is observed (“NO” Branch of Decision Block 38), then either no bacteria is present or the reaction failed due to a presence of inhibitors (for example) (Block 40). Confirmation of reaction failure may optionally be performed by diluting the sample and returning to Decision Block 34 (not shown); otherwise, the process ends. If a product is observed (“YES” Branch of Decision Block 38), the presence of bacteria (or bacterial nucleic acid) is confirmed and the process continues (Block 42).",
                        "Continuing, the 4Pan1 assay (Decision Block 44) provides a determination as to whether the bacterium present within the specimen is F. tularensis. If a product results (“YES” Branch of Decision Block 44), then F. tularensis is present (Block 46); otherwise (“NO” Branch of Decision Block 44), the bacterium present in the specimen is not F. tularensis and the process ends (Block 48). With a determination that F. tularensis is present within the sample, the assay may be used to further determine the subspecies and subtype (if appropriate) of the F. tularensis within the specimen.",
                        "The 3Pan1 assay (Decision Block 50) may be used to determine whether the F. tularensis subspecies present in the sample is one of the three virulent subspecies. If the assay yields a product (“YES” Branch of Decision Block 50), then at least one of the three virulent subspecies is present (Block 52). If the assay does not yield a product (“NO” Branch of Decision Block 50), then the F. tularensis that is present within the sample may be the novicida subspecies (Block 54); however, such determination is not definitive. For confirmation of the presence of the subspecies novicida (or subsp. novicida nucleic acid), the method may optionally continue (Optional Arrow A) to further determination by one or more of the N1, N2, N3, and N4 assays (Decision Block 56, FIG. 3). If a product results from one or more of these assays (“YES” Branch of Decision Block 56), then the nonvirulent F. tularensis subspecies novicida is present (Block 58).",
                        "Returning again to FIG. 2, and continuing from the observation that at least one virulent strain of F. tularensis is present within the specimen (Block 52), the method continues (Arrow B) into FIG. 3 to determine whether the subspecies of F. tularensis is subsp. tularensis and, if so, which subtype.",
                        "The A1d and A2d assays (Decision Blocks 60 and 62, respectively) enable a determination as to whether the F. tularensis within the specimen is subspecies tularensis subtype A.I or subspecies tularensis subtype A.II, respectively. If either assay yields a product (“YES” Branches of Decision Blocks 60 and 62), then the respective subtype is present within the specimen (Blocks 64 and 66). If further determination is desired (“YES” Branches of Decision Blocks 68 and 70), the methods may continue; otherwise (“NO” Branches of Decision Blocks 68 and 70), the methods end. Yet, if no assay product is observed (“NO” Branches of Decision Blocks 60 and 62), the respective subtype is not present (Blocks 72 and 74) and the process may continue.",
                        "A determination of whether the specimen contains the subspecies holarctica is made using the B2 assay (Decision Block 76). If the reaction yields a product (“YES” Branch of Decision Block 76), then the subspecies holarctica is present (Block 78) and a decision is made as to whether further analysis is desired (Decision Block 80); if no product (“NO” Branch of Decision Block 76), then the subspecies holarctica is not present (Block 82). If desired, the N1, N2, N3, and N4 assay (Decision Block 56) may be used to determine whether the novicida subspecies is present. If no product is observed (“NO” Branch of Decision Block 56), then the M3 assay may be used to determine whether the mediasiatica subspecies is present (Block 84).",
                        "It would be understood by those having ordinary skill in the art that not all assays provided in Table 1 are necessary for every determination. Instead, as shown in FIG. 4, the number and type of assays selected depends on the desired detection level. For example, if the desired detection level is to assess whether the F. tularensis species is present (“SPECIES” Branch of Decision Block 86), then only the U16S and 4PAN1 assays are necessary (Block 88). If further determination of subspecies is desired (“SUBSPECIES” Branch from “SPECIES” Branch of Decision Block 86), then the B2, M3, and at least one of N1, N2, N3, and N4 assay need be used (Block 90). Optionally, in determining subspecies, the 3PAN assay may be used in addition to in or place of the 4PAN1 assay (Block 92). Alternatively, if the virulence of the detected species or subspecies is desired (“VIRULENCE” Branch from “SPECIES” Branch of Decision Block 86), then the 3PAN assays are necessary (Block 94). If subtype is desired, (“SUBTYPE” Branch of Decision Block 86), then U165, 4PAN1 (alternatively or also including 3PAN), MD, and A2C assays are necessary (Block 96). If type is desired (“TYPE” Branch from “SUBTYPE” Branch of Decision Block 86), then the B2 primers and probes are also necessary (Block 98).",
                        "Referring again to FIG. 1, and with the desired detection level and appropriate primers/probes selected (Blocks 30 and 30′) and prepared, an appropriate reaction may be prepared. As to PCR and qPCR, a high stringency conventional PCR reaction may proceed (Blocks 100, 102). As to sequencing, a low stringency PCR may be used (Block 104). The low stringency PCR reaction generates background amplification and permits some miss-priming, which extends the number of products generated by the detectors. The prepare reactions may be executed according to the particular parameters for the equipment and instruments used and as would be understood by the skilled artisan (Block 106) and products of the reactions observed (Block 108). PCR only variants may be scored via intercalating dyes (e.g., SYBR Green) or by directly observing the amplified and stained DNA following gel fractionation, if desired. Amplification using qPCR is diagnostic for the various strain types and hydrolysis of the probe provides a quantitative measurement of the detected genomic DNA that is observed by real-time fluorescence.",
                        "Analysis of the results may be performed according to any one of several different methods (Block 110) and the concentration of amplified DNA may be determined using standard molecular biology methods. The resulting DNA products may then be pooled and sequenced in accordance with the methods and instructions of any given manufacture of sequencer instrumentation. The resulting DNA data may be assembled into theoretical contiguous DNA pieces using any assembler software suited to the task. The assembly corrects errors and removes duplicated data, making the analysis easier.",
                        "Turning now to FIGS. 5, 6A, and 6B, methods of analyzing data from sequencing embodiments of the present invention, Sequencing Reactions (Block 104, FIG. 1), are described. The result of the low stringency PCR techniques may be a complex amplicon library, which may be larger than PCR or RT-PCR variants. Such resultant amplicon library may comprise diagnostic sequences associated with F. tularensis or other, less predictable sequences derived from the genome of other known and/or unknown bacterium within the specimen. Altogether, the amplicon library provides a highly unique fingerprint for each F. tularensis. Collectively the sequencing variant sequences between 600 bases and 3000 bases of DNA from each F. tularensis subspecies.",
                        "For some embodiments of the present invention, the amplicon library may be analyzed according to methods described in U.S. Provisional Application No. 62/474,604, and U.S. application Ser. No. 15/908,765, both entitled METHOD FOR DETECTION AND STRAIN IDENTIFICATION OF KNOWN AND EMERGENT PATHOGENS, by James Baldwin, filed on Feb. 28, 2017 and Feb. 28, 2018, respectively, the details of said application being incorporated herein by reference, in its entirety. One exemplary method 112 is illustrated in FIG. 5A, whereby resultant sequences of the amplicon library may be subjected to in silico filtration and processing. Such filtration may be accomplished using any computing device commonly utilized for such tasks. According to some preferred embodiments of the present invention, the computing device will sequence products in a highly parallel and cost-effective manner. Thus, the computing system may make use of any conventional computer-networking to connect the computing system to at least one server hosting suitable software. Cloud computing is optional in some embodiments.",
                        "At start, sequences of the amplicon library may be optionally filtered (Block 114) so as to remove undesired sequences. Such undesired sequences may include, for example, human DNA or human RNA if the specimen was human in nature. Of the remaining sequences within the filtered amplicon library, a number (n) are randomly selected to form a set (Block 116). While n may vary, and depends largely on the number of sequences within the amplicon library, an n value of 100 may be considered typical.",
                        "The sequences of the set may be compared to known sequences associated with F. tularensis (Block 118). Additionally, or alternatively, although not specifically illustrated herein, the sequences of the set may be searched against an appropriate database, such as a derivative of GenBank using the National Center for Biotechnology Information (“NCBI”) Basic Alignment Search Tool (“BLAST”) or the Bowtie 2 (Johns Hopkins University, Baltimore, Md.) algorithms. The GenBank database contains the completed or partially sequenced genomes for identified F. tularensis strains and related bacteria, including the completed or partially sequenced 16S ribosomal genes for identified bacteria of interest.",
                        "If a sequence within the set maps to an F. Tularensis sequence (or to a larger database if implemented) (“YES” branch of Decision Block 120), then the sequence from the set and an identity of the mapped sequence are logged as “matched” (Block 122). Otherwise, (“NO” branch of Decision Block 124), the sequence from the set is logged as “unmatched” (Block 124).",
                        "With all sequences of the set mapped and logged (Blocks 122, 124), a decision is made as to whether continuation is necessary (Decision Block 126). If continuation is desired, (“YES” branch of Decision Block 126), the method returns such that n samples are again randomly sampled from the amplicon library to form the set (Block 116). If no continuation is needed (“NO” branch of Decision Block 126), for instance, a previous set of sequences did not yield novel result—a new F. tularensis sequence match, a new database match, or a new unmapped sequence—then the process may end.",
                        "Facultative identification determined according to the method 112 of FIG. 5, wherein each sequence of the set may be correlated with known genomes as shown in FIG. 6A. In some instances, which may be probable for sequences associated with the A1d, A2c, B2, and M3 (for example, S1, S4, and S5 of FIG. 6A) the result may be a single hit. Thus, accurate strain identification may be determined if an exact sequence match occurs to an organism in the database or listing of F. tularensis sequences.",
                        "Alternatively, the result may be part of a detection group (an exact or complete sequence match), which is probable for U16S (for example, S2 and S3 of FIG. 6A, wherein an asterisk indicates a group match). For example, a given U16S amplicon product may be a near exact match to many related strains because each strain will possess some homology. As such, the product is not specifically diagnostic, but does identify the presence of bacteria or bacterial nucleic acids. Therefore, the full list of all potential detections in a facultative identification may be reported. Moreover, the U16S assay may provide a DNA barcoding assay of sorts. The enclosed control-barcoding detector, when used with the more specific F. tularensis assays described in accordance with embodiments of the present invention, provides cooperative identification and exclusion effects via multilocus sequencing for every strain in the sample.",
                        "After an entropy score (the number of unique Francisella strains that share this sequence tag) is determined for each sequence in the set, that mapping may be equal to the number of genome/strain matches for that respective sequence. In the illustrated example of FIG. 6A, S1 is provided as an entropy value of 1, S2 is provided as an entropy value of 3, and so forth. For instance, if the entropy score is one, then only one genome/strain is identified and the identity of that genome/strain may be recorded as the closest identification.",
                        "If multiple genomes (or detection groups) are matched by the detected DNA products (as in S2 and S3), then such results may be combined to form a detection group (FIG. 6B). The exact composition of each group may vary due to other sequences in the genome. Should only one strain exist, this “smallest common strain list” can provide the exact identification.",
                        "The following examples illustrate particular properties and advantages of some of the embodiments of the present invention. Furthermore, these are examples of reduction to practice of the present invention and confirmation that the principles described in the present invention are therefore valid but should not be construed as in any way limiting the scope of the invention."
                    ],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "Limit of detection (“LOD”) ranges were dependent on fluorophores and quenchers utilized in the probe and the qPCR instrument used.",
                                "The LOD for the F. tularensis species-, subspecies-, and subtype-specific singleplex qPCR assays ranged from 1 fg to 5 fg of F. tularensis genomic DNA on the JBAIDS or LIGHTCYCLER (F. Hoffman-La Roche AG, Basel, Switzerland), as illustrated in FIGS. 7, 8, 9, 10, 11, 12, and 13. The graphically illustrated data of these figures are provided in Tables 2-8, respectively, below.",
                                "Ten-fold dilutions of F. tularensis genomic DNA of certain tests resulted in a linear standard curve for all of the F. tularensis species-, subspecies, and subtype-specific singleplex qPCR assays, which are specifically illustrated in FIGS. 12A, 14A, 15A, 16A, 17A, 18A, and 19A.",
                                "As illustrated in FIG. 7 and provided in Table 2, below, the 4Pan1 real-time qPCR assay according to embodiments of the present invention detects all four F. tularensis subspecies, including avirulent subspecies novicida. The limit of detection for the 4Pan1 real-time qPCR assay was determined to be less than 3 fg and greater than 1 fg.",
                                "Optimized conditions for 16S assay (5 mM MgCl2, 0.5 μM Forward primer, 0.5 μM Reverse primer, and 0.2 μM TaqMan probe), 20 μL total reaction volume: 7.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 2 μL 16S Forward primer [10 μM], 1.5 μL 16S Reverse primer [10 μM], 1.5 μL 16S-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 8 and provided in Table 3, below, the 3Pan real-time qPCR assay was developed to detect all three of the virulent F. tularensis subspecies and not the avirulent subspecies novicida. The limit of detection for the 3Pan real-time qPCR assay was determined to be less than 1 fg and greater than 0.1 fg, which is 1 genome equivalent.",
                                "Optimized conditions for 4Pan1 assay (5 mM MgCl2, 0.5 μM Forward primer, 0.75 μM Reverse primer, and 0.3 μM TaqMan probe), 20 μL total reaction volume: 8.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL 4Pan1 Forward primer [10 μM], 1.5 μL 4Pan1 Reverse primer [10 μM], 1.5 μL 4Pan1-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 9 and provided in Table 4, below, the A1d real-time qPCR assay was developed to detect the highly virulent F. tularensis subspecies tularensis subtype A.I strains. The limit of detection for the A1d real-time qPCR assay was determined to be less than 7 fg and greater than 5 fg of F. tularensis subspecies tularensis subtype A.I genomic DNA.",
                                "Optimized conditions for 3Pan assay (5 mM MgCl2, 0.5 μM Forward primer, 0.5 μM Reverse primer, and 0.4 μM TaqMan probe), 20 μL total reaction volume: 8.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL 3Pan Forward primer [10 μM], 1 μL 3Pan Reverse primer [10 μM], 2 μL 3Pan-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 10 and provided in Table 5, below, the A2c real-time qPCR assay was developed to detect F. tularensis subspecies tularensis subtype A.II strains. The limit of detection for the A2c real-time qPCR assay was determined to be less than 5 fg and greater than 3 fg of F. tularensis subspecies tularensis subtype A.II genomic DNA.",
                                "Optimized conditions for A1d assay (5 mM MgCl2, 0.5 μM Forward primer, 0.5 μM Reverse primer, and 0.2 μM TaqMan probe), 20 μL total reaction volume: 9.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL A1d Forward primer [10 μM], 1 μL A1d Reverse primer [10 μM], 1 μL A1d-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 11 and provided in Table 6, below, the B2 real-time qPCR assay was developed to detect F. tularensis subspecies holarctica (type B) strains. The limit of detection for the B2 real-time qPCR assay was determined to be less than 5 fg and greater than 3 fg of F. tularensis subspecies holarctica genomic DNA.",
                                "Optimized conditions for A2c assay (5 mM MgCl2, 0.5 μM Forward primer, 0.25 μM Reverse primer, and 0.3 μM TaqMan probe), 20 μL total reaction volume: 9.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL A2c Forward primer [10 μM], 0.5 μL A2c Reverse primer [10 μM], 1.5 μL A2c-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 12 and provided in Table 7, below, the M3 real-time qPCR assay was developed to detect F. tularensis subspecies mediasiatica strains. FIG. 12A is a graphical representation of ten-fold dilutions of F. tularensis genomic DNA resulted in a linear standard curve. The limit of detection for the M3 real-time qPCR assay was determined to be 1 fg of F. tularensis genomic DNA, which is 1 genome equivalent.",
                                "Optimized conditions for B2 assay (5 mM MgCl2, 0.5 μM Forward primer, 0.5 μM Reverse primer, and 0.2 μM TaqMan probe), 20 μL total reaction volume: 9.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL B2 Forward primer [10 μM], 1 μL B2 Reverse primer [10 μM], 1 μL B2-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 13 and provided in Table 8, below, the N1 real-time qPCR assay was developed to detect F. tularensis subspecies novicida strains. The limit of detection for the N1 real-time qPCR assay was determined to be less than 3 fg and greater than 1 fg of F. tularensis subspecies novicida genomic DNA.",
                                "Optimized conditions for M3 assay (5 mM MgCl2, 1 μM Forward primer, 0.75 μM Reverse primer, and 0.3 μM TaqMan probe), 20 μL total reaction volume: 7.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 2 μL M3 Forward primer [10 μM], 1.5 μL M3 Reverse primer [10 μM], 1.5 μL M3-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 14 and provided in Table 9, below, the 4Pan1 real-time qPCR assay was developed to detect all four F. tularensis subspecies, including avirulent subspecies novicida. FIG. 14A is a graphical representation of ten-fold dilutions of F. tularensis genomic DNA resulted in a linear standard curve.",
                                "Optimized conditions for N1 assay (5 mM MgCl2, 0.5 μM Forward primer, 0.75 μM Reverse primer, and 0.4 μM TaqMan probe), 20 μL total reaction volume: 7.9 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL 10×dNTP mix, 1 μL N1 Forward primer [10 μM], 1.5 μL N1 Reverse primer [10 μM], 2 μL N1-P probe [4 μM], 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "As illustrated in FIG. 15 and provided in Table 10, below, the 3Pan real-time qPCR assay was developed to detect the three virulent F. tularensis subspecies, and therefore, excludes avirulent subspecies novicida. FIG. 15A is a graphical representation of ten-fold dilutions of F. tularensis genomic DNA resulted in a linear standard curve.",
                                "As illustrated in FIG. 16 and provided in Table 11, below, the A1d real-time qPCR assay was developed to detect F. tularensis subspecies tularensis subtype A.I strains. FIG. 16A is a graphical representation of ten-fold dilutions of F. tularensis subspecies tularensis subtype A.I genomic DNA resulted in a linear standard curve.",
                                "As illustrated in FIG. 17 and provided in Table 12, below, the A2c real-time qPCR assay was developed to detect F. tularensis subspecies tularensis subtype A.II strains. FIG. 17A is a graphical representation of ten-fold dilutions of F. tularensis subspecies tularensis subtype A.II genomic DNA resulted in a linear standard curve.",
                                "As illustrated in FIG. 18 and provided in Table 13, below, the B2 real-time qPCR assay was developed to detect F. tularensis subspecies holarctica (type B) strains. FIG. 18A is a graphical representation of ten-fold dilutions of F. tularensis subspecies holarctica genomic DNA resulted in a linear standard curve.",
                                "As illustrated in FIG. 19 and provided in Table 14, below, the N1 real-time qPCR assay was developed to detect F. tularensis subspecies novicida strains. FIG. 19A is a graphical representation of ten-fold dilutions of F. tularensis subspecies novicida genomic DNA resulted in a linear standard curve."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe LOD ranges",
                                "illustrate LOD for F. tularensis species assays",
                                "provide graphically illustrated data",
                                "describe linear standard curve for F. tularensis species assays",
                                "illustrate 4Pan1 real-time qPCR assay",
                                "provide optimized conditions for 16S assay",
                                "illustrate 3Pan real-time qPCR assay",
                                "provide optimized conditions for 4Pan1 assay",
                                "illustrate A1d real-time qPCR assay",
                                "provide optimized conditions for 3Pan assay",
                                "illustrate A2c real-time qPCR assay",
                                "provide optimized conditions for A1d assay",
                                "illustrate B2 real-time qPCR assay",
                                "provide optimized conditions for A2c assay",
                                "illustrate M3 real-time qPCR assay",
                                "provide optimized conditions for B2 assay"
                            ],
                            "num_characters": 8407,
                            "outline_medium": [
                                "describe LOD ranges",
                                "illustrate LOD for F. tularensis species assays",
                                "provide optimized conditions for 16S assay",
                                "illustrate LOD for 3Pan real-time qPCR assay",
                                "provide optimized conditions for 4Pan1 assay",
                                "illustrate LOD for A1d real-time qPCR assay",
                                "provide optimized conditions for 3Pan assay",
                                "illustrate LOD for other F. tularensis subspecies assays"
                            ],
                            "outline_short": [
                                "describe qPCR assays",
                                "illustrate LOD ranges",
                                "provide optimized conditions",
                                "show graphical representations"
                            ]
                        },
                        {
                            "title": "Example 2",
                            "paragraphs": [
                                "A multiplex “Tier 1” real-time qPCR assay was developed to detect all bacteria (universal 16S rDNA U16S target), all four F. tularensis subspecies including avirulent novicida (4Pan1 target), all three F. tularensis subspecies excluding avirulent novicida (3Pan target), and the most virulent F. tularensis strains, specifically subtype A.I strains (A1d target). Assessment of the limit of detection (LOD) for each of the targets in the “Tier 1” multiplex real-time qPCR assay on the 7500 Fast Dx cycler showed that the LOD was greater than 50 fg and less than 30 fg for the 16S rDNA (U16S) target, less than 10 fg to greater than 1 fg for the 4Pan1 target, less than 30 fg to greater than 10 fg for the 3Pan target, and less than 30 fg to greater than 10 fg for the A1d target with F. tularensis subspecies tularensis subtype A.I genomic DNA.",
                                "The LOD for 16S rDNA endogenous internal control in the multiplex qPCR assays ranged from 50 fg to 100 fg on the ABI 7500 Fast Dx (Applied Biosystems) and 3M Integrated (Focus Diagnostics) platforms. Ten-fold dilutions of F. tularensis subspecies tularensis subtype A.I genomic DNA resulted in a linear standard curve for all four targets, specifically the universal 16S rDNA (U16S), 4Pan1, 3Pan, and A1d, in the multiplex “Tier 1” real-time qPCR assay.",
                                "A multiplex “Tier 1” real-time qPCR assay was developed to detect all bacteria (universal 16S rDNA target U16S), all four F. tularensis subspecies including avirulent novicida (4Pan1 target), all three F. tularensis subspecies excluding avirulent novicida (3Pan target), and the most virulent F. tularensis strains, specifically subtype A.I strains (A1d target). Ten-fold dilutions of F. tularensis subspecies tularensis subtype A.I genomic DNA resulted in a linear standard curve for all four targets, specifically the universal 16S rDNA (U16S) (FIG. 20A), 4Pan1 (FIG. 20B), 3Pan (FIG. 20C), and A1d (FIG. 20D), in the multiplex “Tier 1” real-time qPCR assay. Assessment of the LOD for each of the targets in the “Tier 1” multiplex real-time qPCR assay on the 7500 Fast Dx cycler showed that the LOD was less than 100 fg and greater than 70 fg for the 16S rDNA target (U16S), less than 10 fg and greater than 1 fg for the 4Pan1 target, less than 30 fg and greater than 10 fg for the 3Pan target, and less than 30 fg and greater than 10 fg for the A1d target with F. tularensis subspecies tularensis subtype A.I genomic DNA.",
                                "A multiplex “Tier 2” real-time PCR assay was developed to detect all bacteria (universal 16S rDNA target) and to differentiate F. tularensis subspecies tularensis subtype A.II (A2c target), F. tularensis subspecies holarctica, also referred to as type B (B2 target), and F. tularensis subspecies mediasiatica (M3 target). Ten-fold dilutions of the appropriate and designated F. tularensis genomic DNA resulted in a linear standard curve for all four targets, specifically the universal 16S rDNA (U16S) (FIG. 21A), A2c (FIG. 21B), B2 (FIG. 21C), and M3 (FIG. 21D), in the multiplex “Tier 2” real-time qPCR assay. The LOD for the multiplex “Tier 2” real-time qPCR assay targeting 16S rDNA (U16S) was determined to be 10 fg for subtype A.II, 30 fg for type B, and 50 fg for subspecies mediasiatica. The LOD for the multiplex “Tier 2” real-time qPCR assay targeting A2c was determined to be 10 fg for subtype A.II. The LOD for the multiplex “Tier 2” real-time qPCR assay targeting B2 was determined to be 30 fg for type B. The LOD for the multiplex “Tier 2” real-time qPCR assay targeting M3 was determined to be 10 fg for subspecies mediasiatica.",
                                "Optimized conditions for the Multiplex Tier 1 Real-Time PCR assay, 20 μL total reaction volume: 4.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL dNTP mix [2 mM each], 2 μL U16S 10× stock, 2 μL 4Pan1 10× stock, 2 μL 3Pan 10× stock, 2 μL A1d 10× stock, 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "The U16S 10× stock comprising (5 μM Forward Primer, 5 μM Reverse Primer, and 2 μM TaqMan Probe): 5 μL 16S-Forward primer [100 μM], 5 μL 16S-Reverse primer [100 μM], 2 μL Quasar670-16S-BHQ3 TaqMan probe [100 μM], and 88 μL TE buffer at pH 8.0.",
                                "The 4Pan1 10× stock comprising (5 μM Forward Primer, 7.5 μM Reverse Primer, and 4 μM TaqMan Probe): 5 μL 4Pan1-Forward primer [100 μM], 7.5 μL 4Pan1-Reverse primer [100 μM], 4 μL TxRd-4Pan1-BHQ2 TaqMan probe [100 μM], and 83.5 μL TE buffer at pH 8.0.",
                                "The 3Pan 10× stock comprising (5 μM Forward Primer, 5 μM Reverse Primer, and 5 μM TaqMan Probe): 5 μL 3Pan-Forward primer [100 μM], 5 μL 3Pan-Reverse primer [100 μM], 5 μL HEX-3Pan-BHQ1 TaqMan probe [100 μM], and 85 μL TE buffer at pH 8.0.",
                                "The A1d 10× stock comprising (5 μM Forward Primer, 5 μM Reverse Primer, and 2 μM TaqMan Probe): 5 μL A1d-Forward primer [100 μM], 5 μL A1d-Reverse primer [100 μM], 2 μL FAM-A1d-BHQ1 TaqMan probe [100 μM], and 88 μL TE buffer at pH 8.0.",
                                "The specificities of the singleplex and multiplex F. tularensis species-, subspecies-, and subtype-specific qPCR assays were verified by evaluating an inclusivity test panel containing other bacterial species and closely related species (e.g., F. philomiragia and F. persica), as well as environmental ticks known to harbor Francisella-like bacteria (noted in Table 18, below).",
                                "Optimized conditions for the Multiplex Tier 2 Real-Time PCR assay, 20 μL total reaction volume: 4.4 μL sterile water, 2 μL 10×PCR Buffer, 2 μL MgCl2 [50 mM], 2 μL dNTP mix [2 mM each], 2 μL U16S 10× stock, 2 μL 4Pan1 10× stock, 2 μL 3Pan 10× stock, 2 μL A1d 10× stock, 0.5 μL BSA [10 mg/mL], 0.1 μL Platinum Taq [5 U/μL], and 1 μL DNA template.",
                                "The U16S 10× stock comprising (5 μM Forward Primer, 5 μM Reverse Primer, and 1 μM TaqMan Probe): 5 μL 16S-Forward primer [100 μM], 5RL 16S-Reverse primer [100 μM], 1 μL Quasar670-16S-BHQ3 TaqMan probe [100 μM], and 89 μL TE buffer at pH 8.0.",
                                "The A2c 10× stock comprising (5 μM Forward Primer, 2.5 μM Reverse Primer, and 3 μM TaqMan Probe): 5 μL A2c-Forward primer [100 μM], 2.5 μL A2c-Reverse primer [100 μM], 3 μL FAM-A2c-BHQ1 TaqMan probe [100 μM], and 89.5 μL TE buffer at pH 8.0.",
                                "The B2 10× stock comprising (5 μM Forward Primer, 5 μM Reverse Primer, and 6 μM TaqMan Probe): 5 μL B2-Forward primer [100 μM], 5 μL B2-Reverse primer [100 plV1], 6 μL TxRd-B2-BHQ2 TaqMan probe [100 μM], and 84 μL TE buffer at pH 8.0.",
                                "The M3 10× stock comprising (10 μM Forward Primer, 7.5 μM Reverse Primer, and 5 μM TaqMan Probe): 10 μL M3-Forward primer [100 μM], 7.5 μL M3-Reverse primer [100 μM], 5 μL JOE-M3-BHQ1 TaqMan probe [100 μM], and 77.5 μL TE buffer at pH 8.0",
                                "Currently, capability to rapidly differentiate among pathogens of operational significance in forward deployed areas is limited. To meet this gap, molecular-diagnostic testing, including singleplex subspecies differentiating real-time quantitative PCR (qPCR) assays, multiplex qPCR assays, and those that are sequence-based are proposed. These methodologies provide a set of tools to combat the threat of infection in a deployed scenario by allowing more accurate field detection of the F. tularensis pathogen. Consequently, method described herein according to embodiments of the present invention offer several improvements in the art of pathogen detection by providing a test that may be operated with PCR, qPCR, and sequencing technology. The method allows for the rapid deployment of robust assays with no foreknowledge requirement and provides unprecedented levels of organism detection.",
                                "The method can provide precise identification of even new and previously unobserved pathogens by their DNA sequence. Ultimately, such tools are an essential part of future etiological detection of disease and the epidemiology of pathogens in, but not limited to, the recruit and enlisted populations and emergency first responders, as well as the environment.",
                                "Because the four F. tularensis subspecies and the two type-A subtypes differ considerably in virulence, correctly identifying the stain type is critical for the appropriate response to a detection event. The PCR-based and sequence-based methods described herein are a vast improvement over other current assays, since this method can identify and differentiate the virulent F. tularensis strains from avirulent F. tularensis strains and other closely related nonpathogenic species, such as F. philomiragia, F. persica, and Francisella-like endosymbionts known to exist in ticks and other arthropod and insects (e.g., mosquitoes and deer. flies). Thus the method as described according to the various embodiments herein (i) can differentiate the four F. tularensis subspecies and two type-A subtypes in PCR-based assays, real-time quantitative singleplex PCR assays, or real-time quantitative multiplex PCR assays without the need for a scoring matrix, (ii) can detect strain variation and is operable in a sequencing, PCR and/or real-time quantitative PCR based method, and (iii) is adaptable for the identification of emerging or novel pathogens of operational concern.",
                                "Methods according to the embodiments described herein enable a skilled operator of the JBAIDS, a fielded real-time quantitative PCR (qPCR) instrument, or other PCR-based platforms and sequencing devices to provide efficient and reliable subspeciation, subtyping, or both of F. tularensis with very low false-positive and false-negative rates (less than 2%). Embodiments of the method may comprise one or more multiplex assays or up to seven independent assays having one target each for speciation, subspeciation, subtyping, or a combination thereof.",
                                "All embodiments of the present invention provide no less than 95% accuracy of the identity of the F. tularensis subspecies or subspecies tularensis subtypes A.I and A.II. Sequencing-based assays may follow qPCR and provide the same or enhanced accuracy for subspeciation, subtyping, and strain identification.",
                                "Successful development of the sequence-based assay is important because unlike PCR, leveraging direct observation of DNA sequence is the most precise way to barcode the tested organisms. These sequences may be used to identify, track, or dismiss the source of the infectious agent.",
                                "Methods according to the various embodiments described herein offer a very high degree of precision in strain typing. Variants may be observed with considerably more granularity than other convention methods for F. tularensis via SNP profiling, closely related relatives, and other organisms. No less than 20 discreetly identifiable groups may be observed, which enables an operator to identify and track a particular pathogen release with great precision that is not attainable with PCR or qPCR alone.",
                                "While the present invention has been illustrated by a description of one or more embodiments thereof and while these embodiments have been described in considerable detail, they are not intended to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. The invention in its broader aspects is therefore not limited to the specific details, representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the scope of the general inventive concept."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "develop multiplex real-time qPCR assay",
                                "detect all bacteria and F. tularensis subspecies",
                                "assess limit of detection for each target",
                                "determine linear standard curve for all targets",
                                "develop multiplex \"Tier 2\" real-time qPCR assay",
                                "detect all bacteria and differentiate F. tularensis subspecies",
                                "determine linear standard curve for all targets",
                                "assess limit of detection for each target",
                                "optimize conditions for Multiplex Tier 1 Real-Time PCR assay",
                                "describe U16S 10× stock composition",
                                "describe 4Pan1 10× stock composition",
                                "describe 3Pan 10× stock composition",
                                "describe A1d 10× stock composition",
                                "verify specificity of singleplex and multiplex qPCR assays",
                                "optimize conditions for Multiplex Tier 2 Real-Time PCR assay",
                                "describe U16S 10× stock composition",
                                "describe A2c 10× stock composition",
                                "describe B2 10× stock composition",
                                "describe M3 10× stock composition",
                                "motivate molecular-diagnostic testing",
                                "describe advantages of method",
                                "provide disclaimer for scope of invention"
                            ],
                            "num_characters": 11312,
                            "outline_medium": [
                                "develop multiplex real-time qPCR assay",
                                "assess limit of detection for each target",
                                "describe linear standard curve for all four targets",
                                "develop multiplex \"Tier 2\" real-time qPCR assay",
                                "describe optimized conditions for multiplex assays",
                                "verify specificity of singleplex and multiplex qPCR assays",
                                "motivate need for rapid pathogen detection",
                                "describe advantages of molecular-diagnostic testing",
                                "outline capabilities of method for pathogen detection",
                                "highlight importance of accurate strain identification",
                                "discuss scope and limitations of the invention"
                            ],
                            "outline_short": [
                                "develop multiplex qPCR assay",
                                "determine limit of detection for targets",
                                "optimize conditions for multiplex Tier 1 and Tier 2 Real-Time PCR assays",
                                "verify specificity of qPCR assays",
                                "describe advantages of method for pathogen detection"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce F. tularensis detection assays",
                        "describe singleplex qPCR and multiplex qPCR assays",
                        "specify instruments compatible with qPCR assays",
                        "describe PCR amplification followed by DNA sequence-based genotyping",
                        "explain qualitative amplicon exact sequence detection",
                        "describe non-specific detector embodiments with SNPs",
                        "introduce method 20 of detecting F. tularensis species, subspecies, or subtype",
                        "obtain suspect specimen",
                        "extract genomic DNA from specimen",
                        "perform PCR or qPCR depending on method employed",
                        "select and prepare primers and probes for qPCR",
                        "select and prepare primers for PCR sequencing",
                        "determine desired detection level",
                        "select at least one assay from a plurality of assays",
                        "describe individual assays of Table 1",
                        "explain genomic signatures of Table 1",
                        "describe primers and probes annealing to chromosomal regions",
                        "explain each assay yields information for strain determination",
                        "describe negative control assay sequence",
                        "describe positive control assay sequence",
                        "validate absence of inhibitors",
                        "describe modified, universal 16S ribosomal DNA assay",
                        "describe 4Pan1 assay sequences",
                        "describe 3Pan assay sequences",
                        "describe A1d, A2c, B2, and M3 assay sequences",
                        "describe N1, N2, N3, and N4 assay sequences",
                        "conclude detection of F. tularensis subspecies and subtypes",
                        "describe N4 assay sequences",
                        "describe targeted region in N4 assay",
                        "describe primer and probe employment",
                        "illustrate flowchart of method of analyzing results",
                        "describe start of flowchart",
                        "describe determination of contamination",
                        "describe determination of bacterium presence",
                        "describe confirmation of reaction failure",
                        "describe 4Pan1 assay",
                        "describe determination of F. tularensis presence",
                        "describe 3Pan1 assay",
                        "describe determination of virulent subspecies",
                        "describe N1, N2, N3, and N4 assays",
                        "describe determination of novicida subspecies",
                        "describe A1d and A2d assays",
                        "describe determination of tularensis subtype",
                        "describe B2 assay",
                        "describe determination of holarctica subspecies",
                        "describe M3 assay",
                        "describe determination of mediasiatica subspecies",
                        "describe selection of assays based on detection level",
                        "describe preparation of reaction",
                        "describe PCR and qPCR reactions",
                        "describe sequencing reaction",
                        "describe analysis of results",
                        "describe sequencing data analysis",
                        "describe filtration and processing of sequences",
                        "describe comparison of sequences to known F. tularensis sequences",
                        "describe facultative identification of F. tularensis sequences"
                    ],
                    "num_characters": 28722,
                    "outline_medium": [
                        "introduce F. tularensis detection assays",
                        "describe qPCR and sequencing methods",
                        "outline instrument compatibility",
                        "explain detection of amplicon exact sequences",
                        "describe non-specific detector embodiments",
                        "illustrate method of detecting F. tularensis species",
                        "detail genomic DNA extraction and PCR methods",
                        "explain primer and probe selection and preparation",
                        "describe assay composition and formulation",
                        "outline detection of F. tularensis variants",
                        "detail individual assays and their targets",
                        "explain negative and positive control assays",
                        "describe modified universal 16S ribosomal DNA assay",
                        "describe N4 assay sequences",
                        "describe targeted region in N4 assay",
                        "describe primer and probe employment",
                        "illustrate flowchart for analyzing results",
                        "describe contamination quality control check",
                        "describe bacterium presence determination",
                        "describe F. tularensis subspecies determination",
                        "describe virulent subspecies determination",
                        "describe nonvirulent subspecies determination",
                        "describe subspecies tularensis subtype determination",
                        "describe detection level selection",
                        "describe reaction preparation and execution",
                        "describe sequencing reaction and data analysis",
                        "describe facultative identification method"
                    ],
                    "outline_short": [
                        "describe qPCR assay embodiments",
                        "outline method of detecting F. tularensis species",
                        "detail primer and probe selection and preparation",
                        "explain assay variants and detection levels",
                        "describe specific assays for F. tularensis subspecies and subtypes",
                        "discuss control assays and validation methods",
                        "describe N4 assay sequences",
                        "illustrate method of analyzing results",
                        "describe flowchart for determining F. tularensis subspecies",
                        "outline selection of assays based on desired detection level",
                        "describe PCR and qPCR reactions",
                        "illustrate method of analyzing sequencing data",
                        "describe facultative identification of F. tularensis sequences"
                    ]
                }
            ],
            "outline_long": [
                "incorporate prior applications"
            ],
            "num_characters": 330,
            "outline_medium": [
                "incorporate prior applications"
            ],
            "outline_short": [
                "incorporate prior applications"
            ]
        }
    ],
    "claims": [
        "1. A method for determining whether to issue a Tularemia health advisory, the method comprising:\ncollecting a specimen from a possible exposure;\ndetecting and distinguishing Francisella tularensis (F. tularensis) subsp. tularensis subtypes A.I or F. tularensis subsp. tularensis subtype A.I. nucleic acid and F. tularensis subsp. tularensis A.II or F. tularensis subsp. tularensis subtype AIL nucleic acid in the specimen by performing a first assay, a second assay, a third assay, a fourth assay, a fifth assay, a sixth assay, a seventh assay, an eighth assay, a ninth assay, and a tenth assay:\nthe first assay comprising a first plurality of primers comprising SEQ ID NO 4 and SEQ ID NO 5, and a first probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 6;\nthe second assay comprising a second plurality of primers comprising SEQ ID NO 7 and SEQ ID NO 8, and a second probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 9;\nthe third assay comprising a third plurality of primers comprising SEQ ID NO 10 and SEQ ID NO 11, and a third probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 12;\nthe fourth assay comprising a fourth plurality of primers comprising SEQ ID NO 13 and SEQ ID NO 14, and a fourth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 15;\nthe fifth assay comprising a fifth plurality of primers comprising SEQ ID NO 16 and SEQ ID NO 17, and a fifth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 18;\nthe sixth assay comprising a sixth plurality of primers comprising SEQ ID NO 19 and SEQ ID NO 20, and a sixth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 21;\nthe seventh assay comprising a seventh plurality of primers comprising SEQ ID NO 22 and SEQ ID NO 23, and a seventh probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 24;\nthe eighth assay comprising an eighth plurality of primers comprising SEQ ID NO 25 and SEQ ID NO 26, and an eighth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 27;\nthe ninth assay comprising a ninth plurality of primers comprising SEQ ID NO 28 and SEQ ID NO 29, and a ninth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 30; and\nthe tenth assay comprising a tenth plurality of primers comprising SEQ ID NO 31 and SEQ ID NO 32, and a tenth probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 33; and\nif the first probe, the second probe, the third probe, the fourth probe, the fifth probe, the sixth probe, or a combination is detected, then a virulent F. tularensis exposure is confirmed and a health advisory is issued, or\nif the seventh probe, the eighth probe, the ninth probe, the tenth probe, or a combination thereof is detected without detection of the first probe, the second probe, the third probe, the fourth probe, the fifth probe, the sixth probe, then an avirulent F. yularensis exposure is confirmed and no health advisory is issued.",
        "2. The method of claim 1, further comprising:\na control assay comprising an eleventh plurality of primers comprising SEQ ID NO 1 and SEQ ID NO 2, an eleventh probe comprising a fluorescent reporter dye coupled to an initial 5′-nucleotide of SEQ ID NO 3."
    ]
}