{
    "id": "US20190175549",
    "authors": [
        "Nicolas Pietrancosta",
        "Nikaïa Smith",
        "Jean-Philippe Herbeuval"
    ],
    "title": "CXCR4 RECEPTOR-BINDING COMPOUNDS USEFUL FOR INCREASING INTERFERON LEVEL",
    "date": "2017-06-16 00:00:00",
    "abstract": "The invention relates to a CXCR4 receptor-binding compound for use for increasing or restoring interferon (IFN) level in an individual, wherein the interferon is a type-I interferon (IFN-I).",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The invention relates to compounds for use for increasing, in particular restoring, interferon (IFN) level in an individual."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to compounds"
                    ],
                    "num_characters": 124,
                    "outline_medium": [
                        "relate to compounds for increasing interferon level"
                    ],
                    "outline_short": [
                        "relate to compounds for increasing interferon level"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "There are numerous situations where increasing or restoring interferon level, especially type I interferon level, can be beneficial for an individual.",
                        "This may be the case for a viral infection of course, but also for certain autoimmune diseases such as type-I diabetes, rheumatoid arthritis or multiple sclerosis, as well as diabetes, allergy or cancer.",
                        "Indeed, it has been shown that there was a reduced secretion of IFN-a by blood dendritic cells in human diabetes (Summer et al. (2006) Clinical Immunology, 121:81-89). Besides, recombinant type I interferon (IFN-I), especially IFN-β, is currently used as a treatment for multiple sclerosis, in particular relapsing multiple sclerosis (Weinstock-Guttman (2008) Expert Opin Biol Ther 8:1435-1447).",
                        "However, its use requires frequent subcutaneous or intramuscular injections, from every other day to every two weeks for the most recent pegylated form of IFN-β (Plegridy®), rendering the treatment difficult to follow for the treated individuals. Besides, as with most treatment with recombinant proteins, individuals often develop an immune response against the administered protein which diminishes the effectivity of the treatment on the long run.",
                        "It is thus an aim of the present invention to provide compounds for increasing or restoring IFN level, in particular IFN-I, in an individual overcoming these problems."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate interferon level increase",
                        "limitations of current treatments"
                    ],
                    "num_characters": 1373,
                    "outline_medium": [
                        "motivate need for increasing interferon level"
                    ],
                    "outline_short": [
                        "motivate need for increasing interferon level"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention arises from the unexpected finding by the inventors that AMD3100 treatment could restore Type I interferon production by HIV-activated plasmacytoid dendritic cells inhibited by other compounds.",
                        "Thus, the present invention relates to a CXCR4 receptor-binding compound for use for increasing, in particular restoring, interferon (IFN) level in an individual, in particular type-I interferon (IFN-I) level, more particularly interferon-alpha (IFN-a) and/or interferon-beta (IFN-β) level.",
                        "The present invention also relates to the CXCR4 receptor-binding compound for use according to the invention, for increasing, in particular restoring, interferon (IFN) secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, by immune cells, in particular plasmacytoid dendritic cells, monocytes or Natural Killer (NK) cells.",
                        "The invention also relates to the CXCR4 receptor-biding compound for use according to the invention in the prevention or treatment of a disease selected from the group consisting of a viral infection, an opportunistic infection, allergy, rheumatoid arthritis, multiple sclerosis, a cancer with an overproduction of spermine, depression-induced immunosuppression and diabetes.",
                        "The present invention also relates to a method for increasing, or restoring, interferon (IFN) level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual, comprising administering to the individual an effective amount of at least one CXCR4 receptor-binding compound.",
                        "The present invention also relates to a method for increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, by immune cells, in particular plasmacytoid dendritic cells, monocytes and NK cells in an individual, comprising administering to the individual an effective amount of at least one CXCR4 receptor-binding compound.",
                        "The present invention further relates to a method for the prevention or treatment of a disease selected from the group consisting of a viral infection, an opportunistic infection, allergy, rheumatoid arthritis, multiple sclerosis, a cancer with an overproduction of spermine, depression-induced immunosuppression and diabetes, comprising administering to the individual a prophylactically or therapeutically effective amount of at least one CXCR4 receptor-binding compound according to the invention.",
                        "The invention also relates to the in vitro use of a CXCR4 receptor-binding compound according to the invention, for increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, by plasmacytoid dendritic cells, monocytes and NK cells.",
                        "The invention also relates to an in vitro screening method for identifying compounds for increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, in an individual from candidate compounds, wherein the candidate compounds are CXCR4 receptor-binding compounds according to the invention.",
                        "The invention also relates to an in vitro screening method for identifying compounds for increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, in an individual from candidate compounds, comprising:",
                        "binding a CXCR4 receptor with a detectable CXCR4 receptor-binding compound according to the invention;",
                        "contacting the CXCR4 receptor bound to the detectable CXCR4 receptor-binding compound with a candidate compound;",
                        "selecting the candidate compound which increase the binding of the detectable CXCR4 receptor-binding compound to the CXCR4 receptor, thereby identifying a compound for restoring IFN level.",
                        "The invention also relates to an in vitro screening method for identifying compounds for increasing, in particular restoring, IFN level in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual from candidate compounds, comprising the steps of:",
                        "contacting blood cells with a candidate compound;",
                        "determining the level of secretion of IFN by the contacted blood cells;",
                        "comparing the determined level of secretion of IFN to the level of expression of IFN by blood cells contacted by a reference compound;",
                        "selecting the candidate compound which have a decreased, increased or similar level of expression of IFN with respect to the reference compound, thereby identifying a compound for increasing IFN level,",
                        "wherein the reference compound is a CXCR4 receptor-binding compound according to the invention, in particular AMD3100.",
                        "The invention also relates to an in silico method for screening compounds from candidate compounds, or for designing compounds, for increasing, in particular restoring, IFN level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual, comprising a computer-implemented step of determining if a designed compound or a candidate compound interacts with at least 6 amino acids of a CXCR4 receptor represented by SEQ ID NO: 1, wherein the amino acids are selected from the group consisting of alanine 175, aspartic acid 171, aspartic acid 262, phenylalanine 174, valine 196, glycine 207, tyrosine 255, tyrosine 256, isoleucine 259, serine 263 and glutamic acid 288."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "unexpected finding on AMD3100",
                        "define CXCR4 receptor-binding compound",
                        "application of compound for IFN level increase",
                        "application of compound for IFN secretion increase",
                        "application of compound for disease prevention/treatment",
                        "method for IFN level increase",
                        "method for IFN secretion increase",
                        "method for disease prevention/treatment",
                        "in vitro use of compound",
                        "in vitro and in silico screening methods"
                    ],
                    "num_characters": 5392,
                    "outline_medium": [
                        "introduce CXCR4 receptor-binding compound",
                        "application of compound for increasing interferon level",
                        "application of compound for increasing interferon secretion",
                        "application of compound for preventing or treating diseases",
                        "embodiment of in vitro and in silico methods"
                    ],
                    "outline_short": [
                        "introduce CXCR4 receptor-binding compound",
                        "outline various uses of the compound"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "As intended herein, the term “comprising” has the meaning of “including” or “containing”, which means that when an object “comprises” one or several elements, other elements than those mentioned may also be included in the object. In contrast, when an object is said to “consist of” one or several elements, the object is limited to the listed elements and cannot include other elements than those mentioned."
                    ],
                    "subsections": [
                        {
                            "title": "CXCR4 Receptor-Binding Compound",
                            "paragraphs": [
                                "As known in the art, the “CXCR4 receptor” is the C-X-C chemokine receptor type 4 also known as fusin or CD184. As intended herein, the expression “CXCR4 receptor” is equivalent to “CXCR4”. Preferably, the CXCR4 receptor according to the invention is a human CXCR4 receptor. CXCR4 is notably represented by SEQ ID NO: 1.",
                                "A CXCR4 receptor-binding compound according to the invention can either be known in the art to bind to CXCR4 or it can be determined that it binds to CXCR4. Determining that a compound binds to CXCR4 can be performed by numerous ways known to one of skill in the art. By way of example, CXCR4 binding is assessed by flow cytometry analysis. This procedure is explained in more details in the following Example.",
                                "Preferably, the CXCR4 receptor-binding compound according to the invention comprises from 1 to 45 carbon atoms and at least one amine group positively charged at a pH from 6 to 8, in particular at a pH from 7.0 to 7.8, more particularly at a physiological blood pH of a human individual.",
                                "Preferably, the CXCR4 receptor-binding compound according to the invention interacts with at least 5, 6, 7, 8, 9, 10 or 11 amino acids of a CXCR4 receptor represented by SEQ ID NO: 1, wherein the amino acids are selected from the group consisting of alanine 175, aspartic acid 171, aspartic acid 262, phenylalanine 174, valine 196, glycine 207, tyrosine 255, tyrosine 256, isoleucine 259, serine 263 and glutamic acid 288.",
                                "The above-defined amino acids have been identified by the present inventors as defining the binding site on the CXCR4 receptor responsible for increasing, in particular restoring, IFN secretion by immune cells, in particular plasmacytoid dendritic cells, monocytes and NK cells. Besides, as should be clear to one of skill in the art, SEQ ID NO: 1 is only meant as a reference sequence to unequivocally define the positions of the amino acids of the CXCR4 receptor involved in the binding of the CXCR4 receptor-binding compound according to the invention. Accordingly, SEQ ID NO: 1 is not meant to limit the CXCR4 receptors according to the invention. Indeed, the CXCR4 receptor-binding compounds according to the invention can also bind to the above-defined amino acids in variants, mutants or truncated forms of the CXCR4 receptor or in proteins or polypeptides comprising the CXCR4 receptor, which may change the absolute position of the amino acids in said variants, mutants or truncated forms or proteins or polypeptides, but not their function.",
                                "The CXCR4 receptor-binding compound according to the invention may in particular be a natural amine or a synthetic amine, a monoamine or a polyamine.",
                                "In an embodiment, the CXCR4 receptor-binding compound according to the invention is a compound of the following formula (I):",
                                "Z—R-A-R′—Y   (I)",
                                "wherein:\n\n\n- - Z and Y, which are identical or different, represent:\n    - an alkyl group having from 1 to 6 carbon atoms, optionally\n      substituted by a hydroxyl group, an ethylene, a halogen atom, a CN\n      group, a CF₃ group, a SO group, a NO₂ group, an amine group, a\n      difluor or an alkyl, S-alkyl or O-alkyl group having from 1 to 6\n      carbon atoms, or\n    - an aryl or heteroaryl group having from 3 to 6 carbon atoms,\n      optionally substituted by a hydroxyl group, an ethylene, a halogen\n      atom, a CN group, a CF₃ group, a SO group, a NO₂ group, an amine\n      group, a difluor or an alkyl, S-alkyl or O-alkyl group having from\n      1 to 6 carbon atoms, or\n    - a cyclic or heterocyclic polyamine group having from 9 to 32 ring\n      members and from 3 to 8 amine groups in the ring spaced by 2 or\n      more carbon atoms from each other, optionally comprising an aryl\n      or heteroaryl group having from 3 to 6 carbon atoms, a heteroatom\n      or a heteroelement, and optionally substituted by a halogen atom,\n      a hydroxyl group, a heteroatom, a heteroelement, an alkyl, S-alkyl\n      or O-alkyl group having from 1 to 6 carbon atoms or an aryl or\n      heteroaryl group having from 3 to 6 carbon atoms, and\n  - A represents an aryl or heteroaryl group having from 3 to 12 carbon\n    atoms, and\n  - R and R′, which are identical or different, represent an alkyl group\n    having from 1 to 6 carbon atoms or a R₁NR₂R₃ group, and\n  - R₁ represents a single bond or an alkyl group having from 1 to 6\n    carbon atoms, and\n  - R₂ and R₃, which are identical or different, represent a hydrogen\n    atom, an amine group, an alkyl group having from 1 to 6 carbon atoms\n    or an aryl or heteroaryl group having from 3 to 6 carbon atoms,\n    optionally substituted by an alkyl group having from 1 to 6 carbon\n    atoms,  \n    or a pharmaceutically acceptable salt and/or hydrate thereof.",
                                "Preferably, the compound of formula (I) as defined above is selected form the compounds shown in FIG. 17 and FIG. 18 of the article of Debnath et al. (2013) Theranostics 3:47-75.",
                                "More preferably, the compound of formula (I) as defined above is selected form the group consisting of:",
                                "and",
                                "Preferably, the CXCR4 receptor-binding compound according to the invention is a compound of formula (I), wherein:\n\n\n- - Z and Y are identical and represent cyclic polyamine moieties having\n    from 9 to 20 ring members and from 3 to 6 amine groups in the ring\n    spaced by 2 or more carbon atoms from each other, and\n  - A represents an aromatic or heteroaromatic group having from 3 to 8\n    carbon atoms, and\n  - R and R′, which are identical or different, represent a methylene\n    linked to a nitrogen atom of Z or Y, the nitrogen atoms being\n    otherwise unsubstituted.",
                                "Preferably, the compound of formula (I) as defined above is plerixafor:",
                                "Compound of formula (I) according to the invention can be readily synthesized by one of skill in the art, as is in particular described in international application WO204/125499.",
                                "In still another embodiment, the CXCR-4 receptor-binding compound according to the invention is a compound of the following formula (II):",
                                "wherein:\n\n\n- - D₁ and D₂, which may be identical or different, represent:\n    - an alkyl group having from 1 to 6 carbon atoms optionally\n      substituted by at least one hydroxyl group, a halogen atom, a CF₃\n      group, a CN group, an amine group, or an alkyl, O-alkyl or S-alkyl\n      group having from 1 to 12 carbon atoms, or\n    - an aryl, an heteroaryl, a cycloalkyl, a heterocycloalkyl, an\n      alkylaryl, an alkylheteroaryl, or an alkylheteropolyaryl group\n      having from 3 to 12 carbon atoms, optionally substituted by at\n      least one hydroxyl group, halogen atom, CF₃ group, CN group, amine\n      group, or alkyl, O-alkyl or S-alkyl group having from 1 to 12\n      carbon atoms, or\n    - D₁ and D₂ are linked together to form a N-containing aryl or\n      heteroaryl group having from 3 to 12 carbon atoms and optionally\n      substituted by at least one amine group optionally substituted by\n      an alkylheteroaryl, group having from 3 to 12 carbon atoms, and\n  - X represents:\n    - an alkyl group having from 1 to 6 carbon atoms, or\n    - —R₄—Y—R₅— wherein, R₄ and R₅ which are identical or different\n      represent an alkyl group having from 1 to 6 carbon atoms and Y\n      represents an aryl or heteroaryl group having from 3 to 6 carbon\n      atoms, optionally substituted by a halogen atom, a hydroxyl group,\n      an amide group, an amine group, an alkoxy group, an ester group, a\n      CF₃ group, a CN group or an alkyl, O-alkyl or S-alkyl group having\n      from 1 to 6 carbon atoms optionally substituted by a hydroxyl\n      group, an amine group or an O-alkyl having from 1 to 6 carbon\n      atoms,  \n      or a pharmaceutically acceptable salt and/or hydrate thereof.",
                                "Preferably, the compound of formula (II) as defined above is selected form the compounds shown in FIGS. 9 and 16 of the article of Debnath et al. (2013) Theranostics 3:47-75.",
                                "More preferably, the compound of formula (II) as defined above is represented by the following formula (III):",
                                "wherein:\n\n\n- - E₁ represents an alkyl group having from 1 to 12 carbon atoms, or a\n    heteroaryl group having from 3 to 12 carbon atoms, and\n  - E₂ represents a heteroalkyl group having from 1 to 12 carbon atoms,\n    substituted by an amine group, and\n  - E₃ represents a heteroalkyl group having from 1 to 12 carbon\n    atoms;  \n    or a pharmaceutically acceptable salt and/or hydrate thereof.",
                                "Most preferably, the compound of formula (II) as defined above is selected form the group consisting of compounds represented by the following structures:",
                                "Preferably, the CXCR4 receptor-binding compound according to the invention is a compound of formula (II) as defined above wherein:\n\n\n- - D₁ and D₂, which may be identical or different, represent an aryl or\n    heteroaryl group having from 3 to 12 carbon atoms, optionally\n    substituted by a hydroxyl group or an alkyl group having from 1 to 6\n    carbon atoms, and\n  - X represents an alkyl group having from 1 to 6 carbon atoms,  \n    or a pharmaceutically acceptable salt and/or hydrate thereof.",
                                "Preferably, the compound of formula (II) according to the invention is AMD070:",
                                "Compounds of formula (II) according to the invention can be readily synthesized by one of skill in the art, as is in particular described in Skerlj et al. (2011) Bioorg. Med. Chem. Lett., 21:1414-8.",
                                "The pharmaceutically acceptable salt and/or hydrate of compounds of formula (I) and (II) will appear obviously to one of skill in the art. Preferably, the pharmaceutically acceptable salt and/or hydrate of compounds of formula (I) and (II) is selected from the group consisting of hydrobromide, hydrochloride, dihydrobromide, dihydrochloride and metallic salts such as Zn2+ salt and Cu2+ salt.",
                                "As intended herein, the term “alkyl” refers to linear, branched or cyclic alkyl groups.",
                                "As intended herein, the term “aryl” denotes an aromatic group comprising at least one aromatic ring.",
                                "As intended herein, the term “heteroaryl” denotes an aryl comprising at least one heteroatom preferably selected from the group consisting of O, P, N, S and Si, which is more preferably N.",
                                "As intended herein, the term “heteroalkyl”, in particular “heterocycloalkyl”, denotes an alkyl, in particular a cycloalkyl, comprising at least one heteroatom preferably selected from the group consisting of O, P, N, S and Si, which is more preferably N.",
                                "As intended herein the term “alkylaryl” denotes an alkyl group substituted by at least one aryl group.",
                                "As intended herein the term “arylalkyl” denotes an aryl group substituted by at least one alkyl group.",
                                "The halogen atom according to the invention can be of any type known to one of skilled in the art. Preferably, the halogen atom according to the invention is selected from the group consisting of F, Cl, Br and I.",
                                "Preferably, the CXCR-4 receptor-binding compound according to the invention is selected from the group consisting of plerixafor and AMD070. Plerixafor is known in the art as a CXCR4 antagonist and is also referred as to AMD3100 and JM3100. These compounds are represented by the following structures:",
                                "**Prevention and Treatment**",
                                "Preferably, the interferon according to the invention is selected from the group consisting of a type I interferon, also denoted IFN-I, a type II interferon, also denoted IFN-II, and a type III interferon, also denoted IFN-III. More preferably, the IFN according to the invention is selected from the group consisting of IFN-a (IFN-alpha, type I), IFN-β (IFN-beta, type I), IFN-γ (IFN-gamma, type II), IFN-λ (IFN-lambda, type III) IFN-ω (IFN omega, type I). Most preferably, the interferon according to the invention is selected from IFN-a and IFN-β.",
                                "Preferably, the prevention or treatment according to the invention relates to the prevention or treatment of a disease or a disorder selected from the group consisting of a viral infection, an opportunistic infection, allergy, cancer, in particular with an overproduction of spermine, depression-induced immunosuppression, diabetes, in particular type-I or type-II diabetes, rheumatoid arthritis and multiple sclerosis.",
                                "The viral infection according to the invention can be of any type known to one of skill in the art. Preferably, the viral infection according to the invention is dengue.",
                                "Opportunistic infections are well known to one of skill in the art and are notably infections caused by pathogens such as bacteria, viruses, fungi or protozoa. Preferably, opportunistic infections according to the invention are selected from the group consisting of tuberculosis, pneumonia, toxoplasmosis, cytomegalovirus infection, and candida.",
                                "Allergy are well known to one of skill in the art and are notably defined with codes D69, J30, J45, L23, L50, T78.4, Z88 and Z91 of the 10th revision of the International Classification of Diseases (ICD-10) 2016 version by the World Health Organization.",
                                "The cancer prevented or treated according to the invention can be of any type known to one of skill in the art. Preferably, the cancer prevented or treated according to the invention is selected from the group consisting of prostate cancer, breast cancer, lung cancer, uterus cancer, digestive system-related cancer, such as colorectal cancer, melanoma and renal cancer. Preferably, the cancer prevented or treated according to the invention is a cancer with an overproduction of spermine.",
                                "Immunosuppression prevented or treated according to the invention can be of any type known to one of skill in the art. Preferably, the immunosuppression prevented or treated according to the invention is associated to other pathologies such as infectious diseases, chronic infections, invalidating diseases or associated to treatments such as corticoids, anti-inflammatories, or immunosuppressants. More preferably, the depression prevented or treated according to the invention is a depression-induced immunosuppression.",
                                "Rheumatoid arthritis is defined in ICD-10 with codes M05, M06, M08 and multiple sclerosis is defined in ICD-10 with the code G35.",
                                "Diabetes prevented or treated according to the invention can be of any type known to one of skill in the art. Diabetes prevented or treated according to the invention are in particular type-I or type-II diabetes.",
                                "Preferably, the prevention or treatment according to the invention relates to the prevention of treatment of a disease or a disorder selected from the group consisting of a viral infection, an opportunistic infection, cancer with an overproduction of spermine, depression-induced immunosuppression, diabetes, in particular type-I or type-II diabetes and multiple sclerosis.",
                                "Preferably, the prevention or treatment according to the invention relates to the prevention or treatment of a disease or a disorder selected from the group consisting of dengue, tuberculosis, pneumonia, toxoplasmosis, cytomegalovirus infection, candida, cancer with an overproduction of spermine and depression-induced immunosuppression.",
                                "As should be clear to one of skill in the art, the diseases or disorders according to the invention are prevented or treated by increasing, in particular restoring, interferon (IFN) level, notably type I, II or III interferon (IFN-I, IFN-II, IFN-III). Preferably, the diseases or disorders according to the invention are prevented or treated by increasing, in particular restoring, type-I IFN, more particularly IFN-a and/or IFN-β, level.",
                                "Preferably, the level of interferon (IFN), in particular the level of type-I IFN, more particularly the level of IFN-a and/or IFN-β, is increased, in particular restored, by the CXCR4 receptor-binding compound according to the invention, by increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, by immune cells, in particular plasmacytoid dendritic cells, monocytes and NK cells.",
                                "**Individual**",
                                "The individual according to the invention is preferably a mammal, more preferably a human.",
                                "Preferably, the individual according to the invention is in need of an increase of IFN, in particular IFN-I, IFN-II or IFN-III. More preferably, the individual according to the invention is in need of an increase of IFN-a and/or IFN-β.",
                                "In an embodiment of the invention the individual according to the invention has a normal level of IFN, in particular IFN-I, IFN-II or IFN-III.",
                                "The individual according to the invention has preferably, at least one symptom of a disease or disorder or suffers from a disease or disorder selected form the group consisting of a viral infection, an opportunistic infection, allergy, cancer, in particular with an overproduction of spermine, depression-induced immunosuppression, rheumatoid arthritis, diabetes and multiple sclerosis.",
                                "In a particular embodiment, the individual according to the invention does not suffer from HIV-infection, rheumatoid arthritis and pulmonary allergy, in particular pulmonary inflammation and hyperactivity of the respiratory tract.",
                                "In a particular embodiment, the individual according to the invention does not suffer from opportunistic infection, multiple sclerosis and diabetes.",
                                "**Administration**",
                                "Preferably, the CXCR4 receptor-binding compound according to the invention is administered in an effective amount for increasing, in particular restoring, interferon level in an individual.",
                                "Preferably also, the CXCR4 receptor-binding compound according to the invention is administered in an effective amount for increasing, in particular restoring, interferon level by immune cells, in particular plasmacytoid dendritic cells, monocytes and NK cells in an individual.",
                                "Preferably also, the CXCR4 receptor-binding compound according to the invention is administered in a prophylactically or therapeutically effective amount for preventing or treating a disorder selected from the group consisting of viral infection, an opportunistic infection, allergy, cancer, in particular with an overproduction of spermine, depression-induced immunosuppression, rheumatoid arthritis diabetes and multiple sclerosis.",
                                "The CXCR4 receptor-binding compound according to the invention can be administered by any route known in the art, such as the intravenous, intramuscular, subcutaneous injection, oral, or topical routes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define CXCR4 receptor",
                                "describe CXCR4 receptor-binding compound",
                                "determine CXCR4 binding by flow cytometry analysis",
                                "define preferred CXCR4 receptor-binding compound",
                                "describe compound of formula (I)",
                                "define Z and Y in formula (I)",
                                "define A in formula (I)",
                                "define R and R' in formula (I)",
                                "describe preferred compound of formula (I)",
                                "describe compound of formula (II)",
                                "define D₁ and D₂ in formula (II)",
                                "define X in formula (II)",
                                "describe preferred compound of formula (II)",
                                "describe compound of formula (III)",
                                "define E₁, E₂, and E₃ in formula (III)",
                                "describe preferred compound of formula (II)",
                                "describe plerixafor",
                                "describe AMD070",
                                "describe synthesis of compounds of formula (I) and (II)",
                                "describe pharmaceutically acceptable salt and/or hydrate",
                                "define alkyl",
                                "define aryl",
                                "define heteroaryl",
                                "define heteroalkyl",
                                "define alkylaryl",
                                "define arylalkyl",
                                "describe halogen atom",
                                "describe preferred CXCR4 receptor-binding compound",
                                "describe plerixafor and AMD070",
                                "describe synthesis of compounds of formula (I) and (II)",
                                "describe pharmaceutically acceptable salt and/or hydrate",
                                "describe CXCR4 receptor-binding compound",
                                "describe prevention and treatment",
                                "describe interferon",
                                "describe disease or disorder",
                                "describe individual"
                            ],
                            "num_characters": 18190,
                            "outline_medium": [
                                "define CXCR4 receptor",
                                "describe CXCR4 receptor-binding compound",
                                "determine CXCR4 binding by flow cytometry analysis",
                                "define preferred CXCR4 receptor-binding compound",
                                "describe compound of formula (I)",
                                "define Z, Y, A, R, and R' in formula (I)",
                                "describe preferred compound of formula (I)",
                                "describe compound of formula (II)",
                                "define D₁, D₂, and X in formula (II)",
                                "describe preferred compound of formula (II)",
                                "describe synthesis of compounds of formula (I) and (II)",
                                "define pharmaceutically acceptable salt and/or hydrate",
                                "describe alkyl, aryl, heteroaryl, and heteroalkyl groups",
                                "describe halogen atom",
                                "describe preferred CXCR4 receptor-binding compounds",
                                "describe plerixafor and AMD070",
                                "describe prevention and treatment of diseases",
                                "describe interferon types"
                            ],
                            "outline_short": [
                                "define CXCR4 receptor",
                                "describe CXCR4 receptor-binding compound",
                                "specify preferred CXCR4 receptor-binding compound",
                                "describe formula (I) of CXCR4 receptor-binding compound",
                                "specify preferred formula (I) of CXCR4 receptor-binding compound",
                                "describe formula (II) of CXCR4 receptor-binding compound",
                                "specify preferred formula (II) of CXCR4 receptor-binding compound",
                                "describe synthesis of CXCR4 receptor-binding compound",
                                "describe pharmaceutically acceptable salt and/or hydrate of CXCR4 receptor-binding compound"
                            ]
                        },
                        {
                            "title": "In Vitro Screening Methods",
                            "paragraphs": [
                                "Preferably, the in vitro screening method for identifying compounds for increasing, in particular restoring, IFN secretion, in particular type-I IFN secretion, more particularly IFN-a and/or IFN-β secretion, in an individual from candidate compounds, wherein the candidate compounds are CXCR4 receptor-binding compounds according to the invention comprises the steps of:",
                                "contacting blood cells with a candidate compound;",
                                "determining the level of secretion of IFN by the contacted blood cells;",
                                "selecting the candidate compound which increases the level of secretion of IFN with respect to the level of secretion of IFN before the blood cells have been contacted by the candidate compound, thereby identifying a compound for increasing, in particular restoring, IFN level.",
                                "Preferably, the in vitro screening method according to the invention is performed by flow cytometry.",
                                "Blood cells according to the invention can be of any type known to one of skilled in the art. Preferably, blood cells according to the invention are peripheral blood mononuclear cells (PBMCs), more preferably plasmacytoid dendritic cells (pDCs), monocytes or NK cells.",
                                "Preferably, in the in vitro method for identifying compounds for increasing, in particular restoring IFN level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual from candidate compounds according to the invention, the CXCR4 receptor is expressed on the surface of cells, such as HEK cells.",
                                "The detectable CXCR4 receptor-biding compound according to the invention can be of any type known to one of skilled in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe in vitro screening method",
                                "describe flow cytometry",
                                "describe blood cells"
                            ],
                            "num_characters": 1609,
                            "outline_medium": [
                                "describe in vitro screening method for identifying compounds"
                            ],
                            "outline_short": [
                                "describe in vitro screening method for identifying compounds for increasing IFN secretion"
                            ]
                        },
                        {
                            "title": "In Silico Experiments",
                            "paragraphs": [
                                "In silico methods for screening compound are well known to one of skilled in the art. The in silico method according to the invention preferably refers to a method for screening compounds from candidate compounds, or for designing compounds, for increasing, in particular restoring, IFN level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual via bioinformatics tools.",
                                "In silico method according to the invention can be of any type known to one of skilled in the art such as docking, for instance using a software such as cDocker, receptor dependent-quantitative structure-activity relationship (RD QSAR), quantitative structure-activity relationship (QSAR), quantitative structure-property relationship (QSPR), pharmacophore model and design de novo.",
                                "Preferably, the in silico method for screening compounds from candidate compounds, or for designing compounds, for increasing, in particular restoring, IFN level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual according to the invention is an in silico docking experiments. For example, the in silico method for screening compounds from candidate compounds, or for designing compounds, for increasing, in particular restoring, IFN level, in particular type-I IFN level, more particularly IFN-a and/or IFN-β level, in an individual according to the invention can be performed by using the crystal structure of CXCR4 with a ligand, notably AMD3100, and then identifying the potential biding pocket on the CXCR4 extracellular domain.",
                                "Preferably, the designed compound or a candidate compound according to the invention interacts with at least 6 amino acids of a CXCR4 receptor represented by SEQ ID NO: 1, wherein the amino acids are selected from the group consisting of alanine 175, aspartic acid 171, aspartic acid 262, phenylalanine 174, valine 196, glycine 207, tyrosine 255, tyrosine 256, isoleucine 259, serine 263 and glutamic acid 288.",
                                "The invention will be further described by the following non-limiting figures and Example."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe in silico method",
                                "describe docking",
                                "describe in silico docking experiments",
                                "describe designed compound or candidate compound"
                            ],
                            "num_characters": 2078,
                            "outline_medium": [
                                "describe in silico method for screening compounds",
                                "describe in silico docking experiments"
                            ],
                            "outline_short": [
                                "describe in silico method for screening compounds for increasing IFN level"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define CXCR4 receptor-binding compound"
                    ],
                    "num_characters": 408,
                    "outline_medium": [
                        "define CXCR4 receptor-binding compound"
                    ],
                    "outline_short": [
                        "define CXCR4 receptor-binding compound"
                    ]
                },
                {
                    "title": "EXAMPLE",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "A. Materials and Methods",
                            "paragraphs": [
                                "**1. Blood Samples, Isolation and Culture of Blood Leukocytes.**",
                                "Blood was obtained from healthy HIV-1-seronegative blood bank donors. Experimental procedures with human blood were done according to the European Union guidelines and the Declaration of Helsinki. In vitro experiments were performed using human peripheral blood mononuclear cells (PBMC) isolated by density centrifugation from peripheral blood leukocyte separation medium (Cambrex, Gaithersburg, Md.). pDC were purified by negative selection with the Human plasmacytoid DC enrichment kit (StemCell Technologies). Cells were cultured in RPMI 1640 (Invitrogen, Gaithersburg, Md.) containing 10% fetal bovine serum (Hyclone, Logan, Utah). After purification, the purity obtained was higher than 91% for pDC.",
                                "**2. Viral Stimulation and Infection.**",
                                "PBMC were seeded at 1.106/1 mL or purified pDC were seeded at 5.104/100 μl and then stimulated with the following viruses: inactivated AT-2 HIV-1MN (CXCR4 co-receptor specific) or AT-2 HIV-1ADA (CCR5 co-receptor specific) at 60 ng/mL p24CA equivalent (provided by J.D. Lifson (SAIC-NCI, Frederick, Md.)), Infectious human Influenza A/PR/8/34 virus (Flu), titer 1:8192 at dilution 1:1000 or DENV-2 16681 at MOI 10. Infectious HIV-1MN [tissue culture 50% infective dose (TCID50)=106] and HIV-1ADA (TCID50=1,000) were used at the same concentration. Purified pDC were pre-treated with amino compounds for 1 hour, following overnight stimulation with virus. Supernatants were collected for cytokine detection. Microvesicles isolated from uninfected cell cultures matched to the culture to produce the virus were used as negative control (Mock).",
                                "**3. Chemical Compounds.**",
                                "Histamine dihydrochloride and clobenpropit dihydrobromide (Sigma-Aldrich, Mo., USA) were diluted in pure water. The compounds were added in pDC cultures at 10 μM (or other if specified) 1 hour before stimulation or not of the different viruses. For histamine, X-vivo culture media (Lonza) was used in order to avoid histaminases. Cells were pre-incubated 1 hour with AMD3100 (20 μM) (Sigma-Aldrich, Mo., USA) prior to CB or histamine incubation. pDC were cultured in the presence of 5 mM of the oligodinucleotide A151 (TTAGGG) ODN (Integrated DNA Technologies, Coralville, Iowa).",
                                "**4. Cytokine Detection.**",
                                "pDC's supernatants were tested for multispecies soluble IFN-a by ELISA (PBL Assay Science, NJ, USA) according to the manufacturer's instructions.",
                                "**5. RT-qPCR Analysis.**",
                                "Total RNA was extracted using RNeasy Micro kit and was submitted to DNase treatment (Qiagen), following manufacturer's instructions. RNA concentration and purity were evaluated by spectrophotometry (Biophotometer, Eppendorf). Five hundred ng of RNA were reverse-transcribed using PrimeScript RT Reagent Kit (Perfect Real Time, Takara) in a 10 μl reaction. Real-time PCR reactions were performed in duplicates using Takyon ROX SYBR MasterMix blue dTTP (Eurogentec) on a 7900HT Fast Real-Time PCR System (Applied Biosystems). Transcripts were quantified using the following program: 3 min at 95° C. followed by 35 cycles of 15 s at 95° C., 20 s at 60° C. and 20 s at 72° C. Values for each transcript were normalized to expression levels of RPL13A (60S ribosomal protein L13a) using the 2-ΔΔCt method. Primers used for quantification of transcripts by real time quantitative PCR are indicated below:",
                                "6. Molecular Modelling of CXCR4 with Various Ligands.",
                                "The molecular docking program cDOCKER was used for automated molecular docking simulations and various scoring function were used to rank poses: Jain, cDocker Interaction optimized, Ludi. PDB files were cleaned using the prepare protein protocol of Discovery Studio 4.1, membrane was added according to Im. W algorithm Ligands and their conformer were prepared using prepare ligand protocol after conformation generation. Complexes were selected on the basis of criteria of interacting energy combined with geometrical matching quality as well as compromise of scoring function Figures were generated with Discovery studio 4.1 graphics system. The 2D representations of molecular structures interaction of Discovery Studio was used for delineation of the detailed interactions between ligands and CXCR4 (PDB code: 3ODU). An interaction was considered a hydrophobic interaction if the Van der Walls fraction was 0.7 and was considered a hydrogen bond if it was between a listed donor and acceptor and the angles and distances formed by the atoms surrounding the hydrogen bond lay within the default criteria. RMSD were calculated using Discovery studio 4.1 and with ITlt in CXCR4/ITlt co-crystal as reference (PDB code 3ODU).",
                                "**7. Statistical Analysis.**",
                                "P values (P) were determined using a two-tailed Student's t test. P<0.05 was considered statistically significant. *=P<0.05; **=P<0.01 and ***=P<0.001. Univariate distributions of flow cytometry data were performed by probability binning, in 300 bins using FlowJo software.",
                                "Data sets were analysed by two-way ANOVA with Bonferroni post-tests (cytokine concentration time courses). GraphPad Prism 5 (GraphPad Software, San Diego, Calif.) was used for data analysis and preparation of all graphs. P-values less than 0.01 were considered to be statistically significant."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "obtain blood samples",
                                "isolate and culture blood leukocytes",
                                "stimulate and infect cells with viruses",
                                "use chemical compounds",
                                "detect cytokines",
                                "perform RT-qPCR analysis",
                                "model CXCR4 with ligands",
                                "perform statistical analysis",
                                "describe experimental procedures",
                                "outline materials used"
                            ],
                            "num_characters": 5243,
                            "outline_medium": [
                                "obtain blood samples",
                                "isolate and culture blood leukocytes",
                                "stimulate and infect cells with viruses",
                                "use chemical compounds",
                                "detect cytokines and perform RT-qPCR analysis"
                            ],
                            "outline_short": [
                                "describe experimental procedures",
                                "outline chemical compounds and methods"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "RESULTS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "1. AMD3100 Prevents Type I Interferon Production Inhibition Induced by Amines",
                            "paragraphs": [
                                "1.1. AMD3100 was tested for inhibition of type I interferon production by HIV-stimulated pDC. AMD3100 alone did not block type I IFN nor TRAIL expression by HIV-activated pDC.\n\n1.2. AMD3100 was then tested for its ability to block the action of amine-type compounds, i.e. histamine and clobenpropit (CB), which bind at the ITlt pocket on CXCR4 (ITlt is a CXCR4 antagonist) and notably inhibit the production of IFN-I by HIV-stimulated pDC.",
                                "The expressions of TRAIL, IFN-a and IFN-β in pDC treated or not with AMD3100 were thus quantified.",
                                "Purified cells were pre-incubated with AMD3100 for 1 hour and then by histamine or CB for 1 hour and finally exposed to HIV-1 overnight.",
                                "AMD3100 drastically abolished biological activities of histamine and CB on HIV activated-pDC. Indeed, the inventors observed that AMD3100 treatment could restore IFN-a, IFN-β and TRAIL mRNA expression (FIG. 1) and IFN-a production (FIG. 2) inhibited by histamine or CB in HIV-activated pDC. These results were confirmed for the expression of IFN-γ, IL-6 and IFN-stimulated gene 56 (ISG56) mRNA expression in HIV-activated pDC (FIGS. 3A-3C)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "test AMD3100 for inhibition of type I interferon production",
                                "quantify expressions of TRAIL, IFN-a, and IFN-β"
                            ],
                            "num_characters": 1119,
                            "outline_medium": [
                                "test AMD3100 on type I interferon production inhibition"
                            ],
                            "outline_short": [
                                "present results of AMD3100 on type I interferon production"
                            ]
                        },
                        {
                            "title": "2. Identification of a Binding Pocket for AMD3100 on CXCR4 Extracellular Domain",
                            "paragraphs": [
                                "To understand the molecular interaction between AMD3100 and CXCR4, in silico docking experiments were performed.",
                                "ITlt, a CXCR4 antagonist, was used as an internal control to validate the molecular modelling protocol. ITlt and AMD3100 were thus docked in the ITlt binding pocket of CXCR4.",
                                "It has been first confirmed that ITlt was replaced properly compared to the crystal structure. Indeed, RMSDs of ITlt heavy atoms resolved in crystal structure (PDB code 3ODU) and ITlt docking poses after scoring are around 1 Å (equivalent to the variation observed when comparing ITlt in 3ODU co-crystal with other co-crystallized structures (PDB codes 3OE6-3OE8-3OE9)) (Table 1).",
                                "The 2D representation was used for delineation of the detailed interactions between ligands and CXCR4 (Table 2).",
                                "The molecular docking of AMD3100 and CXCR4/ITlt co-crystallization allowed the identification of two distinct binding pockets on CXCR4; AMD3100 pocket covers up superficially the two subpockets of CXCR4 while the ITlt pockets is located more deeply in the minor subpocket of CXCR4. Thus, the access of ITlt or amine-type compounds, such as histamine or CB, to the binding pocket could be blocked by AMD3100."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "perform in silico docking experiments",
                                "identify binding pockets on CXCR4"
                            ],
                            "num_characters": 1193,
                            "outline_medium": [
                                "perform molecular docking experiments"
                            ],
                            "outline_short": [
                                "describe molecular docking experiments and results"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A CXCR4 receptor-binding compound for use for increasing or restoring interferon (IFN) level in an individual, wherein the interferon is a type-I interferon (IFN-I).",
        "2. The CXCR4 receptor-binding compound for use according to claim 1, wherein the CXCR4 receptor-binding compound is selected from the group consisting of:\na compound of the following formula (I):\n\n\nZ—R-A-R′—Y  (I)\n\n\n\nwherein:\nZ and Y, which are identical or different, represent:\nan alkyl group having from 1 to 6 carbon atoms, optionally substituted by a hydroxyl group, an ethylene, a halogen atom, a CN group, a CF3 group, a SO group, a NO2 group, an amine group, a difluor or an alkyl, S-alkyl or O-alkyl group having from 1 to 6 carbon atoms, or\nan aryl or heteroaryl group having from 3 to 6 carbon atoms, optionally substituted by a hydroxyl group, an ethylene, a halogen atom, a CN group, a CF3 group, a SO group, a NO2 group, an amine group, a difluor or an alkyl, S-alkyl or O-alkyl group having from 1 to 6 carbon atoms, or\na cyclic or heterocyclic polyamine group having from 9 to 32 ring members and from 3 to 8 amine groups in the ring spaced by 2 or more carbon atoms from each other, optionally comprising an aryl or heteroaryl group having from 3 to 6 carbon atoms, a heteroatom or a heteroelement, and optionally substituted by a halogen atom, a hydroxyl group, a heteroatom, a heteroelement an alkyl, S-alkyl or O-alkyl group having from 1 to 6 carbon atoms or an aryl or heteroaryl group having from 3 to 6 carbon atoms, and\n\nA represents an aryl or heteroaryl group having from 3 to 12 carbon atoms, and\nR and R′, which are identical or different, represent an alkyl group having from 1 to 6 carbon atoms or a R1NR2R3 group, and\nR1 represents a single bond or an alkyl group having from 1 to 6 carbon atoms, and\nR2 and R3, which are identical or different, represent a hydrogen atom, an amine group, an alkyl group having from 1 to 6 carbon atoms or an aryl or heteroaryl group having from 3 to 6 carbon atoms, optionally substituted by an alkyl group having from 1 to 6 carbon atoms, or a pharmaceutically acceptable salt and/or hydrate thereof;\na compound of the following formula (II):\n\n\n\nwherein:\nD1 and D2, which may be identical or different, represent:\nan alkyl group having from 1 to 6 carbon atoms optionally substituted by at least one hydroxyl group, a halogen atom, a CF3 group, a CN group, an amine group, or an alkyl, O-alkyl or S-alkyl group having from 1 to 12 carbon atoms, or\nan aryl, an heteroaryl, a cycloalkyl, a heterocycloalkyl, alkylaryl, alkylheteroaryl or alkylheteropolyaryl group having from 3 to 12 carbon atoms, optionally substituted by at least one hydroxyl group, halogen atom, CF3 group, CN group, amine group, or alkyl, O-alkyl or S-alkyl group having from 1 to 12 carbon atoms, or\n\nD1 and D2 are linked together to from a N-containing aryl or heteroaryl group having from 3 to 12 carbon atoms and optionally substituted by at least one amine group optionally substituted by an alkylheteroaryl, group having from 3 to 12 carbon atoms, and\nX represents:\nan alkyl group having from 1 to 6 carbon atoms, or\nR4—Y—R5— wherein, R4 and R5 which are identical or different represent an alkyl group having from 1 to 6 carbon atoms and Y represents an aryl or heteroaryl group having from 3 to 6 carbon atoms, optionally substituted by a halogen atom, a hydroxyl group, an amide group, an amine group, an alkoxy group, an ester group, a CF3 group, a CN group or an alkyl, O-alkyl or S-alkyl group having from 1 to 6 carbon atoms optionally substituted by a hydroxyl group, an amine group or an O-alkyl group having from 1 to 6 carbon atoms,\n\n\nor a pharmaceutically acceptable salt and/or hydrate thereof.",
        "3. The CXCR4 receptor-binding compound of formula (I) for use according to claim 2, wherein:\nZ and Y are identical and represent cyclic polyamine moieties having from 9 to 20 ring members and from 3 to 6 amine groups in the ring spaced by 2 or more carbon atom from each other, and\nA represents an aryl or heteroaryl group having from 3 to 8 carbon atoms, and\nR and R′, which are identical or different, represent a methylene linked to a nitrogen atom of Z or Y, the nitrogen atoms being otherwise unsubstituted.",
        "4. The CXCR4 receptor-binding compound for use according to claim 1, wherein the CXCR4 receptor-binding compound interacts with at least 6 amino acids of a CXCR4 receptor represented by SEQ ID NO: 1, wherein the amino acids are selected from the group consisting of alanine 175, aspartic acid 171, aspartic acid 262, phenylalanine 174, valine 196, glycine 207, tyrosine 255, tyrosine 256, isoleucine 259, serine 263 and glutamic acid 288.",
        "5. The CXCR4 receptor-binding compound for use according to claim 1, wherein the CXCR4 receptor-binding compound is selected from the group consisting of plerixafor and AMD070.",
        "6. The CXCR4 receptor-binding compound for use according to claim 1, wherein the interferon (INF) is IFN-a and/or IFN-β.",
        "7. The CXCR4 receptor-binding compound for use according to claim 1, for increasing or restoring IFN secretion by immune cells.",
        "8. The CXCR4 receptor-binding compound for use according to claim 1, for increasing or restoring IFN secretion by immune cells selected from the group consisting of plasmacytoid dendritic cells, monocytes and NK cells.",
        "9. The CXCR4 receptor-binding compounds for use according to claim 1, in the prevention or treatment of a disease selected from the group consisting of a viral infection, an opportunistic infection, allergy, rheumatoid arthritis, multiple sclerosis, a cancer with an overproduction of spermine, depression-induced immunosuppression and diabetes.",
        "10. The in vitro use of a CXCR4 receptor-binding compound as defined in claim 1, for increasing or restoring type-I IFN secretion by immune cells.",
        "11. An in vitro screening method for identifying compounds for increasing or restoring IFN secretion in an individual from candidate compounds, wherein the candidate compounds are CXCR4 receptor-binding compounds as defined in claim 1.",
        "12. The in vitro screening method according to claim 11, comprising the steps of:\ncontacting blood cells with a candidate compound;\ndetermining the level of secretion of IFN by the contacted blood cells;\nselecting the candidate compound which increases the level of secretion of IFN with respect to the level of secretion of IFN before the blood cells have been contacted by the candidate compound, thereby identifying a compound for increasing or restoring IFN level.",
        "13. The in vitro screening method according to claim 11, wherein blood cells are selected form the group consisting of peripheral blood mononuclear cells (PBMC) and plasmacytoid dendritic cells, monocytes and NK cells.",
        "14. An in vitro screening method for identifying compounds for increasing or restoring type-I IFN secretion in an individual from candidate compounds, comprising:\nbinding a CXCR4 receptor with a detectable CXCR4 receptor-binding compound as defined in claim 1;\ncontacting the CXCR4 receptor bound to the detectable CXCR4 receptor-binding compound with a candidate compound;\nselecting the candidate compound which decrease the binding of the detectable CXCR4 receptor-binding compound to the CXCR4 receptor, thereby identifying a compound for increasing or restoring IFN level.",
        "15. An in silico method for screening compounds from candidate compounds, or for designing compounds, for increasing or restoring type-I IFN level in an individual, comprising determining if a designed compound or a candidate compound interacts with at least 6 amino acids of a CXCR4 receptor represented by SEQ ID NO: 1, wherein the amino acids are selected from the group consisting of alanine 175, aspartic acid 171, aspartic acid 262, phenylalanine 174, valine 196, glycine 207, tyrosine 255, tyrosine 256, isoleucine 259, serine 263 and glutamic acid 288."
    ]
}