{
    "id": "https://semopenalex.org/work/W2883466536",
    "authors": [
        "Andrew Scott",
        "Ulf Eriksson",
        "Hong Li",
        "Manuel Zeitelhofer",
        "Carmel Murone",
        "Ingrid Nilsson",
        "Bruno Catimel",
        "A. Munro Neville",
        "Laura Allan",
        "Fiona E. Scott",
        "Xicong Liu",
        "Benjamin Gloria",
        "A. Perani"
    ],
    "title": "Development of monoclonal anti-PDGF-CC antibodies as tools for investigating human tissue expression and for blocking PDGF-CC induced PDGFRα signalling in vivo",
    "date": "2018-07-27",
    "abstract": "PDGF-CC is a member of the platelet-derived growth factor (PDGF) family that stimulates PDGFRα phosphorylation and thereby activates intracellular signalling events essential for development but also in cancer, fibrosis and neuropathologies involving blood-brain barrier (BBB) disruption. In order to elucidate the biological and pathological role(s) of PDGF-CC signalling, we have generated high affinity neutralizing monoclonal antibodies (mAbs) recognizing human PDGF-CC. We determined the complementarity determining regions (CDRs) of the selected clones, and mapped the binding epitope for clone 6B3. Using the monoclonal 6B3, we determined the expression pattern for PDGF-CC in different human primary tumours and control tissues, and explored its ability to neutralize PDGF-CC-induced phosphorylation of PDGFRα. In addition, we showed that PDGF-CC induced disruption of the blood-retinal barrier (BRB) was significantly reduced upon intraperitoneal administration of a chimeric anti-PDGF-CC antibody. In summary, we report on high affinity monoclonal antibodies against PDGF-CC that have therapeutic efficacy in vivo.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Platelet-derived growth factors (PDGFs) have important functions during development but also in diverse pathological conditions [1]. PDGF-CC is a member of the PDGF family that has been extensively characterized during the past decade [2–6]. Upon PDGF-CC binding, PDGF receptor alpha (PDGFRα) subunits become dimerized, leading to receptor autophosphorylation. This initiates intracellular signalling events triggering responses such as cell proliferation, migration, contraction and survival [7]. In contrast to other PDGF family members, activation of full-length PDGF-CC requires proteolytic cleavage whereby the dimeric conserved growth factor domain (GFD) is released from the N-terminal CUB domain. Activation of latent PDGF-CC by tissue plasminogen activator (tPA) has been characterized in detail and seems largely confined to the CNS [8, 9], while in other tissues, other proteases can activate PDGF-CC [2, 10].",
                "Autocrine and paracrine PDGF signalling is involved in pathogenesis of gliomas, sarcomas, leukemias and epithelial cancers [11, 12]. In addition, PDGFs drive pathological mesenchymal responses in vascular disorders and fibrotic diseases [1]. Further, dysregulation in the PDGF/PDGFR system such as constitutive activation of PDGFRs, or mutations which up/downregulate both ligand and receptor activities, contribute to osteosarcomas, lung carcinomas, gliomas, astrocytomas and medulloblastomas [12, 13]. Apart from PDGF-CC being a potent proto-oncogene that induces malignant transformation of fibroblasts, it also serves as a mitogen for many cell types of mesenchymal origin, including certain stem cells, smooth muscle cells and endothelial cells [7, 9, 14, 15].",
                "The importance of PDGF-CC in tumour biology has recently been emphasized by demonstration of the capacity of PDGF-CC to facilitate tumour growth via recruitment of cancer-associated fibroblasts (CAFs) into the tumour mass, and also by increasing tumour angiogenesis through induction of the angiogenic factor osteopontin [16]. It has also been reported that overexpression of PDGF-CC resulted in liver steatosis, fibrosis, and hepatocellular carcinoma in a Pdgfc transgenic mouse model [17] and that PDGF-CC mediates renal interstitial fibrosis [18]. Increased expression of PDGF-CC has additionally been observed in experimental models of heart and lung fibrosis [19, 20]. PDGF-CC has been shown to mediate angiogenic and tumorigenic properties of fibroblasts associated with tumours refractory to anti-VEGF treatment [21]. Notably, in preclinical models of head and neck squamous cell carcinoma, siRNA-mediated reduction of PDGF-CC expression levels reversed resistance to cisplatin and thus improved the therapeutic effect [22].",
                "PDGF-CC has been recognized as a regulator of the blood-brain barrier (BBB) integrity. It has been shown that intraventricular injection of active PDGF-CC protein is sufficient for disrupting the BBB [23]. Moreover, inhibition of the PDGF-CC/PDGFRα axis reduced BBB dysfunction and has beneficial therapeutic effects in animal models of stroke [23–25], spinal cord injury [26], multiple sclerosis [27], traumatic brain injury [28], seizures [29] and amyotrophic lateral sclerosis [30]. Recently, a phase 2 clinical trial in human ischemic stroke subjects treated with thrombolysis and the PDGFRα inhibitor imatinib, showed significant improvements in clinical outcome compared to thrombolysis alone [31].",
                "Molecular tools specific for targeting PDGF-CC signalling are still missing, and we aimed to generate high affinity monoclonal antibodies (mAbs) suitable for functional assessment of PDGF-CC signalling with a potential for therapeutic use [32]. For that purpose we have generated and characterized mAbs against human PDGF-CC and assessed their binding specificities, affinities and complementarity-determining regions (CDR). We demonstrated their ability to neutralize PDGF-CC mediated activation of PDGFRα. We have also investigated the expression pattern of PDGF-CC in human primary tumours and control tissues. Taken together, the properties of our high affinity mAbs indicate that they are potentially useful for the treatment of various PDGF-CC related pathologies in cancer, fibrosis, and CNS diseases."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [
                "All laboratory health and safety procedures have been complied with in the course of conducting the experimental work reported in this paper."
            ],
            "subsections": [
                {
                    "title": "Generation Of Monoclonal Antibodies",
                    "paragraphs": [
                        "To produce mAbs against PDGF-CC, we used recombinant human PDGF-CC core domain protein [2]. Immunizations and generation of hybridomas were carried out by the EMBL monoclonal antibody facility, Rome, Italy (http://www.macf.embl.de). 16 hybridomas reacting strongly with PDGF-CC in both ELISA and immuno blots (WBs) were selected. The hybridomas were grown in HM20 medium containing DMEM (Gibco, 41965–039) and supplemented with 20% FBS (Gibco, 10437–036), 50 μg/ml gentamicin (Gibco, 15757–037), 200 mM L-glutamate (Gibco, 25030–024) and 10% HCF (hybridoma cloning factor, BioVeris Corporation, Ca: 210001) at 37°C, with 5% CO2. The hybridomas were subcloned by serial dilution and expanded. To purify the mAb IgGs, the expanded cultures were grown in reduced serum media. To avoid unspecific IgG contamination from FCS, we used Ultra-Low IgG FBS (Gibco, 16250) in the culture medium. The purification was carried out using HiTrap-Protein G columns (GE Healthcare, 17-0404-01). The collected media was passed through the column and nonspecific binding was removed by washing with PBS. The elution was carried out using a 0.1M glycine-HCl buffer, pH 3.0. The purified IgGs were then dialyzed against PBS."
                    ],
                    "subsections": []
                },
                {
                    "title": "Elisa And Immuno Blot Analyses",
                    "paragraphs": [
                        "ELISA plates (96 well, high bound Corning) were coated with 1 μg/ml active PDGF-CC, or recombinant PDGFRα protein (R&D, 6765-PR-050), in 50 μl 100 mM NaHCO3 (Sigma, S5761), at 4°C overnight. The plates were washed 3 times with PBS/0.1% Tween 20 (PBST), and then blocked with 3% bovine serum albumin (BSA: Saveen Werner AB, B 2000–500)/PBST at room temperature (RT) for 1 hour (h). The secreted supernatant from the hybridomas were subsequently applied as a dilution series starting from 1:2 in 3% BSA/PBS, then incubated for 1 h at RT. After washing, 50 μl goat anti-mouse IgG-AP (alkaline phosphatase) conjugated secondary antibody (Sigma, A3562) diluted 1:2500 in 3% BSA in PBS was applied for 1 h at RT. Bound antibodies were detected by developing with AP substrate containing p-nitrophenylphosphate (pNPP) (Sigma, P7998-100 ml), and the plates were read at 405 nm using the program Mars 1.11 in an ELISA reader (Spector star, Nano).",
                        "Immunoblots to detect the reactivity of human PDGF-CC GFD and full-length protein, mouse PDGF-CC (R&D, 1447-PC-CF), human PDGF-DD (R&D, 1159-SB-025/CF) against the mAbs were assessed as previously described [2]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Neutralizing Activity Of The Mabs",
                    "paragraphs": [
                        "PAE cells overexpressing PDGFRα (PAE-α) were seeded in Petri dish to 70% confluence. The day after, the cells were starved for 4 h in serum-free media at 37°C, washed with PBS, and stimulated with different amount of human core-domain PDGF-CC protein, or the mixture of PDGF-CC with different clones of mAb IgG using a 1:5 molar ratio. After 1 h stimulation on ice, the cells were washed, lysed and subjected to WB and PDGFRα tyrosine phosphorylation was assessed as previously described [8]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Biosensor Analysis—Affinity Estimation",
                    "paragraphs": [
                        "Biosensor analysis was performed on a BIAcore 2000 biosensor (GE Healthcare) using an NTA sensor chip as described in detail [33]. Briefly, a NTA sensor chip (GE Healthcare, BR1004-07) was loaded with Ni2+ and used to immobilize histidine tagged PDGF-CC ligand. The PDGF-CC antibodies were passed over the chip at varying concentrations in order to determine apparent affinity (KD). Chips were regenerated with ethylene glycol tetraacetic acid (EDTA, Sigma, E3889). The chip was re-equilibrated by washing with HBS (containing no EDTA) before further analysis. Using BIAevaluation software, a 1:1 Langmuir binding analysis model was used to estimate the apparent association (ka) and disassociation (kd) rate constants for each antibody generated (49)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Biosensor Analysis—Epitope Determination",
                    "paragraphs": [
                        "Competitive binding analysis was conducted for the panel of 4 anti-PDGF-CC candidate mAbs using immobilized PDGF-CC. The PDGF-CC antigen was covalently coupled to a CM5 Sensor Chip via primary amine groups using standard chemistry conditions of 0.05M NHS/0.2M EDC (49).",
                        "The binding ability of pairs of anti-PDGF-CC mAbs to bind simultaneously to immobilized PDGF-CC was tested. Monoclonal antibodies directed against separate epitopes will bind independently of each other, whereas antibodies directed against closely related epitopes will interfere with each other’s binding. Pair wise binding studies were performed by injection of the first antibody (50μl at the rate 100μl/ml) until surface saturation when all the available binding sites were occupied. Binding of the second antibody to PDGF-CC was then assessed following injection (50μl at the rate100μl/ml). Each analysis cycle was terminated by removing bound material from the sensor chip surface using 10mM Glycine, pH 2.1. Mapping was performed by analysing reciprocal duplicates of the same antibodies in reversed order. To further examine the nature of the binding to PDGF-CC protein and the potential for involvement of disulphide bonds within PDGF-CC, mAb binding was performed on non-reduced and reduced/alkylated antigen. Reduction and alkylation were performed on immobilized PDGF-CC by successive injection of 200μl of 50mM dithiothreitol (Sigma, 20–265) and 200μl of 30mM iodoacetamide (Sigma, l1149)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Biosensor Analysis-Specificity Of Binding",
                    "paragraphs": [
                        "Specificity of binding for PDGF-CC compared to the closely related PDGF-DD ligand was conducted. Both PDGF-CC and PDGF-DD (R&D, 1159-SB) antigens were immobilized to the biosensor chip via primary amine groups (NHS/EDC chemistry) using standard conditions. Anti-PDGF-CC mAbs (6B3, 11F5, 19C7, ch6B3) and a control anti-PDGF-DD mAbs were passed over the chip containing immobilized antigens."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunohistochemistry—Tissue Screens",
                    "paragraphs": [
                        "Use of human tissue samples was approved by the Austin Hospital Human Research Ethics Committee. The identities of the patients or participants have been fully anonymized. Human tissue was provided by the Austin Hospital Department of Anatomical Pathology (Melbourne, Australia). Four micrometer paraffin-embedded sections were deparaffinized followed by quenching of endogenous peroxidase activity with 3% hydrogen peroxide (Merck, 107209) for 10 min at RT. Antigen retrieval was performed by boiling the sections in 10 mmol/l citric acid pH 6.0 for 30 min. Antibodies and dilutions used were the following: 6B3 (1.5 μg/ml), isotype control mouse IgG (Southern Biotechnologies; 1.5 μg/ml,) CD34 (0.5 μg/ml; Dako). Antibody binding was detected using Dako-Envision+ anti-mouse-HRP conjugated secondary antibody followed by DAB chromogen (Dako). As positive control sample the human lung carcinoma cell line A549 (ATCC) and positive placental tissue was used. Assay controls comprised replacing the primary antibody with an isotype control, or omission of the primary antibody. Test tissue was reported positive if a signal was present in the tissue incubated with antibody and if there was an absence of signal in sections incubated with the isotype control and/or sections incubated in the absence of primary antibody. In addition we assessed the specificity of 6B3 staining by using PDGF-CC ligand or the related growth factor VEGF-B as competitors. Murine 6B3 antibody (1.5 μg ml) was incubated with 6.7 X excess of PDGF-CC His6 antigen (10 μg/ml) or an excess of VEGF-B antigen (10 μg/ml, CSL) 1 h prior to antibody incubation to a section of A549 cell or human placental tissue. Placental tissue and A549 cell line sections reacted moderately to intensely (++ to +++) with the 6B3 antibody and the isotype and negative control sections were devoid of staining. In both ATCC and in human placental tissue, an excess of VEGF-B antigen did not interfere with 6B3 staining indicating that there is no non-specific staining to VEGF-B.",
                        "Slides were imaged using an Aperio ScanScope XT instrument (Aperio Technologies, Inc, Vista, CA) and viewed using ImageScope software (Aperio Technologies, Inc, Vista, CA). Anti-CD34 was applied to adjacent sections to easier judge PDGF-CC expression in blood vessels.",
                        "A modified histochemical score (H-score) was determined for each individual tissue sample based on the intensity of the staining and the percentage of positively stained cells [34]. This score was determined by multiplying the fraction of positive cells (range 0–5 [neg = 0; <5% = 1; 6–25% = 2; 26–50% = 3; 51–75% = 4; >75% = 5]) with the intensity of staining (neg = 0; + = 1; ++ = 2; +++ = 3). T-tests were conducted for each tissue type to determine statistical significance between 6B3 reactivity in control and tumour specimens. P value <0.05 was considered significant."
                    ],
                    "subsections": []
                },
                {
                    "title": "Generation Of Chimeric Anti-Pdgf-Cc Antibody (Ch6B3)",
                    "paragraphs": [
                        "The cDNA sequences of murine monoclonal antibodies 6B3, 11F5, and 19C7 were determined using standard laboratory techniques. Based upon in vitro and in vivo characteristics, 6B3 was selected as a candidate for the generation of a mouse-human chimeric antibody and for future humanization.",
                        "Murine variable regions of the heavy chain (HC) and light chain (LC) clone 6B3 antibody were synthesized by GeneArt and cloned upstream of human IgG1 heavy and light chain kappa constant regions in pEE6.4 and pEE14.4 glutamine synthetase (GS) expression vectors (Lonza Biologics) respectively.",
                        "Following DNA sequence verification, the pEE6.4ch6B3HC and pEE14.4ch6B3LC vectors were digested with NotI/SalI restriction enzymes and the HC cassette from pEE6.4ch6B3HC was cloned into the pEE14.4ch6B3LC plasmid to make the double gene vector pDGVch6B3 as final construct. Expression using the GS system in both transient (Freestyle 293) and stable Chinese hamster ovary (CHO) cells was conducted and the PDGF-CC binding efficacy of ch6B3 was assessed using ELISA, Biacore and PDGF-CC neutralization activity in vitro as described previously for the murine monoclonal antibodies."
                    ],
                    "subsections": []
                },
                {
                    "title": "Experimental Animals",
                    "paragraphs": [
                        "All experiments in this study were approved and performed in accordance with the guidelines from the Swedish National Board for Laboratory Animals under the ethical permit N85/08 that was approved by the North Stockholm Animal Ethics Committee. For the blood-retinal barrier leakage assay C57BL/6 mice were used. In addition we used Pdgfrα H2B-eGFP (PdgfrαGFP/+) mice that express a nuclear GFP signal in cells, where the Pdgfrα promoter is/has been active [35]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Blood-Retinal Barrier Leakage Assay",
                    "paragraphs": [
                        "The blood-retinal barrier leakage assay was conducted using an established method [27]. Briefly, intraperitoneal injections with 400μg isotype control antibody, or ch6B3, were administrated to C57BL/6 mice (n = 4 for each group). 2 h post antibody treatment mice were put under light isoflurane anaesthesia and pupils were dilated by applying a drop of Mydriacyl (Apoteket, 043182) on top of the cornea. Under a stereomicroscope, a small incision was made in the sclera using a 25G needle and 500ng of PDGF-CC protein diluted in PBS (total volume 2μl) was carefully injected into the left eye behind the lens using a Hamilton syringe. A dose response with increasing concentrations of PDGF-CC was performed to identify the appropriate amount of PDGF-CC to be injected (data not shown). The same procedure was repeated for the right eye with injection of vehicle (2μl PBS). Subsequently, the 70 kDa tetramethyl rhodamine conjugated dextran (TMR-Dex) (Invitrogen, D34679) was injected intravenously in the tail vein. After 3 h of TMR-Dex circulation, mice were transcardially perfused with 60 ml HBSS (Invitrogen) and thereafter with 10 ml of 4% paraformaldehyde (PFA). Eyes were briefly post-fixed in 4% PFA for 30 min. Retina whole mounts were carefully dissected out and subjected to immunostaining and evaluation of permeability. Dextran and IF images were captured using a confocal microscope (Zeiss LSM700). Representative images shown are 2D renderings of 10 μm thick z-stacks. Fluorescence quantifications (pixel area) were performed using Image J software (NIH). The individual observations are based on analysis of five fields of vision from comparable anatomic positions."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunostaining Protocol",
                    "paragraphs": [
                        "Whole mount retinas were permeabilized overnight in PBS/0.5%Triton-X100. Thereafter they were put in blocking solution o/n (TNB, Perkin Elmer, FP1012). The following day, Podocalyxin, (1:200, R&D, AF 1556), PDGFRα Cell Signaling, #3164) or GFAP (1:500, DAKO, Z0334) antibodies were applied in TNB overnight. After the primary antibody incubation, the retinas were washed in PBS/0.1% NP40 and this washing solution was exchanged 4 times in 1 day. Secondary Alexa488-conjugated anti-goat IgG antibodies (1:1000 in TNB, Invitrogen, A11055) were incubated overnight at 4 degree. Subsequently the retinas were thoroughly washed in PBS/0.1% NP40, exchanged 4 times in 1 day. DAPI (1:1000, Thermo Fisher, D1306) was added in one of the wash buffer exchanges. Incisions were made with a fine scissor to enable flat mounting with Vectashield (Invitrogen). Images were captured using an inverted epifluorescent microscope (Zeiss Observer, Zeiss) equipped with a 20X objective. Vascular permeability was assessed by evaluating the signal from the fluorescent TMR-Dex."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistics",
                    "paragraphs": [
                        "All statistical analyses were calculated using SPSS V18 (SPSS). Spearman rank correlation was used to determine the associations of PDGF-CC expression with clinical-pathological parameters."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Mabs Recognizing Human Pdgf-Cc With High Affinity",
                    "paragraphs": [
                        "Screening of supernatants from generated hybridomas resulted in 16 clones containing IgGs with strong reactivity to PDGF-CC (data not shown). We selected stable and high IgG producing hybridomas, designated 6B3, 9A5, 11F5, 19A1, 19B1, 19C7 and 19D1 for further analysis (Table 1). IgGs from expanded cell culture supernatants were isolated and their specificity against human PDGF-CC, including cross-reactivity against mouse and rat PDGF-CC, were examined. Clone 6B3 recognized human latent and activated forms of PDGF-CC in both reduced and non-reduced conditions in immunoblots, but did not show cross-reactivity with mouse PDGF-CC. In addition, all other selected clones recognized human, but not mouse and rat PDGF-CC in immunoblots (Fig 1A and Table 1). Biacore analysis to determine the apparent on-rates (ka), off-rates (kd) and dissociation constants were performed to evaluate their binding affinities. The calculated dissociation constants for each antibody were in a low nanoMolar range, indicating that most of the antibodies have very high affinity for human PDGF-CC (Fig 1B). To further characterize the binding epitopes of the selected clones, we investigated the cross competition of mAbs for binding to immobilized PDGF-CC. Clones 6B3 and 19C7 demonstrated highly cross-competition while 11F5 showed no ability to compete with clone 6B3 and 19C7 (Fig 1C). This indicates that clone 6B3 and clone 19C7 have similar or overlapping epitopes, while 11F5 has a different epitope.",
                        "We sequenced the CDRs of the variable heavy and light chains for 6B3, 19C7 and 11F5 using standard procedures (Table 2) [36]. Interestingly, the CDR sequences of 19C7 and 6B3 were identical, which explains the above-mentioned cross-competition results."
                    ],
                    "subsections": []
                },
                {
                    "title": "Anti-Pdgf-Cc Mabs Blocking Phosphorylation Of Pdgfrα",
                    "paragraphs": [
                        "To assess whether the characterized mAbs can neutralize PDGF-CC induced activation of PDGFRα, we analysed the capacity of the mAbs to block PDGF-CC induced receptor phosphorylation in PDGFRα-expressing porcine aorta endothelia (PAE) cells. Pre-incubation of activated human PDGF-CC with 6B3 IgG abolished phosphorylation of PAE-expressed PDGFRα, while an equivalent amount of the ligand alone lead to strong phosphorylation of the receptor (Fig 1D). Using the same experimental setting, we tested the neutralizing capacity of all other selected clones (Table 1). Our results indicated that we have generated 5 PDGF-CC neutralizing clones, namely 6B3, 11F5, 14D5, 19B1, and 19C7.",
                        "We tested 6B3 for potential cross-reactivity with the other 3 PDGF ligands, PDGF-AA, PDGF-BB, and PDGF-DD. We showed that 6B3 specifically recognized PDGF-CC without any cross-reactivity with the other PDGF ligands (Fig 1E). The same results were demonstrated using clones 11F5, 14D5, 19B1, and 19C7 (data not shown)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Determination Of The Binding Epitope For 6B3",
                    "paragraphs": [
                        "Epitope mapping of mAbs by a combination of CDR sequence determination and molecular modelling of the target antigen enables the visualization and localization of the key antigenic regions, and elucidates the structure-function relations of the mAb CDRs to the target antigen [37]. The interaction between activated PDGF-CC and the 6B3 antibody was predicted (Computist Bionanotech, Scoresby, Victoria) using the Multiple Fragment Molecular Dynamics (MFMD) method previously described [38] [39]. Four putative antigen-binding sites were predicted (Fig 2A). Accordingly, we designed and synthesized peptides corresponding to the 4 identified putative binding sites (Fig 2B). Biosensor chip analysis revealed that upon pre-incubation of 6B3 with peptide 3, the binding capacity of 6B3 for immobilized PDGF-CC was reduced in a dose-dependent manner (Fig 2C). This reduction was not detected with the other peptides. When peptide 3 was immobilized on the chip, application of increased concentration of 6B3 leads to increased binding (Fig 2D). These results confirmed that peptide 3 contains the epitope for 6B3."
                    ],
                    "subsections": []
                },
                {
                    "title": "Pdgf-Cc Is Highly Expressed In Human Normal And Cancer Tissues",
                    "paragraphs": [
                        "To explore whether the mAbs can be used as tools for monitoring expression of PDGF-CC in human tissues, we performed immunohistochemistry with 6B3 IgG in 17 control (Table 3) and 16 tumour tissues (Table 4). To evaluate the localization of PDGF-CC in blood vessels, we stained consecutive sections with the blood vessel marker CD34. The specificity of 6B3 was initially assessed using the cancer cell line A549, which previously has been shown to express high levels of PDGF-CC) [40]. Here mAb 6B3 showed strong PDGF-CC immunoreactivity. PDGF-CC expression could not be detected upon omission of the primary antibody or when the primary antibody was incubated with excess PDGF-CC protein, in contrast to incubation with an unspecific antigen (Fig 3A).",
                        "The results of the expression intensity and frequency of PDGF-CC stainings are based on the uniformed scoring system for human control (Table 3) and tumour tissue (Table 4). In control tissue, PDGF-CC was mainly observed in the cytoplasm of epithelial cells with an exception in ovaries, where it appeared in a membranous pattern (Fig 3B). We could detect PDGF-CC expression in blood vessels in all analysed organs (Fig 3B).",
                        "Cortical cells and the blood vessels of the adrenal gland exhibited weak to moderate cytoplasmic expression of PDGF-CC. In the bladder, PDGF-CC was observed in more than 50% of urothelium. In large bowel, the glands and epithelium generally showed a weak to moderate amount of PDGF-CC, whereas lamina propria exhibited increased expression intensity. The bile ducts exhibited weaker expression intensity (Table 3). In the brain, we observed weak to moderate neuronal and glial PDGF-CC expression. In breast tissue, PDGF-CC expression was predominantly observed in myoepithelial cells, also in the ductal cells, whereas fat cells showed weak expression.",
                        "Abundant expression of Pdgfc mRNA has been reported in human heart, liver, kidney, pancreas and ovaries, in contrast to other organs/tissues [2, 40]. In line with these reports, we detected abundant expression of PDGF-CC protein in the human breast, liver, kidney, pancreas, uterus, ovaries and prostate (Fig 3). In the human heart, we observed a weak expression of PDGF-CC in the myocardium and in some blood vessels (Table 3 and Fig 3). In the kidney, we detected widespread PDGF-CC expression in tubular epithelial cells and a weaker signal in the parietal cells of Bowmans capsule in the glomeruli. Moderate to strong expression intensity was observed in hepatocytes, again in concordance with a previous mRNA analysis [40]. In control pancreas, the acini exhibited a widespread moderate to strong expression intensity, in contrast to a weak expression in the ducts. In the thyroid gland, PDGF-CC was predominantly expressed in follicular epithelium and partially in vessels. Finally, in uterus, PDGF-CC was highly expressed throughout the whole organ (Table 3).",
                        "The expression pattern of PDGF-CC was also extensively investigated in various tumours (Fig 4). The protein was detectable in the cytoplasm of stromal compartments, in the cytoplasm and membrane of tumour cells, and in blood vessels. Notably, more than 75% of the tumours analysed showed moderate to strong PDGF-CC expression (Table 4). Control parenchyma including blood vessels had markedly decreased expression intensity compared to the respective tumour tissue (Table 5). Furthermore, the amount of positively stained cells was reduced in control compared to tumour tissue (Table 5). The difference in PDGF-CC expression between control and the respective tumour tissue was evaluated using a modified H-Score system [34] revealing increased PDGF-CC expression in epithelial tissues of bladder (p = 0.039), brain gliosarcoma (p<0.001), breast infiltrating ductal carcinoma (p = 0.006), renal cell cancer (p = 0.008), colon (p<0.001), pancreas (p<0.001) and prostate adenocarcinoma (p = 0.001) (Table 5)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Characterization And Functional Application Of Chimeric 6B3",
                    "paragraphs": [
                        "Mouse mAb chimerization is an important and powerful technique to reduce immunogenicity when using the murine mAbs in other species. We generated chimeric 6B3 (ch6B3) and characterized its biological and functional activity. We show that the CDR sequence of the generated ch6B3 differed only by one amino acid at the variable heavy chain in comparison to the original 6B3 (Fig 5A). Chimeric 6B3 recognized human PDGF-CC equally well in both reduced and non-reduced condition (Fig 5B). As expected, ch6B3 specifically binds to PDGF-CC but not to any other PDGF ligands (Fig 5C). To reveal whether it has the capacity to block PDGF-CC induced phosphorylation of PDGFRα, we performed a receptor stimulation assay using PDGFRα expressing PAE cells. Upon pre-incubation of ch6B3 with human PDGF-CC, we verified that the ligand was unable to induce phosphorylation of PDGFRα similar to what we observed with the original 6B3 mAb (Fig 5D).",
                        "We have previously demonstrated that PDGF-CC induces opening of the BBB in vivo [23]. To assess whether ch6B3 could be used in vivo for both functional assays and ultimately for development into a humanized mAb for therapeutic applications, we explored if ch6B3 could block PDGF-CC induced opening of the blood retinal barrier (BRB) following intraocular injection of active PDGF-CC into the vitreous of the mouse eye. The integrity of the BRB was assessed by injecting tetramethylrhodamine-labeled 70-kDa dextran (TMR-Dex) into mouse-tail vein. The BRB integrity was evaluated by measuring tracer extravasation into the perivascular tissue. Intraocular injection of active human PDGF-CC, but not PBS, induced extravasation of TMR-Dex from the blood vessels into the perivascular tissue (Fig 5E). In contrast, when ch6B3 was injected intraperitoneally prior to the intraocular injection of active human PDGF-CC, no extravasation of the tracer was observed (Fig 5E). Hence, a single injection of ch6B3 was sufficient to cross the compromised BRB and prevent PDGF-CC induced opening of the BRB."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "Intercepting PDGF-CC signaling is a promising therapeutic avenue for targeting various types of cancer, fibrosis and neuropathologies involving BBB disruption [41, 42]. However, there are still no approved therapeutic monoclonal antibodies against PDGF-CC. We therefore aimed to develop both murine anti-human mAbs, and a chimeric anti-human mAb targeting PDGF-CC. We selected and extensively characterized the lead mAbs, 6B3 and ch6B3, that neutralize PDGF-CC-induced PDGFRα activation, and BRB disruption in vivo, in order to develop a potential novel agent against PDGF-CC-related malignancies and neuropathologies. This is to our knowledge the first study reporting specific mAbs against human PDGF-CC including in vivo assessment of their functionality.",
                "The mAbs against PDGF-CC were generated from purified recombinant PDGF-CC protein. Specificity and binding affinity against the antigen have been evaluated. Although protein sequence of human and mouse PDGF-CC are 87% identical to (in the conserved GFD domain up to 90%) our mAb recognized human, and not mouse PDGF-CC in the assays we tested.",
                "Despite the fact that PDGF-CC was discovered almost two decades ago, the detailed expression pattern in healthy and tumour tissue in humans has not been systematically reported yet. This is of utmost importance as PDGF-CC is crucial for tumour progression, angiogenesis and metastasis. We here used our novel mAb 6B3 to systematically screen various tumour and respective control tissues.",
                "We assessed the expression pattern of PDGF-CC in human epithelial cells, stroma and in blood vessels (Tables 3 and 4). Notably, PDGF-CC was found in both epithelial and stromal cells, and showed a gradually increased expression upon tumour transformation. High Pdgfc mRNA [2] and PDGF-CC protein levels in the parietal epithelial cells of the Bowman's capsule, tubular epithelial cells, and in arterial endothelial cells were described previously using a polyclonal antibody [43]. Dijkmans et al. reported PDGFC mRNA expression in a range of human control tissues including heart, kidney, pancreas, small intestine, spleen, testes, thymus, brain, colon and lung [40]. However, they did not observe any obvious upregulation of Pdgfc mRNA in the tumour cell lines.",
                "We could detect significantly increased PDGF-CC expression in stroma of both breast infiltrating duct carcinoma (IDC) (p = 0.039) and breast infiltrating lobular carcinoma (ILC) (p = 0.006) compared to control breast tissue. In addition, we observed a trend for increased PDGF-CC levels in stroma of prostate tumour (p = 0.08). Notably, PDGF-CC expression could not be evaluated in all tissue types due to the lack of stroma (Tables 3 and 4). In blood vessels significantly increased PDGF-CC levels were detected in bladder, brain, breast, colon, kidney, pancreas and prostate tumour biopsies compared to the respective control tissue (p<0.0001). Upregulation of PDGF-CC observed in the blood vessels indicates a potential role of this protein in tumour angiogenesis [44, 45]. In line with increased PDGF-CC expression in various tumours analysed in our study, it has been previously shown that PDGF-CC upregulation correlates with poorer prognosis of breast cancer, [46] colorectal cancer, [47] and glioma [48]. Moreover, activation of PDGF-CC promoted breast cancer metastases to bone [49]. Together with these observations, our data on PDGF-CC upregulation in the tumour samples strongly indicate relevance of targeting PDGF-CC for treating these pathologies.",
                "We could detect increased PDGF-CC expression in breast infiltrating duct carcinomas (IDC) compared to breast infiltrating lobular carcinomas (ILC). Interestingly ILC tend to be slower growing and less aggressive than IDC and patients with ILC tend to have a better prognosis than those with IDC [50, 51]. In this respect it is interesting that pharmacological intervention of PDGF-CC activity with 6B3 in the MDA-MB-231 breast cancer model on SCID mice resulted in significant reduction of tumour size and micro-vascular density of about 30%. Most importantly 6B3 treatment led to conversion of poorly treatable basal-like breast cancers into a hormone receptor-positive state that enhanced sensitivity to endocrine therapy [52]. However PDGF-CC expression was not increased in glioblastoma, a very aggressive brain tumour [53]. A further analysis with a greater number of tumour samples together with relevant clinical information would be needed to explore the hypothesis whether PDGF-CC is higher expressed in more aggressive tumour types.",
                "It has been demonstrated that overexpression of PDGF-CC results in liver fibrosis, steatosis and hepatocellular carcinoma in a Pdgfc transgenic mouse model [17]. As a majority of the control livers exhibited fibrosis or steatosis, we could not detect any statistical difference compared to the expression levels in hepatocellular carcinomas.",
                "The BBB represents a dynamic interface between the central nervous system (CNS), the blood and the immune system. Since disruption of the BBB integrity is a common and significant event in the pathogenesis of several neurological disorders including stroke, multiple sclerosis, traumatic brain injury and Alzheimer’s disease, many efforts have been made for targeting mechanisms responsible for loss of the barrier integrity. We have previously reported that the PDGF-CC/PDGFRα axis controls the integrity of the BBB [23, 28]. Intraventricular injection of active PDGF-CC protein was sufficient to induce BBB opening [23]. Treatment with the small molecule inhibitor imatinib, which was shown to inhibit PDGFRs, was able to reduce BBB dysfunction in both acute and progressive experimental neuropathology models [23, 26–30]. Recently, we performed a phase II randomized trial with imatinib in patients with acute ischaemic stroke treated with intravenous thrombolysis [31]. We could show that imatinib significantly improved neurological outcomes with an improvement of 0.6 NIH stroke scale (NIHSS) points per 100 mg imatinib given. For the high dose group, the mean adjusted NIHSS improvements were even 5 points in comparison to controls.",
                "Capillary loss and increased permeability of the BRB are among the earliest symptoms of diabetic retinopathy and treatment of the compromised BRB has been reported to ameliorate the symptoms [54]. We therefore aimed to determine the neutralizing capacity of the ch6B3 mAb in vivo using a BRB permeability assay. Indeed, intraocular PDGF-CC injection into the mouse eye induced disruption of the BRB, whereas intraperitoneal pretreatment with ch6B3 resulted in an intact BRB in contrast to the control retina injected with PBS (Fig 5E). The impact of PDGF-CC on vascular permeability, occurring within 1h, leads to increased leakage of antibodies from the blood stream out into the retina explaining the strong effect of the neutralizing antibody to inhibit vascular leakage, compared to the isotype control experiments. Thus, our data demonstrate high efficacy of circulating ch6B3 in blocking PDGF-CC-mediated PDGFRα signalling, indicating a possibility for in vivo targeting of PDGF-CC signalling for therapeutic purposes."
            ],
            "subsections": []
        }
    ]
}