{
    "id": "https://semopenalex.org/work/W2049145070",
    "authors": [
        "Kosuke Sekiyama",
        "Yasunori Kubo"
    ],
    "title": "Communication Timing Control with Interference Detection for Wireless Sensor Networks",
    "date": "2006-12-01",
    "abstract": "This paper deals with a novel communication timing control for wireless networks and radio interference problem. Communication timing control is based on the mutual synchronization of coupled phase oscillatory dynamics with a stochastic adaptation, according to the history of collision frequency in communication nodes. Through local and fully distributed interactions in the communication network, the coupled phase dynamics self-organizes collision-free communication. In wireless communication, the influence of the interference wave causes unexpected collisions. Therefore, we propose a more effective timing control by selecting the interaction nodes according to the received signal strength.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "In recent years, research on wireless sensor networks has been promoted rapidly [1]. The sensor networks are composed of distributed sensor devices connected with wireless communication and sensing functions. Potential application fields of the sensor networks include stock-management systems, road traffic surveillance systems, and air-conditioning control systems of a large-scale institution and so on. There are many technical issues in the sensor networks. In this paper, we deal with two problems. One of them is a communication timing control for collision avoidance. Another is the influence of interference wave on the communication timing control. In order to cope with malfunctions and changes of the number of active sensor nodes, a distributed autonomous communication timing control is preferable to centralized approaches which must rely on a fixed base station in general.",
                "In order to avoid the collision issue, TDMA [2] system has been presented, which is a multiplexing technology in the time domain that makes it possible to avoid collisions by assigning a communication slot to one frame. Hence, no collision occurs, and any node can obtain impartial communication right in TDMA. TDMA is widely used in cellular telephone systems. However, TDMA is fundamentally a central-ized management technique depending on a base station and is applicable to a star link network. Meanwhile, distributed slot assignment TDMA approach for ad hoc networks has been proposed. In Ephremides and Truong algorithm [3], allocation of one transmission slot is assured for each node by preparing N slots for N nodes. In addition, it is possible to add more slot allocations by referring to information of the slot allocation within the two hop nodes for the collision avoidance based on the distributed algorithm. However, this algorithm requires total number of the node. Hence, this algorithm has a limitation in changing the number of nodes flexibly. USAP-MA [4] deals with a distributed slot assignment in TDMA for changes of the number of nodes. This method provides a dynamic change of frame length corresponding to the number of nodes and network topology, and improves bandwidth efficiency. Also, the other methods of slot reservation have been proposed for TDMA [4][5][6]. However, these TDMA-based approaches require a global time synchronization.",
                "As another collision avoidance technique, CSMA [7,8] has been widely used. CSMA is a simple and scalable protocol. In the case of low-traffic situation, CSMA works efficiently. However, according to the increase of nodes, communication throughput sharply declines due to occurrence of frequent packet collisions. Such collisions should be avoided for not only improvement of the throughput efficiency, but also saving the electric energy consumption required in the retransmissions. Furthermore, several problems are pointed out with regard to the cost of carrier sense [9] and hidden terminals [7,8]. Also, with the CSMA-based approach, it is difficult to ensure impartial communication right because of the high contention of nodes that share communication channel.",
                "Other research in the wireless sensor networks includes SMAC [10], SMACS [11]. SMAC is based on CSMA, where each node broadcasts a sleep timing schedule to the neighbor nodes. The nodes receiving this message are to adjust the schedule of sleep, by which a node can save energy consumption. Although the problem of collision is inevitable, the aim of this research is focused on a timing control for energy saving. Hence, fundamental problems in CSMA remain unsolved. SMACS realizes an efficient communication based on synchronization between two nodes. These nodes attempt to schedule a communication timing with each other. Additionally, each node utilizes a different frequency band for a different link for collision avoidance. In this method, the risk of collisions can be reduced by random sharing of the frequency band. SMACS is different from the basic TDMA in that synchronization is required between two corresponding nodes while TDMA requires global synchronization. In general, global synchronization without a base station is hard to achieve. We have proposed a distributed communication timing control for collision avoidance named phase diffusion time-division method (PDTD) [12]. This method is a distributed communication timing control based on the dynamics of coupled phase oscillator among the peripheral nodes. Through local and fully distributed interactions, the coupled phase dynamics self-organizes the effective phase synchronous state that allows collision-free communication.",
                "On the other hand, radio interference is an important problem in the wireless communication. Interference problems include two kinds of problems. One of them is to reduce influence of interference. Another problem concerns the communication timing under the influence of interference. Radio interference greatly influences the communica-tion protocol [13]. Decentralized scheduling TDMA is based on the graph structure of the node connection within communication range. The issue of radio interference is not considered in decentralized scheduling TDMA. Therefore, in the presence of interference wave, it may not be an appropriate schedule method when considering the issue of interference. Also, in the case of CSMA-based protocol, hidden terminal collision avoidance mechanism based on RTS and CTS messages will not work appropriately [14]. In the previous timing control based on PDTD, we did not deal with radio interference problems. Therefore, unexpected collisions may occur in the real environment. In this paper, we propose the extended version of PDTD with interference detection (PDTD/ID). Each node exchanges the received signal strength and specifies the interference source node. This has to be incorporated for interaction nodes for collision avoidance in PDTD. We verify the efficiency of the proposed method by simulation experiments."
            ],
            "subsections": []
        },
        {
            "title": "COMMUNICATION TIMING CONTROL",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Outline of PDTD",
                    "paragraphs": [
                        "In this section, we will review a basic concept of PDTD. We assume a situation in which a node periodically transmits data. The node is modeled as an oscillator that periodically repeats the states of the communication and noncommunication. Hence, mutual adjustment of the communication timing is formulated based on the coupled oscillator dynamics. The communication timing state of the node is expressed as a phase. The phase of the oscillator for node i is denoted as θ i , and angular velocity is ω i . We suppose that each node can transmit data only within the phase interval 0 < θ i < φ c as depicted in Figure 1. If other nodes do not transmit in the interval 0 < θ i < φ c , no collision occurs. Figure 1 shows the phase relation from the viewpoint of node 0. Figure 1(left) depicts initial state. In this case, the phase difference is not large enough, hence a collision occurs. If each node forms appropriate communication timing like Figure 1(right), collision does not occur. The node transmits the control message  at θ i = 0 for communication timing control. Each node is assumed to know the phase value of the neighbor nodes by receiving the control message, and to calculate phase dynamics."
                    ],
                    "subsections": []
                },
                {
                    "title": "Node interaction",
                    "paragraphs": [
                        "We explain the method of exchanging phase value with each other by the control message. The control message from node i includes the following information:",
                        "(1) one-hop neighbor node ID j = (0, 1, 2, . . . );",
                        "(2) phase value of one-hop neighbor ( θ i0 , θ i1 , θ i2 , . . . , θ i j );",
                        "(3) received signal strength value from one-hop neighbor (P i 0 , P i 1 , P i 2 , . . . , P i j ).",
                        "The phase value of one-hop neighbor is used for calculation of communication timing control. The received signal strength value is used for selection of interference nodes. These are detailed in Sections 2.3 and 3. Since the control messages are transmitted by the same channel with the data messages, there is possibility that the control messages might be occasionally lost by collisions. However, the transmission of the control messages is executed periodically, it is unlikely that the control message is lost every time.",
                        "The process to convey node information to the neighboring nodes is explained as follows. The node is assumed to be able to know only its self phase value when calculating phase dynamics. However, the node estimates the phase value of the neighboring nodes from their control messages. In this paper, the neighbor node of which information is temporarily generated based on this estimation is called a virtual node. The node controls communication timing by the interaction with a virtual node. Figures 2(a) and 2(b) show the case that node 2 transmits the control message. Figure 2(a) shows node allocation and communication range. Figure 2(b) shows the state of virtual nodes of nodes 1 and 2 corresponding to Figure 2(a). The interaction process of nodes 1 and 2 is as follows. Node 2 transmits the control message at phase θ 2 = 0, then the control message includes information of nodes 1, 3, 4, and 5 that exist in one-hop neighbor. Node 1 that received this massage generates virtual nodes corresponding to nodes 1, 2, 3, 4, and 5 listed in control message from node 2. The phase with dashed circle in Figure 2(b) denotes the corresponding node. A virtual node corresponding to node 2 (sender of the control message) is registered as one-hop neighbor node. Nodes 3, 4, and 5 (the other nodes contained in the control message) are registered as two-hop neighbor nodes. In this regard, node 3 is classified as the two-hop neighbor node from node 1. However, if node 1 is able to communication directly with node 3, node 3 is registered as the one-hop neighbor node. Through sending and receiving of a periodic control message, each node has node information within two-hop neighbor nodes as a virtual node."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Coupled phase dynamics",
            "paragraphs": [
                "PDTD provides communication timing control based on phase dynamics for collision avoidance. Node i interacts with a virtual node and forms appropriate phase-difference pattern. Let θ i j denote phase value of virtual node j for node i. Then the governing equation is given by the following equations:",
                "where ω i and ω i j denote the angular velocity of node i and virtual node j, respectively, and k j is the coupled strength value. K i is a virtual node set of node i. Every node is allowed to transmit data for φ c /ω i (s) every cycle. ξ(S i ) is a stochastic term, details of which are explained in Section 2. "
            ],
            "subsections": []
        },
        {
            "title": "Stochastic adaptation",
            "paragraphs": [
                "When relying only on the repulsive interaction, the phasedifference pattern often fails to converge to the desired stationary state. Therefore, a stochastic adaptation term ξ(S i ) is introduced, which is determined by the estimated risk of the collision. As an evaluation index, phase overlap rate is defined. Node communication state is defined such that O i = 1 denotes that node i is allowed to communicate, and O i = 0 denotes that node i is prohibited to communicate, which is given by",
                "Flag function to indicate phase overlap of communication timing between node i and virtual nodes is given by",
                "x i = 1 indicates that there is a phase overlap that would cause a collision. If t+T t x i (t) = 0, then one collision is counted for one cycle. Let γ indicate the occurrence time of phase overlap for past n cycles. overlap rate c i is given by",
                "The stress of being exposed to the risk of collision is accumulated by the following mechanism:",
                "where τ = n ¡ T i is a stress accumulating time scale. Random phase jump is implemented every n ¡ T i [s] cycles with probability S i , where if S i > 1, then S i 1. After random phase jump, then S i 0. The destination of phase jump is decided as follows. Assume that node i has N i virtual nodes, the phase of which is denoted as θ i j . Sorting the phase value θ i j in ascending order, such as θ (1)   il < ¡ ¡ ¡ < θ (k)  i j < ¡ ¡ ¡ < θ ( Ni)   ik , the corresponding node to kth phase value is v k . The destination of stochastic jump is depicted as shown in Figure 3. The list of destination u k is given by The preferential selection probability u k is decided by the equation",
                "where β is a sensitivity parameter of the selection."
            ],
            "subsections": []
        },
        {
            "title": "COMMUNICATION TIMING CONTROL WITH INTERFERENCE NODE DETECTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Radio interference problem",
                    "paragraphs": [
                        "In a wireless communication, even in the presence of weak interference wave, a node may fail to communicate if the desired wave strength from the node is weak. On the other hand, if the desired wave strength is sufficiently strong, the node may be able to receive data from the other node successfully despite presence of a strong interference wave. The reception error caused by an interference wave is estimated by signal-to-interference ratio (SIR). The threshold of SIR to correctly receive a signal is determined by modulation methods and spec of the receiver. In the communication timing control described in Section 2.3, however, the influence of interference wave was not taken into account in our model. In spite of the assumption that the interaction range is within the two-hop neighbors, interference waves can be reached beyond the interaction range, and hence this could cause unexpected collisions. Therefore, each node has to select the interaction nodes based on the relation between received signal wave strength and interference wave strength."
                    ],
                    "subsections": []
                },
                {
                    "title": "Radio interference model",
                    "paragraphs": [
                        "In this section, we discuss how the interference source is specified based on the received electric power. As shown in Figure 4, nodes i, j, and k are placed, where the internode distance between nodes i and j and the one between nodes j and k are denoted by d s , d i , respectively. The interference occurs in node j when node i transmits to node j. Also assume that all nodes transmit in the same electric power t p (mW).",
                        "The received electric power p(d)(mW) is assumed available by the following equation [14]:",
                        "where d is the distance between the sender node and the receiver node. α is the signal attenuation coefficient. c is the combined parameter that is related to the reception strength.",
                        "Assume that node i is the transmitting source, and node k is an interference source. With (11), SIR is defined as the ratio of the electric power between the desired signal from node i and the interference wave from node k;",
                        "SIR has to be bigger than the threshold e sir in order for the transmission from node i to be successfully received in node j. Otherwise, in the case of SIR e sir , the interference would occur in node j, and node k is referred to as the interference source node for node j. In general, the existence range of interference source node is given by the following equation:",
                        "We call the existence range of interference source node as ERIS in the following section. It can be said that ERIS is proportional to the distance d s by (13). In order for node i to be able to communicate with node j successfully, node i has to specify which node can be the interference node for node j. Such nodes are referred to as the interference source nodes. Node i is not allowed to transmit at the same time as the interference source node."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Existence range of interference source",
            "paragraphs": [
                "As mentioned in the previous section,",
                "is required for successful communication in the presence of interference waves. Taking logarithm in (14), we obtain",
                "where P s = 10 log 10 p(d s ), P i = 10 log 10 p(d i ), and E sir = 10 log 10 e sir . Figure 5 shows the existence range of interference source (ERIS). Let P min (dBm) be the minimum received signal strength for a successful communication. In the case that node 1 transmits to node 2 that is located on the boundary of communication range from node 1, the received signal strength on the boundary positions will become P min (dBm). Hence, it is supposed that P s = P min in (15), then P min E sir > P i is derived, which indicates that node 2 will fail to receive the transmission from node 1, if the strength of interference wave is larger than P i = P min E sir (dBm). The ERIS, the corresponding range for P i , will become larger than the communication range of node 2. Therefore, some extension is required for the timing control with two-hop neighbor nodes based on the PDTD because the interference wave may cause another collision. On the other hand, when node 1 transmits to node 3, which is closer than node 2, assume that node 3 receives the signal of strength P c = P min +E sir (dBm). This is the case of P s = P c in (15), where since P c E sir > P i , P min > P i is obtained. This implies that the ERIS (P i ) is the same or inside of the communication range of node 3. Therefore, if the communication range is redefined as P c instead of P min , it is possible to avoid the problem caused by the interference wave in PDTD."
            ],
            "subsections": []
        },
        {
            "title": "Detection process of interference node",
            "paragraphs": [
                "In this section, the process of interference node detection is addressed. This method is based on the evaluation of the received signal strength, where two different scenarios can be considered. The first case is that when node a transmits to node b, the interference occurs in the destination node b because of transmissions from some other nodes. In this case, node a needs to specify which nodes are causing the interference to node b (detection of the interference nodes), in an attempt to execute the timing control with such interference nodes. On the other hand, the second case is that the transmission from node a to a destination node c is causing an interference to node b, where node a is becoming an interference node for node b unintentionally, and such a node could exist many around node a. Hence, node a is asked to specify the node set that can be interfered by the transmission of node a, and conduct a timing control with those nodes to avoid a potential collision. The first case is exemplified in more detail in Figure 6(a), where node 1 receives a control message from node 2 with the signal strength larger than P c (dBm) in an attempt to specify the interference nodes for node 2. As described in Section 2.2, the control message from node 2 includes the signal strength data which had been received by node 2 from the other nodes. In Figure 6(a), this control message includes data from nodes 1, 3, 4, 5, 6, 7, 8, and 10.",
                "Let P b a denote the received signal strength of node b from node a, then node 1 compares P 2 1 (the desired signal) with P 2 x , (x = 3, 4, 5, 6, 8, 10) in order to judge as to whether each node x would become the interference source. From (15), if P 2 1 P 2 x E sir , node x may cause the interference to node 2. Such a node set is defined as",
                "Equation ( 16) represents the node set that could cause the interference to node b when node a transmits to node b. It should be noted that the node set L I (b a) is determined by node a based on the control message from node b, hence node a is excluded from the set L I (b a). As depicted in Figure 6(a), L I (2 1) = 3, 4, 5, 6, 7 that are the nodes inside the range of dashed circle, P 2 1 E sir . While, the second scenario is exemplified in Figure 6(b) where there is no direct communication between nodes 1 and 9 but node 1 can receive the control message from node 9 with the signal strength of less than P c (dBm) for the sake of the interaction in PDTD. In other words, node 1 is outside the communication range P c though it is within the interaction range P min . Node 9 will have a direct communication with node x, the signal strength of which is P 9 x > P c . When node 1 transmits to a peripheral node, such as node 2, the transmission from node 1 may interfere with the desired signal for node 9 from node x, for instance, x = 12. Also, if P 9 x P 9 1 E sir holds, node 1 becomes an interference node to the desired signal for node 9. Therefore, the node set comprising the nodes that are interfered with the transmission of node A and prevented from receiving a desired signal from node B is defined as follows:",
                "It should be noted that since C I (b a) is estimated by node a based on the received control message from node b, node a is excluded from the node set C I (b a). As an example, C I (9 1) = 5, 12 is depicted in the confined colored area of Figure 6(b).",
                "In this method, the parameters associated with necessary SIR threshold E sir and the minimum reception electric power P min have to be preassigned in order to abstract the interference nodes. After every node specifies the interference nodes, it conducts a communication timing control with those included in L I and C I . That is, the interaction nodes (the virtual node set for node i) K i in (1) are adaptively specified as L I ( j i) C I ( j i)."
            ],
            "subsections": []
        },
        {
            "title": "SIMULATION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Simulation setting",
                    "paragraphs": [
                        "Simulations are conducted to illustrate performance of PDTD/ ID. As a simulation setting, 10¢10 nodes are assigned as follows.",
                        "Case 1 (regular grid model (Figure 7(a))). 10 ¢ 10 nodes are assigned on the regular grid, where the internode distance is assumed as d = 25 (m).",
                        "Case 2 (perturbed grid model (Figure 7(b))). Node allocation is perturbed by the uniform random value in [ d/2, d/2) from the regular grid allocation.",
                        "The radio parameters and the node parameters are listed in Tables 1 and2, respectively. Also, the node arrangement and communication range are depicted in Figure 7. The initial value of the phase θ i is randomly assigned in [0, 2π) for both Cases 1 and 2. Since the purpose of this simulation is to verify the proposed timing control and interference node selection, we focus our argument on the timing control, hence the traffic model is simplified. Each node transmits packets in the phase interval 0 < θ i < φ c every cycle. It is preferable that the node decides φ c as autonomous. However, we decide φ c    "
                    ],
                    "subsections": []
                },
                {
                    "title": "Simulation results",
                    "paragraphs": [
                        "The results of node selection for interaction are shown in Figures 7(a) and 7(b), where the large circle indicates the communication range of node 34, and the small circle indicates the equivalent curve of the signal strength P c from node 34. The encircled nodes in Figure 7 imply the interference nodes in the case that node 34 transmits to a node within the small circle P c curve (or communication range);",
                        "hence node 34 has to interact with encircled nodes for collision avoidance. Table 3 shows a specific example for signal strength values in the case of Figure 7(b). Table 3(a) shows the list of signal strength in the case that node 34 receives the control message from node 35, the information gathered by node 35. Node 34 specifies the interaction nodes based on (16). Because the value of SIR is less than the desired threshold E sir = 10 (dB) as listed in Table 1 for successful reception, node 34 has to avoid the overlap of communication timing with nodes 25, 44, and 45. Table 3(b) shows the table of signal strength, when node 34 receives a control message from node 33, and node 34 selects interaction node based on (17). Because node 34 interferes with reception of node 33, node 34 has to avoid overlap of communication timing with 24 and 43. Thus, interaction nodes (encircled nodes in Figure 7) are selected autonomously. As mentioned in Section 2.3, each node evaluates the overlap rate of communication phase by (7). It can be said that the phase-difference pattern for the communication timing control is completed when the overlap rate of all nodes converged to 0. The time series of average overlap rate is shown in Figures 8(a  Figure 9 shows performance difference with/without interference node detection. In the case without interference node detection, in spite of phase overlap rate becomes 0, average collision rate indicates 0.1. That collision is caused by influence of nodes outside two hops. Additionally, available phase interval φ c becomes small (with ID 2π/27, without ID 2π/34) so that a lot of interaction nodes exist. However, interference node detection has the limitation of range of destination node (Figure 5). Figures 10(a) and 10(b) show the spatial distribution of the successful transmission rate and the collision rate. After having completed the timing control, the inequality of transmission right was prevented. In the conventional contentionbased access control, the equal transmission right is difficult to achieve. Thus, the communication timing control which can also cope with the interference wave is realized in a static radio condition. However, the reception signal strength may change dynamically due to the influence of fading effect, a problem remaining to be dealt with in our future work.  "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "In this paper, we proposed a novel communication timing control method for the wireless networks, named phase diffusion time-division method with interference detection, PDTD/ID. Without interference detection, PDTD may be faced with difficulty to operate in real environment. Through the local exchanging of received signal strength value, every node selects the interaction nodes for collision avoidance in the presence of interference wave. PDTD/ID realizes a fully distributed timing control with the interference node detection. A model of the interference wave was examined for the simulation, and the simulation experiments illustrated satisfactory results in the large-scale network. Interaction node selecting method based on the reception signal strength is expected to be effective in the real environment."
            ],
            "subsections": []
        }
    ]
}