{
    "id": "US20140123334",
    "authors": [
        "Madan K. Bhattacharyya",
        "Rishi Sumit"
    ],
    "title": "ARABIDOPSIS NONHOST RESISTANCE GENE(S) AND USE THEREOF TO ENGINEER DISEASE RESISTANT PLANTS",
    "date": "2013-03-04 00:00:00",
    "abstract": "The present invention relates to a method of increasing resistance against plant pathogens, particularly Phytophthora and Fusarium virguliforme in transgenic plants and/or plant cells, through the use of non host resistance nucleic acid molecules isolated from Arabidopsis. In these plants, at least one nonhost Arabidopsis resistance protein is introduced in comparison to the wild-type plants to confer resistance to plant pathogens. The invention relates to transgenic plants and/or plant cells having an increased resistance against plant pathogens particularly Phytophthora and Fusarium virguliforme to expression vectors, transformed plants and plant cells as well as the use of such plants in a plant breeding program.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention is in the field of plant genetics. More specifically, the invention relates to nucleic acid molecules from regions of the Arabidopsis genome which are associated with nonhost pathogen resistance, particularly to Phytophthora spp. and Fusarium virguliforme. The invention also relates to proteins encoded by such nucleic acid molecules as well as nucleic acid markers which are associated with Phytophthora resistance. Moreover, the invention relates to uses of such molecules, including, transforming Phytophthora and Fusarium susceptible plants with constructs containing the nucleic acid molecules to create transgenic plants with Phytophthora and Fusarium resistance and the use of such molecules, transformed cells, plants and plant parts in a plant breeding program."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define field of invention"
                    ],
                    "num_characters": 793,
                    "outline_medium": [
                        "define field of invention"
                    ],
                    "outline_short": [
                        "define field of invention"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Soybean [Glycine max L. (Merrill)] is a major oil seed crop and is grown throughout much of the world. The United States alone produces over half of the world output. Soybean seed typically contains 40% protein and 20% oil and is used primarily for livestock feed and industrial purposes, in addition to human consumption. In North America, soybean suffers yield loss from the root and stem rot disease caused by oomycete pathogen Phytophthora sojae. Phytophthora sojae (Kauffman & Gerdemann) is an oomycete pathogen which causes extensive damage to roots and stems of soybean plants (Glycine max) (Zhang et al., MPMI, 19:1302-1310 (2006)). Symptoms of Phytophthora Root Rot (PRR) caused by P. sojae include yellowing and wilting of leaves and browning of lower stems and branches (Demirbas et al., Crop Sci. 41:1220-1227 (2001)). In the United States the annual crop losses from this disease were valued to about 0.2-0.3 billion dollars (Wrather et al. 2001) Annual worldwide soybean crop losses amount to $1 to $2 billion (Zhang et al., MPMI, 19: 1302-1310 (2006)). Plant resistance to this and other sort of pathogens present a major problem to soybean growers.",
                        "Resistance generally means the ability of a plant to prevent, or at least curtail the infestation and colonization by a harmful pathogen. Different mechanisms can be discerned in the naturally occurring resistance, with which the plants fend off colonization by phytopathogenic organisms. These specific interactions between the pathogen and the host determine the course of infection (Schopfer and Brennicke (1999) Pflanzenphysiologie, Springer Verlag, Berlin-Heidelberg, Germany).",
                        "With regard to race specific resistance, also called host resistance, a differentiation is made between compatible and incompatible interactions. In the compatible interaction, an interaction occurs between a virulent pathogen and a susceptible plant. The pathogen survives, and may build up reproduction structures, while the host dies off. An incompatible interaction occurs on the other hand when the pathogen infects the plant but is inhibited in its growth before or after weak development of symptoms. In the latter case, the plant is resistant to the respective pathogen (Schopfer and Brennick, vide supra). In both compatible and incompatible interactions a defensive and specific reaction of the host to the pathogen occurs.",
                        "In nature, however, this host resistance is often overcome because of the rapid evolutionary development of pathogens (Neu et al. (2003) American Cytopathol. Society, MPMI 16 No. 7: 626-633). In contrast, non-host resistance offers strong, broad, and permanent protection from phytopathogens. Non-host resistance relates to the phenomenon where a pathogen can induce a disease in a certain plant species, but not in other plant species (Heath (2002) Can. J. Plant Pathol. 24: 259-264).",
                        "Despite this interesting characteristic, the genetic and molecular biological basis for nonhost resistance have up to now only been poorly understood. There are indications that non-host resistance is induced by unspecific agents, and also that individual pathogen proteins induce the non-host resistance reaction (Heath (1981) Phytopathology 71: 1121-1123; Heath (2001) Physiol. Mol. Plant. Pathol. 58: 53-54; Kamoun et al. (1998) Plant Cell 10: 1413-1425; Lauge et al. (2000) Plant J. 23: 735-745; Whalen et al. (1988) Proc. Natl. Acad. Sci. USA 85: 6743-6747). The phenomenon of non-host resistance might also be based on structural or chemical properties of the plant species, such as the thickness of the cuticle or the presence of inhibitory substances.",
                        "It is an object of the present invention to use non-host resistance in Arabidopsis to engineer resistance to susceptible host plants against Phytophthora and Fusarium.",
                        "Other objects will become apparent from the description of the invention which follows."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce soybean crop",
                        "describe Phytophthora sojae disease",
                        "discuss economic impact of disease",
                        "define plant resistance",
                        "explain race specific resistance",
                        "describe non-host resistance",
                        "motivate use of non-host resistance"
                    ],
                    "num_characters": 3889,
                    "outline_medium": [
                        "introduce soybean and its importance",
                        "describe Phytophthora sojae and its effects",
                        "discuss plant resistance and non-host resistance"
                    ],
                    "outline_short": [
                        "discuss soybean disease problem"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "In one aspect, this invention relates to nucleic acid isolated from Arabidopsis thaliana which are associated with its non-host resistance to Phytophthora. Also according to the invention, protein sequences are disclosed which are encoded by the same. These sequences alone, or in combination with other sequences, can be used to improve the resistance in susceptible plant species such as soybean to Phytophthora. In another aspect of the present invention, expression cassettes and transformation vectors comprising the isolated nucleotide sequences are disclosed. The transformation vectors can be used to transform plants and express these pathogen non host resistance genes in the transformed cells. Transformed cells as well as regenerated transgenic plants and seeds containing and expressing the isolated DNA sequences and protein products are also provided.",
                        "Therefore, in one aspect, the present invention relates to an isolated nucleic acid comprising an isolated polynucleotide sequence encoding a non-host resistance gene product isolated from Arabeopsis that confers its non-host resistance. Several non-host resistance genes have been identified according to the invention, including At5g64600 (O-fucosyltrasnferase protein) (SEQ ID NOS: 1, 2, and 19); At5g65900 (DEAD-box ATP-dependent RNA helicase 27) (SEQ ID NOS 3, 4, and 20); At5g66380 (folate transporter 1, or FOLT1) (SEQ ID NOS: 3, 4, and 21); At3g59640 (glycine-rich protein) (SEQ ID NOS 7,8, and 22); At3g59650 (mitochondrial ribosomal protein L51/S25/Cl-B8 protein) (SEQ ID NOS 9, 10, and 23); At3g60310 (protein of unknown function) (SEQ ID NOS 11. 12. And 24); At3g60840 (MAP65-4, microtubule-associated protein 65-4) (SEQ ID NOs:13, 14, and 25; At3g60920 (protein of unknown function) (SEQ ID NOS:15, 16, and 26); At3g61580 (fatty acid/spingolipid desaturase) (SEQ ID NOS:17, 18 and 27). Sequences reported above are non-limiting examples of potential coding sequences of these genes recited herein and are reported as CDS, amino acid, and genomic respectively.",
                        "In a further aspect, the present invention includes a nucleic acid selected from: (a) an isolated polynucleotide encoding a polypeptide of the present invention; (b) a polynucleotide having at least 90% or 95% identity to a polynucleotide of the present invention; (c) a polynucleotide comprising at least 50 or more nucleotides in length which hybridizes under high stringency conditions to a polynucleotide of the present invention; (d) a polynucleotide comprising a polynucleotide of the present invention; and (e) a polynucleotide which is complementary to the polynucleotide of (a) to (e). The present invention includes and provides a method of investigating an haplotype of a plant comprising: (A) isolating nucleic acid molecules from the plant; (B) determining the nucleic acid sequence of a nonhost resistance gene; and, (C) comparing the nucleic acid sequence of the allele or part thereof to a reference nucleic acid sequence. The present invention includes and provides a method of introgressing Phytophthora resistance or partial Phytophthora resistance into a susceptible plant comprising: performing marker assisted selection of the plant with a nucleic acid marker, wherein the nucleic acid marker specifically hybridizes with a nucleic acid molecule encoding a non host resistance gene reported herein and, selecting the plant based on the marker assisted selection.",
                        "The present invention includes and provides a method of investigating a nonhost Phytophtora and Fusarium resistance haplotype of a plant comprising: (A) isolating nucleic acid molecules from the plant; (B) determining the nucleic acid sequence of an nonhost resistance allele or part thereof; and (C) comparing the nucleic acid sequence of the allele or part thereof to a reference nucleic acid sequence.",
                        "In another aspect, the present invention relates to a recombinant expression cassette comprising a nucleic acid as described, supra. Additionally, the present invention relates to a vector containing the recombinant expression cassette. Further, the vector containing the recombinant expression cassette can facilitate the transcription and translation of the nucleic acid in a host cell. The present invention also relates to host cells able to express the polynucleotide of the present invention. A number of host cells could be used, such as but not limited to, microbial, mammalian, plant, or insect. Thus the invention is also directed to transgenic cells, containing the nucleic acids of the present invention as well as cells, plants, tissue cultures and ultimately lines derived therefrom. The invention also relates to vectors and cassettes designed to introduce the expression of nonhost resistance proteins for modulation of the Phytophthora interaction, or for delineation of information about the regulatory pathways involving the same.",
                        "This invention also provides an isolated polypeptide comprising (a) a polypeptide comprising at least 90% or 95% sequence identity to a polypeptide of the present invention (b) a polypeptide encoded by a nucleic acid of the present invention; and (c) a polypeptide comprising a nonhost resistance activity and comprising conserved structural domain motifs of the same.",
                        "Another embodiment of the subject invention comprises methods for engineering broad-spectrum pathogen resistance in soybean or other Phytophthora susceptible crop plants by introducing nonhost resistance protein encoding sequences to said plants. Plants' tolerance to Phytophthora and other soybean pathogens may be improved by elucidating the pathways that regulate gene transcription involved in enhancing accumulation of products shown to be associated with expression of other pathogen resistance, methods for providing for increased nonspecific resistance to particularly virulent races or strains of pathogenic agents including P. sojae, Pseudomonas syringae pv. glycenia (Psg), soybean cyst nematode (SCN), Fusarium virguliforme or soybean mosaic virus.",
                        "Nucleotide sequences isolated from the nonhost resistance genes which may be introduced to plants can be used in developing perfect molecular markers that can be routinely used in breeding programs for incorporating Phytophthora resistance into new cultivars.",
                        "Units, prefixes, and symbols may be denoted in their SI accepted form. Unless otherwise indicated, nucleic acids are written left to right in 5′ to 3′ orientation; amino acid sequences are written left to right in amino to carboxy orientation, respectively. Numeric ranges are inclusive of the numbers defining the range and include each integer within the defined range. Amino acids may be referred to herein by either their commonly known three letter symbols or by the one-letter symbols recommended by the IUPAC-IUB Biochemical nomenclature Commission. Nucleotides, likewise, may be referred to by their commonly accepted single-letter codes. Unless otherwise provided for, software, electrical, and electronics terms as used herein are as defined in The New IEEE Standard Dictionary of Electrical and Electronics Terms (5th edition, 1993). The terms defined below are more fully defined by reference to the specification as a whole.",
                        "By “amplified” is meant the construction of multiple copies of a nucleic acid sequence or multiple copies complementary to the nucleic acid sequence using at least one of the nucleic acid sequences as a template. Amplification systems include the polymerase chain reaction (PCR) system, ligase chain reaction (LCR) system, nucleic acid sequence based amplification (NASBA, Canteen, Mississauga, Ontario), Q-Beta Replicase systems, transcription-based amplification system (TAS), and strand displacement amplification (SDA). See, e.g., Diagnostic Molecular Microbiology: Principles and Applications, D. H. Persing et al., Ed., American Society for Microbiology, Washington, D.C. (1993). The product of amplification is termed an amplicon.",
                        "As used herein, “chromosomal region” includes reference to a length of a chromosome that may be measured by reference to the linear segment of DNA that it comprises. The chromosomal region can be defined by reference to two unique DNA sequences, i.e., markers.",
                        "The term “conservatively modified variants” applies to both amino acid and nucleic acid sequences. With respect to particular nucleic acid sequences, conservatively modified variants refer to those nucleic acids which encode identical or conservatively modified variants of the amino acid sequences. Because of the degeneracy of the genetic code, a large number of functionally identical nucleic acids encode any given protein. For instance, the codons GCA, GCC, GCG and GCU all encode the amino acid alanine. Thus, at every position where an alanine is specified by a codon, the codon can be altered to any of the corresponding codons described without altering the encoded polypeptide. Such nucleic acid variations are “silent variations” and represent one species of conservatively modified variation. Every nucleic acid sequence herein that encodes a polypeptide also, by reference to the genetic code, describes every possible silent variation of the nucleic acid. One of ordinary skill will recognize that each codon in a nucleic acid (except AUG, which is ordinarily the only codon for methionine; and UGG, which is ordinarily the only codon for tryptophan) can be modified to yield a functionally identical molecule. Accordingly, each silent variation of a nucleic acid which encodes a polypeptide of the present invention is implicit in each described polypeptide sequence and is within the scope of the present invention.",
                        "As to amino acid sequences, one of skill will recognize that individual substitutions, deletions or additions to a nucleic acid, peptide, polypeptide, or protein sequence which alters, adds or deletes a single amino acid or a small percentage of amino acids in the encoded sequence is a “conservatively modified variant” where the alteration results in the substitution of an amino acid with a chemically similar amino acid. Thus, any number of amino acid residues selected from the group of integers consisting of from 1 to 15 can be so altered. Thus, for example, 1, 2, 3, 4, 5, 7, or 10 alterations can be made. Conservatively modified variants typically provide similar biological activity as the unmodified polypeptide sequence from which they are derived. For example, substrate specificity, enzyme activity, or ligand/receptor binding is generally at least 30%, 40%, 50%, 60%, 70%, 80%, or 90% of the native protein for its native substrate. Conservative substitution tables providing functionally similar amino acids are well known in the art.",
                        "The following six groups each contain amino acids that are conservative substitutions for one another:",
                        "1) Alanine (A), Serine (S), Threonine (T);",
                        "2) Aspartic acid (D), Glutamic acid (E);",
                        "3) Asparagine (N), Glutamine (Q);",
                        "4) Arginine (R), Lysine (K);",
                        "5) Isoleucine (I), Leucine (L), Methionine (M), Valine (V); and",
                        "6) Phenylalanine (F), Tyrosine (Y), Tryptophan (W).",
                        "See also, Creighton (1984) Proteins W.H. Freeman and Company.",
                        "By “encoding” or “encoded”, with respect to a specified nucleic acid, is meant comprising the information for translation into the specified protein. A nucleic acid encoding a protein may comprise non-translated sequences (e.g., introns) within translated regions of the nucleic acid, or may lack such intervening non-translated sequences (e.g., as in cDNA). The information by which a protein is encoded is specified by the use of codons. Typically, the amino acid sequence is encoded by the nucleic acid using the “universal” genetic code. However, variants of the universal code, such as are present in some plant, animal, and fungal mitochondria, the bacterium Mycoplasma capricolum, or the ciliate Macronucleus, may be used when the nucleic acid is expressed therein.",
                        "When the nucleic acid is prepared or altered synthetically, advantage can be taken of known codon preferences of the intended host where the nucleic acid is to be expressed. For example, although nucleic acid sequences of the present invention may be expressed in both monocotyledonous and dicotyledonous plant species, sequences can be modified to account for the specific codon preferences and GC content preferences of monocotyledons or dicotyledons as these preferences have been shown to differ (Murray et al. Nucl. Acids Res. 17:477-498 (1989)).",
                        "As used herein “full-length sequence” in reference to a specified polynucleotide or its encoded protein means having the entire amino acid sequence of, a native (non-synthetic), endogenous, biologically active form of the specified protein. Methods to determine whether a sequence is full-length are well known in the art including such exemplary techniques as northern or western blots, primer extensions, S1 protection, and ribonuclease protection. See, e.g., Plant Molecular Biology: A Laboratory Manual, Clark, Ed., Springer-Verlag, Berlin (1997). Comparison to known full-length homologous (orthologous and/or paralogous) sequences can also be used to identify full-length sequences of the present invention. Additionally, consensus sequences typically present at the 5′ and 3′ untranslated regions of mRNA aid in the identification of a polynucleotide as full-length. For example, the consensus sequence ANNNNG, where the underlined codon represents the N-terminal methionine, aids in determining whether the polynucleotide has a complete 5′ end. Consensus sequences at the 3′ end, such as polyadenylation sequences, aid in determining whether the polynucleotide has a complete 3′ end.",
                        "As used herein, “heterologous” in reference to a nucleic acid is a nucleic acid that originates from a foreign species, or, if from the same species, is substantially modified from its native form in composition and/or genomic locus by deliberate human intervention. For example, a promoter operably linked to a heterologous structural gene is from a species different from that from which the structural gene was derived, or, if from the same species, one or both are substantially modified from their original form. A heterologous protein may originate from a foreign species or, if from the same species, is substantially modified from its original form by deliberate human intervention.",
                        "By “host cell” is meant a cell which contains a vector and supports the replication and/or expression of the vector. Host cells may be prokaryotic cells such as E. coli, or eukaryotic cells such as yeast, insect, amphibian, or mammalian cells. Preferably, host cells are monocotyledonous or dicotyledonous plant cells. A particularly preferred monocotyledonous host cell is a maize host cell.",
                        "The term “hybridization complex” includes reference to a duplex nucleic acid structure formed by two single-stranded nucleic acid sequences selectively hybridized with each other.",
                        "The term “introduced” in the context of inserting a nucleic acid into a cell, means “transfection” or “transformation” or “transduction” and includes reference to the incorporation of a nucleic acid into a eukaryotic or prokaryotic cell where the nucleic acid may be incorporated into the genome of the cell (e.g., chromosome, plasmid, plastid or mitochondrial DNA), converted into an autonomous replicon, or transiently expressed (e.g., transfected mRNA).",
                        "The term “isolated” refers to material, such as a nucleic acid or a protein, which is: (1) substantially or essentially free from components that normally accompany or interact with it as found in its naturally occurring environment. The isolated material optionally comprises material not found with the material in its natural environment; or (2) if the material is in its natural environment, the material has been synthetically (non-naturally) altered by deliberate human intervention to a composition and/or placed at a location in the cell (e.g., genome or subcellular organelle) not native to a material found in that environment. The alteration to yield the synthetic material can be performed on the material within or removed from its natural state. For example, a naturally occurring nucleic acid becomes an isolated nucleic acid if it is altered, or if it is transcribed from DNA which has been altered, by means of human intervention performed within the cell from which it originates. See, e.g., Compounds and Methods for Site Directed Mutagenesis in Eukaryotic Cells, Kmiec, U.S. Pat. No. 5,565,350; In Vivo Homologous Sequence Targeting in Eukaryotic Cells; Zarling et al., PCT/US93/03868. Likewise, a naturally occurring nucleic acid (e.g., a promoter) becomes isolated if it is introduced by non-naturally occurring means to a locus of the genome not native to that nucleic acid. Nucleic acids which are “isolated” as defined herein, are also referred to as “heterologous” nucleic acids.",
                        "As used herein, “localized within the chromosomal region defined by and including” with respect to particular markers includes reference to a contiguous length of a chromosome delimited by and including the stated markers.",
                        "As used herein, “marker” includes reference to a locus on a chromosome that serves to identify a unique position on the chromosome. A “polymorphic marker” includes reference to a marker which appears in multiple forms (alleles) such that different forms of the marker, when they are present in a homologous pair, allow transmission of each of the chromosomes of that pair to be followed. A genotype may be defined by use of one or a plurality of markers.",
                        "As used herein, the term “nonhost resistance protein” shall include any amino acid sequence which retain one or more of the properties of proteins listed herein in general. They also must be capable of interacting with Phytophthora infection in that loss of function mutations can render an Arabidopsis plant susceptible to Phytophthora infection. Such proteins may include At5g64600 (O-fucosyltrasnferase protein) (SEQ ID NOS: 1, 2, and 19); At5g65900 (DEAD-box ATP-dependant RNA helicase 27) (SEQ ID NOS 3, 4, and 20); At5g66380 (folate transporter 1, or FOLT1) (SEQ ID NOS: 3, 4, and 21); At3g59640 (glycine-rich protein) (SEQ ID NOS:7, 8, and 22); At3g59650 (mitochondrial ribosomal protein L51/S25/Cl-B8 protein) (SEQ ID NOS:9, 10, and 23); At3g60310 (protein of unknown function) (SEQ ID NOS: 11, 12, and 24); At3g60840 (MAP65-4, microtubule-associated protein 65-4) (SEQ ID NOS:13, 14, and 25; At3g60920 (protein of unknown function) (SEQ ID NOS:15, 16, and 26); At3g61580 (fatty acid/spingolipid desaturase) (SEQ ID NOS:17, 18 and 27) and any conservatively modified variants, fragments, and homologs or full length sequences incorporating the same which retain the Phyphthora infection related activity described herein. Nonhost resistance proteins are capable of suppressing, controlling, and/or preventing invasion by the pathogenic organism. A non host resistance protein will reduce the disease symptoms resulting from pathogen challenge in a previously susceptible plant by at least about 2%, including but not limited to, about 2%, 3%, 4%, 5%, 6%, 7%, 8%, 9%, 10%, 15%, 20%, 25%, 30%, 35%, 40%, 45%, 50%, 55%, 60%, 65%, 70%, 75%, 80%, 85%, 90%, 95%, 96%, 97%, 98%, 99%, or greater. In particular embodiments, the disease symptoms resulting from pathogen challenge are reduced by non host resistance protein by at least about 5% to about 50%, at least about 10% to about 60%, at least about 30% to about 70%, at least about 40% to about 80%, or at least about 50% to about 90% or greater. Hence, the methods of the invention can be utilized to protect plants from disease, particularly those diseases that are caused by plant pathogens. Resistance may vary from a slight increase in tolerance to the effects of the pathogen (e.g., partial inhibition) to total resistance such that the plant is unaffected by the presence of the pathogen. An increased level of resistance against a particular pathogen or against a wider spectrum of pathogens may both constitute complete resistance or improved resistance.",
                        "“Pathogen resistance”, “disease resistance” or “Phytophthora resistance” is intended to mean that the plant avoids the disease symptoms that are the outcome of plant-pathogen interactions. That is, pathogens are prevented from causing plant diseases and the associated disease symptoms, or alternatively, the disease symptoms caused by the pathogen are minimized or lessened, such as, for example, the reduction of stress and associated yield loss.",
                        "Assays that measure antipathogenic activity are commonly known in the art, as are methods to quantitate disease resistance in plants following pathogen infection. See, for example, U.S. Pat. No. 5,614,395, herein incorporated by reference. Such techniques include, measuring over time, the average lesion diameter, the pathogen biomass, and the overall percentage of decayed plant tissues. For example, a plant either expressing an non host resistance polypeptide shows a decrease in tissue necrosis (i.e., lesion diameter) or a decrease in plant death following pathogen challenge when compared to a control plant that was not engineered to express the nonhost resistance protein.",
                        "Alternatively, antipathogenic activity can be measured by a decrease in pathogen biomass. For example, a plant expressing non host resistance protein is challenged with a pathogen of interest. Over time, tissue samples from the pathogen-inoculated tissues are obtained and RNA is extracted. The percent of a specific pathogen RNA transcript relative to the level of a plant specific transcript allows the level of pathogen biomass to be determined. See, for example, Thomma et al. (1998) Plant Biology 95:15107-15111, herein incorporated by reference. According to the invention, the term “increased resistance” (against Phytophthora sp.) is understood to mean that the transgenic plants, or plant cells, according to the invention are less vigorously, and/or less frequently, affected by Phytophthora than non-transformed wild type plants, or plant cells, which were otherwise treated in the same way (such as climate and cultivation conditions, pathogen type, etc.). According to the invention, the term “wild type” is to be understood as the respective non genetically modified parent organism. The penetration efficiency as well as the rate of papillae formation offer a possibility to quantify the reaction of the plant to the pathogen infestation (see examples). The term “increased resistance” also comprises what is known as transient pathogen resistance, i.e. the transgenic plants, or plant cells, according to the invention have an increased pathogen resistance as compared to the respective wild type only for a limited period of time.",
                        "By “nucleic acid library” is meant a collection of isolated DNA or cDNA molecules which comprise and substantially represent the entire transcribed fraction of a genome of a specified organism. Construction of exemplary nucleic acid libraries, such as genomic and cDNA libraries, is taught in standard molecular biology references such as Berger and Kimmel, Guide to Molecular Cloning Techniques, Methods in Enzymology, Vol. 152, Academic Press, Inc., San Diego, Calif. (Berger); Sambrook et al., Molecular Cloning—A Laboratory Manual, 2nd ed., Vol. 1-3 (1989); and Current Protocols in Molecular Biology, F. M. Ausubel et al., Eds., Current Protocols, a joint venture between Greene Publishing Associates, Inc. and John Wiley & Sons, Inc. (1994).",
                        "As used herein “operably linked” includes reference to a functional linkage between a promoter and a second sequence, wherein the promoter sequence initiates and mediates transcription of the DNA sequence corresponding to the second sequence. Generally, operably linked means that the nucleic acid sequences being linked are contiguous and, where necessary to join two protein coding regions, contiguous and in the same reading frame.",
                        "As used herein, the term “plant” can include reference to whole plants, plant parts or organs (e.g., leaves, stems, roots, etc.), plant cells, seeds and progeny of same. Plant cell, as used herein, further includes, without limitation, cells obtained from or found in: seeds, suspension cultures, embryos, meristematic regions, callus tissue, leaves, roots, shoots, gametophytes, sporophytes, pollen, and microspores. Plant cells can also be understood to include modified cells, such as protoplasts, obtained from the aforementioned tissues. The class of plants which can be used in the methods of the invention is generally as broad as the class of higher plants amenable to transformation techniques, including both monocotyledonous and dicotyledonous plants. Particularly preferred plants include maize, soybean, sunflower, sorghum, canola, wheat, alfalfa, cotton, rice, barley, and millet.",
                        "As used herein, “polynucleotide” includes reference to a deoxyribopolynucleotide, ribopolynucleotide, or analogs thereof that have the essential nature of a natural ribonucleotide in that they hybridize, under stringent hybridization conditions, to substantially the same nucleotide sequence as naturally occurring nucleotides and/or allow translation into the same amino acid(s) as the naturally occurring nucleotide(s). A polynucleotide can be full-length or a subsequence of a native or heterologous structural or regulatory gene. Unless otherwise indicated, the term includes reference to the specified sequence as well as the complementary sequence thereof. Thus, DNAs or RNAs with backbones modified for stability or for other reasons as “polynucleotides” as that term is intended herein. Moreover, DNAs or RNAs comprising unusual bases, such as inosine, or modified bases, such as tritylated bases, to name just two examples, are polynucleotides as the term is used herein. It will be appreciated that a great variety of modifications have been made to DNA and RNA that serve many useful purposes known to those of skill in the art. The term polynucleotide as it is employed herein embraces such chemically, enzymatically or metabolically modified forms of polynucleotides, as well as the chemical forms of DNA and RNA characteristic of viruses and cells, including among other things, simple and complex cells.",
                        "The terms “polypeptide”, “peptide” and “protein” are used interchangeably herein to refer to a polymer of amino acid residues. The terms apply to amino acid polymers in which one or more amino acid residue is an artificial chemical analogue of a corresponding naturally occurring amino acid, as well as to naturally occurring amino acid polymers. The essential nature of such analogues of naturally occurring amino acids is that, when incorporated into a protein, that protein is specifically reactive to antibodies elicited to the same protein but consisting entirely of naturally occurring amino acids. The terms “polypeptide”, “peptide” and “protein” are also inclusive of modifications including, but not limited to, glycosylation, lipid attachment, sulfation, gamma-carboxylation of glutamic acid residues, hydroxylation and ADP-ribosylation. It will be appreciated, as is well known and as noted above, that polypeptides are not entirely linear. For instance, polypeptides may be branched as a result of ubiquitination, and they may be circular, with or without branching, generally as a result of posttranslation events, including natural processing event and events brought about by human manipulation which do not occur naturally. Circular, branched and branched circular polypeptides may be synthesized by non-translation natural process and by entirely synthetic methods, as well. Further, this invention contemplates the use of both the methionine-containing and the methionine-less amino terminal variants of the protein of the invention.",
                        "As used herein “promoter” includes reference to a region of DNA upstream from the start of transcription and involved in recognition and binding of RNA polymerase and other proteins to initiate transcription. A “plant promoter” is a promoter capable of initiating transcription in plant cells whether or not its origin is a plant cell. Exemplary plant promoters include, but are not limited to, those that are obtained from plants, plant viruses, and bacteria which comprise genes expressed in plant cells such as Agrobacterium or Rhizobium. Examples of promoters under developmental control include promoters that preferentially initiate transcription in certain tissues, such as leaves, roots, or seeds. Such promoters are referred to as “tissue preferred”. Promoters which initiate transcription only in certain tissue are referred to as “tissue specific”. A “cell type” specific promoter primarily drives expression in certain cell types in one or more organs, for example, vascular cells in roots or leaves. An “inducible” or “repressible” promoter is a promoter which is under environmental control. Examples of environmental conditions that may affect transcription by inducible promoters include anaerobic conditions or the presence of light. Tissue specific, tissue preferred, cell type specific, and inducible promoters constitute the class of “non-constitutive” promoters. A “constitutive” promoter is a promoter which is active under most environmental conditions.",
                        "As used herein “recombinant” includes reference to a cell or vector, that has been modified by the introduction of a heterologous nucleic acid or that the cell is derived from a cell so modified. Thus, for example, recombinant cells express genes that are not found in identical form within the native (non-recombinant) form of the cell or express native genes that are otherwise abnormally expressed, under-expressed or not expressed at all as a result of deliberate human intervention. The term “recombinant” as used herein does not encompass the alteration of the cell or vector by naturally occurring events (e.g., spontaneous mutation, natural transformation/transduction/transposition) such as those occurring without deliberate human intervention.",
                        "As used herein, a “recombinant expression cassette” is a nucleic acid construct, generated recombinantly or synthetically, with a series of specified nucleic acid elements which permit transcription of a particular nucleic acid in a host cell. The recombinant expression cassette can be incorporated into a plasmid, chromosome, mitochondrial DNA, plastid DNA, virus, or nucleic acid fragment. Typically, the recombinant expression cassette portion of an expression vector includes, among other sequences, a nucleic acid to be transcribed, and a promoter.",
                        "The term “residue” or “amino acid residue” or “amino acid” are used interchangeably herein to refer to an amino acid that is incorporated into a protein, polypeptide, or peptide (collectively “protein”). The amino acid may be a naturally occurring amino acid and, unless otherwise limited, may encompass non-natural analogs of natural amino acids that can function in a similar manner as naturally occurring amino acids.",
                        "The term “selectively hybridizes” includes reference to hybridization, under stringent hybridization conditions, of a nucleic acid sequence to a specified nucleic acid target sequence to a detectably greater degree (e.g., at least 2-fold over background) than its hybridization to non-target nucleic acid sequences and to the substantial exclusion of non-target nucleic acids. Selectively hybridizing sequences typically have about at least 80% sequence identity, preferably 90% sequence identity, and most preferably 100% sequence identity (i.e., complementary) with each other.",
                        "The term “stringent conditions” or “stringent hybridization conditions” includes reference to conditions under which a probe will hybridize to its target sequence, to a detectably greater degree than to other sequences (e.g., at least 2-fold over background). Stringent conditions are sequence-dependent and be different in different circumstances. By controlling the stringency of the hybridization and/or washing conditions, target sequences can be identified which are 100% complementary to the probe (homologous probing). Alternatively, stringency conditions can be adjusted to allow some mismatching in sequences so that lower degrees of similarity are detected (heterologous probing). Generally, a probe is less than about 1000 nucleotides in length, optionally less than 500 nucleotides in length.",
                        "Typically, stringent conditions will be those in which the salt concentration is less than about 1.5 M Na ion, typically about 0.01 to 1.0 M Na ion concentration (or other salts) at pH 7.0 to 8.3 and the temperature is at least about 30° C. for short probes (e.g., 10 to 50 nucleotides) and at least about 60° C. for long probes (e.g., greater than 50 nucleotides). Stringent conditions may also be achieved with the addition of destabilizing agents such as formamide. Exemplary low stringency conditions include hybridization with a buffer solution of 30 to 35% formamide, 1 M NaCl, 1% SDS (sodium dodecyl sulphate) at 37° C., and a wash in 1× to 2×SSC (20×SSC=3.0 M NaCl/0.3 M trisodium citrate) at 50 to 55° C. Exemplary moderate stringency conditions include hybridization in 40 to 45% formamide, 1 M NaCl, 1% SDS at 37° C., and a wash in 0.5× to 1×SSC at 55 to 50° C. Exemplary high stringency conditions include hybridization in 50% formamide, 1 M NaCl, 1% SDS at 37° C., and a wash in 0.1×SSC at 60 to 65° C. for 20 minutes.",
                        "Specificity is typically the function of post-hybridization washes, the critical factors being the ionic strength and temperature of the final wash solution. For DNA-DNA hybrids, the Tm can be approximated from the equation of Meinkoth and Wahl, Anal. Biochem., 138:267-284 (1984): Tm81.5° C.+16.6 (log M)+0.41 (% GC)−0.61 (% form)−500/L; where M is the molarity of monovalent cations, % GC is the percentage of guanosine and cytosine nucleotides in the DNA, % form is the percentage of formamide in the hybridization solution, and L is the length of the hybrid in base pairs. The Tm is the temperature (under defined ionic strength and pH) at which 50% of the complementary target sequence hybridizes to a perfectly matched probe. Tm is reduced by about 1° C. for each 1% of mismatching; thus, Tm, hybridization and/or wash conditions can be adjusted to hybridize to sequences of the desired identity. For example, if sequences with ≧90% identity are sought, the Tm can be decreased 10° C. Generally, stringent conditions are selected to be about 5° C. lower than the thermal melting point (Tm) for the specific sequence and its complement at a defined ionic strength and pH. However, severely stringent conditions can utilize a hybridization and/or wash at 1, 2, 3, or 4° C. lower than the thermal melting point (Tm); moderately stringent conditions can utilize a hybridization and/or wash at 6, 7, 8, 9, or 10° C. lower than the thermal melting point (Tm); low stringency conditions can utilize a hybridization and/or wash at 11, 12, 13, 14, 15, or 20° C. lower than the thermal melting point (Tm). Using the equation, hybridization and wash compositions, and desired Tm, those of ordinary skill will understand that variations in the stringency of hybridization and/or wash solutions are inherently described. If the desired degree of mismatching results in a Tm of less than 45° C. (aqueous solution) or 32° C. (formamide solution) it is preferred to increase the SSC concentration so that a higher temperature can be used. An extensive guide to the hybridization of nucleic acids is found in Tijssen, Laboratory Techniques in Biochemistry and Molecular Biology—Hybridization with Nucleic Acids Probes, Part I, Chapter 2, Ausubel, et al., Eds., Greene Publishing and Wiley-Interscience, New York (1995). In general a high stringency wash is 2×15 min in 0.5×SSC containing 0.1% SDS at 65° C.",
                        "As used herein, “transgenic plant” includes reference to a plant which comprises within its genome a heterologous polynucleotide. Generally, the heterologous polynucleotide is stably integrated within the genome such that the polynucleotide is passed on to successive generations. The heterologous polynucleotide may be integrated into the genome alone or as part of a recombinant expression cassette. “Transgenic” is used herein to include any cell, cell line, callus, tissue, plant part or plant, the genotype of which has been altered by the presence of heterologous nucleic acid including those transgenics initially so altered as well as those created by sexual crosses or asexual propagation from the initial transgenic. The term “transgenic” as used herein does not encompass the alteration of the genome (chromosomal or extra-chromosomal) by conventional plant breeding methods or by naturally occurring events such as random cross-fertilization, non-recombinant viral infection, non-recombinant bacterial transformation, non-recombinant transposition, or spontaneous mutation.",
                        "As used herein, “vector” includes reference to a nucleic acid used in transfection of a host cell and into which can be inserted a polynucleotide. Vectors are often replicons. Expression vectors permit transcription of a nucleic acid inserted therein.",
                        "The following terms are used to describe the sequence relationships between two or more nucleic acids or polynucleotides: (a) “reference sequence”, (b) “comparison window”, (c) “sequence identity”, (d) “percentage of sequence identity”, and (e) “substantial identity”.",
                        "(a) As used herein, “reference sequence” is a defined sequence used as a basis for sequence comparison. A reference sequence may be a subset or the entirety of a specified sequence; for example, as a segment of a full-length cDNA or gene sequence, or the complete cDNA or gene sequence.",
                        "(b) As used herein, “comparison window” includes reference to a contiguous and specified segment of a polynucleotide sequence, wherein the polynucleotide sequence may be compared to a reference sequence and wherein the portion of the polynucleotide sequence in the comparison window may comprise additions or deletions (i.e., gaps) compared to the reference sequence (which does not comprise additions or deletions) for optimal alignment of the two sequences. Generally, the comparison window is at least 20 contiguous nucleotides in length, and optionally can be 30, 40, 50, 100, or longer. Those of skill in the art understand that to avoid a high similarity to a reference sequence due to inclusion of gaps in the polynucleotide sequence, a gap penalty is typically introduced and is subtracted from the number of matches.",
                        "Methods of alignment of sequences for comparison are well-known in the art. Optimal alignment of sequences for comparison may be conducted by the local homology algorithm of Smith and Waterman, Adv. Appl. Math. 2:482 (1981); by the homology alignment algorithm of Needleman and Wunsch, J. Mol. Biol. 48:443 (1970); by the search for similarity method of Pearson and Lipman, Proc. Natl. Acad. Sci. 85:2444 (1988); by computerized implementations of these algorithms, including, but not limited to: CLUSTAL in the PC/Gene program by Intelligenetics, Mountain View, Calif.; GAP, BESTFIT, BLAST, FASTA, and TFASTA in the Wisconsin Genetics Software Package, Genetics Computer Group (GCG), 575 Science Dr., Madison, Wis., USA; the CLUSTAL program is well described by Higgins and Sharp, Gene 73:237-244 (1988); Higgins and Sharp, CABIOS 5:151-153 (1989); Corpet, et al., Nucleic Acids Research 16:10881-90 (1988); Huang, et al., Computer Applications in the Biosciences 8:155-65 (1992), and Pearson, et al., Methods in Molecular Biology 24:307-331 (1994). The BLAST family of programs which can be used for database similarity searches includes: BLASTN for nucleotide query sequences against nucleotide database sequences; BLASTX for nucleotide query sequences against protein database sequences; BLASTP for protein query sequences against protein database sequences; TBLASTN for protein query sequences against nucleotide database sequences; and TBLASTX for nucleotide query sequences against nucleotide database sequences. See, Current Protocols in Molecular Biology, Chapter 19, Ausubel, et al., Eds., Greene Publishing and Wiley-Interscience, New York (1995).",
                        "Unless otherwise stated, sequence identity/similarity values provided herein refer to the value obtained using the BLAST 2.0 suite of programs using default parameters. Altschul et al., Nucleic Acids Res. 25:3389-3402 (1997). Software for performing BLAST analyses is publicly available, e.g., through the National Center for Biotechnology-Information World Wide Web at ncbi.nih.gov. This algorithm involves first identifying high scoring sequence pairs (HSPs) by identifying short words of length W in the query sequence, which either match or satisfy some positive-valued threshold score T when aligned with a word of the same length in a database sequence. T is referred to as the neighborhood word score threshold (Altschul et al., supra). These initial neighborhood word hits act as seeds for initiating searches to find longer HSPs containing them. The word hits are then extended in both directions along each sequence for as far as the cumulative alignment score can be increased. Cumulative scores are calculated using, for nucleotide sequences, the parameters M (reward score for a pair of matching residues; always >0) and N (penalty score for mismatching residues; always <0). For amino acid sequences, a scoring matrix is used to calculate the cumulative score. Extension of the word hits in each direction are halted when: the cumulative alignment score falls off by the quantity X from its maximum achieved value; the cumulative score goes to zero or below, due to the accumulation of one or more negative-scoring residue alignments; or the end of either sequence is reached. The BLAST algorithm parameters W, T, and X determine the sensitivity and speed of the alignment. The BLASTN program (for nucleotide sequences) uses as defaults a wordlength (W) of 11, an expectation (E) of 10, a cutoff of 100, M=5, N=−4, and a comparison of both strands. For amino acid sequences, the BLASTP program uses as defaults a wordlength (W) of 3, an expectation (E) of 10, and the BLOSUM62 scoring matrix (see Henikoff & Henikoff (1989) Proc. Natl. Acad. Sci. USA 89:10915).",
                        "In addition to calculating percent sequence identity, the BLAST algorithm also performs a statistical analysis of the similarity between two sequences (see, e.g., Karlin & Altschul, Proc. Natl. Acad. Sci. USA 90:5873-5787 (1993)). One measure of similarity provided by the BLAST algorithm is the smallest sum probability (P(N)), which provides an indication of the probability by which a match between two nucleotide or amino acid sequences would occur by chance.",
                        "BLAST searches assume that proteins can be modeled as random sequences. However, many real proteins comprise regions of nonrandom sequences which may be homopolymeric tracts, short-period repeats, or regions enriched in one or more amino acids. Such low-complexity regions may be aligned between unrelated proteins even though other regions of the protein are entirely dissimilar. A number of low-complexity filter programs can be employed to reduce such low-complexity alignments. For example, the SEG (Wooten and Federhen, Comput. Chem., 17:149-163 (1993)) and XNU (Claverie and States, Comput. Chem., 17:191-201 (1993)) low-complexity filters can be employed alone or in combination.",
                        "(c) As used herein, “sequence identity” or “identity” in the context of two nucleic acid or polypeptide sequences includes reference to the residues in the two sequences which are the same when aligned for maximum correspondence over a specified comparison window. When percentage of sequence identity is used in reference to proteins it is recognized that residue positions which are not identical often differ by conservative amino acid substitutions, where amino acid residues are substituted for other amino acid residues with similar chemical properties (e.g. charge or hydrophobicity) and therefore do not change the functional properties of the molecule. Where sequences differ in conservative substitutions, the percent sequence identity may be adjusted upwards to correct for the conservative nature of the substitution. Sequences which differ by such conservative substitutions are said to have “sequence similarity” or “similarity”. Means for making this adjustment are well-known to those of skill in the art. Typically this involves scoring a conservative substitution as a partial rather than a full mismatch, thereby increasing the percentage sequence identity. Thus, for example, where an identical amino acid is given a score of 1 and a non-conservative substitution is given a score of zero, a conservative substitution is given a score between zero and 1. The scoring of conservative substitutions is calculated, e.g., according to the algorithm of Meyers and Miller, Computer Applic. Biol. Sci., 4:11-17 (1988) e.g., as implemented in the program PC/GENE (Intelligenetics, Mountain View, Calif., USA).",
                        "(d) As used herein, “percentage of sequence identity” means the value determined by comparing two optimally aligned sequences over a comparison window, wherein the portion of the polynucleotide sequence in the comparison window may comprise additions or deletions (i.e., gaps) as compared to the reference sequence (which does not comprise additions or deletions) for optimal alignment of the two sequences. The percentage is calculated by determining the number of positions at which the identical nucleic acid base or amino acid residue occurs in both sequences to yield the number of matched positions, dividing the number of matched positions by the total number of positions in the window of comparison and multiplying the result by 100 to yield the percentage of sequence identity.",
                        "(e) The term “substantial identity” of polynucleotide sequences means that a polynucleotide comprises a sequence that has at least 70% sequence identity, preferably at least 80%, more preferably at least 90% and most preferably at least 95%, compared to a reference sequence using one of the alignment programs described using standard parameters. One of skill will recognize that these values can be appropriately adjusted to determine corresponding identity of proteins encoded by two nucleotide sequences by taking into account codon degeneracy, amino acid similarity, reading frame positioning and the like. Substantial identity of amino acid sequences for these purposes normally means sequence identity of at least 60%, or preferably at least 70%, 80%, 90%, and most preferably at least 95%.",
                        "Another indication that nucleotide sequences are substantially identical is if two molecules hybridize to each other under stringent conditions. However, nucleic acids which do not hybridize to each other under stringent conditions are still substantially identical if the polypeptides which they encode are substantially identical. This may occur, e.g., when a copy of a nucleic acid is created using the maximum codon degeneracy permitted by the genetic code. One indication that two nucleic acid sequences are substantially identical is that the polypeptide which the first nucleic acid encodes is immunologically cross reactive with the polypeptide encoded by the second nucleic acid.",
                        "(e) The terms “substantial Identity” in the context of a peptide indicates that a peptide comprises a sequence with at least 70% sequence identity to a reference sequence, preferably 80%, or preferably 85%, most preferably at least 90% or 95% sequence identity to the reference sequence over a specified comparison window. Optionally, optimal alignment is conducted using the homology alignment algorithm of Needleman and Wunsch, J. Mol. Biol. 48:443 (1970). An indication that two peptide sequences are substantially identical is that one peptide is immunologically reactive with antibodies raised against the second peptide. Thus, a peptide is substantially identical to a second peptide, for example, where the two peptides differ only by a conservative substitution. Peptides which are “substantially similar” share sequences as noted above except that residue positions which are not identical may differ by conservative amino acid changes."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce nucleic acid isolated from Arabidopsis thaliana",
                        "associate with non-host resistance to Phytophthora",
                        "disclose protein sequences encoded by the same",
                        "use sequences to improve resistance in susceptible plant species",
                        "introduce expression cassettes and transformation vectors",
                        "transform plants and express pathogen non-host resistance genes",
                        "provide transformed cells and regenerated transgenic plants and seeds",
                        "define isolated nucleic acid comprising non-host resistance gene product",
                        "identify several non-host resistance genes",
                        "list SEQ ID NOS: 1-27",
                        "define nucleic acid selected from various options",
                        "introduce method of investigating haplotype of a plant",
                        "isolate nucleic acid molecules from the plant",
                        "determine nucleic acid sequence of nonhost resistance gene",
                        "compare nucleic acid sequence to reference nucleic acid sequence",
                        "introduce method of introgressing Phytophthora resistance",
                        "perform marker assisted selection of the plant",
                        "select plant based on marker assisted selection",
                        "introduce method of investigating nonhost Phytophthora and Fusarium resistance haplotype",
                        "isolate nucleic acid molecules from the plant",
                        "determine nucleic acid sequence of nonhost resistance allele",
                        "compare nucleic acid sequence to reference nucleic acid sequence",
                        "introduce recombinant expression cassette",
                        "introduce vector containing the recombinant expression cassette",
                        "facilitate transcription and translation of the nucleic acid",
                        "introduce host cells able to express the polynucleotide",
                        "introduce transgenic cells, plants, tissue cultures, and lines derived therefrom",
                        "introduce vectors and cassettes for modulation of Phytophthora interaction",
                        "introduce isolated polypeptide with nonhost resistance activity",
                        "define conservatively modified variants of amino acid and nucleic acid sequences",
                        "introduce amplified nucleic acid sequences",
                        "define chromosomal region",
                        "introduce conservatively modified variants of nucleic acid sequences",
                        "define encoding and encoded with respect to a specified nucleic acid",
                        "define full-length sequence in reference to a specified polynucleotide or its encoded protein",
                        "define nonhost resistance protein",
                        "list examples of nonhost resistance proteins",
                        "describe function of nonhost resistance proteins",
                        "define pathogen resistance",
                        "describe methods to measure antipathogenic activity",
                        "describe method to measure disease resistance",
                        "define increased resistance",
                        "describe transient pathogen resistance",
                        "define nucleic acid library",
                        "describe construction of nucleic acid libraries",
                        "define operably linked",
                        "define plant",
                        "list examples of plants",
                        "define polynucleotide",
                        "describe modifications to polynucleotides",
                        "define polypeptide",
                        "describe modifications to polypeptides",
                        "define promoter",
                        "list examples of promoters",
                        "describe tissue specific promoters",
                        "describe inducible promoters",
                        "define recombinant",
                        "define recombinant expression cassette",
                        "describe components of recombinant expression cassette",
                        "define residue",
                        "define selectively hybridizes",
                        "describe stringent hybridization conditions",
                        "describe homologous probing",
                        "describe heterologous probing",
                        "define stringent conditions",
                        "describe hybridization and wash conditions",
                        "explain Tm calculation",
                        "discuss stringency levels",
                        "define transgenic plant",
                        "explain heterologous polynucleotide integration",
                        "define vector",
                        "describe expression vectors",
                        "define reference sequence",
                        "explain comparison window",
                        "describe sequence identity",
                        "calculate percentage of sequence identity",
                        "discuss substantial identity",
                        "explain BLAST algorithm",
                        "describe BLAST parameters",
                        "discuss low-complexity filters",
                        "explain sequence similarity",
                        "adjust for conservative substitutions",
                        "calculate percentage of sequence identity with adjustments",
                        "discuss immunological cross reactivity",
                        "define substantial identity for peptides",
                        "explain optimal alignment for peptides",
                        "discuss immunological reactivity for peptides",
                        "describe substantially similar peptides",
                        "explain conservative amino acid changes",
                        "discuss sequence relationships",
                        "describe methods of alignment",
                        "explain computerized implementations",
                        "discuss CLUSTAL program",
                        "describe BLAST family of programs",
                        "explain software for performing BLAST analyses"
                    ],
                    "num_characters": 48319,
                    "outline_medium": [
                        "introduce nucleic acid isolated from Arabidopsis thaliana",
                        "describe non-host resistance genes and their encoded proteins",
                        "outline expression cassettes and transformation vectors",
                        "describe transformation of plants and expression of non-host resistance genes",
                        "provide isolated nucleic acid comprising non-host resistance gene product",
                        "list several non-host resistance genes and their sequences",
                        "describe nucleic acid selected from various options",
                        "outline method of investigating haplotype of a plant",
                        "describe method of introgressing Phytophthora resistance into a susceptible plant",
                        "outline method of investigating nonhost Phytophthora and Fusarium resistance haplotype",
                        "describe recombinant expression cassette and vector",
                        "outline host cells able to express polynucleotide",
                        "describe isolated polypeptide with nonhost resistance activity",
                        "outline method for engineering broad-spectrum pathogen resistance",
                        "describe use of nucleotide sequences in developing perfect molecular markers",
                        "define various terms used in the invention",
                        "provide examples of conservatively modified variants of nucleic acid and amino acid sequences",
                        "define nonhost resistance protein",
                        "describe properties of nonhost resistance proteins",
                        "explain pathogen resistance",
                        "describe assays for measuring antipathogenic activity",
                        "define increased resistance",
                        "explain nucleic acid library",
                        "define operably linked",
                        "define plant",
                        "define polynucleotide",
                        "define polypeptide",
                        "define promoter",
                        "define recombinant",
                        "define recombinant expression cassette",
                        "define residue and selectively hybridizes",
                        "define stringent conditions",
                        "describe hybridization and wash conditions",
                        "explain Tm calculation",
                        "define transgenic plant",
                        "define vector",
                        "explain sequence relationships",
                        "define reference sequence",
                        "define comparison window",
                        "explain sequence identity",
                        "describe methods of alignment",
                        "explain BLAST algorithm",
                        "describe statistical analysis of similarity",
                        "explain low-complexity filters",
                        "define sequence similarity",
                        "define substantial identity"
                    ],
                    "outline_short": [
                        "introduce non-host resistance genes from Arabidopsis thaliana",
                        "describe protein sequences encoded by these genes",
                        "outline uses of these sequences to improve resistance in susceptible plant species",
                        "describe expression cassettes and transformation vectors",
                        "outline methods for introgressing Phytophthora resistance into susceptible plants",
                        "describe methods for investigating nonhost Phytophthora and Fusarium resistance haplotypes",
                        "outline recombinant expression cassettes and vectors",
                        "describe isolated polypeptides with nonhost resistance activity",
                        "define nonhost resistance proteins",
                        "describe properties of nonhost resistance proteins",
                        "explain pathogen resistance and disease resistance",
                        "define nucleic acid library and operably linked",
                        "define plant and polynucleotide",
                        "define polypeptide, peptide, and protein",
                        "define promoter, recombinant, and residue",
                        "define stringent conditions",
                        "explain Tm calculation",
                        "define transgenic plant",
                        "define vector",
                        "explain sequence relationships",
                        "describe methods of alignment",
                        "define substantial identity"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The present invention provides, inter alia, compositions and methods for promoting pathogen resistance in plants, more particularly for improving Phytophthora resistance of susceptible plants. The compositions of the invention relate to the nonhost resistance gens identified from Arabidopsis which when mutated resulted in an increase in Phytophthora sojae susceptibility. Thus, these genes confer nonhost pathogen resistance of Arabidopsis and as such may be used to confer resistance in susceptible plant species such as soybean. Thus the genes and proteins identified here introduced or modulated to confer improved Phytophthora resistance in plants. These compositions can be transferred into plants to confer or improve Phytophthora resistance, modified to engineer gene sequences for broad based nonspecific resistance in plants, or to isolate and identify alternate gene forms and markers which may be used in breeding regimes. By “confer or improve Phytophthora or other such pathogen resistance” is intended that the proteins or sequences, either alone or in combination with other proteins or sequences, enhance resistance of a plant to Phytophthora and Phytophthora-caused damage or to other pathogens which cause a similar plant reaction. In this manner, resistance to these fungal pathogens and other pathogens such as Pseudomonas syringae pv. glycinea (Psg), soybean cyst nematode (SCN), or soybean mosaic virus (SMV), Fusarium virguliforme can be enhanced or improved in the transformed plant or its progeny when at least one of the sequences of the invention is introduced to a susceptible plant or otherwise modulated according to the invention.",
                        "The compositions include nucleic acid molecules comprising sequences of plant genes and the polypeptides encoded thereby which are associated with nonhost disease resistance against Phytophthora in Arabidopsis have been identified. Particularly, the nucleotide and amino acid sequences for At5g64600 (O-fucosyltrasnferase protein) (SEQ ID NOS: 1, 2, and 19); At5g65900 (DEAD-box ATP-dependant RNA helicase 27) (SEQ ID NOS 3, 4, and 20); At5g66380 (folate transporter 1, or FOLT1) (SEQ ID NOS: 3, 4, and 21); At3g59640 (glycine-rich protein) (SEQ ID NOS 7,8, and 22); At3g59650 (mitochondrial ribosomal protein L51/S25/Cl-B8 protein) (SEQ ID NOS 9, 10, and 23); At3g60310 (protein of unknown function) (SEQ ID NOS 11. 12. And 24); At3g60840 (MAP65-4, microtubule-associated protein 65-4) (SEQ ID NOs:13, 14, and 25; At3g60920 (protein of unknown function) (SEQ ID NOS:15, 16, and 26); At3g61580 (fatty acid/spingolipid desaturase) (SEQ ID NOS:17, 18 and 27) and any conservatively modified variants, fragments, and homologs or full length sequences incorporating the same which retain the Phyphthora infection related activity described herein are part of the invention.",
                        "As discussed in more detail below, the sequences of the invention are presumably involved in many basic biochemical pathways that regulate plant pathogen resistance. Thus, methods are provided for the introduction or modulation of these sequences in a susceptible host plant to improve plant defense responses. Some of the methods involve stably transforming a plant with a nucleotide sequence of the invention operably linked with a promoter capable of driving expression of a gene in a plant cell other methods may involve inhibition of the same sequences to confer improved pathogen resistance in a particular plant.",
                        "Promoter and other regulatory elements which are natively associated with these genes can be easily isolated using the sequences and methods described herein with no more than routine experimentation. These sequences can also be used to identify promoter, enhancer or other signaling sequences in the regulatory regions of non host resistance genes. Such regulatory elements or promoters would provide for temporal and spatial expression of operably linked sequences with pathogen infection in a plant. Nucleotide sequences operably linked to such promoter sequences are transformed into a plant cell. Exposure of the transformed plant to a stimulus such as pathogen infection could induce transcriptional activation of the nucleotide sequences operably linked to these promoter regulatory sequences.",
                        "Transformed plants can be obtained having altered or enhanced responses to Phytophthora attack; hence, the methods and compositions may find uses in altering the response of plants to similar stresses as well. Thus, the sequences of the invention find use in engineering broad-spectrum disease and pest resistance in a variety of plants. It is within the skill in the art to assay protein activities obtained from various sources to determine whether the properties of the proteins are the same. In so doing, one of skill in the art may employ any of a wide array of known assays including, for example, biochemical and/or pathological assays. For example, one of skill in the art could readily produce a plant transformed with a non host resistance protein variant and assay a property of the native protein in that plant material to determine whether a particular property was retained by the variant.",
                        "The compositions and methods of the invention are presumably involved in biochemical pathways and as such may also find use in the activation or modulation of expression of other genes, including those involved in other aspects of pathogen defense and response.",
                        "By “modulating” or “modulation” is intended that the level of expression of a gene may be increased or decreased relative to genes driven by other promoters or relative to the normal or uninduced level of the gene in question.",
                        "The present invention provides for isolated nucleic acid molecules comprising nucleotide sequences encoding the amino acid sequence herein: At5g64600 (O-fucosyltrasnferase protein) (SEQ ID NOS: 1, 2, and 19); At5g65900 (DEAD-box ATP-dependant RNA helicase 27) (SEQ ID NOS 3, 4, and 20); At5g66380 (folate transporter 1, or FOLT1) (SEQ ID NOS: 3, 4, and 21); At3g59640 (glycine-rich protein) (SEQ ID NOS 7,8, and 22); At3g59650 (mitochondrial ribosomal protein L51/S25/Cl-B8 protein) (SEQ ID NOS 9, 10, and 23); At3g60310 (protein of unknown function) (SEQ ID NOS 11. 12. And 24); At3g60840 (MAP65-4, microtubule-associated protein 65-4) (SEQ ID NOs:13, 14, and 25; At3g60920 (protein of unknown function) (SEQ ID NOS:15, 16, and 26); At3g61580 (fatty acid/spingolipid desaturase) (SEQ ID NOS:17, 18 and 27) and any conservatively modified variants, fragments, and homologs or full length sequences incorporating the same which retain the Phyphthora infection related activity described herein. Further provided are polypeptides having an amino acid sequence encoded by a nucleic acid molecule described herein, for example those polypeptides comprising the sequences set forth in the herein, and fragments and variants thereof.",
                        "The invention encompasses isolated or substantially purified nucleic acid or protein compositions. An “isolated” or “purified” nucleic acid molecule or protein, or biologically active portion thereof, is substantially free of other cellular material, or culture medium when produced by recombinant techniques, or substantially free of chemical precursors or other chemicals when chemically synthesized. In some embodiments, an “isolated” nucleic acid is free of sequences (such as other protein-encoding sequences) that naturally flank the nucleic acid (i.e., sequences located at the 5′ and 3′ ends of the nucleic acid) in the genomic DNA of the organism from which the nucleic acid is derived. For example, in various embodiments, the isolated nucleic acid molecule can contain less than about 5 kb, 4 kb, 3 kb, 2 kb, 1 kb, 0.5 kb, 0.4 kb, 0.3 kb, 0.2 kb, or 0.1 kb, or 50, 40, 30, 20, or 10 nucleotides that naturally flank the nucleic acid molecule in genomic DNA of the cell from which the nucleic acid is derived. A protein that is substantially free of cellular material includes preparations of protein having less than about 30%, 20%, 10%, 5%, (by dry weight) of contaminating protein. When the protein of the invention or biologically active portion thereof is recombinantly produced, culture medium may represent less than about 30%, 20%, 10%, or 5% (by dry weight) of chemical precursors or non-protein-of-interest chemicals.",
                        "Fragments and variants of the disclosed nucleotide sequences are encompassed by the present invention. Fragments and variants of proteins encoded by the disclosed nucleotide sequences are also encompassed by the present invention. By “fragment” is intended a portion of the nucleotide sequence or a portion of the amino acid sequence and hence protein encoded thereby. Fragments of a nucleotide sequence may encode protein fragments that retain the biological activity of the native protein and hence affect development, developmental pathways, stress responses, and/or disease resistance by retaining Non host resistance-like activity. Alternatively, fragments of a nucleotide sequence that are useful as hybridization probes generally do not encode fragment proteins retaining biological activity. Thus, fragments of a nucleotide sequence may range from at least about 20 nucleotides, about 50 nucleotides, about 100 nucleotides, and up to the full-length nucleotide sequence encoding the proteins of the invention.",
                        "A fragment of a non host resistance nucleotide sequence that encodes a biologically active portion of a non host resistance protein of the invention will encode at least 12, 25, 30, 50, 75, etc. contiguous amino acids, or up to the total number of amino acids present in a full-length non host resistance protein of the invention.",
                        "Fragments of a non host resistance nucleotide sequence that are useful as hybridization probes or PCR primers generally may or may not encode a biologically active portion of a protein. Thus, a fragment of a non host resistance protein nucleotide sequence may encode a biologically active portion of a non host resistance protein, or it may be used as a hybridization probe or PCR primer using methods disclosed below. A biologically active portion of a non host resistance protein can be prepared by isolating a portion of the Non host resistance nucleotide sequences of the invention, expressing the encoded portion of the Non host resistance protein (e.g., by recombinant expression in vitro), and assessing the activity of the encoded portion of the Non host resistance protein. Nucleic acid molecules that are fragments of a Non host resistance nucleotide sequence comprise at least 16, 20, 25, 30, 40, 50, 60, 70, 80, 90, 100, 125, 150, 175, 200, etc. nucleotides, or up to the number of nucleotides present in a full-length Non host resistance nucleotide sequences disclosed herein.",
                        "The proteins of the invention may be altered in various ways including amino acid substitutions, deletions, truncations, and insertions. Methods for such manipulations are generally known in the art. For example, amino acid sequence variants of the Non host resistance proteins can be prepared by mutations in the DNA. Methods for mutagenesis and nucleotide sequence alterations are well known in the art. See, for example, Kunkel (1985) Proc. Nat. Acad. Sci. USA 82:488-492; Kunkel et al. (1987) Methods in Enzymol. 154:367-382; U.S. Pat. No. 4,873,192; Walker and Gaastra, eds. (1983) Techniques in Molecular Biology (MacMillan Publishing Company, New York) and the references cited therein. Guidance as to appropriate amino acid substitutions that do not affect biological activity of the protein of interest may be found in the model of Dayhoff et al. (1978) Atlas of Protein Sequence and Structure (Natl. Biomed. Res. Found., Washington, D.C.), herein incorporated by reference. Conservative substitutions, such as exchanging one amino acid with another having similar properties, may be made.",
                        "It is recognized that having identified the nucleotide sequences disclosed herein, it is within the state of the art to isolate and identify regulatory elements in the 5′ untranslated region upstream from regions defined herein. Thus for example, the promoter regions of the gene sequences disclosed herein may further comprise upstream regulatory elements that confer tissue-preferred expression of heterologous nucleotide sequences operably linked to the disclosed promoter sequence. See particularly, Australian Patent No. AU-A-77751/94 and U.S. Pat. Nos. 5,466,785 and 5,635,618. It is also recognized by those of skill in the art that regulatory elements may be found in transcribed regions of a gene, for example in the region between transcription start and translation start as well as 3′ to the end of translation; such elements may be found in the sequences set forth herein.",
                        "The nucleotide sequences of the invention can be used to isolate corresponding sequences from other organisms, particularly other plants, more particularly other crop plants. In this manner, methods such as PCR, hybridization, and the like can be used to identify such sequences based on their sequence homology to the sequences set forth herein. Sequences isolated based on their sequence identity to the nucleotide sequences set forth herein or to fragments thereof are encompassed by the present invention. Such sequences include sequences that are orthologs of the disclosed sequences. By “orthologs” is intended genes derived from a common ancestral gene and which are found in different species as a result of speciation. Genes found in different species are considered orthologs when their nucleotide sequences and/or their encoded protein sequences share substantial identity as defined elsewhere herein. Functions of orthologs are often highly conserved among species. Thus, isolated sequences that have Non host resistance-like activity or and which hybridize under stringent conditions to the Non host resistance sequences disclosed herein, or to fragments thereof, are encompassed by the present invention.",
                        "In a PCR approach, oligonucleotide primers can be designed for use in PCR reactions to amplify corresponding DNA sequences from cDNA or genomic DNA extracted from any plant of interest. Methods for designing PCR primers and PCR cloning are generally known in the art and are disclosed in Sambrook et al. (1989) Molecular Cloning: A Laboratory Manual (2d ed., Cold Spring Harbor Laboratory Press Plainview, N.Y.). See also Innis et al., eds. (1990) PCR Protocols: A Guide to Methods and Applications (Academic Press, New York); Innis and Gelfand, eds. (1995) PCR Strategies (Academic Press, New York); and Innis and Gelfand, eds. (1999) PCR Methods Manual (Academic Press, New York). Known methods of PCR include, but are not limited to, methods using paired primers, nested primers, single specific primers, degenerate primers, gene-specific primers, vector-specific primers, partially-mismatched primers, and the like.",
                        "In hybridization techniques, all or part of a known nucleotide sequence is used as a probe that selectively hybridizes to other corresponding nucleotide sequences present it a population of cloned genomic DNA fragments or cDNA fragments (i.e., genomic or cDNA libraries) from a chosen organism. The hybridization probes may be genomic DNA fragments, cDNA fragments, RNA fragments, or other oligonucleotides, and may be labeled with a detectable group such as 32P, or any other detectable marker. Thus, for example, probes for hybridization can be made by labeling synthetic oligonucleotides based on the disease-resistant sequences of the invention. Methods for preparation of probes for hybridization and for construction of cDNA and genomic libraries are generally known in the art and are disclosed in Sambrook et al. (1989) Molecular Cloning: A Laboratory Manual (2d ed., Cold Spring Harbor Laboratory Press, Plainview, N.Y.).",
                        "For example, an entire sequence disclosed herein, or one or more portions thereof, may be used as a probe capable of specifically hybridizing to corresponding Phytophthora-response sequences, including promoters and messenger RNAs. To achieve specific hybridization under a variety of conditions, such probes include sequences that are unique among Phytophthora-response sequences and may be at least about 10 or 15 or 17 nucleotides in length or at least about 20 or 22 or 25 nucleotides in length. Such probes may be used to amplify corresponding sequences from a chosen organism by PCR. This technique may be used to isolate additional coding sequences from a desired organism or as a diagnostic assay to determine the presence of coding sequences in an organism. Hybridization techniques include hybridization screening of plated DNA libraries (either plaques or colonies; see, for example, Sambrook et al. (1989) Molecular Cloning: A Laboratory Manual (2d ed., Cold Spring Harbor Laboratory Press, Plainview, N.Y.).",
                        "Assays that measure antipathogenic activity induced by the signal pathway from the sequences herein are commonly known in the art, as are methods to quantitate disease resistance in plants following pathogen infection. See, for example, U.S. Pat. No. 5,614,395, herein incorporated by reference. These assays may be used to measure the activity of the polypeptides of the invention. Such techniques include, measuring over time, the average lesion diameter, the pathogen biomass, and the overall percentage of decayed plant tissues. For example, a plant either expressing an antipathogenic polypeptide or having an antipathogenic composition applied to its surface shows a decrease in tissue necrosis (i.e., lesion diameter) or a decrease in plant death following pathogen challenge when compared to a control plant that was not exposed to the antipathogenic composition. Alternatively, antipathogenic activity can be measured by a decrease in pathogen biomass. For example, a plant expressing an antipathogenic polypeptide or exposed to an antipathogenic composition is challenged with a pathogen of interest. Over time, tissue samples from the pathogen-inoculated tissues are obtained and RNA is extracted. The percent of a specific pathogen RNA transcript relative to the level of a plant specific transcript allows the level of pathogen biomass to be determined. See, for example, Thomma et al. (1998) Plant Biology 95:15107-15111, herein incorporated by reference.",
                        "Furthermore, in vitro antipathogenic assays include, for example, the addition of varying concentrations of the antipathogenic proteins to paper disks and placing the disks on agar containing a suspension of the pathogen of interest. Following incubation, clear inhibition zones develop around the discs that contain an effective concentration of the antipathogenic polypeptide (Liu et al. (1994) Plant Biology 91:1888-1892, herein incorporated by reference). Additionally, microspectrophotometrical analysis can be used to measure the in vitro antipathogenic properties of a composition (Hu et al. (1997) Plant Mol. Biol. 34:949-959 and Cammue et al. (1992) J. Biol. Chem. 267: 2228-2233, both of which are herein incorporated by reference).",
                        "Pathogens of the invention include, but are not limited to, fungal and viral pathogens for primarily soybeans which include: Phytophthora sojae, Macrophomina phaseolina, Rhizoctonia solani, Sclerotinia sclerotiorum, Fusarium virguliformae, Diaporthe phaseolorum var. sojae (Phomopsis sojae), Diaporthe phaseolorum var. caulivora, Sclerotium rolfsii, Cercospora kikuchii, Cercospora sojina, Peronospora manshurica, Colletotrichum dematium (Colletotichum truncatum), Corynespora cassfcola, Septoria glycines, Phyllosticta sojicola, Alternaria alternate, Pseudomonas syringae p.v. glycinea, Xanthomonas campestris p.v. phaseoli, Microsphaera diffusa, Fusarium semitectum, Phialophora gregata, Soybean mosaic virus, Glomerella glycines, Tobacco Ring spot virus, Tobacco Streak virus, Phakopsora pachyrhizi, Pythium aphanidermatum, Pythium ultimum, Pythium debaryanum, Tomato spotted wilt virus, Heterodera glycines.",
                        "It is understood in the art that plant DNA viruses and fungal pathogens remodel the control of the host replication and gene expression machinery to accomplish their own replication and effective infection. The plant response to stress, such as stress caused by Phytophthora attack, is known to involve many basic biochemical pathways and cellular functions. Hence, the sequences of the invention may find use in altering the defense mechanisms of a host plant to provide broad-based resistance to disease or insect pests. Additionally, the present invention may be useful in preventing corruption of the cell machinery by viruses and other plant pathogens.",
                        "The compositions and methods of the invention function to inhibit or prevent plant diseases. The gene products may accomplish their anti-pathogenic effects by suppressing, controlling, and/or killing the invading pathogenic organism in non host plants and these sequence may then be used to engineer resistance in susceptible plants.",
                        "The cells that have been transformed may be grown into plants in accordance with conventional ways. See, for example, McCormick et al. (1986) Plant Cell Reports 5:8184. These plants may then be grown, and either pollinated with the same transformed strain or different strains, and the resulting hybrid having constitutive expression of the desired phenotypic characteristic identified. Two or more generations may be grown to ensure that constitutive expression of the desired phenotypic characteristic is stably maintained and inherited and then seeds harvested to ensure constitutive expression of the desired phenotypic characteristic has been achieved.",
                        "The invention in one aspect comprises expression constructs comprising a DNA sequence which encodes upon expression an Non host resistance nucleic acid sequence operably linked to a promoter to direct expression of the protein. These constructs are then introduced into plant cells using standard molecular biology techniques. The invention can be also be used for hybrid plant or seed production, once transgenic inbred parental lines have been established.",
                        "The methods of the invention described herein may be applicable to any species of plant.",
                        "Production of a genetically modified plant tissue either expressing or inhibiting expression of a structural gene combines the teachings of the present disclosure with a variety of techniques and expedients known in the art. In most instances, alternate expedients exist for each stage of the overall process. The choice of expedients depends on the variables such as the plasmid vector system chosen for the cloning and introduction of the recombinant DNA molecule, the plant species to be modified, the particular structural gene, promoter elements and upstream elements used. Persons skilled in the art are able to select and use appropriate alternatives to achieve functionality. Culture conditions for expressing desired structural genes and cultured cells are known in the art. Also as known in the art, a number of both monocotyledonous and dicotyledonous plant species are transformable and regenerable such that whole plants containing and expressing desired genes under regulatory control of the promoter molecules according to the invention may be obtained. As is known to those of skill in the art, expression in transformed plants may be tissue specific and/or specific to certain developmental stages. Truncated promoter selection and structural gene selection are other parameters which may be optimized to achieve desired plant expression or inhibition as is known to those of skill in the art and taught herein.",
                        "The following is a non-limiting general overview of Molecular biology techniques which may be used in performing the methods of the invention."
                    ],
                    "subsections": [
                        {
                            "title": "Promoters",
                            "paragraphs": [
                                "The constructs, promoters or control systems used in the methods of the invention may include a tissue specific promoter, an inducible promoter or a constitutive promoter.",
                                "A large number of suitable promoter systems are available. For example one constitutive promoter useful for the invention is the cauliflower mosaic virus (CaMV) 35S. It has been shown to be highly active in many plant organs and during many stages of development when integrated into the genome of transgenic plants and has been shown to confer expression in protoplasts of both dicots and monocots.",
                                "Organ-specific promoters are also well known. For example, the E8 promoter is only transcriptionally activated during tomato fruit ripening, and can be used to target gene expression in ripening tomato fruit (Deikman and Fischer, EMBO J. (1988) 7:3315; Giovannoni et al., The Plant Cell (1989) 1:53). The activity of the E8 promoter is not limited to tomato fruit, but is thought to be compatible with any system wherein ethylene activates biological processes. Similarly the Lipoxegenase (“the LOX gene”) is a fruit specific promoter.",
                                "Other fruit specific promoters are the 1.45 promoter fragment disclosed in Bird, et al., Plant Mol. Bio., pp 651-663 (1988) and the polygalacturonase promoter from tomato disclosed in U.S. Pat. No. 5,413,937 to Bridges et al.",
                                "Leaf specific promoters include as the AS-1 promoter disclosed in U.S. Pat. No. 5,256,558 to Coruzzi and the RBCS-3A promoter isolated from pea the RBCS-3A gene disclosed in U.S. Pat. No. 5,023,179 to Lam et al.",
                                "And finally root specific promoters include the CamV 35S promoter disclosed in U.S. Pat. No. 391,725 to Coruzzi et al; the RB7 promoter disclosed in U.S. Pat. No. 5,459,252 to Conking et al and the promoter isolated from Brassica napus disclosed in U.S. Pat. No. 5,401,836 to Bazczynski et al. which give root specific expression.",
                                "Other examples of promoters include maternal tissue promoters such as seed coat, pericarp and ovule. Promoters highly expressed early in endosperm development are most effective in this application. Of particular interest is the promoter from the a′ subunit of the soybean β-conglycinin gene [Walling et al., Proc. Natl. Acad. Sci. USA 83:2123-2127 (1986)] which is expressed early in seed development in the endosperm and the embryo.",
                                "Further seed specific promoters include the Napin promoter described in U.S. Pat. No. 5,110,728 to Calgene, which describes and discloses the use of the napin promoter in directing the expression to seed tissue of an acyl carrier protein to enhance seed oil production; the DC3 promoter from carrots which is early to mid embryo specific and is disclosed at Plant Physiology, October 1992 100(2) p. 576-581, “Hormonal and Environmental Regulation of the Carrot Lea-class Gene Dc 3, and Plant Mol. Biol., April 1992, 18(6) p. 1049-1063, “Transcriptional Regulation of a Seed Specific Carrot Gene, DC 8”: the phaseolin promoter described in U.S. Pat. No. 5,504,200 to Mycogen which discloses the gene sequence and regulatory regions for phaseolin, a protein isolated from P. vulgaris which is expressed only while the seed is developing within the pod, and only in tissues involved in seed generation.",
                                "Other organ-specific promoters appropriate for a desired target organ can be isolated using known procedures. These control sequences are generally associated with genes uniquely expressed in the desired organ. In a typical higher plant, each organ has thousands of mRNAs that are absent from other organ systems (reviewed in Goldberg, Phil, Trans. R. Soc. London (1986) B314-343. mRNAs are first isolated to obtain suitable probes for retrieval of the appropriate genomic sequence which retains the presence of the natively associated control sequences. An example of the use of techniques to obtain the cDNA associated with mRNA specific to avocado fruit is found in Christoffersen et al., Plant Molecular Biology (1984) 3:385. Briefly, mRNA was isolated from ripening avocado fruit and used to make a cDNA library. Clones in the library were identified that hybridized with labeled RNA isolated from ripening avocado fruit, but that did not hybridize with labeled RNAs isolated from unripe avocado fruit. Many of these clones represent mRNAs encoded by genes that are transcriptionally activated at the onset of avocado fruit ripening.",
                                "Another very important method that can be used to identify cell type specific promoters that allow even to identification of genes expressed in a single cell is enhancer detection (O'Kane, C., and Gehring, W. J. (1987), “Detection in situ of genomic regulatory elements in Drosophila”, Proc. Natl. Acad. Sci. USA, 84, 9123-9127). This method was first developed in Drosophila and rapidly adapted to mice and plants (Wilson, C., Pearson, R. K., Bellen, H. J., O'Kane, C. J., Grossniklaus, U., and Gehring, W. J. (1989), “P-element-mediated enhancer detection: an efficient method for isolating and characterizing developmentally regulated genes in Drosophila”, Genes & Dev., 3, 1301-1313; Skarnes, W. C. (1990), “Entrapment vectors: a new tool for mammalian genetics”, Biotechnology, 8, 827-831; Topping, J. F., Wei, W., and Lindsey, K. (1991), “Functional tagging of regulatory elements in the plant genome”, Development, 112, 1009-1019; Sundaresan, V., Springer, P. S., Volpe, T., Haward, S., Jones, J. D. G., Dean, C., Ma, H., and Martienssen, R. A., (1995), “Patterns of gene action in plant development revealed by enhancer trap and gene trap transposable elements”, Genes & Dev., 9, 1797-1810).",
                                "The promoter used in the method of the invention may be an inducible promoter. An inducible promoter is a promoter that is capable of directly or indirectly activating transcription of a DNA sequence in response to an inducer. In the absence of an inducer, the DNA sequence will not be transcribed. Typically, the protein factor that binds specifically to an inducible promoter to activate transcription is present in an inactive form which is then directly or indirectly converted to the active form by the inducer. The inducer may be a chemical agent such as a protein, metabolite (sugar, alcohol etc.), a growth regulator, herbicide, or a phenolic compound or a physiological stress imposed directly by heat, salt, toxic elements etc. or indirectly through the action of a pathogen or disease agent such as a virus. A plant cell containing an inducible promoter may be exposed to an inducer by externally applying the inducer to the cell such as by spraying, watering, heating, or similar methods. Examples of inducible promoters include the inducible 70 kd heat shock promoter of D. melanogaster (Freeling, M., Bennet, D. C., Maize ADN 1, Ann. Rev. of Genetics, 19:297-323) and the alcohol dehydrogenase promoter which is induced by ethanol (Nagao, R. T., et al., Miflin, B. J., Ed. Oxford Surveys of Plant Molecular and Cell Biology, Vol. 3, p. 384-438, Oxford University Press, Oxford 1986) or the Lex A promoter which is triggered with chemical treatment and is available through Ligand pharmaceuticals. The inducible promoter may be in an induced state throughout seed formation or at least for a period which corresponds to the transcription of the DNA sequence of the recombinant DNA molecule(s).",
                                "Another example of an inducible promoter is the chemically inducible gene promoter sequence isolated from a 27 kd subunit of the maize glutathione-S-transferase (GST II) gene. Two of the inducers for this promoter are N,N-diallyl-2,2-dichloroacetamide (common name: dichloramid) or benzyl-=2-chloro-4-(trifluoromethyl)-5-thiazolecarboxylate (common name: flurazole). In addition, a number of other potential inducers may be used with this promoter as described in published PCT Application No. PCT/GB90/00110 by ICI.",
                                "Another example of an inducible promoter is the light inducible chlorophyll a/b binding protein (CAB) promoter, also described in published PCT Application No. PCT/GB90/00110 by ICI.",
                                "Inducible promoters have also been described in published Application No. EP89/103888.7 by Ciba-Geigy. In this application, a number of inducible promoters are identified, including the PR protein genes, especially the tobacco PR protein genes, such as PR-1a, PR-1b, PR-1c, PR-1, PR-A, PR-S, the cucumber chitinase gene, and the acidic and basic tobacco beta-1,3-glucanase genes. There are numerous potential inducers for these promoters, as described in Application No. EP89/103888.7.",
                                "The preferred promoters may be used in conjunction with naturally occurring flanking coding or transcribed sequences of the feronia regulatory genes or with any other coding or transcribed sequence that is critical to pollin tube formation and/or fertilization.",
                                "It may also be desirable to include some intron sequences in the promoter constructs since the inclusion of intron sequences in the coding region may result in enhanced expression and specificity. Thus, it may be advantageous to join the DNA sequences to be expressed to a promoter sequence that contains the first intron and exon sequences of a polypeptide which is unique to cells/tissues of a plant critical to female gametophyte development and/or function.",
                                "Additionally, regions of one promoter may be joined to regions from a different promoter in order to obtain the desired promoter activity resulting in a chimeric promoter. Synthetic promoters which regulate gene expression may also be used.",
                                "The expression system may be further optimized by employing supplemental elements such as transcription terminators and/or enhancer elements."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "list types of promoters",
                                "describe constitutive promoter CaMV 35S",
                                "introduce organ-specific promoters",
                                "describe E8 promoter",
                                "describe LOX gene promoter",
                                "describe 1.45 promoter fragment",
                                "describe polygalacturonase promoter",
                                "describe AS-1 promoter",
                                "describe RBCS-3A promoter",
                                "describe CamV 35S promoter",
                                "describe RB7 promoter",
                                "describe Brassica napus promoter",
                                "introduce maternal tissue promoters",
                                "describe a′ subunit of soybean β-conglycinin gene promoter",
                                "describe Napin promoter",
                                "describe DC3 promoter",
                                "describe phaseolin promoter",
                                "describe enhancer detection method",
                                "introduce inducible promoters"
                            ],
                            "num_characters": 9567,
                            "outline_medium": [
                                "list types of promoters",
                                "describe constitutive promoter CaMV 35S",
                                "describe organ-specific promoters",
                                "list examples of fruit specific promoters",
                                "list examples of leaf specific promoters",
                                "list examples of root specific promoters",
                                "describe maternal tissue promoters",
                                "describe inducible promoters",
                                "discuss optimization of expression system"
                            ],
                            "outline_short": [
                                "list tissue specific promoters",
                                "describe inducible promoters",
                                "discuss organ-specific promoters",
                                "introduce chimeric and synthetic promoters"
                            ]
                        },
                        {
                            "title": "Other Regulatory Elements",
                            "paragraphs": [
                                "In addition to a promoter sequence, an expression cassette or construct should also contain a transcription termination region downstream of the structural gene to provide for efficient termination. The termination region or polyadenylation signal may be obtained from the same gene as the promoter sequence or may be obtained from different genes. Polyadenylation sequences include, but are not limited to the Agrobacterium octopine synthase signal (Gielen et al., EMBO J. (1984) 3:835-846) or the nopaline synthase signal (Depicker et al., Mol. and Appl. Genet. (1982) 1:561-573)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe polyadenylation signals"
                            ],
                            "num_characters": 582,
                            "outline_medium": [
                                "describe polyadenylation signals"
                            ],
                            "outline_short": [
                                "describe polyadenylation signals"
                            ]
                        },
                        {
                            "title": "Marker Genes",
                            "paragraphs": [
                                "Recombinant DNA molecules containing any of the DNA sequences and promoters described herein may additionally contain selection marker genes which encode a selection gene product which confer on a plant cell resistance to a chemical agent or physiological stress, or confers a distinguishable phenotypic characteristic to the cells such that plant cells transformed with the recombinant DNA molecule may be easily selected using a selective agent. One such selection marker gene is neomycin phosphotransferase (NPT II) which confers resistance to kanamycin and the antibiotic G-418. Cells transformed with this selection marker gene may be selected for by assaying for the presence in vitro of phosphorylation of kanamycin using techniques described in the literature or by testing for the presence of the mRNA coding for the NPT II gene by Northern blot analysis in RNA from the tissue of the transformed plant. Polymerase chain reactions are also used to identify the presence of a transgene or expression using reverse transcriptase PCR amplification to monitor expression and PCR on genomic DNA. Other commonly used selection markers include the ampicillin resistance gene, the tetracycline resistance and the hygromycin resistance gene. Transformed plant cells thus selected can be induced to differentiate into plant structures which will eventually yield whole plants. It is to be understood that a selection marker gene may also be native to a plant."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe selection marker genes",
                                "describe examples of selection marker genes"
                            ],
                            "num_characters": 1458,
                            "outline_medium": [
                                "describe selection marker genes"
                            ],
                            "outline_short": [
                                "describe selection marker genes"
                            ]
                        },
                        {
                            "title": "Transformation",
                            "paragraphs": [
                                "Numerous methods for plant transformation have been developed, including biological and physical, plant transformation protocols. See, for example, Miki et al., “Procedures for Introducing Foreign DNA into Plants” in Methods in Plant Molecular Biology and Biotechnology, Glick, B. R. and Thompson, J. E. Eds. (CRC Press, Inc., Boca Raton, 1993) pages 67-88. In addition, expression vectors and in vitro culture methods for plant cell or tissue transformation and regeneration of plants are available. See, for example, Gruber et al., “Vectors for Plant Transformation” in Methods in Plant Molecular Biology and Biotechnology, Glick, B. R. and Thompson, J. E. Eds. (CRC Press, Inc., Boca Raton, 1993) pages 89-119.",
                                "A. Agrobacterium-Mediated Transformation",
                                "One method for introducing an expression vector into plants is based on the natural transformation system of Agrobacterium. See, for example, Horsch et al., Science 227: 1229 (1985). A. tumefaciens and A. rhizogenes are plant pathogenic soil bacteria which genetically transform plant cells. The Ti and Ri plasmids of A. tumefaciens and A. rhizogenes, respectively, carry genes responsible for genetic transformation of the plant. See, for example, Kado, C. I., Crit. Rev. Plant. Sci. 10:1 (1991). Descriptions of Agrobacterium vector systems and methods for Agrobacterium-mediated gene transfer are provided by Gruber et al., supra, Miki et al., supra, and Moloney et al., Plant Cell Reports 8: 238 (1989). See also, U.S. Pat. No. 5,563,055, (Townsend and Thomas), issued Oct. 8, 1996.",
                                "B. Direct Gene Transfer",
                                "Several methods of plant transformation, collectively referred to as direct gene transfer, have been developed as an alternative to Agrobacterium-mediated transformation. A generally applicable method of plant transformation is microprojectile-mediated transformation wherein DNA is carried on the surface of microprojectiles measuring 1 to 4 m. The expression vector is introduced into plant tissues with a biolistic device that accelerates the microprojectiles to speeds of 300 to 600 m/s which is sufficient to penetrate plant cell walls and membranes. Sanford et al., Part. Sci. Technol. 5: 27 (1987), Sanford, J. C., Trends Biotech. 6: 299 (1988), Klein et al., Bio/Technology 6: 559-563 (1988), Sanford, J. C., Physiol Plant 79: 206 (1990), Klein et al., Biotechnology 10: 268 (1992). See also U.S. Pat. No. 5,015,580 (Christou, et al), issued May 14, 1991; U.S. Pat. No. 5,322,783 (Tomes, et al.), issued Jun. 21, 1994.",
                                "Another method for physical delivery of DNA to plants is sonication of target cells. Zhang et al., Bio/Technology 9: 996 (1991). Alternatively, liposome or spheroplast fusion have been used to introduce expression vectors into plants. Deshayes et al., EMBO J., 4: 2731 (1985), Christou et al., Proc Natl. Acad. Sci. U.S.A. 84: 3962 (1987). Direct uptake of DNA into protoplasts using CaCl2 precipitation, polyvinyl alcohol or poly-L-ornithine have also been reported. Hain et al., Mol. Gen. Genet. 199: 161 (1985) and Draper et al., Plant Cell Physiol. 23: 451 (1982). Electroporation of protoplasts and whole cells and tissues have also been described. Donn et al., In Abstracts of VIIth International Congress on Plant Cell and Tissue Culture IAPTC, A2-38, p 53 (1990); D'Halluin et al., Plant Cell 4: 1495-1505 (1992) and Spencer et al., Plant Mol. Biol. 24: 51-61 (1994).",
                                "Following transformation of target tissues, expression of the above-described selectable marker genes allows for preferential selection of transformed cells, tissues and/or plants, using regeneration and selection methods now well known in the art.",
                                "It is often desirable to have the DNA sequence in homozygous state which may require more than one transformation event to create a parental line, requiring transformation with a first and second recombinant DNA molecule both of which encode the same gene product. It is further contemplated in some of the embodiments of the process of the invention that a plant cell be transformed with a recombinant DNA molecule containing at least two DNA sequences or be transformed with more than one recombinant DNA molecule. The DNA sequences or recombinant DNA molecules in such embodiments may be physically linked, by being in the same vector, or physically separate on different vectors. A cell may be simultaneously transformed with more than one vector provided that each vector has a unique selection marker gene. Alternatively, a cell may be transformed with more than one vector sequentially allowing an intermediate regeneration step after transformation with the first vector. Further, it may be possible to perform a sexual cross between individual plants or plant lines containing different DNA sequences or recombinant DNA molecules preferably the DNA sequences or the recombinant molecules are linked or located on the same chromosome, and then selecting from the progeny of the cross, plants containing both DNA sequences or recombinant DNA molecules.",
                                "Expression of recombinant DNA molecules containing the DNA sequences and promoters described herein in transformed plant cells may be monitored using Northern blot techniques and/or Southern blot techniques known to those of skill in the art.",
                                "The transformed cells may then be regenerated into a transgenic plant. The regenerated plants are transferred to standard soil conditions and cultivated in a conventional manner.",
                                "After the expression or inhibition cassette is stably incorporated into regenerated transgenic plants, it can be transferred to other plants by sexual crossing. Any of a number of standard breeding techniques can be used, depending upon the species to be crossed.",
                                "It may be useful to generate a number of individual transformed plants with any recombinant construct in order to recover plants free from any position effects. It may also be preferable to select plants that contain more than one copy of the introduced recombinant DNA molecule such that high levels of expression of the recombinant molecule are obtained.",
                                "As indicated above, it may be desirable to produce plant lines which are homozygous for a particular gene. In some species this is accomplished rather easily by the use of another culture or isolated microspore culture. This is especially true for the oil seed crop Brassica napus (Keller and Armstrong, Z. flanzenzucht 80:100-108, 1978). By using these techniques, it is possible to produce a haploid line that carries the inserted gene and then to double the chromosome number either spontaneously or by the use of colchicine. This gives rise to a plant that is homozygous for the inserted gene, which can be easily assayed for if the inserted gene carries with it a suitable selection marker gene for detection of plants carrying that gene. Alternatively, plants may be self-fertilized, leading to the production of a mixture of seed that consists of, in the simplest case, three types, homozygous (25%), heterozygous (50%) and null (25%) for the inserted gene. Although it is relatively easy to score null plants from those that contain the gene, it is possible in practice to score the homozygous from heterozygous plants by southern blot analysis in which careful attention is paid to the loading of exactly equivalent amounts of DNA from the mixed population, and scoring heterozygotes by the intensity of the signal from a probe specific for the inserted gene. It is advisable to verify the results of the southern blot analysis by allowing each independent transformant to self-fertilize, since additional evidence for homozygosity can be obtained by the simple fact that if the plant was homozygous for the inserted gene, all of the subsequent plants from the selfed seed will contain the gene, while if the plant was heterozygous for the gene, the generation grown from the selfed seed will contain null plants. Therefore, with simple selfing one can easily select homozygous plant lines that can also be confirmed by southern blot analysis.",
                                "Creation of homozygous parental lines makes possible the production of hybrid plants and seeds which will contain a modified protein component. Transgenic homozygous parental lines are maintained with each parent containing either the first or second recombinant DNA sequence operably linked to a promoter. Also incorporated in this scheme are the advantages of growing a hybrid crop, including the combining of more valuable traits and hybrid vigor.",
                                "The nucleotide constructs of the invention also encompass nucleotide constructs that may be employed in methods for altering or mutating a genomic nucleotide sequence in an organism, including, but not limited to, chimeric vectors, chimeric mutational vectors, chimeric repair vectors, mixed-duplex oligonucleotides, self-complementary chimeric oligonucleotides, and recombinogenic oligonucleobases. Such nucleotide constructs and methods of use, such as, for example, chimeraplasty, are known in the art. Chimeraplasty involves the use of such nucleotide constructs to introduce site-specific changes into the sequence of genomic DNA within an organism. See, U.S. Pat. Nos. 5,565,350; 5,731,181; 5,756,325; 5,760,012; 5,795,972; and 5,871,984; all of which are herein incorporated by reference. See also, WO 98/49350, WO 99/07865, WO 99/25821, and Beetham et al. (1999) Proc. Natl. Acad. Sci. USA 96:8774-8778; herein incorporated by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Agrobacterium-mediated transformation",
                                "describe Ti and Ri plasmids",
                                "describe Agrobacterium vector systems",
                                "introduce direct gene transfer",
                                "describe microprojectile-mediated transformation",
                                "describe sonication of target cells",
                                "describe liposome or spheroplast fusion",
                                "describe direct uptake of DNA into protoplasts",
                                "describe electroporation of protoplasts and whole cells",
                                "describe regeneration of transformed cells",
                                "describe selection of transformed cells",
                                "describe creation of homozygous parental lines",
                                "describe production of hybrid plants and seeds",
                                "describe advantages of growing hybrid crops",
                                "describe creation of transgenic homozygous parental lines",
                                "describe use of chimeric vectors",
                                "describe use of chimeraplasty",
                                "describe use of other nucleotide constructs"
                            ],
                            "num_characters": 9384,
                            "outline_medium": [
                                "introduce Agrobacterium-mediated transformation",
                                "describe Ti and Ri plasmids",
                                "introduce direct gene transfer",
                                "describe microprojectile-mediated transformation",
                                "describe sonication of target cells",
                                "describe liposome or spheroplast fusion",
                                "describe direct uptake of DNA into protoplasts",
                                "describe electroporation of protoplasts and whole cells",
                                "describe regeneration of transformed cells"
                            ],
                            "outline_short": [
                                "describe Agrobacterium-mediated transformation",
                                "describe direct gene transfer methods",
                                "describe transformation of target tissues",
                                "describe regeneration of transformed cells"
                            ]
                        },
                        {
                            "title": "Molecular Markers",
                            "paragraphs": [
                                "The present invention provides a method of genotyping a plant comprising a heterologous polynucleotide of the present invention. Genotyping provides a means of distinguishing homologs of a chromosome pair and can be used to differentiate segregants in a plant population. Molecular marker methods can be used for phylogenetic studies, characterizing genetic relationships among crop varieties, identifying crosses or somatic hybrids, localizing chromosomal segments affecting monogenic traits, map based cloning, and the study of quantitative inheritance. See, e.g., Clark, Ed., Plant Molecular Biology: A Laboratory Manual. Berlin, Springer Verlag, 1997. Chapter 7. For molecular marker methods, see generally, “The DNA Revolution” in: Paterson, A. H., Genome Mapping in Plants (Austin, Tex., Academic Press/R. G. Landis Company, 1996) pp. 7-21.",
                                "The particular method of genotyping in the present invention may employ any number of molecular marker analytic techniques such as, but not limited to, restriction fragment length polymorphisms (RFLPs). RFLPs are the product of allelic differences between DNA restriction fragments resulting from nucleotide sequence variability. As is well known to those of skill in the art, RFLPs are typically detected by extraction of genomic DNA and digestion with a restriction enzyme. Generally, the resulting fragments are separated according to size and hybridized with a probe; single copy probes are preferred. Restriction fragments from homologous chromosomes are revealed.",
                                "Differences in fragment size among alleles represent an RFLP. Thus, the present invention further provides a means to follow segregation of a gene or nucleic acid of the present invention as well as chromosomal sequences genetically linked to these genes or nucleic acids using such techniques as RFLP analysis. Linked chromosomal sequences are within 50 centiMorgans (cM), often within 40 or 30 cM, preferably within 20 or 10 cM, more preferably within 5, 3, 2, or 1 cM of a gene of the present invention.",
                                "In the present invention, the nucleic acid probes employed for molecular marker mapping of plant nuclear genomes selectively hybridize, under selective hybridization conditions, to a gene encoding a polynucleotide of the present invention. In preferred embodiments, the probes are selected from polynucleotides of the present invention.",
                                "Typically, these probes are cDNA probes or restriction-enzyme treated (e.g., Pst I) genomic clones. The length of the probes is discussed in greater detail, supra, but are typically at least 15 bases in length, more preferably at least 20, 25, 30, 35, 40, or 50 bases in length. Generally, however, the probes are less than about 1 kilobase in length. Preferably, the probes are single copy probes that hybridize to a unique locus in a haploid chromosome complement. Some exemplary restriction enzymes employed in RFLP mapping are EcoRI, EcoRv, and SstI. As used herein the term “restriction enzyme” includes reference to a composition that recognizes and, alone or in conjunction with another composition, cleaves at a specific nucleotide sequence.",
                                "The method of detecting an RFLP comprises the steps of (a) digesting genomic DNA of a plant with a restriction enzyme; (b) hybridizing a nucleic acid probe, under selective hybridization conditions, to a sequence of a polynucleotide of the present of said genomic DNA; (c) detecting therefrom a RFLP. Other methods of differentiating polymorphic (allelic) variants of polynucleotides of the present invention can be had by utilizing molecular marker techniques well known to those of skill in the art including such techniques as: 1) single stranded conformation analysis (SSCA); 2) denaturing gradient gel electrophoresis (DGGE); 3) RNase protection assays; 4) allele-specific oligonucleotides (ASOs); 5) the use of proteins which recognize nucleotide mismatches, such as the E. coli mutS protein; and 6) allele-specific PCR. Other approaches based on the detection of mismatches between the two complementary DNA strands include clamped denaturing gel electrophoresis (CDGE); heteroduplex analysis (HA); and chemical mismatch cleavage (CMC). Thus, the present invention further provides a method of genotyping comprising the steps of contacting, under stringent hybridization conditions, a sample suspected of comprising a polynucleotide of the present invention with a nucleic acid probe. Generally, the sample is a plant sample; preferably, a sample suspected of comprising a maize polynucleotide of the present invention (e.g., gene, mRNA). The nucleic acid probe selectively hybridizes, under stringent conditions, to a subsequence of a polynucleotide of the present invention comprising a polymorphic marker. Selective hybridization of the nucleic acid probe to the polymorphic marker nucleic acid sequence yields a hybridization complex. Detection of the hybridization complex indicates the presence of that polymorphic marker in the sample. In preferred embodiments, the nucleic acid probe comprises a polynucleotide of the present invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce molecular marker methods",
                                "describe RFLP analysis",
                                "describe use of single copy probes",
                                "describe use of restriction enzymes",
                                "describe detection of RFLPs",
                                "describe other molecular marker techniques",
                                "describe use of nucleic acid probes",
                                "describe detection of hybridization complexes",
                                "describe use of linked chromosomal sequences",
                                "describe use of probes selectively hybridizing to genes"
                            ],
                            "num_characters": 5067,
                            "outline_medium": [
                                "introduce genotyping method",
                                "describe RFLP analysis",
                                "describe SSCA, DGGE, RNase protection assays, ASOs, and mutS protein",
                                "describe CDGE, HA, and CMC",
                                "describe use of probes for molecular marker mapping"
                            ],
                            "outline_short": [
                                "describe RFLP analysis",
                                "describe other molecular marker techniques"
                            ]
                        },
                        {
                            "title": "UTRs and Codon Preference",
                            "paragraphs": [
                                "In general, translational efficiency has been found to be regulated by specific sequence elements in the 5′ non-coding or untranslated region (5′UTR) of the RNA. Positive sequence motifs include translational initiation consensus sequences (Kozak, Nucleic Acids Res. 15: 8125 (1987)) and the 7-methylguanosine cap structure (Drummond et al., Nucleic Acids Res. 13: 7375 (1985)). Negative elements include stable intramolecular 5′UTR stem-loop structures (Muesing et al., Cell 48: 691 (1987)) and AUG sequences or short open reading frames preceded by an appropriate AUG in the 5′UTR (Kozak, supra, Rao et al., Mol. and Cell. Biol. 8: 284 (1988)). Accordingly, the present invention provides 5′ and/or 3′ untranslated regions for modulation of translation of heterologous coding sequences.",
                                "Further, the polypeptide-encoding segments of the polynucleotides of the present invention can be modified to alter codon usage. Altered codon usage can be employed to alter translational efficiency and/or to optimize the coding sequence for expression in a desired host such as to optimize the codon usage in a heterologous sequence for expression in maize. Codon usage in the coding regions of the polynucleotides of the present invention can be analyzed statistically using commercially available software packages such as “Codon Preference” available from the University of Wisconsin Genetics Computer Group (see Devereaux et al., Nucleic Acids Res. 12: 387-395 (1984)) or MacVector 4.1 (Eastman Kodak Co., New Haven, Conn.). Thus, the present invention provides a codon usage frequency characteristic of the coding region of at least one of the polynucleotides of the present invention. The number of polynucleotides that can be used to determine a codon usage frequency can be any integer from 1 to the number of polynucleotides of the present invention as provided herein. Optionally, the polynucleotides will be full-length sequences. An exemplary number of sequences for statistical analysis can be at least 1, 5, 10, 20, 50, or 100."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe regulation of translational efficiency",
                                "describe use of 5' and 3' untranslated regions",
                                "describe modification of codon usage",
                                "describe analysis of codon usage frequency"
                            ],
                            "num_characters": 2032,
                            "outline_medium": [
                                "describe translational efficiency regulation",
                                "describe codon usage frequency analysis"
                            ],
                            "outline_short": [
                                "describe modulation of translation using UTRs and codon preference"
                            ]
                        },
                        {
                            "title": "Sequence Shuffling",
                            "paragraphs": [
                                "The present invention provides methods for sequence shuffling using polynucleotides of the present invention, and compositions resulting therefrom. Sequence shuffling is described in PCT publication No. WO 97/20078. See also, Zhang, J.-H., et al. Proc. Natl. Acad. Sci. USA 94: 4504-4509 (1997). Generally, sequence shuffling provides a means for generating libraries of polynucleotides having a desired characteristic which can be selected or screened for. Libraries of recombinant polynucleotides are generated from a population of related sequence polynucleotides which comprise sequence regions which have substantial sequence identity and can be homologously recombined in vitro or in vivo. The population of sequence-recombined polynucleotides comprises a subpopulation of polynucleotides which possess desired or advantageous characteristics and which can be selected by a suitable selection or screening method. The characteristics can be any property or attribute capable of being selected for or detected in a screening system, and may include properties of: an encoded protein, a transcriptional element, a sequence controlling transcription, RNA processing, RNA stability, chromatin conformation, translation, or other expression property of a gene or transgene, a replicative element, a protein-binding element, or the like, such as any feature which confers a selectable or detectable property. In some embodiments, the selected characteristic will be a decreased Km and/or increased KCat over the wild-type protein as provided herein. In other embodiments, a protein or polynucleotide generated from sequence shuffling will have a ligand binding affinity greater than the non-shuffled wild-type polynucleotide. The increase in such properties can be at least 110%, 120%, 130%, 140% or at least 150% of the wild-type value."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce sequence shuffling",
                                "describe generation of libraries of polynucleotides",
                                "describe selection of polynucleotides with desired characteristics"
                            ],
                            "num_characters": 1837,
                            "outline_medium": [
                                "describe sequence shuffling method"
                            ],
                            "outline_short": [
                                "describe sequence shuffling methods"
                            ]
                        },
                        {
                            "title": "Generic and Consensus Sequences",
                            "paragraphs": [
                                "Polynucleotides and polypeptides of the present invention further include those having: (a) a generic sequence of at least two homologous polynucleotides or polypeptides, respectively, of the present invention; and, (b) a consensus sequence of at least three homologous polynucleotides or polypeptides, respectively, of the present invention. The generic sequence of the present invention comprises each species of polypeptide or polynucleotide embraced by the generic polypeptide or polynucleotide sequence, respectively. The individual species encompassed by a polynucleotide having an amino acid or nucleic acid consensus sequence can be used to generate antibodies or produce nucleic acid probes or primers to screen for homologs in other species, genera, families, orders, classes, phyla, or kingdoms.",
                                "Alternatively, a polynucleotide having a consensus sequence generated from orthologous genes can be used to identify or isolate orthologs of other taxa. Typically, a polynucleotide having a consensus sequence will be at least 25, 30, or 40 amino acids in length, or 20, 30, 40, 50, 100, or 150 nucleotides in length. As those of skill in the art are aware, a conservative amino acid substitution can be used for amino acids which differ amongst aligned sequence but are from the same conservative substitution group as discussed above. Optionally, no more than 1 or 2 conservative amino acids are substituted for each 10 amino acid length of consensus sequence.",
                                "Similar sequences used for generation of a consensus or generic sequence include any number and combination of allelic variants of the same gene, orthologous, or paralogous sequences as provided herein. Optionally, similar sequences used in generating a consensus or generic sequence are identified using the BLAST algorithm's smallest sum probability (P(N)). Various suppliers of sequence-analysis software are listed in chapter 7 of Current Protocols in Molecular Biology, F. M. Ausubel et al., Eds., Current Protocols, a joint venture between Greene Publishing Associates, Inc. and John Wiley & Sons, Inc. (Supplement 30).",
                                "A polynucleotide sequence is considered similar to a reference sequence if the smallest sum probability in a comparison of the test nucleic acid to the reference nucleic acid is less than about 0.1, more preferably less than about 0.01, or 0.001, and most preferably less than about 0.0001, or 0.00001. Similar polynucleotides can be aligned and a consensus or generic sequence generated using multiple sequence alignment software available from a number of commercial suppliers such as the Genetics Computer Group's (Madison, Wis.) PILEUP software, Vector NTI's (North Bethesda, Md.) ALIGNX, or Genecode's (Ann Arbor, Mich.) SEQUENCHER. Conveniently, default parameters of such software can be used to generate consensus or generic sequences."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce generic and consensus sequences",
                                "describe generation of generic sequences",
                                "describe generation of consensus sequences",
                                "describe use of similar sequences",
                                "describe alignment and generation of consensus sequences"
                            ],
                            "num_characters": 2841,
                            "outline_medium": [
                                "describe generic sequence generation",
                                "describe consensus sequence generation"
                            ],
                            "outline_short": [
                                "describe generation of generic and consensus sequences"
                            ]
                        },
                        {
                            "title": "Use in Breeding Methods",
                            "paragraphs": [
                                "The transformed plants of the invention may be used in a plant breeding program. The goal of plant breeding is to combine, in a single variety or hybrid, various desirable traits. For field crops, these traits may include, for example, resistance to diseases and insects, tolerance to heat and drought, reduced time to crop maturity, greater yield, and better agronomic quality. With mechanical harvesting of many crops, uniformity of plant characteristics such as germination and stand establishment, growth rate, maturity, and plant height is desirable. Traditional plant breeding is an important tool in developing new and improved commercial crops. This invention encompasses methods for producing a plant by crossing a first parent plant with a second parent plant wherein one or both of the parent plants is a transformed plant according to the invention displaying Phytophthora resistance as described herein.",
                                "Plant breeding techniques known in the art and used in a plant breeding program include, but are not limited to, recurrent selection, bulk selection, mass selection, backcrossing, pedigree breeding, open pollination breeding, restriction fragment length polymorphism enhanced selection, genetic marker enhanced selection, doubled haploids, and transformation. Often combinations of these techniques are used.",
                                "The development of hybrids in a plant breeding program requires, in general, the development of homozygous inbred lines, the crossing of these lines, and the evaluation of the crosses. There are many analytical methods available to evaluate the result of a cross. The oldest and most traditional method of analysis is the observation of phenotypic traits. Alternatively, the genotype of a plant can be examined.",
                                "A genetic trait which has been engineered into a particular plant using transformation techniques can be moved into another line using traditional breeding techniques that are well known in the plant breeding arts. For example, a backcrossing approach is commonly used to move a transgene from a transformed maize plant to an elite inbred line, and the resulting progeny would then comprise the transgene(s). Also, if an inbred line was used for the transformation, then the transgenic plants could be crossed to a different inbred in order to produce a transgenic hybrid plant. As used herein, “crossing” can refer to a simple X by Y cross, or the process of backcrossing, depending on the context.",
                                "The development of a hybrid in a plant breeding program involves three steps: (1) the selection of plants from various germplasm pools for initial breeding crosses; (2) the selfing of the selected plants from the breeding crosses for several generations to produce a series of inbred lines, which, while different from each other, breed true and are highly uniform; and (3) crossing the selected inbred lines with different inbred lines to produce the hybrids. During the inbreeding process, the vigor of the lines decreases. Vigor is restored when two different inbred lines are crossed to produce the hybrid. An important consequence of the homozygosity and homogeneity of the inbred lines is that the hybrid created by crossing a defined pair of inbreds will always be the same. Once the inbreds that give a superior hybrid have been identified, the hybrid seed can be reproduced indefinitely as long as the homogeneity of the inbred parents is maintained.",
                                "Transgenic plants of the present invention may be used to produce, e.g., a single cross hybrid, a three-way hybrid or a double cross hybrid. A single cross hybrid is produced when two inbred lines are crossed to produce the F1 progeny. A double cross hybrid is produced from four inbred lines crossed in pairs (A×B and C×D) and then the two F1 hybrids are crossed again (A×B)×(C×D). A three-way cross hybrid is produced from three inbred lines where two of the inbred lines are crossed (A×B) and then the resulting F1 hybrid is crossed with the third inbred (A×B)×C. Much of the hybrid vigor and uniformity exhibited by F1 hybrids is lost in the next generation (F2). Consequently, seed produced by hybrids is consumed rather than planted.",
                                "All publications and patent applications mentioned in the specification are indicative of the level of those skilled in the art to which this invention pertains. All publications and patent applications are herein incorporated by reference to the same extent as if each individual publication or patent application was specifically and individually indicated to be incorporated by reference.",
                                "Although the foregoing invention has been described in some detail by way of illustration and example for purposes of clarity of understanding, it will be obvious that certain changes and modifications may be practiced within the scope of the appended claims. Thus, many modifications and other embodiments of the invention will come to mind to one skilled in the art to which this invention pertains having the benefit of the teachings presented in the foregoing descriptions and the associated drawings. Therefore, it is to be understood that the invention is not to be limited to the specific embodiments disclosed and that modifications and other embodiments are intended to be included within the scope of the appended claims.",
                                "The following examples are offered by way of illustration and not by way of limitation.",
                                "**Example 1**",
                                "**Five Arabidopsis Homozygous Mutants that are Infected by P. Sojae**",
                                "We observed that single cells of the Arabidopsis mutant, pen1-1, but not that of its progenitor ecotype, Columbia, are penetrated by P. sojae. This observation suggested that the first line of defense in Arabidopsis against the pathogen is lost in this mutant. We used the chemical mutagen, ethyl methane sulfonate (EMS), to generate 3,556 EMS-induced mutant plants in pen1-1. Then we have screened over 3,000 M2 families developed from these mutants for possible loss of Phytophthora resistance in 24-well microtiter plates as follows. Seedling were grown in water for 10 days and then inoculated with P. sojae zoospores for 48 hours in wells of microtiter plates. Thereafter, dead cells of inoculated seedlings were stained with trypan blue dye (Koch and Slusarenko 1990) and identified by conducting light microscopy. We identified 30 putative P. sojae susceptible mutants. We tentatively named these putative mutants (putants) pss1 (Phytophthora sojae susceptible) through pss30.",
                                "We selected Niederzenz to cross with pss mutants to generate materials that segregate for the Pss genes, because this ecotype is immune to P. sojae. We generated a global map of SSLP and CAPS markers that are polymorphic between Columbia and Niederzenz. We sequenced the Niederzenz genome by applying high through-put Solexa (Illumina, Inc., San Diego) sequencing technology and developed a sequence-based polymorphic (SBP) markers technology to fill out the marker-poor regions of the genome developed earlier using SSLP and CAPS markers (Sahu et al. 2012). We developed SBP markers for saturating the Pss1 region with molecular markers.",
                                "We investigated map locations of three additional putative Pss genes, Pss6, Pss26 and Pss30. By conducting bulk-segregant analysis (Michelmore et al. 1991) we have shown that none of the putative Pss6, Pss26 and Pss30 genes mapped to the Pss1 locus. Pss30 was mapped to the south arm of Chromosome 5.",
                                "Pss6 is tentatively mapped to the Chromosome 4. Additional SBP markers are being generated to map this gene.",
                                "Pss1 mutant is susceptible to a second soybean pathogen, Fusarium virguliforme. We inoculated all available 26 pss mutants and discovered that pss21 is also infected by F. virguliforme. Earlier we have shown through T-DNA tagged mutant analyses that the GRP1 gene encoding a glycine-rich protein is the Pss1 gene. We investigated if Pss21 is the Pss1 gene. We sequence the GRP1 gene from the pss21 mutant and observed that it did not contain any mutation. Therefore, we concluded that Pss21 is most likely different from Pss1 and there are most likely at least two mechanisms conferring immunity of Arabidopsis against the fungal pathogen, F. virguliforme that causes sudden death syndrome in soybean. pss6 and pss30 mutants are immune to F. virguliforme. Therefore, Pss21 is most unlikely mapped to either of Pss6 and Pss30 loci. Thus, we have so far identified four genetic loci that are involved in immunity of Arabidopsis against P. sojae; they are: Pss1, Pss6, Pss21 and Pss30.",
                                "High-Resolution and High-Density Molecular Maps of Two Arabidopsis Genes that Confer Nonhost Resistance Against Phytophthora sojae.",
                                "We have developed a high density map of the Pss1 region. We have also mapped the Pss30 region, where Pss30 was localized to a 1.5 Mb region close to the south telomere of Chromosome 5. We analyzed 273 F2:3 families for markers of the Pss30 region. P. sojae susceptible families were applied in mapping the Pss30 gene to a 1 Mb DNA region located between SBP markers, SBP5—25.52 and SBP5—26.52. We isolated genomic DNA of five homozygous susceptible F2:3 families to sequence the pss30 genome at the Iowa State University DNA sequencing facility.",
                                "We compared the sequence of the Pss30 region of the pss30 allele with that of the ecotype Col-0 with the aid of the SHORE program (Ossowski et al. 2010) and identified three mutations at the Pss30 region. We therefore concluded that mapping of the Pss30 region was completed. We have finished mapping two Arabidopsis Pss genes, Pss1 and Pss30; and therefore, have completed this research objective.",
                                "One Arabidopsis Gene that Confers Nonhost Resistance Against P. Sojae.",
                                "We sequenced a DNA sample of seven pss1pss1 homozygous families by applying the Solexa sequencing technology. By comparing sequences of the Pss1 region of the bulked susceptible F2:3 families homozygous for the pss1 allele with that of the ecotype Col-0 with the aid of the SHORE program (Ossowski et al. 2010), we identified nine mutations that are located in the Pss1 region. Three of the nine mutations were originated from the pen1-1 mutant background used to generate the pss1 mutant. Therefore, they are not candidate Pss1 genes and were not considered for further investigation. The remaining six genes carrying point mutations are listed in Table 1.",
                                "We investigated if any of the candidate Pss1 genes are present in the soybean genome by conducting BLAST search at the NCBI website (http://blast.ncbi.nlm.nih.gov/Blast.cgi). The results are presented in Table 2. We observed that none of the six candidate Pss1 genes are conserved in soybean. Thus, it is possible that orthologous Pss1 sequence is missing in soybean and transfer of Pss1 to soybean may result in enhanced Phytophthora resistance in soybean.",
                                "In order to identify the mutant genotypes carrying T-DNA insertion mutations in homozygous condition, PCR was performed using the T-DNA left border-specific primer and the gene specific “Forward” and “Reverse” primers. Twenty-eight T-DNA mutants with insertion in five candidate Pss1 genes were collected from ABRC (http://abrc.osu.edu/) and analyzed for T-DNA insertion and the disease phenotypes following P. sojae infection. CS850460, SALK—148857C and SALK—090245C lines carrying T-DNA insertion mutations in the At3g59640 gene encoding a glycine rich protein were consistently infected by P. sojae. We termed the At3g59640 gene tentatively as GRP1. The homozygous T-DNA mutants in the GRP1 gene identified from CS850460, SALK—148857C and SALK—090245C lines were termed grp1-1, grp1-2 and grp1-3, respectively (FIG. 1). The lines carrying T-DNA insertion mutations for remaining four candidate Pss1 genes segregated for the T-DNA insertions, but were resistant to P. sojae (data not presented) and therefore these four genes cannot be candidate Pss1 genes. GK-476F03 line was obtained from NASC (http://arabidopsis.info/). It contains a T-DNA insertion in the sixth candidate Pss1 gene, AT3G59650. The mutant was resistant to P. sojae; therefore, AT3G59650 is not a candidate Pss1 gene.",
                                "FIG. 1. Identification of homozygous T-DNA insertion lines for the GRP1 gene encoding a glycine rich protein. A) Location of the mutations in the GRP1 gene. The EMS-induced mutation in GRP1, located in exon 2, resulted in an amino acid substitution from Gly to Asp. Three T-DNA insertion mutant lines, CS850460, SALK—148857C and SALK—090245C were termed grp1-1, grp1-2 and grp1-3, respectively. Locations of T-DNA insertions in these three mutants are shown with triangles. T-DNA insertions in grp1-1 and grp1-2 are located in the promoter and in grp1-3 in exon 1. B) PCR analyses showed that grp1-1, grp1-2 and grp1-3 mutants are in homozygous condition. LB, LB 1.3 primer specific to the T-DNA left border. F, forward primer and R, reverse primer that amplify the GRP1 gene fragment from the wild-type ecotype, Col-0. All three primers were simultaneously used in PCR of genomic DNA prepared from grp1-1 and Col-0 (extreme left panel). Note that the GRP1 gene-specific fragment is absent in all three mutants suggesting that the three mutants are homozygous for the T-DNA insertions in the GRP1 gene.",
                                "We determined the steady state GRP1 transcript levels in the three grp1 mutants by conducting RT-PCR (FIG. 2). Of the two T-DNA insertion mutations in the promoter region, grp1-1 did not show any GRP1 transcripts and was susceptible to P. sojae. grp1-2 with a T-DNA insertion in the promoter, showed leaky expression for GRP1 and was also not always infected by the pathogen (Table 3). The T-DNA insertion mutation in exon 1 (grp1-3), lacking GRP1 transcripts, was infected by the pathogen. These results suggest that GRP1 encoding a glycine rich protein is the candidate Pss1 gene.",
                                "GRP1 gene specific primers were used in RT-PCR analysis of the GRP1 transcripts. RNA molecules extracted from leaves of grp1-1, grp1-2 and grp1-3 plants, homozygous for T-DNA insertions, were used in the RT-PCR experiment. GRP1 transcripts were not detected in homozygous grp1-1 and grp1-3 mutants that were infected by P. sojae (Table 3).",
                                "FIG. 2. Steady state GRP1 transcript levels in the three grp1 mutants. RT-PCR was conducted to determine transcript levels of the three selected T-DNA insertion grp1 mutants.",
                                "In order to confirm that GRP1 is the Pss1 gene, we have cloned the wild-type GRP1 gene from Col-0 in a binary vector for complementation of the pss1 mutant. Floral dip method (Zhang et al. 2006) was used to transform the pss1 mutant. The bar gene encoding basta resistance was used as a selectable marker to transform the pss1 mutant with the GRP1 gene. PCR was conducted to confirm that basta resistant plants contain the bar gene (FIG. 3).",
                                "FIG. 3. Some of the basta resistant Arabidopsis transformants showed PCR amplification of the bar gene. Progenies of the Agro-infected plants were sprayed multiple times with the basta herbicide and PCR was conducted on some of the basta resistant seedlings using bar gene specific primers. GRP-gDNA, transformants carrying the GRP1 gene; GRP-cDNA, transformants carrying GRP1 cDNA; Col-0, lack of amplification from the non-transgenic ecotype Columbia-0 control plant. Arrow indicates the amplified bar gene",
                                "In parallel to cloning Pss1, we have also identified the candidate Pss30 gene. Results are summarized below.",
                                "In order to facilitate cloning of Pss30, we sequenced a bulked DNA sample of five pss30 homozygous families by applying the Solexa sequencing technology at the Iowa State University DNA Facility. By comparing sequences of the Pss30 region in the bulked DNA sample of five susceptible F2:3 families homozygous for the pss30 allele with that of the ecotype Col-0 with the aid of the SHORE program (Ossowski et al. 2010), we identified four mutations that are located in three genes of the Pss30 region (Table 4). We sequenced the pen1-1 mutant, in which pss30 was generated for these four mutations and observed that all four mutations are pss30-specific. None of these mutations were originated from the pen1-1 mutant background and therefore the three genes carrying four mutations were considered to be the candidate Pss30 genes. The three genes carrying point mutations are listed in Table 4. We collected the SALK T-DNA insertion lines for the three candidate Pss30 genes (Table 5). Only SALK—011184 carrying T-DNA insertion in the At5g66380 gene was infected by P. sojae. The RT-PCR analyses for the At5g66380 gene confirmed the absence of the transcript for this gene in SALK—011184 (FIG. 4).",
                                "We also investigate all three candidate Pss30 genes for presence of transcripts in leaves of the ecotype Col-0. We observed the RT-PCR products for only the At5g66380 gene (FIG. 5). This result is consistent with the expression levels of these three genes reported in the Genvestigator (https://www.genevestigator.com/gv/plant.jsp) database. Thus, most likely, At5g66380 is the Pss30 gene. It encodes a folate transporter 1 of the chloroplast envelope. Cloning of both cDNA and gDNA sequences of At5g66380 is underway.",
                                "FIG. 4. RT-PCR analysis of the At5g66380 gene in the SALK—011184 T-DNA insertion lines that were infected by P. sojae. RT-PCR confirmed the absence of At5g66380 expression in the T-DNA-induced mutant lines. Lane 1-6; Individual plants of SALK—011184C line which showed susceptibility to P. sojae, 7-8; Col-0 cDNA, 9; Col-0 gDNA samples. Arrows indicate the expected amplicon size from the cDNA (1,024 bp) and gDNA (1,986 bp) templates respectively. Expression of AtActin was used as the internal control.",
                                "FIG. 5. RT-PCR amplification of the three putative Pss30 genes from leaf tissue of Col-0. At5g66380 (Folate transporter 1 in chloroplast envelope) was the only gene that showed expression in Col-0 leaves that express Pss30. Lane 1; At5g64600, Lane 2; At5g65900, Lane 3; At5g66380 specific PCR products and M; 1 Kb marker."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe plant breeding goal",
                                "list desirable traits",
                                "introduce traditional plant breeding techniques",
                                "describe recurrent selection",
                                "describe bulk selection",
                                "describe mass selection",
                                "describe backcrossing",
                                "describe pedigree breeding",
                                "describe open pollination breeding",
                                "describe restriction fragment length polymorphism enhanced selection",
                                "describe genetic marker enhanced selection",
                                "describe doubled haploids",
                                "describe transformation",
                                "describe development of hybrids",
                                "describe evaluation of crosses",
                                "describe observation of phenotypic traits",
                                "describe examination of genotype",
                                "describe backcrossing approach",
                                "describe production of transgenic hybrid plant",
                                "describe three steps of hybrid development",
                                "describe selection of plants for breeding crosses",
                                "describe selfing of selected plants",
                                "describe crossing of inbred lines",
                                "describe restoration of vigor",
                                "describe production of hybrid seed",
                                "describe single cross hybrid",
                                "describe double cross hybrid",
                                "describe three-way cross hybrid",
                                "describe loss of hybrid vigor",
                                "describe consumption of hybrid seed",
                                "describe incorporation of references",
                                "describe modifications and embodiments",
                                "describe example 1",
                                "describe identification of Pss genes",
                                "describe mapping of Pss genes"
                            ],
                            "num_characters": 17841,
                            "outline_medium": [
                                "describe plant breeding goals",
                                "list desirable traits in field crops",
                                "introduce traditional plant breeding techniques",
                                "explain development of hybrids in a plant breeding program",
                                "describe evaluation methods for crosses",
                                "discuss moving genetic traits using transformation techniques",
                                "explain backcrossing approach",
                                "describe development of a hybrid in three steps",
                                "explain inbreeding process",
                                "discuss vigor restoration",
                                "describe use of transgenic plants in breeding",
                                "explain production of single cross, three-way, and double cross hybrids",
                                "discuss limitations of F2 hybrids",
                                "incorporate prior art by reference",
                                "provide disclaimer for modifications and embodiments",
                                "introduce examples",
                                "describe example 1: identifying Arabidopsis mutants susceptible to P. sojae"
                            ],
                            "outline_short": [
                                "describe plant breeding goals",
                                "list traditional plant breeding techniques",
                                "outline development of hybrids",
                                "explain backcrossing approach",
                                "describe inbreeding process",
                                "discuss hybrid vigor and uniformity",
                                "introduce transgenic plants in breeding programs",
                                "mention examples of hybrid production"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce compositions and methods for promoting pathogen resistance in plants",
                        "describe nonhost resistance genes identified from Arabidopsis",
                        "explain how genes confer nonhost pathogen resistance of Arabidopsis",
                        "describe use of genes to confer resistance in susceptible plant species",
                        "define \"confer or improve Phytophthora or other such pathogen resistance\"",
                        "list nucleic acid molecules and polypeptides associated with nonhost disease resistance",
                        "describe At5g64600 (O-fucosyltrasnferase protein) sequence",
                        "describe At5g65900 (DEAD-box ATP-dependant RNA helicase 27) sequence",
                        "describe At5g66380 (folate transporter 1, or FOLT1) sequence",
                        "describe At3g59640 (glycine-rich protein) sequence",
                        "describe At3g59650 (mitochondrial ribosomal protein L51/S25/Cl-B8 protein) sequence",
                        "describe At3g60310 (protein of unknown function) sequence",
                        "describe At3g60840 (MAP65-4, microtubule-associated protein 65-4) sequence",
                        "describe At3g60920 (protein of unknown function) sequence",
                        "describe At3g61580 (fatty acid/spingolipid desaturase) sequence",
                        "describe conservatively modified variants, fragments, and homologs",
                        "explain involvement of sequences in biochemical pathways",
                        "describe methods for introduction or modulation of sequences in a susceptible host plant",
                        "describe use of promoter and other regulatory elements",
                        "describe isolation of promoter, enhancer or other signaling sequences",
                        "describe transformation of plant cells with nucleotide sequences operably linked to promoter sequences",
                        "describe altered or enhanced responses to Phytophthora attack",
                        "describe use in engineering broad-spectrum disease and pest resistance",
                        "describe assays for protein activities",
                        "describe modulation of expression of other genes",
                        "define \"modulating\" or \"modulation\"",
                        "describe isolated nucleic acid molecules and proteins",
                        "describe fragments and variants of nucleotide sequences",
                        "describe fragments and variants of proteins",
                        "describe biologically active portions of non host resistance proteins",
                        "describe use of fragments as hybridization probes or PCR primers",
                        "describe altered proteins including amino acid substitutions, deletions, truncations, and insertions",
                        "describe methods for mutagenesis and nucleotide sequence alterations",
                        "describe guidance for conservative substitutions",
                        "describe identification of regulatory elements in the 5′ untranslated region",
                        "describe use of promoter regions to confer tissue-preferred expression",
                        "describe isolation of corresponding sequences from other organisms",
                        "describe use of PCR to amplify corresponding sequences",
                        "describe use of hybridization techniques to isolate corresponding sequences",
                        "describe use of probes to amplify corresponding sequences",
                        "describe assays that measure antipathogenic activity",
                        "describe measurement of disease resistance in plants",
                        "describe in vitro antipathogenic assays",
                        "describe microspectrophotometrical analysis",
                        "describe pathogens of the invention",
                        "describe use in altering defense mechanisms of a host plant",
                        "describe use in preventing corruption of the cell machinery by viruses and other plant pathogens"
                    ],
                    "num_characters": 23750,
                    "outline_medium": [
                        "introduce compositions and methods for promoting pathogen resistance in plants",
                        "describe nonhost resistance genes identified from Arabidopsis",
                        "explain how genes confer nonhost pathogen resistance of Arabidopsis",
                        "describe introduction or modulation of sequences in susceptible host plants",
                        "outline methods for stably transforming a plant with a nucleotide sequence",
                        "explain use of promoter and other regulatory elements",
                        "describe isolation of promoter, enhancer, or other signaling sequences",
                        "outline transformation of plant cells with nucleotide sequences operably linked to promoter sequences",
                        "describe exposure of transformed plants to pathogen infection",
                        "explain induction of transcriptional activation of nucleotide sequences",
                        "describe obtaining transformed plants with altered or enhanced responses to Phytophthora attack",
                        "outline use of sequences in engineering broad-spectrum disease and pest resistance",
                        "describe assays for protein activities obtained from various sources",
                        "explain modulation of expression of other genes involved in pathogen defense and response",
                        "define \"modulating\" or \"modulation\" of gene expression",
                        "describe isolated nucleic acid molecules comprising nucleotide sequences",
                        "outline fragments and variants of disclosed nucleotide sequences",
                        "explain biologically active portions of nonhost resistance proteins",
                        "describe use of nucleotide sequences as hybridization probes or PCR primers",
                        "outline methods for mutagenesis and nucleotide sequence alterations",
                        "describe isolation of corresponding sequences from other organisms",
                        "explain use of PCR and hybridization techniques to identify sequences",
                        "describe assays that measure antipathogenic activity induced by signal pathways"
                    ],
                    "outline_short": [
                        "introduce compositions and methods for promoting pathogen resistance in plants",
                        "describe nonhost resistance genes identified from Arabidopsis",
                        "outline methods for introducing or modulating these sequences in susceptible host plants",
                        "discuss use of promoter and other regulatory elements to drive expression of genes in plant cells",
                        "describe isolated nucleic acid molecules and polypeptides encoded thereby",
                        "outline fragments and variants of disclosed nucleotide sequences",
                        "discuss alterations to proteins of the invention, including amino acid substitutions, deletions, truncations, and insertions",
                        "describe use of nucleotide sequences to isolate corresponding sequences from other organisms",
                        "outline methods for measuring antipathogenic activity induced by signal pathways from disclosed sequences",
                        "discuss use of compositions and methods to inhibit or prevent plant diseases",
                        "describe expression constructs and methods for transforming plant cells"
                    ]
                },
                {
                    "title": "Example 2",
                    "paragraphs": [
                        "Earlier it was shown by studying T-DNA insertion mutants that GRP1 is the candidate Pss1 gene (Table 3 and FIG. 2). Transformation of a T-DNA insertion grp1 mutant established that the GRP cDNA can complement the lost function of the GRP1 in this mutant (FIG. 10). We subsequently transformed the gene into the soybean cultivar, Williams 82. The progenies of two independent transforments have been evaluated by infecting with multiple P. sojae isolates and F. virguliforme Mont-1 isolate. The FIGS. 7 and 8 show that incorporation of Arabidopsis GRP1 in transgenic soybean resulted in enhanced Phytophthora resistance. FIGS. 9 and 10 show that that incorporation of Arabidopsis GRP1 in transgenic soybean resulted in enhanced against the SDS pathogen, F. virguliforme.",
                        "FIG. 10. Arabidopsis glycine rich protein (GRP1) gene complemented the susceptible mutant phenotype in the SALK T-DNA mutant, C S850460 carrying T-DNA insertion in the Arabidopsis GRP1 gene. The cDNA fragment of the wild type Arabidopsis GRP gene was used to complement the SALK mutant, CS850460. Three leaves of 21-day old Arabidopsis seedlings were inoculated with 10 μl P. sojae zoospores drop/leaf (105 zoospores/mL). A, the SALK mutant, CS850460 lacking a functional Arabidopsis GRP1 gene was susceptible to the soybean pathogen, P. sojae; B, the introduction of the cDNA fragment of the wild type GRP1 gene complemented the mutant phenotype and recovered the wild type resistant phenotype in the transgenic SALK CS850460 leaves, which showed resistance comparable to the wild type, Columbia-0 (Col-0) ecotype level. C, Col-0 leaves showed immunity against P. sojae. The images were taken 2 days following inoculation with zoospores of the soybean pathogen, P. sojae.",
                        "FIG. 11. Leaves of transgenic soybean Williams 82 plants carrying the Arabidopsis GRP1 gene showed resistance to P. sojae. Leaves of the nontransgenic soybean cultivar, Williams 82 were susceptible to the pathogen. Two unifoliate leaves of 12 day-old soybean plants were inoculated with P. sojae spores (15 μl spore drop/isolate/leaf, 105 spores/mL). Radial growth of disease symptom was recorded at regular interval. Leaves of wild-type soybean cultivar, Williams 82 but not the transgenic soybean line, ST154-13, carrying the Arabidopsis GRP1 gene, showed significant spread of disease lesion in inoculated leaves transgenic soybean plants. The results showed that Arabidopsis nonhost resistance GRP1 provided nonhost resistance against the oomycete pathogen, P. sojae in transgenic soybean plants. This indicates that the Arabidopsis nonhost resistance mechanism is functional in soybean plants transformed with the GRP1 gene from Arabidopsis. Image shown is representative of inoculated leaves from one of three biological replications.",
                        "FIG. 12. Broad-spectrum resistance of transgenic soybeans transformed with Arabidopsis GRP1 against P. sojae. Radial growth of disease symptom (cm/day) was measured on transgenic soybean plants (T2 generation) carrying the GRP1 cDNA and the wild-type non-transgenic Williams 82 following inoculation with P. sojae zoospores. Transgenic plants from two separate transformation events, ST154-13 and ST154-21, were inoculated with P. sojae zoospores (105 spores/mL) from three different P. sojae isolates, CC5C, R1005 and R25. Two unifoliate leaves from 12-day old seedlings were inoculated with a 15 μl zoospores drop/isolate/leaf and lesion lengths were recorded 3-day post inoculation (dpi) and 4 dpi. Plants from both transgenic events showed significantly reduced disease lesion against all three P. sojae isolates as compared to the wild type, Williams 82 plants. The experiment was conducted two times with similar results. Error bars indicate SE.",
                        "FIG. 13. Leaves of transgenic soybean Williams 82 plants carrying the GRP1 gene showed resistance to F. virguliforme. The central leaflet of the trifoliate (3rd from top opened leaf) of 26-day old soybean plants were wounded with carborundum powder and then inoculated with the conidial spores of Fusarium virguliforme (15 μl from 107 spores/mL) that causes sudden death syndrome in soybean. Bleaching of the leaves was performed by dipping the infected leaf in 80% ethanol at 50° C. for 2 days. A, Leaves of the nontransgenic soybean cultivar, Williams 82 were susceptible to the pathogen. B, Leaves shown in A following bleaching with 80% alcohol. Note that the white area at the advancing region of the lesions was the chlorotic (yellow hallow) caused presumably by pathogen toxins. C, The transgenic soybean leaves carrying the Arabidopsis GRP1 gene provides resistance against the pathogen. D, Leaves of C following bleaching with 80% alcohol show necrotic lesions of the resistant response. Images shown are representatives of inoculated leaves from three biological replications.",
                        "FIG. 14. Arabidopsis GRP1 suppressed the lesion development in F. virguliforme-infected leaves of the transgenic soybean lines. The central leaflet of the unifoliate (3rd from top opened leaf) of 26-day old soybean plants were wounded with carborundum powder and infected with the Fusarium virguliforme conidial spores (15 μl from 107 spores/mL). Data presented are the average area of the disease spread at the wounded sites. Williams 82, the non-transgenic Williams 82 was used as the negative control. ST154-13, the soybean transgenic line carries Arabidopsis GRP1."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce GRP1 gene",
                        "describe T-DNA insertion mutants",
                        "show complementation of GRP1 in Arabidopsis",
                        "transform GRP1 into soybean",
                        "evaluate transgenic soybean for Phytophthora resistance",
                        "show enhanced resistance in transgenic soybean",
                        "provide FIG. 10",
                        "provide FIG. 11",
                        "provide FIG. 12",
                        "provide FIG. 13 and FIG. 14"
                    ],
                    "num_characters": 5396,
                    "outline_medium": [
                        "motivate GRP1 as candidate Pss1 gene",
                        "demonstrate GRP1 function in Arabidopsis",
                        "transform GRP1 into soybean cultivar",
                        "evaluate transgenic soybean for Phytophthora resistance",
                        "evaluate transgenic soybean for F. virguliforme resistance"
                    ],
                    "outline_short": [
                        "demonstrate GRP1 gene function",
                        "show transgenic soybean resistance"
                    ]
                },
                {
                    "title": "Example 3",
                    "paragraphs": [
                        "The following sequence were obtained from World wide web at Arabidopsis.org NCBI accession numbers are also given as an alternative sequence source."
                    ],
                    "subsections": [
                        {
                            "title": "Chromosome 3=CP002686.1",
                            "paragraphs": [
                                "At5g64600\n\nAccession number: NM 125856.5"
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide specific sequence information"
                            ],
                            "num_characters": 40,
                            "outline_medium": [
                                "provide specific gene sequence data"
                            ],
                            "outline_short": [
                                "specify At5g64600 sequence"
                            ]
                        }
                    ],
                    "outline_long": [
                        "provide sequence information"
                    ],
                    "num_characters": 148,
                    "outline_medium": [
                        "provide Arabidopsis sequence data"
                    ],
                    "outline_short": [
                        "provide Arabidopsis sequence data"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A modified plant with improved plant pathogen resistance particularly Phytophthora and Fusarium tolerance compared to the Phytophthora and Fusarium tolerance of a corresponding plant with no such modification; said modified plant having a heterologous nucleotide sequence which includes a non host resistance nucleic acid sequence from Arabidopsis, said non host resistance nucleic acid sequence encoding a protein selected from the group consisting of:\nO-fucosyltrasnferase protein; DEAD-box ATP-dependant RNA helicase 27, folate transporter 1; At3g59640 (glycine-rich protein);\nmitochondrial ribosomal protein L51/S25/Cl-B8 protein;\nAt3g60310; MAP65-4, microtubule-associated protein 65-4;\nAt3g60920; and\nfatty acid/spingolipid desaturase.",
        "2. The plant of claim 1 wherein said nonhost resistance nucleic acid is one or more of: At5g64600, At5g65900, At5g66380, At3g59640, At3g59650, At3g60310, At3g60840, At3g60920, and At3g61580.",
        "3. The plant of claim 1 wherein said non host resistance nucleic acid is one or more of the following: SEQ ID NOS: 1, 19, 3, 20, 5, 21, 7, 22, 9, 23, 11, 24, 13, 25, 15, 26, 17, or 27.",
        "4. The plant of claim 1 wherein said non host resistance nucleic acid encodes one or more proteins selected from the group consisting of: SEQ ID NOS: 2, 4, 6, 8, 10, 12, 14, 16, or 18.",
        "5. An isolated nucleic acid molecule, said molecule encoding a non host Arabidopsis Phtyophthora resistance protein wherein said nucleic acid molecule comprises a nucleotide sequence selected from the group consisting of:\n(a) a nucleotide sequence comprising the sequence set forth in SEQ ID NO: 11 or 15;\n(b) a nucleotide sequence comprising at least 50 contiguous nucleotides of the sequence of SEQ ID NO: 11 or 15, wherein said nucleotide sequence encodes a protein for Phytophthora resistance;\n(c) a nucleotide sequence having at least 90% sequence identity to the sequence of SEQ ID NO: 11 or 15 wherein said nucleotide sequence encodes a protein for Phytophthora resistance.",
        "6. A vector comprising the nucleic acid molecule of claim 5.",
        "7. A plant cell having stably incorporated in its genome the nucleic acid molecule of claim 5.",
        "8. The plant cell of claim 7, wherein said plant cell is from a divot plant.",
        "9. The plant cell of claim 7, wherein said dicot plant is soybean.",
        "10. The plant cell of claim 8 wherein said plant cell is a root cell.",
        "11. A method for conferring or improving Phytophthora resistance in a plant, said method comprising:\ntransforming said plant with a nucleic acid molecule comprising a heterologous sequence operably linked to a promoter that induces transcription of said heterologous sequence in a plant cell; and\nregenerating stably transformed plants, wherein said heterologous sequence comprises a nucleic acid molecule that encodes one or more Arabidopsis non host resistance protein sequences selected from the group consisting of: O-fucosyltrasnferase protein; DEAD-box ATP-dependant RNA helicase 27, folate transporter 1; At3g59640 (glycine-rich protein); mitochondrial ribosomal protein L51/S25/Cl-B8 protein; At3g60310; MAP65-4, microtubule-associated protein 65-4; At3g60920; and fatty acid/spingolipid desaturase.",
        "12. The method of claim 11 wherein said nucleic acid encodes one or more of: At5g64600, At5g65900, At5g66380, At3g59640, At3g59650, At3g60310, At3g60840, At3g60920, and At3g61580.",
        "13. The method of claim 11 wherein said nucleic acid sequence includes:\n(a) a nucleotide sequence comprising the sequence set forth in SEQ ID NO:: 1, 19, 3, 20, 5, 21, 7, 22, 9, 23, 11, 24, 13, 25, 15, 26, 17, or 27;\n(b) a nucleotide sequence comprising at least 50 contiguous nucleotides of the sequence of SEQ ID NOS:: 1, 19, 3, 20, 5, 21, 7, 22, 9, 23, 11, 24, 13, 25, 15, 26, 17, or 27; wherein said nucleotide sequence encodes a protein with non host Phytophthora resistance; and\n(c) a nucleotide sequence having at least 90% sequence identity to the sequence of SEQ ID NO:: 1, 19, 3, 20, 5, 21, 7, 22, 9, 23, 11, 24, 13, 25, 15, 26, 17, or 27;\n(d) a nucleotide sequence that encodes the protein sequence of SEQ ID NO:: 2, 4, 6, 8, 10, 12, 14, 16, or 18.",
        "14. The method of 11, wherein said plant is a dicot.",
        "15. The method of 11, wherein said dicot is soybean.",
        "16. An isolated Arabidopsis polypeptide having non host resistance to Phytophthora selected from the group consisting of:\n(a) a polypeptide comprising the amino acid sequence set forth in SEQ ID NO: 12 or 16;\n(b) a polypeptide encoded by a nucleotide sequence comprising the sequence set forth in SEQ ID NO: 12 or 16;\n(d) a polypeptide encoded by a nucleotide sequence that has at least 90% sequence identity to the sequence set forth in SEQ ID NOS: 11 or 16;\n(e) a polypeptide comprising an amino acid sequence having at least 90% sequence identity to the sequence set forth in SEQ ID NO:12 or 16; and\n(f) a polypeptide comprising an amino acid sequence of at least 50 consecutive amino acids of any of (a) through (e).",
        "17. A nucleotide construct comprising:\na nucleic acid molecule of claim 13, wherein said nucleic acid molecule is operably linked to a promoter that drives expression in a host cell.",
        "18. A method for conferring or improving Phytophthora resistance of a plant, said method comprising:\nstably introducing into the genome of a plant, at least one nucleotide construct comprising a non host resistance nucleic acid molecule operably linked to a heterologous promoter that drives expression in a plant cell, wherein said nucleic acid molecule encodes a polypeptide selected from the group consisting of O-fucosyltrasnferase protein;\nDEAD-box ATP-dependant RNA helicase 27, folate transporter 1;\nAt3g59640 (glycine-rich protein); mitochondrial ribosomal protein L51/S25/Cl-B8 protein;\nAt3g60310; MAP65-4, microtubule-associated protein 65-4;\nAt3g60920; and fatty acid/spingolipid desaturase.",
        "19. A method of screening a plant for Phytophthora resistance comprising:\nassaying said plant for the presence of a non-host resistance nucleic acid gene or fragment thereof, said nucleic acid encoding a protein selected from the group consisting of O-fucosyltrasnferase protein;\nDEAD-box ATP-dependant RNA helicase 27, folate transporter 1;\nAt3g59640 (glycine-rich protein);\nmitochondrial ribosomal protein L51/S25/Cl-B8 protein;\nAt3g60310; MAP65-4, microtubule-associated protein 65-4;\nAt3g60920; and fatty acid/spingolipid desaturase.",
        "20. A method of plant breeding for Phytophthora resistance comprising:\nidentifying a plant with an non host resistance nucleic acid encoding an Arabidopsis O-fucosyltrasnferase protein;\nDEAD-box ATP-dependant RNA helicase 27, folate transporter 1;\nAt3g59640 (glycine-rich protein);\nmitochondrial ribosomal protein L51/S25/Cl-B8 protein;\nAt3g60310;\nMAP65-4, microtubule-associated protein 65-4;\nAt3g60920; and\nfatty acid/spingolipid desaturase or the protein product thereof;\nselecting said resistant plant for use a parent plant;\ncrossing said parent plant with itself or a second plant, so that the Phytophthora resistance trait is passed to progeny seed; and\nharvesting progeny seed from said parent plant."
    ]
}