{
    "id": "https://semopenalex.org/work/W2135976950",
    "authors": [
        "María Rios",
        "Phillip Williamson",
        "Derek J. Taylor",
        "Valerie Winkelman",
        "Laura Ulitzky",
        "Nicoleta Cehan",
        "Dougbeh-Chris Nyan"
    ],
    "title": "Rapid Detection of Hepatitis B Virus in Blood Plasma by a Specific and Sensitive Loop-Mediated Isothermal Amplification Assay",
    "date": "2014-04-04",
    "abstract": "Hepatitis B virus (HBV) is an important blood-borne pathogen that causes hepatic inflammation and can lead to liver cirrhosis and hepatocellular carcinoma. Conventional methods of HBV detection are time consuming and require highly trained personnel and elaborate equipment. This report describes the development of a rapid, simple, specific, and sensitive loop-mediated isothermal amplification assay (LAMP) for detection of HBV genotypes A, B, C, D, E, and F in blood samples.HBV standard plasma panels and clinical donor plasma specimens were used for the development and validation of the LAMP assay. Amplification was performed at 60°C for 60 minutes using extracted DNA or heat-treated plasma specimens without DNA extraction. The assay was evaluated for its ability to detect various HBV genotypes and for its sensitivity, specificity, and time-point of detection.The LAMP assay detected HBV genotypes A-F and demonstrated a sensitivity of 10-100 IU per reaction of HBV DNA. The assay also detected 69 of 75 (92%) HBV-positive donor plasma specimens tested and demonstrated a specificity of 100%.These results demonstrate that our HBV-LAMP assay is rapid, sensitive and specific, and capable of detecting the major HBV genotypes. This assay could be used in clinical point-of-care settings, mainly in endemic and resource-limited environments for HBV diagnostics, donor screening, epidemiological studies, and therapeutic monitoring of patients undergoing antiviral treatment.",
    "sections": [
        {
            "title": "MATERIALS AND METHODS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Specimens, Standards, and DNA Preparation",
                    "paragraphs": [
                        "HBV genotyping reference plasma panels containing various titers of WHO international standards (OptiQuant, AcroMetrix/ Life Technologies, Grand Island, New York) and the Worldwide HBV DNA Performance Panel (WWHD301, SeraCare, Milford, Massachusetts) were used. A total of 182 donor plasma specimens were also used for assay development and evaluation. DNA extraction was performed using the QiAamp DNA Blood Mini Kit (Qiagen, Gaithersburg, Maryland) according to the manufacturer's protocol. DNA was extracted from 200-400 µL of plasma standards and eluted in 50-150 µL of Qiagen Buffer AE. Nucleic acid from the clinical specimens was concentrated by the addition of 0.5 M ammonium-acetate and 0.05 mg/mL glycerol (Ambion/Life Technologies), precipitated with 1 volume of 100% isopropanol (Sigma-Aldrich, St Louis, Missouri), and centrifuged, and the DNA pellet was resuspended in 25-35 µL of Buffer AE. Finally, the DNA was measured using Nano-Drop-1000 (Thermo Scientific), aliquoted, and stored at -80°C until needed for testing."
                    ],
                    "subsections": [
                        {
                            "title": "Heat Treatment of Donor Plasma Specimens as Substrate",
                            "paragraphs": [
                                "Substrate for HBV-LAMP was also prepared by heat treatment of donor plasma without DNA extraction. In brief, 25 µL of specimens was diluted 2-fold with nuclease-free water. The mixture was briefly vortexed and heated at 95°C for 5 minutes, then at 100°C for approximately 5 minutes. The mixture was then centrifuged at 12 000g for 3 minutes. The supernatant was reserved and 3-10 µL used in isothermal amplification for detection of HBV."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Design of Oligonucleotides",
                            "paragraphs": [
                                "Sequences of HBV genotypes (n = 197) were retrieved from the GenBank database of the National Center for Biotechnology Information and from the European Nucleotide Archive of the European Molecular Biology Laboratory. The sequences were analyzed using ClustalW2. HBV genotype A (GenBank accession number AB116094) was used for primer development and targeted conserved sequences within the S gene and the partially overlapping polymerase regions of the HBV genome (Figure 1). Primers were manually designed, aided by Primer-Explorer4 and Primer3 web interfaces, and synthesized by Integrated DNA Technologies (Coralville, Iowa) and EuroFins MWG Operon (Huntsville, Alabama). The primers are stable for at least 3 years at -20 and -80°C."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Formulation of Reaction Buffer",
                    "paragraphs": [
                        "A novel thermostable reaction buffer, the mannitol-acetate buffer (MAB; pH 7.8) was formulated and used for the LAMP reaction. MAB consisted of 2% D-mannitol; 0.2% Triton X-100; 0.5M L-proline; 10 mM Tris acetate; 1.6 mM magnesium acetate; 15 mM potassium acetate; 40 mM Tris hydrochloride; 20 mM potassium chloride; 20 mM ammonium sulfate; 6 mM magnesium sulfate; and 2 mM each deoxynucleotide triphosphate."
                    ],
                    "subsections": []
                },
                {
                    "title": "Accelerated Stability Studies of Reaction Buffer",
                    "paragraphs": [
                        "Aliquots of the MAB were stored at room temperature (22°C-25°C) under sterile condition for approximately 6 months and then evaluated in LAMP for its stability when used to amplify nucleic acid. In addition, accelerated stability studies were performed by heating freshly formulated MAB at 60°C for 60 minutes, cooled at room temperature, heated again for an additional 30 minutes (3 times daily for 5 days), then used in LAMP reactions for detection of HBV DNA."
                    ],
                    "subsections": [
                        {
                            "title": "Reaction Mixture and Condition",
                            "paragraphs": [
                                "Isothermal amplification of the HBV DNA was performed in a 25-µL total reaction mixture. Reaction cocktail consisted of 12.5 µL of 2× MAB; 1.2 µM each of Hepatitis-B-Universal Forward Inner Primer (HBU-FIP) and HBU-Reverse Inner Primer (RIP); 0.8 µM each of HBU-Loop Forward (LF) and HBU-Loop Reverse Primer (LR); 0.4 µM each of HBU-Forward Outer Primer (F3) and HBU-Reverse Outer Primer (R3); and 8 units of Bst DNA polymerase (New England Biolabs). Three to 10 µL of DNA or heat-treated plasma was applied as template. A no-template (water) control and DNA extracted from HBV-negative plasma were used as negative controls. DNA of known HBV genotypes was used as positive control. Isothermal amplification was performed at 60°C for 60 minutes on a simple digital heat block. All reagents were prepared in a PCR chamber and experiments were performed in a unidirectional flow process with precautionary measures observed to avoid crosscontamination."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Analysis of Reaction Products",
                            "paragraphs": [
                                "Five microliters of HBV-LAMP products was electrophoretically analyzed on 2.8% agarose gel stained with GelRed DNA intercalating dye (Phenix Research, Candler, North Carolina), run in 1× TAE buffer at 100 volts for 50-55 minutes, and visualized with a UV transilluminator at 302 nm. Amplification products were also visualized in the original reaction tube by adding 0.5 µL of a 10× GelGreen fluorescence dye (Phenix Research) to 10 µL of LAMP reaction products, visualized with a UV transilluminator at 302 nm, and photographed with the BlackBerry Bold (Research In Motion) and the iPad Air (Apple, Inc) cameras."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Analytical Sensitivity and Specificity of HBV-LAMP Assay",
                            "paragraphs": [
                                "Analytical sensitivity was evaluated by testing 10-fold serial dilutions of HBV DNA. The assay detection limit was determined by analysis of 4-7 replicates of serially diluted HBV DNA (Op-tiQuant HBV DNA Quantification Panel). The analytical specificity of the HBV-LAMP assay was investigated by testing HBV-specific primers against DNA (approximately 30 ng) extracted from cytomegalovirus (CMV)-positive and parvovirus (PV)-positive plasma specimens. Specificity of the HBV oligonucleotides was further evaluated by testing DNA (approximately 50 ng) of Leishmania major, Leishmania tropica, and Trypanosoma cruzi (kindly provided by Dr Robert Duncan and Carolyn Fisher of the US Food and Drug Administration [FDA], Bethesda, Maryland). "
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Assay Diagnostic Sensitivity and Specificity",
                            "paragraphs": [
                                "The diagnostic sensitivity and specificity of HBV-LAMP assay was investigated by blind testing a total of 182 donor plasma specimens that were preselected using the Procleix Ultrio assay (Gen-Probe, Emeryville, California)."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Time-point of Assay Detection",
                            "paragraphs": [
                                "To determine the time-point at which HBV DNA is amplified by the LAMP assay, time-course amplification studies were performed at 10-, 20-, 30-, 40-, and 60-minute time-points using 50 and 100 IU of HBV DNA per reaction. At the end of the indicated reaction tubes containing HBV DNA were removed from the heat block and placed on ice to terminate the reaction."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Detection of HBV DNA",
                    "paragraphs": [
                        "HBV DNA extracted from plasma standards of various HBV genotypes were used in the assay. Electrophoretic analysis of the LAMP products demonstrated successful detection of all 6 major HBV genotypes (A-F) with a universal set of HBV-LAMP primers (Figure 2A). The LAMP reaction resulted in a unique laddering pattern of amplicons common to all genotypes detected (Figure 2A). UV visualization of LAMP products with GelGreen dye revealed a greenish-fluorescent glow in the reaction tubes that were positive for amplified HBV DNA (Figure 2B). No fluorescent reaction or laddering pattern was observed for the no-template (water) control or the normal human plasma (Figure 2A and2B)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Analytical and Diagnostic Sensitivity of HBV-LAMP Assay",
                    "paragraphs": [
                        "Assay sensitivity was evaluated by testing 10-fold serial dilutions of HBV DNA in the LAMP reaction. The assay detected down to 10 IU per reaction of HBV DNA (Figure 3A). Addition of GelGreen fluorescent dye to the reaction tubes revealed a fluorescent glow with decreasing intensity from 10 4 to 0.1 IU/ reaction (Figure 3B). Also, donor plasma samples (n = 75) were tested to evaluate the diagnostic sensitivity of the assay. Test results revealed that the assay detected 69 of 75 (92%) as HBV positive (Table 1). The undetected samples (n = 6) had DNA levels below the assay detection limit (approximately 7-10 IU/reaction)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Analytical and Diagnostics Specificity of HBV-LAMP Assay",
                    "paragraphs": [
                        "The analytical specificity of the HBV-LAMP assay was investigated by testing DNA of CMV and PV, respectively. Electrophoretic analysis of test results revealed no detection (Figure 3C). Also, specificity of the HBV oligonucleotides was evaluated by testing DNA of L. major, L. tropica, and T. cruzi in the LAMP assay. Results of the test also demonstrated no detection (Figure 3D). To assess the diagnostic specificity of the assay, healthy human plasma specimens (n = 107) were tested and all samples tested negative (100%) by the HBV-LAMP assay (Table 1)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Evaluation of HBV-LAMP Assay",
                    "paragraphs": [
                        "To determine the field and clinical utility of the HBV-LAMP assay, experiments were conducted using donor plasma specimens from which DNA was extracted. Aliquots of the identical plasma samples were also heat-treated (without DNA extraction) and directly tested in the LAMP reaction. The results of agarose-gel electrophoresis demonstrated detection of HBV DNA using both extracted DNA and heat-treated plasma samples (Supplementary Figure 1). The assay detected 2 additional samples (numbers 15 and 21) when extracted DNA was used, suggesting that the assay is more sensitive under those conditions."
                    ],
                    "subsections": []
                },
                {
                    "title": "Limit of Detection",
                    "paragraphs": [
                        "To determine the limit of detection of the HBV-LAMP assay, 4-7 replicates of serially diluted HBV DNA that was extracted from the OptiQuant HBV DNA quantification plasma panel (AcroMetrix/Life Technologies) were assayed and analyzed. Results revealed a 100% detection rate for 25, 50, 10 2 , 10 3 , and 10 4 IU of HBV DNA molecules per reaction, whereas 1 IU and 10 IU of HBV DNA was detected at 25% and 57% rates, respectively (Table 2)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Time-point of Detection",
                    "paragraphs": [
                        "One of the advantages of the LAMP assay is its rapid detection process. To evaluate the earliest time-point at which detection occurs, amplification of HBV DNA was tested at defined time intervals. Results of experiments revealed that the assay detection of 50 IU of HBV DNA appeared at the 30-minute time-point, and 100 IU of HBV DNA was detected at the 20-minute time-point (Supplementary Figure 2)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Stability of Reaction Buffer",
                    "paragraphs": [
                        "The stability of the MAB was evaluated as described above. Electrophoretic analysis showed successful amplification of 25 IU/reaction of HBV DNA using fresh buffer regularly stored at -20°C, 10 IU/reaction of HBV DNA when room temperature-stored buffer (22-25°C) was used, and 50 IU/reaction  HBV DNA when accelerated-aged buffer was used (Supplementary Figure 3)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "The prevalence of HBV infection in underprivileged communities and regions of the world has generated heightened concerns in healthcare circles worldwide [20][21][22][23][24][25]. HBV screening and diagnosis in resource-limited environments is often a challenging situation, because of time and cost limitations, thus leaving infected individuals undiagnosed for several years. This underscores the need for a simple and rapid diagnostic and screening tool that is applicable not only in resource-limited settings, but also in any region of the world with high prevalence of HBV infections [26][27][28]. In developed settings, the HBV-LAMP assay could be useful to verify that a patient undergoing HBV treatment has achieved full virological suppression.",
                "In the present study, we developed and validated a sensitive and rapid isothermal amplification assay for pan-detection of HBV genotypes (A-F) in plasma specimens (Figure 2). The HBV-LAMP assay offers several advantages over conventional \"gold standard\" methods such as real-time PCR or ELISA: (i) the assay does not require sophisticated equipment and costly reagents, (ii) it requires less time (<60 minutes) to conduct, and (iii) it is performed on a simple digital heat block, without the need for high technical expertise. Thus, in regions with struggling national economies and lack of high-tech diagnostic equipment, these advantages make the HBV-LAMP assay well suited for use in such resource-limited settings for blood screening and diagnosis of HBV infection.",
                "The sensitivity of the HBV-LAMP assay was evaluated to assess its clinical and field applicability, using characterized standards and blinded clinical plasma specimens. Compared with the FDA-licensed Procleix Ultrio Plus dHBV test, the HBV-LAMP assay detected 69 of 75 (92%) HBV-positive donor plasma specimens (Table 1); the assay sensitivity approaches 100% with the use of fluorophores for detection (data not shown). As shown by the Probit data in Table 2, the LAMP assay also revealed a 100% detection rate for 25, 50, 10 2 , 10 3 , and 10 4 IU of HBV DNA per reaction, whereas 1 IU and 10 IU of HBV-DNA was detected at 25% and 57% rates, respectively. These findings suggest that the LAMP assay performed efficiently when used in testing and analysis of clinical specimens for HBV infection.",
                "Sample enrichment and volume play a critical role in detection sensitivity. For example, the Procleix Ultrio assay utilizes an automated target capture specimen-processing method and employs higher volumes [29] (see packet insert]. On the other hand, the HBV-LAMP assay used a smaller starting volume for nucleic acid extraction and a smaller input volume for amplification, yet yielding a sensitivity of 92% (Table 1). Thus, given its plausible performance vis-à-vis the clinical and epidemiological relevance of HBV infection, the HBV-LAMP assay is potentially applicable in field environment and in clinical settings for screening and rapid detection of HBV infection.",
                "Notably, the LAMP assay also successfully detected HBV DNA in heat-treated plasma (Supplementary Figure 1B), irrespective of the possible presence of potential amplification inhibitory substances that are found in blood products [30,31]. This method of template preparation (as opposed to nucleic acid extraction) contributed to the rapidity of the assay and simplified the detection process (Supplementary Figure 1 and3D). However, an increase in the volume of starting material from 25 µL to a larger volume (eg, 100 µL) may be necessary to improve the sensitivity of detection when using heat-treated plasma for the reaction. Further investigation of this method may prove helpful in resource-limited environments to facilitate the test at lower cost and ease. In consideration of detection specificity and accuracy in clinical diagnostics, primers in this LAMP assay were designed that specifically targeted conserved sequences of the S gene and overlapping polymerase regions that show about 96% sequence identity and homology across the HBV genotypes [32]. As shown in Figure 2, the LAMP assay detected various HBV genotypes (A-F), thereby demonstrating its global coverage of HBV detection. When healthy donor plasma samples (n = 107) were tested, the HBV-LAMP assay revealed a diagnostic specificity of 100% as no amplification of HBV DNA was observed in these specimens (Table 1). This characteristic of the HBV-LAMP assay was also confirmed by its detection of only the target HBV DNA without cross-reaction with CMV, PV, T. cruzi, or the Leishmania species (Figures 3C and3D).",
                "Within the context of today's globalization, people have been moving across international borders either for sociopolitical/socioeconomic reasons or for recreational purposes [33][34][35]. This rapid trend of human migration has influenced the spread of viral hepatitis and its changing epidemiology from Afghanistan to Pakistan, from the Indian subcontinent and Asia to the eastern Mediterranean, North Africa, and the United States [34,[36][37][38]. Hence, the severity and prevalence of HBV emphasizes the need for a rapid and affordable diagnostic screening tool as reported in this study, which could be used to investigate HBV prevalence in different regions of the world. A noteworthy advantage of the LAMP assay reported in this study is its use of a thermostable reaction buffer (MAB) and the Bst DNA polymerase, 2 major components that allowed preparation of reaction mixture at room temperature as well as performance of amplification under isothermal conditions without compromising sensitivity. It is well established that Bst DNA polymerase has DNA strand displacement activity, whereas L-proline has a destabilizing effect on the DNA double helix, lowers the melting temperature of DNA, confers salinity tolerance, and aids in DNA polymerase stability [12][13][14]. In addition, D-mannitol, a hygroscopic and osmopotent material, also promoted buffer stability and robustness under thermostressed conditions [39,40]. As demonstrated by the accelerated stability tests, the MAB surprisingly retained a considerable level of stability and robustness (Supplementary Figure 3A-C).",
                "The advent of nucleic acid amplification tests in clinical diagnosis and donor blood screening brought tremendous improvement by ensuring safety of blood products and prevention of disease transmission. Yet, diagnostic tools such as PCR-based tests have inherent limitations that include the lack of rapidity, laborious performance process, use of cumbersome equipment, and being easily prone to contamination [41,42]. In contrast, the HBV-LAMP assay demonstrates ease of performance, rapidity, sensitivity, and the use of multiple primers that makes the assay highly specific and less liable to cross-contamination. The assay detected 50 IU of HBV DNA in 30 minutes, thereby reducing the reaction time for detection (Supplementary Figure 2). These advantages of the HBV-LAMP assay could contribute to filling gaps seen in transfusion medicine in resource-limited settings. Although we did not further investigate the assay's timecourse of detection using a lower amount or concentration of DNA, it is plausible to suggest that the entire 60-minute reaction time may be required to detect a smaller quantity of DNA (approximately 10 IU/reaction) as shown in Figure 3A and Supplementary Figure 3B. Also, field studies would be necessary to confirm the reliability of the assay in developing world-settings.",
                "Considered in aggregate, the HBV-LAMP detection assay reported in this study is rapid, simple to use, and specific. Mostly applicable in environments with scarcity of medical diagnostics resources, the HBV-LAMP assay could be used for blood screening and detection of HBV infection in highly endemic populations and for therapeutic monitoring of patients undergoing antiviral treatment."
            ],
            "subsections": [
                {
                    "title": "Supplementary Data",
                    "paragraphs": [
                        "Supplementary materials are available at Clinical Infectious Diseases online (http://cid.oxfordjournals.org). Supplementary materials consist of data provided by the author that are published to benefit the reader. The posted materials are not copyedited. The contents of all supplementary data are the sole responsibility of the authors. Questions or messages regarding errors should be addressed to the author."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}