{
    "id": "https://semopenalex.org/work/W4304014483",
    "authors": [
        "Ping Zhang",
        "Xin Chen",
        "Yanming Ma",
        "Xiaoran Zhang",
        "Xiaobing Liu",
        "Changfeng Chen",
        "Jia‐Ning Wang",
        "Fengjiao Li",
        "Gang‐Qin Liu",
        "Xinyu Pan",
        "Shuai Duan",
        "Kang-yuan Liu"
    ],
    "title": "Highly coherent nitrogen-vacancy centres in diamond via rational high-pressure and high-temperature synthesis and treatment",
    "date": "2022-10-10",
    "abstract": "Nitrogen-vacancy (NV - ) centres in diamond offer an excellent platform for device design and development in the emerging fields of quantum sensing and quantum network, but fabrication of quantum-grade diamonds with highly coherent NV- centres needed for advanced applications presents a pressing challenge. Here we report a major advance in generating NV - centres in diamonds via tailored high-pressure and high-temperature (HPHT) synthesis and post-grown annealing treatment. The resulting well dispersed single NV - centres in type-IIa diamonds exhibit long spin coherence times reaching the highest levels achieved in diamonds prepared by more elaborate and restrictive chemical vapor deposition techniques. Moreover, we produce high-density NV - ensembles in <100>-grown type-Ib diamonds with superb zero-phonon lines considerably sharper than those of native NV - centres in as-grown diamonds. These findings demonstrate a superior synthesis and optimization protocol for creating top-quality NV - centres to meet the most stringent requirements for a wide range of emerging quantum technologies.",
    "sections": [
        {
            "title": "Results and discussion",
            "paragraphs": [
                "HPHT synthesis of diamonds.",
                "We used a cubic large volume press (SPD-6×1200) to synthesize diamond single crystals (~3-9 mm in size) at pressures of 5.3-5.8 GPa and temperatures of 1,350 to 1,650 ℃ (see details in Experimental Section and Supplementary Fig. S1). High-purity graphite and Fe-Ni alloys were used as carbon source and catalyst, respectively. HPHT synthesized type-Ib diamonds (~0.4 mm in size) were used as seeds for further diamond growth. The morphologies of produced diamonds were controlled by the substrates and P-T parameters; for example, a gradual transformation from a <100>-dominated cubic to a <100>-<111>-equal cub-octahedron, and then to a <111>dominated octahedron can be induced by increasing temperature during the growth process on a <100>-substrate. Al/Ti powders and NaN3/Ba(N3)2 were used as nitrogen getter and nitrogen sources, respectively, to modulate the total nitrogen content in the HPHT synthesis chamber. The obtained high-quality single-crystalline type-IIa diamonds and nitrogen-rich type-Ib diamonds are shown in Fig. 1a-1d. The as-grown diamonds with different nitrogen contents are colorless (below 1 ppm nitrogen), yellowish (~50-150 ppm nitrogen), yellow (~150-600 ppm nitrogen), or green (above 600 ppm nitrogen). Nitrogen impurities are incorporated as substitutional defects in the diamond lattice, as C-centres (P1) with infrared absorption peaks at 1,130 and 1,344 cm -1 , while nitrogen pairs (A-centres) with the characteristic peak at 1,280 cm -1 also appear at increasing N contents (see Supplementary Fig. S2). "
            ],
            "subsections": [
                {
                    "title": "Distribution of native NV -centres in as-grown HPHT diamonds.",
                    "paragraphs": [
                        "After synthesis, selected diamonds were cut and polished into parallel slices ~1-2 mm in thickness for further characterization (Fig. 1e) to determine the distribution of defects formed in as-grown diamonds. Figure 1f shows a photoluminescence (PL) analysis of diamonds produced at 80 K using 473-nm and 532-nm laser excitations. Nitrogen vacancy centres with zero-phonon lines (ZPL) at 575 nm (NV 0 ) and 638 nm (NV -) formed in the <111> growth surface in some type-IIa diamonds and all type-Ib diamonds. The NV -centres in type-IIa diamonds show strong and narrow ZPL, while the full width at half maximum (FWHM) of ZPL for the NV -centres in type-Ib diamonds is notably broadened, which is undesirable for quantum applications, thus necessitates improvements via suitable post-grown treatments, as will be discussed below.",
                        "On the <100>-growth surface, H3 centres (N-V-N) with a sharp ZPL at 503 nm appear and generally increase with rising nitrogen content in type-Ib diamonds. NV 0/-centres are seldomly found in the <100>-and <311>-grown diamonds, and sharp lines for different defect locations are identified based on diamond growth orientations (Fig. 1g and Supplementary Fig. S3), indicating preferred formation orientation of NV 0/-centres along the <111> direction during HPHT diamond growth (see Supplementary Fig. S4 and Table S1). In <111>-grown diamonds, the density of NV -centres increases with rising nitrogen content, reaching a maximum value of suitable13.4 ppb in a diamond (sample-IbD06) containing 221 ppm nitrogen impurities, followed by a steep decrease, becoming nearly undetectable at higher nitrogen contents (Fig. 1h). Furthermore, paramagnetic Ni-related defects with ZPL at 494 nm are incorporated into diamond along the <111> direction, which tend to degrade coherent properties of NV -centres; meanwhile, such defects are absent in the <100>-grown bulk (Fig. 1f), making <100>-grown type-Ib diamonds promising substrates for creation of desirable NV -centres via post-grown annealing treatment."
                    ],
                    "subsections": []
                },
                {
                    "title": "HPHT annealing treatment",
                    "paragraphs": [
                        "We performed annealing treatment on diamonds synthesized at temperatures ranging from 1,000 to 2,000 ℃ under pressure of 5 (± 0.5) GPa, holding for two hours in each run, then quenched the diamonds down to room temperature in 10 minutes. During this process, no graphitisation occurs below 1,700 ℃ in the nitrogen-rich type-Ib diamonds, while the type-IIa diamonds stayed stable up to 2,000 ℃. Figure 2a shows an evolution diagram of NV-related defects during the HPHT annealing treatment. The native NV -centres in <111>-grown type-IIa diamonds are stable over the entire temperature range and the PL intensity increases significantly by about five-fold after treatment at 1,500 ℃ (see Supplementary Fig. S5a). Furthermore, newly generated NV - centres are seen in <100>-grown sections of both type-IIa and type-Ib diamonds without prior any presence of native NV -centres, and these results are sensitive to treatment temperatures (Supplementary Figs. S5b andS6). The creation of NV -centres usually requires high treatment temperatures of 1,900-2,000 ℃ in type-IIa diamonds, while the nitrogen-rich environment in type-Ib diamonds reduces the treatment temperatures to 1,400 ℃. Figures 2b,c show PL spectra taken from the <111>-and <100>-grown sections of a type-Ib diamond (sample-IbD06). The ZPL intensity of the NV -centres in the <111>-grown section nearly doubles after the diamond was treated at 1,400 ℃. At higher annealing temperatures, the ZPL intensity of NV -centres decreases and eventually disappears above 1,600 ℃, accompanied by a significant increase of signal from H3 centres in the temperature range of 1,400-1,600 ℃ and the appearance of N4V centres at 1,700 ℃. In contrast, in the <100>-grown sections, the NV -centres start to form at 1,400 ℃, reaching a maximum population of ~130 ppb at 1,500 ℃, and remain stable above 1,700 ℃ (Fig. 2c). Meanwhile, there is a large increase of H3 centres at elevated annealing temperatures, evidenced by a high PL intensity with sharp ZPL at 503 nm at 1,700 ℃. Figure 2d shows integrated intensity ratio of INV/ID with changing annealing temperature, and excessive nitrogen impurities in primitive crystals reduce the productivity of NV -centres because of aggregation into other complexes, such as H3, N4V, at high temperatures.",
                        "NV -centres with a high density of 214.0 ppb were generated in a type-Ib diamond (sample-IbD05) with 25 ppm nitrogen after annealing treatment at 1,700 ℃ (Supplementary Fig. S7).",
                        "HPHT annealing treatment is also effective in narrowing the width of ZPLs of NV -centres (Fig. 2e). Significantly narrowed ZPLs with FWHM value ~0.31 nm were achieved in the <100>grown diamonds, and this value is only one-seventh of the FWHM of the ZPLs measured in the <111>-grown sections, rivaling those seen in native NV -centres in type-IIa diamonds.",
                        "The high density, strong and narrow ZPL lines, improved thermal stability, and absence of Ni-related defects (Supplementary Figs. S8 andS9) make HPHT synthesized and treated NV - centres in <100>-grown type-Ib diamonds suitable for high-sensitivity sensing devices. Furthermore, temperatures needed to generate NV -centres can be lowered by introducing lattice defects on polished diamond surface (Supplementary Fig. S10). To illustrate this point, we mechanically etched \"HPPMS\" on a <100>-grown diamond surface by FIB techniques and generated NV -centres with a high density of 241.5 ppb in target regions at a depth ~0.5 μm (Fig. 2f) at significantly reduced annealing temperature down to 1,000 ℃. This result demonstrates a feasible route for controlled creation of patterned NV -centres at desired target locations under moderate temperature conditions."
                    ],
                    "subsections": []
                },
                {
                    "title": "Coherent properties of single NV -centers in type-IIa HPHT diamonds",
                    "paragraphs": [
                        "Figure 3a shows a 16×16 μm 2 confocal image (at a depth of about 5 μm from the surface) of a <111>-grown type-IIa diamond (sample-IIaD01) after an annealing treatment at 1,500 ℃. It shows that NV -centres dispersedly distribute throughout the diamond after the HPHT annealing process (Supplementary Fig. S11), which can be optically addressed. Figure 3b displays the confocal image of a single NV -center, showing as a bright fluorescence spot (about 0.5 μm in diameter) with a second-order correlation function of g 2 (0) ~ 0.2 (Fig. 3b insert). Among the 13 measured points, 12 points (92%) are single NV -centres. We then used standard free-induction decay (FID) and spin echo measurements (see Methods) to quantify the spin coherence of these single NV -centres. As shown in Fig. 3c, typical NV electron spin dephasing time (T2*) reaches 3.0 μs, long enough to resolve the host 14 N and nearby 13 C nuclear spins (the beating feature of Fig. 3c). Spin echo measurements reveal that the spin coherence time, T2, of this NV -centre is about 420 μs (Fig. 3d). The collapse and revival feature indicates that the 13 C nuclear spin bath (natural abondance) dominates the NV spin decoherence process, and the contribution of P1 center is negligible. We measured 4 single NV -centres in the <111>-grown type-IIa diamonds, and their T2 are all above 300 μs. This result matches the best value achieved in quantum-grade CVD diamonds. The NV -centres in the type-IIa <100>-diamond (sample-IIaD02) tend to form aggregated states (Supplementary Fig. S12), with only a small number of single NV -centres, due to the high treatment temperature of 2,000 ℃. The T2 times of single NV -centres in the <100>-grown sections also reach high values ranging from 200 to 300 μs (Supplementary Fig. S13). Such prolonged coherence times (Fig. 3e) of single NV -centres embedded in HPHT type-IIa diamonds meet the requirement for quantum computing and quantum simulation applications. "
                    ],
                    "subsections": []
                },
                {
                    "title": "Coherent properties of ensemble NV -centres in type-Ib HPHT diamonds",
                    "paragraphs": [
                        "In nitrogen-rich type-Ib diamonds, coherent properties of ensemble NV -centres are sensitive to diamond growth orientation, total nitrogen content and annealing temperature. In native NV - ensembles of <111>-grown sections of sample-IbD06, T2 improves to 1.2 μs by HPHT annealing treatment accompanied by a reduction of NV -density, from 13.4 to 1.8 ppb (Supplementary Fig. S14). In contrast, long T2 (4.3 μs) and high density (127.2 ppb) of HPHT generated NV - ensembles were simultaneously achieved in the <100>-sections after annealing at 1,500 ℃ (Fig. 4a). T2 of NV -ensembles (density 123.2 ppb) reaches 12.0 μs in the annealed <100>-section of sample-IbD05 (Fig. 4b) due to relatively low nitrogen content (25 ppm). With rising annealing treatment temperatures up to 1,700 ℃, T2 rises to 52.0 μs, which is the highest reported value for NV -ensembles in type-Ib diamonds, with an increased NV density of 110.2 ppb (Fig. 4c). from the <111>-section of IbD06 (as-grown), <111>-section of IbD06 (annealed at 1,500 ℃), <311>-section of IbD06 (annealed at 1,500 ℃), <100>-section of IbD08 (annealed at 1,400 ℃), <100>-section of IbD06 (annealed at 1,500 ℃), <100>-section of IbD05 (annealed at 1,500 ℃), <100>-section of IbD08 (annealed at 1,300 ℃), and <100>-section of IbD05 (annealed at 1,700 ℃). The measured T2 values are listed in Supplementary Table 2. h, Schematic diagram of the influence on the spin bath of P1 centres surrounding one NV -centre by HPHT annealing treatment. is observed in the <111>-grown diamonds (Supplementary Fig. S14), which is a common feature of high-density NV -ensembles in type-Ib diamonds 11,25 . The splitting of resonance is effectively suppressed to the value caused by geomagnetic field in <100>-grown diamonds after annealing, which is essential to zero-field sensing applications 26 . The splitting of resonance (2Δ) is below 5 MHz and further decreases with increasing annealing temperatures, much improved from that of the native NV -centres in the <111>-grown diamonds (~11-14 MHz). This feature indicates ultralow stress and electric fields near the NV -centres in <100>-grown diamonds. Figure 4g illustrates the correlation between the frequency splitting in zero-field ODMR spectra and measured T2, showing that reduction of frequency splitting is accompanied by long coherence times due to a significant increase of neutral H3 centres (Supplementary Fig. S7) that attenuate the influence of the spin bath from P1 centres (S=1/2) surrounding each NV -center (Fig. 4h) 11,27 , in addition to the decrease of residual stress by HPHT annealing treatment.",
                        "The diamond samples prepared in this work exhibit a magnetic signal detection sensitivity 28 of about 2.5 pT/Hz -1/2 in an 8.5×10 -4 mm 3 sensing volume, which is an order of magnitude higher than the corresponding value of 33.8 pT/Hz -1/2 for native NV -centres in <111>-grown diamonds, and well above previously reported results (~116 pT/Hz -1/2 ) 17 . This result lays a material foundation for developing supersensitive diamond magnetometry."
                    ],
                    "subsections": []
                },
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "We have demonstrated a rational strategy for producing quantum-grade diamonds by tailoring optimal P-T conditions for both initial synthesis and post-grown annealing treatment, generating NV -(single and ensemble) centres that exhibit excellent benchmark properties well suited for advanced quantum applications. During the initial growth, a properly chosen crystal orientation is pivotal to selectively targeting the qualities of produced NV -centres, and ensuing annealing treatment plays a crucial role in enhancing key performance characteristics via improvement of the spin bath surrounding the NV -centres by increasing neutral H3 centres and dissolving Nirelated defects. Our study led to an unexpected discovery showing that the <100>-grown diamond sections are optimal substrates for generating high-density NV -centres with long coherent times by HPHT annealing treatment, despite that NV -centres rarely appear in <100> sections during the initial diamond growth. This finding establishes a robust protocol for ondemand generation and optimization of highly coherent NV -centres in HPHT diamonds.",
                        "The current results also point the way for further improving NV -centres in HPHT diamonds.",
                        "The density of NV -centres is well (two orders of magnitude) below the nitrogen content in treated type-Ib diamonds, suggesting that there is still ample room for further nitrogen reduction, which tends to enhance the density of NV -centres (Fig. 2d) by lowering the chance of nitrogen aggregation. The <100>-grown diamonds containing reduced nitrogen content, e.g., to 1-10 ppm, may exhibit increased density and coherence times for ensemble NV -centres. Moreover, mechanical defects generated by focused ion beam or laser writing in conjunction with HPHT treatment are effective in reducing the annealing temperature required for creating NV -centres at targeted locations using <100>-grown type-Ib diamond as substrate, opening a promising avenue for innovative design and development of NV -centre based devices.",
                        "Notably, HPHT synthesized and post-growth annealed diamonds contain highly coherent single and ensemble NV -centres with superb benchmarks comparable to the best reported performance characteristics of CVD diamonds. The absence of undesirable hydrogen impurities and the low resonance splitting make NV -centres in HPHT diamonds more robust and reliable.",
                        "Overall, the HPHT treatment techniques demonstrated here introduce an efficient, precisely tailored and nondestructive way to produce top-quality NV -centres in diamond, which can serve as an adaptive platform for developing innovative quantum technologies and accelerating the crucial concept-to-realization transitions in these emerging fields.",
                        "to confirm the state and content of nitrogen in diamonds, with a ~100 μm 2 square aperture to irradiate the diamond samples in the range of 800-4000 cm -1 . Then, a Raman system (Horiba, LabRAM HR revolution) with 473-nm laser excitation (~25 mW output power) and 532-nm laser excitation (~300 mW output power) were employed for Raman/PL analysis in the range of 480-650 nm.",
                        "ODMR setup and NV concentration. All optically detected magnetic resonance (ODMR) measurements were carried out in a home-built confocal microscope. A continuous-wave solid-state 532-nm laser (CNI, MLL-III-532-150mW) was used as the light source. The laser beam was first modulated by an acousto-optic modulator (AOM), and then coupled into a single-mode fiber to optimize the beam quality and on/off ratio (~10 5 :1). The laser was then sent into a microscopy frame (Olympus, IX73) equipped with dichroic mirrors and high-NA objectives. The objective (MPlanApo 100X/0.95) focused laser beam on the diamond sample and simultaneously collects the fluorescence of NV centers at the same spot. The fluorescence signal was filtered by a 650-nm long-pass filter and then detected by a fiber-coupled single photon counting modules (SPCMs, SPCM-780-10-FC from EXCELITAS). The input facet of the fiber before SPCMs also serves as the pinhole of the confocal system. To acquire two-dimension images of the diamond sample at specific depths, a 3-axis piezo-scanning stage (Physik Instrumente, E-727.3CDA) was used to control and monitor the sample position.",
                        "The following procedures were used to estimate NV concentration at a specific position of the diamond sample.",
                        "First, we measured and compared the fluorescence count rate to the average value (16 kps) of single NV - centers under the same experimental conditions (excitation laser power: 500 W). The single NV -centers were verified by second-order correlation measurement (g (2) ( ) < 0.5) as they are single-photon sources.",
                        "Second, we estimated the efficient sample volume by measuring and fitting the profile of the focused laser beam. As shown in Supplementary Fig. S15, the full width at half-height (FWHH) is 0.4 m for both the X and Y directions, and 1.6 m for the Z direction (light propagation direction), so the efficient sample volume is about 0.26 m 3 . The NV -concentration varied significantly among different diamond samples, as summarized in Table 2.",
                        "Spin coherence measurement. We used standard free-induction decay (FID) and Hahn echo sequences to quantify the spin coherence of NV centers. An external magnetic field (~50 Gauss) was used to lift the degeneracies of the | = ±1⟩ states, as well as the degeneracies caused by the four possible orientations of ensemble NV -centers. For the selected NV -centers, pulsed-ODMR and Rabi oscillation were premeasured to obtain proper pulse parameters (microwave frequency and pulse duration, respectively). In each of the pulsed measurements, a laser pulse of 3-μs duration was first applied to polarize the NV spin to the | = 0⟩ state, then the pulse train composed of π/2 pulses, π pulses and free evolutions (continues microwave driving for Rabi oscillation) was applied to prepare and probe the NV spin coherence. Finally, a second π/2 pulse converted the accumulated phase (random phases lead to decoherence) into population information, which was then read out by another short laser pulse (0.3 μs). The measurement sequence was repeated for ~10 5 to obtain a good signal-to-noise ratio. The envelopes of the Hahn-echo and FID signal were fitted with an exponential decay function, exp[-(τ/T2) n ], to extract the spin coherence time T2 and T2 * ."
                    ],
                    "subsections": [
                        {
                            "title": "Acknowledgements",
                            "paragraphs": [
                                "The authors acknowledge the financial support from the National Natural Science Foundation of China (Grant Nos. 11974208, 11804184 and U1930401, 11974020, 12022509, 12074422), Shandong Provincial Natural Science Foundation (Grant Nos. ZR2020YQ05, 2019KJJ020 and ZR2019MA054), Beijing Natural Science Foundation (Grant No. Z200009), and Chinese Academy of Sciences (Grant Nos. XDB28000000, XDB33000000)."
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "title": "Methods",
                    "paragraphs": [
                        "Sample synthesis. The HPHT experiments for diamond synthesis were carried out using China-type cubic high-pressure apparatus (SPD-6×1200). The schematic diagram of the diamond growth cell is shown in Supplementary Fig. S1. The starting material was high-purity graphite powder (99.9 wt% purity) as the carbon source. Fe-Ni (Fe70Ni30) alloys were used as catalysts for diamond synthesis. To adjust the N-content in the growth medium for diamond crystallization, nitrides (NaN3/Ba(N3)2) were used as nitrogen sources and Al/Ti powders was used as the nitrogen getter in the starting materials. To obtain large-size diamonds, long run times up to 60 hours were employed to grow diamonds on seeds by temperature gradient growth (TGG) method. High-quality synthetic single diamond crystals (~0.4 mm in size) were used as seed crystals for TGG diamond growth. The HPHT productions were dissolved in mixed hot nitric acid of H2SO4/HNO3 (1:1 weight ratio) to remove the remaining graphite and metal catalysts.",
                        "HPHT annealing. After HPHT synthesis, the produced TGG diamonds were treated at high temperatures at 5.0 (±0.5) GPa and then quenched down to room temperature in 10 minutes. The schematic diagram of HPHT annealing treatment cell is shown in Fig. S1c. For HPHT annealing treatment, the produced diamonds were embedded in BN powder (Supplementary Fig. S1c). Synthesis temperatures were measured using a Pt-30% Rh/Pt-6% Rh thermocouple junction placed within 0.5 mm of the sample. Pressure was pre-calibrated by the phase transition of bismuth at room temperature, and further calibrated by graphite-diamond transition with different catalysts (Fe, Ni, Co) under HPHT conditions."
                    ],
                    "subsections": [
                        {
                            "title": "Sample characterization.",
                            "paragraphs": [
                                "After HPHT synthesis, some produced diamonds were first examined using the Fourier transform infrared (FTIR) spectrometer. The spectroscopy with spectral resolution of 1 cm -1 was used Author contributions X.L., G.L. and C.C. analyzed the data, organized the results and wrote the manuscript. X.Z., F.L. and X.L. synthesized the samples and performed sample preparation and Raman, PL, FTIR measurements. K.L., J.W. and G.L. performed ODMR measurements and analyzed the data. S.D., X.C. X.P., P.Z. and Y.M. provided discussions. All authors contributed to editing and improving the manuscript."
                            ],
                            "subsections": []
                        },
                        {
                            "title": "Author Information",
                            "paragraphs": [
                                "The authors declare no competing interests.",
                                "Correspondence and requests for materials should be addressed to X.L. (xiaobing.phy@qfnu.edu.cn), G.L.",
                                "(gqliu@iphy.ac.cn), Y.M. (mym@jlu.edu.cn) or C.C. (changfeng.chen@unlv.edu)"
                            ],
                            "subsections": [
                                {
                                    "title": "Supplementary Files",
                                    "paragraphs": [
                                        "This is a list of supplementary les associated with this preprint. Click to download."
                                    ],
                                    "subsections": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}