{
    "id": "US20150335619",
    "authors": [
        "Angela Wandinger-Ness",
        "Laurie Hudson",
        "Larry Sklar",
        "Zurab Surviladze",
        "Tudor Oprea"
    ],
    "title": "Modulators of GTPases  and Their Use",
    "date": "2015-07-30 00:00:00",
    "abstract": "The present invention relates to molecules which function as modulators (i.e., inhibitors and agonists) of the Ras-homologous (Rho) family of small GTPases (e.g. Rac, Cdc42 and Rho GTPases) and their use to treat diseases, including cancers (including solid tumors-medulloblastoma, ovarian, breast, head and neck, testicular, prostate among others and hematologic malignancies-B cell lymphoma, where these GTPases are overexpressed or hyperactivated), sporadic and genetic diseases where activation of Rho GTPases plays a pivotal role (Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type 1), Huntington's disease and Alzheimer's disease) which are mediated through these proteins. Compounds according to the present invention may also be used as a therapy for the treatment of Entamoeba spp. or Acanthamoeba spp. infections, especially including Entamoeba histolytica.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "The present application claims the benefit of priority from provisional application No. 61/397,864, filed Jun. 17, 2010, entitled “Ras-related GTPases as Targets of Non-Steroidal Anti-inflammatory Drugs, which is incorporated by reference in its entirety herein."
            ],
            "subsections": [
                {
                    "title": "RELATED APPLICATIONS, CLAIM FOR PRIORITY AND GRANT SUPPORT",
                    "paragraphs": [
                        "This invention was made with government support under grants U54MH074425, U54MH084690, R03MH081231 and P3OCA118100 awarded by the National Institutes of Health. The government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "acknowledge government support and grant rights"
                    ],
                    "num_characters": 212,
                    "outline_medium": [
                        "acknowledge government support and grant rights"
                    ],
                    "outline_short": [
                        "acknowledge government support and grant rights"
                    ]
                },
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to molecules which function as modulators (i.e., inhibitors and agonists) of the Ras-homologous (Rho) family of small GTPases (e.g. Rac, Cdc42 and Rho GTPases) and their use to treat diseases, including cancers (including solid tumors-medulloblastoma, ovarian, breast, head and neck, testicular, prostate among others and hematologic malignancies-B cell lymphoma, where these GTPases are overexpressed or hyperactivated), sporadic and genetic diseases where activation of Rho GTPases plays a pivotal role (Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease) which are mediated through these proteins. Compounds according to the present invention may also be used as a therapy for the treatment of Entamoeba sp. infections, especially including Entamoeba histolytica, as well as other amoeba species responsible for amoebic dysentery as well as other infections, e.g., acanthamoebiasis of the eye caused by acanthamoeba spp."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Ras-homologous GTPases",
                        "describe diseases related to Rho GTPases"
                    ],
                    "num_characters": 1021,
                    "outline_medium": [
                        "introduce Ras-homologous GTPases and their role in diseases"
                    ],
                    "outline_short": [
                        "introduce Ras-homologous GTPases and their role in diseases"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "The Ras-homologous (Rho) family of small GTPases (Rac, Cdc42 and Rho) are key regulators of actin reorganization, cell motility, cell-cell and cell-extracellular matrix (ECM) adhesion as well as of cell cycle progression, gene expression and apoptosis (FIG. 1) [1-8]. In many human cancers (including colon and breast), aberrant Rho-family signaling due to changes in the GTPase itself or in its regulation loops is a critical underpinning of tumor growth and survival, invasion and metastasis [9-13] (FIG. 1). RhoA and RhoC correlate with advanced ovarian cancer and peritoneal dissemination [14; 15]. Although Rac1 and Cdc42 have been recognized as attractive therapeutic targets, specific Rae GTPase inhibitors while effective in culture [16; 17] have not been translated to clinical use and there are no established Cdc42 specific inhibitors. Lovastatin was shown to inhibit Rho GTPase and reduce ovarian metastasis in a xenograft model [15]. However, the use of statins to block GTPase membrane association has met with only modest success due to their broad spectrum inhibition of protein prenylation resulting in pleiotropic effects on many GTPases and pathways [18]. Furthermore, recent animal studies wherein the effects of geranylgeranlytransferase type I deficiency were analyzed revealed an unexpected hyperactivation of Rho GTPases and concomitant severe joint inflammation {Khan, 2011}. Thus, more specific agents for clinical application are urgently needed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize Rho GTPase functions",
                        "discuss limitations of current Rho GTPase inhibitors"
                    ],
                    "num_characters": 1473,
                    "outline_medium": [
                        "discuss Rho-family signaling and its relation to cancer and other diseases"
                    ],
                    "outline_short": [
                        "discuss Rho-family signaling and its relation to cancer and other diseases"
                    ]
                },
                {
                    "title": "OBJECTS OF THE INVENTION",
                    "paragraphs": [
                        "It is an object of the invention to provide compounds for modulating Rho family GTPases in patients or subjects.",
                        "It is another object of the invention to treat disease states and/or conditions which are medicated through targeting of Rho family GTPases.",
                        "It is yet another object of the invention to provide pharmaceutical compositions which may be used to modulate, especially inhibit GTPases in patients or subjects.",
                        "It is still a further object of the invention to treat cancer, especially ovarian cancer and other cancers where GTPases are overexpressed or hyperactivated utilizing compounds, compostions and/or methods which are presented herein.",
                        "It is an additional object of the invention to provide methods for treating sporadic and genetic diseases where activation of Rho GTPases plays a pivotal role including in Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease.",
                        "It still another object of the invention to inhibit and/or an infection of Acanthamoeba spp. or Entamoeba histolytica or a disease state or condition where Acanthamoeba spp. Entamoeba histolytica is a causative agent including amoebic dysentery; extraintestinal amoebiasis, amoebic liver abscess; amoeba cutis acanthamoebiasis of the eye; and amoebic lung abscess.",
                        "Any one or more of these and/or other objects of the invention may be readily gleaned from a description of the invention which follows."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "provide compounds for modulating Rho family GTPases",
                        "treat diseases mediated by Rho GTPases"
                    ],
                    "num_characters": 1450,
                    "outline_medium": [
                        "state objects of the invention, including modulating Rho family GTPases and treating diseases"
                    ],
                    "outline_short": [
                        "state objects of the invention, including modulating Rho family GTPases and treating diseases"
                    ]
                },
                {
                    "title": "BRIEF DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates to compounds according to the chemical structure I",
                        "Wherein R1 and R2 are each independently H or a C1-C3 alkyl group;\n\n\n- R³ is a",
                        "group,\n\n\n- where Y is absent, O or S;\n- n is 0, 1, 2, 3, 4, 5 or 6;\n- R is H, a C₁-C₂₀ alkyl group or a phenyl group optionally substituted\n  with a hydroxyl, halo or C₁-C₃ alkyl group;\n- R^(1a) and R^(1b) are each independently H or a CH₃ group with the\n  proviso that at least one of R^(1a) and R^(1b) is a methyl group; and\n- said —(CH₂)_(n)— moiety is optionally substituted with a halo group\n  (F, Cl, Br or I), a C₁-C₃ alkyl group or a hydroxyl group (preferably,\n  the methylene group alpha to the carbon group containing the R^(1a)\n  and R^(1b) substituents is substituted with a methyl or ethyl group);\n- R⁴ is H or a C₁ to C₄ alkyl group;\n- R⁵ is H, halo (F, Cl, Br or I), a C₁-C₆ linear or branch-chained alkyl\n  group (preferably a C₁-C₄ alkyl group), a C₁-C₆ alkoxy group or a",
                        "group where R5 is an optionally substituted phenyl or a 5- or 6-membered heteroaryl group, or R5, together with R6, forms an optionally substituted phenyl group (preferably a C1-C4 alkoxy, e.g. methoxy or ethoxy substituted phenyl group) or an optionally substituted 5- or 6-membered heteroaryl ring (preferably, an oxazole ring, preferably substituted with a ortho- or para-halogen e.g. F, Cl, substituted phenyl group) thus forming a bicyclic ring system; and\n\n\n- R⁶ is H, halo, C₁-C₆ linear or branch-chained alkyl group (preferably,\n  a C₁-C₄ alkyl group), a C₁-C₆ alkoxy group or a",
                        "group where R5 is an optionally substituted phenyl or a 5- or 6-membered heteroaryl group, or R6, together with R5, forms an optionally substituted phenyl group or an optionally substituted 5- or 6-membered heteroaryl ring, thus forming an optionally substituted bicyclic ring system, or\n\na pharmaceutically acceptable salt, enantiomer, solvate or polymorph thereof.",
                        "In preferred aspects of the invention, R5 and R6 together form a phenyl group which is optionally substituted by at least one methoxy group (preferably, furthermost from the R3 substituent as in naproxen, methallenestril and flunoxaprofen—see FIG. 10 hereof) and R4 is H. In other aspects of the invention, R1a is methyl and R1b is hydrogen providing a chiral center and the possibility of racemic mixtures and individual enantiomers, each of which may be used in the present invention. In substituent R3, n is preferably 0 or 1 and Y is absent. In alternative preferred embodiments, when R5 and R6 together form a phenyl or heteroaryl group, in the R3 substitutent, Y is absent and n is 0 or 1 and when n is 1, the methylene group is substituted with a C1-C3 alkyl (preferably ethyl) and R1a and R1b are both methyl. When n is 0, only one of R1a and R1b is H, thus forming a chiral center. In alternative aspects of the invention where R5 and R6 do not form a ring to create a bicyclic group, Y in R3 is preferably 0 or absent, n is 0, 1, 2, 3, or 4 (preferably 0 or 3), R1a is methyl and R1b is H (thus forming a chiral center). In these monocyclic embodiments, R5 is H or a halogen group, preferably H, R6 is H or a C1-C6 alkyl group (preferably H or a C3 or C4 linear or branch-chained alkyl group, R4 is preferably H and R1 and R2 are H or CH3, preferably H.",
                        "The present invention also relates to specific compounds which may be used to modulate GTPases. These compounds include, for example, R-Naproxen, S-Naproxen, methallenestril, R-Flunoxaprofen, S-flunoxaprofen, R-Ibuprofen, S-Ibuprofen, S-Ketoprofen, R-Ketoprofen, gemfibrozil, ecabet, exetecan acid, R-Ketoralac, S-Ketoralac, tanomastat, mitiglinide, cicloxillic acid, fexofenadine,cilomilast, levocabastine, tiagabine, cinalukrast and mixtures thereof, including pharmaceutically acceptable salts, enantiomers, racemic mixtures, solvates and polymorphs thereof. A number of these compounds or their salts is presented in attached FIG. 10.",
                        "The compounds which are disclosed herein find use to treat cancers, including solid and epithelial tumors exemplified in this disclosure by ovarian cancer, among others, sporadic or genetic diseases related to hyperactivated membrane trafficking where Rho GTPases are important (e.g. Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease Huntington's) , as well as to inhibit entamoeba histolytica and/or to treat infections caused by entamoeba histolytica as well as other disease states or conditions of acanthamoeba spp., such as acanthamoebiasis of the eye.",
                        "Accordingly, the present invention relates to a method for modulating, including inhibiting a GTPase in a patient or subject in need of modulation wherein the GTPase is, in particular, a Rac (e.g. Rac1-3) GTPase or Cdc42, the method comprising administering to said patient or subject an effective amount of a compound as set forth hereinabove. The modulator is preferably an antagonist of GTPase. The present invention also relates to methods for modulating disease and/or conditions which are mediated through GTPases, including treating and/or inhibiting the progression of neurologic and inflammatory diseases dependent on Rho GTPases such as Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease; the growth of cancer, including inhibiting and/or reducing the likelihood of the metastasis of cancer comprising administering to a patient or subject in need thereof an effective amount of at least one compound as otherwise disclosed herein. In the case of cancer, compounds according to the present invention may be coadministered with at least one additional anticancer agent to inhibit the growth of and/or otherwise treat the cancer, including reducing the likelihood of metastasis of the treated cancer.",
                        "Further embodiments relate to infectious disease, embodied as a method for inhibiting Entamoeba histolytica or Acanthamoeba spp. and/or treating and/or reducing the likelihood of a disease state or condition in which Entamoeba histolytica or Acanthamoeba spp. is an infective agent, said method comprising administering to a patient in need of an effective amount of a GTPase inhibitor compound as described herein. Disease states and/or conditions in which Entamoeba histolytica is an infective agent include, for example, amoebic dysentery; extraintestinal amoebiasis, amoebic liver abscess; amoeba cutis; and amoebic lung abscess. Disease states or conditions in which Acanthamoeba spp. is an infective agent include acanthamoebiasis of the eye (amoeba cutis acanthamoebiasis of the eye), among others."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define chemical structure I",
                        "describe R1 and R2 substituents",
                        "describe R3 substituent",
                        "describe R4 substituent",
                        "describe R5 substituent",
                        "describe R6 substituent",
                        "describe preferred aspects of R5 and R6",
                        "describe alternative preferred embodiments",
                        "describe specific compounds",
                        "describe use of compounds to treat cancers",
                        "describe use of compounds to treat sporadic and genetic diseases",
                        "describe use of compounds to inhibit Entamoeba histolytica",
                        "describe methods for modulating GTPases"
                    ],
                    "num_characters": 6625,
                    "outline_medium": [
                        "define chemical structure of compounds",
                        "describe substituents and their options",
                        "provide preferred aspects of the invention",
                        "list specific compounds and their uses",
                        "describe methods for modulating GTPases and treating diseases",
                        "outline methods for treating infectious diseases"
                    ],
                    "outline_short": [
                        "define compounds according to chemical structure I",
                        "describe preferred aspects of the invention",
                        "outline uses of the compounds, including treating cancer and infectious diseases"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The following terms shall be used throughout the specification to describe the present invention. Where a term is not specifically defined herein, that term shall be understood to be used in a manner consistent with its use by those of ordinary skill in the art.",
                        "Where a range of values is provided, it is understood that each intervening value, to the tenth of the unit of the lower limit unless the context clearly dictates otherwise, between the upper and lower limit of that range and any other stated or intervening value in that stated range is encompassed within the invention. The upper and lower limits of these smaller ranges may independently be included in the smaller ranges is also encompassed within the invention, subject to any specifically excluded limit in the stated range. Where the stated range includes one or both of the limits, ranges excluding either both of those included limits are also included in the invention.",
                        "Unless defined otherwise, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this invention belongs. Although any methods and materials similar or equivalent to those described herein can also be used in the practice or testing of the present invention, the preferred methods and materials are now described.",
                        "It must be noted that as used herein and in the appended claims, the singular forms “a,” “and” and “the” include plural references unless the context clearly dictates otherwise.",
                        "Furthermore, the following terms shall have the definitions set out below.",
                        "The term “patient” or “subject” is used throughout the specification within context to describe an animal, generally a mammal, especially including a domesticated animal (i.e., not a laboratory test animal) and preferably a human, to whom treatment, including prophylactic treatment (prophylaxis), with the compositions according to the present invention is provided. For treatment of those infections, conditions or disease states which are specific for a specific animal such as a human patient, the term patient refers to that specific animal. In most instances, the patient or subject of the present invention is a human patient of either or both genders.",
                        "The term “effective” is used herein, unless otherwise indicated, to describe an amount of a compound or component which, when used within the context of its use, produces or effects an intended result, whether that result relates to the prophylaxis and/or therapy of an infection and/or disease state or as otherwise described herein. The term effective subsumes all other effective amount or effective concentration terms (including the term “therapeutically effective”) which are otherwise described or used in the present application.",
                        "The term “compound” is used herein to describe any specific compound or bioactive agent disclosed herein, including any and all stereoisomers, individual optical isomers or racemic mixtures, pharmaceutically acceptable salts and prodrug forms. Within its use in context, the term compound may refer to a single compound or a mixture of compounds as otherwise described herein.",
                        "The term “bioactive agent” refers to any biologically active compound or drug which may be formulated for use in the present invention. Exemplary bioactive agents include the compounds according to the present invention which are used to modulate GTPases and to treat cancer, other disease states and/or conditions as well as infections caused by Entamoeba sp. or Acanthamoeba spp. as well as other compounds or agent which are otherwise described herein.",
                        "The terms “treat”, “treating”, and “treatment”, are used synonyumously to refer to any action providing a benefit to a patient at risk for or afflicted with a disease, including improvement in the condition through lessening or suppression of at least one symptom, delay in progression of the disease, prevention or delay in the onset of the disease, etc.",
                        "Treatment, as used herein, encompasses both prophylactic and therapeutic treatment. Compounds according to the present invention can, for example, be administered prophylactically to a mammal in advance of the occurrence of disease to reduce the likelihood of that disease, Prophylactic administration is effective to reduce or decrease the likelihood of the subsequent occurrence of disease in the mammal, or decrease the severity of disease that subsequently occurs. Alternatively, compounds according to the present invention can, for example, be administered therapeutically to a mammal that is already afflicted by disease. In one embodiment of therapeutic administration, administration of the present compounds is effective to eliminate the disease and produce a remission or substantially eliminate an Entamoeba or Acanthamoeba infection as otherwise described herein; in another embodiment, administration of the compounds according to the present invention is effective to decrease the severity of the disease or lengthen the lifespan of the mammal so afflicted, in the case of cancer, as well as sporadic and genetic diseases that are Rho GTPase driven, including for example, Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes, Huntington's disease and Alzheimer's disease, among others.",
                        "The term “pharmaceutically acceptable” as used herein means that the compound or composition is suitable for administration to a subject to achieve the treatments described herein, without unduly deleterious side effects in light of the severity of the disease and necessity of the treatment,",
                        "The term “inhibit” as used herein refers to the partial or complete elimination of a potential effect, while inhibitors are compounds that have the ability to inhibit.",
                        "The term “prevention” when used in context shall mean “reducing the likelihood” or preventing a condition or disease state from occurring as a consequence of administration or concurrent administration of one or more compounds or compositions according to the present invention, alone or in combination with another agent. It is noted that prophylaxis will rarely be 100% effective; consequently the terms prevention and reducing the likelihood are used to denote the fact that within a given population of patients of subjects, administration with compounds according to the present invention will reduce the likelihood or inhibit a particular condition or disease state (in particular, the worsening of a disease state such as the metastasis of cancer or other accepted indicators of disease progression in the case of inflammatory and neurologic diseases) from occurring.",
                        "The term “cancer” shall refer to a proliferation of tumor cells having the unique trait of loss of normal controls, resulting in unregulated growth, lack of differentiation, local tissue invasion, and/or metastasis. As used herein, neoplasms include, without limitation, morphological irregularities in cells in tissue of a subject or host, as well as pathologic proliferation of cells in tissue of a subject, as compared with normal proliferation in the same type of tissue. Additionally, neoplasms include benign tumors and malignant tumors (e.g., colon tumors) that are either invasive or noninvasive. Malignant neoplasms are distinguished from benign neoplasms in that the former show a greater degree of anaplasia, or loss of differentiation and orientation of cells, and have the properties of invasion and metastasis. The term cancer also within context, includes drug resistant cancers, including multiple drug resistant cancers. Examples of neoplasms or neoplasias from which the target cell of the present invention may be derived include, without limitation, carcinomas (e.g., squamous-cell carcinomas, adenocarcinomas, hepatocellular carcinomas, and renal cell carcinomas), particularly those of the bladder, bone, bowel, breast, cervix, colon (colorectal), esophagus, head, kidney, liver, lung, nasopharyngeal, neck, ovary, pancreas, prostate, and stomach; leukemias, such as acute myelogenous leukemia, acute lymphocytic leukemia, acute promyelocytic leukemia (APL), acute T-cell lymphoblastic leukemia, adult T-cell leukemia, basophilic leukemia, eosinophilic leukemia, granulocytic leukemia, hairy cell leukemia, leukopenic leukemia, lymphatic leukemia, lymphoblastic leukemia, lymphocytic leukemia, megakaryocytic leukemia, micromyeloblastic leukemia, monocytic leukemia, neutrophilic leukemia and stem cell leukemia; benign and malignant lymphomas, particularly Burkitt's lymphoma, Non-Hodgkin's lymphoma and B-cell lymphoma; benign and malignant melanomas; myeloproliferative diseases; sarcomas, particularly Ewing's sarcoma, hemangiosarcoma, Kaposi's sarcoma, liposarcoma, myosarcomas, peripheral neuroepithelioma, and synovial sarcoma; tumors of the central nervous system (e.g., gliomas, astrocytomas, oligodendrogliomas, ependymomas, gliobastomas, neuroblastomas, ganglioneuromas, gangliogliomas, medulloblastomas, pineal cell tumors, meningiomas, meningeal sarcomas, neurofibromas, and Schwannomas); germ-line tumors (e.g., bowel cancer, breast cancer, prostate cancer, cervical cancer, uterine cancer, lung cancer (e.g., small cell lung cancer, mixed small cell and non-small cell cancer, pleural mesothelioma, including metastatic pleural mesothelioma small cell lung cancer and non-small cell lung cancer), ovarian cancer, testicular cancer, thyroid cancer, astrocytoma, esophageal cancer, pancreatic cancer, stomach cancer, liver cancer, colon cancer, and melanoma); mixed types of neoplasias, particularly carcinosarcoma and Hodgkin's disease; and tumors of mixed origin, such as Wilms' tumor and teratocarcinomas, among others. It is noted that certain epithelial tumors including ovarian, breast, colon, head and neck, medulloblastoma and B-cell lymphoma, among others have all been shown to exhibit increased Rac and Cdc42 expression or activation and are principal target cancers for compounds and therapies according to the present invention.",
                        "The term “additional anti-cancer agent” is used to describe an additional compound which may be coadministered with one or more compounds of the present invention in the treatment of cancer. Such agents include, for example, everolimus, trabectedin, abraxane, TLK 286, AV-299, DN-101, pazopanib, GSK690693, RTA 744, ON 0910.Na, AZD 6244 (ARRY-142886), AMN-107, TKI-258, GSK461364, AZD 1152, enzastaurin, vandetanib, ARQ-197, MK-0457, MLN8054, PHA-739358, R-763, AT-9263, a FLT-3 inhibitor, a VEGFR inhibitor, an EGFR TK inhibitor, an aurora kinase inhibitor, a PIK-1 modulator, a Bcl-2 inhibitor, an HDAC inhbitor, a c-MET inhibitor, a PARP inhibitor, a Cdk inhibitor, an EGFR TK inhibitor, an IGFR-TK inhibitor, an anti-HGF antibody, a PI3 kinase inhibitors, an AKT inhibitor, a JAK/STAT inhibitor, a checkpoint-1 or 2 inhibitor, a focal adhesion kinase inhibitor, a Map kinase kinase (mek) inhibitor, a VEGF trap antibody, pemetrexed, erlotinib, dasatanib, nilotinib, decatanib, panitumumab, amrubicin, oregovomab, Lep-etu, nolatrexed, azd2171, batabulin, ofatumumab, zanolimumab, edotecarin, tetrandrine, rubitecan, tesmilifene, oblimersen, ticilimumab, ipilimumab, gossypol, Bio 111 , 131-I-TM-601, ALT-110, BIO 140, CC 8490, cilengitide, gimatecan, IL13-PE38QQR, INO 1001, IPdR1 KRX-0402, lucanthone, LY 317615, neuradiab, vitespan, Rta 744, Sdx 102, talampanel, atrasentan, Xr 311, romidepsin, ADS-100380, sunitinib, 5-fluorouracil, vorinostat, etoposide, gemcitabine, doxorubicin, irinotecan, liposomal doxorubicin, 5′-deoxy-5-fluorouridine, vincristine, temozolomide, ZK-304709, seliciclib; PD0325901, AZD-6244, capecitabine, L-Glutamic acid, N-[4-[2-(2-(2-amino-4,7-dihydro-4-oxo-1 H pyrrolo[2,3-d]pyrimidin-5-yl)ethyl]benzoyl]-, disodium salt, heptahydrate, camptothecin, PEG-labeled irinotecan, tamoxifen, toremifene citrate, anastrazole, exemestane, letrozole, DES(diethylstilbestrol), estradiol, estrogen, conjugated estrogen, bevacizumab, IMC-1C11, CHIR-258,); 3-[5-(methylsulfonylpiperadinemethyl)-indolylj-quinolone, vatalanib, AG-013736, AVE-0005, the acetate salt of [D-Ser(Bu t) 6, Azgly 10] (pyro-Glu-His-Trp-Ser-Tyr-D-Ser(Bu t)-Leu-Arg-Pro-Azgly-NH2 acetate [C59H84N18Oi4-(C2H4O2)x where x=1 to 2.4], goserelin acetate, leuprolide acetate, triptorelin pamoate, medroxyprogesterone acetate, hydroxyprogesterone caproate, megestrol acetate, raloxifene, bicalutamide, flutamide, nilutamide, megestrol acetate, CP-724714; TAK-165, HKI-272, erlotinib, lapatanib, canertinib, ABX-EGF antibody, erbitux, EKB-569, PKI-166, GW-5720I6, Ionafarnib, BMS-214662, tipifarnib; amifostine, NVP-LAQ824, suberoyl analide hydroxamic acid, valproic acid, trichostatin A, FK-228, SU11248, sorafenib, KRN951, aminoglutethimide, arnsacrine, anagrelide, L-asparaginase, Bacillus Calmette-Guerin (BCG) vaccine, bleomycin, buserelin, busulfan, carboplatin, carmustine, chlorambucil, cisplatin, cladribine, clodronate, cyproterone, cytarabine, dacarbazine, dactinomycin, daunorubicin, diethylstilbestrol, epirubicin, fludarabine, fludrocortisone, fluoxymesterone, flutamide, gemcitabine, gleevac, hydroxyurea, idarubicin, ifosfamide, imatinib, leuprolide, levamisole, lomustine, mechlorethamine, melphalan, 6-mercaptopurine, mesna, methotrexate, mitomycin, mitotane, mitoxantrone, nilutamide, octreotide, oxaliplatin, pamidronate, pentostatin, plicamycin, porfimer, procarbazine, raltitrexed, rituximab, streptozocin, teniposide, testosterone, thalidomide, thioguanine, thiotepa, tretinoin, vindesine, 13-cis-retinoic acid, phenylalanine mustard, uracil mustard, estramustine, altretamine, floxuridine, 5-deooxyuridine, cytosine arabinoside, 6-mecaptopurine, deoxycoformycin, calcitriol, valrubicin, mithramycin, vinblastine, vinorelbine, topotecan, razoxin, marimastat, COL-3, neovastat, BMS-275291, squalamine, endostatin, SU5416, SU6668, EMD121974, interleukin-12, IM862, angiostatin, vitaxin, droloxifene, idoxyfene, spironolactone, finasteride, cimitidine, trastuzumab, denileukin diftitox, gefitinib, bortezimib, paclitaxel, irinotecan, topotecan, doxorubicin, docetaxel, vinorelbine, bevacizumab (monoclonal antibody) and erbitux, cremophor-free paclitaxel, epithilone B, BMS-247550, BMS-310705, droloxifene, 4-hydroxytamoxifen, pipendoxifene, ERA-923, arzoxifene, fulvestrant, acolbifene, lasofoxifene, idoxifene, TSE-424, HMR-3339, ZK186619, PTK787/ZK 222584, VX-745, PD 184352, rapamycin, 40-O-(2-hydroxyethyl)-rapamycin, temsirolimus, AP-23573, RAD001, ABT-578, BC-210, LY294002, LY292223, LY292696, LY293684, LY293646, wortmannin, ZM336372, L-779,450, PEG-filgrastim, darbepoetin, erythropoietin, granulocyte colony-stimulating factor, zolendronate, prednisone, cetuximab, granulocyte macrophage colony-stimulating factor, histrelin, pegylated interferon alfa-2a, interferon alfa-2a, pegylated interferon alfa-2b, interferon alfa-2b, azacitidine, PEG-L-asparaginase, lenalidomide, gemtuzumab, hydrocortisone, interleukin-11, dexrazoxane, alemtuzumab, all-transretinoic acid, ketoconazole, interleukin-2, megestrol, immune globulin, nitrogen mustard, methylprednisolone, ibritgumomab tiuxetan, androgens, decitabine, hexamethylmelamine, bexarotene, tositumomab, arsenic trioxide, cortisone, editronate, mitotane, cyclosporine, liposomal daunorubicin, Edwina-asparaginase, strontium 89, casopitant, netupitant, an NK-1 receptor antagonists, palonosetron, aprepitant, diphenhydramine, hydroxyzine, metoclopramide, lorazepam, alprazolam, haloperidol, droperidol, dronabinol, dexamethasone, methylprednisolone, prochlorperazine, granisetron, ondansetron, dolasetron, tropisetron, pegfilgrastim, erythropoietin, epoetin alfa and darbepoetin alfa, among others.",
                        "The term “alkyl” is used herein to refer to a fully saturated monovalent radical containing carbon and hydrogen (up to 20 carbon atoms as otherwise indicated), and which may be a straight chain, branched or cyclic. Examples of alkyl groups are methyl, ethyl, n-butyl, n-heptyl, isopropyl, 2-methyl propyl, tert-butyl, neopentyl, etc.",
                        "The term “substituted” as that term relates to alkyl groups which are described above include one or more functional groups such as lower alkyl groups containing 1-6 carbon atoms, aryl (phenyl or naphthyl), substituted aryl (as described below), acyl (C1-C6), halogen (F, Cl, Br, I, e.g., alkyl halos, e.g., CF3), amido, thioamido, cyano, nitro, alkynyl (C2-C6), azido, hydroxy, alkoxy (C1-C6), amino, C1-C6 alkyl and dialkyl-amino, C2-C6 acylamino, C6 oxyester or carboxyester, aryloxy, aryloxy(C1-C6)alkyl, carboxamido, thio, C2-C6 ether or thioether and the like.",
                        "The term “aryl”, when used in context, refers to a substituted or unsubstituted monovalent aromatic radical having a single ring (e.g., phenyl) or multiple condensed rings (e.g., naphthyl). Other examples include heterocyclic aromatic (heteroaromatic or heteroaryl) ring groups having one or more nitrogen, oxygen, or sulfur atoms in the ring, such as the 5 or 6-membered heteroaryls oxazolyl, isoxazolyl, pyrazolyl, thiazolyl, thiadiazolyl, triazolyl, tetrazolyl, imidazolyl, furyl, pyrrolyl, pyridyl, thienyl, pyridazinyl, pyrimidyl, or the condensed phenyl/heteroaryl ring as otherwise described herein including, for example, benzofuryl, benzothienyl, benzimidazolyl, benzotriazolyl, benzoxazolyl, benzothiazolyl, quinolyl, isoquinolyl and indolyl.",
                        "The term “substituted” as used in the term “substituted aryl, substituted aromatic, substituted heteroaryl, or substituted heteroaromatic” herein signifies that one or more substituents (1, 2, 3 or 4, preferably 1 or 2) may be present, said substituents being selected from atoms and groups, which when present do not prevent the compound from functioning as a modulator of GRPase. Examples of substituents that may be present in a substituted aromatic or heteroaromatic group include, but are not limited to, groups such as (C1-C6) alkyl, (C1-C10), preferably, (C2-C6) acyl, aryl, heteroaryl, substituted aryl and heteroaryl, halogen, cyano, nitro, amido (optionally substituted with one or two C1-C6 alkyl groups), thioamido (optionally substituted with one or two C1-C6 alkyl groups), azido, alkynyl (C2-C6), (C1-C6) alkylhalos (e.g., CF3), hydroxy, (C1-C6) alkoxy, (C2-C8) alkoxyalkyl, amino, (C1-C6) alkyl and dialkyl amino, (C1-C6 acylamino, (C1-C6) acyloxy, acyloxy, (C1-C6) aryloxyalkyl, (C1-C6) carboxyalkyl, carboxamido, thio, (C1-C6) thioethers, both saturated and unsaturated (C3-C8) cyclic hydrocarbons, (C3-C8) heterocycles and the like. It is noted that each of the substituents disclosed herein may themselves be substituted.",
                        "The term “heteroaryl” refers to an unsaturated carbocylic ring wherein one or more carbon atoms have been replaced with one or more heteroatoms such as nitrogen, oxygen or sulfur. Examples of heteroaryls is described above. “5-membered heteroaryl” refers to heteroaryls containing 5 atoms within the heteroaryl ring. “6-ring heteroaryls” refers to heteroaryls containing 6 atoms within the heteroaryl ring. Heteroaryls may be unsubstituted or substituted as otherwise described herein. The term “heterocyclic” refers to a ring system containing from 3 to 8 atoms from 1 to 4 of which are nitrogen, oxygen, or sulfur. 5- or 6-membered heterocycles, when used, are preferred. Heterocycles may be saturated or unsaturated, depending upon the context of use. When unsaturated heterocycles are also referred to as heteroaryls, when fully saturated, they are referred to as heterocycles.",
                        "The term “GTPase” is used to describe the Rho family of GTPases, which is a family of small signaling GTPases, of which Rac1, Cdc42 and RhoA are the most well studied members. These GTPases have been shown to regulate many aspects of intracellular dynamics, and play a role in cell proliferation, apoptosis, gene expression, and multiple other common cellular functions. They consequently have utility in the treatment of sporadic and genetic diseases, as well as cancers as described herein. Rac1 is a GTPase regulator of a number of cellular processes, including the cell cycle, cell-cell adhesion, motility (through the actin network), and of epithelial differentiation (for maintaining epidermal stem cells). Cdc42 is a GTPase protein involved in regulation of the cell cycle, cell differentiation and cell migration. RhoA is a GTPase protein which is involved in the regulation and timing of cell division. Together, these GTPase proteins are intimate to processes which are related to cancer and its elaboration and are targets for cancer treatment through modulation, in more particular aspects, inhibition of these GTPase targets. GTPase mediates a number of disease states, including cancer, as otherwise disclosed herein, as well as a number of sporadic and genetic diseases including, for example, Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease, among others.",
                        "The term “Entamoeba” is used to describe a genus of protozoal anaerobic parasites found as internal parasites or commensals of animals. Entamoeba histolytica is an anaerobic parasitic protozoan, part of the genus Entamoeba found in humans and responsible for diseases and/or conditions such as Amoebiasis; Amoebic dysentery; Extraintestinal Amoebiasis, Amoebic Liver Abscess; Amoeba Cutis; and Amoebic Lung Abscess (“liver-colored sputum”). E. histolytica predominantly infects humans and other primates, as does E. dispar, although E. dispar is non-pathogenic. Mammals such as dogs and cats can become infected transiently, but are not thought to contribute significantly to transmission. “Additional anti-entamoeba agents” are agents which may be combined with those of the present invention and used to inhibit and or/treat E. histolytica infections, disease states and/or conditions. These compounds include, for example, metronidazole, bismuth subsalicylate, kaolin pectin, diphenoxyolate, loperamide, quinolones, erythromycin, trimethoprim-sulamethoxazole, ceftriaxine, ampicillin, tetracycline, doxycycline, vancomycin iodoquinol and mixtures thereof. “Acanthamoeba spp. is used to describe another genus of protozoal anaerobic parasites found as parasites or commensals of animals, including humans and is responsible for acanthamoebiasis of the eye (amoeba cutis acanthamoebiasis of the eye), which is also treated by compounds according to the present invention.",
                        "The term “co-administration” or “adjunct therapy” shall mean that at least two compounds or compositions are administered to the patient at the same time, such that effective amounts or concentrations of each of the two or more compounds may be found in the patient at a given point in time. Although compounds according to the present invention may be co-administered to a patient at the same time, the term embraces both administration of two or more agents at the same time or at different times, including sequential administration. Preferably, effective concentrations of all co-administered compounds or compositions are found in the subject at a given time. The term co-administration or adjunct therapy also contemplates other bioactive agents being coadministered with pharmaceutical compositions according to the present invention, especially where a cancer has metastasized or is at risk for metastasis.",
                        "Compounds according to the present invention may be readily formulated into pharmaceutical compositions, useful in the treatment of sporadic or genetic diseases or conditions, cancers or infections or conditions caused by Entamoeba histolytica or Acanthamoieba spp._as described hereinabove. Pharmaceutical compositions comprise an effective amount of one or more compounds according to the present invention in combination with a pharmaceutically acceptable carrier, additive or excipient, optionally in combination with at least one additional anticancer agent.",
                        "The present invention includes the compositions comprising the pharmaceutically acceptable salt. i.e., the acid or base addition salts of compounds of the present invention and their derivatives. The acids which may be used to prepare the pharmaceutically acceptable acid addition salts of the aforementioned base compounds useful in this invention are those which form non-toxic acid addition salts, i.e., salts containing pharmacologically acceptable anions, such as the hydrochloride, hydrobromide, hydroiodide, nitrate, sulfate, bisulfate, phosphate, acid phosphate, acetate, lactate, citrate, acid citrate, tartrate, bitartrate, succinate, maleate, fumarate, gluconate, saccharate, benzoate, methanesulfonate, ethanesulfonate, benzenesulfonate, p-toluenesulfonate and pamoate [i.e., 1,1′-methylene-bis-(2-hydroxy-3 naphthoate)]salts, among others.",
                        "Pharmaceutically acceptable base addition salts may also be used to produce pharmaceutically acceptable salt forms of the compounds according to the present invention. The chemical bases that may be used as reagents to prepare pharmaceutically acceptable base salts of the present compounds that are acidic in nature are those that form non-toxic base salts with such compounds. Such non-toxic base salts include, but are not limited to those derived from such pharmacologically acceptable cations such as alkali metal cations (eg., potassium and sodium) and alkaline earth metal cations (e, calcium and magnesium), ammonium or water-soluble amine addition salts such as N-methylglucamine-(meglumine), and the lower alkanolammonium and other base salts of pharmaceutically acceptable organic amines, among others.",
                        "As noted above, the compounds and method of the invention modulate GTPase as otherwise described herein, and are useful for the inhibition (including prophylaxis) and/or treatment of cancer, sporadic or genetic diseases or conditions and infections caused by Entamoeba sp., including E. histolytica, and other amoeba species responsible for amoebic dysentery as well as other infections, e.g., acanthamoebiasis of the eye which is caused by Acanthamoeba.",
                        "In methods according to the present invention, subjects or patients in need are trreated with the present compounds, pharmaceutical compositions in order to inhibit, reduce the likelihood or treat a disease state, condition and/or infection as otherwise described herein. The disease states, conditions and infections treated by the present compounds and compositions are readily recognized and diagnosed by those of ordinary skill in the art and treated by administering to the patient an effective amount of one or more compounds according to the present invention.",
                        "Generally, dosages and routes of administration of the compound are determined according to the size and condition of the subject, according to standard pharmaceutical practices. Dose levels employed can vary widely, and can readily be determined by those of skill in the art. Typically, amounts in the milligram up to gram quantities are employed. The composition may be administered to a subject by various routes, e.g. orally, transdermally, perineurally or parenterally, that is, by intravenous, subcutaneous, intraperitoneal, or intramuscular injection, among others, including buccal, rectal and transdermal administration. Subjects contemplated for treatment according to the method of the invention include humans, companion animals, laboratory animals, and the like.",
                        "Formulations containing the compounds according to the present invention may take the form of solid, semi-solid, lyophilized powder, or liquid dosage forms, such as, for example, tablets, capsules, powders, sustained-release formulations, solutions, suspensions, emulsions, suppositories, creams, ointments, lotions, aerosols, patches or the like, preferably in unit dosage forms suitable for simple administration of precise dosages.",
                        "Pharmaceutical compositions according to the present invention typically include a conventional pharmaceutical carrier or excipient and may additionally include other medicinal agents, carriers, adjuvants, additives and the like. Preferably, the composition is about 0.1% to about 85%, about 0.5% to about 75% by weight of a compound or compounds of the invention, with the remainder consisting essentially of suitable pharmaceutical excipients. For oral administration, such excipients include pharmaceutical grades of mannitol, lactose, starch, magnesium stearate, sodium saccharine, talcum, cellulose, glucose, gelatin, sucrose, magnesium carbonate, and the like. If desired, the composition may also contain minor amounts of non-toxic auxiliary substances such as wetting agents, emulsifying agents, or buffers.",
                        "Liquid compositions can be prepared by dissolving or dispersing the compounds (about 0.5% to about 20% by weight or more), and optional pharmaceutical adjuvants, in a carrier, such as, for example, aqueous saline, aqueous dextrose, glycerol, or ethanol, to form a solution or suspension. For use in oral liquid preparation, the composition may be prepared as a solution, suspension, emulsion, or syrup, being supplied either in liquid form or a dried form suitable for hydration in water or normal saline.",
                        "When the composition is employed in the form of solid preparations for oral administration, the preparations may be tablets, granules, powders, capsules or the like. In a tablet formulation, the composition is typically formulated with additives, e.g. an excipient such as a saccharide or cellulose preparation, a binder such as starch paste or methyl cellulose, a filler, a disintegrator, and other additives typically used in the manufacture of medical preparations.",
                        "An injectable composition for parenteral administration will typically contain the compound in a suitable i.v. solution, such as sterile physiological salt solution. The composition may also be formulated as a suspension in a lipid or phospholipid, in a liposomal suspension, or in an aqueous emulsion.",
                        "Methods for preparing such dosage forms are known or are apparent to those skilled in the art; for example, see Remington's Pharmaceutical Sciences (17th Ed., Mack Pub. Co., 1985). The composition to be administered will contain a quantity of the selected compound in a pharmaceutically effective amount for modulating GTPase in a subject according to the present invention in a subject."
                    ],
                    "subsections": [
                        {
                            "title": "Synthesis of Compounds According to the Present Invention",
                            "paragraphs": [
                                "The compounds according to the present invention are readily known in the art and their synthesis is well-known and readily provided. Most of the compounds are known in the art and can be found in published literature, purchased from commercial sources or readily prepared from starting materials which are readily obtained from commercial sources. Substituted phenyl or naphthyl compounds, principally used in the present invention are well known in the art. The various substituents may be readily introduced into the pharmacophore, whether that pharmacophore is a phenyl group to which substituents as otherwise presented herein are introduced, a naphthyl group as otherwise described herein or a fused bicyclic benzoheteroaryl group as described herein. Synthesis of all of the presently described compounds are well within the routineer's skill in the art."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe synthesis of compounds"
                            ],
                            "num_characters": 861,
                            "outline_medium": [
                                "describe synthesis of compounds"
                            ],
                            "outline_short": [
                                "describe synthesis of compounds"
                            ]
                        },
                        {
                            "title": "Method of Treatment",
                            "paragraphs": [
                                "According to one aspect of the invention, a method is provided for treating a mammalian patient or subject to modulate GTPase, in particular the Rho family of GTPases including Rac (e.g. Rac1), Cdc42 and Rho (e.g. Rhol). Agonist and/or antagonist activity of compounds according to the present invention described herein may be used to modulate GTPase in a manner consistent with inhibiting and/or treating disease states and/or conditions including cancer, sporadic or genetic diseases including Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease, as otherwise described herein and infections caused by Entamoeba histolytica or Acanthamoeba spp. Antagonist activity associated with GTPase inhibition is a particularly useful aspect of the present invention.",
                                "According to the present invention, in patients or subjects in need thereof, are treated by administering to the patient or subject an effective amount of one or more compounds according to the present invention, optionally in combination with at least one additional bioactive agent useful for treating the same disease state or condition. Compounds according to the present invention may be used to inhibit, reduce the likelihood or treat cancer, including the metastasis of cancer in a patient or subject in need of such treatment. The treatment is useful for any cancer which is mediated by GTPase or for which metastasis is a risk element. Therapy with at least one additional anticancer agent as otherwise described herein is also contemplated in the present methods. The numerous cancers which may be treated pursuant to the present method is described hereinabove.",
                                "In another aspect the present invention is directed to a method for treating a sporadic or genetic disease in which activation of Rho GTPase plays a significant role. These disease states and/or conditions include, for example Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease. In this method, a patient or subject in need of treatment is administered an effective amount of a compound as otherwise described herein optionally in combination with a pharmaceutically acceptable carrier, additive or excipient.",
                                "In another aspect, the invention provides a method for reducing, inhibiting and/or treating infections, disease states or conditions which are caused by Entamoeba histolytica. These disease states and/or conditions include amoebiasis, amoebic dysentery, extraintestinal amoebiasis, amoebic liver abscess, amoeba cutis, and amoebic lung abscess. In this aspect, the method of the present invention comprises administering to a subject or patient in need an amount of a compound of the invention, the amount being sufficient to reduce, inhibit or cure infection and/or a disease state and/or condition caused by Entamoeba histolytica or Acanthamoeba spp. The compounds according to the present invention may be used alone or combined with another agent useful in treating infections caused by Entamoeba histolytica or Acanthamoeba, including metronidazole, bismuth subsalicylate, kaolin pectin, diphenoxyolate, loperamide, quinolones, erythromycin, trimethoprim-sulamethoxazole, ceftriaxine, ampicillin, tetracycline, doxycycline, vancomycin iodoquinol and mixtures thereof.",
                                "In the present invention, the method of treatment comprises administering to the subject in need of treatment, in a pharmaceutically acceptable carrier, an effective amount of a compound according to I below:",
                                "Wherein R1 and R2 are each independently H or a C1-C3 alkyl group;\n\n\n- R³ is a",
                                "group,\n\n\n- where Y is absent, O or S;\n- n is 0, 1, 2, 3, 4, 5 or 6;\n- R is H, a C₁-C₂₀ alkyl group or a phenyl group optionally substituted\n  with a hydroxyl, halo or C₁-C₃ alkyl group;\n- R^(1a) and R^(1b) are each independently H or a CH₃ group with the\n  proviso that at least one of R^(1a) and R^(1b) is a methyl group; and\n- said —(CH₂)_(n)— moiety is optionally substituted with a halo group\n  (F, Cl, Br or I), a C₁-C₃ alkyl group or a hydroxyl group (preferably,\n  the methylene group alpha to the carbon group containing the R^(1a)\n  and R^(1b) substituents is substituted with a methyl or ethyl group);\n- R⁴ is H or a C₁ to C₄ alkyl group;\n- R⁵ is H, halo (F, Cl, Br or I), a C₁-C₆ linear or branch-chained alkyl\n  group (preferably a C₁-C₄ alkyl group), a C₁-C₆ alkoxy group or a",
                                "group where R5 is an optionally substituted phenyl or a 5- or 6-membered heteroaryl group, or R5, together with R6, forms an optionally substituted phenyl group (preferably a C1-C4 alkoxy, e.g. methoxy or ethoxy substituted phenyl group) or an optionally substituted 5- or 6-membered heteroaryl ring (preferably, an oxazole ring, preferably substituted with a ortho- or para-halogen e.g. F, Cl, substituted phenyl group) thus forming a bicyclic ring system; and\n\n\n- R⁶ is H, halo, C₁-C₆ linear or branch-chained alkyl group (preferably,\n  a C₁-C₄ alkyl group), a C₁-C₆ alkoxy group or a",
                                "group where R5 is an optionally substituted phenyl or a 5- or 6-membered heteroaryl group, or R6, together with R5, forms an optionally substituted phenyl group or an optionally substituted 5- or 6-membered heteroaryl ring, thus forming an optionally substituted bicyclic ring system, or\n\na pharmaceutically acceptable salt, enantiomer, solvate or polymorph thereof.",
                                "In preferred aspects of the invention, R5 and R6 together form a phenyl group which is optionally substituted by at least one methoxy group (preferably, furthermost from the R3 substituent as in naproxen, methallenestril and flunoxaprofen—see FIG. 10 hereof) and R4 is H. In other aspects of the invention, R1a is methyl and R1b is hydrogen providing a chiral center and the possibility of racemic mixtures and individual enantiomers, each of which may be used in the present invention. In substituent R3, n is preferably 0 or 1 and Y is absent. In alternative preferred embodiments, when R5 and R6 together form a phenyl or heteroaryl group, in the R3 substitutent, Y is absent and n is 0 or 1 and when n is 1, the methylene group is substituted with a C1-C3 alkyl (preferably ethyl) and R1a and R1b are both methyl. When n is 0, only one of R1a and R1b is H, thus forming a chiral center. In alternative aspects of the invention where R5 and R6 do not form a ring to create a bicyclic group, Y in R3 is preferably 0 or absent, n is 0, 1, 2, 3, or 4 (preferably 0 or 3), R1a is methyl and R1b is H (thus forming a chiral center). In these monocyclic embodiments, R5 is H or a halogen group, preferably H, R6 is H or a C1-C6 alkyl group (preferably H or a C3 or C4 linear or branch-chained alkyl group, R4 is preferably H and R1 and R2 are H or CH3, preferably H.",
                                "The alternative embodiments, the present invention relates to methods of treatment wherein the compound is selected from the group consisting of R-Naproxen, S-Naproxen, methallenestril, R-Flunoxaprofen, S-flunoxaprofen, R-Ibuprofen, S-Ibuprofen, S-Ketoprofen, R-Ketoprofen, gemfibrozil, ecabet, exetecan acid, R-Ketoralac, S-Ketoralac, tanomastat, mitiglinide, cicloxillic acid, fexofenadine,cilomilast, levocabastine, tiagabine, cinalukrast and mixtures thereof, including pharmaceutically acceptable salts, enantiomers, racemic mixtures, solvates and polymorphs thereof. A number of these compounds or their salts are presented in attached FIG. 10.",
                                "In the methods treating or inhibiting cancer or the metastasis of cancer, the compounds described above may be coadministered with at least one additional anticancer agent including, for example, everolimus, trabectedin, abraxane, TLK 286, AV-299, DN-101, pazopanib, GSK690693, RTA 744, ON 0910.Na, AZD 6244 (ARRY-142886), AMN-107, TKI-258, GSK461364, AZD 1152, enzastaurin, vandetanib, ARQ-197, MK-0457, MLN8054, PHA-739358, R-763, AT-9263, a FLT-3 inhibitor, a VEGFR inhibitor, an EGFR TK inhibitor, an aurora kinase inhibitor, a PIK-1 modulator, a Bc1-2 inhibitor, an HDAC inhbitor, a c-MET inhibitor, a PARP inhibitor, a Cdk inhibitor, an EGFR TK inhibitor, an IGFR-TK inhibitor, an anti-HGF antibody, a PI3 kinase inhibitors, an AKT inhibitor, a JAK/STAT inhibitor, a checkpoint-1 or 2 inhibitor, a focal adhesion kinase inhibitor, a Map kinase kinase (mek) inhibitor, a VEGF trap antibody, pemetrexed, erlotinib, dasatanib, nilotinib, decatanib, panitumumab, amrubicin, oregovomab, Lep-etu, nolatrexed, azd2171, batabulin, ofatumumab, zanolimumab, edotecarin, tetrandrine, rubitecan, tesmilifene, oblimersen, ticilimumab, ipilimumab, gossypol, Bio 111 , 131-1-TM-601, ALT-110, BIO 140, CC 8490, cilengitide, gimatecan, IL13-PE38QQR, INO 1001, IPdR1 KRX-0402, lucanthone, LY 317615, neuradiab, vitespan, Rta 744, Sdx 102, talampanel, atrasentan, Xr 311, romidepsin, ADS-100380, sunitinib, 5-fluorouracil, vorinostat, etoposide, gemcitabine, doxorubicin, irinotecan, liposomal doxorubicin, 5′-deoxy-5-fluorouridine, vincristine, temozolomide, ZK-304709, seliciclib; PD0325901, AZD-6244, capecitabine, L-Glutamic acid, N-[4-[2-(2-amino-4,7-dihydro-4-oxo-1H -pyrrolo[2,3-d]pyrimidin-5-yl)ethyl]benzoyl]-, disodium salt, heptahydrate, camptothecin, PEG-labeled irinotecan, tamoxifen, toremifene citrate, anastrazole, exemestane, letrozole, DES(diethylstilbestrol), estradiol, estrogen, conjugated estrogen, bevacizumab, IMC-1C11, CHIR-258,); 3-[5-(methylsulfonylpiperadinemethyl)-indolylj-quinolone, vatalanib, AG-013736, AVE-0005, the acetate salt of [D-Ser(Bu t) 6, Azgly 10 ](pyro-Glu-His-Trp-Ser-Tyr-D-Ser(Bu t)-Leu-Arg-Pro-Azgly-NH2 acetate [C59H84N18Oi4-(C2H4O2)x where x=1 to 2.4], goserelin acetate, leuprolide acetate, triptorelin pamoate, medroxyprogesterone acetate, hydroxyprogesterone caproate, megestrol acetate, raloxifene, bicalutamide, flutamide, nilutamide, megestrol acetate, CP-724714; TAK-165, HK1-272, erlotinib, lapatanib, canertinib, ABX-EGF antibody, erbitux, EKB-569, PKI-166, GW-572016, lonafarnib, BMS-214662, tipifarnib; amifostine, NVP-LAQ824, suberoyl analide hydroxamic acid, valproic acid, trichostatin A, FK-228, SU11248, sorafenib, KRN951, aminoglutethimide, arnsacrine, anagrelide, L-asparaginase, Bacillus Calmette-Guerin (BCG) vaccine, bleomycin, buserelin, busulfan, carboplatin, carmustine, chlorambucil, cisplatin, cladribine, clodronate, cyproterone, cytarabine, dacarbazine, dactinomycin, daunorubicin, diethylstilbestrol, epirubicin, fludarabine, fludrocortisone, fluoxymesterone, flutamide, gemcitabine, gleevac, hydroxyurea, idarubicin, ifosfamide, imatinib, leuprolide, levamisole, lomustine, mechlorethamine, melphalan, 6-mercaptopurine, mesna, methotrexate, mitomycin, mitotane, mitoxantrone, nilutamide, octreotide, oxaliplatin, pamidronate, pentostatin, plicamycin, porfimer, procarbazine, raltitrexed, rituximab, streptozocin, teniposide, testosterone, thalidomide, thioguanine, thiotepa, tretinoin, vindesine, 13-cis-retinoic acid, phenylalanine mustard, uracil mustard, estramustine, altretamine, floxuridine, 5-deooxyuridine, cytosine arabinoside, 6-mecaptopurine, deoxycoformycin, calcitriol, valrubicin, mithramycin, vinblastine, vinorelbine, topotecan, razoxin, marimastat, COL-3, neovastat, BMS-275291, squalamine, endostatin, SU5416, SU6668, EMD121974, interleukin-12, IM862, angiostatin, vitaxin, droloxifene, idoxyfene, spironolactone, finasteride, cimitidine, trastuzumab, denileukin diftitox,gefitinib, bortezimib, paclitaxel, irinotecan, topotecan, doxorubicin, docetaxel, vinorelbine, bevacizumab (monoclonal antibody) and erbitux, cremophor-free paclitaxel, epithilone B, BMS-247550, BMS-310705, droloxifene, 4-hydroxytamoxifen, pipendoxifene, ERA-923, arzoxifene, fulvestrant, acolbifene, lasofoxifene, idoxifene, TSE-424, HMR-3339, ZK186619, PTK787/ZK 222584, VX-745, PD 184352, rapamycin, 40-O-(2-hydroxyethyl)-rapamycin, temsirolimus, AP-23573, RAD001, ABT-578, BC-210, LY294002, LY292223, LY292696, LY293684, LY293646, wortmannin, ZM336372, L-779,450, PEG-filgrastim, darbepoetin, erythropoietin, granulocyte colony-stimulating factor, zolendronate, prednisone, cetuximab, granulocyte macrophage colony-stimulating factor, histrelin, pegylated interferon alfa-2a, interferon alfa-2a, pegylated interferon alfa-2b, interferon alfa-2b, azacitidine, PEG-L-asparaginase, lenalidomide, gemtuzumab, hydrocortisone, interleukin-11, dexrazoxane, alemtuzumab, all-transretinoic acid, ketoconazole, interleukin-2, megestrol, immune globulin, nitrogen mustard, methylprednisolone, ibritgumomab tiuxetan, androgens, decitabine, hexamethylmelamine, bexarotene, tositumomab, arsenic trioxide, cortisone, editronate, mitotane, cyclosporine, liposomal daunorubicin, Edwina-asparaginase, strontium 89, casopitant, netupitant, an NK-1 receptor antagonists, palonosetron, aprepitant, diphenhydramine, hydroxyzine, metoclopramide, lorazepam, alprazolam, haloperidol, droperidol, dronabinol, dexamethasone, methylprednisolone, prochlorperazine, granisetron, ondansetron, dolasetron, tropisetron, pegfilgrastim, erythropoietin, epoetin alfa and darbepoetin alfa, among others, and mixtures thereof.",
                                "In methods involving infections, disease states and/or conditions caused by Entamoeba histolyltica or Acanthamoeba, including amoebiasis, amoebic dysentery, extraintestinal amoebiasis, amoebic liver abscess, amoeba cutis, amoebic lung abscess and acanthmoebiasis of the eye (Acanthamoebia), at least one compound according to the present invention, alone or in combination with at least one further agent selected from the group consisting of metronidazole, bismuth subsalicylate, kaolin pectin, diphenoxyolate, loperamide, quinolones, erythromycin, trimethoprim-sulamethoxazole, ceftriaxine, ampicillin, tetracycline, doxycycline, vancomycin iodoquinol and mixtures thereof is administered in an effective amount to a patient of subject in need thereof.",
                                "The following examples illustrate but are not intended in any way to limit the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce method of treatment for modulating GTPase",
                                "describe agonist and/or antagonist activity of compounds",
                                "list disease states and/or conditions treated by method",
                                "describe treatment of cancer",
                                "describe treatment of sporadic or genetic diseases",
                                "describe treatment of infections caused by Entamoeba histolytica or Acanthamoeba spp",
                                "introduce compound structure",
                                "describe R1 and R2 substituents",
                                "describe R3 substituent",
                                "describe R4 substituent",
                                "describe R5 substituent",
                                "describe R6 substituent",
                                "describe preferred aspects of R5 and R6",
                                "describe alternative embodiments of R5 and R6",
                                "list alternative compounds for treatment",
                                "describe coadministration with additional anticancer agents",
                                "list additional anticancer agents",
                                "describe treatment of cancer or metastasis of cancer",
                                "describe treatment of infections caused by Entamoeba histolytica or Acanthamoeba spp",
                                "describe administration of compounds",
                                "describe pharmaceutically acceptable salts, enantiomers, solvates, and polymorphs",
                                "describe alternative embodiments of compounds",
                                "describe methods of treatment involving infections",
                                "describe administration of compounds for infections",
                                "describe combination therapy for infections",
                                "describe additional agents for combination therapy",
                                "describe effective amount of compounds for treatment"
                            ],
                            "num_characters": 13905,
                            "outline_medium": [
                                "introduce method of treatment for modulating GTPase",
                                "describe agonist and/or antagonist activity of compounds",
                                "outline treatment for cancer",
                                "outline treatment for sporadic or genetic diseases",
                                "outline treatment for infections caused by Entamoeba histolytica or Acanthamoeba spp",
                                "describe administration of effective amount of compound",
                                "describe optional combination with additional bioactive agent",
                                "describe treatment for cancer mediated by GTPase",
                                "describe treatment for sporadic or genetic diseases mediated by Rho GTPase",
                                "describe treatment for infections caused by Entamoeba histolytica or Acanthamoeba spp",
                                "outline alternative embodiments of method of treatment",
                                "describe coadministration with additional anticancer agents",
                                "describe treatment for cancer or metastasis of cancer"
                            ],
                            "outline_short": [
                                "motivate treatment of diseases using GTPase modulation",
                                "describe method of treating cancer using compounds",
                                "describe method of treating sporadic or genetic diseases using compounds",
                                "describe method of treating infections caused by Entamoeba histolytica or Acanthamoeba",
                                "provide examples of compounds for treatment",
                                "describe coadministration with additional agents"
                            ]
                        },
                        {
                            "title": "Experimental Rationale and Approach",
                            "paragraphs": [
                                "The Ras-homologous (Rho) family of small GTPases (Rac, Cdc42 and Rho) are key regulators of actin reorganization, cell motility, cell-cell and cell-extracellular matrix (ECM) adhesion as well as of cell cycle progression, gene expression and apoptosis (FIG. 1) [1-8]. In many human cancers (including colon and breast), aberrant Rho-family signaling due to changes in the GTPase itself or in its regulation loops is a critical underpinning of tumor growth and survival, invasion and metastasis [9-13] (FIG. 1). RhoA and RhoC correlate with advanced ovarian cancer and peritoneal dissemination [14; 15]. Our own studies are the first to demonstrate dysregulation of Rac1 and Cdc42 in ovarian tumor specimens (FIG. 2).",
                                "Although Rac1 and Cdc42 have been recognized as attractive therapeutic targets, specific Rac GTPase inhibitors while effective in culture [16; 17] have not been translated to clinical use and there are no established Cdc42 specific inhibitors. Lovastatin was shown to inhibit Rho GTPase and reduce ovarian metastasis in a xenograft model [15]. However, the use of statins to block GTPase membrane association has met with only modest success due to their broad spectrum inhibition of protein prenylation resulting in pleiotropic effects on many GTPases and pathways [18]. Thus, more specific agents for clinical application are urgently needed. The inventors identified two FDA approved drugs as inhibitors of Rac and Cdc42 that block ovarian cancer cell behaviors associated with tumor growth, dissemination and invasion (FIGS. 3-4) and display activity an intraperitoneal xenograft model (FIG. 6).",
                                "The studies described herein are significant for several reasons. First, the inventors investigate Rac1 and Cdc42 as therapeutic targets in ovarian cancer, a disease with limited treatment options. Effective targeting of key regulators of metastatic spread would have substantial positive impact on patient quality of life and duration of disease-free survival. Second, the inventors determine the mechanism of action of the novel Rac1 and Cdc42 inhibitors that will inform future development of targeted therapeutics. Third, testing FDA approved drugs for impact on ovarian cancer enable positive results to be rapidly translated to phase 1/2 clinical trials. Finally, results are expected to be applicable to numerous other cancers where Rac and Cdc42 and their downstream effectors are aberrantly activated.",
                                "Other disease states and conditions which are favorably impacted by the results which are obtained from the experiments described herein include the sporadic or genetic disease states and/or conditions in which Rho GTPases are implicated including, for example, Menkes disease, rheumatoid arthritis, atherosclerosis, diabetes (type I), Huntington's disease and Alzheimer's disease. Inhibition of GTPase is consistent with treatment modalities for these disease states and/or conditions which mediated through Rho GTPase."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Rho family of small GTPases",
                                "describe role of Rho GTPases in cancer",
                                "describe need for specific Rac and Cdc42 inhibitors",
                                "describe identification of FDA-approved drugs as inhibitors",
                                "describe significance of studies"
                            ],
                            "num_characters": 2951,
                            "outline_medium": [
                                "introduce Rho family of small GTPases",
                                "describe significance of studies and potential impact on ovarian cancer treatment"
                            ],
                            "outline_short": [
                                "motivate Rho GTPase as therapeutic target"
                            ]
                        },
                        {
                            "title": "High Throughput Screens",
                            "paragraphs": [
                                "A first task involved conducting comprehensive high throughput screens for inhibitors and activators of small GTPases using purified proteins and libraries of both FDA approved and novel small molecules [19; 20]. Cheminformatics identified structure-activity relationships that allowed generation of testable, mechanistic hypotheses for Rac1 and Cdc42 inhibition by stereoisomeric compounds, including naproxen and ketorolac. The lack of activity by >20 other NSAIDs against GTPase targets strongly suggests enantiomer-selective targeting of Rac1 and Cdc42 by R-naproxen and R-ketorolac and related derivatives (FIG. 10). Although it has been long recognized that R-enantiomers of NSAIDS are poor inhibitors of COX activity and lack COX-associated toxicities [21-29], little is known about potential pharmacologic activities or targets of the R-enantiomers. In one example, R-etodolac has no COX inhibitory activity, but does retard tumor development and metastasis in a transgenic mouse model of prostate cancer [30]. The retinoid X receptor-α was identified as the R-etodolac target, indicating enantiomer-dependent selectivity for a novel target.",
                                "The discovery of the presently claimed compounds is based on high throughput screening, cheminformatics and direct biochemical and cellular testing showing that R-naproxen and R-ketorolac inhibit Rac1 and Cdc42 GTPase activities. Despite substantial evidence for a causal role of aberrant Rac1 and/or Cdc42 activity in human cancers, these proteins have not been widely explored as therapeutic targets. The limited numbers of small molecule Rac inhibitors (NSC23766 and derivatives, EHT 1864) disrupt specific activator proteins (i.e. GEFs) that convert the GTPase to the active state, or perturb effector coupling to block downstream signaling (FIG. 1) [16; 31-33].",
                                "Cheminformatic modeling of R-naproxen binding to Rac1 predicts the compound docks to an allosteric site in the nucleotide-binding pocket of the GDP-bound GTPase; suggesting a novel mechanism of action that is distinct from the current Rac inhibitors (FIG. 3) and the proposed studies may reveal a new avenue for disrupting Rac and Cdc42 activity. Although Rac 1-targeted inhibitors display activity in cells and represent promising leads [16; 17; 33; 34], these compounds have not been translated to human use and Cdc42-specific inhibitors are not reported in the literature. In one aspect of the invention, the repurposing of FDA-approved drugs would offer a distinct advantage over new chemical entities requiring extensive toxicity and safety testing prior to clinical application. Thus, the R-enantiomers of naproxen and ketorolac (FDA approved in the racemic mixtures) and compounds listed in FIG. 10 offer an innovative approach for therapeutic targeting of Rac1 and Cdc42. The proposed studies provide critical information on the mechanism and feasibility of targeting Rac1 and Cdc42 with the R-enantiomers of naproxen and ketorolac. The expertise of the multi-disciplinary investigative team and collaborators (cheminformatics, bioinformatics, crystallography, biochemistry, cell biology and in vivo tumor modeling) fosters the advancement of these Rac1/Cdc42 targeted compounds with potential for rapid translation, and conversely validate Rac1 and Cdc42 as novel therapeutic targets in ovarian cancer."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "conduct high throughput screens",
                                "identify structure-activity relationships",
                                "generate testable hypotheses",
                                "discover R-naproxen and R-ketorolac as inhibitors",
                                "compare to other NSAIDs",
                                "discuss enantiomer-selective targeting"
                            ],
                            "num_characters": 3330,
                            "outline_medium": [
                                "conduct high throughput screens for inhibitors and activators",
                                "identify structure-activity relationships using cheminformatics",
                                "generate testable hypotheses for Rac1 and Cdc42 inhibition"
                            ],
                            "outline_short": [
                                "conduct high throughput screens for inhibitors and activators of small GTPases"
                            ]
                        },
                        {
                            "title": "Rationale and Feasibility of the Examples:",
                            "paragraphs": [
                                "Ovarian cancer metastasis is predicted to be strongly dependent on Rac1/Cdc42-regulated pathways for exfoliation, formation of multicellular aggregates (MCAs), mesothelial adhesion, and localized invasion into the interstitial collagen-rich submesothelial matrix (FIG. 1) [35-38]. The preliminary data generated offer the first evidence for dysregulation of Rac1 and Cdc42 GTPase expression and activity in ovarian cancer (FIG. 2). Stage and grade dependent overexpression of Cdc42 and Rac1 proteins was based on immunohistochemical staining of human tumor samples. GTPase overexpression levels were highly significant for malignant, high-grade tumors (Rac1 (p=0.009) and Cdc42 (p<0.001)). Expression of a constitutively active splice variant Rac1b (first documented in breast tumors, [12]) was detected by qPCR and a GLISA activity assay showed both Cdc42 and Rac1 GTPases highly active in fresh tumor isolates. These data provide the foundation for further experiments which are provided to delineate the impact of Rac1 and Cdc42 on measures of ovarian cancer disease and patient outcomes. Because activated Rac1 and Cdc42 regulate cell motility, survival and proliferation through multiple effectors (FIG. 1), we also investigate the status of effector proteins associated with the tumor cell behaviors that are altered by Rac1 and Cdc42 inhibitors (Table 1, FIG. 4). This information delivers mechanistic insight into the contributions of Rac1 and Cdc42 pathways to ovarian cancer and identify key downstream effector pathways associated with this disease. Access to a repository of tumor samples that are linked to patient outcomes through the Human Tissue Repository of the UNM NCI funded Cancer Center is important to deceipher these pathways."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "predict ovarian cancer metastasis dependence",
                                "discuss preliminary data on Rac1 and Cdc42 dysregulation",
                                "outline experiments to investigate Rac1 and Cdc42 pathways"
                            ],
                            "num_characters": 1750,
                            "outline_medium": [
                                "predict ovarian cancer metastasis dependence on Rac1/Cdc42-regulated pathways"
                            ],
                            "outline_short": [
                                "predict ovarian cancer metastasis dependence on Rac1/Cdc42-regulated pathways"
                            ]
                        },
                        {
                            "title": "Further Examples",
                            "paragraphs": [
                                "Screening of the Prestwick library of FDA-approved molecules identified the R-enantiomer of naproxen as active against Rac1 and Cdc42, which was confirmed in cellular GLISA assays (FIG. 3A). R-, and S-ketorolac were identified for structure activity testing based on cheminformatics. Despite the common chemotype, S-naproxen and 6-MNA did not significantly inhibit Rac1 or Cdc42 indicating that GTPase inhibition is independent of the COX pathway. At nontoxic doses that are meaningful with respect to human serum levels at therapeutic doses Table 2 [39-47], the R-enantiomers of naproxen or ketorolac are more effective for inhibition of migration in SKOV3ip (FIG. 4A-B), OVCA 429 (not shown) and primary ovarian tumor cells isolated from ascites (not shown). The same structure activity relationship was observed for multicellular aggregate formation (FIG. 4C). Inhibition of proliferation did not exceed 50% with R-naproxen>S-naproxen or 6-MNA and little inhibition by R- or S-ketorolac (not shown). We tested >20 other common NSAIDS and did not detect inhibitory activity in vitro or in cells against Rac1 or Cdc42, nor any impact on ovarian cell migration or proliferation. Thus, from the structure activity relationships and selectivity, we conclude that the inhibitory actions of R-naproxen and R-ketorolac are due to an effect on novel Rac1 and Cdc42 GTPase targets as first revealed by the molecular library screen and predicted by cheminformatics.",
                                "Virtual docking predicts that R-naproxen, but not S-naproxen can bind the GDP-bound pocket of Rac1 (FIG. 3B). In the model R-naproxen is stabilized through favorable H-bonds with Thr17 and Asp57, as well as through interaction with magnesium via the naproxen carboxyl group. Interestingly, Thr17 is the mutated residue in dominant negative forms of Rac1. The model predicts stabilization of the inactive GDP-bound GTPase and provides a testable hypothesis for a novel mechanism of action and the enantiomer selective differences in activity. As predicted by the enantiomer-selective inhibition of Rac1 and Cdc42 activity, we find that R-naproxen and the established Rac1 inhibitor NSC23766 inhibit ovarian tumor cell proliferation, migration and MCA formation (FIG. 4A-C and data not shown) while S-naproxen and 6-MNA display little effect. Similarly, in an intraperitoneal xenograft model, animals administered R-naproxen displayed a 4-fold reduction in tumor number and a 36% decrease in total tumor burden while the S-naproxen and 6-MNA treated animals were similar to placebo controls (FIG. 6). These data demonstrate that the enantiomer-selective properties of R-naproxen are preserved in vivo."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "screen Prestwick library for FDA-approved molecules",
                                "identify R-naproxen and R-ketorolac as active against Rac1 and Cdc42",
                                "test structure-activity relationships",
                                "evaluate inhibition of migration and multicellular aggregate formation",
                                "discuss virtual docking predictions"
                            ],
                            "num_characters": 2658,
                            "outline_medium": [
                                "screen Prestwick library of FDA-approved molecules for Rac1 and Cdc42 inhibitors",
                                "test structure activity relationships and selectivity of R-naproxen and R-ketorolac"
                            ],
                            "outline_short": [
                                "identify R-enantiomers of naproxen and ketorolac as inhibitors of Rac1 and Cdc42"
                            ]
                        },
                        {
                            "title": "Establishing the Consequences of Rac1 and Cdc42 Activation and Overexpression in Human Ovarian Tumors.",
                            "paragraphs": [
                                "Preliminary data generated represent the first evidence for increased Cdc42 and Rac1 expression and activation in ovarian cancer, and support the hypothesis that dysregulated Rac1 and Cdc42 will lead to the activation of one or more effectors and pathways that have negative impact on ovarian cancer patient outcome. Because several effectors are reportedly elevated or activated in ovarian cancer, it is important to address whether effector activation is dependent or independent of Rac1 and Cdc42 dysregulation to gain insights into the potential therapeutic impact of targeting Rac1 and Cdc42. No such integrated analyses have been conducted in ovarian cancer or in other cancers where Rho-family GTPases are overexpressed.",
                                "Focus is on the four downstream effectors (Table 1) with key roles in tumor growth and metastasis (FIG. 1). In human cancers, p21 activated kinase (PAK) isoforms act as nuclear effectors and are critical for tumor angiogenesis, epithelial-mesenchymal transition and anchorage independent growth downstream of Rac1 and Cdc42 [36; 48]. Elevated PAK1 levels are correlated with poor prognosis and aggressive ovarian cancers, making it an effector of particular interest [49; 50]. Cell-cell adhesion is modulated by active Rac1 and Cdc42 through IQGAP1-mediated disassembly of adherens junctions and nuclear translocation of beta catenin [38]. Rac/Cdc42/IQGAP1 are predicted to modify MCA formation and/or dispersal upon mesothelial contact. Mesothelial invasion and contact with the collagen-rich submesothelial matrix is likely mediated through WAVE3 and WASP effectors, which function in actin remodeling and invasion. Activated Rac1 is important for integrin-mediated lamellipodia formation, cell spreading, and tumor cell migration via",
                                "WAVE3 [51-53], while Cdc42 is important for invadopodia-mediated invasion via WASP [37]. WAVE3 and WASP pathways are downstream of activated Rac1 and Cdc42, respectively, and is important for discriminating if one or both GTPase pathways are active, and identify if functional redundancies amplify invasion or if one pathway predominates over another. The initial focus on these specific effectors is based on the cellular functions disrupted by R-naproxen, R-ketorolac and the Rac1 inhibitor NSC23766 (FIG. 4-5) and tumor cell activities that are necessary for ovarian cancer metastatic success. Experiments are designed to test the hypothesis that comparative evaluation of a cohort of interrelated signaling molecules in patient tissue samples will demonstrate their utility individually or as a panel for serving as prognostic markers and provide supporting evidence for their use as therapeutic targets."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "discuss increased Cdc42 and Rac1 expression and activation",
                                "outline hypothesis on dysregulated Rac1 and Cdc42",
                                "focus on downstream effectors",
                                "discuss PAK1, IQGAP1, WAVE3, and WASP effectors",
                                "outline experiments to test hypothesis"
                            ],
                            "num_characters": 2675,
                            "outline_medium": [
                                "analyze effector activation dependence on Rac1 and Cdc42 dysregulation",
                                "focus on four downstream effectors with key roles in tumor growth and metastasis"
                            ],
                            "outline_short": [
                                "analyze effector activation dependence on Rac1 and Cdc42 dysregulation"
                            ]
                        },
                        {
                            "title": "General Approach to Analysis:",
                            "paragraphs": [
                                "Immunohistochemical (IHC) analysis of ovarian tumor tissue microarrays (TMAs) is conducted using commercially available sources and UNM-generated TMAs with associated patient information. IHC images are recorded using an Aperio system with options for training and automated quantification. Independent verification of tumor pathology and marker evaluation isconducted by Ob/Gyn certified pathologist Lomo and statistical analysis is performed by the UNM CRTC biostatistics core as in FIG. 2."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "outline immunohistochemical analysis approach"
                            ],
                            "num_characters": 492,
                            "outline_medium": [
                                "conduct immunohistochemical analysis of ovarian tumor tissue microarrays"
                            ],
                            "outline_short": [
                                "conduct immunohistochemical analysis of ovarian tumor tissue microarrays"
                            ]
                        },
                        {
                            "title": "Pathway Activation:",
                            "paragraphs": [
                                "Stain for the markers indicated above are performed using commercially available tumor microarrays with multiple cores per case (US Biomax). Marker expression and localization (nuclear, cytoplasmic, membrane) is assessed. For example, PAK1 activation through phosphorylation and nuclear translocation is postulated to be a prognostic marker in ovarian cancer based on its association with poor overall and disease-free survival and activation of angiogenesis [54] therefore localization is an important indicator of activation status. Scoring is conducted by two pathologists for the presence or absence of staining, localization and good correlation (within 1 quartile) with percent and intensity (0-3+) of epithelial staining. Staining intensity is dichotomized with high- or overexpression defined as above the median of the product of intensity times the percentage of epithelial cells stained. There are two levels of statistical analysis. First, the protein expression levels and/or distribution of each marker isanalyzed with respect to tumor stage and grade and ovarian carcinoma histotypes (serous, clear cell, endometrioid, and mucinous). This study will identify markers with the greatest correlation to tumor parameters (histotype and disease stage/grade). The second analysis is to evaluate PAK1/pPAK1, WAVE3, WASP and IQGAP1 protein expression levels and distribution as functions of Rac1 and/or Cdc42 activation or overexpression in serial sections. These experiments will identify effectors with the greatest correlation to GTPase activation status and whether GTPase activation and specific downstream pathways are coordinately activated.",
                                "**Patient Outcome**",
                                "Rac1, Cdc42 and downstream effectors identified as being linked to ovarian tumor stage or grade are further tested on tumor microarrays with linked patient outcome data. A duplicate core tissue microarray (TMA) of archival specimens from 45 patients with ovarian tumors of low malignant potential (LMP) and 89 patients with epithelial ovarian cancer (EOC) are used. This TMA was used to identify the novel estrogen receptor GPR30 as a predictor of poor survival in ovarian cancer [55]. Based on ANOVA analyses and 45% differences in expression levels, a power of 0.8 is achieved through the evaluation of 80 samples, which is within our sample collection. Marker expression or localization, defined as above or below the median (intensity in compartment×the percentage of positive epithelial cells), is used to correlate staining with predictors of adverse outcome and overall or disease free survival. Additional arrays are prepared as needed, These experiments are used to determine the prognostic potential of activated GTPase markers alone or in combination with downstream effector pathways.",
                                "**Statistical Analysis.**",
                                "Clinical results are analyzed statistically. Pearson correlation (r) are used to compare Rac1/Cdc42 staining intensity to that of other markers, and results are confirmed using Spearman correlation. For the remaining analyses, staining intensity is dichotomized with high- or overexpression defined as above the median of the product of intensity times the percentage of epithelial cells stained. For continuous demographic data that are not normally distributed and for clinical and pathological data, respectively, nonparametric Wilcoxon and Fisher's exact tests are used. The LIFETEST procedure is used to calculate survival curves, and differences in survival are compared using the Log-rank test. P values≦0.05 is considered statistically significant. To discern relationships between two target proteins (e.g. GTPase and specific effectors) exhibiting positive staining in matched samples we will stratify using the Nottingham Prognostic Index, which identifies risk using clinical and pathologic parameters groups, and then derive Cox proportional hazards and regression tree models. Training and validation sets are derived to test the ability to distinguish patients with poor outcomes from those with good or moderate outcomes and to calculate hazard ratios.",
                                "**Results and Alternative Approaches**",
                                "Rac1, Cdc42 and associated downstream effectors are predicted regulators of ovarian tumor cell growth and metastasis and we expect that in addition to predicting poor overall survival, one or both of the GTPases (Rac1/Cdc42) along with PAK1 (or pPAK1), WAVE3, WASP or IQGAP1 are associated with advanced stage and/or grade. If positive, we extend our studies to include analysis of matched primary tissue and metastatic lesions (US Biomax). Although our initial analysis of Rac1 and Cdc42 did not reveal significant differences in expression between serous and endometrioid tumors (not shown), it is possible that histotype associations are identified with one or more markers. For example, IQGAP activation leads to the disassembly of adherens junctions and nuclear translocation of beta catenin [38]. Analyses of nuclear beta-catenin identified a higher preponderance among endometriod as compared to serous carcinomas suggesting that activated beta-catenin might discriminate between ovarian cancer subtypes [56]. Each of the proposed markers has been tested in human tumor tissues. We use only antibodies that have been validated for IHC and conduct studies to optimize each marker individually. Additional tissues are available through the HTR is additional sample size is required to draw meaningful conclusions. PAK1 expression levels and altered distribution between nucleus and cytoplasm are important in tamoxifen resistant breast tumors and glioblastomas with poor prognosis [50; 57; 58]. Therefore, if PAK1 is a critical factor in ovarian cancer, expression is expected to be elevated and/or distribution between cytoplasm and nucleus may be altered in ovarian tumors as compared to normal tissues. As an alternative approach we look for altered PAK1 phosphorylation (correlated with poor outcome in glioblastoma) by western blot of primary tissue samples and taking into consideration best tissue procurement practices to preserve phosphoprotein profiles [58; 59]. WAVE3, if crucial in ovarian cancer, is expected to be increasingly expressed in the cytoplasm of ovarian tumor cells analogous to observations made for prostate cancer [51]. As surrogates for WAVE3 activation, matrix metalloproteases (MMP)-1 and -9, but not -2 should be upregulated and active. Diffuse overexpression of IQGAPI is correlated with high-grade ovarian tumors, and overexpression and increased membrane association are also linked to gastric and hepatocellular carcinoma [60-62]. As a corollary to IQGAP activation, we expect to find elevated nuclear beta-catenin. RT QPCR may also be used as an alternate or in parallel to protein expression measures for marker validation. The outcomes from these studies will establish essential relationships between GTPase activation and corresponding downstream pathways that are related to ovarian tumor cell behavior linked to metastatic dissemination. Importantly, these cell behaviors are modulated by the R-enantiomers of naproxen and ketorolac and the Rac1 inhibitor NSC23766 (FIG. 4). The inventors thus identify those pathways with greatest likelihood of response to GTPase targeted therapeutics to be tested.",
                                "**Rationale:**",
                                "Chemical Library Screens are conducted to identify inhibitors and activators of small GTPases [19]. Screening of the Prestwick chemical library of out-of-patent drugs identified the R-enantiomer of naproxen as active against Rac1 and Cdc42, which was confirmed in cellular assays; GLISAs that measure GTPase activation status (FIG. 3A), and proliferation, adhesion and migration assays that are reflective of pathways downstream of GTPase activation (FIG. 4). Using the Prestwick chemical library hit as a template, combined 2D- and 3D-based virtual screening techniques [63] to identify additional NSAIDs (not in the library) for testing was carried out. The nabumetone active metabolite, 6-MNA, ranked first on this list, as it shares a common chemotype with R- and S-naproxen. Since 6-MNA lacked Rac1 and Cdc42 activity (FIG. 3A and not shown), it was postulated that the rotational barrier around the carboxyl-substituted chiral center may explain differences in GTPase activity. Therefore the inventors performed additional similarity queries focused on a rotationally constrained carboxyl-substituted chiral center, and identified R- and S-ketorolac (also not in library) as matching enantiomeric candidates. R-ketorolac inhibited ovarian tumor cell migration with an IC50 of ˜10 μM (FIG. 4B).",
                                "Significant differences in the inhibitory activities of the naproxen series against GTPases were quantified (R-naproxen>S-naproxen>6-MNA) (FIG. 4A). The differences are thought to be a consequence of both rotational constraints around the chiral center imposed by the methyl group and a requirement for the aryl rings to be accommodated in a hydrophobic pocket that has a pyrrolizine that restricts rotation of a linked benzoyl ring. This is exemplified by recent crystallographic studies on naproxen binding to COX. S-naproxen displays optimal fit and inhibitory activity (50-70%) against COX enzymes based on crystallographic and enzymatic evaluations [22]. In contrast, R-naproxen displayed only 10-20% inhibition at >25 μM, which is explained based on the limited structural modification permitted by the NSAID binding pocket on COX enzymes [22]. In contrast to the COX enantiomeric specificity, virtual docking predicts R-naproxen, but not S-naproxen binding to the GDP-bound pocket of Rac1 (FIG. 3B). The model for R-naproxen binding to Rac1 predicts stabilization of the GDP-bound GTPase and provides a testable, novel mechanism for the inhibitory activities of the R-enatiomers of naproxen and ketorolac.",
                                "**General Approach:**",
                                "In vitro and cell based assays are conducted to: 1) establish the mechanism of naproxen and ketorolac inhibition using flow cytometry based equilibrium and kinetic assays; 2) monitor potential disruption of target interaction with GTPase regulatory and effector molecules in vitro; and 3) monitor drug treated cells for in vivo inhibition of pathways that are directly downstream of Rac1 and Cdc42 activation.",
                                "**Testing of Compounds**",
                                "Compounds for analysis are summarized in Table 2. Additional compounds are identified in FIG. 10. Each compound is tested in a log dose range corresponding to therapeutically relevant concentrations (average serum concentrations at standard dosing). The range for cell based testing of the naproxen series (R-, S- and 6 MNA) is 10-300 μM; ketorolacs (R- and S-) is 1-30 μM and NSC 23766 10-100 μM (positive control for Rac1 inhibition). For in vitro assays the concentrations extend into the nanomolar range.",
                                "**In Vitro Analyses of Nucleotide Binding to Determine Mechanism of Action.**",
                                "A bead-based flow cytometry assay for measuring nucleotide binding is used to test the predicted novel mechanism of drug interaction with purified Rac1 and Cdc42 GTPases. Non-competitive and uncompetitive binding mechanisms of NSAIDs and other small molecules to protein active sties are well described in the literature [64-68]. BODIPY(4,4-difluoro-4-bora-3a,4a-diaza-s-indacene)-labeled nucleotide (GDP or GTP) binding to GSH-bead immobilized GST-Rac or GST-Cdc42 is quantitatively measured by flow cytometry as previously described [19; 69; 70]. Both equilibrium nucleotide binding in the presence or absence of increasing doses of each test compound (Table 2) and kinetics of nucleotide binding and dissociation with and without each compound is measured. The Kd for BODIPY-GTP/GDP of Rac1 and Cdc42 is ˜100 nM. Equilibrium competition experiments establish the EC50 by testing serial dilutions of each compound across concentrations (0.03 nM-30 μM), while holding the concentration of BODIPY GTP/GDP constant around the Kd. Dissociation measurements under equilibrium conditions is performed by allowing BODIPY-nucleotide binding to saturation (90 min) and adding an excess of unlabeled nucleotide or drug and monitoring the dissociation rate of the bound nucleotide in real time. Kinetic experiments measure BODIPY-GTP/GDP on rates over ˜250 s in the presence of compound concentrations well in excess of the EC50. Off rates are determined by prebinding GTPase and BODIPY-GTP/GDP and adding compound in excess of EC50 concentration. DMSO and excess unlabeled GTP/GDP controls are included in all experiments. Data are normalized and analyzed using Prism software as described in our published studies [19; 69; 70].",
                                "One of the predicted R-naproxen contact points is through a hydrogen bonding interaction with T17 of Rac1. Therefore, we test the impact of the classic dominant negative Rae T17N alone or in combination with D57A and D57N mutants on R-naproxen binding tested using BODIPY-GDP and flow cytometry as described above. Depending on the outcomes of the mechanism of inhibition studies on ketorolac, virtual docking studies is conducted and relevant site-directed mutants is generated as illustrated for R-naproxen (FIG. 3B).",
                                "These studies use the flow cytometry based GTP binding assay used for the initial HTS screen and characterization of other GTPase inhibitors [19; 69; 70], in establishing mechanism of drug interaction and in silico predictions of interactions to inform studies of protein:drug interaction [63; 76-84].",
                                "In Vitro Analyses of Drug Effects on Regulatory and Effector Protein Interactions with GTPases.",
                                "The virtual docking studies predict a novel mechanism of R-naproxen action (stabilizing inactive, GDP-bound state) relative to known Rac1 inhibitors that bind to the switch regions and block guanine nucleotide exchange factor interactions or promote nucleotide release [17; 33; 89]. GTPases have two switch regions that undergo significant conformational changes based on which nucleotide (GDP or GTP) is bound. Effector binding is restricted to the GTP-bound conformation thus we anticipate disruption of this interaction. In vitro Pak effector binding assays measure the inhibitory effects of drug binding on GTPase-effector protein interactions [90]. Purified His-Rac1 or His-Cdc42 isbriefly preincubated (<15 min) with each test compound (0-100 μM), −/+GDP or GTPγS addition. Recovery of GTPases in the active conformation is via PAK coated ELISA plates (Cytoskeleton, Inc.) and luminescent GTPase-specific antibody based readout or via addition of GST-PAK-PBD immobilized on GSH-beads followed by immunoblotting for bound GTPase fraction. Effects of naproxen and ketorolac on Tiam or Dbl GEF mediated activation of Rac1 and Cdc42, respectively, is measured using a kinetic, 96-well plate based mant-GTP binding assay in routine use in the lab. Tiam GEF is measured in the presence of ascorbyl stearate [91]. Dbl and reagents for GEF assay are purchased from Cytoskeleton, Inc. NSC23766 serves as a positive control for GEF inhibition,",
                                "**Expected Results In Vitro Analysis:**",
                                "The mechanism of inhibition of compounds according to the present invention are determined from flow cytometry experiments. In an uncompetitive inhibition mechanism the drug would bind only to the nucleotide-bound GTPase and thus would be expected to decrease the apparent Kd and decrease the Bmax. A noncompetitive inhibition mechanism would allow both the nucleotide and drug to bind simultaneously, but independently and thus without any change to the apparent Kd. However, since the bound inhibitor would block enzyme activity, Bmax should decrease. A competitive mechanism is considered unlikely, but would be associated with an increase in Kd and no change in Bmax. Both Rac1 and Cdc42 bind to the PAK effector protein. Binding assays in the presence of GDP and GTP alone will provide minimum and maximum binding activities. Binding in the presence of increasing doses of drugs will establish effects on regulatory and effector protein interactions. The composite studies lend insight into mechanism of action and inform plans for crystallographic analyses. One-way ANOVA of duplicates and repeated measures to 95% confidence intervals identify actives.",
                                "**Small Molecule Impact on Effector Activity in Cells.**",
                                "GLISA is extensively used for measuring EGF-stimulated Rac and Cdc42 activation in Swiss 3T3 cells in the presence and absence of test compounds. Preliminary data demonstrate R-naproxen inhibits Rac1 and Cdc42 GTPase activities in OvCA cell lines (429 and 433). However, direct GTPase inhibitory activity for the ketorolac series, although expected based upon the initial results, remains to be established. GLISAs in are highly specific, quantitative, can be performed with small sample sizes (<50 μg of cell lysate per assay, compared to 1-10 mg required for conventional PAK binding assay) and have excellent reproducibility. To assess the inhibitory effects of the small molecules in Table 2, preincubate cells for 15-60 min (times that establish detection of acute GTPase inhibition) with varying concentrations of each compound as described. NSC23766 serves as a positive control for Rac1 inhibition. The optimal time for measuring maximal EGF-stimulated Rae and Cdc42 activation in Swiss 3T3 cells and OVCA429 cells is after 2 min EGF treatment (FIG. 3A). Activated RhoA is also measured by GLISA following lysophosphatidic acid stimulation as an additional specificity control as needed. These analyses establish cellular IC50s (for R-naproxen and R-ketorolac relative to S-enantiomers and control compounds). Based on data, expectation of the enantiomer selectivity to be R>S, the reverse of what has been established for the COX enzymes [22].",
                                "As a mechanistic corollary to the inhibitory properties of R-naproxen and R-ketorolac on cell behaviors (proliferation, adhesion and migration, FIG. 4), it is of interest to determine which Rac1 and Cdc42 regulated pathways are directly affected by GTPase inhibition (FIG. 1, Table 1). Preliminary data demonstrate that R-naproxen, but not 6 MNA treatment of OvCA cell lines inhibits Rac and Tiam membrane association consistent with the inhibition of Rac1 activity measured by GLISA (FIG. 5A-C). In addition, the formation of Cdc42-dependent, actin-based invadopodia that are crucial for matrix degradation and invasion [92; 93] is also significantly reduced by R-naproxen, but not by 6 MNA (FIG. 5D-E).",
                                "Using a combination of immunofluorescence staining, western blotting to monitor and quantify changes in localization, expression and phosphorylation of key downstream effectors of Rac1 and Cdc42+/−drug treatment (6-24 h) are monitored. The markers to be studied are the same as those that are monitored by IHC in tumor samples and allow direct testing of the impact of drug treatment on key pathways that are downstream of GTPase activation to gauge how well they are targeted by GTPase inhibition. Molecules/pathways analyzed include: a) membrane localization of GTPases (Rac1 and Cdc42) and regulatory proteins (Tiaml, Dbl GEFs) as measures of GTPase activation; b) IQGAP/beta catenin localization to adherens junction or nucleus as markers of stable cell-cell adhesion vs. EMT; c) PAK/pPAK as markers of pathways downstream of Rac1 and Cdc42 that alter proliferation and migration; d) WAVE and WASP membrane association in conjunction with lamellopodia and filopodia/invadopodia formation as measures of acute actin remodeling needed for cell migration and invasion. SiRNA knockdown of Rac1 and Cdc42 alone or in combination is used to verify that the drug responses depend on inhibition of Rac1 and Cdc42 function.",
                                "**Expected Results and Alternatives:**",
                                "The cell based assays identify which Rac1 and Cdc42 pathways are most directly impacted by GTPase inhibition and together with IHC results obtained in Aiml provide mechanistic information about the pathways that are activated in ovarian cancer and can best be inhibited by small molecule GTPase inhibitors. In addition, the studies inform which measures are most useful for tracking molecular analyses of xenograft tissues as part of Aim 3. Requisite expertise in imaging and all the tools and assays needed for the study are routine as illustrated by data shown. Many commercial antibodies are available from different sources, thus, biochemical measures of phosphorylation or cell fractionation to establish changes in localization may be used as alternates. Statistics performed as for in vitro analyses.",
                                "**Testing the Activity of Select NSAIDs in Preclinical Cell and Xenograft Animal Models.**",
                                "The ovarian tumor microenvironment contains small molecules and ligands that stimulate signaling pathways upstream of Rac1 and Cdc42 (FIG. 1) [35; 94] and adhesive events required for peritoneal implantation and invasion also stimulate Rac1 and Cdc42 [95-102]. Therefore, it is believed that R-naproxen and R-ketorolac have demonstrable impact on biological processes required for ovarian cancer metastatic success (FIG. 7). In support of this hypothesis, R-naproxen decreased the number of implanted tumors in a xenograft animal model using athymic nude mice injected with human ovarian tumor cells adapted to intraperitoneal growth (SKOVip; obtained through a formal MTA from MD Anderson). Treatments were incorporated into transgenic dough (BioServe, Frenchtown, N.J.) and animals were dosed twice per day to achieve established therapeutic serum levels [73]. Animals were given placebo dough or dough containing R-naproxen, S-naproxen or 6 MNA. After sacrifice, animals fed R-naproxen exhibited a 4-fold reduction in tumor number (FIG. 6) and a 36% decrease in total tumor burden (not shown), while the 6MNA and S-naproxen treated animals were similar to the placebo controls. These data demonstrate that the enantiomer specific inhibitory properties of R-naproxen are preserved in vivo and that this NSAID may reduce tumor growth and spread, a point that is further tested and extended to ketorolac.",
                                "**Additional Research:**",
                                "An organotypic model is used to study the impact of small molecules on distinct components of ovarian tumor metastasis using cells derived from patients (ex vivo assays) and established ovarian tumor xenograft models (in vivo assays) (FIG. 6). Use of multiple ovarian cancer cell lines (429,433,Skov) and small molecule interventions defined in Table 2. Important questions regarding the biologic impact of small molecules on distinct aspects of ovarian tumor metastasis (see also FIG. 7) are answered:",
                                "1) R-naproxen or ketorolac disrupts MCA formation and inhibits ovarian tumor cell proliferation and survival in suspension. Metastatic cells are shed into the peritoneal cavity as single cells and spheroids or multicellular aggregates (MCAs) [103; 104] and because the majority of conventional chemotherapies are ineffective in preventing MCA growth and dissemination, they are considered a likely source of recurrent disease [105]. Disrupting MCA behavior is believed to represent an important therapeutic strategy.",
                                "2) The small molecules interfere with ovarian tumor cell attachment and invasive anchoring to the mesothelium required for metastatic growth. Aggregation and peritoneal attachment of multicellular aggregates (MCAs) is mediated via both β1-integrin and E-cadherin-dependent mechanisms [104; 106-112]. Rho-family GTPases are implicated in the establishment, maintenance and stability of cell:cell contacts and cadherin or CD44 engagement stimulates Rac1 and Cdc42 activity [95-102]. This illustrates the importance of testing small molecule inhibitors of Rac1/Cdc42 on cell:cell interactions that are meaningful for ovarian cancer metastasis.",
                                "**Ex Vivo Studies:**",
                                "The impact of novel small molecules on patient-derived tumor cells ex vivo is tested. Under an approved protocol, collection of tissues and ascites from patients with primary ovarian cancer is performed. The tissue is de-identified and the presence and type of tumor is verified histologically by a pathologist. Fresh tissue offers several distinct advantages to cell lines, namely the ability to 1) investigate dose-dependent response of primary ovarian tumor cells as a precursor to human translational studies, 2) directly relate target expression and activity with cell response to test compounds, and 3) establish whether the responses obtained in homogeneous established cell lines (FIG. 4) are replicated in the more relevant, heterogenous cell populations isolated from patients. OVCA 429 and SKOV3ip cells are included in parallel as these cells are used in xenograft models [113-117] for comparison between in vitro response and the in vivo correlates. Organotypic cultures and 3D collagen gels (3 DCI) are used to model adhesive events that occur during intraperitoneal dissemination in vivo.",
                                "**Functional Studies:**",
                                "Ovarian ascites tumor cells are routinely maintained in short term culture with samples from ˜35-75% of patients able to be established for ex vivo analysis [118]. Similarly, cultures can be developed from minced primary tumor tissue [119]. The epithelial nature of the cells is confirmed by EpCAM and HE4 antibody immunostaining. Only primary lines confirmed as greater than 80% epithelial tumor cells after enrichment are selected for analysis. Cell response−/+the test compounds is cross-referenced to target expression and/or activity as in Aims 1-2. Standard experimental approaches which are used are demonstrated in the inventors' publications and preliminary findings [120-125]. Briefly, proliferation is measured by MTS assay, BrdU incorporation and cell counts; apoptosis by flow cytometry; migration and invasion by cell movement through a modified Boyden chamber without or with an artificial basement membrane, respectively; and cell aggregation/formation of MCA formation is evaluated in a hanging drop assay and MCA size and shape is analyzed by morphometric analysis [123]. Aggregate stability is estimated by subjecting MCAs to shear stress (trituration) followed by morphometric analysis [126]. MCAs is formalin fixed, paraffin embedded, sectioned and stained for active caspase-3 and -7 (BD Biosciences and Cell Signaling Technology, respectively) and cleaved PARP (Cell Signaling) or ApopTag reagents (Millipore). An apoptotic index is determined by quantifying the number of apoptotic cells as a fraction of the total cell number [127]. Control sections are stained with hematoxylin and eosin and Ki67 to quantify cell proliferation.",
                                "To more closely approximate adhesive events that occur during intraperitoneal dissemination in vivo uses organotypic cultures [128]. Organotypic cultures and 3DCI gels are generated as previously described [35; 128-131]. Briefly, type I collagen gels with embedded fibroblasts are overlaid with a confluent layer of mesothelial cells (LP9) in 24 well plates or transwells containing a porous filter. Alternatively, 3DCI gels are evaluated in the absence of mesothelial cells to mimic mesothelial cell retraction and exposure of the underlying ECM. Adhesion and invasion of cells labeled using membrane permeable fluorescent dyes (CMFDA, Invitrogen) are enumerated using fluorescent microscopy [128; 131]. Expansive growth in 3D collagen is measured after cell growth for 6-10 d using morphometric analysis of proliferative aggregate dimensions and quantitation of the number and size invasive projections, as described previously [123].",
                                "**Statistical Analysis.**",
                                "Measurements are summarized using means, standard deviations (SD) and 95% confidence intervals (CIs). Categorical variables are summarized as percentages with 95% CIs. Box plots are used to informally compare groups and to check the normality assumption needed for parametric analyses. All tests are conducted at the 5% level. Multiple comparisons (i.e. Tukey's test) are used to quantify group differences when differences among groups are statistically significant. Analysis of variance (ANOVA) is used to compare means among treatment and control conditions when the basic unit of analysis is a measurement or an average. Analogous methods is used for counts (i.e. Poisson regression) and proportions (i.e. logistic regression for apoptotic index).",
                                "**In Vivo Studies**",
                                "GFP-expressing OVCA 429 and SKOV3ip cells are used for the intraperitoneal (IP) xenograft studies (FIG. 6). The IP model will allow us to focus on adhesion and invasion in addition to tumor growth characteristics. Animals injected with SKOV3ip cells typically display ˜20-30 metastatic implants at 20 days post implantation and animals succumb to disease at ˜40 days with 80-100 overt peritoneal metastases [115]. Mice inoculated with OVCA 429 cells display a phenotype of large (>1.5 cm3) solid tumors that adhere loosely to fat in the pelvic region, intestine, and/or omentum in addition to multiple smaller tumors (<0.25 cm3) accumulating in the same three areas, with ascitic fluid accumulation [117]. Two treatment procedures are followed. 1) Introduce tumor cells and allow 7 days for the cells to engraft before treatment as a model of small molecule impact on residual disease. 2) Mice receive the intervention for two days before tumor cell inoculation to approximate the impact of small molecules on recurrent disease including tumor growth, metastatic implantation and invasive peritoneal lesions. The dose of R-naproxen, S-naproxen and 6-MNA is 20 mg/kg (oral) to approximate prescription dose levels in humans and these are common doses for naproxen treatment in mice [132-136]. Treatment of mice with 10 mg/kg S-naproxen led to plasma concentrations of ˜94 μM within 3 h [137]. Ketorolac is dosed orally at 1 mg/kg to achieve serum levels comparable to human therapeutic doses [23; 75]. Based on published studies of in vivo NSC23766 administration, subcutaneous infusion via an osmotic minipump provides effective dosing [138; 139]. A dose of 10 mg/kg/day reduced Rac1 activity in the target tissue (kidney) without apparent evidence of organ toxicity in mice following 6 weeks of continuous dosing [139]. Saline administration via osmotic minipump serves as the control for NSC23766. These studies represent an extensive evaluation of drug action on growth and metastatic success, which has not been evaluated for naproxen or ketorolac or known Rae inhibitors in ovarian or other cancers.",
                                "**Tumor Analysis**",
                                "Tumor growth is estimated three times per week by weight and abdominal circumference in addition to GFP imaging using an IVIS Lumina II. At sacrifice ovarian tumor burden for each treatment condition is obtained by dissecting solid tumors from the peritoneal cavity, including tumor cell volume recovered from ascites and peritoneal washings [117]. Evaluate in some detail of tumor burden including ascites tumor, as well as metastatic events such as peritoneal adhesion and anchoring. Metastatic disease is to be scored based on pattern of spread, number, and size of secondary foci. Specifically, the number of lesions at each organ site (bowel, mesentery, pancreas, liver, diaphragm) is quantified and categorized as small (<1 mm), medium (1-2 mm) or large (>2 mm). In collaboration with Pathologist Lomo, tumor-containing abdominal tissues is fixed in formalin, paraffin embedded, sectioned and stained with H&E to enable scoring of the extent of invasion [117] on a 1-3 scale, where 1=non-invasive tumors with a smooth tumor-mesothelial interface, 2=moderately invasive with some infiltration of underlying tissue and 3=highly invasive, with significant submesothelial growth and evidence of desmoplastic host response [131].",
                                "**Tumor Tissue Analysis**",
                                "Excised tumors are evaluated for target enzyme inhibition, effector analysis, proliferation, apoptosis, and angiogenesis. Following sacrifice, tumor tissue is collected and then fixed in 10% phosphate-buffered formalin solution for immunohistology or snap frozen in liquid nitrogen then stored at −80° C. until analyzed. Tumor masses from and ascites cells is analyzed for GTPase activity by GLISA assay (Rac1, Cdc42), COX activity, proliferation index, apoptotic index, and mean vessel density. The GLISA assays have been used successfully in isolated tissues (Cytoskeleton, Inc) and would provide a direct measure of effective target inhibition. Alternatively, if greater tissue sample is required, Rac1 and Cdc42 activity is measured by Pakl pull down assays from tumor lysates. COX activity is measured by ELISA. Proliferation and apoptotic indices based on tissue staining for Ki67 and TUNEL staining, respectively. The proliferation index is defined as percent cells positive for Ki67 in five randomly selected high power fields per tumor. Apoptotic index is determined by the number of apoptotic tumor cells in five randomly selected high-power fields exclusive of necrotic areas. Because COXs and Rho-family GTPases are involved in angiogenesis [140-148], we will measure mean vessel density (MVD) by counting CD31-positive vessels as described previously [149]. Analyses of the expression and localization of downstream effectors (PAK1, WAVE3 and IQGAP1) as a function of drug treatment",
                                "**Statistical Analysis.**",
                                "For animal studies, a 5% ANOVA test of no differences in means based on a sample of 8 per group has 82% (81%) power to detect a moderate effect size of 0.60 (0.63), where the effect size is given by the SD of the group means divided by the within group SD. Kaplan-Meier survival curves and log-rank tests is used to compare time to events. Repeated measures ANOVA are used to compare longitudinally measured in vivo growth parameters. Parametric or non-parametric ANOVA is used to compare tumor growth, immunochemistry and tissue measurements across groups at each time point. The mean number of lesions is compared across groups using ANOVA, treating the responses as Poisson counts. The extent of invasion and size of lesions are categorical responses and is compared across groups using chi-squared tests of homogeneity and logistic regression, respectively. Multiple lesions per site is handled using generalized estimating equations to give valid statistical tests that account for within-individual clustering. Tumor tissue measurements are summarized treated as for in vitro cell measurements.",
                                "**Results and Alternative Approaches**",
                                "The studies focus on the impact of identified small molecules on distinct mechanisms of metastasis in ovarian cancer (FIG. 7) and obtain detailed information adhesive events (cell:cell for MCAs or cell: mesothelium ex vivo and in vivo), invasion, growth and survival. Parallel experiments conducted in monolayer culture assess proliferation, apoptosis, migration, in vitro invasion and quantification of E-cadherin surface expression and endocytosis using techniques and approaches that are well documented in publications [121-125; 150; 151] to complement the findings obtained in 3D and organotypic models. Based on our preliminary findings, we predict that the R-enantiomers and NSC23776 will decrease MCA formation, cell migration and cell invasion because actin nucleation and polymerization are proximal targets for Rac1/Cdc42 through activation of effector molecules such as IQGAP & PAKs. However, MMPs are additionally required for invasion and COX activity is implicated in MMP expression [151] so 6MNA and the S-enantiomers may partially block invasive anchoring. We predict that the impact of small GTPase inhibition by NSC23766, R-naproxen or R-ketorolac will be most evident in the IP metastatic models where RacI and Cdc42 signaling play key roles in adhesive and actin-cytoskeleton-mediated events crucial to metastatic success (such as implantation and invasive lesions. The information on effective concentrations guides dose parameters for the future transition to Phase 1/2 clinical trials. If direct measurements of Rac1/Cdc42 activity in conjunction with effector activation reveal poor inhibition, we will adjust doses accordingly. While not all patient-based tumor cells will establish in short term culture or xenograft models, but with 60 cases/year the numbers are sufficient to validate the impact of the novel drugs on tumor-relevant endpoints. Promising results ex vivo and with tumor cell lines in vivo, will extend the studies to include IP xenograft studies using primary tumor cells from patients.",
                                "One concern is that S-ketorolac may cause gastrointestinal lesions in the course of the in vivo studies since these experiments will exceed the length of time recommended for human use of ketorolac. The GI toxicity in mice is dose dependent and low, but detectable at the proposed dose [23; 75]. Necropsy and histopathology are performed on any animals that succumb before conclusion of the tumor studies using services provided through the Cancer Center Animal Research Core. We do not anticipate problems with R-ketorolac because there is little interconversion between the R- and S-forms in rodents, and none detectable in humans [26]. Similarly, S-naproxen is not significantly subject to epimerization [29].",
                                "Because R-naproxen inhibits Rac1 and Cdc42, these studies will not clarify whether targeted inhibition of Rac1 or Cdc42 is more advantageous for antitumor activity in ovarian cancer. If antitumor activity is verified, follow up is with targeted knockdown of Rac1 or Cdc42 using Tet-inducible shRNA (ClonTech) or lentiviral approaches to compare the impact of targeting the GTPases singly or in combination. We recognize that as is true for all small molecules, the test compounds may have additional, as yet unidentified targets that could contribute to biologic response. By using positive controls for small GTPases (NSC23766, established Rac1 inhibitor), controls for response due to COX inhibition and incorporation of Rac1 or Cdc42 knockdown strategies we are able to address this possibility. In addition, a future goal is to test relevant small molecules in the TgMISIIR TAg mouse model of ovarian cancer to highlight potential impact on early disease."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "stain for markers using tumor microarrays",
                                "assess marker expression and localization",
                                "score staining by two pathologists",
                                "analyze protein expression levels and distribution",
                                "correlate with tumor stage and grade",
                                "evaluate PAK1/pPAK1, WAVE3, WASP and IQGAP1 protein expression",
                                "analyze as functions of Rac1 and/or Cdc42 activation",
                                "identify effectors with greatest correlation to GTPase activation status",
                                "determine if GTPase activation and specific downstream pathways are coordinately activated",
                                "test Rac1, Cdc42 and downstream effectors on tumor microarrays",
                                "correlate staining with predictors of adverse outcome and overall or disease-free survival",
                                "prepare additional arrays as needed",
                                "analyze clinical results statistically",
                                "use Pearson correlation to compare Rac1/Cdc42 staining intensity",
                                "use nonparametric Wilcoxon and Fisher's exact tests",
                                "calculate survival curves using the LIFETEST procedure",
                                "compare differences in survival using the Log-rank test",
                                "stratify using the Nottingham Prognostic Index",
                                "derive Cox proportional hazards and regression tree models",
                                "test the ability to distinguish patients with poor outcomes",
                                "calculate hazard ratios",
                                "predict regulators of ovarian tumor cell growth and metastasis",
                                "extend studies to include analysis of matched primary tissue and metastatic lesions",
                                "analyze IQGAP activation and nuclear beta-catenin",
                                "use RT QPCR as an alternate or in parallel to protein expression measures",
                                "establish essential relationships between GTPase activation and corresponding downstream pathways",
                                "identify pathways with greatest likelihood of response to GTPase targeted therapeutics",
                                "conduct chemical library screens to identify inhibitors and activators of small GTPases",
                                "screen the Prestwick chemical library of out-of-patent drugs",
                                "use virtual screening techniques to identify additional NSAIDs",
                                "perform additional similarity queries focused on a rotationally constrained carboxyl-substituted chiral center",
                                "identify R- and S-ketorolac as matching enantiomeric candidates",
                                "quantify differences in the inhibitory activities of the naproxen series against GTPases",
                                "conduct in vitro and cell-based assays to establish the mechanism of naproxen and ketorolac inhibition",
                                "monitor potential disruption of target interaction with GTPase regulatory and effector molecules",
                                "monitor drug-treated cells for in vivo inhibition of pathways downstream of Rac1 and Cdc42 activation",
                                "test compounds in a log dose range corresponding to therapeutically relevant concentrations",
                                "use a bead-based flow cytometry assay for measuring nucleotide binding",
                                "measure BODIPY-GTP/GDP binding to GSH-bead immobilized GST-Rac or GST-Cdc42",
                                "introduce pathway activation",
                                "expected results and alternatives",
                                "testing NSAIDs in preclinical models",
                                "describe R-naproxen and R-ketorolac",
                                "illustrate impact on biological processes",
                                "describe xenograft animal model",
                                "summarize results of R-naproxen treatment",
                                "describe additional research",
                                "introduce organotypic model",
                                "describe impact on ovarian tumor metastasis",
                                "describe R-naproxen and ketorolac on MCA formation",
                                "describe interference with ovarian tumor cell attachment",
                                "describe ex vivo studies",
                                "collect and verify tissue and ascites from patients",
                                "describe functional studies",
                                "measure proliferation and apoptosis",
                                "evaluate cell aggregation and MCA formation",
                                "describe organotypic cultures and 3DCI gels",
                                "measure adhesion and invasion",
                                "describe statistical analysis",
                                "introduce in vivo studies",
                                "describe GFP-expressing OVCA 429 and SKOV3ip cells",
                                "describe treatment procedures",
                                "describe dose of R-naproxen, S-naproxen, and 6-MNA",
                                "describe ketorolac dosing",
                                "describe NSC23766 administration",
                                "describe tumor analysis",
                                "estimate tumor growth",
                                "evaluate tumor burden",
                                "score metastatic disease",
                                "describe tumor tissue analysis",
                                "evaluate target enzyme inhibition",
                                "measure proliferation and apoptosis",
                                "describe statistical analysis",
                                "discuss results and alternative approaches",
                                "predict impact of small molecules on metastasis"
                            ],
                            "num_characters": 37907,
                            "outline_medium": [
                                "stain for markers using tumor microarrays",
                                "assess marker expression and localization",
                                "score staining by two pathologists",
                                "analyze protein expression levels and distribution",
                                "evaluate PAK1/pPAK1, WAVE3, WASP and IQGAP1 protein expression",
                                "identify effectors correlated to GTPase activation status",
                                "analyze GTPase activation and specific downstream pathways",
                                "identify markers linked to ovarian tumor stage or grade",
                                "test markers on tumor microarrays with linked patient outcome data",
                                "correlate staining with predictors of adverse outcome",
                                "analyze clinical results statistically",
                                "use Pearson correlation and Spearman correlation",
                                "use nonparametric Wilcoxon and Fisher's exact tests",
                                "calculate survival curves and compare differences",
                                "stratify using the Nottingham Prognostic Index",
                                "derive Cox proportional hazards and regression tree models",
                                "test the ability to distinguish patients with poor outcomes",
                                "calculate hazard ratios",
                                "identify pathways with greatest likelihood of response to GTPase targeted therapeutics",
                                "motivate pathway activation",
                                "describe expected results and alternatives",
                                "test NSAIDs in preclinical models",
                                "describe R-naproxen's impact on biological processes",
                                "describe additional research",
                                "study impact of small molecules on ovarian tumor metastasis",
                                "describe ex vivo studies",
                                "perform functional studies",
                                "describe statistical analysis",
                                "perform in vivo studies",
                                "analyze tumor growth and metastatic success",
                                "analyze tumor tissue",
                                "perform statistical analysis of tumor tissue",
                                "discuss results and alternative approaches",
                                "predict impact of small GTPase inhibition",
                                "discuss potential limitations and adjustments",
                                "discuss potential toxicity concerns",
                                "outline future goals"
                            ],
                            "outline_short": [
                                "stain for markers using tumor microarrays",
                                "assess marker expression and localization",
                                "score staining intensity and correlation with tumor parameters",
                                "analyze protein expression levels and distribution",
                                "evaluate effectors with respect to GTPase activation status",
                                "identify markers linked to ovarian tumor stage or grade",
                                "test markers on tumor microarrays with linked patient outcome data",
                                "correlate staining with predictors of adverse outcome",
                                "determine prognostic potential of activated GTPase markers",
                                "motivate pathway activation",
                                "describe testing of NSAIDs in preclinical models",
                                "outline additional research using organotypic models",
                                "summarize ex vivo studies on patient-derived tumor cells",
                                "describe functional studies on cell response to test compounds",
                                "outline statistical analysis for in vitro and in vivo studies",
                                "describe in vivo studies using xenograft models",
                                "summarize tumor analysis and tissue analysis",
                                "discuss results and alternative approaches"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define terms used throughout the specification",
                        "explain range of values",
                        "describe singular forms",
                        "define patient or subject",
                        "define effective",
                        "define compound",
                        "define bioactive agent",
                        "define treat, treating, and treatment",
                        "describe prophylactic and therapeutic treatment",
                        "define pharmaceutically acceptable",
                        "define inhibit",
                        "define prevention",
                        "define cancer",
                        "describe neoplasms",
                        "describe additional anti-cancer agent",
                        "list examples of additional anti-cancer agents",
                        "define alkyl",
                        "describe substituted alkyl groups",
                        "list examples of functional groups",
                        "describe lower alkyl groups",
                        "describe aryl",
                        "describe substituted aryl",
                        "describe acyl",
                        "describe halogen",
                        "describe amido",
                        "describe thioamido",
                        "describe cyano",
                        "describe nitro",
                        "describe alkynyl",
                        "describe azido",
                        "describe hydroxy",
                        "describe alkoxy",
                        "describe amino and other functional groups",
                        "define aryl",
                        "define substituted",
                        "define heteroaryl",
                        "define heterocyclic",
                        "define GTPase",
                        "describe Rho family of GTPases",
                        "describe Rac1",
                        "describe Cdc42",
                        "describe RhoA",
                        "describe GTPase in disease states",
                        "define Entamoeba",
                        "describe Entamoeba histolytica",
                        "describe additional anti-entamoeba agents",
                        "define Acanthamoeba spp.",
                        "define co-administration",
                        "describe pharmaceutical compositions",
                        "describe pharmaceutically acceptable salts",
                        "describe acid addition salts",
                        "describe base addition salts",
                        "describe modulation of GTPase",
                        "describe treatment of diseases",
                        "describe dosages and routes of administration",
                        "describe formulations",
                        "describe pharmaceutical carriers",
                        "describe liquid compositions",
                        "describe solid preparations",
                        "describe injectable compositions"
                    ],
                    "num_characters": 30255,
                    "outline_medium": [
                        "define terms used throughout the specification",
                        "explain range of values and intervening values",
                        "define technical and scientific terms",
                        "explain use of singular forms",
                        "define \"patient\" or \"subject\"",
                        "define \"effective\"",
                        "define \"compound\"",
                        "define \"bioactive agent\"",
                        "define \"treat\", \"treating\", and \"treatment\"",
                        "explain prophylactic and therapeutic treatment",
                        "define \"pharmaceutically acceptable\"",
                        "define \"inhibit\"",
                        "define \"prevention\"",
                        "define \"cancer\"",
                        "define \"additional anti-cancer agent\"",
                        "define \"alkyl\" and \"substituted\"",
                        "define aryl and heteroaryl terms",
                        "define substituted aryl and heteroaryl terms",
                        "define heterocyclic and heteroaryl terms",
                        "describe GTPase and its role in diseases",
                        "describe Entamoeba and its role in diseases",
                        "define co-administration and adjunct therapy",
                        "describe pharmaceutical compositions and their uses",
                        "describe pharmaceutically acceptable salts",
                        "describe methods of modulating GTPase",
                        "describe treatment of diseases and conditions",
                        "describe dosages and routes of administration",
                        "describe formulations and pharmaceutical carriers",
                        "describe preparation of dosage forms"
                    ],
                    "outline_short": [
                        "define terms used throughout the specification",
                        "describe range of values and their interpretation",
                        "explain singular and plural forms of terms",
                        "define specific terms, including \"patient\", \"effective\", \"compound\", \"bioactive agent\", \"treat\", \"pharmaceutically acceptable\",",
                        "define terms related to cancer, including \"cancer\", \"neoplasms\", \"neoplasias\", and \"additional anti-cancer agent",
                        "provide examples of anti-cancer agents",
                        "define \"alkyl\" and \"substituted\" as they relate to alkyl groups",
                        "provide additional definitions and explanations of terms",
                        "define terms related to aryl and heteroaryl groups",
                        "define terms related to GTPase and its role in disease states",
                        "define terms related to Entamoeba and Acanthamoeba",
                        "describe co-administration and pharmaceutical compositions",
                        "describe pharmaceutically acceptable salts and dosage forms",
                        "describe methods of treatment and administration"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The experimental studies described herein represent the first efforts to investigate the potential of Rac1 and Cdc42 as therapeutic targets in metastatic ovarian cancer. The compounds identified, among others described, are FDA approved as the racemic mixture. Therefore, proof of concept that therapeutic targeting of Rac1 and/or Cdc42 confers anti-tumor benefit for ovarian cancer in vivo offer the potential for rapid clinical translation. An observational report notes that presurgical administration of R,S-ketorolac reduced cancer recurrence rates in breast cancer patients [152]. Thus, suggesting even short-term adminstration of racemic mixtures are of benefit. Establishing the R-enantiomers as drugs with novel targets combined with the possibility of obtaining R-enantiomer pure compounds for clinical studies through the NCI's Experimental Therapeutics (NExT) program will open new opportunities for drug development in a disease with limited options."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce therapeutic targets"
                    ],
                    "num_characters": 963,
                    "outline_medium": [
                        "introduce therapeutic targets"
                    ],
                    "outline_short": [
                        "introduce therapeutic targets"
                    ]
                }
            ],
            "outline_long": [
                "claim priority from provisional application"
            ],
            "num_characters": 262,
            "outline_medium": [
                "claim priority from provisional application"
            ],
            "outline_short": [
                "claim priority from provisional application"
            ]
        }
    ],
    "claims": [
        "1-42. (canceled)",
        "43. A method of modulating GTPase in a human patient with a cancer selected from the group consisting of breast cancer, colorectal cancer, lung cancer, head and neck cancer, kidney cancer, prostate cancer and glioblastoma, the method comprising administering to said patient or subject an anti-cancer effective amount of a composition consisting essentially of R-ketorolac as an enantiomerically pure individual optical isomer, or a pharmaceutically acceptable salt thereof.",
        "44. A method of treating cancer in a human patient in need, said cancer being selected from the group consisting of breast cancer, colorectal cancer, lung cancer, head and neck cancer, kidney cancer, prostate cancer and glioblastoma, the method comprising administering to said patient or subject an anti-cancer effective amount of a composition consisting essentially of R-ketorolac as an enantiomerically pure individual optical isomer, or a pharmaceutically acceptable salt thereof.",
        "45. The method according to claim 44 wherein said cancer is breast cancer.",
        "46. The method according to claim 44 wherein said cancer is metastatic.",
        "47. The method according to claim 45 wherein said cancer is metastatic.",
        "48. The method according to claim 44 wherein said cancer is recurrent.",
        "49. The method according to claim 45 wherein said cancer is recurrent.",
        "50. The method according to claim 44 wherein said composition is in oral dosage form.",
        "51. The method according to claim 44 wherein said composition is in parenteral dosage form.",
        "52. The method according to claim 44 wherein said composition is coadministered in combination with an additional anti-cancer agent.",
        "53. The method according to claim 45 wherein said composition is coadministered in combination with an additional anti-cancer agent.",
        "54. The method according to claim 44 wherein said R-keterolac is administererd in combination with an additional anticancer agent selected from the group consisting of everolimus, trabectedin, abraxane, TLK 286, AV-299, DN-101, pazopanib, GSK690693, RTA 744, ON 0910.Na, AZD 6244 (ARRY-142886), AMN-107, TKI-258, GSK461364, AZD 1152, enzastaurin, vandetanib, ARQ-197, MK-0457, MLN8054, PHA-739358, R-763, AT-9263, a FLT-3 inhibitor, a VEGFR inhibitor, an EGFR TK inhibitor, an aurora kinase inhibitor, a PIK-1 modulator, a Bcl-2 inhibitor, an HDAC inhbitor, a c-MET inhibitor, a PARP inhibitor, a Cdk inhibitor, an EGFR TK inhibitor, an IGFR-TK inhibitor, an anti-HGF antibody, a PI3 kinase inhibitors, an AKT inhibitor, a JAK/STAT inhibitor, a checkpoint-1 or 2 inhibitor, a focal adhesion kinase inhibitor, a Map kinase kinase (mek) inhibitor, a VEGF trap antibody, pemetrexed, erlotinib, dasatanib, nilotinib, decatanib, panitumumab, amrubicin, oregovomab, Lep-etu, nolatrexed, azd2171, batabulin, ofatumumab, zanolimumab, edotecarin, tetrandrine, rubitecan, tesmilifene, oblimersen, ticilimumab, ipilimumab, gossypol, Bio 111, 131-I-TM-601, ALT-110, BIO 140, CC 8490, cilengitide, gimatecan, IL13-PE38QQR, INO 1001, IPdR1 KRX-0402, lucanthone, LY 317615, neuradiab, vitespan, Rta 744, Sdx 102, talampanel, atrasentan, Xr 311, romidepsin, ADS-100380, sunitinib, 5-fluorouracil, vorinostat, etoposide, gemcitabine, doxorubicin, irinotecan, liposomal doxorubicin, 5′-deoxy-5-fluorouridine, vincristine, temozolomide, ZK-304709, seliciclib; PD0325901, AZD-6244, capecitabine, L-Glutamic acid, N-[4-[2-(2-amino-4,7-dihydro-4-oxo-1H -pyrrolo[2,3-d]pyrimidin-5-yl)ethyl]benzoyl]-, disodium salt, heptahydrate, camptothecin, PEG-labeled irinotecan, tamoxifen, toremifene citrate, anastrazole, exemestane, letrozole, DES(diethylstilbestrol), estradiol, estrogen, conjugated estrogen, bevacizumab, IMC-1C11, CHIR-258,); 3-[5-(methylsulfonylpiperadinemethyl)-indolylj-quinolone, vatalanib, AG-013736, AVE-0005, the acetate salt of [D-Ser(Bu t) 6, Azgly 10](pyro-Glu-His-Trp-Ser-Tyr-D-Ser(Bu t)-Leu-Arg-Pro-Azgly-NH2 acetate [C59H84N18Oi4-(C2H4O2)x where x=1 to 2.4], goserelin acetate, leuprolide acetate, triptorelin pamoate, medroxyprogesterone acetate, hydroxyprogesterone caproate, megestrol acetate, raloxifene, bicalutamide, flutamide, nilutamide, megestrol acetate, CP-724714; TAK-165, HKI-272, erlotinib, lapatanib, canertinib, ABX-EGF antibody, erbitux, EKB-569, PKI-166, GW-572016, Ionafarnib, BMS-214662, tipifarnib; amifostine, NVP-LAQ824, suberoyl analide hydroxamic acid, valproic acid, trichostatin A, FK-228, SU11248, sorafenib, KRN951, aminoglutethimide, arnsacrine, anagrelide, L-asparaginase, Bacillus Calmette-Guerin (BCG) vaccine, bleomycin, buserelin, busulfan, carboplatin, carmustine, chlorambucil, cisplatin, cladribine, clodronate, cyproterone, cytarabine, dacarbazine, dactinomycin, daunorubicin, diethylstilbestrol, epirubicin, fludarabine, fludrocortisone, fluoxymesterone, flutamide, gemcitabine, gleevac, hydroxyurea, idarubicin, ifosfamide, imatinib, leuprolide, levamisole, lomustine, mechlorethamine, melphalan, 6-mercaptopurine, mesna, methotrexate, mitomycin, mitotane, mitoxantrone, nilutamide, octreotide, oxaliplatin, pamidronate, pentostatin, plicamycin, porfimer, procarbazine, raltitrexed, rituximab, streptozocin, teniposide, testosterone, thalidomide, thioguanine, thiotepa, tretinoin, vindesine, 13-cis-retinoic acid, phenylalanine mustard, uracil mustard, estramustine, altretamine, floxuridine, 5-deooxyuridine, cytosine arabinoside, 6-mecaptopurine, deoxycoformycin, calcitriol, valrubicin, mithramycin, vinblastine, vinorelbine, topotecan, razoxin, marimastat, COL-3, neovastat, BMS-275291, squalamine, endostatin, SU5416, SU6668, EMD121974, interleukin-12, IM862, angiostatin, vitaxin, droloxifene, idoxyfene, spironolactone, finasteride, cimitidine, trastuzumab, denileukin diftitox,gefitinib, bortezimib, paclitaxel, irinotecan, topotecan, doxorubicin, docetaxel, vinorelbine, bevacizumab (monoclonal antibody) and erbitux, cremophor-free paclitaxel, epithilone B, BMS-247550, BMS-310705, droloxifene, 4-hydroxytamoxifen, pipendoxifene, ERA-923, arzoxifene, fulvestrant, acolbifene, lasofoxifene, idoxifene, TSE-424, HMR-3339, ZK186619, PTK787/ZK 222584, VX-745, PD 184352, rapamycin, 40-O-(2-hydroxyethyl)-rapamycin, temsirolimus, AP-23573, RAD001, ABT-578, BC-210, LY294002, LY292223, LY292696, LY293684, LY293646, wortmannin, ZM336372, L-779,450, PEG-filgrastim, darbepoetin, erythropoietin, granulocyte colony-stimulating factor, zolendronate, prednisone, cetuximab, granulocyte macrophage colony-stimulating factor, histrelin, pegylated interferon alfa-2a, interferon alfa-2a, pegylated interferon alfa-2b, interferon alfa-2b, azacitidine, PEG-L-asparaginase, lenalidomide, gemtuzumab, hydrocortisone, interleukin-11, dexrazoxane, alemtuzumab, all-transretinoic acid, ketoconazole, interleukin-2, megestrol, immune globulin, nitrogen mustard, methylprednisolone, ibritgumomab tiuxetan, androgens, decitabine, hexamethylmelamine, bexarotene, tositumomab, arsenic trioxide, cortisone, editronate, mitotane, cyclosporine, liposomal daunorubicin, Edwina-asparaginase, strontium 89, casopitant, netupitant, an NK-1 receptor antagonists, palonosetron, aprepitant, diphenhydramine, hydroxyzine, metocloprarnide, lorazepam, alprazolam, haloperidol, droperidol, dronabinol, dexamethasone, methylprednisolone, prochlorperazine, granisetron, ondansetron, dolasetron, tropisetron, pegfilgrastim, erythropoietin, epoetin alfa, darbepoetin alfa and mixtures thereof.",
        "55. The method according to claim 46 wherein said R-ketorolaci is administered in combination with an additional anticancer agent selected from the group consisting of everolimus, trabectedin, abraxane, TLK 286, AV-299, DN-101, pazopanib, GSK690693, RTA 744, ON 0910.Na, AZD 6244 (ARRY-142886), AMN-107, TKI-258, GSK461364, AZD 1152, enzastaurin, vandetanib, ARQ-197, MK-0457, MLN8054, PHA-739358, R-763, AT-9263, a FLT-3 inhibitor, a VEGFR inhibitor, an EGFR TK inhibitor, an aurora kinase inhibitor, a PIK-1 modulator, a Bcl-2 inhibitor, an HDAC inhbitor, a c-MET inhibitor, a PARP inhibitor, a Cdk inhibitor, an EGFR TK inhibitor, an IGFR-TK inhibitor, an anti-HGF antibody, a PI3 kinase inhibitors, an AKT inhibitor, a JAK/STAT inhibitor, a checkpoint-1 or 2 inhibitor, a focal adhesion kinase inhibitor, a Map kinase kinase (mek) inhibitor, a VEGF trap antibody, pemetrexed, erlotinib, dasatanib, nilotinib, decatanib, panitumumab, amrubicin, oregovomab, Lep-etu, nolatrexed, azd2171, batabulin, ofatumumab, zanolimumab, edotecarin, tetrandrine, rubitecan, tesmilifene, oblimersen, ticilimumab, ipilimumab, gossypol, Bio 111, 131-I-TM-601, ALT-110, BIO 140, CC 8490, cilengitide, gimatecan, IL13-PE38QQR, INO 1001, IPdR1 KRX-0402, lucanthone, LY 317615, neuradiab, vitespan, Rta 744, Sdx 102, talampanel, atrasentan, Xr 311, romidepsin, ADS-100380, sunitinib, 5-fluorouracil, vorinostat, etoposide, gemcitabine, doxorubicin, irinotecan, liposomal doxorubicin, 5′-deoxy-5-fluorouridine, vincristine, temozolomide, ZK-304709, seliciclib; PD0325901, AZD-6244, capecitabine, L-Glutamic acid, N-[4-[2-(2-amino-4,7-dihydro-4-oxo-1H-pyrrolo[2,3-d]pyrimidin-5-yl)ethyl]benzoyl]-, disodium salt, heptahydrate, camptothecin, PEG-labeled irinotecan, tamoxifen, toremifene citrate, anastrazole, exemestane, letrozole, DES(diethylstilbestrol), estradiol, estrogen, conjugated estrogen, bevacizumab, IMC-1C11, CHIR-258,); 3-[5-(methylsulfonylpiperadinemethyl)-indolylj-quinolone, vatalanib, AG-013736, AVE-0005, the acetate salt of [D-Ser(Bu t) 6, Azgly 10] (pyro-Glu-His-Trp-Ser-Tyr-D-Ser(Bu t)-Leu-Arg-Pro-Azgly-NH2 acetate [C59H84N18Oi4-(C2H4O2)x where x=1 to 2.4], goserelin acetate, leuprolide acetate, triptorelin pamoate, medroxyprogesterone acetate, hydroxyprogesterone caproate, megestrol acetate, raloxifene, bicalutamide, flutamide, nilutamide, megestrol acetate, CP-724714; TAK-165, HKI-272, erlotinib, lapatanib, canertinib, ABX-EGF antibody, erbitux, EKB-569, PKI-166, GW-572016, Ionafarnib, BMS-214662, tipifamib; amifostine, NVP-LAQ824, suberoyl analide hydroxamic acid, valproic acid, trichostatin A, FK-228, SU11248, sorafenib, KRN951, aminoglutethimide, arnsacrine, anagrelide, L-asparaginase, Bacillus Calmette-Guerin (BCG) vaccine, bleomycin, buserelin, busulfan, carboplatin, carmustine, chlorambucil, cisplatin, cladribine, clodronate, cyproterone, cytarabine, dacarbazine, dactinomycin, daunorubicin, diethylstilbestrol, epirubicin, fludarabine, fludrocortisone, fluoxymesterone, flutamide, gemcitabine, gleevac, hydroxyurea, idarubicin, ifosfamide, imatinib, leuprolide, levamisole, lomustine, mechlorethamine, melphalan, 6-mercaptopurine, mesna, methotrexate, mitomycin, mitotane, mitoxantrone, nilutamide, octreotide, oxaliplatin, pamidronate, pentostatin, plicamycin, porfimer, procarbazine, raltitrexed, rituximab, streptozocin, teniposide, testosterone, thalidomide, thioguanine, thiotepa, tretinoin, vindesine, 13-cis-retinoic acid, phenylalanine mustard, uracil mustard, estramustine, altretamine, floxuridine, 5-deooxyuridine, cytosine arabinoside, 6-mecaptopurine, deoxycoformycin, calcitriol, vairubicin, mithramycin, vinblastine, vinorelbine, topotecan, razoxin, marimastat, COL-3, neovastat, BMS-275291, squalamine, endostatin, SU5416, SU6668, EMD121974, interleukin-12, IM862, angiostatin, vitaxin, droloxifene, idoxyfene, spironolactone, finasteride, cimitidine, trastuzumab, denileukin diftitox,gefitinib, bortezimib, paclitaxel, irinotecan, topotecan, doxorubicin, docetaxel, vinorelbine, bevacizumab (monoclonal antibody) and erbitux, cremophor-free paclitaxel, epithilone B, BMS-247550, BMS-310705, droloxifene, 4-hydroxytamoxifen, pipendoxifene, ERA-923, arzoxifene, fulvestrant, acolbifene, lasofoxifene, idoxifene, TSE-424, HMR-3339, ZK186619, PTK787/ZK 222584, VX-745, PD 184352, rapamycin, 40-0-(2-hydroxyethyl)-rapamycin, temsirolimus, AP-23573, RAD001, ABT-578, BC-210, LY294002, LY292223, LY292696, LY293684, LY293646, wortmannin, ZM336372, L-779,450, PEG-filgrastim, darbepoetin, erythropoietin, granulocyte colony-stimulating factor, zolendronate, prednisone, cetuximab, granulocyte macrophage colony-stimulating factor, histrelin, pegylated interferon alfa-2a, interferon alfa-2a, pegylated interferon alfa-2b, interferon alfa-2b, azacitidine, PEG-L-asparaginase, lenalidomide, gemtuzumab, hydrocortisone, interleukin-11, dexrazoxane, alemtuzumab, all-transretinoic acid, ketoconazole, interleukin-2, megestrol, immune globulin, nitrogen mustard, methylprednisolone, ibritgumomab tiuxetan, androgens, decitabine, hexamethylmelamine, bexarotene, tositumomab, arsenic trioxide, cortisone, editronate, mitotane, cyclosporine, liposomal daunorubicin, Edwina-asparaginase, strontium 89, casopitant, netupitant, an NK-1 receptor antagonists, palonosetron, aprepitant, diphenhydramine, hydroxyzine, metoclopramide, lorazepam, alprazolam, haloperidol, droperidol, dronabinol, dexamethasone, methylprednisolone, prochlorperazine, granisetron, ondansetron, dolasetron, tropisetron, pegfilgrastim, erythropoietin, epoetin alfa, darbepoetin alfa and mixtures thereof.",
        "56. The method according to claim 52 wherein said additional anticancer agent is carboplatin, cisplastin, docetaxel, paclitaxel, capecitabine, vinorelbine, gemcitabine, mitoxantrone, doxorubicin or a mixture thereof.",
        "57. The method according to claim 53 wherein said additional anticancer agent is carboplatin, cisplastin, docetaxel, paclitaxel, capecitabine, vinorelbine, gemcitabine, mitoxantrone, doxorubicin or a mixture thereof."
    ]
}