{
    "id": "US20110086402",
    "authors": [
        "Charles Abbas",
        "Kostyantyn Dmytruk",
        "Olena Dmytruk",
        "Andriy Sibirny",
        "Andriy Y. Voronovsky"
    ],
    "title": "ENGINEERING OF XYLOSE REDUCTASE AND OVEREXPRESSION OF XYLITOL DEHYDROGENASE AND XYLULOKINASE IMPROVES XYLOSE ALCOHOLIC FERMENTATION IN THE THERMOTOLERANT YEAST HANSENULA POLYMORPHA",
    "date": "2009-06-01 00:00:00",
    "abstract": "Recombinant genetic constructs and strains of H. polymorpha having significantly increased ethanol productivity with a simultaneous decreased production of xylitol during high-temperature xylose fermentation are disclosed. The constructs include a H. polymorpha XYL1 gene encoding xylose reductase mutated to decrease affinity of the enzyme toward NADPH. The modified version of XYL1 gene under control of a strong constitutive HpGAP promoter was overexpressed in a Δxyll background. A recombinant H. polymorpha strain overexpressing the mutated enzyme together with native xylitol dehydrogenase and xylulokinase in the Δxyll background was also constructed. Xylose consumption, ethanol and xylitol production by the constructed strain were evaluated during high-temperature xylose fermentation (48° C.). A significant increase in ethanol productivity (up to 7.4 times) was shown in the recombinant strain as compared with the wild type strain. Moreover, the xylitol production by the recombinant strain was reduced considerably: 0.9 mgχ (Lχh)−1 versus 4.2 mgχ (Lxh)−1 by the wild type strain.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "This application claims priority to U.S. provisional application No. 61/057,515 filed May 30, 2008, which is incorporated by reference in its entirety, including all references cited therein (repeated herein) to the extent such references aid in understanding the invention or in obtaining the materials and methods that would facilitate the practice of the invention. If the content of a cited reference conflicts with teaching of the present application, the present application shall be deemed the controlling understanding."
            ],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "This application relates to the field of cellulosic ethanol production by fermentation, particularly to fermentation of xylose containing sources, more particularly to recombinant H. polymorpha strains useful for the production of ethanol by fermentation of xylose, and still more particularly to strains of H. polymorpha that overexpress a mutant H. polymorpha xylose reductase having altered affinity for NADPH together with either endogenous or recombinant xylose dehydrogenase and xylulokinase, that achieve enhanced ethanol production by fermentation on xylose containing media."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to cellulosic ethanol production by fermentation"
                    ],
                    "num_characters": 583,
                    "outline_medium": [
                        "relate to cellulosic ethanol production by fermentation"
                    ],
                    "outline_short": [
                        "relate to cellulosic ethanol production by fermentation"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Ethanol produced from lignocellulosics is an environmentally friendly alternative to fossil fuels. As a substantial fraction of lignocellulose material consists of xylose, it is necessary to ferment efficiently xylose to ethanol to make the process cost-effective [1].",
                        "Some yeasts, filamentous fungi and bacteria are able to convert xylose to ethanol. Yeasts and most of other fungi first reduce xylose to xylitol using xylose reductase, which strongly prefers NADPH as coenzyme, EC 1.1.1.21 (XR). Then they oxidize xylitol to xylulose with strictly NAD-dependent xylitol dehydrogenase, EC 1.1.1.9 (XDH) [2]. The difference in cofactor specificity results in redox imbalance that leads to decreasing ethanol production and accumulation of xylitol [3, 4, 5, 6, 7, 8]. The xylitol production has been reduced by metabolic engineering directed to optimize the expression levels of XR and XDH [9, 10, 11, 12], change the cofactor specificity of XR from NADPH to NADH [13, 13a], or modify the redox metabolism of the host cell [14, 15, 16]. The other used approach to bypass redox imbalance during xylose fermentation was based on expression of fungal or bacterial xylose isomerase, EC 5.3.1.5 (XI) which converts xylose directly to xylulose and does not require redox cofactors [17, 18]",
                        "The additional overexpression of xylulokinase, EC 2.7.1.17 (XK) (the third enzyme in the xylose metabolism) that converts xylulose to xylulose-5-phosphate, which enters the pentose phosphate pathway and then into the central metabolism, has been shown to enhance both aerobic and anaerobic xylose utilization in XR-XDH- as well as XI carrying strains [12, 19]. Overexpression of XK is necessary to overcome the naturally low expression level of this enzyme [3, 5]. The overexpression resulted in more efficient conversion of xylose to ethanol [5, 20].",
                        "The thermotolerant methylotrophic yeast Hansenula polymorpha is capable of alcoholic fermentation of xylose at elevated temperatures (45-48° C.) [21, 22, 23]. This property of H. polymorpha makes it a good candidate for use in an efficient process of simultaneous saccharification and fermentation (SSF). SSF combines enzymatic hydrolysis of lignocellulosic material with subsequent fermentation of released sugars in the same vessel. Major advantages of exploring the utility of H. polymorpha for ethanol production from cellulosic material using are this yeast has (i) well developed methods of molecular genetics and (ii) the availability of a whole genome sequence for a model strain CBS4732 [24; 25]."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate ethanol production from lignocellulosics",
                        "describe xylose fermentation by yeasts and fungi",
                        "explain redox imbalance in xylose fermentation",
                        "summarize approaches to optimize xylose fermentation",
                        "highlight advantages of H. polymorpha for ethanol production"
                    ],
                    "num_characters": 2543,
                    "outline_medium": [
                        "motivate ethanol production from lignocellulosics",
                        "describe limitations of xylose fermentation"
                    ],
                    "outline_short": [
                        "motivate xylose fermentation for ethanol production"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "The present disclosure describes the construction of recombinant H. polymorpha strains that overexpress a modified XR (K341R N343D) together with native XDH and XK on the Δxyl1 background. Xylose consumption, ethanol and xylitol production of the strain in comparison with those of strains overexpressing the native XR, XDH and XK are presented for comparison to demonstrate that overexpression of the altered XR enzyme enhances ethanol yield when the H. polymorpha strain is grown on media containing xylose. Related recombinant nucleic acids, the mutant enzyme, and methods of using the same for ethanol fermentation on xylose are also disclosed herein."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe recombinant H. polymorpha strains for ethanol fermentation"
                    ],
                    "num_characters": 655,
                    "outline_medium": [
                        "describe recombinant H. polymorpha strains for ethanol production"
                    ],
                    "outline_short": [
                        "describe recombinant H. polymorpha strains for ethanol fermentation"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF METHODS, STRAINS, AND RESULTS",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Strains and Media",
                            "paragraphs": [
                                "Yeast strains H. polymorpha CBS4732s (leu2-2) [26], Δxyl1 [22] and transformants (Table 1) were grown on YPD (0.5% yeast extract, 1% peptone, 2% glucose) or minimal medium (0.67% YNB without amino acids, 4% xylose or 2% glucose) at 37° C. For the CBS4732s strain leucine (40 mg L−1) was supplemented into the medium. For selection of yeast transformants on YPD, 130-150 mg L−1 of zeocin or 0.5-0.6 mg L−1of G418 were added.",
                                "The E. coli DH5α strain (Φ80dlacZΔM15, recA1, endA1,gyrA96, thi-1, hsdR17(rK−, mK+), supE44, relA1,deoR, Δ(lacZYA-argF)U169) was used as a host for propagation of plasmids. The strain DH5α was grown at 37° C. in LB medium as described previously [27]. Transformed E. coli cells were maintained on a medium containing 100 mg L−1 of ampicillin."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe yeast strains and media used"
                            ],
                            "num_characters": 767,
                            "outline_medium": [
                                "describe yeast strains and media used"
                            ],
                            "outline_short": [
                                "describe yeast strains and media used"
                            ]
                        },
                        {
                            "title": "Molecular-Biology Techniques",
                            "paragraphs": [
                                "Standard cloning techniques were applied [27]. Genomic DNA of H. polymorpha was isolated using the Wizard® Genomic DNA Purification Kit (Promega, Madison, Wis., USA). Restriction endonucleases and DNA ligase (Fermentas, Vilnius, Lithuania) were used according to the manufacturer specifications. Plasmid isolation from E. coli was performed with the Wizard® Plus SV Minipreps DNA Purification System (Promega, Madison, Wis., USA). PCR-amplification of the fragments of interest was done with Platinum® Taq DNA Polymerase High Fidelity (Invitrogen, Carlsbad, Calif., USA) according to the manufacturer specification. PCRs were performed in GeneAmp® PCR System 9700 thermocycler (Applied Biosystems, Foster City, Calif., USA). Transformation of the yeast H. polymorpha by electroporation was carried out as described previously [28]."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe standard cloning techniques"
                            ],
                            "num_characters": 831,
                            "outline_medium": [
                                "describe standard cloning techniques"
                            ],
                            "outline_short": [
                                "describe standard cloning techniques"
                            ]
                        },
                        {
                            "title": "Plasmid Construction",
                            "paragraphs": [
                                "Recombinant plasmids pX1N-Z and pX1M-Z bearing native and modified version of XR, respectively, were constructed on the basis of the plasmid pUC57 (Fermentas, Vilnius, Lithuania). BamHI/SacI fragment with the HpGAP promoter and HpAOX terminator from the plasmid pKO8-GAPpr [22] was cloned into the BamHI-SacI digested plasmid pUC57 with preliminary eliminated restriction sites NdeI and HindIII. In the resulting plasmid restriction sites NdeI and NotI located between the HpGAP promoter and HpAOX terminator were removed and the unique HindIII site arose. The ORF of XYL1 was PCR-amplified from genomic DNA of CBS4732 using pair of primers HpX1 for (CCC AAG CTT ATG CAC ACG CAG ATT AGC AAA AAT CTT G) and HpX1 rev (CGC AAG CTT TTA GAT AAA GGT TGG AAT TTC GTT CCA GGT CC) and cloned into the HindIII site to create expression cassette prGAP-XYL1-trAOX (restriction sites are underlined in all primers). Modification of XR gene was performed via the overlap PCR. The pairs of primers HpX1M for (CAT CTT GGT CAT TCC AAG GTC CGA CCA AAA GGA GAG ACT G) and HpX1Mrev (CAG TCT CTC CTT TTG GTC GGA CCT TGG AAT GAC CAA GAT G) were used to produce K341→R and N343→D substitutions in resulting modified XR (mismatched bases for the mutation are shown in bold). Primers HpX1 for and HpX1 rev were used for cloning of modified version of XR gene as described above for the native gene. The yeast selective marker conferring resistance to zeocin was PCR-amplified from the plasmid pPICZB (Invitrogen) using pair of primers Ko58 (CGG GGT ACC TG CAG ATA ACT TCG TAT AGC ATA C) and Ko59 (CGG GGT ACC TG CAG TAA TTC GCT TCG GAT AAC) and cloned into the PstI linearzed vectors creating pX1N-Z or pX1M-Z (FIG. 1).",
                                "The H. polymorpha XYL2 gene with own terminator and the HpGAP promoter were amplified from the genomic DNA of CBS4732 using the corresponding pairs of primers L1 (CTC GGA TCC CAA TTA TCA TTA ATA ATC)/Ko135 (CAG CAG AAG GAT TGT TCA TTT TGT TTC TAT ATT ATC) and Ko134 (GAT AAT ATA GAA ACA AAA TGA ACA ATC CTT CTG CTG)/Ko133 (ACA GGA TCC ATC CAT GAG AAA CG). Primers L1 and Ko133 were used for obtaining the fragment containing the XYL2 gene with own terminator driven with the HpGAP promoter by the overlap PCR. This fragment was cloned into the BamHI linearized plasmids pX1N-Z i pX1M-Z, resulting in the recombinant constructs pX1N-Z-X2 and pX1M-Z-X2, respectively (FIG. 1).",
                                "The expression cassette containing prGAP-XYL3-trAOX was obtained as SacIl restriction fragment from the plasmid pKO8/GAP/HpXYL3 [23] and cloned into the Sacll linearized plasmids pGLG61 [29]. The resulting plasmid was designated pGLG61/HpXYL3 (FIG. 1). The accuracy of constructed plasmids was verified by sequencing. Constructed plasmids are presented in Table 1."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "construct plasmids pX1N-Z and pX1M-Z",
                                "modify XR gene via overlap PCR",
                                "clone yeast selective marker into vectors",
                                "construct plasmids pX1N-Z-X2 and pX1M-Z-X2",
                                "verify constructed plasmids by sequencing"
                            ],
                            "num_characters": 2736,
                            "outline_medium": [
                                "construct recombinant plasmids pX1N-Z and pX1M-Z",
                                "describe modification of XR gene"
                            ],
                            "outline_short": [
                                "describe construction of recombinant plasmids"
                            ]
                        },
                        {
                            "title": "Biochemical Methods",
                            "paragraphs": [
                                "The XR activity in cell extracts was determined spectrophotometrically at 37° C. The XR assay mixture contained: Tris-HC1 buffer (pH 7.0) 100 mM, NADPH 0.15 mM and xylose 350 mM. The reaction was started with cell extract addition [3]. To evaluate KM towards NADPH or NADH the XR activities were measured with four different concentrations of cofactors 20, 50, 100 and 150 μM (each in triplicate).",
                                "The XDH activity in cell extracts was determined spectrophotometrically at 37° C. The XDH assay mixture contained: Tris-HCl buffer (pH 8.8) 100 mM, MgCl2 10 mM, NAD 3 mM and xylitol 300 mM. The reaction was started with cell extract addition [3].",
                                "The XK activity in cell extracts was determined spectrophotometrically at 37° C. as was described before [30], with some modifications. The XK assay mixture contained: Tris-HCl buffer (pH 7.8) 50 mM, MgCl2 5 mM, NADH 0.2 mM, phosphoenolpyruvate 1 mM, D-xylulose 8.5 mM, lactate dehydrogenase (EC 1.1.1.27) (Fluka, St. Louis, Mo., USA) 10 U, pyruvate kinase (EC 2.7.1.40) (Fluka, St. Louis, Mo., USA) 0.05 U, and ATP 2 mM. The reaction was started with addition of cell extract. For the XK assay, another blank without pyruvate kinase and lactate dehydrogenase was used to minimize the interference of XDH activity in H. polymorpha.",
                                "All assay experiments were repeated at least twice."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe XR and XDH activity assays",
                                "describe XK activity assay"
                            ],
                            "num_characters": 1331,
                            "outline_medium": [
                                "describe XR, XDH, and XK activity assays"
                            ],
                            "outline_short": [
                                "describe biochemical assays for XR, XDH, and XK activities"
                            ]
                        },
                        {
                            "title": "Analyses",
                            "paragraphs": [
                                "Cells of transformants were grown in the rich YPX medium (1% yeast extract, 2% peptone, 4% xylose) during 2 days and inoculated into the YNB medium with 12% xylose. Fermentation was carried out at the temperature of 48° C. with limited aeration (140 revolutions×min−1). Concentrations of ethanol in medium were determined using alcohol oxidase/peroxidase-based enzymatic kit “Alcotest” [31]. Concentrations of xylitol in medium were determined enzymaticaly as described earlier (Enzymatic determination of D-sorbitol and xylitol, R-Biopharm GmbH, Darmstadt, Germany) with slight modifications. Nitrotetrazolium Blue (NTB) 12 mM and phenazine methosulfate 15 mM were used instead iodonitrotetrazolium chloride and diaphorase, respectively. The absorbance of the reduced NTB was measured at 570 nm. Concentrations of xylose from fermentation in mineral medium were analyzed by chemical method as was described before [32].",
                                "Experiments were performed at least twice."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe fermentation experiments and analyses"
                            ],
                            "num_characters": 964,
                            "outline_medium": [
                                "describe fermentation and analytical methods"
                            ],
                            "outline_short": [
                                "describe fermentation experiments and analyses"
                            ]
                        },
                        {
                            "title": "Results",
                            "paragraphs": [
                                "**Engineering of XR**",
                                "To improve alcoholic fermentation of xylose and decrease xylitol formation, XR of H. polymorpha has been subjected to site-specific mutagenesis to reduce its affinity for NADPH. The amino acid sequence of the cofactor binding site of H. polymorpha XR (SEQ ID NO: 1) shows strict homology to the corresponding site of other xylose-utilizing yeasts (FIG. 2). In the present work the inventors substitute lysine and asparagine for arginine and aspartic acid at amino-acid positions 341 and 343, respectively to obtain a mutated H. polymorpha XR protein having the cofactor binding site of SEQ. ID NO: 2. These substitutions resemble those developed for successful modification of XR cofactor specificity in Candida tenuis [33].",
                                "**Strain Construction**",
                                "To generate strains with overexpression of native or modified versions of XR or strains with simultaneous overexpression of native or modified XR together with XDH, the H. polymorpha Δxyl1 [22] strain was transformed with SacI linearized plasmids pX1N-Z and pX1M-Z or pX1N-Z-X2 and pX1M-Z-X2, respectively. The transformants were grown on YPD medium supplemented with zeocin. The presence of expression cassettes in the transformants was examined by PCR using corresponding primers. To express the XK, the recombinant plasmid pGLG61/HpXYL3 was transformed into the recipient strain H. polymorpha overexpressing native or modified versions of XR and XDH. The transformants were grown on YPD medium in the presence of increasing concentrations of G418. The highest concentration of G418, which allows the transformants to grow, was 0.4 mg×ml−1. Colonies able to grow on the selective medium appeared after 3 days of incubation with frequency of up to 20 transformants×mg−1 DNA. The transformants were stabilized by cultivation in non-selective media for 10-12 generations with further shifting to the selective media with G418. The presence of recombinant XYL3 gene driven by the HpGAP promoter in genomic DNA of stable transformants was proven by PCR. As pGLG61-based plasmids promote multiple integration into the genome of recipient strains [29], constructed strains were examined by Southern hybridisation to select recombinant strains with equal amount of XK expression cassette. The strains bearing 3 copies of XK expression cassette were selected (data not shown). Constructed yeast strains are represented in Table 1.",
                                "**Biochemical Analysis of Constructed Strains**",
                                "Biochemical properties of XR in one of constructed recombinant strains (designated XRm) were studied. Specific activities of XR (with both cofactors NADPH and NADH), XDH and XK as well as affinities of native XR (XRn) and engineered XRm were measured (Table 2). XRm was characterized by KM of 152 μM for NADPH using xylose as a substrate, which is 17 times higher than the KM for NADPH of the native XR (9 μM). The KM of engineered XRm for NADH remained nearly unchanged (112 μM). Specific activity of XR with NADPH in the XRm strain decreased 4.8 times compared with the strain overexpressing native XR. The specific activity of XR with NADH in both strains remained unchanged. Strains XRn/XDH and XRm/XDH with additional overexpressing XDH possessed two-fold increase in the specific activity of XDH compared with the wild type strain. Overexpression of XK in strains XRn/XDH/XK and XRm/XDH/XK resulted in up to 2.4-fold increase in specific activity of XK as compared to CBS4732 (Table 2).",
                                "**Xylose Fermentation**",
                                "Xylose fermentation by the constructed strains was compared in batch cultures with limited aeration. A mineral medium containing xylose (12%) and initial biomass concentration 2 g (dry weight)×L−1 were used. Results of ethanol and xylitol production by the constructed strains are shown in Table 2. Ethanol productivity of the XRm strain was 9.8 mg×(L×h)−1, which is 1.5- and 1.3-fold higher than the productivity of the XRn and the wild-type strain CBS4732, respectively. Xylitol production of these strains varied insignificantly. Ethanol productivity of the strain XRm/XDH (18.4 mg×(L×h)−1) was increased 1.5 and 2.4 times as compared to XRn/XDH and CBS4732, respectively. Strain XRm/XDH possessed 1.3- and 2.6-fold reduction in xylitol production compared with XRn/XDH and CBS4732 strains. Ethanol productivity of the strain XRm/XDH/XK (54.7 mg×(L×h)−1) was 4- and 7.4-fold higher compared to those of the strain XRn/XDH/XK (13.8 mg×(L×h)−1) and CBS4732 (7.5 mg×(L×h)−1). The xylitol production of the strain XRm/XDH/XK was significantly reduced to 0.9 mg×(L×h)−1, which is 4.7- and 3-fold lower than those of the XRn/XDH/XK and control strain, respectively. Representative fermentation profiles for the strains XRn/XDH/XK, XRm/XDH/XK and CBS4732 are shown in FIG. 3. It has to be mentioned, that the consumption of xylose by H. polymorpha strains during the fermentation is low. Ethanol produced in the initial stage of xylose fermentation is reutilized after 1-2 days of the fermentation.",
                                "**Expression of the XR mutant, XD, and XK Genes in a H. polymorpha Strain That Over Expresses Pyruvate Decarboxylase for Improved Alcoholic Fermentation of Xylose at Elevated Temperature (48° C.).**",
                                "To improve alcoholic fermentation of xylose the engineered version of xylose reductase (XR) together with native xylitol dehydrogenase (XDH) were overexpressed in a recombinant H. polymorpha strain with an elevated level of pyruvate decarboxylase activity. Construction and biochemical characteristics of the initial strain 2Et—/2xPDC1 have been described earlier [35, 36].",
                                "To generate strains with simultaneous overexpression of modified versions of XR together with XDH, the H. polymorpha 2Et—/2xPDC1 strain was transformed with SacI linearized plasmid pX1M-Z-X2 (FIG. 1) [37]. Transformants were grown on YPD medium supplemented with zeocin (150 mg×L−1). Colonies able to grow on the selective medium appeared after 3 days of incubation with frequency of up to 40 transformants×mg−1 DNA. The transformants were stabilized by cultivation in non-selective medium for 10-12 generations with further shifting to the selective medium with zeocin. The presence of expression cassettes in the transformants was examined by PCR using primers L1/HpX1rev for the expression cassette bearing modified XYL1 gene under the control of strong constitutive promoter HpGAP and primers L1/Ko133 for the expression cassette bearing XYL2 gene under the same promoter. The sequences of used primers as well as modification of XYL1 gene are described in the article Dmytruk O. et al. [37].",
                                "Xylose fermentation by the constructed strain was examined in batch cultures with limited aeration at 48° C. A mineral medium containing xylose (12%) and initial biomass concentration of 2 g (dry weight)×L−1 were used. Results of ethanol production by the constructed strains are shown in Table 3. Ethanol productivity of the 2Et—/ 2xPDC1/XRm/XDH strain was 0.11 g×(L×h)−1, which is 2.7-fold higher than the productivity of the initial strain 2Et—/2xPDC. Representative fermentation profiles for the strains 2Et—/2xPDC 1 and 2Et—/2xPDC1/XRm/XDH are shown in FIG. 5.",
                                "Overexpression of engineered XR together with native XDH obviously neutralize redox imbalance in constructed recombinant strain of H. polymorpha, leading to the significant improvement of ethanol productivity during xylose fermentation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "engineer XR to reduce affinity for NADPH",
                                "construct strains with overexpressed XR and XDH",
                                "describe biochemical properties of XRm",
                                "compare specific activities of XR, XDH, and XK",
                                "describe xylose fermentation by constructed strains",
                                "compare ethanol productivity of strains",
                                "compare xylitol production of strains",
                                "show fermentation profiles for selected strains",
                                "describe expression of XR mutant, XDH, and XK genes",
                                "construct strain with overexpressed pyruvate decarboxylase",
                                "transform strain with plasmid pX1M-Z-X2",
                                "describe xylose fermentation by constructed strain",
                                "compare ethanol productivity of strains",
                                "show fermentation profiles for selected strains"
                            ],
                            "num_characters": 7339,
                            "outline_medium": [
                                "engineer XR to reduce affinity for NADPH",
                                "construct strains with overexpressed XR, XDH, and XK",
                                "analyze biochemical properties of constructed strains",
                                "compare xylose fermentation by constructed strains",
                                "describe fermentation profiles of selected strains",
                                "express XR mutant, XDH, and XK genes in H. polymorpha strain",
                                "analyze fermentation results of the modified strain"
                            ],
                            "outline_short": [
                                "describe engineering of XR",
                                "describe strain construction and biochemical analysis",
                                "describe xylose fermentation results"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "Discussion",
                    "paragraphs": [
                        "As was described earlier [6], natural xylose-utilizing yeasts display alcoholic fermentation only when their XR possessed NADH-linked activity. The XR of H. polymorpha belongs to enzymes with dual cofactor specificity, however NADPH is strongly preferred (>10-fold). In the present case, we focused our efforts on engineering the XR with increased KM for NADPH. Lysine and asparagine residues were substituted for arginine and aspartic acid, respectively, at the positions 341 and 343 in the frame of cofactor binding site using the site-specific mutagenesis, according to data for the XR gene of C. tenuis [33]. The modified version of XR gene under control of the strong constitutive HpGAP promoter was overexpressed on the Δxyl1 background. It resulted in significant increase of KM for NADPH, while KM for NADH remained nearly unchanged. Obtained results are in good agreement with reported features of modified XR from C. tenuis [33]. The constructed XRm strain showed a slight increase in ethanol productivity as compared to the wild type strain, while the overexpression of native XR had no positive effect. Xylitol production of these strains varied insignificantly. It has to be emphasized that mutated XR reveals significantly lower specific activity with NADPH which resulted in increase of ethanol productivity of the XRm. For further improvement of ethanol production, XDH was expressed together with the modified XR. Overexpression of enzymes for initial two stages of xylose utilization pathway resulted in the 2.4-fold improvement of ethanol productivity accompanied by the 2.6-fold decrease of xylitol production.",
                        "In our previous work we developed H. polymorpha strains co-overexpressing E. coli XI and own XK. The strains were characterized with significant improvement of ethanol production during xylose fermentation [23]. In the present study, the constructed strain XRm/XDH/XK overexpressing the modified XR together with XDH and XK is characterized with significant increase in ethanol productivity (up to 7.4 times) as compared to the wild type strain. Importantly, xylitol production by this strain is reduced considerably: 0.9 mg×(L×h)−1 versus 4.2 mg×(L×h)−1 by the wild type strain. Additional overexpression of XDH and XDH together with XK led to a gradual increase in ethanol productivity and simultaneously a decrease in xylitol production. It may be assumed that the initial stages of xylose utilization are limiting in alcoholic fermentation of xylose in H. polymorpha. In FIG. 3, the fermentation profiles of XRm/XDH/XK and XRn/XDH/XK are represented. The consumption of xylose by both constructed H. polymorpha strains and the wild type strain during the fermentation was rather low (FIG. 3). This may suggest that xylose uptake in H. polymorpha is quite inefficient and corresponding genes coding putative xylose transporters should be cloned and overexpressed. In addition, bottlenecks downstream of XR cannot be excluded and arrant further investigation. The fermentation profile revealed reutilization of synthesized ethanol. The reason of this phenomenon is not understood. In another study the present inventors have isolated a H. polymorpha 2EtOH- mutant which is characterized by significant decrease in synthesized ethanol consumption (Ishchuk et al., unpublished). The molecular nature of the corresponding mutation, however, remains unknown.",
                        "Recombinant strains of H. polymorpha constructed in this study showed significant increase in ethanol productivity during high-temperature xylose fermentation. On the other hand, ethanol production from xylose is still very low as compared to the best current xylose fermenting strains [13a, 17, 34]. Therefore, further efforts have to be applied to improve the xylose alcoholic fermentation in the thermotolerant yeast H. polymorpha."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe natural xylose-utilizing yeasts",
                        "engineer XR with increased KM for NADPH",
                        "overexpress modified XR gene",
                        "co-overexpress XDH and XK",
                        "analyze fermentation profiles",
                        "discuss limitations of xylose uptake",
                        "suggest further improvements"
                    ],
                    "num_characters": 3824,
                    "outline_medium": [
                        "describe XR gene modification",
                        "report fermentation results with modified XR",
                        "discuss limitations and future directions"
                    ],
                    "outline_short": [
                        "engineer XR with increased KM for NADPH"
                    ]
                },
                {
                    "title": "Conclusion",
                    "paragraphs": [
                        "In the present work, co-overexpression of mutated form of XR (K341→R N343→D) together with native XDH and XR in a strain carrying the Δxyl deletion resulted in significant increase (7.4 fold) in ethanol productivity with simultaneous reduction of xylitol production during high-temperature xylose fermentation. The same construction integrated into the chromosome of a H. polymorpha strain that a over expresses the H. polymorpha pyruvate decarboxylase gene PDC1, but lacking the Δxyl deletion also increases ethanol fermentation from xylose by nearly a factor of three. It is therefore expected that the combination of overexpression of the PDC1 gene and the mutated XR gene in a H. polymorpha strain also carrying the Δxyl deletion will enhance ethanol production from xylose even further."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "summarize results of co-overexpression of mutated XR, XDH, and XK"
                    ],
                    "num_characters": 791,
                    "outline_medium": [
                        "summarize results and implications"
                    ],
                    "outline_short": [
                        "summarize results of co-overexpressing mutated XR with XDH and XK"
                    ]
                },
                {
                    "title": "Terms in the Claims",
                    "paragraphs": [
                        "In the claims that follow the Reference section hereafter, the term “gene” is a shorthand expression that means any polynucleotide encoding the enzyme identified by the gene named. “Unless expressly stated in the context of the claims,” gene” may, but does not necessarily include, non-coding sequences. Unless otherwise stated, the polynucleotide may have the same primary structure as the named gene that is endogenous in the genome of an organism, or be a recombinant form of the named gene linked to other polynucleotide elements, or be a synthetic form of the named gene, or be a mutated form where various elements in the named gene have been changed but the gene still encodes an operable form of the identified enzyme. The term “mutated” means any change in the named gene that makes it different from the endogenous form of the gene. “Native” means the endogenous structure of the gene as it exists in the genome of the organism."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define terms used in claims"
                    ],
                    "num_characters": 938,
                    "outline_medium": [
                        "define key terms used in claims"
                    ],
                    "outline_short": [
                        "define terms used in claims"
                    ]
                }
            ],
            "outline_long": [
                "claim priority to provisional application"
            ],
            "num_characters": 527,
            "outline_medium": [
                "claim priority to provisional application"
            ],
            "outline_short": [
                "claim priority to provisional application"
            ]
        }
    ],
    "claims": [
        "1. A recombinant H. polymorpha strain comprising at least one recombinant nucleic acid that singularly or in combination, includes at least one gene encoding a xylitol dehydrogenase enzyme, at least one gene encoding a xylose reductase enzyme having a higher binding affinity for NAD(H) than for NADP(H), and at least one gene encoding a xylulokinase enzyme, each of said genes being operably linked to at least one promoter that overexpresses said genes in said H. polymorpha strain and where said recombinant H. polymorpha strain produces a greater amount of ethanol when fermented in a media containing xylose than a parent H. polymorpha strain not containing said genes.",
        "2. The recombinant H. polymorpha strain of claim 1 wherein each of said genes of the recombinant nucleic acid is integrated into the H. polymorpha chromosome.",
        "3. The recombinant H. polymorpha strain of claim 1 wherein the H. polymorpha strain has a mutation rendering at least one native gene encoding a xylose reductase inoperable.",
        "4. The recombinant H. polymorpha strain of claim 1 wherein each of said genes is over expressed in the H. polymorpha strain relative to the parent H. polymorpha strain.",
        "5. The recombinant H. polymorpha strain of claim 1 further comprising at least one sequence encoding a pyruvate decarboxylase enzyme operably linked to a promoter that overexpresses said pyruvate decarboxylase enzyme in the recombinant H. polymorpha strain.",
        "6. The recombinant H. polymorpha strain of claim 1 wherein at least one promoter comprises a HpGAP promoter obtained from H. polymorpha.",
        "7. The recombinant H. polymorpha strain of claim 1 wherein the recombinant xylose reductase gene is a mutant of a native H. polymorpha xylose reductase gene.",
        "8. The recombinant H. polymorpha strain of claim 7 wherein the xylose reductase gene has a mutation in the native H. polymorpha xylose reductase gene that changes a first codon encoding lysine at position 341 to a codon that encodes arginine and a mutation that changes a second codon expressing asparagine at position 343 to a codon the encodes aspartic acid.",
        "9. A process for making ethanol comprising growing the recombinant H. polymorpha strain of claim 1 in a media comprising xylose under conditions that cause the recombinant H. polymorpha to make ethanol.",
        "10. A recombinant nucleic acid comprising a sequence encoding a xylose reductase gene from H. polymorpha.",
        "11. The recombinant nucleic acid of claim 10 wherein the sequence encoding the xylose reductase encodes an NADPH/NADH binding domain according to SEQ. ID NO: 1.",
        "12. The recombinant nucleic acid of claim 10 wherein the sequence encoding the xylose reductase encodes an NADPH/NADH binding domain according to SEQ. ID NO: 2.",
        "13. The recombinant nucleic acid of claim 10 according to SEQ. ID NO: 3.",
        "14. The recombinant nucleic acid of claim 10 that encodes a protein according to SEQ. ID NO: 4.",
        "15. The recombinant nucleic acid of claim 10 that encodes a protein according to SEQ. ID NO: 4 except having a mutation in the NADPH/NADH binding domain according to SEQ. ID NO: 2."
    ]
}