{
    "id": "https://semopenalex.org/work/W2443557827",
    "authors": [
        "Paul Wilson",
        "Michèle Bombardieri",
        "Sandra Afione",
        "John A. Chiorini",
        "Michael A. Smith",
        "William D. Swaim",
        "Changyu Zheng",
        "Beverly Handelman",
        "Peter D. Burbelo",
        "Elisa Astorri",
        "Melodie L. Weller",
        "Zhennan Lai",
        "Donald A. Michael",
        "Drew G. Michael",
        "Zoe C. Bogus",
        "Matthew R. Gardener"
    ],
    "title": "Hepatitis Delta Virus Detected in Salivary Glands of Sjögren’s Syndrome Patients and Recapitulates a Sjögren’s Syndrome-Like Phenotype in Vivo",
    "date": "2016-05-23",
    "abstract": "Background: Low-level, chronic viral infections have been suspect in the development of select autoimmune diseases, including primary Sjögren’s syndrome (pSS). Multiple studies have shown stimulation of antiviral response pathways in pSS tissues suggestive of a viral infection. Yet, with this data in hand, a causal link between a viral infection and development of pSS had not been identified. Therefore, a study was designed to further define the viral landscape within pSS-affected salivary gland tissue to identify potential viral-mediated triggers in the pathogenesis of this autoimmune disease.Methods: A viral microarray was utilized to measure viral transcripts present in salivary gland tissue from patients diagnosed with pSS compared to healthy controls. Murine models of salivary gland localized HDV antigen expression were developed to evaluate the capacity of a chronic HDV signature to trigger the development of a pSS-like phenotype.Results: Through this analysis, two distinct viral profiles were identified, including the increased presence of hepatitis delta virus (HDV) in 50% of pSS patients evaluated. Presence of HDV antigen and sequence were confirmed in minor salivary gland tissue. Patients with elevated HDV levels in salivary gland tissue were negative for detectible hepatitis B virus (HBV) surface antigen and antibodies to HBV or HDV. Expression of HDV antigens in vivo resulted in reduced stimulated saliva flow, increase in focal lymphocytic infiltrates, and development of autoantibodies.Conclusion: Identification of HDV in pSS patients and induction of a complete pSS-like phenotype in vivo provides further support of a viral-mediated etiopathology in the development of pSS.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Viral infections are thought to play a role in the development of chronic diseases, including autoimmune diseases [1]. While evidence of an antiviral response has been observed in multiple autoimmune diseases [2–8], association with a viral agent has not always been clear. This may be attributed to a multifactorial etiology of chronic autoimmunity requiring a genetic susceptibility component in combination with a persistent viral infection or chronic viral exposure to trigger disease pathogenesis. Therefore, a study was designed to further define the viral landscape and potential viral triggers of autoimmunity in disease-affected tissue as illustrated in patients with primary Sjögren's syndrome.",
                "Primary Sjögren's syndrome (pSS) is an autoimmune disease estimated to affect over 35 million people worldwide [9, 10]. This autoimmune disease is currently diagnosed by a reduction in tear and/or saliva secretion, accumulation of focal lymphocytic infiltrates in salivary gland tissue, and development of antibodies against Ro(SSA), La(SSB), and nuclear proteins [11]. Epidemiological studies have reported patients experiencing subjective xerostomia and development of autoantibodies over a decade prior to diagnosis, suggesting a chronic, slowly progressing development of the disease pathology [12–14]. While the underlying trigger(s) of Sjögren's syndrome remains to be defined, various studies have pointed to an altered genetic susceptibility in connection with environmental exposures, including viral infections.",
                "A common antiviral signature in combination with divergent symptomology suggests a multivariate etiology underlying the Sjögren's syndrome phenotype. Clinical studies have reported unique groups within the pSS patient population presenting with different symptom profiles and disease progression based on age of onset, sex, immunological presentation, and extraglandular involvement across a large cohort of pSS patients [15]. Gene expression analyses within affected salivary gland tissue have identified stimulation of antiviral response pathways, including upregulation of type I interferon (IFN) inducible genes and upstream viral-sensing Toll-like receptors [8, 16–18]. Although these studies echo a similar overlying antiviral response, the divergent clinical characteristics across the pSS patient population may be due to multiple etiologies, and potentially different viral infections, behind the collective phenotypic presentation of primary Sjögren's syndrome. Prior studies have detected the presence of viruses in salivary glands of Sjögren's syndrome patients, including Epstein-Barr Virus (EBV), Coxsackie virus, and Human T-lymphotropic virus (HTLV-1) [19–22]. Yet, even with the discovery of these viruses in Sjögren's syndrome patients, a clear connection between these viral infections and the development of primary Sjögren's syndrome has been difficult to establish.",
                "To globally identify potential viral triggers in the pathogenesis of Sjögren's syndrome, a custom viral microarray was designed to identify low-level transcripts from actively replicating viruses present within salivary gland tissue of primary Sjögren's syndrome patients compared to healthy controls. Through this analysis, multiple virus profiles were identified in the pSS patient cohort evaluated. One of the virus profiles identified included the presence of hepatitis delta virus (HDV). Taking the next step, we evaluated the capacity of HDV antigens to trigger a Sjögren's syndrome-like phenotype in vivo."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Patients And Samples",
                    "paragraphs": [
                        "All patient studies were reviewed and approved by the Institutional Review Board USA (NCT00001390) and all patients signed a written consent form prior to enrollment. All primary Sjögren's syndrome patients met American-European Consensus Group (AECG) criteria [11] for diagnosis of Sjögren's syndrome. Clinical parameters and serum and salivary gland labial biopsies from 14 healthy controls and 15 patients diagnosed with primary Sjögren's syndrome were utilized in this study and are summarized in Supplemental Table 1.",
                        "Patients from the second United Kingdom (UK) cohort was approved by the hospital Ethics Committee (REC 05/Q0702/1) and all patients signed a written informed consent. This second dataset, summarized in Supplemental Table 1, included RNA samples isolated from labial salivary gland biopsies obtained from a total of 12 pSS patients and minor salivary gland biopsies from 10 sicca patients. Sicca samples were defined as patients experiencing select characteristics of pSS but did not meet full criteria for diagnosis of Sjögren's syndrome at time of tissue acquisition. An additional confirmation study, consisting of 8 pSS and 8 sicca samples, including samples (two positive and two negative) overlapping with those tested in the second phase of the study conducted at the NIH, were analyzed for independent confirmation of HDV in RNA isolated from minor salivary gland biopsies conducted at the UK location."
                    ],
                    "subsections": []
                },
                {
                    "title": "Microarray",
                    "paragraphs": [
                        "Viral microarray probes were designed using a modified method reported by Wang et al. [23]. Briefly, viral genomes were fragmented into 70nt sequences and iterated across 15nt offsets to produce up to 30,000 candidate probes per viral sequence. The resulting 70mer fragments were then blasted against the RefSeq nucleotide database, and probes with E-values < 0.05 were retained. These 70mer sequences were further filtered using Agilent eArray parameters for efficient melting temperature and nucleotide composition rendering optimized 60mer viral microarray probe sequences. A maximum of 5 probes per viral sequence was retained. Each array contained over 3000 probes that recognized putative conserved regions in viruses known to infect animals and covered 31 viral families. RNA isolated from minor salivary gland tissue was processed as previously reported [24].",
                        "Genespring (v.12.0) software was utilized for viral microarray analysis. Microarray data were normalized using quantile normalization and filtered for background intensity (threshold set to 25% of any one group having a raw probe intensity of > 100). Dataset evaluated in this study have been deposited in NCBI GEO Database (series no. GSE77599). Collective analysis identified probes significantly increased across the collective pSS patient group compared to the collective healthy controls and that presented a fold change > 2.0 in pSS relative to healthy controls. Statistical significance was corrected for multiple comparisons using the Benjamini-Hochberg correction method. Subgroup analysis was performed through identifying normalized the probe intensity of each probe and identifying probes for each individual patient that had a greater than a 95% confidence interval of the probe intensity for the collective healthy controls. Probes selected for further analysis presented with intensities greater than the 95% confidence interval of healthy controls and were present in at least 25% of the pSS patient samples tested. Pairwise correlations between normalized probe intensities of probes present in subgroups of pSS were then identified and mapped using JMP (v.10.0) statistical software from SAS. Heatmap and cluster analysis were generated using CIMminer (NCI)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Pcr Detection Of Hdv Sequence",
                    "paragraphs": [
                        "Reverse transcription of RNA isolated from minor salivary gland biopsies was performed using Life Technologies Superscript II and random hexamer primers as per the manufacturer's specifications. The genomic HDV sequence was identified in RNA using a modified nested PCR classically used in the detection of HDV in HBV:HDV co-infections [25]. Modification to protocol included the addition of dNTPs to the first round of nested PCR. The transcript targeted nested RT-qPCR design used to detect both HDV genomic and transcript sequences and, in our testing, was more sensitive than the Smedile et al. PCR used to detect only the HDV genome.",
                        "The first round PCR was performed using Qiagen HotStarTaq DNA Polymerase as follows: 5μl of Q-solution; 3.5μl of 25 mM MgCl2; 2.5μl of 10X PCR buffer; 0.25μl Hot Start enzyme; 0.25μl 10mM dNTPs; 0.125μl 100mM tHDV-1F (5′- GGCTACTCTTCTTTCCCTTCTC-3′) and 0.125μl 100mM tHDV-1R (5′- ACAAGGAGAGGCAGGATCA-3′); 1μl cDNA; and PCR grade water to 25μl total volume. First round PCR conditions: 1 cycle of 5:00 minutes at 95°C; 35 cycles of 0:30 minutes at 94°C; 0:30 minutes at 50°C; 0:30 minutes at 72°C; and 1 cycle of 10:00 minutes at 72°C. The second round of qPCR was performed using the following primer and probe set: tHDV-2F (5′- TCTCGTCTTCCTCGGTCAA-3′); tHDV-2R (5′-GCCCTCGAGAACAAGAAGAA -3′); and tHDV-probe (5′-FAM/TTCCTCCTTGCTGAGGTTCTTGCC/3′-TAM-Sp). The qPCR reaction was performed on an Applied Biosystems ABI 7700 instrument and the reaction contained Applied Biosystems (ABI) TaqMan 2X PCR master mix, 500nM of primers, 250nM of probe, 1-3μl of first round PCR reaction, and PCR grade water to a total volume of 25μl. Increasing the volume of first-round PCR added to the nested reaction may be required to quantify lower levels of HDV sequence present in samples. The qPCR reaction was performed as follows: 1 cycle at 50°C for 2:00 minutes; 1 cycle at 95°C for 10:00 minutes; 40 cycles of 0:15 minutes at 95°C, 0:30 minutes at 50°C, and 1:00 minutes at 60°C. Quantitation of GAPDH was performed using Applied Biosystems (ABI) FAM/MGB labeled probe to human GAPDH (catalog # HS99999905_m1) and an assay was performed as outlined in the manufacturer's suggested protocol. HDV levels were calculated as fold change in pSS relative to average of healthy controls as per ABI protocol [26]. A more detailed protocol is available upon request."
                    ],
                    "subsections": []
                },
                {
                    "title": "Detection Of Hdag Expression In Salivary Gland Tissue",
                    "paragraphs": [
                        "Immunohistochemical analysis of HDV antigens (HDAg) was performed using rabbit anti-HDAg antiserum as previously characterized [27, 28] for human salivary gland tissues. Staining of formalin fixed paraffin embedded (FFPE) human salivary gland tissue was performed using citrate (10mM sodium citrate, pH6.0, 0.05% Tween20) antigen retrieval, followed by 30 minute incubation in blocking solution (3% BSA in TRIS buffered saline [TBS]) at room temperature, incubation with primary antibody overnight at 4°C (1:400 for rabbit antiserum) and 1 hour room temperature incubation in labeled secondary antibody solution (Alexa Fluor 488 Goat Anti-Rabbit IgG, 1:500, Life Technologies). Slides were then mounted in Fluoromount G (Electron Microscopy Systems) containing DAPI counterstain. B-cell, (B220, Abcam catalog #AB64100, 1:250) and T-cells (CD3, Abcam, catalog #AB16669, 1:100) were detected in FFPE mouse tissues using the manufacturer's recommended conditions. Secondary species-specific antibodies for B-cell b220 (Alexa Fluor 594 Goat Anti-Rat IgG, 1:500, Life Technologies) and T-cell CD3 (Alexa Fluor 488 Goat Anti-Rabbit IgG, 1:500, Life Technologies) were incubated for 1 hour at room temperature and mounted in Fluoromount G (Electron Microscopy Systems) containing DAPI counterstain."
                    ],
                    "subsections": []
                },
                {
                    "title": "Detection Of Antibody Profiles By Elisa",
                    "paragraphs": [
                        "ELISAs from International Immunodiagnostics (Foster City, CA) to detect antibodies to HDAg (catalog #277) and Abnova Corporation to detect antibodies to HBV core protein (catalog #KA0288) were performed on serum from healthy controls and pSS patients as per manufacturer's suggested protocols. A luciferase immunoprecipitation system (LIPS) was performed to detect HBV core protein or HDV antigen tagged with Renilla luciferase and was performed as previously published [29, 30]. A human anti-HDAg antibody was used as the positive control (gift from John Casey, PhD, Georgetown University).",
                        "Anti-SSA/Ro, anti-SSB/La, and antinuclear antibodies (ANA) were detected by ELISA from Alpha Diagnostics International using human serum as per the manufacturer's protocol. Total IgG (eBiosences), anti-SSA/Ro (Alpha Diagnostics International), anti-SSB/La (Alpha Diagnostics International), and ANA (Alpha Diagnostics International) were detected in mouse serum by ELISA as per the manufacturer's suggested protocols."
                    ],
                    "subsections": []
                },
                {
                    "title": "Animal Model",
                    "paragraphs": [
                        "All animal studies were approved by the NIDCR Institutional Animal Care and Use Committee (IACUC) and performed in compliance with the NIH Guide for the Care and Use of Laboratory Animals. Recombinant adeno-associated virus serotype 2 (AAV2) was produced and utilized for cannulation of submandibular salivary glands in 8-week-old female C57BL/6 mice as previously reported [31]. Mice were cannulated with 1.0x1010 genomic particle/gland AAV2 containing S-HDAg or L-HDAg sequences and spiked with AAV containing luciferase transgene as a control for cannulation efficacy. The combined expression of S-HDAg and L-HDAg (S-HDAg/L-HDAg) was facilitated by delivery of a 1:1 mixture of AAV containing S-HDAg or L-HDAg. Control mice were cannulated with AAV containing luciferase transgene. Viral aliquots of rAAV2-HDAg used for cannulation were spiked with 10% rAAV2-luciferase to confirm effective cannulation. One week post-cannulation, mice were monitored for luciferase expression in the salivary gland tissue region as previously reported [32]. Mice that had detectible levels of luciferase activity were utilized for the study and were assessed for pilocarpine stimulated saliva flow, antibody development, lymphocytic foci development and HDAg expression at 4 months post-cannulation using the methodology previously reported [24]."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [
                "Viral microarray analysis was performed using RNA isolated from minor salivary gland tissue from 15 primary Sjögren's syndrome patients and 14 healthy controls (Supplemental Table 1). The viral microarray contained over 3000 probes for viral families known to infect animals. Probes were designed to detect homologous sequences shared between multiple viral family members, enabling the detection of viral signatures with a limited number of probes [23, 33]. This method has the potential to identify transcripts of actively replicating RNA and DNA viruses within the affected salivary gland tissue. Our hypothesis was that a viral-mediated pSS-like phenotype may be caused by more than one type of viral infection. Therefore, the analysis of the viral array data was performed using two different approaches: (1) identification of the collective pSS patient cohort viral signature compared to the healthy controls; and (2) identification of individual viral signatures to identify subgroups within the pSS patient cohort compared to healthy controls."
            ],
            "subsections": [
                {
                    "title": "Identified Viral Profiles In Pss",
                    "paragraphs": [
                        "The collective analysis of the viral transcripts differentially expressed between the pSS patient cohort and healthy controls identified 9 probes from 8 distinct viral families that were significantly altered in the pSS cohort. Six probes recognizing HDV, Herpesviridae, Retroviridae, Astroviridae, Adenoviridae, and Circoviridae viral families were significantly increased in pSS salivary gland tissue compared to healthy controls (Figure 1, Supplemental Table 2). Three probes recognizing Flaviviridae and Poxviridae viral families were significantly decreased in pSS compared to healthy controls. Through this collective analysis, HDV was identified as the most significant virus profile, presenting with the highest probe intensity and significant increase across the collective patient population compared to healthy controls.",
                        "The subgroup analysis of the viral transcripts differentially expressed within subpopulations in the pSS patient cohorts compared to the healthy controls confirmed the presence of two distinct viral profiles within the pSS patient population. Through the subgroup pSS patient analysis, 12 viral probes were significantly increased in subpopulations within the pSS patient cohort relative to the healthy controls (Figure 2A, Supplemental Table 3). Significant pairwise correlation analysis identified 2 distinct viral profiles within the pSS patient population (Figure 2B), Supplemental Table 4). Virus profile I contained probes recognizing the HDV, Astroviridae, Circoviridae, and Herpesviridae virus families. Virus profile II contained probes recognizing the Flaviviridae, Picornaviridae, Herpesviridae, and Parvoviridae virus families. Through this subgroup analysis, virus profile I, including HDV, presented the highest probe intensity and significant increase across the subgroup analysis.",
                        "Across both the collective and subgroup analyses, HDV was identified as the most significant virus signature in the pSS cohort present in the affected salivary gland tissue of Sjögren's syndrome patients, as defined by significantly elevated HDV probe intensity in the collective and individual pSS patients relative to healthy controls. Therefore, HDV was selected for further characterization and evaluation as a potential trigger in the development of a Sjögren's syndrome phenotype."
                    ],
                    "subsections": []
                },
                {
                    "title": "Hepatitis Delta Virus Detected In Pss",
                    "paragraphs": [
                        "Microarray analysis identified the presence of hepatitis delta virus (HDV), which was significantly increased in over 50% of the pSS patients compared to healthy controls (Figure 3A-B). The HDV probe was homologous for the sequence from genotype 1, the genotype most prevalent in North America, Europe, and the Middle East [34]. Confirmation of HDV viral sequence was performed using nested RT-PCR [25] (Supplemental Figure 1A) using a new RT-qPCR assay targeted to the transcript region of the HDV genome (Figure 3B). To address the potential for contamination, the hepatitis delta virus sequence detected in minor salivary gland tissue was confirmed in a second pSS cohort in an independent lab with similar results (Supplemental Figure 1B). Hepatitis delta virus was also detected in a subset of sicca patients experiencing xerostomia and/or xerophthalmia symptoms but that did not meet the full criteria for pSS diagnosis at the time of tissue biopsy. No data were available at the time of analysis as to whether patients experiencing sicca symptoms had progressed to develop pSS. Hepatitis delta antigen was detected in HDV-positive pSS in comparison to salivary gland tissue from healthy controls using confocal immunofluorescence imaging (Figure 3C). Immunohistochemical detection of HDAg rendered a nuclear localization pattern in HDV-positive paraffin-embedded minor salivary gland tissue. These patterns are similar to those reported for HDV antigen expression in HDV infected tissues [28, 35]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Absence Of Detectible Past Or Present Hbv Infection",
                    "paragraphs": [
                        "Primary Sjögren's syndrome patients positive for HDV in salivary gland tissue lacked evidence of a past or current hepatitis B virus (HBV) coinfection. Patient serum was tested for HBV surface antigen (HBsAg) and antibodies to HBV core (HBc) (Table 1). All of the patients tested for HBsAg were negative (Table 1). One healthy control and one pSS serum sample tested were positive for anti-HBc antibodies, but both of the samples positive for anti-HBc antibodies were negative for HDV sequence in salivary gland tissue (Supplemental Table 5). Luciferase Immunoprecipitation System (LIPS) assay offers a higher degree of sensitivity in the detection of antibodies [29]. The LIPS assay was also unable to detect anti-HBc antibodies in the serum of pSS patients that were positive for HDV in salivary gland tissue (Supplemental Table 5). These data are in line with reports of similar rates of HBc antibody detection between healthy controls and pSS [36]. Viral microarray contained over 100 probes recognizing hepadnaviridae virus family sequences but lacked significant differential expression between pSS and healthy controls or between HDV-positive pSS and healthy controls (Supplemental Table 6). Transaminase levels were within normal range for the pSS patient population tested and did not correlate with the level of HDV in salivary gland as detected by viral microarray (Supplemental Table 7). As well, the patients that tested positive for HDV by microarray lacked detectible antibodies to the HDV antigens (Table 1). In conclusion, pSS patients that tested positive for HDV in salivary gland tissue were negative for evidence of an active or past HBV infection or a systemic antibody production to HDV antigen."
                    ],
                    "subsections": []
                },
                {
                    "title": "Clinical Characteristics Of Hdv In Pss",
                    "paragraphs": [
                        "The pSS patient population was divided into two groups, defined as pSS patients with elevated levels of HDV (positive/HDVhigh, n = 8) and pSS patients with HDV levels similar to healthy controls (negative/HDVlow, n = 7), as determined by microarray analysis. Analyses were performed to identify significant changes in clinical parameters between the total pSS population and healthy controls, between HDVhigh and HDVlow, between HDVhigh pSS and healthy controls, and between HDVlow and healthy controls (Table 1).",
                        "Analysis of the total pSS patient cohort relative to healthy controls identified significant decreases in unstimulated saliva flow (P < 0.05), stimulated saliva flow (P < 0.05), and tear production (P< 0.005), and significant increases in focal lymphocytic infiltration (P< 0.005), and levels of total serum IgG and autoantibodies (anti-nuclear, anti-SSA/Ro, anti-SSB/La antibodies, and rheumatoid factor). There was a limited significant difference identified between the HDVhigh and the HDVlow patient groups. Albumin was elevated in the HDVhigh subgroup (4.3±0.2, P < 0.05) in comparison to the HDVlow cohort (4.0 ± 0.2). No significant difference was observed in albumin levels in the total pSS cohort in comparison to healthy controls.",
                        "Analysis of clinical parameters in HDVhigh or HDVlow patients relative to healthy controls identified numerous significant differences in the multiple clinical features analyzed. While there was no significant difference in the age range of the healthy controls (42 ± 9) and total pSS population (50 ± 13, N.S.), pSS patients in the HDVlow subgroup were significantly older (54 ± 12, P <0.05) compared to healthy controls (42 ± 9), in contrast to HDVhigh subgroup (48 ± 14). This study contained a higher percent of males (47%) than normally reported for Sjögren's syndrome patient populations (5-10%). No significant difference in sex ratio was observed between the HDVlow and HDVhigh pSS groups. Total stimulated saliva flow was significantly decreased in the HDVlow pSS group (7.56 ± 7.19, P < 0.05) compared to healthy controls (18.28 ± 11.27). Focus score was significantly increased in both the HDVlow group (2.43 ± 1.27, P < 0.0001) and HDVhigh group (1.37±1.06, P < 0.05). Tear production was significantly decreased in the HDVlow group (3.8 ± 2.8, P < 0.005) and HDVhigh group (7.0 ± 6.0, P <0.05) relative to healthy controls (19.2 ± 12.07) as measured by Schirmer's test. Together, the HDVhigh patient group displayed a less pronounced clinical presentation of Sjögren's syndrome symptoms and antibody profiles than the HDVlow patient group."
                    ],
                    "subsections": []
                },
                {
                    "title": "Hdv Antigens Induced A Pss-Like Phenotype In Vivo",
                    "paragraphs": [
                        "An animal model was developed to evaluate the potential of HDV antigens to initiate development of a Sjögren's syndrome phenotype in vivo. Hepatitis delta virus is a negative sense single strand RNA (ssRNA) virus that is classically thought to require a helper virus, hepatitis B virus (HBV), for packaging and transmission [37]. The ~1700nt circular HDV genome contains a single open reading frame and expresses two proteins, the small antigen (S-HDAg) and the large antigen (L-HDAg). The S-HDAg is responsible for initiation of RNA genome replication and is expressed early in the infection cycle. The L-HDAg is expressed in later stages of viral infection and plays a role in ribonucleoprotein (RNP) complex packaging. In the classic HBV:HDV coinfection model, the HDV genome, S-HDAg, and L-HDAg form the RNP complex and are packaged into the coat membrane of HBV. Due to the absence of HBV in the pSS viral profile, recombinant adeno-associated virus (rAAV) was used to deliver HDV genes to recapitulate the chronic HDV infection. Female C57BL/6 received rAAV containing S-HDAg, L-HDAg, or a combination of S-HDAg/L-HDAg expression cassettes through retrograde cannulation to salivary gland tissue. These three in vivo models depicted different stages of the HDV infection cycle. rAAV containing a luciferase expression cassette was utilized in the control group to account for rAAV-mediated responses. Immunohistochemical detection of HDAg rendered a nuclear localized pattern of protein expression as delivered by rAAV (Supplemental Figure 2). Mice were monitored for 4 months post-cannulation for development of autoantibodies, changes in stimulated saliva flow and focal lymphocytic infiltration in salivary gland tissue.",
                        "Expression of HDV antigens in mouse salivary gland tissue triggered the development of autoantibodies (Figure 4(A-D). Mice expressing S-HDAg, depicting an early HDV infection, showed a significant increase in total IgG, ANA, anti-SSA, and anti-SSB levels. Mice expressing L-HDAg showed a significant increase in total IgG and anti-SSA. Mice expressing a combination of S-HDAg and L-HDAg, depicting a later stage of HDV infection, showed a significant increase in anti-SSA. The strongest autoantibody profile was observed in mice expressing S-HDAg, representative of early stages of HDV infection.",
                        "Expression of S-HDAg in mouse salivary gland tissue resulted in a significant decrease in stimulated saliva flow (Figure 4E). Mice were monitored for pilocarpine-stimulated saliva flow at 4 months post cannulation. Mice expressing S-HDAg resulted in a statistically significant decrease in pilocarpine-stimulated saliva flow relative to controls. No change in pilocarpine-stimulated saliva production was noted in mice that expressed the L-HDAg or combined S-HDAg/L-HDAg expression. Together, our data suggest that the expression of S-HDAg, representative of early stages of HDV infection, possesses the capacity to impact stimulated saliva flow.",
                        "Expression of both S-HDAg and L-HDAg, depicting a later stage of HDV infection, resulted in a significant increase in focal lymphocytic infiltration in salivary gland tissue. Focal accumulation of lymphocytes within the affected salivary gland is a hallmark in pSS diagnosis. In contrast to the S-HDAg mediated reduction in saliva flow and strong autoantibody profile, mice that expressed combined S-HDAg/L-HDAg showed a significant increase in lymphocytic foci (Figure 4F). No significant increase in lymphocytic foci was noted with singular expression of S-HDAg or L-HDAg in the salivary glands compared to control mice (Figure 4F). The variance in the area of the foci in mice expressing the combination of S-HDAg and L-HDAg was observed to be increased compared to the area of foci in the control mice (Supplemental Figure 3A-B). Ectopic lymphoid structures were also evident in mice expressing combined S-HDAg/L-HDAg (Supplemental Figure 3C). Additionally, similar to the pSS patient cohort, mice expressing HDV antigens in salivary gland tissue did not develop detectible antibodies to HDV antigens (data not shown)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "This study identified the presence of HDV in a subset of Sjögren's syndrome patients. The detection of HDV by custom viral microarray was subsequently confirmed by detection of the HDV antigen in affected salivary gland tissue and detection of the HDV sequence in two pSS cohorts and by an independent research team. Animal models were developed to evaluate the potential for HDV antigens expressed in salivary gland tissue to trigger development of a Sjögren's syndrome-like phenotype. We have shown that the expression of HDV antigens in mouse salivary gland recapitulates the development of a complete pSS-like phenotype in vivo. Together, the identification of HDV in the affected salivary gland tissue of Sjögren's syndrome patients and the demonstrated ability of HDV antigens to trigger the pathogenesis of a pSS-like phenotype in vivo provide further support for a viral-mediated mechanism in the development of Sjögren's syndrome.",
                "The timeline for developing Sjögren's syndrome pathogenesis mirrors the HDV-mediated Sjögren's syndrome phenotype observed in our animal model and in the known HDV infection cycle (Figure 5). Sjögren's syndrome patients have reported subjective xerostomia and develop an autoantibody profile years prior to disease diagnosis [12–14]. Mirroring this behavior, the mice expressing S-HDAg, representing an early stage of HDV infection, presented the strongest autoantibody profile and significant reduction in stimulated saliva flow. In humans, lymphocytic infiltrates in the salivary gland tissue are evaluated and detected at later stages of pSS pathogenesis. In the mouse model, the combined expression of S-HDAg and L-HDAg, depicting a later stage HDV infection profile, resulted in a significant accumulation of lymphocytic foci in vivo. Together, the chronological development of Sjögren's syndrome echoes the progression of a chronic, low-grade HDV infection in the salivary gland as observed in our HDV animal model.",
                "Chronic HDV infections have previously been associated with triggering a clear antiviral response and development of autoimmunity. Multiple studies have shown the capacity of HDV antigens to stimulate expression of or directly interact with multiple interferon-stimulated genes and genes associated with pSS pathogenesis, including SSB/La protein [38–41]. Prior studies have associated HDV infections with the development of autoantibodies, including ANA, liver-kidney microsomal antibodies (LKM), and smooth muscle antibodies (SMA), among others [42–44]. Our data, in connection with prior reports of HDV-mediated autoantibody development, further support the potential of HDV to trigger development of pSS-associated autoimmunity. The type of autoantibody profile developed in the presence of HDV may be dependent on the tissues and cellular localization of active HDV persistence.",
                "Detection of HDV in the salivary gland tissue of Sjögren's syndrome patients in the absence of HBV points to a unique tissue tropism and/or mechanism of persistence not previously identified. Hepatitis delta virus can readily replicate its genome and antigens using host cellular mechanisms, enabling persistence in the absence of an active helper virus infection, and has been shown to persist in tissue culture at low levels for at least a year in the absence of a helper virus [27, 37, 38]. Therefore, once inside the cell, HDV is able to establish a chronic presence. In our hands, evidence of a past or current HBV infection has not been identified in affected salivary gland tissue in pSS patients that are HDV positive. This is in line with prior studies evaluating the incidence of HBV infection in pSS studies that have found similar or lower HBV infection rates in pSS patients [36, 45, 46]. The question remains as to how HDV gains entry into the salivary glands of pSS patients in the absence of a detectible current or past HBV infection. Prior studies have shown cell-mediated immune response to low-level viral infections and/or exposures in the absence of antibody production [47]. Further studies are needed to evaluate the potential of cell-mediated immune response to low level HDV and HBV antigens in the absence of a detectible humoral immune response in both the pSS patient population and HDV animal models.",
                "Further analysis is needed to identify primary routes of infection and viable antiviral therapeutics. Prior studies have shown the sequence homology of genotype 1 HDV infections associated with HDV:HBV coinfection ranges between 91.2% and 91.7% [48, 49]. In our study, a higher percent of sequence homology of 98.5% (between 97.3%-99.3%) was observed in pSS patients. This high degree of sequence homology between patient samples may be a factor of the low level rate of genome replication or a stable primary reservoir. Multiple therapies are being evaluated for treatment of chronic HDV infection associated with HBV coinfection, including lonafarnib, tipifarnib, and FTI-277 [50, 51]. The primary mechanism of these drugs inhibits farnesyl transferase activity, which is required for the post-translational modification of the L-HDAg facilitating interaction with HBsAg and packaging in the HBV virion. While these drugs have shown success in treating HDV in relation to HDV:HBV coinfection, it is unclear at this stage whether these drugs would have a similar effect in the chronic HDV present in salivary gland tissues of Sjögren's syndrome patients and in the absence of an active HBV infection. Ongoing studies are focused on how HDV gains entry into salivary gland tissue in the absence of a detectible HBV infection and the underlying mechanism(s) of HDV-mediated pSS disease pathogenesis.",
                "Multiple viral infections have been associated with the development of sialadenitis and sicca symptoms similar to that in pSS patients. As primary examples, hepatitis C virus (HCV) and human immunodeficiency virus (HIV) infections are noted to trigger sialadenitis, sicca symptoms, and distinct autoantibody profiles [52–54]. Identifying the association between these viral infections and Sjögren's syndrome symptoms has refocused the therapeutic approach to treating the underlying viral infection. HIV and HCV are now exclusion criteria in the diagnosis of Sjögren's syndrome [11]. The identification of HDV in pSS patients and the recapitulation of disease phenotype in vivo follows a similar path of study previously reported for HCV in pSS populations and in vivo [52, 55]. Therefore, we postulate that HDV may be another viral infection resulting in the development of a Sjögren's syndrome-like phenotype, and further analysis is warranted to evaluate the diagnosis of a chronic HDV infection as an exclusion criterion for the diagnosis of Sjögren's syndrome. Identifying the Sjögren's syndrome patient population that is HDV positive will refocus the therapeutic approach from generalized immune suppression to targeted antiviral therapies.",
                "Prior studies that have introduced the expression of viral proteins, including HCV and HTLV-1 proteins, or endogenous proteins associated with pSS, including bone morphogenic protein 6 (BMP-6), have shown incomplete primary Sjögren's syndrome-like phenotypes [24, 55, 56]. Most notably, these prior studies have lacked the production of pSS-associated autoantibodies to SSA/ Ro or SSB/La proteins. Our study identified the increased presence of HDV in the salivary gland tissue of pSS patients and targeted expression of HDV antigens in murine salivary glands resulted in the development of a complete Sjögren's syndrome phenotype. Together, these data suggest that the simple expression of a viral or endogenous protein or general viral infections in the salivary gland are not sufficient to elicit a complete pSS-like disease phenotype and that the pSS disease pathogenesis may be a targeted response to a specific viral exposure.",
                "Analysis of clinical features based on the level of HDV within affected salivary gland tissue revealed a less pronounced disease symptomology in the HDVhigh pSS patients. The detection of HDV in patients experiencing sicca symptoms but not meeting full criteria for pSS diagnosis may provide an early window for diagnosis and intervention prior to progression of pSS-associated pathology. Pertovaara et al. reported that 36% of patients experiencing sicca symptoms progress to development of pSS [57]. Our current hypothesis is that HDV-positive sicca patients may either be at early stages of the disease progression or are missing a cellular or genetic susceptibility factor required for progression of disease pathology. Further studies are needed to clarify the clinical differences between HDVhigh and HDVlow pSS patients and to evaluate disease progression or resolution in HDV-positive sicca patients to help define the susceptibility factors supporting or restricting chronic persistence of HDV in salivary gland tissue.",
                "Primary Sjögren's syndrome is not considered to be an infectious or contagious disease. Therefore multiple factors, including genetic susceptibility, favorable cellular and/or tissue environment, and/or exposure to pathogen(s), may be required to promote a viral-mediated development of pSS pathology. Further large-scale studies are needed to define the incidence of HDV in global pSS patient cohorts and the underlying genetic susceptibility factors impacting HDV-mediated disease pathogenesis."
            ],
            "subsections": []
        }
    ]
}