{
    "id": "https://semopenalex.org/work/W2094630803",
    "authors": [
        "Ke Sun",
        "Jennifer A. Lewis",
        "Shen J. Dillon",
        "Byung Yoon Ahn",
        "Jungyun Seo",
        "Teng Sing Wei"
    ],
    "title": "3D Printing of Interdigitated Li-Ion Microbattery Architectures",
    "date": "2013-06-18",
    "abstract": "3D interdigitated microbattery architectures (3D-IMA) are fabricated by printing concentrated lithium oxide-based inks. The microbatteries are composed of interdigitated, high-aspect ratio cathode and anode structures. Our 3D-IMA, which exhibit high areal energy and power densities, may find potential application in autonomously powered microdevices. As a service to our authors and readers, this journal provides supporting information supplied by the authors. Such materials are peer reviewed and may be re-organized for online delivery, but are not copy-edited or typeset. Technical support issues arising from supporting information (other than missing files) should be addressed to the authors. Please note: The publisher is not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing content) should be directed to the corresponding author for the article.",
    "sections": [
        {
            "title": "DOI: 10.1002/adma.201301036",
            "paragraphs": [
                "The proliferation of microscale devices, such as micro-electromechanical systems (MEMS), [ 1 ] biomedical sensors, [ 2 , 3 ] wireless sensors, [ 4 ] and actuators [ 5 ] drives demand for power sources with commensurate form factors. 3D microbattery designs based on micro-and nanostructured architectures [6][7][8][9][10] could potentially double the energy density by fully utilizing the limited space available. To date, such architectures have been produced in planar and 3D motifs by conventional lithography [11][12][13] and colloidal templating methods, [ 14 ] respectively. Here, we print 3D Li-ion microbatteries composed of high-aspect ratio anode and cathode micro-arrays that are interdigitated on a sub-millimeter scale, which exhibit amongst the highest areal energy and power densities reported to date.",
                "Our facile 3D printing technique allows functional inks to be precisely patterned in fi lamentary form over areas ranging from 100s μ m 2 to 1 m 2 with minimum feature sizes as small as 1 μ m. [15][16][17][18][19][20] We harness these capabilities to fabricate 3D interdigitated microbattery architectures (3D-IMA) composed of Li 4 Ti 5 O 12 (LTO) and LiFePO 4 (LFP), which serve as the anode and cathode materials, respectively ( Figure 1 ). These active materials exhibit minimal volumetric expansion, i.e., LTO ( ε linear ∼ 0%) [ 21 ] and LFP ( ε linear ∼ 2.2%), [ 22 ] thereby reducing the requirement for compliance in the electrode to accommodate strain that accompanies charge and discharge processes. To create 3D-IMA, we fi rst designed and optimized concentrated cathode and anode inks. We then printed interdigitated electrodes, packaged, and electrochemically characterized these 3D Li-ion microbatteries.",
                "To print high aspect ratio electrode architectures, the composition and rheology of each ink must be optimized to ensure reliable fl ow through fi ne deposition nozzles, promote adhesion between the printed features, and provide the structural integrity needed to withstand drying and sintering without delamination or distortion. Concentrated anode and cathode inks are prepared by suspending Li 4 Ti 5 O 12 (LTO, mean diameter of 50 nm) and LiFePO 4 (LFP, mean diameter of 180 nm) nanoparticles in a solution composed of deionized water, ethylene glycol, glycerol, and cellulose-based viscosifi ers via multistep process that involves particle dispersion, centrifugation, and homogenization (experimental methods). Each powder is centrifuged to remove particles above 300 nm in diameter to minimize ink clogging during printing. We produced LTO and LFP inks of varying solids loading and found that those with respective solids loadings of 57 wt% and 60 wt% exhibited the desired rheological and printing behavior ( Figures 2 a). Figure 2 b shows their apparent viscosity as a function of shear rate. Each ink exhibits highly shear thinning behavior with respective apparent viscosities ranging from 10 3 -10 4 Pa • s at 1 s -1 . Figure 2 c shows their storage modulus ( G' ) as a function of shear stress. The plateau modulus of each ink is ∼ 10 6 Pa, while their shear yield stress ( τ y ) ranges from 10 2 -10 3 Pa, respectively. The magnitude of these key rheological parameters are in good agreement with those reported for other colloidal inks designed for 3D fi lamentary printing. [17][18][19][20] We printed high aspect ratio, multilayer electrodes onto a glass substrate by depositing these inks through 30 μ m cylindrical nozzles (Figure 2 d). To control ink solidifi cation and adhesion during patterning, a graded volatility solvent system is used in which water (boiling point, b.p. 100 ° C) evaporation during printing induces partial solidifi cation of the printed features ensuring their structural integrity, while ethylene glycol (b.p. 197.3 ° C) and glycerol (b.p. 290 ° C) serve as humectants that promote bonding between individual layers (Figure 2 e). Printed features with aspect ratios ( h/w , where h is height and w is width) of ∼ 0.8 are obtained in a single pass with a minimum width of ∼ 30 μ m and high-aspect ratio features are readily obtained through a layer-by-layer printing sequence (Figure 2 e). The SEM images reveal that interfaces of the printed layers are well bonded to one another. Figure 2 f shows the height and width of LTO and LFP structures as a function of the number of printed layers. Notably, their height increases linearly with layer number, while their width is nearly constant. The aspect ratios of the patterned microelectrodes range from ∼ 0.8 to 11 for single to 16-layer high aspect ratio walls.",
                "After printing, the dried LTO and LFP microelectrode arrays are heated to 600 ° C in inert gas to remove the organic additives and promote nanoparticle sintering. Thermal gravimetric analysis (TGA) reveals that the organic species are largely removed by ∼ 300 ° C (Figure S1). At higher temperatures, the LTO and LFP particles undergo initial stage sintering leading to neck COMMUNICATION formation at particle-particle contacts. The annealed structures remain highly porous, which is desirable for electrolyte penetration (Figure S2). The electrical resistivities of the annealed LTO and LFP fi lms measured by four-point probe are 2.1 × 10 5 Ω • cm, 2.3 × 10 3 Ω • cm, respectively. These values are signifi cantly lower than their intrinsic electrical resistivities ( ∼ 10 9 Ω • cm). [ 23 , 24 ] We speculate that such differences may arise from residual carbon formed by decomposing the polymeric additives in an inert atmosphere (Figure S3). [ 25 ] To investigate their electrochemical performance, we printed 8-layer and 16-layer 3D-IMA (960 μ m × 800 μ m, electrode width = 60 μ m, spacing = 50 μ m) on glass substrates ( Figure 3 a) followed by drying and annealing at 600 ° C for 2 h in an inert atmosphere (Figure 3 b). The fi nal test structures exhibited minor distortion, but no sign of shorting via contact between adjacent electrodes or delamination from the substrate. We fi rst measured discharge properties for half-cells composed of LFP (Figure 3 c) and LTO (Figure 3 d) electrodes at varying C rates.  "
            ],
            "subsections": []
        },
        {
            "title": "COMMUNICATION",
            "paragraphs": [
                "total contribution to the capacity results from the same depletion region in both electrodes. Strategies to enhance electronic transport, e.g., through the inclusion of conductive fi llers, are currently being pursued to enable higher aspect ratio 3D-IMAs.",
                "Figure 3 e depicts the areal capacity of an 8-layer LTO-LFP 3D-IMA as a function of C rate. The battery delivers ∼ 1.5 mAh cm -2 at a stable working voltage of 1.8 V when discharged below 5C. The result corresponds well with the LFP and LTO halfcell results. Figure 3 f demonstrates the cycle life of the 3D-IMA. Minimum decay in capacity occurs up to 30 cycles. LFP and LTO both exhibit good cycle life due to their low-strain topotactic reactions that take place at relatively low and high voltages, respectively.",
                "Figure 4 shows a packaged 3D-IMA. A small plastic case (inner dimensions: 2.1 mm × 2.1 mm × 1.5 mm) fabricated by",
                "The specifi c capacities for these 8-layer structures at 1 C are calculated to be 160 and 131 mAh g -1 , respectively, in good agreement with their respective theoretical values of 170 and 175 mAh g -1 . A common feature of both data is the non-monotonic variation in discharge capacity with electrode volume between the 8-layer structures and the 16-layers structures at the lowest rate (1 C). The results indicate that the height of the structure will constrain the kinetics of the reaction. Electronic transport is the only height dependent property in the system, and likely limits the functional height of the 3D-IMA in its current incarnation. At 5 C and 10 C, the 16-layer and 8-layer LFP electrodes exhibit the same current density of 8.33 mA cm -2 . The complete overlap in these data supports the hypothesis that electronic conduction limits their rate capability, as the  "
            ],
            "subsections": []
        },
        {
            "title": "COMMUNICATION",
            "paragraphs": [
                "architectures. Careful design of concentrated LFP and LTO viscoelastic inks enabled printing of these thin-walled anode and cathode structures. Using this LFP-LTO chemistry, we have demonstrated 3D-IMA with a high areal energy density of 9.7 J cm -2 at a power density of 2.7 mW cm -2 . These microbatteries may fi nd potential application in autonomously powered microelectronics and biomedical devices."
            ],
            "subsections": [
                {
                    "title": "Experimental Section",
                    "paragraphs": [
                        "LTO and LFP Inks : LTO powder (mean diameter = 50 nm, specifi c surface area = 32.6 m 2 • g -1 , density = 3.539 g • cm -3 ) was purchased from Sigma Aldrich. LFP powder (particle size < 300 nm, density = 2.947 g • cm -3 ) is synthesized by a solid-state reaction, as described in detail elsewhere. [ 38 ] Highly concentrated LTO (57 wt% solids) and LFP (60 wt% solids) inks are prepared by fi rst dispersing 4.5 g of LTO nanoparticles in 110 mL of deionized (DI) water and 40 mL of ethylene glycol (EG, Fisher Scientifi c) and 3.0 g of LFP nanoparticles in 80 mL of DI water and 40 mL of EG. These suspensions are ball milled for 24 h at room temperature and then classifi ed by a two-step centrifugation process. The suspensions are fi rst centrifuged at 4000 rpm for 5 min to eliminate large agglomerates, followed by centrifugation at 3500 rpm for 2 h to collect fi ne particles (mean diameter of 180 nm). The collected nanoparticles are re-dispersed with appropriate addition of glycerol (Fisher Scientifi c), 3.5 wt% aqueous hydroxypropyl cellulose (HPC, Sigma Aldrich, Mw ∼ 100,000) solution, and 3 wt% aqueous hydroxyethyl cellulose (HEC, Sigma Aldrich) solution. The resultant homogenized LTO mixture is composed of (relative to their solids content) 27 wt% Glycerol, 20 ∼ 30 wt% EG, 9 wt% HPC, 1 wt% HEC, and DI water; whereas the LFP contained 20 wt% glycerol, 20 ∼ 30 wt% EG, 8 wt% HPC, 2 wt% HEC, and DI water. Through solvent evaporation at room temperature, their fi nal solids loading (nanoparticles and cellulose) is optimized to be 55 -65 wt%. Ink rheology is measured in both shear viscometry and oscillatory modes using a controlled-stress rheometer (C-VOR, Malvern Instruments, Malvern, UK) equipped with C14 cup and bob at 25 ° C in the presence of a solvent trap to prevent evaporation. The apparent viscosity ( η ) is acquired as a function of shear rate (0.01-500 s -1 ) in a logarithmically ascending series. The shear storage ( G ′ ) and viscous loss ( G ′ ′ ) moduli are measured in an oscillatory mode as a function of controlled shear stress (10-10000 Pa) at a frequency of 1 Hz with increasing amplitude sweep.",
                        "3D printing : Before printing, interdigitated gold current collector patterns (960 μ m × 800 μ m, digit width = 70 μ m, digit spacing = 50 μ m) are patterned on glass substrates by a combination of lithographic patterning and e-beam deposition. The inks are printed using a 3-axis micropositioning stage (ABL 900010, Aerotech Inc., Pittsburgh, PA), whose motion is controlled by computer-aided design software (RoboCAD, 3D Inks, Stillwater, OK). The LFP and LTO inks are housed in separate syringes (3 mL barrel, EFD Inc., East Providence, RI), which are attached by luer-lok to a borosilicate micronozzle (30 μ m in diameter produced using a P-2000 micropipette puller, Sutter Instrument Co., Novato, CA). An air-powered fl uid dispenser (800 ultra dispensing system, EFD Inc.) is used to pressurize the barrel and control the ink fl ow rate. The typical printing speed for both LTO and LFP inks by a 30-μ m nozzle is ∼ 250 μ m s -1 at 600 psi. After printing, the structures are annealed at 600 ° C for 2 h in argon gas using a tube furnace. Their microstructures are characterized using SEM (Hitach S-4700). The calculated active mass of the printed LFP and LTO electrodes are 15 and 16 μ g per layer, respectively, based on their fi lament geometry and the measured solids loading of each ink.",
                        "Microbattery packaging : A thin-walled poly(methyl methacrylate) (PMMA) preform is laser cut and placed around the microbattery and sealed with PDMS gel (Sylgard 184, Dow Corning, Inc.), cured at 150 ° C. The assembly is fi lled with liquid electrolyte and sealed with small glass cover using additional PDMS. laser machining contains the microbattery and liquid electrolyte (Figure 4 a). The case dimensions far exceed those needed, and may be reduced by directly printing the polymeric case and liquid (or gel) electrolyte. Cyclic voltammetry performed on the packaged 3D-IMA between 1.0 and 2.5 V at a scan rate of 5 mV s -1 is shown in Figure 4 b. Stable reduction and oxidation peaks occur at 1.3 V and 2.4 V. After cyclic voltammetry, galvanostatic charge and discharge was conducted at a rate of 0.5 C (Figure 4 c). The capacity of the packaged 3D-IMA is 1.2 mAh cm -2 , normalized to the area of the current collector. The packaged battery does not exhibit long-term cyclability due to lack of hermeticity. Effectively packaging microbatteries ( < 1 mm 3 ) that contain liquid (or gel) electrolyte is quite challenging and few examples of stable packaged microbatteries have been reported to date. [ 34 ] Further optimization of microbattery packaging via 3D printing is currently under investigation.",
                        "The Ragone plot in Figure 5 compares the areal energy and power densities of our 3D-IMA with other relevant data recently reported in the literature. [ 10 , 13 , 26-37 ] A complementary Ragone plot that compares their performance in terms of volumetric energy and power density is provided in Figure S4. We do not include data for the fully packaged 3D-IMA in either plot due to the excessively large, non-optimized package dimensions. The printed 3D-IMA compares favorably against its rechargeable counterparts in terms of both areal energy and power density. The excellent performance results from the fabrication of highaspect structures that occupy a small areal footprint, while maintaining reasonably small transport length scales to facilitate facile ion and electron transport during charging and discharging processes. While the low voltage electrochemical couple demonstrated here limits the volumetric energy density, our approach can readily be extended to other commercial lithium ion chemistries, such as LiCoO 2 /graphite, to yield volumetric energy densities competitive with those reported elsewhere. [ 34 , 37 ] In summary, we have printed novel 3D microbatteries composed of high-aspect ratio electrodes in interdigited "
                    ],
                    "subsections": []
                },
                {
                    "title": "Acknowledgements",
                    "paragraphs": [
                        "This material is based upon work supported by the National Science Foundation under award number DMI-0749028 (K.S. and S.J.D.; powder synthesis and battery characterization) and the DOE Energy Frontier Research Center on Light-Material Interactions in Energy Conversion under grant DE-SC0001293 (B.Y.A., T.-S.W., and J.A.L., ink design, formulation and printing). J.Y.S. was supported by a Global Ph.D. Fellowship from the Korean government."
                    ],
                    "subsections": []
                },
                {
                    "title": "Supporting Information",
                    "paragraphs": [
                        "Supporting Information is available from the Wiley Online Library or from the author."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}