{
    "id": "US20190055551",
    "authors": [
        "Alyssa C. Hill",
        "Susan J. Schroeder"
    ],
    "title": "NOVEL pRNA THREE-WAY JUNCTIONS",
    "date": "2017-02-26 00:00:00",
    "abstract": "Three-way junction (3WJ) RNA scaffolds derived from phi29, M2, SF5, and GA1 pRNAs and which have high stability are described. The pRNA 3WJ scaffolds can be used to form compounds, conjugates, compositions, and nanoparticles for delivery of active agents for therapeutic and/or diagnostic functions.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Previous studies have demonstrated that packaging (or prohead) ribonucleic acid (pRNA) three-way junction (3WJ) motifs have applications in biotechnology, such as in targeting of human immunodeficiency virus (HIV) and cancer. For example, the phi29 bacteriophage pRNA 3WJ nanomotif has been extensively studied and successfully used as a building block in the rational design of nanostructures with, for example cancer targeting functionalities (e.g., see U.S. Pat. No. 9,297,013 B2)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate pRNA 3WJ motifs"
                    ],
                    "num_characters": 484,
                    "outline_medium": [
                        "motivate pRNA 3WJ motifs"
                    ],
                    "outline_short": [
                        "motivate pRNA 3WJ motifs"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "One obstacle to using RNA nanomotifs such as pRNA 3WJs as building blocks in the rational design of diagnostics and therapeutics has been their characteristic low stability. Disclosed herein are novel trifurcate pRNA 3WJ motifs and methods of their use to construct compounds which can be used in therapeutic and biotechnology applications, including, but not limited to, therapeutic delivery, diagnosis of diseases, promotion of RNA crystallization, or creation of stable RNA aptamers. The stability of the novel 3WJs contributes to the self-assembly properties of pRNA. Thus pRNA 3WJ motifs disclosed herein indicate new scaffolds for pRNA-based nanotechnology.",
                        "Using a three-component RNA system designed for UV optical melting, the thermodynamic parameters of eleven pRNA 3WJs, including seven mutated phi29 pRNA 3WJs, were measured. The results, discussed further below, show that certain 3WJs such as the GA1, SF5, and M2 pRNA 3WJs described herein have greater thermodynamic stability than the stem phi29 pRNA 3WJ commonly used as a scaffold in RNA-based nanotechnology. Furthermore, certain deletions in the phi29 pRNA 3WJ are shown to increase its stability relative to the stem phi29 pRNA 3WJ. Further, metal ions are shown to have a differential stabilizing effect on pRNA 3WJs.",
                        "Before further describing various embodiments of the trifurcate pRNA 3WJ constructs, nanoparticles, compounds, compositions, and methods of the present disclosure in more detail by way of exemplary description, examples, and results, it is to be understood that the constructs, nanoparticles, compounds, compositions, and methods of present disclosure are not limited in application to the details of specific embodiments and examples as set forth in the following description. The description provided herein is intended for purposes of illustration only and is not intended to be construed in a limiting sense. As such, the language used herein is intended to be given the broadest possible scope and meaning; and the embodiments and examples are meant to be exemplary, not exhaustive. Also, it is to be understood that the phraseology and terminology employed herein is for the purpose of description and should not be regarded as limiting unless otherwise indicated as so. Moreover, in the following detailed description, numerous specific details are set forth in order to provide a more thorough understanding of the present disclosure. However, it will be apparent to a person having ordinary skill in the art that the present disclosure may be practiced without these specific details. In other instances, features which are well known to persons of ordinary skill in the art have not been described in detail to avoid unnecessary complication of the description. It is intended that all alternatives, substitutions, modifications and equivalents apparent to those having ordinary skill in the art are included within the scope of the present disclosure. All of the constructs, nanoparticles, compounds, compositions, and methods of production and application and use thereof disclosed herein can be made and executed without undue experimentation in light of the present disclosure. Thus, while the constructs, nanoparticles, compounds, compositions, and methods of the present disclosure have been described in terms of particular embodiments, it will be apparent to those of skill in the art that variations may be applied to the constructs, nanoparticles, compounds, compositions and/or methods and in the steps or in the sequence of steps of the methods described herein without departing from the concept, spirit, and scope of the inventive concepts.",
                        "All patents, published patent applications, and non-patent publications mentioned in the specification or referenced in any portion of this application, including U.S. Pat. No. 9,297,013, U.S. Pat. No. 8,088,912, and U.S. Provisional Patent Application No. 62/300,517, are herein expressly incorporated by reference in their entirety to the same extent as if each individual patent or publication was specifically and individually indicated to be incorporated by reference.",
                        "Unless otherwise defined herein, scientific and technical terms used in connection with the present disclosure shall have the meanings that are commonly understood by those having ordinary skill in the art. Further, unless otherwise required by context, singular terms shall include pluralities and plural terms shall include the singular. Where used herein, the specific term “single” is limited to only “one”.",
                        "As utilized in accordance with the methods, compounds, and compositions of the present disclosure, the following terms, unless otherwise indicated, shall be understood to have the following meanings:",
                        "The use of the word “a” or “an” when used in conjunction with the term “comprising” in the claims and/or the specification may mean “one,” but it is also consistent with the meaning of “one or more,” “at least one,” and “one or more than one.” The use of the term “or” in the claims is used to mean “and/or” unless explicitly indicated to refer to alternatives only or when the alternatives are mutually exclusive, although the disclosure supports a definition that refers to only alternatives and “and/or.” The use of the term “at least one” will be understood to include one as well as any quantity more than one, including but not limited to, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 30, 40, 50, 100, or any integer inclusive therein. The term “at least one” may extend up to 100 or 1000 or more, depending on the term to which it is attached; in addition, the quantities of 100/1000 are not to be considered limiting, as higher limits may also produce satisfactory results. In addition, the use of the term “at least one of X, Y and Z” will be understood to include X alone, Y alone, and Z alone, as well as any combination of X, Y and Z.",
                        "As used herein, all numerical values or ranges include fractions of the values and integers within such ranges and fractions of the integers within such ranges unless the context clearly indicates otherwise. Thus, to illustrate, reference to a numerical range, such as 1-10 includes 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, as well as 1.1, 1.2, 1.3, 1.4, 1.5, etc., and so forth. Reference to a range of 1-50 therefore includes 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, etc., up to and including 50, as well as 1.1, 1.2, 1.3, 1.4, 1.5, etc., 2.1, 2.2, 2.3, 2.4, 2.5, etc., and so forth. Reference to a series of ranges includes ranges which combine the values of the boundaries of different ranges within the series. Thus, to illustrate reference to a series of ranges, for example, of 1-10, 10-20, 20-30, 30-40, 40-50, 50-60, 60-75, 75-100, 100-150, 150-200, 200-250, 250-300, 300-400, 400-500, 500-750, 750-1,000, includes ranges of 1-20, 10-50, 50-100, 100-500, and 500-1,000, for example.",
                        "As used in this specification and claims, the words “comprising” (and any form of comprising, such as “comprise” and “comprises”), “having” (and any form of having, such as “have” and “has”), “including” (and any form of including, such as “includes” and “include”) or “containing” (and any form of containing, such as “contains” and “contain”) are inclusive or open-ended and do not exclude additional, unrecited elements or method steps.",
                        "The term “or combinations thereof” as used herein refers to all permutations and combinations of the listed items preceding the term. For example, “A, B, C, or combinations thereof” is intended to include at least one of: A, B, C, AB, AC, BC, or ABC, and if order is important in a particular context, also BA, CA, CB, CBA, BCA, ACB, BAC, or CAB. Continuing with this example, expressly included are combinations that contain repeats of one or more item or term, such as BB, AAA, AAB, BBC, AAABCCCC, CBBAAA, CABABB, and so forth. The skilled artisan will understand that typically there is no limit on the number of items or terms in any combination, unless otherwise apparent from the context.",
                        "Throughout this application, the term “about” is used to indicate that a value includes the inherent variation of error for the composition, the method used to administer the composition, or the variation that exists among the study subjects. As used herein the qualifiers “about” or “approximately” are intended to include not only the exact value, amount, degree, orientation, or other qualified characteristic or value, but are intended to include some slight variations due to measuring error, manufacturing tolerances, stress exerted on various parts or components, observer error, wear and tear, and combinations thereof, for example. The term “about” or “approximately”, where used herein when referring to a measurable value such as an amount, a temporal duration, and the like, is meant to encompass, for example, variations of ±20% or ±10%, or ±5%, or ±1%, or ±0.1% from the specified value, as such variations are appropriate to perform the disclosed methods and as understood by persons having ordinary skill in the art. As used herein, the term “substantially” means that the subsequently described event or circumstance completely occurs or that the subsequently described event or circumstance occurs to a great extent or degree. For example, the term “substantially” means that the subsequently described event or circumstance occurs at least 90% of the time, or at least 95% of the time, or at least 98% of the time.",
                        "As used herein any reference to “one embodiment” or “an embodiment” means that a particular element, feature, structure, or characteristic described in connection with the embodiment is included in at least one embodiment and may be included in other embodiments. The appearances of the phrase “in one embodiment” in various places in the specification are not necessarily all referring to the same embodiment and are not necessarily limited to a single or particular embodiment.",
                        "The term “pharmaceutically acceptable” refers to compounds and compositions which are suitable for administration to humans and/or animals without undue adverse side effects such as toxicity, irritation and/or allergic response commensurate with a reasonable benefit/risk ratio. The compounds or conjugates of the present disclosure may be combined with one or more pharmaceutically-acceptable excipients, including carriers, vehicles, and diluents which may improve solubility, deliverability, dispersion, stability, and/or conformational integrity of the compounds or conjugates thereof.",
                        "By “biologically active” it is meant the ability of an active agent to modify the physiological system of an organism without reference to how the active agent has its physiological effects.",
                        "As used herein, “pure,” or “substantially pure” means an object species is the predominant species present (i.e., on a molar basis it is more abundant than any other object species in the composition thereof), and particularly a substantially purified fraction is a composition wherein the object species comprises at least about 50 percent (on a molar basis) of all macromolecular species present. Generally, a substantially pure composition will comprise more than about 80% of all macromolecular species present in the composition, more particularly more than about 85%, more than about 90%, more than about 95%, or more than about 99%. The term “pure” or “substantially pure” also refers to preparations where the object species is at least 60% (w/w) pure, or at least 70% (w/w) pure, or at least 75% (w/w) pure, or at least 80% (w/w) pure, or at least 85% (w/w) pure, or at least 90% (w/w) pure, or at least 92% (w/w) pure, or at least 95% (w/w) pure, or at least 96% (w/w) pure, or at least 97% (w/w) pure, or at least 98% (w/w) pure, or at least 99% (w/w) pure, or 100% (w/w) pure.",
                        "Non-limiting examples of animals within the scope and meaning of this term include dogs, cats, rats, mice, guinea pigs, chinchillas, horses, goats, cattle, sheep, zoo animals, Old and New World monkeys, non-human primates, and humans.",
                        "“Treatment” refers to therapeutic treatments. “Prevention” refers to prophylactic or preventative treatment measures or reducing the onset of a condition or disease. The term “treating” refers to administering the composition to a subject for therapeutic purposes and/or for prevention.",
                        "The terms “therapeutic composition” and “pharmaceutical composition” refer to an active agent-containing composition that may be administered to a subject by any method known in the art or otherwise contemplated herein, wherein administration of the composition brings about a therapeutic effect as described elsewhere herein. In addition, the compositions of the present disclosure may be designed to provide delayed, controlled, extended, and/or sustained release using formulation techniques which are well known in the art.",
                        "The term “effective amount” refers to an amount of an active agent which is sufficient to exhibit a detectable therapeutic or treatment effect in a subject without excessive adverse side effects (such as substantial toxicity, irritation and allergic response) commensurate with a reasonable benefit/risk ratio when used in the manner of the present disclosure. The effective amount for a subject will depend upon the subject's type, size and health, the nature and severity of the condition to be treated, the method of administration, the duration of treatment, the nature of concurrent therapy (if any), the specific formulations employed, and the like. Thus, it is not possible to specify an exact effective amount in advance. However, the effective amount for a given situation can be determined by one of ordinary skill in the art using routine experimentation based on the information provided herein.",
                        "The term “ameliorate” means a detectable or measurable improvement in a subject's condition, disease or symptom thereof. A detectable or measurable improvement includes a subjective or objective decrease, reduction, inhibition, suppression, limit or control in the occurrence, frequency, severity, progression, or duration of the condition or disease, or an improvement in a symptom or an underlying cause or a consequence of the disease, or a reversal of the disease. A successful treatment outcome can lead to a “therapeutic effect,” or “benefit” of ameliorating, decreasing, reducing, inhibiting, suppressing, limiting, controlling or preventing the occurrence, frequency, severity, progression, or duration of a disease or condition, or consequences of the disease or condition in a subject.",
                        "A decrease or reduction in worsening, such as stabilizing the condition or disease, is also a successful treatment outcome. A therapeutic benefit therefore need not be complete ablation or reversal of the disease or condition, or any one, most or all adverse symptoms, complications, consequences or underlying causes associated with the disease or condition. Thus, a satisfactory endpoint may be achieved when there is an incremental improvement such as a partial decrease, reduction, inhibition, suppression, limit, control or prevention in the occurrence, frequency, severity, progression, or duration, or inhibition or reversal of the condition or disease (e.g., stabilizing), over a short or long duration of time (hours, days, weeks, months, etc.). Effectiveness of a method or use, such as a treatment that provides a potential therapeutic benefit or improvement of a condition or disease, can be ascertained by various methods and testing assays.",
                        "Where used herein, the term “three-way junction” (“3WJ”) or “trifurcate” scaffold (or domain) refers to a pRNA construct assembled from three RNA sequences. The pRNA 3WJ is constructed from three (5′→3′) strands of RNA (referred to as 3WJa, 3WJb, and 3WJc as represented in FIG. 1) which base pair when mixed in equimolar concentrations. More particularly, a first (5′→3′) RNA oligonucleotide sequence designated as 3WJa, a second (5′→3′) RNA oligonucleotide sequence designated as 3WJb, and a third (5′→3′) RNA oligonucleotide sequence designated as 3WJc, are combined and base pair to form the trifurcate pRNA 3WJ, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence, wherein each of said first, second, and third branches comprises a helical region having a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds. One, two and/or three of the branches of the 3WJs of the present disclosure may also include non-Watson-Crick nucleotide pairs, such as, but not limited to, G-U.",
                        "In certain non-limiting embodiments, each of the 3WJa, 3WJb, and 3WJc oligonucleotide sequences of the pRNA 3WJ scaffolds of the present disclosure may comprise, independently, from 8 to 36 nucleotides (e.g., 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, or 36 nucleotides) not including RNA linkers or RNA portions of biologically-active moieties conjugated to the pRNA 3WJ scaffold.",
                        "Throughout this disclosure, in reference to mutant constructs, subscripts which include “Δ” represent nucleotide positions of the corresponding wild type pRNA which have been deleted in the mutant. The term “domain” may be used in place of “construct.” The term “downstream” when used in reference to an oligonucleotide sequence refers to a direction toward the 3′ end of the sequence, and “upstream” refers to a direction toward the 5′ end of the sequence.",
                        "Biophysical studies on certain presently disclosed phi29 pRNA 3WJ deletion mutant constructs, M2 pRNA 3WJ deletion mutant constructs, and SF5 pRNA 3WJ deletion mutant constructs revealed their enhanced stability relative to a 3WJ portion (also referred to herein as a “stem”) of a wild-type (WT) phi29 pRNA. Thus, the described deletion mutant constructs can be used as more robust alternatives to current technologies that utilize the WT phi29 pRNA 3WJ stem as a building block for polyvalent, nanoscale delivery systems. The presently disclosed novel pRNA 3WJ constructs have at least one use as an improved drug delivery scaffold due to their enhanced stability over currently used technologies, such as the previously noted WT phi29 pRNA 3WJ motif. Functional RNAs designed using the enhanced stability phi29 pRNA 3WJ deletion mutants disclosed herein or M2, SF5, or GA1 pRNA 3WJs disclosed herein include but are not limited to: therapeutic delivery vehicles to carry various therapeutic, targeting, or diagnostic molecules, including but not limited to siRNAs, ribozymes, riboswitches, aptamers, and antisense RNA, and linkers for connecting such therapeutic, targeting, or diagnostic molecules, such as but not limited to those shown in U.S. Pat. No. 9,297,013 B2. Complete sequences of wild-type phi29, SF5, M2, and GA1 pRNA are shown in U.S. Pat. No. 8,088,912.",
                        "For example, in non-limiting embodiments, an siRNA helix functionally (covalently) attached to the 3WJ scaffold may comprise 10-30, 15-27, or 20-25 nucleotides, and interferes with gene expression through the cleavage of mRNA by a protein/RNA complex named RISC (RNA-induced silencing complex), as also discussed above. The siRNA specifically (e.g., with statistical significance, relative to an appropriate control of irrelevant structure) suppresses the expression of a target protein whose mRNA includes a sequence identical to the sense strand of the siRNA.",
                        "In non-limiting embodiments, a ribozyme may comprise an RNA molecule that has enzymatic activity. Ribozymes have significant therapeutic potential and may be capable of regulating gene function by intercepting and cleaving RNA substrates, such as mRNA or the viral genome of RNA containing a sequence complementary to the catalytic center of the ribozyme.",
                        "In non-limiting embodiments, an RNA aptamer may be a member of a family of oligonucleotides with functions similar to that of antibodies in their ability specifically to recognize ligands (e.g., organic compounds, nucleotides, or peptides) through the formation of binding pockets. Systematic evolution of ligands by exponential enrichment (SELEX) is a method used to screen for aptamers having desired binding specificities, from randomized RNA pools developed in vitro. Using this technique, various aptamers can be selected for targeting markers relevant to diseases.",
                        "In non-limiting embodiments, riboswitches may include RNA components that bind small molecules and control gene expression. As a biological control mechanism, riboswitches can recognize metabolites, induce premature termination of mRNA transcription, block ribosomes from translating mRNAs, cleave mRNAs, and even trigger mRNA destruction.",
                        "In non-limiting embodiments, such RNA moieties including siRNAs, ribozymes, antisense RNAs, aptamers, and riboswitches, as well as other catalytic or editing RNAs can, according to art-accepted methodologies, be readily fused to or conjugated with the 3WJ scaffolds to provide a modular system for the assembly of RNA nanoparticles. Among the advantages of the compounds, compositions and methods as disclosed herein, e.g., for RNA nanomedicine, there are included the attributes of self-assembly, high physicochemical and physiological stability, multi-valency, targeted delivery, protein-free (including advantages associated with being non-immunogenic, non-inflammatory, non-toxic, non-eliciting of lymphokine, chemokine or cytokine responses such as an interferon response), nanoscale size, controlled synthesis with defined structure and stoichiometry, combining therapy and detection of therapy effects into one particle.",
                        "In non-limiting embodiments, each branch of the 3WJ scaffold may be separately functionalized to carry different therapeutic payloads, reporters and/or targeting ligands thereby forming a multivalent compound. Targeted compounds enable cell-type-specific delivery resulting in a lower concentration of the drug to be administered, thus reducing the side effects. The multivalent approach permits certain embodiments to comprise a mixture of therapeutic agents (e.g., different drugs delivered via a different subunit that may be assembled into the 3WJ nanoparticle complexes assembled herein) thereby producing a synergistic effect. The multi-valency offers an additional advantage in these and/or other contemplated embodiments that permit therapy along with detection of therapeutic effects, combined into one nanoparticle that is introduced in a single administration.",
                        "In non-limiting embodiments, RNA nanoparticles comprising the presently disclosed 3WJ scaffolds may be typically and advantageously sized in the nanometer-scale. In non-limiting embodiments, particles ranging from 10-50 nm are suitable as they are large enough to be retained by the body yet small enough to pass through the cell membrane via the cell surface receptor mediated endocytosis. The herein described nanoparticle delivery thus improves the pharmacokinetics, pharmacodynamics, biodistribution, and safety of therapeutic and/or diagnostic agents. Additionally, the protein-free nature of the presently disclosed therapeutic compounds result in these nanoparticles being substantially non-immunogenic; by avoiding the induction of antibodies in a recipient, these embodiments permit safely the repeated administration of the nanoparticles for the treatment of chronic diseases including cancers, viral infections, and genetic ailments.",
                        "In non-limiting embodiments, two or three or even more RNA nanostructure domains (e.g., similar or dissimilar domains such as biologically active moiety-containing or other functional domains, for instance, siRNA, molecular targeting moieties, ribozymes, anti-sense RNA, and aptamers) may be covalently connected to the presently disclosed 3WJ scaffolds."
                    ],
                    "subsections": [
                        {
                            "title": "Experimental",
                            "paragraphs": [
                                "**Materials and Methods**",
                                "pRNA 3WJ Construct Design",
                                "The pRNA 3WJ can be assembled from three RNA oligomers mixed in approximately equimolar concentrations. The pRNA constructs investigated in this study were assembled from three RNA strands designated 3WJa, 3WJb, and 3WJc (FIG. 1A-B). Constructs were designed to encompass the central 3WJ region of folded pRNA, not including the A, CE, and D bulges (FIG. 1A), to form three helices of approximately equal free energies. The pRNA 3WJ constructs utilized herein retained substantial sequence identity to the wild types at the 3WJ “core”, and included changes distal to the 3WJ “core” in certain constructs (e.g., FIGS. 2-3) to ensure that the free energy of helix formation for each branch was within 0.1 kcal/mol. The three oligonucleotide sequences for each 3WJ construct are shown in Table 1. The predicted free energy for each branch duplex includes a helix initiation term that assumes two strands come together independently. This is an overestimation of the penalty of helix formation in the third branch formed because this branch should not have the same entropic penalty in the 3WJ. Thus, the calculated 3WJ free energies shown below (e.g., Table 2) actually underestimate the stabilities of the 3WJs. Oligonucleotides were purchased from Integrated DNA Technologies (IDT) and prepared according to the manufacturer's instructions. Purity was confirmed to be >95% by 32P labeling and gel electrophoresis.",
                                "**UV Optical Melting**",
                                "For each 3WJ construct, the three RNA oligomers 3WJa, 3WJb, and 3WJc were mixed in approximately equimolar concentrations spanning a 100-fold dilution range from 0.4 μM to 40 μM. UV optical melting was performed as described previously (Schroeder and Turner 2009), with variation in the analysis for a three-component RNA system. Briefly, melts were carried out under standard melt buffer conditions (1 M sodium chloride, 10 mM sodium cacodylate, 0.5 mM EDTA, pH 7.0) (Gu et al. 2013) using a Beckman Coulter DU-800 spectrophotometer. Absorbances at 260 and 280 nm were measured as a function of temperature from 4° C. to 90° C., both the largest measurable temperature range and the range for which the midpoint and the constructs' expected Tms were approximately equal. In order to form reproducibly the lowest energy structure, RNA samples were heated to 90° C. and slowly cooled prior to melting or the addition of magnesium. The sodium chloride concentration was reduced by an order of magnitude for melts with 10 mM metal ions, but all other conditions remained the same. Due to the presence of EDTA, the effective Mg2+ concentration may have been slightly less than 10 mM. For each construct, optical melts of single RNA strands 3WJa, 3WJb, and 3WJc and all pairwise combinations were also performed. Melt curves were fit using Meltwin in order to determine melting temperatures, and thermodynamic parameters were determined from van't Hoff plots where the equilibrium constant Keq was given by Eq. 1:",
                                "\\(\\begin{matrix}\n\\frac{1}{\\left( {{C_{T}/2}n} \\right)^{n - 1}} & \\left( {{Eq}.\\mspace{14mu} 1} \\right)\n\\end{matrix}\\)",
                                "where CT=total strand concentration and n=3 for a trimolecular dissociation reaction with equilibria involving non-self-complementary sequences, and where goodness of linear fit, a good estimate of error, was ≥0.90. The sharpness of the melting transition and the linearity of the van't Hoff plots suggest two-state melting; however, the assumption of ΔCp=0 is not rigorously followed. Although the enthalpies show some temperature dependence, there is a large range of error in the enthalpy and heat capacity values. The errors in enthalpy and entropy are correlated, and thus, the free energy still provides a useful, predictive value. Furthermore, corrections for temperature-dependent changes in heat capacity have a small effect within error of the value for the final free energy of the multibranch loop motif, i.e., <0.5 kcal/mol. Thermodynamic stabilities of the pRNA 3WJ nanomotifs were calculated by subtracting the stability contributions of the RNA helices as calculated from the Nearest Neighbor Database (Table 2, FIGS. 6A-6B).\n\npRNA 3WJ Secondary Structure and Free Energy Predictions",
                                "The secondary structure and stability of each pRNA construct was predicted using four RNA secondary structure prediction programs: RNA Structure, RNAfold, mfold, and RNAsoft. For predictions in RNA Structure, RNAfold, and mfold, pRNA strands 3WJa and 3WJb as well as 3WJb and 3WJc were joined with a 5′-aaaa-3′ hairpin and then the construct was folded as a single strand. Free energy predictions were not affected by the position of the hairpins, i.e., whether the hairpins were placed between strands 3WJa and 3WJb and strands 3WJb and 3WJc, between strands 3WJb and 3WJc and strands 3WJc and 3WJa, or between strands 3WJc and 3WJa and strands 3WJa and 3WJb. For predictions in RNAsoft, pRNA strands 3WJa and 3WJb were joined with a 5′-aaaa-3′ hairpin and folded with strand 3WJc. Again, free energy predictions were not affected by the position of the hairpin, i.e., whether the hairpin was placed between strands 3WJa and 3WJb, between strands 3WJb and 3WJc, or between strands 3WJc and 3WJa. For each construct, the most stable structure output by each program was the designed structure. No forced base pairs or single strand constraints were used. To correct for the added hairpins, two 5′-aaaa-3′ hairpin penalties were subtracted from the secondary structure stabilities output by RNA Structure, RNAfold, and mfold. For stabilities predicted by RNAsoft, one 5′-aaaa-3′ hairpin penalty was subtracted. Because the calculations take into account the initiation terms for the 3WJs, their free energies are accurate within error whether in the context of a single-stranded RNA, a duplex, or a three-component system. The entropic penalties for bringing together two oligomers are included in the free energy of initiation terms. The free energies of initiating an RNA hairpin and RNA intermolecular interactions are 5.4±0.2 kcal/mol to 6.4±0.2 kcal/mol (spanning loop lengths n=3 to n=9) and 4.09±0.2 kcal/mol, respectively. Thus, while there is a substantial entropic energy difference in bringing together three oligonucleotide strands compared to a single strand self-folding, the calculation of the free energy of the multibranch loop accounts for this difference and makes comparison of the 3WJ motif comparable in different contexts.",
                                "**Electrophoretic Gel Mobility Shift Assays**",
                                "Formation of the pRNA 3WJ constructs was monitored using electrophoretic gel mobility shift assays (EMSAs). RNA at a concentration of 40 μM in standard melt buffer (1 M sodium chloride, 10 mM sodium cacodylate, 0.5 mM EDTA, pH 7.0) was heated to 80° C. for 10 s and then cooled to 4° C. at a rate of 0.1° C./s in an MJ Research PTC-200 Peltier Thermal Cycler. The RNA was mixed with sucrose loading dye and run in TAE buffer at 50V and 4° C. in pre-cooled, 2% (w/v) agarose stained with ethidium bromide. Mobility of a single RNA strand (phi29 3WJa), a pairwise combination (phi29 3WJa+3WJb), and all assembled pRNA 3WJs were monitored.",
                                "**Results**",
                                "pRNA 3WJ Nanomotif Stabilities",
                                "Thermodynamic parameters determined by UV optical melting for each construct and its respective 3WJ nanomotif are reported in Table 2. The GA1, SF5, and M2 pRNA 3WJs showed greater stability than the stem phi29 pRNA 3WJ (Table 2).",
                                "Melt curves showed very sharp transitions, supporting the assumption of a cooperative transition from the RNA triplex to single-stranded RNAs (FIG. 4A). None of the single strand or pairwise combination melts showed a significant transition that would compete with the 3WJ (data not shown). For example, a melt of phi29 strands 3WJa and 3WJb showed a transition with a melting temperature of 51° C., while the complete 3WJ (i.e., strands 3WJa, 3WJb, and 3WJc together) showed a transition with a melting temperature of 56° C. However, formation of the 3WJ is favored when all three strands are present. As previously shown for non-self-complementary RNA duplexes, the non-self-complementary duplex will form even when the Tm for an alternative conformation of a single strand forming a self-complementary duplex has a higher Tm if the enthalpy is more favorable for the non-self-complementary duplex. Free energies for the 3WJ constructs were calculated from van't Hoff plots, where the goodness of linear fit was ≥0.90 for all melts (FIG. 4B). Thermodynamic stabilities of the pRNA 3WJ nanomotifs were calculated by subtracting the stability contributions of the RNA helices as calculated from the Nearest Neighbor Database (Table 2, FIGS. 6A-6B). The free energies for the investigated 3WJs range from −9.9 kcal/mol to 10.2 kcal/mol (Table 2). By comparison, 1.4 kcal/mol at 37° C. is approximately one order of magnitude in a binding constant. Thus, the range of free energies of formation for the investigated 3WJs spans 14 orders of magnitude in terms of binding constants.",
                                "The phi29 pRNA 3WJ is stabilized when certain uridine (U) residues are deleted from the junction. Specifically, the following two deletion combinations increased stability relative to the WT phi29 pRNA 3WJ: (1) deletion of a single U bulge (U29) in strand 3WJa along with two of the three U residues in the tri-U bulge in strand 3WJb (i.e., U72-73-74); and (2) deletion of all bulge U residues at the 3WJ (i.e., U29/U72-73-74) (Table 2, FIG. 2). Other investigated deletions either did not significantly affect the stability of the phi29 pRNA 3WJ or actively destabilized it (Table 2).",
                                "Of the four RNA secondary structure prediction programs used, none accurately predicted either the actual free energies of the junctions or variations in mutant phi29 pRNA 3WJ stabilities (FIGS. 5A-5B). Best predictions ranged from within 1 kcal/mol of the measured free energy (for phi29ΔU29/ΔU72-73-74, by RNAsoft) to 9 kcal/mol (for phi29ΔU72-73, by RNAfold), while worst predictions ranged from within 1 kcal/mol (for phi29ΔU29/ΔU72-73-74, by RNAsoft) to 11 kcal/mol (for phi29ΔU72-73, by RNAfold). At best, the prediction programs were off by an average of 4 (±2) kcal/mol from measured free energies.",
                                "**Metal Ion Binding**",
                                "The effects of Na+, Mg2+, and spermidine (a 3+ charged species) on pRNA 3WJ construct stabilities are depicted in FIG. 7. Relative to 100 mM NaCl, the phi29 pRNA 3WJ construct was nearly equally stabilized by Mg2+ and spermidine, while the GA1, SF5, and M2 pRNA 3WJ constructs were differentially affected by these ions. Addition of Mg2+ stabilized both the SF5 and M2 pRNA 3WJ constructs. The addition of spermidine had an increasing stabilizing effect on the GA1, SF5, and M2 pRNA 3WJ constructs, respectively (FIG. 7).",
                                "**Electrophoretic Gel Mobility Shift Assays**",
                                "A gel depicting the mobility of all pRNA 3WJ constructs under standard melt buffer conditions (1 M sodium chloride, 10 mM sodium cacodylate, 0.5 mM EDTA, pH 7.0) relative to a single strand (phi29 3WJa) and a pairwise combination (phi29 3WJa+3WJb) is shown in FIG. 8. All 3WJ constructs run at approximately the same rate. Additionally, gels depicting the mobility of each pRNA 3WJ construct relative to each single RNA strand and all pairwise combinations in TMS buffer (50 mM Tris-HCl, pH 7.8, 100 mM NaCl, 10 mM MgCl2) were compared to previous work published on the assembly and stabilities of various biological RNAs (data not shown). For each gel, mobility decreased as more components of the RNA system were added, indicating formation of a higher molecular weight complex. Single strands showed the fastest migration and pairwise combinations showed intermediate migration relative to a slow-migrating band that appeared when all three RNA 3WJ strands were present (FIG. 8), indicating that the three RNA components interact more favorably than any two components, and confirming formation of the pRNA 3WJ from strands 3WJa, 3WJb, and 3WJc.",
                                "**3WJ Stabilities in Relation to Loop-Loop Interaction Stabilities and Self-Assembly**",
                                "Among the investigated pRNA 3WJ constructs, the SF5 and M2 pRNA 3WJs were most thermodynamically stable, making them attractive alternatives to the stem phi29 pRNA 3WJ scaffold used in pRNA-based nanotechnology. Interestingly, these pRNAs also have shown the highest propensity for self-assembly under the laboratory conditions studied thus far. Analyses of our measured 3WJ stabilities with loop-loop interaction stabilities calculated from sequences provided by Gu and Schroeder (Gu and Schroeder 2011, op.cit.) and Hao and Kieft (Hao and Kieft 2014, op.cit.) provide insights into whether the 3WJ nanomotif plays a compensatory role in stabilizing pRNA. The analyses indicated that while loop-loop interactions are all favorable, 3WJs have a wider range of stabilities (FIG. 9A-B). Specifically, the phi29 and GA1 pRNAs have less favorable 3WJ stabilities, while the M2 and SF5 pRNAs have more favorable 3WJ stabilities (FIG. 9A-B). For phi29 and GA1 pRNAs, the loop-loop interaction stabilities are offset by 3WJ stabilities, while for SF5 and M2 pRNAs, the loop-loop interactions and the 3WJ are both stabilizing. The combination of stabilizing nanomotifs may help explain why only SF5 and M2 pRNAs have shown in vitro self-assembly of higher order multimers. Consistent with their increased thermodynamic stabilities and propensities to assemble into higher-order multimers relative to phi29, the SF5 and M2 sequences may both adopt 3WJ pre-organizations that do not require the disruption of existing coaxial stacking or other favorable interactions in order to self-assemble.",
                                "Here we show that the ΔU29/ΔU72-73 and ΔU29/ΔU72-73-74 deletions in the phi29 pRNA 3WJ are stabilizing (Table 2), indicating alternatives to stem phi29 pRNA 3WJ scaffolds in the rational design of functional RNAs.",
                                "Structure-Energetics Relationships in the pRNA 3WJ",
                                "The new thermodynamic data presented here provide a foundation for inferences about RNA structure-energetics relationships, especially for the four bulge U residues at the 3WJ. Non-Watson-Crick base pairing predominates in RNA 3D structure, forming motifs that facilitate RNA-RNA interactions and bind ligands. The phi29 3WJ crystal structure revealed the formation of a cis base pair between the Watson-Crick edges of U29 and U72 as well as base stacking between U29 and U74. By comparison, the phi29 pRNA 3WJ constructs in which U29 and at least one of the three U residues in the tri-U bulge (i.e., U72-73-74) were retained did not appear to have equivalent thermodynamic stabilities, despite the possibility of base pair formation across these constructs' 3WJs. However, the stability of a 3WJ where U29 and two of the three U residues in the tri-U bulge were retained was nearly equal to that of the stem phi29 pRNA 3WJ (4.7 vs. 4.6 kcal/mol, respectively). Interestingly, notable increases in the stability of the phi29 pRNA 3WJ occurred only when one of the U residues in the tri-U bulge was retained (−3.3 kcal/mol), or when all bulge U residues at the 3WJ were deleted (0.6 kcal/mol). Neither of these 3WJs would permit the observed base pairing or base stacking between U residues across the junction, suggesting that pairing and stacking are not the only favorable tertiary interactions stabilizing the junction. These mutations may allow for different, favorable helical coaxial stacking interactions, which may contribute to the stability differences observed.",
                                "Free energy outputs by RNA secondary structure prediction programs were not accurately predictive. While all of the programs implemented in this work utilized the same free energy database, the way that multibranch loops are predicted varies in different RNA structure prediction programs. The prediction may consider all possible conformations of coaxial stacking, include only the single most favorable coaxial stacking arrangement, or include knowledge-based parameters from analysis of known secondary structures. None of the algorithms was able to account for the magnitude of differences observed among the measured stabilities of the 3WJs investigated herein. All programs overestimated the stabilities of the phi29 and GA1 pRNA 3WJ constructs and underestimated the stabilities of the SF5 and M2 pRNA 3WJ constructs (FIGS. 5A-6B). Furthermore, none of the programs' predictions discriminated between the stabilities of constructs with deletions in the stem phi29 pRNA 3WJ. For example, neither the mutant that was shown to have the highest stability, nor the mutant that was shown to have the lowest stability, was predicted as such (FIGS. 5A-6B). Instead, deletion mutants were all predicted to have roughly the same free energies (within ˜1 kcal/mol).",
                                "Prohead RNA (pRNA) is an important component of the phi29-like bacteriophage DNA packaging motor. Due to its stability and self-assembling properties in vitro, pRNA has been used successfully as a scaffold in the rational design of functional RNA supramolecular structures. Prior to the presently disclosed work, the stabilities of pRNA sequences other than phi29 pRNA have been relatively underexplored. The present results demonstrate that certain stem and mutated pRNA 3WJs are more stable than the stem phi29 pRNA 3WJ.",
                                "**Serum Stability**",
                                "In results obtained from UV optical melting studies under standard melt buffer conditions, at least five 3WJs were demonstrated to be more thermodynamically stable (i.e., have a more negative ΔG37) relative to the stem phi29 3WJ (FIG. 2), including GA1 3WJ (FIG. 2), SF5 3WJ (FIG. 3), M2 3WJ (FIG. 3), phi29ΔU29/ΔU72-73 3 WJ (FIG. 12), phi29ΔU29/ΔU72-73-74 3 WJ (FIG. 13) (Table 2). These constructs, comprising 3WJa, 3WJb, and 3WJc sequences, were therefore demonstrated to be highly stable in comparison to the stem phi29 3WJ construct (FIG. 2) under standard melt buffer conditions. In order to probe the correlation between in vitro stability determined by UV optical melting in standard melt buffer and stability in biological fluids, degradation of the above thermostable pRNA 3WJ constructs was monitored after exposure to human blood serum at physiological temperature. RNA strands 3WJa, 3WJb, and 3WJc were mixed in approximately equimolar concentrations and incubated with human blood serum at 37° C. The 3WJs were recovered using phenol extraction/ethanol precipitation and resuspended in standard melt buffer. Degradation was analyzed using gel electrophoresis under the same conditions as outlined above for EMSAs.",
                                "FIG. 10A shows degradation results for the thermostable 3WJ constructs at 10 μM in 2% (w/v) agarose stained with ethidium bromide in TAE buffer following a 10-minute exposure in 100-fold diluted human blood serum. All reactions were carried out at 37° C. Lane (i) 50 bp DNA ladder, (ii) phi29 3WJ construct in standard melt buffer+1 unit RNase T1 (positive degradation control), (iii) phi29 3WJ construct (FIG. 2), (iv) GA1 3WJ construct (FIG. 2), (v) SF5 3WJ construct (FIG. 3), (vi) M2 3WJ construct (FIG. 3), (vii) phi29ΔU29/ΔU72-73 3 WJ construct (FIG. 12A), (viii) phi29ΔU29/ΔU72-73-74 3 WJ construct (FIG. 12B). Standard melt buffer was 1 M sodium chloride, 10 mM sodium cacodylate, and 0.5 EDTA, at pH 7. At least two 3WJ constructs showed less degradation and thus were demonstrated to be more stable in human blood serum relative to the stem phi29 3WJ construct (FIG. 2), including, but not limited to, the SF5 3WJ construct (FIG. 3) the and M2 3WJ construct (FIG. 3). These constructs, comprising 3WJa, 3WJb, and 3WJc sequences, were therefore demonstrated to be highly stable in comparison to the stem phi29 3WJ construct (FIG. 2). FIG. 10B shows further degradation results for the previously demonstrated serum-stable 3WJ constructs and mutant SF5 3WJ constructs at 10 μM in 2% (w/v) agarose stained with ethidium bromide in TAE buffer following a 10-minute exposure to 100-fold diluted human blood serum from a second blood donor. All reactions were carried out at 37° C. Lane (i) 50 bp DNA ladder, (ii) phi29 3WJ construct in standard melt buffer (negative degradation control), (iii) phi29 3WJ construct, (iv) M2 3WJ construct, (v) SF5 3WJ construct, (vi) SF5ΔG31 3 WJ construct, (vii) SF5ΔG69 3 WJ construct, SF5ΔG-31/ΔG-69 3 WJ construct. The mutant SF5 3WJ constructs SF5ΔG31 and SF5ΔG31/ΔG69 show improved stability in human blood serum relative to the SF5 3WJ construct.",
                                "FIGS. 10A-10B compare pRNA 3WJ constructs' stabilities in human blood serum from two different donors. These serum stability assay results indicate that the SF5 and M2 3WJ constructs and SF5ΔG31 and SF5ΔG31/ΔG69 deletion mutant 3WJ constructs are more stable in human blood serum than the stem phi29 3WJ construct. The SF5 and M2 3WJ constructs also showed greater stability than the GA1 3WJ construct and phi29ΔU29/ΔU72-73 and Phi29ΔU29/U72-73-74 deletion mutant 3WJ constructs.",
                                "Further time course analysis was conducted on the stem phi29 3WJ (FIG. 2), SF5 3WJ (FIG. 3), and M2 3WJ (FIG. 3) constructs. Gel mobility results are shown in FIG. 11. 3WJ constructs (10 μM) were analyzed in 2% (w/v) agarose stained with ethidium bromide in TAE buffer following exposure to 1000-fold diluted human blood serum for 10 minutes, 30 minutes, and 1 hour. All reactions were carried out at 37° C. Lane (i) 50 bp DNA ladder, (ii) 3WJ construct in standard melt buffer (1 M sodium chloride, 10 mM sodium cacodylate, 0.5 EDTA, pH 7) for 1 hour, (iii) 3WJ construct in 1000-fold diluted serum for 10 minutes, (iv) 3WJ construct in 1000-fold diluted serum for 30 minutes, (v) 3WJ construct in 1000-fold diluted serum for 1 hour. Both M2 and SF5 3WJ constructs were confirmed as more stable in human blood serum over time than the stem phi29 3WJ construct.",
                                "**Melting Temperatures**",
                                "Melting temperatures (Tms) for various 3WJ constructs at approximately 40 μM were determined by UV optical melting as outlined above (Table 3). Error in Tm is estimated to be ±1° C. The SF5, M2, phi29ΔU29/ΔU72-73, SF5ΔG69, and SF5ΔG31/ΔG-69 3 WJ constructs have a significantly higher melting temperature than the stem phi29 3WJ construct at 40 μM, indicating higher stability.",
                                "**Examples**",
                                "The inventive concepts of the present disclosure, having now been generally described, will be more readily understood by reference to the following additional examples and embodiments, which are included merely for purposes of illustration of certain aspects and embodiments thereof, and are not intended to be limiting. The following detailed examples are to be construed, as noted above, only as illustrative, and not as limitations of the disclosure in any way whatsoever. Those skilled in the art will promptly recognize appropriate variations from the various constructs, nanoparticles, compositions, components, procedures and methods.",
                                "Included in the non-limiting examples below are three-sequence sets of pRNA oligonucleotides (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to assemble various 3WJ constructs which may be formed and used in accordance with the teachings of the present disclosure. Any of the three-sequence sets described below or elsewhere herein may be assembled into 3WJ scaffolds to which biologically-active moieties are covalently linked (via connection to one of more of the branches of the 3WJ) to form the conjugates used in accordance with the present disclosure.",
                                "In at least one embodiment, the present disclosure is directed to an RNA junction scaffold, comprising: a three-way junction (3WJ) construct, the 3WJ construct comprising a 3WJa sequence comprising a first RNA oligonucleotide, a 3WJb sequence comprising a second RNA oligonucleotide, and a 3WJc sequence comprising a third RNA oligonucleotide, wherein a first branch of the 3WJ construct is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence, a second branch of the 3WJ construct is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence, and a third branch of the 3WJ construct is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence, wherein each of said branches comprises a helical region having a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJb sequence comprises a single unpaired nucleotide (e.g., U) in a position between the helical region of the second branch and the helical region of the third branch, or in the 3WJc sequence in a position between the helical region of the first branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence comprises only two adjacent unpaired nucleotides (e.g., CA) in the second branch, the 3WJb sequence comprises a single unpaired nucleotide (e.g., C) in a position between the helical region of the second branch and the helical region of the third branch, and the 3WJc sequence comprises only two adjacent unpaired nucleotides (e.g., CU) in a position between the helical region of the first branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence comprises a single unpaired nucleotide in the second branch (e.g., G), and the 3WJb sequence comprises only two unpaired nucleotides (e.g., GG) in a position between the helical region of the second branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence is absent an unpaired nucleotide in the second branch, and the 3WJb sequence comprises only two unpaired nucleotides (e.g., GG) in a position between the helical region of the second branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence is absent an unpaired nucleotide in the second branch, and the 3WJb sequence comprises only a single unpaired nucleotide (e.g., G) in a position between the helical region of the second branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence comprises a single unpaired nucleotide (e.g., G), and the 3WJb sequence comprises a single unpaired nucleotide (e.g., G) in a position between the helical region of the second branch and the helical region of the third branch.",
                                "In at least one embodiment of the RNA junction scaffold, the 3WJa sequence comprises a single unpaired nucleotide (e.g., G) in a position between the helical region of the first branch and the helical region of the second branch, and a single unpaired nucleotide (e.g., G) downstream of the first helical region, in a portion of the second branch (e.g., G), and the 3WJc sequence comprises a single unpaired nucleotide (e.g., A) in a position between the helical region of the first branch and the helical region of the third branch.",
                                "A stem phi29 pRNA 3WJ construct (FIG. 2) derived from a wild type phi29 pRNA comprises three unpaired nucleotides (UUU) in the 3WJb sequence in positions corresponding to positions 72, 73, and 74 of the entire wild type phi29 pRNA in a location between the helical region of the second branch and the helical region of the third branch, and comprises an unpaired nucleotide U in the 3WJa sequence in a position corresponding to position 29 in the wild type phi29 pRNA in a location between the helical region of the first branch and the helical region of the second branch (wherein position numbers correspond to the sequences of the entire wild type phi29 pRNA). At least one embodiment of the present disclosure is directed to a phi29 pRNA 3WJ deletion mutant construct (phi29ΔU29/ΔU72-73 in FIG. 12) that lacks two of the unpaired nucleotides U (U72 and U73) in the 3WJb sequence in a position between the second helical region and the third helical region, and lacks the single unpaired nucleotide U (U29) in the 3WJa sequence between the first helical region and the second helical region.",
                                "A stem M2 3WJ construct (FIG. 14) derived from a wild type M2 pRNA comprises two adjacent unpaired nucleotides (AU) situated at positions 36 and 37 in the M2 3WJa sequence of the second branch and an unpaired nucleotide (A) situated at position 79 in the M2 3WJb sequence of the third branch of the construct (position numbers correspond to the sequences of the entire wild type M2 pRNA). At least one embodiment of the present disclosure is directed to an M2 pRNA 3WJ deletion mutant construct (M2ΔAUA) in FIG. 3) that lacks the two unpaired nucleotides AU which correspond to positions 36 and 37 in the WT 3WJa sequence of the second branch, and lacks the unpaired nucleotide A which corresponds to position 79 in the WT 3WJb sequence of the third branch of the construct.",
                                "A stem SF5 3WJ construct (FIG. 3) comprises an unpaired nucleotide (G) at position 31 of a 3WJa sequence of the second branch and two adjacent unpaired nucleotides (GG) at positions 69 and 70 of the 3WJb sequence in a location between the helical region of the second branch and the helical region of the third branch (position numbers correspond to the sequence of the entire wild type SF5 pRNA). Certain embodiments of the present disclosure are directed to SF5 pRNA 3WJ deletion mutant constructs that lacks one, two, or three of the unpaired nucleotides of the 3WJa and 3WJb sequences of the SF5 3WJ, such as G31 (SF5ΔG31) of the 3WJa sequence (e.g., FIG. 32), G69 (SF5ΔG69) of the 3WJB sequence, (e.g., FIG. 37), both G31 and G69 (SF5ΔG31/ΔG69) of the 3WJa and 3WJb sequences (e.g., FIG. 42), or G31, G69, and G70 (SF5ΔG31/ΔG69-70) of the 3WJa and 3WJb sequences.",
                                "A stem GA1 3WJ construct (FIG. 2) derived from a wild type GA1 pRNA comprises a single unpaired nucleotide (G) situated at position 27 of the 3WJa sequence in a location between the helical region of the first branch and the helical region of the second, a single unpaired nucleotide (G) situated at position 32 of the 3WJa sequence in a location in the second branch of the construct, and a single unpaired nucleotide (A) situated at position 89 of the 3WJc sequence in a location between the helical region of the first branch and the helical region of the third branch (position numbers correspond to the sequences of the entire wild type GA1 pRNA). At least one embodiment of the present disclosure is directed to a GA1 pRNA 3WJ deletion mutant construct lacking an unpaired nucleotide at one of positions 27, 32, or 89, or lacking two unpaired nucleotides at positions 27 and 32, or 27 and 89, or 32 and 89.",
                                "The following are non-limiting examples of phi29 pRNA three-sequence sets (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to base pair various 3WJ constructs of the present disclosure (Examples 1-13 are represented in FIGS. 12, 13, and 15-26, and generically in FIGS. 48-49):",
                                "The following examples 14-32 are non-limiting examples of M2 pRNA three-sequence sets (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to base pair various 3WJ constructs of the present disclosure (Examples 14, 29-31, and 27 are represented in FIGS. 3, and 27-31, respectively, and generically in FIG. 50):",
                                "The following examples 33-47 are non-limiting examples of SF5 pRNA three-sequence sets (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to base pair various 3WJ constructs of the present disclosure (Examples 33-47 are represented in FIGS. 32-46, respectively, and generically in FIGS. 51-53):",
                                "The following example 48 is a non-limiting example of GA1 pRNA three-sequence sets (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to base pair various 3WJ constructs of the present disclosure (Example 48 is represented in FIG. 47 and generically in FIG. 54):",
                                "The following Examples 49-56 are non-limiting generic representations pRNA three-sequence sets (3WJa, 3WJb, and 3WJc sequence strands, 5′→3′) which may be used to base pair various 3WJ constructs of the present disclosure, including Examples 49-50 (FIGS. 48-49) for phi29 3WJ, Example 51 (FIG. 50) for M2 3WJ, Example 52-55 (FIGS. 51-53) for SF5 3WJs, and Example 56 (FIG. 54) for GA1 3WJ. W and C represent nucleotides which form pairs when assembled in the 3WJ from the 3WJa, 3WJb, and 3WJc strands and N represents an unpaired nucleotide in the assembled 3WJ.",
                                "FIGS. 48-49 (Examples 49-50) depict embodiments of a generic phi29 pRNA 3WJ mutant constructs of the present disclosure. As explained above, each 3WJ construct comprises three branches, each comprising a helical region, with each helical region comprising a plurality nucleotide base pairs (W-C) forming canonical Watson-Crick bonds (e.g., G-C, C-G, U-A, A-U), and which also may contain a single unpaired nucleotide N (i.e., C, G, A, or U) in a position in the 3WJb sequence between the helical region of the second branch and the helical region of the third branch as shown in FIG. 48, or in a position in the 3WJc sequence between the helical region of the first branch and the helical region of the third branch as shown in FIG. 49. Non-Watson-Crick nucleotide base pairs which may occur in one or more of the branches of the 3WJs of FIGS. 48 and 49 include, for example, G-U, U-G, U-C, C-U, G-A, A-G, A-C, and C-A.",
                                "FIG. 50 (Example 51) depicts an embodiment of a generic M2 pRNA 3WJ mutant construct of the present disclosure. The M2 3WJ construct comprises three branches, each comprising a helical region, with each helical region comprising a plurality of nucleotide base pairs (W-C) forming canonical Watson-Crick bonds (e.g., G-C, C-G, U-A, A-U), and which also contains two adjacent unpaired nucleotides N (i.e., C, G, A, or U) in 3WJa in the second branch, a single unpaired nucleotide N (i.e., C, G, A, or U) in a position in the 3WJb sequence between the helical region of the second branch and the helical region of the third branch, and a pair of adjacent unpaired nucleotides N (e.g., selected from C, G, A, and U) in a position in the 3WJc sequence between the helical region of the third branch and the helical region of the first branch as shown in FIG. 50. Non-Watson-Crick nucleotide base pairs which may occur in one or more of the branches of the 3WJs of FIG. 50 include, for example, G-U, U-G, U-C, C-U, G-A, A-G, A-C, and C-A.",
                                "FIGS. 51-53 (Examples 52-55) depict embodiments of a generic SF5 pRNA 3WJ mutant construct of the present disclosure. The SF5 3WJ construct comprises three branches, each comprising a helical region, with each helical region comprising a plurality of nucleotide base pairs (W-C) forming canonical Watson-Crick bonds (e.g., G-C, C-G, U-A, A-U). The embodiment of FIG. 51 contains a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJa in the second branch, and two adjacent unpaired nucleotides N (i.e., C, G, A, or U) in 3WJb in a position between the helical region of the second branch and the helical region of the third branch. The embodiment of FIG. 52 contains two adjacent unpaired nucleotides N (i.e., C, G, A, or U) in 3WJb in a position between the helical region of the second branch and the helical region of the third branch. The embodiment of FIG. 53 contains a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJa in the second branch, and a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJb in a position between the helical region of the second branch and the helical region of the third branch. The embodiment of Example 54 is similar to FIGS. 51-53 except the 3WJ construct contains only a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJb in a position between the helical region of the second branch and the helical region of the third branch, and lacks unpaired nucleotides which correspond to G31 in the second branch and G69 in a position between the helical region of the second branch and the helical region of the third branch. Non-Watson-Crick nucleotide base pairs which may occur in one or more of the branches of the 3WJs of FIGS. 51-53 and Example 54 include, for example, G-U, U-G, U-C, C-U, G-A, A-G, A-C, and C-A.",
                                "FIG. 54 (Example 56) depicts an embodiment of a generic GA1 pRNA 3WJ mutant construct of the present disclosure. The GA1 3WJ construct comprises three branches, each comprising a helical region, with each helical region comprising a plurality of nucleotide base pairs (W-C) forming canonical Watson-Crick bonds (e.g., G-C, C-G, U-A, A-U). The embodiment of FIG. 54 contains a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJa in a position between the helical region of the first branch and the helical region of the second branch, a single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJa in the second branch, and single unpaired nucleotide N (i.e., C, G, A, or U) in 3WJc in a position between the helical region of the first branch and the helical region of the third branch.",
                                "Furthermore, individual 3WJa, 3WJb, and 3WJc strands disclosed herein may be combined in three-sequence sets different from the combinations shown explicitly in the examples. For example, for alternate M2 3WJ constructs, SEQ ID NOS: 61, 63, and 64 could be combined, or SEQ ID NOS: 65, 63, and 60 could be combined. Similar alternate combinations could be made for phi29 and SF5 3WJ constructs.",
                                "As noted above, the pRNA 3WJ constructs described above can be used as a scaffold to which is linked, via the one or more branches, at least one biologically active moiety to form a conjugate, complex, or nanoparticle. At least one embodiment of the present disclosure is directed to a multivalent oligomeric complex comprising a plurality of monomers, each monomer comprising an RNA 3WJ scaffold to which at least one biologically-active moiety is linked. As described elsewhere herein, the biologically active moiety may be a therapeutic drug, antibody, marker, dye, siRNA, ribozyme, riboswitch, and/or aptamer. The therapeutic drug, antibody, marker, dye, siRNA, ribozyme, riboswitch, and/or aptamer may be linked, directly, or via a linker molecule such as an oligonucleotide, to one of the three oligonucleotide sequences 3WJa, 3WJb, or 3WJc before the three oligonucleotide sequences 3WJa, 3WJb, and 3WJc are combined in a mixture and self-assemble into the 3WJ. One, two, or three of the oligonucleotide sequences 3WJa, 3WJb, and 3WJc may be linked to a therapeutic drug, antibody, marker, dye, siRNA, ribozyme, riboswitch, and/or aptamer to form the conjugate, complex, or nanoparticle. Non-RNA moieties can be linked to the pRNA 3WJ domains in any suitable manner. For example, folate can be conjugated into adenosine 5′-monophosphate (AMP) by 1,6-hexanediamine linkages. After reverse HPLC to reach 93% purity, the folate-AMP can be incorporated into the 5′-end of the phi29 pRNA. For example, a 16:1 ratio of folate-AMP to ATP in transcription resulted in more than 60% of the pRNA containing folate (Gene Ther. 2006 May; 13(10):814-20.). Numerous other methods for conjugation of chemicals to RNA are known to persons having ordinary skill in the art, such as are shown in Chem Soc Rev. 2010 June; 39(6):2054-70. Other linking methods and biologically-active moieties are shown in U.S. Pat. No. 9,297,013 B2.",
                                "In accordance with the foregoing, the present disclosure is directed to, in at least certain embodiments:",
                                "Clause 1. An RNA junction scaffold comprising a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and two unpaired nucleotides are positioned in the 3WJa sequence in the second branch, and (ii) two adjacent unpaired nucleotides are positioned in the 3WJc sequence between the first helical region and the third helical region, and one unpaired nucleotide is positioned in the 3WJb sequence between the second helical region and the third helical region.",
                                "Clause 2. The RNA junction scaffold of clause 1, wherein the 3WJa sequence comprises SEQ ID NO:73, the 3WJb sequence comprises SEQ ID NO:74, and the 3WJc sequence comprises SEQ ID NO:75.",
                                "Clause 3. The RNA junction scaffold of either clause 1 or 2, wherein the second branch is absent adjacent unpaired nucleotides in positions corresponding to unpaired adenine and uracil nucleotides in positions 36 and 37, respectively, of a wild type M2 pRNA, and wherein the third branch is absent an unpaired nucleotide in a position corresponding to an unpaired adenine nucleotide in position 79 of said wild type M2 pRNA.",
                                "Clause 4. The RNA junction scaffold of any one of clauses 1-3, absent one or more unpaired nucleotides in the 3WJa sequence downstream of the two unpaired nucleotides present in the 3WJa sequence.",
                                "Clause 5. The RNA junction scaffold of any one of clauses 1-4, absent an unpaired nucleotide in the 3WJb sequence downstream of the unpaired nucleotide present in the 3WJb sequence.",
                                "Clause 6. The RNA junction scaffold of any one of clauses 1-5, absent one or more unpaired nucleotides in the 3WJa sequence downstream of the two unpaired nucleotides present in the 3WJa sequence, and absent an unpaired nucleotide in the 3WJb sequence downstream of the unpaired nucleotide present in the 3WJb sequence.",
                                "Clause 7. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and one unpaired nucleotide is positioned in the 3WJa sequence in the second branch, and (ii) two adjacent unpaired nucleotides are positioned in the 3WJb sequence between the second helical region and the third helical region.",
                                "Clause 8. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and is absent at least one of (1) an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 31 of a wild type SF5 pRNA, and (2) an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
                                "Clause 9. The RNA junction scaffold of clause 8, absent an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 31 of a wild type SF5 pRNA.",
                                "Clause 10. The RNA junction scaffold of either clause 8 or 9, wherein the 3WJa sequence comprises SEQ ID NO:86, the 3WJb sequence comprises SEQ ID NO:87, and the 3WJc sequence comprises SEQ ID NO:88.",
                                "Clause 11. The RNA junction scaffold of any one of clauses 8-10, absent an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
                                "Clause 12. The RNA junction scaffold of any one of clauses 8-11, wherein the 3WJa sequence comprises SEQ ID NO:97, the 3WJb sequence comprises SEQ ID NO:98, and the 3WJc sequence comprises SEQ ID NO:88.",
                                "Clause 13. The RNA junction scaffold of any one of clauses 8-12, absent (1) an unpaired nucleotide in a position corresponding to an unpaired nucleotide in position 31 of a wild type SF5 pRNA, and (2) an unpaired guanine nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
                                "Clause 14. The RNA junction scaffold of any one of clauses 8-13, wherein the 3WJa sequence comprises SEQ ID NO:86, the 3WJb sequence comprises SEQ ID NO:98, and the 3WJc sequence comprises SEQ ID NO:88.",
                                "Clause 15. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein the 3WJa sequence is absent an unpaired nucleotide in a position between the first helical region and the second helical region corresponding to an unpaired uridine nucleotide in position 29 of a wild type phi29 pRNA positioned, and is absent two unpaired nucleotides in positions corresponding to two unpaired uridine nucleotides in positions 72 and 73 of said wild type phi29 pRNA.",
                                "Clause 16. The RNA junction scaffold of clause 15, wherein the 3WJa sequence comprises SEQ ID NO:37, the 3WJb sequence comprises SEQ ID NO:39, and the 3WJc sequence comprises SEQ ID NO:40.",
                                "Clause 17. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence comprises a single unpaired nucleotide positioned between the first helical region and the second helical region, and an unpaired nucleotide positioned in the 3WJa sequence in the second branch downstream of the unpaired nucleotide positioned between the first helical region and the second helical region, and (ii) a single unpaired nucleotide positioned in the 3WJc sequence between the first helical region and the third helical region.",
                                "Clause 18. The RNA junction scaffold of clause 17, wherein the 3WJa sequence comprises SEQ ID NO:99, the 3WJb sequence comprises SEQ ID NO:100, and the 3WJc sequence comprises SEQ ID NO:101.",
                                "Clause 19. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) zero or one unpaired nucleotide is positioned in the 3WJa sequence between the first helical region and the second helical region, and/or one or two unpaired nucleotides are positioned in the 3WJa sequence in the second branch, and (ii) one unpaired or two adjacent unpaired nucleotides are positioned in the 3WJc sequence between the first helical region and the third helical region, and/or one unpaired or two adjacent unpaired nucleotides are positioned in the 3WJb sequence between the second helical region and the third helical region.",
                                "Clause 20. A conjugate comprising the RNA 3WJ scaffold of any one of clauses 1-19 linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
                                "Clause 21. A composition, comprising the conjugate of clause 20, and a pharmaceutically-acceptable vehicle, carrier, or diluent.",
                                "Clause 22: The RNA junction scaffold of any one of clauses 1-19, wherein each of the 3WJa, 3WJb, and 3WJc sequences comprises, independently, from 8 to 36 nucleotides, not including RNA linkers or an RNA portion of a biologically-active moiety conjugated to the RNA scaffold.",
                                "The pRNA 3WJ scaffolds, compounds, conjugates, compositions, nanoparticles, and methods of production and application thereof disclosed herein can be made and executed without undue experimentation in light of the present disclosure. While the present disclosure has been described in connection with certain embodiments so that aspects thereof may be more fully understood and appreciated, it is not intended that the present disclosure be limited to these particular embodiments. On the contrary, it is intended that all alternatives, modifications and equivalents are included within the scope of the present disclosure. Thus the examples described above, which include particular embodiments, will serve to illustrate the practice of the present disclosure, it being understood that the particulars shown are by way of example and for purposes of illustrative discussion of particular embodiments only and are presented in the cause of providing what is believed to be the most useful and readily understood description of procedures as well as of the principles and conceptual aspects of the presently disclosed methods and compositions. Changes may be made in the formulation of the various compositions described herein, the methods described herein or in the steps or the sequence of steps of the methods described herein without departing from the spirit and scope of the present disclosure."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce pRNA 3WJ construct design",
                                "describe RNA oligomer assembly",
                                "specify RNA strand sequences",
                                "detail UV optical melting procedure",
                                "explain thermodynamic parameter determination",
                                "describe pRNA 3WJ secondary structure and free energy predictions",
                                "introduce RNA secondary structure prediction programs",
                                "detail free energy prediction methods",
                                "correct for hairpin penalties",
                                "discuss entropic penalties",
                                "introduce electrophoretic gel mobility shift assays",
                                "describe EMSA procedure",
                                "report pRNA 3WJ nanomotif stabilities",
                                "analyze melt curves",
                                "discuss thermodynamic stabilities",
                                "calculate free energies",
                                "compare free energies to binding constants",
                                "investigate uridine residue deletions",
                                "evaluate RNA secondary structure prediction programs",
                                "discuss metal ion binding effects",
                                "depict metal ion binding effects",
                                "analyze electrophoretic gel mobility shift assays",
                                "confirm pRNA 3WJ formation",
                                "introduce pRNA 3WJ constructs",
                                "describe thermodynamic stability",
                                "analyze loop-loop interaction stabilities",
                                "discuss 3WJ stabilities",
                                "explain structure-energetics relationships",
                                "describe phi29 pRNA 3WJ crystal structure",
                                "discuss base pairing and stacking",
                                "evaluate free energy outputs",
                                "compare predicted and measured stabilities",
                                "introduce serum stability",
                                "describe UV optical melting studies",
                                "analyze degradation in human blood serum",
                                "compare serum stability of 3WJ constructs",
                                "discuss time course analysis",
                                "determine melting temperatures",
                                "introduce examples",
                                "describe RNA junction scaffold",
                                "define 3WJ construct",
                                "describe branches of 3WJ construct",
                                "discuss helical regions",
                                "introduce embodiment with single unpaired nucleotide",
                                "introduce embodiment with two adjacent unpaired nucleotides",
                                "introduce embodiment with single unpaired nucleotide in second branch",
                                "introduce embodiment with absent unpaired nucleotide",
                                "describe 3WJa sequence",
                                "describe 3WJb sequence",
                                "describe 3WJc sequence",
                                "describe RNA junction scaffold",
                                "introduce phi29 pRNA 3WJ construct",
                                "describe 3WJa sequence",
                                "describe 3WJb sequence",
                                "describe 3WJc sequence",
                                "introduce M2 3WJ construct",
                                "describe 3WJa sequence",
                                "describe 3WJb sequence",
                                "describe 3WJc sequence",
                                "introduce SF5 3WJ construct",
                                "describe 3WJa sequence",
                                "describe 3WJb sequence",
                                "describe 3WJc sequence",
                                "introduce GA1 3WJ construct",
                                "describe 3WJa sequence",
                                "describe 3WJb sequence",
                                "describe 3WJc sequence",
                                "provide non-limiting examples of phi29 pRNA three-sequence sets",
                                "provide non-limiting examples of M2 pRNA three-sequence sets",
                                "provide non-limiting examples of SF5 pRNA three-sequence sets",
                                "provide non-limiting examples of GA1 pRNA three-sequence sets",
                                "describe generic phi29 pRNA 3WJ mutant constructs",
                                "describe generic M2 pRNA 3WJ mutant constructs",
                                "describe generic SF5 pRNA 3WJ mutant constructs",
                                "describe generic GA1 pRNA 3WJ mutant constructs",
                                "describe use of pRNA 3WJ constructs as scaffolds",
                                "describe linking biologically active moieties to pRNA 3WJ domains",
                                "describe conjugation of chemicals to RNA",
                                "describe linking methods and biologically-active moieties",
                                "claim RNA junction scaffold",
                                "define RNA junction scaffold",
                                "specify second branch absence",
                                "specify third branch absence",
                                "specify 3WJa sequence absence",
                                "specify 3WJb sequence absence",
                                "specify combined 3WJa and 3WJb sequence absence",
                                "describe three-way junction domain",
                                "describe modified three-way junction domain",
                                "specify absence of unpaired nucleotide",
                                "specify sequence IDs",
                                "specify additional absence of unpaired nucleotide",
                                "specify alternative sequence IDs",
                                "specify combined absence of unpaired nucleotides",
                                "specify alternative sequence IDs",
                                "describe modified three-way junction domain",
                                "specify sequence IDs",
                                "describe modified three-way junction domain",
                                "specify sequence IDs",
                                "describe modified three-way junction domain",
                                "describe conjugate composition",
                                "describe pharmaceutical composition",
                                "specify sequence length",
                                "provide general disclosure statement"
                            ],
                            "num_characters": 52448,
                            "outline_medium": [
                                "design pRNA 3WJ constructs",
                                "describe UV optical melting method",
                                "perform UV optical melting experiments",
                                "predict pRNA 3WJ secondary structure and free energy",
                                "describe electrophoretic gel mobility shift assays",
                                "perform electrophoretic gel mobility shift assays",
                                "report pRNA 3WJ nanomotif stabilities",
                                "analyze melt curves and thermodynamic parameters",
                                "investigate metal ion binding effects",
                                "analyze electrophoretic gel mobility shift assay results",
                                "discuss 3WJ stabilities in relation to loop-loop interaction stabilities and self-assembly",
                                "introduce pRNA 3WJ constructs",
                                "analyze thermodynamic stability",
                                "discuss structure-energetics relationships",
                                "evaluate free energy predictions",
                                "describe serum stability experiments",
                                "analyze serum stability results",
                                "discuss melting temperatures",
                                "introduce examples of pRNA oligonucleotides",
                                "describe RNA junction scaffold embodiments",
                                "specify 3WJb sequence features",
                                "specify 3WJa sequence features",
                                "specify 3WJc sequence features",
                                "provide additional RNA junction scaffold embodiments",
                                "describe RNA junction scaffold",
                                "specify 3WJa sequence",
                                "specify 3WJb sequence",
                                "specify 3WJc sequence",
                                "describe phi29 pRNA 3WJ construct",
                                "describe M2 3WJ construct",
                                "describe SF5 3WJ construct",
                                "describe GA1 3WJ construct",
                                "provide non-limiting examples of phi29 pRNA three-sequence sets",
                                "provide non-limiting examples of M2 pRNA three-sequence sets",
                                "provide non-limiting examples of SF5 pRNA three-sequence sets",
                                "provide non-limiting example of GA1 pRNA three-sequence set",
                                "describe generic representations of pRNA three-sequence sets",
                                "describe use of pRNA 3WJ constructs as scaffolds for biologically active moieties",
                                "claim RNA junction scaffold with specific sequences and structure",
                                "define RNA junction scaffold",
                                "specify absence of unpaired nucleotides",
                                "describe three-way junction domain",
                                "specify absence of unpaired nucleotides in 3WJa sequence",
                                "specify absence of unpaired nucleotides in 3WJb sequence",
                                "describe RNA junction scaffold with specific sequences",
                                "specify absence of unpaired nucleotides in specific positions",
                                "describe conjugate comprising RNA 3WJ scaffold",
                                "describe composition with conjugate and pharmaceutically-acceptable vehicle",
                                "specify length of 3WJa, 3WJb, and 3WJc sequences",
                                "provide general statement on scope of disclosure"
                            ],
                            "outline_short": [
                                "design pRNA 3WJ constructs",
                                "perform UV optical melting",
                                "predict pRNA 3WJ secondary structure and free energy",
                                "perform electrophoretic gel mobility shift assays",
                                "analyze results of pRNA 3WJ nanomotif stabilities",
                                "present experimental results",
                                "discuss structure-energetics relationships",
                                "analyze serum stability",
                                "report melting temperatures",
                                "provide examples of pRNA oligonucleotides",
                                "describe RNA junction scaffold embodiments",
                                "describe RNA junction scaffold",
                                "provide examples of phi29 pRNA 3WJ constructs",
                                "provide examples of M2 pRNA 3WJ constructs",
                                "provide examples of SF5 pRNA 3WJ constructs",
                                "provide examples of GA1 pRNA 3WJ constructs",
                                "describe generic pRNA three-sequence sets",
                                "describe conjugates, complexes, or nanoparticles formed using pRNA 3WJ scaffolds",
                                "define RNA junction scaffold",
                                "describe variations of RNA junction scaffold",
                                "specify sequences of RNA junction scaffold",
                                "describe conjugates and compositions of RNA junction scaffold",
                                "provide general statements on scope and modifications"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce RNA nanomotifs",
                        "describe limitations of pRNA 3WJs",
                        "disclose novel trifurcate pRNA 3WJ motifs",
                        "describe self-assembly properties of pRNA",
                        "measure thermodynamic parameters of pRNA 3WJs",
                        "show greater stability of certain 3WJs",
                        "describe effect of deletions on phi29 pRNA 3WJ stability",
                        "describe effect of metal ions on pRNA 3WJ stability",
                        "provide disclaimer on scope of disclosure",
                        "define terms used in disclosure",
                        "describe use of \"a\" and \"an\" in claims",
                        "define \"or combinations thereof\"",
                        "describe use of \"about\" and \"approximately\"",
                        "define \"substantially\"",
                        "describe use of \"one embodiment\"",
                        "define \"pharmaceutically acceptable\"",
                        "define \"biologically active\"",
                        "define \"pure\" and \"substantially pure\"",
                        "provide examples of animals",
                        "define \"treatment\" and \"prevention\"",
                        "define \"therapeutic composition\" and \"pharmaceutical composition\"",
                        "define \"effective amount\"",
                        "define \"ameliorate\"",
                        "describe therapeutic benefit",
                        "define \"three-way junction\" and \"trifurcate\" scaffold",
                        "describe pRNA 3WJ construction",
                        "describe branches of 3WJ domain",
                        "describe non-Watson-Crick nucleotide pairs",
                        "describe length of 3WJa, 3WJb, and 3WJc oligonucleotide sequences",
                        "describe mutant constructs",
                        "describe biophysical studies on deletion mutant constructs",
                        "describe enhanced stability of deletion mutant constructs",
                        "describe use of deletion mutant constructs as drug delivery scaffolds",
                        "describe functional RNAs designed using deletion mutant constructs",
                        "describe siRNA helix attached to 3WJ scaffold",
                        "describe ribozyme function",
                        "describe RNA aptamer function",
                        "describe riboswitch function",
                        "describe fusion of RNA moieties to 3WJ scaffolds",
                        "describe advantages of RNA nanoparticles",
                        "describe self-assembly of RNA nanoparticles",
                        "describe multivalency of RNA nanoparticles",
                        "describe targeted delivery of RNA nanoparticles",
                        "describe nanoscale size of RNA nanoparticles",
                        "describe controlled synthesis of RNA nanoparticles",
                        "describe combination of therapy and detection in RNA nanoparticles",
                        "describe protein-free nature of RNA nanoparticles",
                        "describe safety of RNA nanoparticles"
                    ],
                    "num_characters": 24077,
                    "outline_medium": [
                        "introduce RNA nanomotifs",
                        "describe limitations of pRNA 3WJs",
                        "disclose novel trifurcate pRNA 3WJ motifs",
                        "describe thermodynamic parameters of pRNA 3WJs",
                        "show increased stability of certain 3WJs",
                        "describe effect of metal ions on pRNA 3WJs",
                        "provide disclaimer on scope of disclosure",
                        "define terms used in specification",
                        "describe use of \"a\" and \"an\"",
                        "define \"or combinations thereof\"",
                        "describe use of \"about\" and \"approximately\"",
                        "define \"substantially\"",
                        "describe use of \"one embodiment\"",
                        "define \"pharmaceutically acceptable\"",
                        "define \"biologically active\"",
                        "define \"pure\" and \"substantially pure\"",
                        "describe non-limiting examples of animals",
                        "define \"treatment\" and \"prevention\"",
                        "define \"therapeutic composition\" and \"pharmaceutical composition\"",
                        "define \"effective amount\"",
                        "define \"ameliorate\"",
                        "describe three-way junction (3WJ) scaffold",
                        "describe biophysical studies on pRNA 3WJ deletion mutant constructs",
                        "describe functional RNAs designed using enhanced stability phi29 pRNA 3WJ deletion mutants"
                    ],
                    "outline_short": [
                        "introduce RNA nanomotifs and their limitations",
                        "describe novel trifurcate pRNA 3WJ motifs and their use",
                        "discuss thermodynamic parameters of pRNA 3WJs",
                        "describe metal ion effects on pRNA 3WJ stability",
                        "provide general description of disclosure scope",
                        "define terms used in the disclosure",
                        "describe meaning of \"about\" and \"substantially\"",
                        "define \"pharmaceutically acceptable\" and \"biologically active\"",
                        "describe \"effective amount\" and \"ameliorate\"",
                        "define \"three-way junction\" and \"trifurcate\" scaffold",
                        "describe pRNA 3WJ deletion mutant constructs and their use",
                        "discuss functional RNAs designed using enhanced stability phi29 pRNA 3WJ deletion mutants"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and two unpaired nucleotides are positioned in the 3WJa sequence in the second branch, and (ii) two adjacent unpaired nucleotides are positioned in the 3WJc sequence between the first helical region and the third helical region, and one unpaired nucleotide is positioned in the 3WJb sequence between the second helical region and the third helical region.",
        "2. The RNA junction scaffold of claim 1, wherein the 3WJa sequence comprises SEQ ID NO:73, the 3WJb sequence comprises SEQ ID NO:74, and the 3WJc sequence comprises SEQ ID NO:75.",
        "3. The RNA junction scaffold of claim 1, wherein the second branch is absent adjacent unpaired nucleotides in positions corresponding to unpaired adenine and uracil nucleotides in positions 36 and 37, respectively, of a wild type M2 pRNA, and wherein the third branch is absent an unpaired nucleotide in a position corresponding to an unpaired adenine nucleotide in position 79 of said wild type M2 pRNA.",
        "4. The RNA junction scaffold of claim 1, absent one or more unpaired nucleotides in the 3WJa sequence downstream of the two unpaired nucleotides present in the 3WJa sequence.",
        "5. The RNA junction scaffold of claim 1, absent an unpaired nucleotide in the 3WJb sequence downstream of the unpaired nucleotide present in the 3WJb sequence.",
        "6. The RNA junction scaffold of claim 1, absent one or more unpaired nucleotides in the 3WJa sequence downstream of the two unpaired nucleotides present in the 3WJa sequence, and absent an unpaired nucleotide in the 3WJb sequence downstream of the unpaired nucleotide present in the 3WJb sequence.",
        "7. A conjugate comprising the RNA 3WJ scaffold of claim 1, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "8. A composition, comprising the conjugate of claim 7, and a pharmaceutically-acceptable vehicle, carrier, or diluent.",
        "9. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and one unpaired nucleotide is positioned in the 3WJa sequence in the second branch, and (ii) two adjacent unpaired nucleotides are positioned in the 3WJb sequence between the second helical region and the third helical region.",
        "10. A conjugate comprising the RNA 3WJ scaffold of claim 9, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "11. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein the 3WJa sequence is absent an unpaired nucleotide positioned between the first helical region and the second helical region, and is absent at least one of (1) an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 31 of a wild type SF5 pRNA, and (2) an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
        "12. The RNA junction scaffold of claim 11, absent an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 31 of a wild type SF5 pRNA.",
        "13. The RNA junction scaffold of claim 12, wherein the 3WJa sequence comprises SEQ ID NO:86, the 3WJb sequence comprises SEQ ID NO:87, and the 3WJc sequence comprises SEQ ID NO:88.",
        "14. The RNA junction scaffold of claim 11, absent an unpaired nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
        "15. The RNA junction scaffold of claim 14, wherein the 3WJa sequence comprises SEQ ID NO:97, the 3WJb sequence comprises SEQ ID NO:98, and the 3WJc sequence comprises SEQ ID NO:88.",
        "16. The RNA junction scaffold of claim 11, absent (1) an unpaired nucleotide in a position corresponding to an unpaired nucleotide in position 31 of a wild type SF5 pRNA, and (2) an unpaired guanine nucleotide in a position corresponding to an unpaired guanine nucleotide in position 69 of said wild type SF5 pRNA.",
        "17. The RNA junction scaffold of claim 16, wherein the 3WJa sequence comprises SEQ ID NO:86, the 3WJb sequence comprises SEQ ID NO:98, and the 3WJc sequence comprises SEQ ID NO:88.",
        "18. A conjugate comprising the RNA 3WJ scaffold of claim 11, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "19. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein the 3WJa sequence is absent an unpaired nucleotide in a position between the first helical region and the second helical region corresponding to an unpaired uridine nucleotide in position 29 of a wild type phi29 pRNA positioned, and is absent two unpaired nucleotides in positions corresponding to two unpaired uridine nucleotides in positions 72 and 73 of said wild type phi29 pRNA.",
        "20. The RNA junction scaffold of claim 19, wherein the 3WJa sequence comprises SEQ ID NO:37, the 3WJb sequence comprises SEQ ID NO:39, and the 3WJc sequence comprises SEQ ID NO:40.",
        "21. A conjugate comprising the RNA 3WJ scaffold of claim 19, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "22. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) the 3WJa sequence comprises a single unpaired nucleotide positioned between the first helical region and the second helical region, and an unpaired nucleotide positioned in the 3WJa sequence in the second branch downstream of the unpaired nucleotide positioned between the first helical region and the second helical region, and (ii) a single unpaired nucleotide positioned in the 3WJc sequence between the first helical region and the third helical region.",
        "23. The RNA junction scaffold of claim 22, wherein the 3WJa sequence comprises SEQ ID NO:99, the 3WJb sequence comprises SEQ ID NO:100, and the 3WJc sequence comprises SEQ ID NO:101.",
        "24. A conjugate comprising the RNA 3WJ scaffold of claim 22, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "25. An RNA junction scaffold, comprising: a three-way junction (3WJ) domain, the 3WJ domain comprising a 3WJa sequence comprising a first RNA polynucleotide, a 3WJb sequence comprising a second RNA polynucleotide, and a 3WJc sequence comprising a third RNA polynucleotide, wherein a first branch of the 3WJ domain is formed from a 5′ portion of the 3WJa sequence and a 3′ portion of the 3WJc sequence and comprises a first helical region, a second branch of the 3WJ domain is formed from a 3′ portion of the 3WJa sequence and a 5′ portion of the 3WJb sequence and comprises a second helical region, and a third branch of the 3WJ domain is formed from a 3′ portion of the 3WJb sequence and a 5′ portion of the 3WJc sequence and comprises a third helical region, wherein each of said helical regions comprises a plurality of RNA nucleotide pairs that form canonical Watson-Crick bonds, and wherein (i) zero or one unpaired nucleotide is positioned in the 3WJa sequence between the first helical region and the second helical region, and/or one or two unpaired nucleotides are positioned in the 3WJa sequence in the second branch, and (ii) one unpaired or two adjacent unpaired nucleotides are positioned in the 3WJc sequence between the first helical region and the third helical region, and/or one unpaired or two adjacent unpaired nucleotides are positioned in the 3WJb sequence between the second helical region and the third helical region.",
        "26. A conjugate comprising the RNA 3WJ scaffold of claim 25, linked to at least one moiety selected from the group consisting of therapeutic drugs, antibodies, markers, dyes, siRNAs, ribozymes, riboswitches, and aptamers.",
        "27. A composition, comprising the conjugate of claim 25, and a pharmaceutically-acceptable vehicle, carrier, or diluent.",
        "28. The RNA junction scaffold of claim 25, wherein each of the 3WJa, 3WJb, and 3WJc sequences comprises, independently, from 8 to 36 nucleotides, not including an RNA linker or an RNA portion of a biologically-active moiety conjugated to the RNA scaffold."
    ]
}