{
    "id": "https://semopenalex.org/work/W2517153324",
    "authors": [
        "Abbas Fotouhi",
        "Václav Knap",
        "Gregory J. Offer",
        "Monica Marinescu",
        "Daniel J. Auger",
        "Stefano Longo",
        "Laura O’Neill",
        "Karsten Propp",
        "Mark Wild",
        "Geraint Minton",
        "Karthik Somasundaram"
    ],
    "title": "Multi-temperature state-dependent equivalent circuit discharge model for lithium-sulfur batteries",
    "date": "2016-10-01",
    "abstract": "Lithium-sulfur (Li-S) batteries are described extensively in the literature, but existing computational models aimed at scientific understanding are too complex for use in applications such as battery management. Computationally simple models are vital for exploitation. This paper proposes a non-linear state-of-charge dependent Li-S equivalent circuit network (ECN) model for a Li-S cell under discharge. Li-S batteries are fundamentally different to Li-ion batteries, and require chemistry-specific models. A new Li-S model is obtained using a ‘behavioural’ interpretation of the ECN model; as Li-S exhibits a ‘steep’ open-circuit voltage (OCV) profile at high states-of-charge, identification methods are designed to take into account OCV changes during current pulses. The prediction-error minimization technique is used. The model is parameterized from laboratory experiments using a mixed-size current pulse profile at four temperatures from 10 °C to 50 °C, giving linearized ECN parameters for a range of states-of-charge, currents and temperatures. These are used to create a nonlinear polynomial-based battery model suitable for use in a battery management system. When the model is used to predict the behaviour of a validation data set representing an automotive NEDC driving cycle, the terminal voltage predictions are judged accurate with a root mean square error of 32 mV.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "To increase an acceptance and a demand of electric vehicles (EV's) among the public, there is a need to overcome range anxiety [1]. Since the range of EVs is strongly connected to their energy storage, there is a request for a low cost and safe operating battery with high specific energy. Potentially fulfilling these requirements, the lithium-sulfur (Li-S) chemistry is a prospective replacement of the current lithium-ion (Li-ion) battery technology [2,3]. However, Li-S batteries still suffer from fast degradation and high self discharge [4], which leads the modelling community to be focused on elucidating the complex inner mechanisms governing the cell behaviour. Despite being essential for Li-S technology uptake, operational models and on-line diagnostic tools, capable of predicting and controlling the batteries performance in operation are lacking in the literature. Recently, commercial Li-S cells have become available (e.g. those supplied by OXIS Energy [5], Sion Power, Polyplus), offering the opportunity for application oriented research. In the framework of electric mobility this translates into investigating the cell's performance under the power and temperature demands of an EV [6]. For established battery chemistries, models have been developed, providing varying levels of insight into the cells' internal processes, at varying computational cost [7]. Since the computational power of a typical electronic control unit (ECU) or battery management system (BMS) is limited, simple lowcomplexity battery models are often needed for application oriented purposes. Examples of such simplified models are equivalent electrical circuit networks (ECN), which reproduce the transient behaviour of a battery with a circuit of electrical components, including resistors, capacitors and a voltage source [8]. The structure of these models is often independent of the cell chemistry, and as such they are not able to give insight into the cell's physical, chemical and electrochemical processes [9]. However, for Li-ion batteries, they have been successfully used for estimating the internal states, such as state of charge (SoC) and measures of battery health such as increase in resistance and decrease in effective capacity [10] (In this paper, only SoC will be considered in detail). Usually they have relatively low computational effort and use easily available measurements like current and terminal voltage. For Li-S batteries ECN models of varying accuracy and complexity have been developed in Ref. [11e14]. These models have been developed for the purpose of analyzing impedance spectroscopy data, such that they describe the cell at a fixed SoC. Because of this they are unsuited to describe performance during cycling. For an OXIS Li-S cell a first operational model including two parallel resistorcapacitor (RC) pairs, has been developed recently with good prediction of the charging process [15]. Furthermore, a comparison of ECN topologies for Li-S batteries in terms of accuracy, and a parameter identification for a three RC model for the same kind of cell were presented in Ref. [16]. In this paper, we introduce the complete framework for developing a Li-S battery model with one RC element, suitable for BMS use, and evaluate its accuracy. Thereby our approach follows the development of a standard ECN model for Li-ion batteries; parametrizing the circuit by fitting pulse discharge data. In order to investigate the temperature dependence of the various circuit parameters for the OXIS Li-S cell, here the parametrization is done for four different temperatures. Also, some of the open questions regarding the suitability of this approach to parametrize the unique properties of Li-S cells are discussed. Therefore we, after a brief introduction into the general requirements for a Li-S battery model (Section 2), (i) use a robust parameter estimation technique developed for Li-S cells, accounting for OCV differences before and after a current pulse (Section 3e4), (ii) apply a novel mixed current pulse test procedure to explore current-dependencies of the model parameters (Section 5), and (iii) identify the cell parameters at four different temperatures (Section 6). The validation of a simplified model is done in Section 7 and Section 8."
            ],
            "subsections": []
        },
        {
            "title": "From Li-ion to Li-S modelling",
            "paragraphs": [
                "In the literature, there are many examples of established Li-ion battery models [9,17]. The purpose of one kind, the ECN models, is to predict the output voltage, the available capacity and the degradation at relatively low computational cost [8]. These models are successful enough to be widely used in applications. The main reason for their success is that the intercalation-based chemistry of the Li-ion battery offers a relatively consistent and predictable performance when operated within its limits of charge, temperature and current rates [10]. This is not the case for the Li-S batteries, because they are based on conversion reactions rather than on intercalation. Sulfur reacts with lithium ions when reduced from elemental state S 8 , via the intermediates Li 2 S 8 ,Li 2 S 4 ,Li 2 S 2 , to lithium sulfide Li 2 S [18] (Fig. 1), offering theoretically a capacity of 1672 mAh g-1 [19].",
                "However, the practical capacities currently achieved are significantly lower [9,19], mainly due to poor sulfur utilisation and fast degradation [20]. High order polysulfides are highly soluble and reactive [21] in organic electrolytes, while low order polysulfides tend to be insoluble and form an electrically insulating precipitate [4]. The details of the reduction path during discharge are still a matter of ongoing research and are probably more complex [22]. The discharge curve exhibits two regions [23] (Fig. 2): a high plateau at about 2.35 V open circuit voltage (OCV), characterized by the presence of a majority of high order polysulfides in solution (Li 2 S 8 , Li 2 S 6 ), and a low plateau at around 2.1 V OCV, where lower order chains have been identified (Li 2 S 4 , Li 2 S 3 , Li 2 S 2 ), including Li 2 S which can precipitate out [24]. With the growing amount of insulating Li 2 S 2 and Li 2 S, the practical discharge stops at about 1256 mAh g -1 , indicated by the increasing cell resistance [25,26]. While charging, the oxidation of low order polysulfides forms high order chains. However, they do not all become elemental sulfur. Highly soluble, high order polysulfides diffuse to the anode and, in contact with its surface, are reduced to lower order chains. These can diffuse back to the cathode, where they are oxidised back to longer chains. This phenomenon, called the polysulfide shuttle [27], can act as overcharge protection [19], but is also responsible for self discharge and poor coulombic efficiency, and associated with capacity fade [27,28].",
                "To identify requirements and challenges towards a fully operational low order Li-S battery model, some Li-ion approaches are listed and examined for their suitability for the Li-S chemistry."
            ],
            "subsections": [
                {
                    "title": "Voltage curve",
                    "paragraphs": [
                        "The OCV of Li-ion batteries can be measured after some rest time and is sensitive to the SoC [10] and weakly influenced by temperature [29]. Therefore it is usually represented by a variable voltage source with a function or lookup table over SoC, which simplifies the SoC estimation for those batteries [30]. Li-ion has a known predictable and reproducible temperature dependence on OCV. However, lithium sulfur due to the presence of multiple species and multiple reactions between those species has a highly variable and state dependent temperature dependence on OCV, where the state dependence can be a function of the history of the cell going back many cycles. Attempts to model the OCV [31] have been made, but are yet to include the full temperature dependence, which would be necessary to accurately reproduce this effect. Furthermore, in the low plateau, the OCV is not an indication for the SoC since it will always return to about 2.15 V, when given enough time after current is removed. (The time required will depend on the final voltage, but is typically no longer than 2 h) Additionally, the presence of self-discharge and precipitation further complicate the dependence of the rest voltage on the SoC, meaning that it is unclear how one would reliably obtain experimental data for the OCV as a function of the SoC [31]. The transient voltage behaviour of Li-ion batteries are represented by RC circuits, supplemented by parameter-functions for SoC, temperature, current and cycle number. Since the variations of the model parameters for cycle number and currents are usually small [32], they tend to be neglected or simplified [33]. For Li-S batteries the opportunities for these simplifications are unknown for practical BMS applications."
                    ],
                    "subsections": []
                },
                {
                    "title": "Capacity",
                    "paragraphs": [
                        "To handle variations of the usable capacity in Li-ion cells, a rate factor can be applied [29]. But since the variations of the usable capacity are usually small, they are also handled with the internal resistance, causing the voltage drops to increase with higher rates and therefore cause different SoC's for the same end-of-discharge voltage [33]. For the Li-S batteries however, the amount of sulfur that can be reversibly utilised during a discharge is strongly affected by the current profile, cycling and temperature [34]. Generally high discharge capacity is only obtained at very low rates. High currents can produce a resistive layer on the cathode, hindering the utilisation of the underlying sulfur [23], leading to strong changes in the usable capacity. Cell operation for optimal utilisation of sulfur remains a challenge and is still a matter of ongoing research [11,19,35]."
                    ],
                    "subsections": []
                },
                {
                    "title": "Power capability",
                    "paragraphs": [
                        "For Li-ion batteries the power limitations are governed by the diffusion of ions into the electrodes, which is mainly defined by the battery design [36] and therefore not considered to vary rapidly with normal usage. For Li-S batteries, the specific factors limiting rate capability during operation are unknown. Slow diffusion of species through the electrolyte, bottlenecks in the electrochemical reaction pathway, and reduced availability of active surfaces are some of the possible reasons for power limitation. Generally, the polysulfide kinetics in the high plateau region are fast, leading to good rate capabilities and low cell resistance. However, the high plateau usually accounts for merely 10%e30% of a cycled cell's capacity [37]. At the boundary between the two plateaus a peak in cell resistance is observed, possibly caused by an increase in electrolyte viscosity, due to a high concentration of dissolved polysulfides. A further increase in the resistance at the end of the discharge is associated with precipitation of lower order polysulfides, leading to a decrease in the availability of both active species and active surface area. The operating temperature does impact power capability, for Li-S as well as for Li-ion cells, as lower temperatures lead to slower diffusion and lower reaction rates. However the potential for Li-S batteries to work in cold environments is seen as greater [37] "
                    ],
                    "subsections": []
                },
                {
                    "title": "Degradation",
                    "paragraphs": [
                        "For Li-ion the major degradation modes in ECN models are the decreasing rate capability and capacity fade, caused by parasitic reactions at the anode, leading to a growth of the solid-electrolyte interphase (SEI) [38], and the consumption of active material [39]. For Li-S batteries, the degradation modes are not well known [22], and it is unclear which lead to reversible and which to irreversible degradation. Probable causes include the irreversible growth of insulating layers on the anode [40] and possibly cathode, and the associated loss in active material [41]. Much of the degradation is believed to be related to the polysulfide shuttle. In order to prevent it, overcharging is generally avoided, despite not being a safety issue in comparison to Li-ion chemistries.",
                        "The comparison shows that the Li-S chemistry is more complex in its reactions as well as the electrical behaviour than current Liion batteries. The unique Li-S features, (i) two regions with different properties, (ii) a flat voltage profile, (iii) self discharge mechanism during charging, (vi) high sensitivity of the usable capacity and power to cycling parameters such as current profile or temperatures, indicate a higher effort towards an application oriented model. It is not clear yet, how accurately these effects have to be represented for future Li-S BMS systems."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Parameter identification",
            "paragraphs": [
                "There are many techniques for system identification, but a good 'industry standard' is prediction-error minimization (PEM), a full description of which can be found in Ljung's seminal work on system identification [42]. The key concept behind PEM is that of the 'prediction error', which is estimated based on recorded observations, describing the model yðtÞ ¼ Gðq; qÞuðtÞ þ Hðq; qÞeðtÞ (1) as a predictor of the next output. Where G represents the transfer function, q the forward shift operator, H(q,q)e(t) the disturbance of the system and q is a parameter vector. The parameter vector consists of the unknown model parameters: for an ECN model, for example, it might be electrical component values. In system identification, a metric is defined, usually as a mathematical norm, such as the 'prediction error' εðt; qÞ between the measured data y(t) and the model prediction b yðtÞ is used; an identification algorithm seeks to minimize this norm, and the minimizing parameter vector, denoted q N , gives the best fit. The prediction error minimization algorithm uses numerical optimization to minimize the cost function V N (q), a weighted norm of the prediction error, e.g.  samples and becomes more accurate for larger values. PEM system identification is applied to each current pulse individually. To get an accurate result, the estimation window was set to 300 s before and after each pulse."
            ],
            "subsections": []
        },
        {
            "title": "Battery model set",
            "paragraphs": [
                "The quality of the identification strongly depends on the model set. In this section, a new linearized version of a nonlinear SoCdependent ECN model is presented. First, a Thevenin model [43,44] (Fig. 3) is expressed in terms of its parameter dependence on SoC. The model is then reparameterized in terms of 'behaviour', rather than component values. The model is then linearized in a way that captures the dependence of the model behaviour on changing state of charge. This parameterization provides a number of benefits over a standard ECN model: (i) The application of constraints to behaviours is possible, which makes it possible to relate constraints to observed behaviours; without a behavioural parameterization, such parameterizations are less straightforward. (Dynamic bandwidth, for example, is a function of two equivalent circuit parameters in an RC pair; in the new parameterization, it is a single behavioural parameter.) (ii) The linearized form of the model explicitly captures terms relating to short-term changes in dynamic behaviour due to changes in ECN parameters caused by changing SoC. (In conventional ECN models, parameters are usually assumed constant over a short time period, but this can cause problems when the SoC has a significant short-term effect, e.g. a noticeable change in OCV during a system identification experiment.",
                "These benefits make the model suitable for system identification tests such as those conducted in this study.",
                "This work differs from the 'cyclic resistometry' analytical parameter technique [45] in that where cyclic resistometry attempts to measure a single physical parameter e the electrode resistance e with a series of high-frequency pulses, the techniques of this paper simultaneously identifies all ECN parameters with a 'behavioural' rather than physical interpretation. "
            ],
            "subsections": []
        },
        {
            "title": ". Basic model equations",
            "paragraphs": [
                "Consider a generic Thevenin model with ECN parameter dependence on SoC Xdthis is a capital 'c' not a capital 'x'. Following common practice, the current I L is treated as the input and the load voltage is taken as the output. Using the symbolic notation of Fig. 3, the output equation is",
                "where",
                "The system has two dynamic states: state-of-charge, X, and 'capacitor' voltage U p . The state derivatives are given by",
                "where Q cap is the capacity (in coulombs) of the battery or cell under consideration, and",
                "where"
            ],
            "subsections": [
                {
                    "title": "Behavioural reparameterization",
                    "paragraphs": [
                        "The ECN model expressed above is perhaps a little cumbersome. During system identification, it is often desirable to constrain parameter searches to sensible ranges. In battery identification, the operator will be particularly concerned to see how well steadystate model behaviour matches reality, what the bandwidth (or time constant) of the model is, and how much of the response is (as far as can be observed) instantaneous and how much lags. It is important not to lose sight of the fact that ECN models were chosen because their behaviour represents observed cell behaviour, not because there is a particular physical significance to the circuit elements employed.",
                        "Our circuit can be made more intuitive by working in terms of some new 'behavioural' variables:",
                        "Here, U p represents the dynamic bandwidth described by R p and C p . R int is the total steady-state resistance, and effectively governs the 'settled' voltage drop due to a constant current. r p represents the 'dynamic fraction' of the response: when r p is zero, the voltage response is wholly instantaneous, and when r p is one, the response is wholly dynamic. Using this parameterization, it is relatively easy to write down behavioural constraints, e.g. ",
                        "The output function and state derivative functions can be rewritten in terms of the new parameterization:",
                        "This parameterization of the model is numerically identical to the original ECN model, but there are no longer any 'reciprocal' parameters and the application of parameter constraints is straightforward and intuitive. Giving a set behavioural parameters it is of course straightforward to map these back to 'conventional' ECN parameters noting that R p ðXÞ ¼ r p ðXÞR int ðXÞ;",
                        "and",
                        "4.2. Linearized cell model"
                    ],
                    "subsections": []
                },
                {
                    "title": "Motivations for linearization",
                    "paragraphs": [
                        "For system identification, it is common to use linearized models. In many practical approaches, it is assumed that state-dependent parameters vary sufficiently slowly to be treated as constants, and the nonlinear ECN model is effectively used as a linear model with 'frozen' SoC. Unfortunately, this does not always work. When a battery or cell is subject to a high-current discharge pulse, the change in SoC can be sufficient to cause a drop in the OCV between the start and the end of the pulse (as depicted in Figs. 3 and4). This does not fit well with the linear model. One way to get round this in practice is subtract a voltage term representing the drop on U OC caused by a change in SoC. More formally, a full linearization of the nonlinear model can be performed. When this is done, it will be seen that the nonlinear model contains all the expected 'ECN terms' but also two additional terms that we might perhaps not have expected. This is shown in the following sections."
                    ],
                    "subsections": []
                },
                {
                    "title": "Definition of operating point",
                    "paragraphs": [
                        "The first step in the linearization process is to define an operating point. In this case, the dynamic state pair X; U L will be assumed. The nominal input is current, chosen such that _ U L ¼ 0:",
                        "and the nominal output is",
                        "(Usually, operating points are chosen to represent equilibria. The operating point that has been chosen here is not strictly-speaking an equilibrium unless I L ¼ 0 since in general _ Xs0. But that does not matter: the mathematics holds regardless.) As a next step, variables describing perturbations from nominal values are defined:",
                        "This allows us to express what is essentially a 'small-signal' model, though such terms are rarely used in the formal language of control theory."
                    ],
                    "subsections": []
                },
                {
                    "title": "Linear state-space representation",
                    "paragraphs": [
                        "We can define a state vector",
                        "and form a linearized model: ",
                        "The terms of c T are",
                        "Fig. 4. Mixed pulse discharge and test installation.",
                        "the terms of A are",
                        "and the terms of b T are",
                        "We can therefore write:",
                        "An important thing to note here is that there are two terms in these matrices that we might not intuitively expect if we were simply writing down the equations for an ECN circuit: c 11 which relates changes in SoC to the open circuit voltage, and a 21 which relates changes in SoC to the capacitor voltage.",
                        "As a final step, we can apply a state transformation:",
                        "In this form, the model lends itself well to system identification. As well as the core behavioural equivalent circuit parameters U oc , R int , r p and U p dwhich also give R o , R p and C p dthere are two 'free' parameters c 11 ' and a 0 21 that can accommodate parameter changes within a system identification data set caused by c 0 11 . For the purposes of this study, it has been assumed that the effect of SoC on OCV is the dominant distorting effect, as it can be seen from the data that U oc changes between the start and end of a pulse (Fig. 4). Accordingly, a 0 21 has been assumed small, but c 0 11 has been accommodated in system identification."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Experimental design",
            "paragraphs": [
                "The battery model parameters are identified through discharge tests within temperatures from 10 C to 50 C. To identify the current dependencies of the model parameters without potential ageing effects, the cells were tested with current pulses of 290 mA, 1450 mA and 2900 mA with a 10 min resting time in between (Fig. 4). The measurement procedure contained pre-cycled (C/10 charge, C/5 discharge, 30 C) 3.4 Ah long-life chemistry pouch cells from OXIS Energy, following their recommended voltage range between 2.45 V, when the battery is fully charged (SoC ¼ 100%), and 1.5 V, when the battery is fully discharged (SoC ¼ 0%). We have taken a practical definition of state-of-charge, essentially 'remaining capacity', and we have defined the end point of the test as the first instant at which the terminal voltage reaches 1.5 V, in line with the manufacturer's recommondation.",
                "The test hardware included a Maccor 4000 battery tester with cells constantly held at temperature in sealed aluminium boxes with a Binder KB53 thermal chamber, also shown in Fig. 4."
            ],
            "subsections": []
        },
        {
            "title": "Identification results",
            "paragraphs": [
                "Since the tested cells are not mass produced, deviations in their discharge capacity or parameters are possible (see Table 1).",
                "Therefore the identification has been done with two cells respectively. But since the identified parameters follow the same pattern, only the results for cell one are presented.",
                "The identification results for the model parameters are repeated over the whole discharge range for each current pulse individually, by calculating the SoC from the integrated current, the discharge capacity of the cycle, and the assumption of an initially fully charged battery (Fig. 5). (In this work SoC is a dimensionless variable, with 0 representing fully discharged and 1 representing fully charged, following the pattern in Ref. [10].)",
                "The average SoC is assigned for each pulse respectively by using its the start-and end-value of the SoC estimation",
                "Fig. 6 shows the identification results for each pulse over SoC, emphasising the current dependencies of the parameters. Generally the results corresponds well with previous studies. The peak of R 0 between both voltage plateaus, also reported in Ref. [22], is associated with the increased viscosity and therefore resistance of the electrolyte, due to the maximum of dissolved polysulfides in the electrolyte at this point [46]. Also due to the electrolytes conductivity, a slight increase of the internal resistance with lower temperatures is reported for a fully charged cell [12]. Additionally shown here is the less pronounced peak for the internal resistance with higher temperatures, presumable caused by the lower electrolyte viscosity. While the internal resistance and double layer capacitance vary only weakly with different rates, the charge transfer resistance R p differs noticeably. R p with its similar appearance than R 0 for low currents, is mostly assigned to the thickness of the Li 2 S film on the anode, which depends, since high order lithium polysulfides are involved into the re-dissolution of the film, on the amount of dissolved polysulfides. Furthermore the films conductivity, depending on its surface morphology and the viscosity of electrolyte, matters [47]. The latter is likely due to the also occurring less pronounced peak with higher temperatures. With lower temperatures the usable capacity decreases (see Table 1), even when the high plateau can deliver slightly more energy due to a less pronounced shuttle effect. When the temperature gets too low, the increased internal resistance of the cell causes a deeper voltage drop. In our case, by applying discharge currents as 2900 mA, the discharging cut-off voltage of 1.5 V is reached before the beginning of the low voltage plateau. Therefore the usable capacity drops more significantly than reported in Refs. [37,48], which is mainly due to our test pattern and the higher current pulses we use."
            ],
            "subsections": []
        },
        {
            "title": "Model derivation",
            "paragraphs": [
                "The derived Li-S cell model excludes the identified parameters for 10 C due to their large differences to the values of higher temperatures. Therefore, it was skipped for now and is going to be explored more in detail in the future research. It should be noted that temperature is to be used as a constant parameter in this model. Using it as a dynamic fast-varying input may produce unexpected results. (A full electrochemical model would be needed to address this.) The model from 20 C to 50 C uses the general statespace representation  ",
                "The relationships between the model parameters and the SoC are handled with fitted polynomials,",
                "shown in the matrices A to D, with parameters p 1 to p 10 . The parameter values are identified by minimizing the squared error between function and identification results with MATLAB [49] for each temperature respectively and summarized in Table 2. As shown in Section 2 and 6, the parameters of Li-S chemistry vary in their patterns between the high and low plateau. While it is theoretically possible to represent this behaviour with a single polynomial function, the needed degree for a good quality fit would be high. To avoid this without neglecting accuracy, polynomial functions for U OC and R 0 are determined for each plateau separately and combined smoothly and differentiable via a partial sinusoidal function g. g m;c ðXÞ :¼",
                "Where the conditions a,b,c stands for the different ranges of the function,",
                "and m is a scaling factor, determining the transition range between both polynomials. The transition point between both functions is ",
                "Since the variations between both plateaus are less pronounced for C p and less consistent for R p , the functions for these parameters are only determined with a single polynomial respectively. This decision also simplifies the estimation of the Jacobian matrix of A with foresight to a Kalman filter type state estimation. A further simplification is fitting the polynomial to all pulses, ignoring the discharge current induced fluctuations of R p . Therefore the effects of different discharge currents have not been properly represented yet. Fig. 7 shows the resulting model parameters calculated from the polynomial functions, together with the transition points (c 20 ¼0.68,c 30 ¼0.73,c 50 ¼0.92) for 20 C, 30 C and 50 C. It is easy to spot that the variations between the temperatures changes the battery behaviour significantly. The data suggest that for an interpolation between different temperatures not only the cell capacity Q Cap and the transition points c must be accounted for, but also the shape of the polynomial functions itself. Instead of using a two dimensional lookup table to cover for these variations, here the polynomial factors themselves are the subject of interpolation.",
                "Each factor is interpolated linearly between 20 C, 30 C and 50 C, leading to a 3Â3 one dimensional lookup table for each factor of the polynomial. The values of the lookup tables are given in Table 2.",
                "The intended outcome of this method is to change the shape of the parameter functions without influencing their derivability and avoiding the complexity of a two dimensional surface function. Therefore the presented model can be used for Kalman filter types of estimation [50]. The dotted lines in Fig. 7 represent these interpolated functions in 5 C intervals, only using the linear interpolation of p 1 to p 10 and the transition points c. For the sake of completeness however, it must be mentioned that due to the lack of experimental data for 40 C the polynomials and transition points between 30 C and 50 C had been manually tweaked."
            ],
            "subsections": []
        },
        {
            "title": "Model validation",
            "paragraphs": [
                "To test the model for real life applications another OXIS pouch cell is discharged under different conditions. As main changes to the previous measurements used for the model identification (i) a more realistic current profile is applied, based on the NEDC drivecycle, (ii) the temperature controlled environment is neglected, allowing the cell to vary slightly around room temperature (23 C) and (iii) different discharge hardware (a Kepco BOP 100-10 MG) is used. The NEDC drive-cycle is selected because it represents a realistic user scenario but also contains some level of abstraction [51,52]. The results of the Simulink model [53], together with the measured battery terminal voltage is shown in Fig. 8. There is no energy recovery while braking and the chosen currents are relatively small. Nevertheless the average discharge power is with 0.467 W an order of magnitude larger than the mixed pulse discharge test (0.147 W).",
                "The model accuracy was quantified in terms of the root mean square error (RMSE):",
                "Where n is the number of data points, V t,i is the measured voltage and b V t;i is the model prediction for the voltage at that point. The model was found to give an RMSE of 32 mV. This is small compared to the overall voltage range. Despite the simplifications of only one RC circuit with neglected current dependencies of R p , the transient voltage is represented well during the entire discharge range (Fig. 8). However, some specific properties of Li-S batteries, as mentioned in Section 2, enhance the model error in certain regions. While the origins of the increasing deviation towards the end of the high plateau, likely due to the self discharge caused the polysulfide shuttle effect, are relatively well understood, the reasons the for the deviations in the low plateau are more unclear. There, mostly the decreasing voltage and the increased cell resistance are noticeable (Fig. 8, insets A1 and A2). The explanation for the first is difficult due to the difficult-to-define value of the open circuit potential. One observation, noticeable for the tested OXIS cells, is that the voltage in the low plateau, given enough time, always returns to approximately 2.1 V when left in open circuit condition. The behaviour with infinitesimally small (but non-zero) currents should be close or similar but differs towards the voltage profile of Fig. 2. Since these small discharge currents can cause the voltage to decrease towards the end of discharge, the increased error is presumably caused by the discharge current profile, leaving significantly less relaxation time, and the discharge hardware, allowing a flow of small and unmeasured leakage currents. Since these are also likely when an electric vehicle is not moving but in the switched on state, a more practical definition of the OCV, considering these small currents, might be a solution. The reason for the increased cell resistance towards the end is likely due to the different current profile as well but also can be in relation with cell variations. Nevertheless, the proposed battery model, representing the current understanding of Li-S batteries, shows good quality fit with small errors for the simplifying assumptions made and can be potentially used for a Li-S based BMS system."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "After showing the differences of Li-S batteries to the current Liion ones, the challenges towards an operational model, capable of predicting the voltage response, capacity and power capability, but also the degradation are presented. As an initial step to address some of them, this study proposes a new robust and easy to tune battery model structure, capable of accounting for differences between the start and end of a discharge pulse. This 'behavioural' model, in combination with the PEM identification method, is used to identify the parameters of a Thevenin equivalent circuit model for different temperatures. Due to a mixed pulse discharge profile, the current dependencies of the parameters could also be revealed. Subsequently, the data is used to create a simplified battery model with polynomial functions for its parameters, which are interpolated for different temperatures. Despite the rather complex nature of the Li-S battery, the validation of the simplified model with a more realistic current profile displays a low estimation error, suggesting that some simplifications in favour for computational-or modelling-effort are possible. Nevertheless, it is also shown that for a precise estimation of the terminal voltage Li-S specific properties like self discharge in the high plateau, the OCV definition in the low plateau and the current profile dependency of the model parameters should be further investigated. Therefore, our further goals towards a usable Li-S compatible BMS system are improvements of the model itself, through implementing self discharge and current effects, and the application of the model as an observer for state of charge and state of health estimation. For a usage of these in a highly demanding environment of an electric vehicle, also the charge behaviour needs to be investigated."
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgement",
            "paragraphs": [
                "This research was undertaken as part of the Revolutionary Electric Vehicle Battery (REVB) project, co-funded by Innovate UK under grant TS/L000903/1; university funding is provided by EPSRC under grants number EP/L505286/1 and EP/L505298/1. The underlying data can be accessed through the Cranfield University data repository at https://dx.doi.org/10.17862/cranfield.rd.c.3292031."
            ],
            "subsections": []
        }
    ]
}