{
    "id": "US20160245894",
    "authors": [
        "Zhiqun Deng",
        "Huidong Li",
        "Jun Lu",
        "Mitchell J. Myjak",
        "Jayson J. Martinez",
        "Jie Xiao",
        "Richard S. Brown",
        "Samuel S. Cartmell"
    ],
    "title": "ACOUSTIC TRANSMISSION DEVICE AND PROCESS FOR TRACKING SELECTED HOSTS",
    "date": "2015-02-25 00:00:00",
    "abstract": "A new acoustic tag and process are disclosed for identifying and tracking underwater hosts in up to three dimensions. The acoustic tag has an operation lifetime up to a year or longer at a pulse rate interval of about 15 seconds. The acoustic tag has a signal detection range up to at least about 500 meters that enhances detection probability.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "STATEMENT REGARDING RIGHTS TO INVENTION MADE UNDER FEDERALLY-SPONSORED RESEARCH AND DEVELOPMENT",
                    "paragraphs": [
                        "This invention was made with Government support under Contract DE-AC05-76RLO1830 awarded by the U.S. Department of Energy. The Government has certain rights in the invention."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "disclose government rights"
                    ],
                    "num_characters": 174,
                    "outline_medium": [
                        "disclose government rights"
                    ],
                    "outline_short": [
                        "acknowledge government rights"
                    ]
                },
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The present invention relates generally to acoustic tracking devices and systems. More particularly, the present invention relates to attachable acoustic transmission devices for detection and remote tracking of smaller hosts both inanimate and animate in up to three dimensions in real-time or as a function of time."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define acoustic tracking devices"
                    ],
                    "num_characters": 317,
                    "outline_medium": [
                        "define acoustic tracking devices"
                    ],
                    "outline_short": [
                        "define acoustic tracking devices"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Acoustic telemetry involves acoustic devices (or tags) commonly used to monitor behavior of fish. Acoustic tags transmit a sound signal that transmits identification, location, and other information about a tagged fish to a receiver at a selected pulse rate interval (PRI), or “ping” rate. The receiver detects signals emitted by the acoustic tag and converts the sound signals into digital data. Post-processing software then processes the digital data and provides location information about the tag and thus the behavior of the fish when the receiver detects the sound signal. By identifying the signature of the acoustic signal a specific animal may be identified, which allows tracking the behavior of the host. Acoustic data may be used, e.g., to estimate survival of fish through dams and other routes of passage. However, conventional transmitters are too large for small hosts (30-100 g mass and 180-270 mm length), have short lifetimes, and/or have an inadequate transmission range that to date have precluded intensive research of small hosts such as juvenile sturgeon using acoustic telemetry techniques. Recently, an injectable acoustic tag was developed for the U.S. Army Corps of Engineers for tracking juvenile salmon detailed in U.S. patent application Ser. No. 14/014,035 filed 29 Aug. 2013, and other acoustic tags for tracking other small hosts detailed in Patent Application No.: PCT/US14/53578 filed 29 Aug. 2014, which references are incorporated herein in their entirety. The injectable acoustic tag works well for tracking yearling Chinook salmon in river systems. However, it is not optimal for long-term monitoring of hosts requiring a stronger acoustic signal and longer service life including, e.g., juvenile (<1 year old) sturgeon. Accordingly, new tag designs are needed that reduce the overall size, mass, and/or volume, that enhance the power source voltage, tag lifetimes, and transmission range, and reduce adverse effects and costs associated with attachment (which includes implantation) thus broadening the range of potential applications including, e.g., investigating behavior and habitat of juvenile sturgeon and other small species. The present invention addresses these needs."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce acoustic telemetry",
                        "describe conventional transmitters",
                        "motivate new tag designs",
                        "summarize prior art"
                    ],
                    "num_characters": 2219,
                    "outline_medium": [
                        "describe conventional acoustic telemetry",
                        "limitations of conventional transmitters"
                    ],
                    "outline_short": [
                        "discuss limitations of conventional acoustic tags"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present invention includes a new acoustic transmission device (acoustic tag) and a process for remotely tracking various hosts in up to three dimensions in real-time or as a function of time. The acoustic tag may include a power source that delivers a power source voltage to power a tag circuit. The tag circuit may deliver a selected voltage to a piezoelectric transducer (PZT) that transmits an acoustic transmission signal at a signal intensity selected between about 159 dB and about 163 dB. The tag may be configured to provide a selectable tag lifetime at the selected signal intensity of at least about 98 days at a pulse rate interval of about 5 seconds.",
                        "The present invention also includes a method for tracking selected hosts. The method may include delivering a selected voltage from a tag circuit powered by a power source to PZT in the acoustic transmission (tag) device. The tag device may be attached to the selected host. The tag circuit may generate an acoustic transmission signal in the PZT at a selected signal intensity over a selectable tag lifetime. Signal intensity may be selected between about 159 dB and about 163 dB.",
                        "In some embodiments, the tag lifetime may be at least about 365 days at a transmission (ping) rate of about 15 seconds at a signal intensity of 161 dB.",
                        "In some embodiments, the tag lifetime may be at least about 249 days at a transmission (ping) rate of 10 seconds at a signal intensity of 161 dB.",
                        "In some embodiments, the tag lifetime may be about 156 days at a pulse rate interval of about 5 seconds and an acoustic signal intensity of 159 dB.",
                        "In some embodiments, the acoustic tag may include a power source that delivers a selectable power source voltage that powers components of the acoustic tag located on, or coupled to, a tag circuit. In various embodiments, the power source voltage may be selected between about 1.8 V and about 3.0 V.",
                        "In some embodiments, the tag circuit may include a dual boost converter sub-circuit that couples to two analog switches. In some embodiments, one of the analog switches may be coupled to the PZT through an inductor. The other analog switch may be coupled directly to the PZT. This configuration allows a higher peak-to-peak voltage from the tag circuit to be delivered across the PZT than would normally be delivered to the PZT. In some embodiments, the two analog switches may be directly coupled to the PZT, which permits the voltage from the tag circuit to be directly applied to the PZT.",
                        "In some embodiments, the dual boost converter sub-circuit may transform the voltage delivered from the power source into two output voltages. One output voltage may be a higher voltage (e.g., about +7 volts) than the power source voltage. The other output voltage may be a lower voltage (e.g., about −3 volts) than the power source voltage. The dual boost converter sub-circuit may share a single inductor to reduce the size of the tag.",
                        "The dual boost converter sub-circuit may alternately switch between the two voltage potentials in succession and deliver the two voltages through the respective analog switches to generate a selectable output voltage from the tag circuit to the PZT that drives transmission of the acoustic signal from the acoustic tag. In the exemplary embodiment, when the two voltage potentials delivered by the dual boost converter sub-circuit alternate between about +7 volts and about −3 volts, the voltage delivered from the tag circuit to the PZT may be about 20 volts (peak-to-peak).",
                        "The method may include delivering the selected (drive) voltage from the tag circuit from a boost conversion sub-circuit within the tag circuit across an inductor to the PZT.",
                        "In some embodiments, the energy expenditure for transmission of the acoustic signal from the piezoelectric transducer may be less than or equal to about 385 μJ per transmission at a signal intensity of 163 dB.",
                        "In some embodiments, the energy expenditure for transmission of the acoustic signal from the piezoelectric transducer may be less than or equal to about 283 μJ per transmission at a signal intensity of 161 dB.",
                        "In some embodiments, the acoustic signal may include a transmission range of at least about 500 meters at full intensity.",
                        "In some embodiments, the new acoustic device (tag) may include a length at or below about 24.2 mm, a diameter at or below about 5.0 mm, and a dry weight of less than about 0.72 grams.",
                        "The method may include attaching the acoustic tag to the selected host at a selected location.",
                        "The acoustic signal may be encoded with one or more tag codes of a selected code length. The acoustic signal may contain location data, identification data about the host, and/or sensor data that may all be transmitted from the acoustic tag to a receiver located external to the host.",
                        "The method may also include decoding the acoustic signal received from the acoustic tag to identify and track the host in up to three dimensions in real-time or as a function of time.",
                        "The acoustic transmission device may be configured for tracking a sturgeon host or another underwater host.",
                        "The foregoing summary is neither intended to define the invention of the application, which is measured by the claims, nor is it intended to be limiting as to the scope of the invention in any way."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce acoustic transmission device",
                        "describe power source and tag circuit",
                        "specify signal intensity and tag lifetime",
                        "describe method for tracking hosts",
                        "detail tag lifetime and signal intensity",
                        "describe power source voltage",
                        "detail dual boost converter sub-circuit",
                        "describe energy expenditure for transmission",
                        "specify transmission range and tag size",
                        "summarize method for tracking hosts"
                    ],
                    "num_characters": 5288,
                    "outline_medium": [
                        "introduce acoustic transmission device",
                        "describe tag circuit and power source",
                        "summarize method for tracking hosts",
                        "describe tag lifetime and signal intensity",
                        "outline embodiments of tag design"
                    ],
                    "outline_short": [
                        "introduce new acoustic transmission device",
                        "describe method for tracking hosts"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "A new acoustic transmission (tag) device and process are disclosed for identification and remote tracking of various small hosts including, e.g., juvenile sturgeon, and other deep-water and underwater hosts in up to three dimensions (3D) (i.e., X-Y-Z coordinates). In the following description, embodiments of the present invention are described by way of illustration of the best mode contemplated for carrying out the invention. Various components including, e.g., a transducer, tag and drive circuitry, and a power source are described that address specific performance requirements (e.g., size, mass, signal intensity, range, and tag lifetime). It will be apparent that the invention is amenable to various permutations, modifications, and alternative constructions. It should be understood that there is no intention to limit the present invention to specific forms disclosed herein, but, on the contrary, the present invention is to intended cover all modifications, alternative constructions, and equivalents falling within the scope of the present invention as defined in the claims. Therefore the description should be seen as illustrative and not limiting.",
                        "Acoustic tags of the present invention may include various form factors and shapes that allow the tags to be attached to selected hosts for selected applications. However, shapes are not intended to be limited. The term “form factor” used herein refers to the physical arrangement, configuration, and dimensions of electrical components in the acoustic tags and the capsule that contains the device components. The term “host” refers to inanimate or animate objects to which the acoustic tag may be attached for tracking and/or identification. Inanimate hosts include, but are not limited to, e.g., propelled objects (e.g., robots), stationary objects, movable objects, and transportable objects. Animate hosts may include, but are not limited to, e.g., aquatic species including, e.g., marine and freshwater animals, deep water hosts (e.g., juvenile sturgeon, lamprey, and eels), divers, underwater mammals, and other living hosts. The present invention will now be described with reference to tracking of an exemplary deep-water host, i.e., juvenile sturgeon. However, it should be understood that the invention is not intended to be limited thereto. As discussed above, acoustic tags of the present invention are well suited for a wide variety of applications and tracking of different hosts. No limitations are intended.",
                        "FIG. 1 is a perspective view of a new acoustic transmission device (acoustic tag) 100 of the present invention. In the exemplary embodiment, acoustic tag 100 may include an elongated or cylindrical shape that permits the tag to be easily implanted in, or attached to, the selected host. Approaches for attachment are not limited. TABLE 1 lists exemplary parameters of the new acoustic tag.",
                        "In the exemplary embodiment, tag 100 may include a length of 24.2 mm and a maximum diameter of 5.0 mm. The front end of the tag may include a narrower dimension than the back end of the tag and may include a relatively flat profile to minimize weight of the tag. The acoustic tag includes a compact volume, and a mass of about 720 mg in air. Tag 100 further includes a unique tag circuit that drives transmission of the acoustic signal from the PZT, a power source with a greater power output, an enhanced and adjustable acoustic signal intensity (or source level), a selectable and longer tag lifetime, and a longer transmission range for tracking selected hosts. The acoustic transmission signal may be adjusted to provide various detection ranges and tag lifetimes.",
                        "FIG. 2 is a block diagram showing exemplary components of acoustic tag 100 of the present invention and associated electrical inputs and outputs. Tag 100 may include a power source (e.g., battery) 10 that powers components of the acoustic tag. Power source 10 may be a custom lithium carbon fluoride battery of a similar design to that described in U.S. application Ser. No. 14/014,035. Each laminate may include an anode and a cathode positioned between polymer separators that electrically isolate the cathode from the anode in the laminate. The separator may include micro-porous polypropylene. The cathode may include, or be constructed of, e.g., carbon fluoride and a conducting carbon within a binder affixed at a selected thickness to a current collector. The binder may include, e.g., polytetrafluoroethylene (PTFE). The anode may be constructed of lithium metal. The power source may be filled with an electrolyte such as, e.g., lithium hexafluorophosphate (LiPF6) disbursed in a selected volume ratio of ethylene carbonate (EC) and dimethyl carbonate (DMC). In the exemplary embodiment, power source may be of a larger size that provides a greater power output of up to about 80 mAh and a longer tag lifetime. In the instant design, power source 10 may include a plurality of laminates configured to supply a selectable output voltage between about 1.8 volts (1.8 V) to about 3.0 volts (3.0 V).",
                        "Tag 100 may also include a programmable microcontroller 6 (U1) (e.g., a model PIC16F1823T/CL 8-bit, 8K flash, programmable microcontroller in a chip-scale package, Microchip Technology, Chandler, Ariz., USA) that provides operational control of components of acoustic tag 100. Tag components are configured to generate and deliver an acoustic signal at a desired modulation or resonance frequency (e.g., 416.7 kHz) that is transmitted from the acoustic tag.",
                        "Resonator 28 (Y1) (e.g., a model CSTCE10M0G52-R0, 10 MHz ceramic resonator, Murata Manufacturing Co., Ltd., Nagaokakyo, Kyoto Prefecture, Japan) may be coupled on the input side of microcontroller 6 (U1) to generate a clock signal of a selected precision (e.g., ±0.5% tolerance or better) that controls operation of controller (U1) 6 and other components of acoustic tag 100.",
                        "A phototransistor (Q3) 26 (e.g., a model PT19-21B, flat black mini SMD phototransistor, Everlight Electronics Co., Ltd., New Taipei City, Taiwan) sensitive to optical or infrared radiation may be coupled on the input side of microcontroller 6 to receive configuration commands from an external computer.",
                        "Tag 100 may further include a dual boost converter sub-circuit 36 that couples to two analog switches 40 (U2) and 42 (U3). Analog switch 42 (U3) may be coupled to a high-efficiency resonance inductor 12 (L1) (e.g., a 10 uH, 80 MAmp, 20% tolerance inductor, Coilcraft, Cary, Ill., USA). Analog switch 40 (U2) and resonance inductor 12 (L1) may be coupled to piezoelectric transducer 8. The dual boost converter sub-circuit, two analog switches, and resonance inductor together generate a drive voltage that drives transmission of the acoustic signal from piezoelectric transducer 8 at a selected modulation or resonance frequency, e.g., 416.7 kHz.",
                        "Dual boost converter sub-circuit 36 also controls the intensity of the acoustic signal delivered from piezoelectric transducer 8. The signal intensity is selectable between about 159 dB and about 163 dB. Selection of the power source voltage and the acoustic signal intensity provides a selectable tag lifetime.",
                        "Components of tag 100 may be selected to reduce physical dimensions and weight of the tag, and may be coupled to both sides of a circuit board 2 as shown in FIG. 3A and FIG. 4A described hereafter. Circuit board 2 may be constructed of rigid board materials (˜0.02 cm thickness) such as FR4 boards, or flexible board materials (˜0.01 cm thickness) such as flex boards.",
                        "FIGS. 3A-3B present different top-side views of circuit board 2 showing position of selected components of acoustic tag 100. In these figures, piezoelectric transducer 8 is shown electrically coupled to circuit board 2, e.g., at a forward end of acoustic tag 100 such that the acoustic signal may be transmitted free of interference from or obstruction by other tag components. Power source 10 may be coupled to circuit board 2 at an end opposite piezoelectric transducer 8 to power operation of piezoelectric transducer 8 and other tag components. However, location is not intended to be limited.",
                        "Resonator 28 (Y1) (e.g., a 10 MHz ceramic resonator described previously in reference to FIG. 2) may be coupled to microcontroller 6 to control timing of operation of tag components. Phototransistor 26 (Q3) may be positioned to receive configuration commands from a source computer. Analog switches 40 (U2) and 42 (U3) may be positioned to deliver a drive voltage to PZT 8 of about 20 volts (peak-to-peak) directly to piezoelectric transducer 8, or to deliver the same drive voltage across a resonance inductor 12 (L1) to piezoelectric transducer 8 as described previously herein.",
                        "Tag 100 components may be encapsulated within a coating composed of a thermosetting polymer such as an epoxy (e.g., EPO-TEK® 301 epoxy, Epoxy Technology Inc., Bellerica, Mass., USA) or a resin (e.g., Scotchcast® Electrical Resin 5, 3M Company, St. Paul, Minn., USA) that forms a capsule 4.",
                        "In FIG. 3B, a resistor 30 (R1) (e.g., a 1.0 Mohm, 1/20 W, 5% tolerance, SMD resistor, Vishay Intertechnology, Inc., Malvern, Pa., USA) may be coupled in parallel with resonator 28 (Y1) to stabilize the frequency of resonator 28 (Y1).",
                        "A bypass capacitor 20 (C3) (e.g., a model CL03A105MP3NSNC, 1-μF, 10-volt, 20% tolerance, X5R dielectric, and 0201 size tantalum capacitor, Samsung Electro-Mechanics America, Inc., Irvine, Calif., USA) may be coupled to controller 6 and power source 10 to filter electronic noise and current spikes stemming from components on circuit board 2. As will be appreciated by those of ordinary skill in the art, electrical components may be positioned where needed. No limitations are intended.",
                        "FIGS. 4A-4B are different bottom-side views of circuit board 2 showing position of selected components of acoustic tag 100. Piezoelectric transducer 8 and power source 10 may be coupled as described previously (see FIG. 3A-3B).",
                        "Microcontroller 6 (U1) may control operation of the components of the tag. In the exemplary embodiment, microcontroller 6 (U1) is shown positioned adjacent piezoelectric transducer 8, but position is not intended to be limited thereto.",
                        "A first transistor 22 (Q1) (e.g., a model PMZB350UPE-315, 20-volt, p-channel MOSFET, NXP Semiconductors, San Jose, Calif., USA), a first capacitor 16 (C1) (e.g., a 47 uF, 10-volt, 20% tolerance, X5R dielectric, and 0805 size ceramic capacitor, TDK Corp., Minato, Tokyo, JP), and an inductor 14 (L2) (e.g., a 10 uH, 80 MAmp, 20% tolerance, and 0603 size inductor, TDK Corp., Minato, Tokyo, JP) are components of the dual boost converter sub-circuit 36. These components generate the negative output voltage (e.g., about −3 volts), and couple electrically to analog switches 40 (U2) and 42 (U3) described previously in reference to FIG. 2 and FIGS. 3A-3B.",
                        "A second transistor 24 (Q2) (e.g., a 30-volt, 1.78 A, N-channel MOSFET, Fairchild Semiconductor, Inc., Dallas, Tex., USA) and a second capacitor 18 (C2) (e.g., a 47 uF, 10-volt, 20% tolerance, X5R dielectric, and 0805 size ceramic capacitor, TDK Corp., Minato, Tokyo, JP), are additional components of the dual boost converter sub-circuit 36. These components share inductor 14 (L2) described previously above and together generate the positive output voltage (e.g., about +7 volts), and couple electrically to analog switches 40 (U2) and 42 (U3) described previously in reference to FIG. 2 and FIGS. 3A-3B.",
                        "Analog switch 42 (U3) may couple to piezoelectric transducer 8 through inductor 12 (L1) to increase the drive voltage across the piezoelectric transducer.",
                        "In FIG. 4B, a first diode 32 (D1) (e.g., a 30-volt, 0.1 A, 2DFN Schottky Diode 0201, Diodes, Inc., Plano, Tex., USA) and a second diode 34 (D2) (e.g., a 30-volt, 0.1 A, 2DFN Schottky Diode 0201, Diodes, Inc., Plano, Tex., USA) are additional components of the dual boost converter sub-circuit 36. First diode 32 (D1) assists in the generation of the negative voltage (e.g., −3 volts), and second diode 34 (D2) assists in the generation of the positive voltage (e.g., +7 volts)."
                    ],
                    "subsections": [
                        {
                            "title": "[Tag Circuit]",
                            "paragraphs": [
                                "FIG. 5 shows an exemplary tag circuit for acoustic tags of the present invention showing components described previously above. Components may be located on, or coupled to, a circuit board described previously in reference to FIG. 2. The tag circuit may include preferred trace line widths of about 0.01 cm (0.003 inches), but are not intended to be limited.",
                                "Configuration commands for programming microcontroller 6 may be received directly from an external computer (not shown), e.g., through an Integrated Circuit Serial Programmer (ICSP) module 48 (e.g. a MPLAB ICD 3 programmer, Microchip Technologies, Chandler, Ariz., USA) that couples to microcontroller 6. Programmer (ICSP) module 48 may couple to the external computer through a programming connector (e.g., a model 22-05-2061, 6-position connector, Molex Connector Corp., Lisle, Ill., USA) (not shown). The programming connector may be detached from the circuit board during assembly of the acoustic tag to reduce the final volume of the assembled tag.",
                                "Configuration and programming information may also be delivered remotely (e.g., optically) from the external computer through phototransistor 26 (Q3) and into controller 6 through a selected input pin. Pins are not intended to be limited.",
                                "Bypass capacitor 20 (C3) may be coupled to controller 6 and power source 10 to filter electronic noise and current spikes from components on the circuit board.",
                                "Resonator 28 (Y1) delivers a clock signal that controls the timing of delivery of a positive channel drive signal (PCH-DRV) and a negative channel drive signal (NCH-DRV) to dual boost converter sub-circuit 36 described hereafter. A resistor 30 (R1) may be placed in parallel with resonator 28 (Y1) to stabilize the frequency and clock signal of resonator 28 (Y1).",
                                "Dual boost converter sub-circuit 36 may include a first transistor 22 (Q1), an inductor 14 (L2), a first diode 32 (D1), and a first capacitor 16 (C1) that together generate a negative output voltage (e.g., −3 volts). Microcontroller 6 may toggle the PCH-DRV signal to alternately build up current through inductor 14 (L2), and then discharges capacitor 16 (C1) through diode 32 (D1). Magnitude of the positive output voltage depends in part on the length of time that microcontroller 6 toggles the PCH-DRV signal. Microcontroller 6 may hold the NCH-DRV signal at a positive voltage during operation so that a second transistor 24 (Q2) described hereafter can conduct current.",
                                "Dual boost converter sub-circuit 36 may include second transistor 24 (Q2), inductor 14 (L2), second diode 34 (D2), and second capacitor 18 (C2) that together generate a positive output voltage (e.g., +7 volts). Microcontroller 6 toggles the NCH-DRV signal to alternately build up current through inductor 14 (L2), and then charge capacitor 18 (C2) through diode 34 (D1). The magnitude of the positive output voltage generally depends on the length of time that the microcontroller toggles the NCH-DRV signal. Microcontroller 6 (U1) may hold the PCH-DRV signal at zero voltage during this operation so that first transistor 22 (Q1) can conduct current.",
                                "Dual boost converter sub-circuit 36 may couple to two analog switches 40 (U2) and 42 (U3). The two analog switches respectively receive the positive and negative output voltages from the dual boost converter sub-circuit 36. The analog switches switch between these two voltages alternately in succession, under the control of microcontroller 6 (U1), to generate a selected (drive) voltage from the tag circuit that is delivered to piezoelectric transducer 8. Analog switch 40 (U2) may couple to one terminal (e.g., negative terminal) of piezoelectric transducer 8. Analog switch 42 (U3) may couple through a resonance inductor 12 (L1) to another terminal (e.g., positive terminal) of piezoelectric transducer 8. The drive voltage may be delivered from analog switch 42 (U3) through resonance inductor 12 (L1) to piezoelectric transducer 8 to generate the acoustic signal transmitted from piezoelectric transducer 8. Resonance inductor 12 (L1) is configured to increase the voltage delivered at the terminals of piezoelectric transducer 8. The acoustic signal transmitted from piezoelectric transducer 8 may have a selected modulation frequency (e.g., 416.7 kHz). The value of inductor 12 (L1) may be selected such that the inductance partially or fully cancels out characteristic capacitances of piezoelectric transducer 8 at the selected modulation frequency. The resulting voltage at each terminal of piezoelectric transducer 8 may go above the positive drive voltage and below the negative drive voltage. As will be appreciated by those of ordinary skill in the art, modulation frequencies may be varied and hence are not intended to be limited to the exemplary value described herein."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "illustrate tag circuit",
                                "describe components on circuit board",
                                "describe configuration commands",
                                "describe programming connector",
                                "describe bypass capacitor",
                                "describe resonator and clock signal",
                                "describe dual boost converter sub-circuit",
                                "describe analog switch operation",
                                "describe drive voltage generation"
                            ],
                            "num_characters": 4799,
                            "outline_medium": [
                                "illustrate tag circuit with FIG. 5",
                                "describe configuration commands for microcontroller 6",
                                "explain dual boost converter sub-circuit 36",
                                "describe generation of drive voltage and acoustic signal"
                            ],
                            "outline_short": [
                                "describe tag circuit components",
                                "illustrate tag circuit operation"
                            ]
                        },
                        {
                            "title": "[Tag Lifetimes]",
                            "paragraphs": [
                                "Lifetimes of acoustic tags of the present invention depend in part on the size of the power source (battery) 10 described previously in reference to FIG. 5. However, for a given power source size, in general, tag lifetimes are selectable by selecting: 1) the PRI for transmission of the acoustic signal, 2) the intensity of the acoustic signal, or 3) both the PRI and the intensity of the acoustic signal.",
                                "Within the selectable range of acoustic intensity between about 159 dB and about 163 dB, tag lifetimes may be estimated from empirical equation [1]:",
                                "\\(\\begin{matrix}\n{T = {\\frac{V_{batt}*C_{batt}*t_{0}*1000}{130 + {35*10^{\\frac{{SL} - 155}{10}}} + {V_{batt}*I_{S}*t_{0}}}*\\frac{1}{24}}} & \\lbrack 1\\rbrack\n\\end{matrix}\\)",
                                "Here, lifetime (T) has units of days. (Vbatt) is the battery voltage and has units of volts. (Cbatt) is the battery capacity in units of milli-Amp-Hours (mAh). (SL) is the acoustic intensity (or source level) in units of dB. (Is) is the constant static current that flows through the tag circuit (FIG. 5) in units of micro-Amps. (t0) is the PRI in units of seconds. TABLE 2 lists exemplary constants that may be employed for calculating tag lifetimes (7) at a PRI (t0) of 5 seconds and a signal strength (intensity) of 163 dB:",
                                "From Equation [1], tag lifetime (T) may be calculated at about 98 days using identified variable values. Acoustic tags of the present invention are configured to maintain a selected energy expenditure (epulse) for each transmission of the acoustic signal even as battery voltage decreases gradually over time. Energy expenditure (epulse) values may be less than or equal to about 385 μJ per transmission at a signal intensity of 163 dB, and less than or equal to about 283 μJ per transmission at a signal intensity of 161 dB.",
                                "Actual tag lifetimes (T) may be longer than calculated lifetimes based on nominal energy expenditure (epulse) values. As an example, at a signal intensity (strength) setting of 163 dB, an empirical energy consumption value of 351 μJ per transmission may be used instead of the nominal 385 μJ for a more accurate estimate of tag lifetime. In another example, at a signal strength setting of 161 dB, an empirical energy consumption value of 269 μJ may be used instead of the nominal 283 μJ.",
                                "TABLE 3 lists experimental and projected tag lifetimes for acoustic tags of the present invention at selected PRIs and selected signal intensities.",
                                "Lifetimes (T) of acoustic tags of the present invention are selectable. Shorter tag lifetimes and longer tag lifetimes may be selected. In the table, it can be seen that for a selected signal intensity, tag lifetime may be selected by varying the PRI. For example, at a signal intensity of 163 dB, tag lifetime corresponding to a 5 sec PRI is about 98 days; tag lifetime corresponding to a 15 sec PRI is about 285 days. It will be readily understood by those of ordinary skill in the art that various signal intensities may be selected with their corresponding lifetimes at selected PRIs to meet specific tracking needs for selected hosts and/or for selected applications. No limitations are intended. For example, for a tag with a signal intensity set at 161 dB, tag lifetime may be at least about 12.9 days using a PRI of 0.5 seconds, at least about 127 days using a PRI of 5 seconds, or about 365 days using a PRI of 15 seconds."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe tag lifetime dependence",
                                "introduce empirical equation for tag lifetime",
                                "list exemplary constants for tag lifetime calculation",
                                "describe energy expenditure per transmission",
                                "list experimental and projected tag lifetimes",
                                "describe selectable tag lifetimes"
                            ],
                            "num_characters": 3355,
                            "outline_medium": [
                                "explain dependence of tag lifetimes on power source size and selectable parameters",
                                "provide empirical equation for estimating tag lifetimes",
                                "discuss experimental and projected tag lifetimes"
                            ],
                            "outline_short": [
                                "discuss tag lifetimes and estimation"
                            ]
                        },
                        {
                            "title": "[Beam Transmission Patterns]",
                            "paragraphs": [
                                "Beam transmission patterns of the piezoelectric transducer are described, e.g., in U.S. application Ser. No. 14/014,035 filed 29 Aug. 2013."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe beam transmission patterns"
                            ],
                            "num_characters": 139,
                            "outline_medium": [
                                "introduce beam transmission patterns of piezoelectric transducer"
                            ],
                            "outline_short": [
                                "describe beam transmission patterns and transmission detection range"
                            ]
                        },
                        {
                            "title": "[Transmission Detection Range]",
                            "paragraphs": [
                                "Acoustic signals transmitted by tags of the present invention may include selected detection ranges. Tag signals may be encoded to provide maximum strength and to improve range and resolution. In locations with a relatively small amount of background noise, such as the middle of a lake, signals may be transmitted up to about 500 meters. The present tag delivers a higher source level output to provide for the 500-meter detection range than used in previous tags. TABLE 4 lists projected detection ranges at two exemplary intensity values of 163 dB and 161 dB for three different signal transmission spread scenarios and an assumed noise level of 97 dB in a quiet environment (e.g. the forebay of a dam). However, no limitations are intended by the illustrative example.",
                                "Data suggest a transmission detection range of 500 meters or better may be achieved at an acoustic signal intensity selected from 159 dB to 163 dB. In locations with larger background noise (e.g., immediately downstream of a dam spillway), signals may be transmitted about 100 meters. However, distances are not intended to be limited."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe transmission detection range",
                                "list projected detection ranges"
                            ],
                            "num_characters": 1109,
                            "outline_medium": [
                                "discuss transmission detection ranges of acoustic signals"
                            ],
                            "outline_short": [
                                "discuss transmission detection range"
                            ]
                        },
                        {
                            "title": "[Coding and Activation]",
                            "paragraphs": [
                                "Tags of the present invention may be programmed with one or more tag codes of a selectable code length. The microcontroller (FIG. 2) may also contain internal sensors such as temperature sensors that collect additional data from the host and surrounding environment. As an example, a 5-bit temperature value or other sensor values with selected bit-lengths may be input from selected sensors into one or more tag codes that are then transmitted from the piezoelectric transducer. Coding and sensors are described in U.S. application Ser. No. 14/014,035 filed 29 Aug. 2013.",
                                "Methods and locations for attachment of acoustic tags to selected hosts are not limited. Acoustic tags may be attached, e.g., to the outside of the host (e.g., to the clothing or scuba gear of a human host), to an inanimate object, to a self-propelled object such as a robot, attached internally to the host (e.g., inserted within an object, surgically implanted, or injected). No limitations are intended.",
                                "Applications for acoustic tags of the present invention may include, but are not limited to, e.g., survival studies; monitoring migration/passage/trajectories; tracking host behavior or location in two dimensions (2D) or three dimensions (3D); measuring bypass effectiveness at dams and other passages; observing predator/prey dynamics; helping public utility agencies, private firms, and state and federal agencies meet fishery or other regulations; and other applications. Applications are not intended to be limited.",
                                "The present invention delivers unsurpassed advantages not obtained in previous designs and open up a broad array of tag uses and applications not yet realized. The high-efficiency piezoelectric transducer drive circuit in the instant design enhances energy conversion efficiency and reduces number of dedicated components, all while maintaining the same source level performance. Fewer components decreases the energy required to power the tag, which permits yet smaller acoustic tags with a lower mass to be constructed for even smaller hosts and applications.",
                                "While the invention has been described with what is presently considered to be the most practical and preferred embodiments, many changes, modifications, and equivalent arrangements may be made without departing from the invention in its true scope and broader aspects. Thus, the scope is expected to be accorded the broadest interpretation relative to the appended claims. The appended claims are therefore intended to cover all such changes, modifications, equivalent structures, and products as fall within the scope of the invention. No limitations are intended."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce tag programming",
                                "describe sensor integration",
                                "outline attachment methods",
                                "summarize applications",
                                "highlight advantages"
                            ],
                            "num_characters": 2632,
                            "outline_medium": [
                                "describe tag programming and sensors",
                                "outline applications and advantages"
                            ],
                            "outline_short": [
                                "describe acoustic tag features"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce acoustic transmission device and process",
                        "describe components of acoustic tag",
                        "define form factor and host",
                        "describe exemplary deep-water host",
                        "illustrate acoustic tag 100",
                        "list parameters of acoustic tag",
                        "describe power source",
                        "describe programmable microcontroller",
                        "describe resonator",
                        "describe phototransistor",
                        "describe dual boost converter sub-circuit",
                        "describe analog switches and resonance inductor",
                        "describe piezoelectric transducer",
                        "illustrate circuit board 2",
                        "describe position of components on circuit board",
                        "describe bypass capacitor",
                        "describe encapsulation of tag components",
                        "illustrate bottom-side views of circuit board 2",
                        "describe microcontroller operation",
                        "describe dual boost converter sub-circuit components",
                        "describe analog switch operation",
                        "describe tag circuit components",
                        "describe configuration and programming of microcontroller",
                        "describe tag lifetime calculation"
                    ],
                    "num_characters": 12092,
                    "outline_medium": [
                        "introduce acoustic transmission device and process",
                        "describe components of acoustic tag",
                        "define form factor and host",
                        "illustrate acoustic tag 100 with FIG. 1",
                        "describe components of acoustic tag 100 with FIG. 2",
                        "illustrate circuit board 2 with FIGS. 3A-3B and FIGS. 4A-4B",
                        "describe tag circuit with FIG. 5",
                        "explain configuration and programming of microcontroller 6",
                        "describe dual boost converter sub-circuit 36",
                        "explain generation of drive voltage and acoustic signal",
                        "discuss tag lifetimes and selectable parameters",
                        "introduce beam transmission patterns and transmission detection range"
                    ],
                    "outline_short": [
                        "introduce acoustic transmission device and process",
                        "describe components of acoustic tag",
                        "illustrate circuit board and components",
                        "describe tag circuit and components",
                        "discuss tag lifetimes and estimation",
                        "describe beam transmission patterns and transmission detection range"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An acoustic transmission (tag) device, comprising:\na power source that delivers a power source voltage to power a tag circuit, the tag circuit delivers a selected voltage to a piezoelectric transducer that transmits an acoustic transmission signal at a selected signal intensity between about 159 dB and about 163 dB, the tag is configured to provide a selectable tag lifetime at the selected signal intensity of at least about 98 days at a pulse rate interval of about 5 seconds.",
        "2. The acoustic device of claim 1, wherein the tag lifetime is at least about 365 days at a pulse rate interval of about 15 seconds and a signal intensity of 161 dB.",
        "3. The acoustic device of claim 1, wherein the tag circuit includes a dual boost converter sub-circuit that couples to two analog switches that delivers the selected voltage to the piezoelectric transducer.",
        "4. The acoustic device of claim 1, wherein the tag circuit includes a dual boost converter sub-circuit that generates voltage potentials that alternate between about −3 volts and about +7 volts.",
        "5. The acoustic device of claim 1, wherein the tag circuit delivers a selected voltage delivered to the piezoelectric transducer that is at least about 20 volts (peak-to-peak).",
        "6. The acoustic device of claim 1, wherein the power source delivers a selectable power source voltage between about 1.8 V to about 3.0 V.",
        "7. The acoustic device of claim 1, wherein the tag circuit expends an energy for transmission of the acoustic signal from the piezoelectric transducer of less than or equal to about 283 μJ per transmission at a signal intensity of 161 dB.",
        "8. The acoustic device of claim 1, wherein the tag circuit expends an energy for transmission of the acoustic signal from the piezoelectric transducer of less than or equal to about 385 μJ per transmission at a signal intensity of 163 dB.",
        "9. The acoustic device of claim 1, wherein the piezoelectric transducer delivers the acoustic signal over a transmission range up to at least about 500 meters at full intensity.",
        "10. A method for tracking a selected host, comprising the steps of:\ndelivering a selected voltage from a tag circuit powered by a power source to a piezoelectric transducer in an acoustic transmission (tag) device to generate an acoustic transmission signal therein; and\ntransmitting the acoustic transmission signal from the piezoelectric transducer at a selected signal intensity between about 159 dB and about 163 dB over a selectable tag lifetime of at least about 98 days at a pulse rate interval of about 5 seconds to track the selected host.",
        "11. The method of claim 10, wherein transmitting the acoustic transmission signal includes a tag lifetime of at least about 365 days at a pulse rate interval of about 15 seconds at a signal intensity of 161 dB.",
        "12. The method of claim 10, wherein delivering the selected voltage from the tag circuit includes generating the voltage in a dual boost converter sub-circuit that couples to two analog switches within the tag circuit.",
        "13. The method of claim 10, wherein delivering the selected voltage from the tag circuit includes generating voltage potentials in a dual boost converter sub-circuit that alternates between about −3 volts and about +7 volts.",
        "14. The method of claim 10, wherein delivering the selected voltage from the tag circuit includes a voltage of at least about 20 volts (peak-to-peak).",
        "15. The method of claim 10, wherein delivering the selected voltage from the tag circuit includes delivering a power source voltage from the power source selected between about 1.8 V to about 3.0 V.",
        "16. The method of claim 10, wherein transmitting the acoustic signal includes an energy expenditure by the tag circuit of less than or equal to about 283 μJ per transmission at a signal intensity of 161 dB.",
        "17. The method of claim 10, wherein transmitting the acoustic signal includes an energy expenditure by the tag circuit of less than or equal to about 385 uJ per transmission at a signal intensity of 163 dB.",
        "18. An acoustic transmission (tag) device, comprising:\na tag circuit comprising components that deliver a selectable voltage to a piezoelectric transducer that drives transmission of an acoustic transmission signal therefrom at a selected acoustic signal intensity; and\na power source coupled to the tag circuit that delivers a selectable power source voltage that powers components of the acoustic tag over a selectable tag lifetime of at least about 98 days at a pulse rate interval of about 5 seconds at an acoustic signal intensity of 163 dB."
    ]
}