{
    "id": "US20190078938",
    "authors": [
        "Ivan Favero",
        "Chérif Belacel",
        "Stefano Barbieri",
        "Djamal Gacemi",
        "Yanko Todorov",
        "Carlos Sirtori"
    ],
    "title": "DETECTOR FOR TERAHERTZ ELECTROMAGNETIC WAVES",
    "date": "2017-03-16 00:00:00",
    "abstract": "A detector for terahertz electromagnetic waves includes a terahertz optomechanical transducer to transform an incident electromagnetic wave, having a terahertz frequency within a terahertz frequency band, into a measurable mechanical response; and a detection device for detecting an output signal. The terahertz optomechanical transducer includes a first element and an opposite element forming with the first element a capacitive gap.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The present disclosure relates to a detector for terahertz electromagnetic waves, a method for transducing terahertz electromagnetic waves, and a method for detecting terahertz electromagnetic waves using the detector."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce terahertz electromagnetic waves detector"
                    ],
                    "num_characters": 218,
                    "outline_medium": [
                        "introduce terahertz electromagnetic waves"
                    ],
                    "outline_short": [
                        "introduce terahertz electromagnetic waves"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "Devices using electromagnetic waves having a frequency in the terahertz domain (e.g. from 1 to 100 THz) have important applications, for example in spectroscopy, medicine, security and imaging. These devices include terahertz detectors/transducers operating in the terahertz domain which rely on the conversion of the radiation energy of an incident electromagnetic wave into a measurable form.",
                        "For example, in thermal terahertz detectors/transducers, the energy of the incident electromagnetic wave is absorbed and converted into heat. The efficient thermal detection of terahertz electromagnetic waves has technologically developed around two main concepts: bolometers and Golay cells.",
                        "As an example, some bolometers convert the energy of the incident electromagnetic wave to heat-up a small resistance made of for example highly doped silicon or germanium. The small change in the resistance value due to the heating is detected by an electrical circuit, i.e. by detecting a bias change on the resistor. These kind of bolometers achieve a minimal detectable power from the detector, in other words a Noise Equivalent Power (NEP) sensitivity of 1 pW/sqrt(Hz) at 4 Kelvins, with a frequency response up to 50 kHz.",
                        "In other types of bolometers, the resistance is made of Niobium, which becomes a superconducting material when cooled below a critical temperature of 10 K. Such bolometers are operated just at the superconductor's critical temperature and rely on photon absorption. When a photon is absorbed, the bolometer switches to a normal state and produces a large change in resistance. Such bolometers achieve a Noise Equivalent Power (NEP) sensitivity of 1 pW/sqrt(Hz), with a bandwidth of up to 1 kHz, and operate at a cryogenic temperature of 8 Kelvins.",
                        "Other types of bolometers are Indium Antimonide (InSb) bolometers that, in combination with applied magnetic fields and cryogenic operation at a temperature of 4K, achieve detection with NEP=0.5 pW/sqrt(Hz) at frequency up to 500 kHz. All these bolometers, doped silicon or germanium, Niobium, and Indium Antimonide, can be operated in the electromagnetic frequency band 1-20 THz. However, they operate only at cryogenic temperatures (<10K).",
                        "In Golay cells, which operate in the range 1-50 THz, the terahertz radiation is transformed into heat thanks to an absorbing element placed within a gas-filled enclosure. The resulting increase in gas pressure pushes a flexible membrane, whose displacement may be detected optically. Being based on thermal effects and thermal distortion of the membrane, the response time is long by comparison with bolometers, but a Golay cell can operate at room temperature. Some commercial Golay cells achieve THz waves detection with 140 pW/sqrt(Hz) of sensitivity, up to a frequency of 20 Hz.",
                        "All these techniques have the drawbacks of operating at low temperature, having a long response time, or not operating at all frequencies within the terahertz domain. There is therefore a need for methods or devices allowing electromagnetic waves to be detected or transduced within the entire terahertz domain, at room temperature, with high sensitivity, with short response time, while maintaining the possibilities of miniaturization and integration.",
                        "The patent application WO2006/055961A1 discloses a sensor for detecting high frequency signals."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "motivate terahertz devices",
                        "describe thermal terahertz detectors",
                        "describe bolometers",
                        "describe Golay cells",
                        "limitations of existing detectors",
                        "need for new detector"
                    ],
                    "num_characters": 3344,
                    "outline_medium": [
                        "motivate terahertz detectors",
                        "limitations of existing detectors",
                        "need for improved detectors"
                    ],
                    "outline_short": [
                        "limitations of current terahertz detectors"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "According to a first aspect, the present description relates to a detector for detecting terahertz electromagnetic waves. The detector comprises at least one first device configured to collect and transform an incident electromagnetic wave, having a terahertz frequency within a terahertz frequency band, into a measurable mechanical response; and a detection device for detecting an output signal. The first device comprising a first element and an opposite element forming with the first element a capacitive gap; said first element being a mechanical resonator having a mechanical resonance frequency and being configured to response mechanically to the action of a force stemming from an electric field, the output signal being representative of the mechanical response of the first element. The electric field is generated between at least one first electric pole induced in said first element, by first electric charges having a first electrical sign, and at least one second electric pole induced in said opposite element, by second electric charges having a second electrical sign opposite to the first electrical sign. The first device is a terahertz optomechanical transducer which is a terahertz electromagnetic resonator made at least of metal, configured to collect the incident terahertz electromagnetic wave and to transform the incident electromagnetic wave into a measurable mechanical response. The terahertz frequency of the incident electromagnetic wave corresponds to the electromagnetic resonance frequency of the terahertz electromagnetic resonator or is in a response frequency bandwidth of the terahertz electromagnetic resonator. The terahertz electromagnetic resonator comprises the first element and the opposite element. The first element and the opposite element comprise each at least an electrically conductive layer which is a metal pattern. The electric field is generated by interaction of said incident electromagnetic wave with electric charges in said terahertz electromagnetic resonator. The first electric charges and the second electric charges alternate in signs between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave.",
                        "This detector includes a terahertz (THz) optomechanical transducer that allows to transform an incident electromagnetic wave having a frequency within a terahertz frequency band into a measurable mechanical response. A coupling occurs between the terahertz photons of the incident electromagnetic wave and the mechanical response of the first element. A detection and measurement of the mechanical response may be performed for example by optical or electrical means.",
                        "The light-matter interaction occurring in the THz transducer relies on a mutual coupling between the incident electromagnetic waves and the electric charges present in the terahertz electromagnetic resonator. The incident electromagnetic wave interacts in a non-absorptive manner with electric charges present in the terahertz electromagnetic resonator (free carriers that may be present in a metal or superconductor part, or bound charges in parts made of a dielectric), driving them through forces, which are analog to Lorentz forces. The electromagnetic forces induced by the THz electromagnetic wave onto the electromagnetic/mechanical resonator may include radiation pressure effects, optical gradient forces, ponderomotive, electrostrictive, photoelastic forces, and piezoelectric and electrostatic effects. Whatever the electromagnetic forces generated by the THz electromagnetic wave, they do not rely on radiation absorption, and the electromagnetic THz forces can be seen as energy conservative. This is different from the class of bolometers, which rely on radiation absorption. As a first consequence, slow thermal effects originating from absorption of the THz electromagnetic wave do not rule the terahertz electromagnetic resonator operation. This allows the terahertz electromagnetic resonator to operate faster than bolometers, and also to transfer in a non-destructive manner the information carried by the electromagnetic wave onto the mechanical system. As a second consequence, the THz electromagnetic resonance of the transducer can be fixed by design of its geometrical characteristics, rather than the intrinsic physical properties of a constituent material (for instance, the presence of specific absorption bands).",
                        "The terahertz electromagnetic resonator is also referred to therein as a terahertz electromagnetic resonator or terahertz resonator.",
                        "In one or more embodiment, the first element is a mechanical resonator. The mechanical resonance frequency of this mechanical resonator is much lower, for example in the kHz, MHz or GHZ domain, than the electromagnetic resonance frequency of the terahertz electromagnetic resonator (in the THz domain) and may thus be easily detected, for example using an optical or electrical detection scheme.",
                        "According to another aspect, the present description relates to a detector for detecting electromagnetic waves, said detector comprising at least one optomechanical terahertz transducer according to the present disclosure and a detection device for detecting an output signal representative of a mechanical response of a first element of at least one of said optomechanical terahertz transducer.",
                        "The detector acts as a compact and efficient detector for THz electromagnetic waves. It operates at room temperature with a high frequency response (>1 MHz), well beyond the speed of Golay cells, pyroelectric detectors and cryogenic semiconductor bolometers. These properties make it an ideal detector for applications that rely on high speed bright sources such as synchrotrons or THz Quantum Cascade lasers.",
                        "In contrast with the prior art device disclosed in the patent application WO2006/055961A1 in which the electrostriction effect is the only effect which is used, there is no electrostriction effect (or this effect is negligible compared to the quasi-static Coulomb THz forces) in the electromagnetic/mechanical resonator disclosed therein. Further, in contrast again with this prior art device, no external electrical device (electrode, voltage generator, electrical device applying an external electrical field, etc) is necessary to produce an electrical field and a mechanical response of a first element. Especially, in the terahertz electromagnetic resonator disclosed therein, the electrical poles, and therefore the electrical field between these poles, are induced by the action of the THz electromagnetic wave on the electric charges in the terahertz electromagnetic resonator and the first element mechanically reacts (e.g. moves or deforms) naturally under the sole effect of the electromagnetic THz forces.",
                        "According to a second aspect, the present description relates to method for detecting an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use. The method may use a detector according to the first aspect. The method comprises: transforming an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use, into a measurable mechanical response; detecting an output signal representative of said mechanical response by the detection device of the detector, the amplitude of the output signal being proportional to the intensity of said incident electromagnetic wave. The step of transforming the incident electromagnetic wave into a measurable mechanical response comprises: collecting the incident electromagnetic wave by the terahertz optomechanical transducer of the detector, wherein the terahertz frequency of the incident electromagnetic wave corresponds to the electromagnetic resonance frequency of the terahertz electromagnetic resonator or is in a response bandwidth of the terahertz electromagnetic resonator; producing a mechanical response of the first element by action of a force stemming from an electric field generated by interaction of said electromagnetic wave on electric charges present in said terahertz electromagnetic resonator, wherein said electric field is generated between a first electric pole induced in said first element, by first electric charges having a first electrical sign and a second electric pole induced in said opposite element, by second electric charges having a second electrical sign opposite to the first electrical sign, and wherein the first electric charges and the second electric charges alternate in signs between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave.",
                        "In the Figs., identical elements are indicated by the same references."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce detector for terahertz electromagnetic waves",
                        "describe terahertz optomechanical transducer",
                        "describe mechanical response",
                        "describe electric field generation",
                        "describe terahertz electromagnetic resonator",
                        "describe light-matter interaction",
                        "describe electromagnetic forces",
                        "compare with bolometers",
                        "describe advantages",
                        "describe detector operation",
                        "describe detection and measurement",
                        "describe another aspect of detector",
                        "describe method for detecting terahertz electromagnetic waves",
                        "describe transforming incident electromagnetic wave",
                        "describe detecting output signal",
                        "describe advantages over prior art",
                        "conclude detector description"
                    ],
                    "num_characters": 8732,
                    "outline_medium": [
                        "introduce detector for terahertz electromagnetic waves",
                        "describe terahertz optomechanical transducer",
                        "explain light-matter interaction",
                        "describe electromagnetic forces",
                        "contrast with prior art",
                        "describe detector operation",
                        "introduce method for detecting terahertz electromagnetic waves",
                        "describe method steps"
                    ],
                    "outline_short": [
                        "motivate detector for terahertz electromagnetic waves",
                        "describe terahertz optomechanical transducer",
                        "application of detector",
                        "advantages over prior art"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Several embodiments of a terahertz optomechanical transducer for transducing an incident electromagnetic wave having a frequency within a terahertz frequency band will be described in detail by reference to the figures. The terahertz frequency band (also referred to therein as the THz domain) comprises at least the frequency band between 1 THz and 100 THz.",
                        "The terahertz optomechanical transducer comprises an electromagnetic resonator having a response bandwidth including the frequency of the incident electromagnetic wave to be transduced.",
                        "The terahertz optomechanical transducer may be used with an incident electromagnetic wave whose frequency corresponds to an electromagnetic resonance frequency of the electromagnetic resonator, or which is in a response bandwidth of the electromagnetic resonator in which the electromagnetic resonator collects the incident electromagnetic wave and the electric field is generated under the action of the collected incident electromagnetic wave.",
                        "The response bandwidth of the electromagnetic resonator comprises the electromagnetic resonance frequency (usually the center frequency of the response bandwidth), and its width is determined by the quality factor of the electromagnetic resonator.",
                        "In one or more embodiments, the geometric characteristics e.g. form and dimensions of the electromagnetic resonator are chosen so that its fundamental electromagnetic resonance mode has a frequency in the THz domain. Exemplary embodiments with different forms and dimensions are disclosed therein.",
                        "For example, the electromagnetic resonator may be a split hollow resonator, a split ring resonator, an antenna (e.g. spiral antenna, bow-tie antenna, half-wavelength antenna . . . ), a combination of such antennas, a combination of such antennas with a planar resonator, a resonator that is made of a multilayered structure with several metallic parts and insulating layers, such as a metamaterial resonator.",
                        "In one or more embodiments, the electromagnetic resonator has a split hollow form, for example the form of a split-ring (see for example FIGS. 1a, 1b), symmetric or asymmetric. In one or more embodiments, the electromagnetic resonator has the form of a dog-bone, an antenna (see for example FIG. 2 or 3b), a Jerusalem cross, a planar resonator or is a combination of different pieces having such forms, for example a double split-ring (see for example FIG. 3a).",
                        "In one or more embodiments, the electromagnetic resonator is made of one or more materials comprising free electric charges or where electric charges may be excited (or activated) under the action of an incident electromagnetic wave having a frequency in the THz domain.",
                        "For example, at least one part of the electromagnetic resonator is made of a dielectric material or a piezoelectric material, and the electric charges may be activated (or excited) in that part by the incident electromagnetic wave.",
                        "For example, at least one part of the electromagnetic resonator is made of a metal or a doped semiconductor material, and the electric charges may be displaced in that part by the incident electromagnetic wave.",
                        "In one or more embodiments, the electromagnetic resonator is of inductive-capacitive type. The electromagnetic resonator may comprise a first element and an opposite element forming with the first element a capacitive gap of the electromagnetic resonator. The capacitive gap stores the electric field that is responsible for the mechanical response, but, together with the inductive element, the capacitive gap can also define the THz electromagnetic resonance as in the case of an inductor-capacitor electrical circuit.",
                        "The electromagnetic resonator allows collecting and converting an incident electromagnetic wave having a frequency within the THz domain into a measurable mechanical response of an element of the electromagnetic resonator. The structure resonating devices disclosed herein behaves both as an electromagnetic and mechanical resonator.",
                        "In one or more embodiments, the device (terahertz optomechanical transducer) has one electromagnetic resonator (in this case, this resonator also contains the resonating mechanical element), or two or more electromagnetic resonators coupled together (in this case, at least one of these electromagnetic resonators also contains the resonating mechanical element). Each electromagnetic resonator has its own electromagnetic resonance frequency, but a structure resonating device, including different electromagnetic resonators, has its own electromagnetic resonance frequency.",
                        "The detector may comprise several optomechanical transducers, some optomechanical transducers having different resonance terahertz frequency (for detecting different terahertz frequency, each optomechanical transducer having different form or dimensions from the others), some optomechanical transducers having same resonance terahertz frequency.",
                        "The detector comprises both a THz electromagnetic resonator and a mechanical resonator. This double resonator is also referred to therein as an electromagnetic/mechanical resonator. This makes it possible to co-localize the THz wave and the mechanical resonance mode into the physical volume of the electromagnetic/mechanical resonator. This allows an optimal coupling between the THz wave and the mechanical response of the mechanical resonator. Consequently, the electromagnetic/mechanical resonator efficiently transduces the THz wave into a mechanical response.",
                        "The mechanical response is for example a mechanical deformation (e.g. a flexion, a twist, and/or a torsion), a movement or displacement, a vibrational motion of a mechanically responsive element of the electromagnetic resonator or a piezoelectric strain in the mechanically responsive element of the electromagnetic resonator.",
                        "For example, the mechanically responsive element that belongs to the electromagnetic resonator (which is one element of the electromagnetic resonator and which is hence sensitive or responsive to the terahertz wave) is a mechanically deformable element (e.g. flexible element, twistable element) or a movable element.",
                        "In one or more embodiments, the mechanical response is a shift of the mechanical equilibrium position of the element.",
                        "In at least one embodiment, the mechanical response is a micromechanical movement of the mechanically responsive element of the electromagnetic resonator.",
                        "In one or more embodiments, the mechanically responsive element is a wire, a lever, a membrane, a disk, a plate, a pillar, a post, an array, a torsional system, a ring, a rectangular patch, a circular patch, a bulk mode mechanical system, a contour mode mechanical system, a bulk acoustic wave resonator, a tuning fork, a surface acoustic wave resonator.",
                        "In one or more embodiments, at least one element of the elements forming capacitive gap is mechanically responsive (or mechanically reactive) to the action of the force stemming from the electric field generated by an interaction of the incident electromagnetic wave with the electric charges in the electromagnetic resonator, the electric field being localized in the capacitive gap.",
                        "The mechanical response may be a mechanical or a movement of the first element of the capacitive gap in the direction of the opposite element of the capacitive gap. The mechanically responsive element may have a fixed extremity and movable or flexible extremity (see for example FIGS. 1a, 1b, 2, 3a, 3c). The mechanically responsive element may have at least two fixed extremities and a movable or flexible part between the fixed extremities. The flexible part of the mechanically responsive element may further be suspended over a substrate.",
                        "Depending on the materials used for the electromagnetic resonator, the electric charges may be free electric charges that are displaced under the action of the electromagnetic wave or bound electric charges that are activated (or excited) under the action of the electromagnetic wave. The moved or activated electric charges may be positive charges or negative charges. The electric charges are activated or displaced so as to generate at least one pair of electric poles of opposite signs in the electromagnetic resonator. The two electric poles forming the electric field have opposite signs (a positive pole and a negative pole).",
                        "In one or more embodiments, the electric field is generated between a first electric pole induced in the first element by first electric charges having a first electrical sign, and a second electric pole induced in said opposite element by second electric charges having a second electrical sign opposite to the first electrical sign.",
                        "In one or more embodiments, at least one element forming the capacitive gap is a mechanical resonator and the mechanical response induced by forces stemming from the electric field is a vibrational motion. The mechanical resonator may be of small dimensions, typically between the millimeter and nanometer range, in order to have a fast mechanical response and a small inertial mass enabling an efficient mechanical response to the forces induced by the incident electromagnetic wave.",
                        "This mechanical resonator has its own mechanical resonance frequency, which may be for example in the kHz domain, the MHz domain, or the GHz domain.",
                        "In at least one embodiment, the intensity of the incident electromagnetic wave is modulated at the mechanical resonance frequency of the mechanical resonator or is modulated at a frequency in the response bandwidth of the mechanical resonator, and at least one of the elements forming the capacitive gap is made to vibrate. In at least one embodiment, the mechanical response of the element of the capacitive gap is a shift of the mechanical resonance frequency of this element.",
                        "The amplitude of the mechanical response (e. g. deformation, movement or vibration) of the mechanically responsive element of the electromagnetic resonator is directly related to the intensity of the incident electromagnetic wave and may be proportional to the intensity of the incident electromagnetic wave.",
                        "The electromagnetic resonator may be made of one or more path-connected or electrically-connected parts.",
                        "In one or more embodiments (see for example FIGS. 1a and 1b), the terahertz electromagnetic resonator is made of a single electrically-connected part, wherein the mechanically responsive element and the opposite element form two ends of the electrically-connected part. One part of the electromagnetic resonator may be said to be an electrically-connected part or a continuous electrically-connected part when electric charges present in one point of the electrically-connected part may be displaced to any other point of the electrically-connected part.",
                        "In one or more embodiments (see for example FIG. 3a), the terahertz electromagnetic resonator is made of at least two continuous electrically-connected parts which are electrically separated, the mechanically responsive element forming an end of a first electrically-connected part and the opposite element forming an end of another electrically-connected part. In this embodiment, the terahertz resonator comprises at least two continuous electrically-connected parts which present each an electrical metal conductive layer, the electrical metal conductive layers are electrically separated, one pair of electric pole per continuous electrically-connected part, at least one electric pole of a continuous electrically-connected part facing another electric pole of another continuous electrically-connected part.",
                        "In one or more embodiments, the first element is a mechanical resonator and it is clamped between the electric poles. The mechanical element is clamped/held between the two poles of capacity. For example, in the case where the first element is a mechanical disk, the two electrodes are placed on the base and the top of the disk, the mechanical action is the deformation of the disk.",
                        "Different embodiments will now be described in detail.",
                        "FIGS. 1a and 1b illustrate an exemplary embodiment of a terahertz optomechanical transducer comprising an electromagnetic resonator having the form of an asymmetric split ring, which is referred to therein as a split ring resonator (SRR). The electromagnetic resonator 1 has a response bandwidth including the frequency of the incident electromagnetic wave 3 to be transduced.",
                        "The terahertz electromagnetic resonator comprises four metal-coated branches that together form an electromagnetic inductance. One branch is narrower than the 3 others: this branch is a deformable cantilever that forms the mechanically responsive element 2 of the electromagnetic resonator. At its apex, it is separated from a nearby branch 4 (or opposite element 4) by a capacitive gap 8. The narrow branch is under-etched in order to be freely suspended over the substrate. The opposite element 4 may be at least partially in contact with the support, and the deformable element 2 projects entirely outwards the support. The mechanically responsive element 2 is a deformable element that has a fixed extremity and a free flexible extremity in which an electric pole may be formed.",
                        "The deformable element 2 and the opposite element 4 forming the capacitive gap comprise each a support layer and an electrically conductive layer (for example the same metal layer) resting on the support layer. For example, the electromagnetic resonator may be made by depositing a metal pattern (which is the electrically conductive layer) on a support like a GaAs/AlGaAs layered semiconductor structure.",
                        "In one or more embodiments, the use of the metal for the first element and the opposite element allows confining the electric energy density in a very small volume (with a distance on the order of 100 nm for instance between two electric poles), and thus achieving a very high quasi-static Coulomb force.",
                        "In one or more embodiments, the mechanical action induced by the THz wave is triggered by the Coulomb attractive force that exists between two electrical poles with opposite signs. These poles are induced within the resonator when the latter is excited by an incident THz radiation. As the Coulomb force decreases with the distance between the poles, the resonators may be designed in such a way that this distance is minimal. Thus, the electric field that is induced between the two electrical poles is localized and concentrated in a very short distance and, at the same time, it has a very high amplitude. Such electric fields can be achieved in metallic resonators. For instance, in a split ring metallic resonator, there are two electrical poles that form around the slit of the resonator, when the latter is excited by an incident THz wave. At the same time, 90% of the electric energy density is localized around the slit. The Coulomb force between the poles is thus inversely proportional to the opening of the slit, which is typically between 10 nm and 10 micrometers.",
                        "This dimension of the perimeter of the SRR fixes the resonant wavelength λres of the electromagnetic mode in the case of such a split ring resonator. Typically, for the SRR, the perimeter of the split hollow form is equal to λres/2n and n is the average refractive index between the indices of the support material, the resonator material and the air.",
                        "The electric field is generated under the action of the electromagnetic wave collected by the electromagnetic resonator between a first pole generated in the deformable element 2 and a second pole generated in the opposite element 4. The deformable element is deformable under the action of a force stemming from the electric field generated between two poles 5, 6 of opposite signs generated by interaction of the incident electromagnetic wave 3 with electric charges in the electromagnetic resonator, for example in the metal layer of the electromagnetic resonator. For example, the deformable element 2 moves in direction of the opposite element 4 under the action of the force stemming from an electric field generated between the two poles 5, 6.",
                        "In one or more embodiments, the deformable element or cantilever 2 is a mechanical resonator. By using standard semiconductor etching technology, the narrow arm of the resonator may be processed into a cantilever with a high aspect ratio between length and width and/or length and thickness, typically over 10, for example a width between 100 nm and 1 μm, typically 581 nm, a thickness between 100 nm and 1 μm., typically 470 nm and a length between 1 μm and 100 μm, typically 17.2 μm length. The thickness of the cantilever may be small enough for the cantilever to be flexible under the action of a THz power circulating in the resonator of at least 1 nW. The cantilever may present a suspended length, corresponding to the flexible part of the cantilever, which is superior to 8 times the width of the cantilever. The width of the capacitive gap may be between 10 nm and 1 μm, typically 309 nm of the resonator of the FIG. 1a or 1b.",
                        "Further, the weight or inertial mass of the cantilever may be small enough (for example below 1 μg) so that the cantilever is flexible under the action of an electric field created in the capacitive gap.",
                        "In one or more embodiments, the intensity of the incident electromagnetic wave is modulated at the mechanical resonance frequency in a response bandwidth of the mechanical resonator and the deformable element 2 is made to vibrate by action of the force stemming from the electric field generated by interaction of the incident electromagnetic wave with electric charges in the electromagnetic resonator.",
                        "The modulation signal applied to the incident electromagnetic wave by modulation means (e.g. a modulator, electronic modulation circuit or chip, etc), may be a rectangular signal (e.g. ON/OFF signal), a sinusoidal signal or any periodically oscillating signal having a main frequency component in a response bandwidth of the mechanical resonator. Under the effect of this modulation, the force stemming from the electric field is periodically changed with a typical frequency close to mechanical resonance. Note, however that the electric charges alternate (from positive to negative sign, or, respectively from negative to positive sign) at a much higher frequency that is the THz electromagnetic resonance frequency of the structure.",
                        "For example, in the embodiment of FIG. 1a or 1b, the cantilever is a mechanical resonator that vibrates and deflects, with both in-plane and out of plane flexural modes. When the displacement is in the plane, the gap distance and the associated capacitance are modulated.",
                        "The THz optomechanical transducer 1 may thus be compared to a LC circuit oscillating at its fundamental electromagnetic resonance frequency and that can store electrical energy.",
                        "A capacitor stores energy in the electric field between its plates, depending on the voltage across it, and an inductor stores energy in its magnetic field, depending on the current through it. If an inductor is connected across a charged capacitor, current will start to flow through the inductor, building up a magnetic field around it and reducing the voltage on the capacitor. Eventually all the charges on the capacitor will be gone and the voltage across it will reaches zero. However, the current will persist, because inductors resist changes in current. The current will begin to charge the capacitor with a voltage of opposite polarity to its original charge. When the magnetic field is completely dissipated the current will stop and the charges will again be stored in the capacitor, with the opposite polarity as before. Then the cycle will start again, with the current flowing in the opposite direction through the inductor. The charge flows back and forth between the plates of the capacitor, through the inductor. The energy oscillates back and forth between the capacitor and the inductor until (if not replenished from an external circuit) internal dissipation makes the oscillations die out. Thus, the electrical sign of the poles alternates.",
                        "Referring back to the embodiment of FIGS. 1a and 1b, the electric sign of the electric charges forming the first pole in the deformable element 2 and the electric sign of the electric charges forming the second electric pole in the opposite element alternate in time at the frequency of the incident wave in a synchronous manner so that the electric sign of the electric charges forming the first pole in a first element is always opposite to the electric sign of the electric charges forming the second pole in the opposite element. The action of the electric force stemming from the electric field generated by the two opposite poles is thus maintained on the deformable element 2 during the pole alternation.",
                        "In one or more embodiments, the dimensions of the electromagnetic resonator are chosen so that its fundamental electromagnetic resonance mode is in the THz domain. When this fundamental electromagnetic resonance mode is excited by the incident electromagnetic wave 3, a dynamic distribution of electric charges with opposite signs 5, 6 appears on both sides of the capacitive gap 8, as illustrated by FIG. 1b. This also results in a force 7 on the deformable element 2 that attracts the deformable element 2 towards the opposite element 4 of the capacitive gap and sets the deformable element 2 into motion.",
                        "In one or more embodiments, the deformable element and the opposite element are located at two opposite ends of a continuous electrically-connected part of the electromagnetic resonator as illustrated in FIGS. 1a, 1b and 2.",
                        "FIG. 2 illustrates an embodiment of an electromagnetic resonator which is a tuning fork. The first element 2 and the opposite element 4 may include at least a same metal layer (which can rest on a support layer in a dielectric material for instance), and may be both mechanically responsive to the action of forces stemming 7 from the electric field generated by interaction of said incident electromagnetic wave with electric charges in said electromagnetic resonator. Each of the first element 2 and the opposite element 4 are mechanically responsive and may move toward the other under the action of the electric field. Both the first element 2 and the opposite element 4 may be made to vibrate synchronously (at the same frequency and with the same amplitude, but in opposite directions) when the incident electromagnetic wave is modulated at an appropriate frequency.",
                        "In the embodiments illustrated by FIGS. 3a, 3b and FIGS. 4a, 4b, the deformable element 2 and the opposite element 4 are located at two opposite ends of two distinct electrically-connected parts of the electromagnetic resonator, and may include each a different metal layer. The two electrically-connected parts are electrically separated or electrically disconnected one from the other in such a way that electric charges present in one electrically-connected part cannot be displaced to the other electrically-connected part.",
                        "In the embodiment illustrated by FIG. 3a, the electromagnetic resonator is made of a double split ring having a single electromagnetic resonance. This kind of electromagnetic resonator is symmetric. The first split ring 21 is a first electrically-connected part of electromagnetic resonator and the second split ring 22 is a second electrically-connected part of electromagnetic resonator, the first element 2 being formed at the end of the first split ring 21 and the opposite element 4 being formed at the end of the second split ring 22.",
                        "In one or more embodiments, the first split ring 21 considered alone (without the second split ring 22 in the vicinity) has its own terahertz electromagnetic resonance, and the second split ring 22 (without the first split ring 21 in the vicinity) has its own terahertz electromagnetic resonance. As explained before, when the first split ring and the second ring are coupled together, they have a single terahertz electromagnetic resonance.",
                        "In one or more embodiments, in the case of two or more terahertz electromagnetic resonators, one terahertz electromagnetic resonator having its own terahertz electromagnetic resonance comprises a first movable element 2, and another terahertz electromagnetic resonator having its own terahertz electromagnetic resonance comprises an opposite element 4 situated in front of the first element 2. When these resonators are coupled together for forming an electromagnetic resonator having its own terahertz electromagnetic resonance, the first element 2 and the opposite element 4 are mechanically responsive and may move toward the other under the action of the electric field generated by interaction of said incident electromagnetic wave with electric charges in the electromagnetic resonator at the electromagnetic resonance frequency.",
                        "A first pair of electric poles of opposite signs are induced in the first element 2 by the action of the electromagnetic wave on the electric charges in the electromagnetic resonator. A second pair of electric poles of opposite signs are induced in the opposite element 24 by the action of the electromagnetic wave on the electric charges in the electromagnetic resonator. The electric field 7 is generated between a first electric pole 6 of the first pair of poles generated in the first element 2 and a second electric pole 5 of the second pair of poles generated in the opposite element 6. Because of the symmetry of the electromagnetic resonator, the induced charge distribution is quadripolar and the radiative losses are minimized.",
                        "FIG. 3b illustrates an embodiment of an electromagnetic resonator in form of an antenna in two parts 23, 24, each part being an electrically-connected part of the electromagnetic resonator. The first electrically-connected part 23 comprises the first element 2 which is mechanically responsive and the other electrically-connected part 24 comprises the opposite element 4. The electric field 7 is generated between a first electric pole 6 generated in the first element 2 and a second electric pole 5 generated in the opposite element 4.",
                        "FIGS. 4a and 4b illustrate an embodiment of an electromagnetic resonator in form of a planar antenna, the two-path connected parts 23, 24, which may be for example made of metal, being in two different planes separated by a dielectric layer 31 to electrically isolate the two electrically-connected parts. The first electrically-connected part 2 of FIG. 4a, respectively 4b, is a rectangular patch, respectively a circular patch. The first electrically-connected part 23 comprises the first element 2 which is mechanically responsive and the other electrically-connected part 24 comprises the opposite element 4.",
                        "A first pair of electric poles of opposite signs are induced in the first element 2 by the action of the electromagnetic wave on the electric charges in the electromagnetic resonator. A second pair of electric poles of opposite signs are induced in the opposite element 4 by the action of the electromagnetic wave on the electric charges in the electromagnetic resonator. The electric field 7 is generated between a first electric pole 6 of the first pair of electric poles generated in the first element 2 and a second electric pole 5 of the second pair of electric poles generated in the opposite element 4, the two electric poles forming the electric field having opposite signs.",
                        "The electric field between the pair of opposite poles is thus induced by the action of the electromagnetic wave on the electric charges in the electromagnetic resonator at the resonance of the electromagnetic resonator.",
                        "The advantage of planar antennas, such as the one illustrated by reference to FIG. 3b is that they allow good impedance match with free space, in other words a better collection of the THz electromagnetic wave. Such antennas can also be engineered with a large operation frequency bandwidth.",
                        "The advantage of patch antennas, such as the ones illustrated by reference to FIGS. 4a, and 4b is that they allow strong confinement of the electric field in the gap between the first element 2 and the opposite element 4, which may be for example made of metal, which results in a stronger induced mechanical force. Furthermore, the dielectric layer 31 can be replaced with a semiconductor layer, which contains quantum heterostructures that absorb waves in the THz domain.",
                        "FIGS. 5a, 5b, 5c, 5d and 5e illustrate electromagnetic characteristics of the embodiment of FIGS. 1a and 1b of a THz optomechanical transducer, respectively, a set-up for the measurement of the electromagnetic characteristics, a measurement obtained with the set-up and a simulation of electric fields generated in an electromagnetic resonator of the THz optomechanical transducer.",
                        "As illustrated by FIG. 5a, to measure the spectral response of the SRR, transmission measurements are performed with a source 53 for an electromagnetic wave in the THz domain, a Fourier Transform Interferometer 54 and a cooled Ge-bolometer 54 on a dense array 52 of electromagnetic resonators 1. The incident electromagnetic wave is focused on the dense array 52 with the help of four parabolic mirrors 56. The measurement is done on a dense array of electromagnetic resonators in order to increase the amplitude of the absorption features. The frequency spectrum 55 represented on FIG. 5b of the electromagnetic wave measured by the Ge-bolometer 54 shows a single absorption dip that is well fitted by a Lorentzian profile, with a central frequency at fTHz=ωTHz/2π=2.7 THz that corresponds to the fundamental electromagnetic resonance mode of the SRR, and a quality factor QTHz=fTHz/DfTHz=8.4, the quality factor being the ratio between the electromagnetic resonance frequency and the full width at half maximum of the spectrum of FIG. 5b. These characteristics may be confirmed by numerical modelling based on a finite elements method software.",
                        "Referring to FIG. 5c the vertical electric field Ez distribution normal to the top metal surface of the split-ring ring provided by the simulations is shown. While the field is strongest around the gap, it spreads along the structure which indicates that the SRR electromagnetic resonance is dominated by propagation effects. Indeed, the SRR resonant wavelength may be calculated by the formula λres=2*neff*P, wherein P=44.5 μm represents the medium perimeter of the SRR and neff=1.2 represents an effective index that takes into account the leak of the field in the air and in the semiconductor. According to Gauss's theorem, the component of the field in the z direction provides a surface charge density on the metal plates induced at the electromagnetic resonance of the electromagnetic resonator. The resulting force is strongest around the capacitive gap of the SRR, where the distance between the electric charges is the smallest. The force resulting from this electric charge distribution excites the cantilever movement in the plane of the SSR.",
                        "Referring respectively to FIGS. 5d and 5e, the horizontal electric fields Ey and Ex distribution of the split-ring ring provided by the simulations is shown. We observe from these simulations that the absolute maximum of the x- and y-components of the in-plane electric field are similar, which indicates that both polarization can be equally coupled.",
                        "FIGS. 6a, 6b and 6c illustrate mechanical characteristics of the embodiment of FIGS. 1a and 1b of the THz optomechanical transducer, respectively, a set-up for the measurement of the mechanical characteristics, a measurement obtained with the set-up and a simulation of the fundamental mechanical mode of the cantilever 2.",
                        "As illustrated by FIGS. 6a and 6c, the movement of the cantilever of FIGS. 1a and 1b may be detected by means of an optical detector and a near infrared laser source 61, with a wavelength for example λ=940 nm. The fraction of the near infrared laser beam 60 reflected by the cantilever 2 is sent to a sharp edge blade 61 and received by a balanced photo-detection unit 62 connected to a spectral analyzer 63. This optical detection scheme allows probing the Brownian motion in the cantilever which corresponds to the fundamental in-plane flexural mode. A typical output from that experiment, obtained on the spectrum analyzer connected to the photodiodes, is shown in the graph of FIG. 6b. The line 66 is a fit of the data spots 65 using the analytical expression for the noise spectral power density Sxx(f) of a damped mechanical oscillator. From this fit, a mechanical resonance frequency and quality factor may be computed. For the example of FIG. 6b, a mechanical frequency ωm/2π=957 kHz and quality factor Qm=93 may be computed. Furthermore, the knowledge of the cantilever dimension and composition allows determining precisely the effective mass of the oscillator, meff=10.7 pg. From these values, the peak noise spectral density may be computed as Sxx(fm)=2kB*T*Qm/meff ωm3=0.33 pmt/Hz, where kB is the Boltzmann constant and T=300K is the room temperature. This value allows to calibrate the voltage readings of the apparatus (spectrum analyzer) used to measure the displacement of the cantilever, i.e. to convert the voltage readings into nanometers. A numerical simulation of this mode is illustrated by FIG. 6c. In the example illustrated by FIG. 6c, the displacement of the free extremity of the cantilever 2 is between 0.8 and 1 nanometer, while for the middle of the cantilever 2 the displacement is between 0.1 and 0.3 nanometer. The texture used for the element 4 indicates that the displacement is null for this element 4.",
                        "FIG. 7 illustrates an embodiment of a detector of a signal generated by a terahertz optomechanical transducer. The detector comprises an electromagnetic wave source 74, for example, a THz source such as a THz Quantum Cascade Laser.",
                        "The detector 71 comprises at least one optomechanical THz transducer 1 as described therein. The detector may comprise a lens, such as for example a silicium hyperhemispherical lens, to focus the electromagnetic waves on the terahertz optomechanical transducer and a detection device 77 for detecting a signal representative of the mechanical response of a mechanically responsive element of the electromagnetic resonator.",
                        "The detection and measurement of a signal representative of the mechanical response of the mechanically responsive element of the electromagnetic resonator may be performed by optical or electrical means.",
                        "When the mechanical response is a frequency shift of the mechanical resonance of the mechanically responsive element, the amplitude of this frequency shift may for example, be measured using a phase-locked loop circuitry.",
                        "When the mechanical response is deformation, a movement or a vibration of the mechanically responsive element, the amplitude of this mechanical response may be detected and read-out by using optical detection means, for example a telecom laser or by using the detection scheme described by reference to FIG. 5a or 6a.",
                        "The movement of the deformable element under the influence of the THz radiation can be described by the following equation of motion, derived from an effective capacitor-inductance model for the resonator:",
                        "\\(\\begin{matrix}\n{{\\frac{d^{2}x}{{dt}^{2}} + {\\frac{\\omega_{m}}{Q_{m}}\\frac{dx}{dt}} + {\\omega_{m}^{2}x}} = \\left. {{- \\frac{W_{THz}(t)}{m_{eff}}}\\frac{d\\; \\ln \\; C_{eff}}{dx}} \\right|_{x = d_{gap}}} & \\left( {{Eq}\\mspace{14mu} 1} \\right)\n\\end{matrix}\\)",
                        "where:",
                        "x is the position of the deformable element,",
                        "Ln is the Neperian logarithm function,",
                        "Ceff(x) is the effective capacitance of the charge distribution of the THz mode and",
                        "WTHz(t) is the time dependent electric energy stored in the resonator at the electromagnetic resonance.",
                        "Unlike some radio frequency converters, the electric energy oscillates in the THz range, WTHz(t)˜cos2(ωTHzt), at a frequency that is six orders of magnitude higher than the mechanical frequency ωm. In fact, the cantilever is only sensitive to the average value of the electric energy <WTHz>, averaged over the THz oscillation cycles.",
                        "This average value of WTHz(t) can be expressed as",
                        "<WTHz>=ITHzAcollQTHz/2ωTHz",
                        "where ITHz is the intensity (W/m2) of the incident electromagnetic wave, Acoll is a collection area, defined in such a way that the quantity ITHzAcoll corresponds to the power dropped in the resonator. Then, according to equation (Eq1), the effect of a continuous THz electromagnetic wave is to change, i.e. displace, the rest position of the cantilever.",
                        "The effect of the THz radiation can be exalted if the intensity of the incident electromagnetic wave is modulated at the mechanical resonance frequency ωm of the mechanical resonator or cantilever, which allows the resonant excitation of its vibrational motion. For a sinusoidal modulation ITHz(t)=I0THz (1+cos(ωmt)), one can define an internal responsivity of the system as the ratio between the amplitude of the induced mechanical motion xmax, and the peak THz power AcollI0THz coupled by the THz resonator:",
                        "\\(\\begin{matrix}\n{R_{in} = {\\frac{x_{\\max}}{A_{coll}I_{THz}^{0}} = {\\frac{1}{2}\\frac{Q_{m}Q_{THz}}{\\omega_{m}^{2}\\omega_{THz}m_{eff}d_{gap}^{eff}}}}} & \\left( {{Eq}\\mspace{14mu} 2} \\right)\n\\end{matrix}\\)",
                        "As the responsivity is proportional to QmQTHz, the equation (Eq2) clearly uncovers the double effect of recycling of the vibration quanta and the THz photons.",
                        "The effective capacitive gap dgapeff=((d ln Ceff/dx)|x=d)−1 depends on the details of the charge distribution at electromagnetic resonance. For the embodiment of FIG. 1a or 1b, one can estimate dgapeff˜546 nm based on the improved Palmer formula of the capacitance, which takes into account the effect of fringing fields. Using equation (Eq2) together with the value of the expression of the peak noise density of the Brownian motion, an analytical expression of the internal Noise Equivalent Power (NEP) for the device, defined as NEP=Sxx(fm)1/2/Rin may be written as:",
                        "\\(\\begin{matrix}\n{{NEP} = {\\sqrt{2\\; k_{B}{Tm}_{eff}\\Gamma_{m}}\\frac{2\\omega_{THz}d_{gap}^{eff}}{Q_{THz}}}} & \\left( {{Eq}\\mspace{14mu} 3} \\right)\n\\end{matrix}\\)",
                        "The linewidth of the mechanical mode of the deformable element is Γm=ωm/Qm. The equations (Eq2) and (Eq3) can be applied to other geometries of the electromagnetic resonator and provide useful tools for the design of THz optomechanical transducer. For the embodiment of FIG. 1a, the internal responsivity as defined in Eq.2 is Rin˜113 fm/nW and the Noise Equivalent Power NEP is 4.8 nW/Hz1/2.",
                        "FIGS. 8a, 8b, 8c, 8d and 8e illustrate an embodiment of a detector of a signal representative of a mechanical response of a THz optomechanical transducer, a spectrum obtained by this detector, and the variation of the amplitude of the signal according to the time.",
                        "Referring to FIG. 8a, the THz source 74 may be for example a quantum cascade laser (QCL) with an emission frequency 2.5 THz and a maximum output power of 4.7 mW. The THz electromagnetic wave from the QCL is collected with two parabolic mirrors 75 and focused on a single SRR 1 with the help of a silicon hyper-hemispherical lens 76, positioned on the backside of the GaAs substrate. To produce the required modulation of the THz power at the cantilever vibrational frequency the QCL drive current was modulated with a signal generator 82. The cantilever oscillation was detected and read-out with the NIR laser 60 and the balanced detection 61, 62 as previously described. The differential signal from the photodiodes was sent either to a spectrum analyzer 63, or to a lock-in amplifier 81 referenced to the QCL modulation frequency 82.",
                        "FIG. 8b shows the output of the spectrum analyzer 63 in the case with, respectively without, the THz source 74. The peak in the spectrum 86 represents the output signal with the THz source 74 and the spectrum 85 represent the noise of the detection without the THz source 74. The spectrum 74 shows the Brownian motion of the lever with a Dirac-like resonant response atop. This peak shows that the mechanical device responds to the incident THz electromagnetic wave, and that this mechanical response can be made resonant provided the THz electromagnetic wave is modulated at the proper frequency.",
                        "FIG. 8c shows a spectrum when the THz source is off, with a mechanical resonance at 945 kHZ that corresponds to the in-plane flexural mode of the lever. The detected motion is Brownian in nature, triggered by thermal fluctuations of the room temperature environment of the device. In FIG. 8d, the source is on and is modulated at 945 kHz, which corresponds precisely to the mechanical resonance frequency. The spectrum now shows the Brownian motion of the lever with a Dirac-like resonant response atop. This peak shows that the mechanical device responds to the incident THz electromagnetic wave, and that this mechanical response can be made resonant provided the THz electromagnetic wave is modulated at the proper frequency. The peak value of 86 is the detected signal, while the base value in 85 at the same frequency represents the noise of the detector described in FIG. 8a.",
                        "FIG. 8e shows the input drive current of the THz source 88 and the output signal of the photodetectors 87 as a function of time. These signals are obtained with the help of an oscilloscope (not shown). Since the intensity of the THz source is a linear function of the drive current, the signal 88 represents the time variations of the intensity of the THz source. The signal 87 represents the mechanical response of the deformable element under the action of the THz radiation.",
                        "The incident THz radiation has a frequency ωTHz while its intensity is modulated at a frequency ωm<<ωTHz. The overall incoming signal is then of the form ITHz(t)=I0THz (1+cos(ωmt))cos2(ωTHzt). In order to have a significant mechanical response to the incoming THz radiation in the examples described by FIG. 8a, b, c, d, e, the frequency ωTHz is close—e.g. in the response bandwidth defined by the quality factor—to the electromagnetic resonance frequency of the THz split-ring resonator (condition (i)); and the frequency ωm is close—e.g. in the response bandwidth defined by the quality factor—to the mechanical resonance frequency of the mechanical resonator (condition (ii)).",
                        "If neither of the conditions (i) and (ii) is fulfilled, one observes only the thermal fluctuations of the cantilever motion, as shown in FIG. 8c.",
                        "If only i) is fulfilled, then one can observe a mechanical response for mechanical frequencies of the modulation much lower, that the mechanical resonant frequency, however this response is usually Qm times lower than the signal at resonance.",
                        "If only ii) is fulfilled, but not i), then the incoming THz radiation (whose terahertz frequency is far to the resonant frequency of the THz split-ring resonator) is not coupled into the THz resonator and no response is observed.",
                        "In one or more embodiments, the first element of the split ring does not react with a measurable mechanical response to an incident wave having solely a frequency equal to the mechanical frequency of resonance of the first element.",
                        "FIGS. 10a, 10b and 10c illustrate characteristics of a signal representative of a mechanical response in a THz optomechanical transducer according to the embodiment of FIG. 1a or 1b, and the experimental set-up shown in FIG. 8a.",
                        "FIG. 10a shows different spectra of the mechanical response of the cantilever of the embodiment of FIG. 1, measured with a spectrum analyzer, and as a function of the power of the incident electromagnetic wave. For these spectra, the laser source was driven at its maximum power of 4.7 mW and modulated with a square wave with a duty cycle of 16.5%, at a frequency fmod=955 kHz, close to the mechanical resonance of the cantilever. The power of the incident electromagnetic wave on the structure was attenuated with a series of identical paper absorbers, each providing 30% transmission. The curve 100 indicates the reference signal of the spectrum analyzer when the laser is not running and corresponds to the cantilever's Brownian motion. The displacement induced by the THz source appears as a single Dirac-like peak on top of the Brownian noise. The phase noise appearing in the spectra at higher THz powers (42 μW, 1.4 mW and 4.7 mW, respectively 107, 108 and 109 in FIG. 10b) reflects the phase noise of the signal generator used to modulate the QCL. From this data, and using the calibration of the noise spectral density Sxx(f) the amplitude of the cantilever motion and the NEP of the structure can be determined respectively, as shown in FIGS. 10b and 10c. It appears that the amplitude follows closely the expected linear dependence between the amplitude of the mechanical response and the amplitude of the incident electromagnetic wave and that the linear dynamics of the detector scheme is preserved over five orders of magnitude of the power of the incident electromagnetic wave. The responsivity and NEP obtained are respectively R=50 fm/nW, and NEP=8 nW/Hz1/2.",
                        "FIGS. 11a, 11b and 11c represent respectively a Lock-in signal (11a), a noise level (11b) and NEP (11c) as a function of the modulation frequency in a THz optomechanical transducer according to the embodiment of FIG. 1a or 1b.",
                        "To explore further the performance of the detector, its behavior as a function of the QCL current modulation frequency has been studied in order to determine the operation bandwidth of the detector. For these measurements, in order to access both amplitude and phase of the induced cantilever motion, the spectrum analyzer was replaced by the lock-in amplifier.",
                        "FIG. 11a shows the amplitude of the lock-in signal when fmod is spanned from 70 kHz to 18 MHz. This graph maps the mechanical transfer function for the driven deformable element movement excited by the THz radiation. Three modes are clearly visible; the first mode with a frequency fm1=955 kHz (111) presented above and two higher order modes at a frequency fm2=6 MHz (112) and a frequency fm3=16.7 MHz (113). These values are in excellent agreement with the theoretical expression fmn=2.81fm1(n−0.5)2 where n is order (1, 2, 3, . . . ).",
                        "FIG. 11b provides the noise spectrum of the detector in the same frequency range, for the case where the QCL in not running FIG. 11c provides an estimation of the detector's NEP as derived from the noise and signal spectra (namely by dividing the signal spectrum on the square root of the noise spectrum) and the knowledge of the QCL power. This graph shows, on one hand, that one can exploit high order mechanical resonances to operate the detector at higher modulation frequencies. On the other hand, the detector can be operated in wide bands around the mechanical resonances that are several times wider than their intrinsic linewidths.",
                        "FIGS. 12a, 12c and 12c represent high resolution scans of the lock-in signal (R) and phase (Φ), when the modulation frequency is varied near the cantilever mechanical resonance frequencies in a THz optomechanical transducer according to the embodiment of FIG. 1a or 1b.",
                        "FIGS. 12a, 12c and 12c show both the lock-in signal and phase in high resolution scans of fmod near the mechanical resonances. For the first 121, 122 and second 123, 124 order modes the phase remains very well determined for at least 5Γm, while the detector can be clearly operated around Γm even around 16.6 MHz. These modulation frequencies are thus considerably higher than commercially available Golay cells or bolometers.",
                        "FIG. 9 shows an embodiment of a piezoelectric detector of a signal representative of a mechanical response of a THz optomechanical transducer. This piezoelectric detector is implemented according to a piezoelectric detection scheme using a piezoelectric read-out. The electromagnetic resonator is composed of the metal parts 2 and 4. The part 2 is deposited on a dielectric piece 1, which is resting on a dielectric substrate 8. The part 4 is resting on a piezoelectric bar (or piezoelectric beam) 91, which is suspended over the dielectric substrate 8, and is hold by the leads 93 and 92. The leads 93 and 92 are electrical electrodes that provide an electric connection to the piezoelectric bar 91. Under the influence of an incident THz radiation, an electromagnetic resonance is excited in the resonator composed of 2 and 4. This results of the excitation of charges with opposite signs in the electric poles 51, 61 and 52, 62. The resulting Coulomb force induces a strain 7 on the piezoelectric bar 91. The strain induces a voltage in the leads 92 and 93 due to the piezoelectric effect. The leads 92 and 93 are conveniently connected to an external electrical circuit 94 and allow to read the piezoelectric voltage. Since the piezoelectric voltage is proportional to the intensity of the incident THz beam, this scheme allows an all electrical read out of the THz signal.",
                        "FIG. 13 shows the steps of an embodiment of a method for collecting and transducing an electromagnetic wave having a frequency within a terahertz frequency band of use by means of a terahertz optomechanical transducer according to any embodiment disclosed therein.",
                        "The terahertz optomechanical transducer comprises an electromagnetic resonator having a response bandwidth including a main frequency of electromagnetic wave. The electromagnetic resonator comprises a first element and an opposite element forming with the first element a capacitive gap of the electromagnetic resonator. In one or more embodiments, the electromagnetic resonator comprises a mechanical resonator. The mechanical resonator may comprise the first element and/or the opposite element.",
                        "The method comprises a step of generating 130 an incident electromagnetic wave. The frequency of the incident electromagnetic wave may be adjusted to the electromagnetic terahertz resonance frequency of the electromagnetic resonator, or more generally be in the response bandwidth of the electromagnetic resonator which corresponds to the electromagnetic terahertz resonance frequency up to the quality factor). In one or more embodiments, the intensity of the incident electromagnetic wave may be modulated at a frequency within a response mechanical frequency bandwidth of a mechanical resonator of the terahertz optomechanical transducer, to the resonance frequency of the mechanical resonator.",
                        "The method further comprises a step of collecting 131 the electromagnetic wave by the terahertz optomechanical transducer.",
                        "The method further comprises a step of producing 132 a mechanical response of at least one mechanically responsive element of the electromagnetic resonator by action of the force stemming from the electric field generated by interaction of the electromagnetic wave on electric charges present in the electromagnetic resonator. The first element and/or the opposite element may be mechanically responsive to the action of the force stemming from the electric field. The electric field may be generated between a first electric pole induced in the first element by first electric charges having a first electrical sign and a second electric pole induced in the opposite element by second electric charges having a second electrical sign opposite to the first electrical sign.",
                        "The method further comprises a step of detecting 133 an output signal representative of the mechanical response. The detection may be performed by any detection method described therein, for example based on optical means or electric means.",
                        "FIG. 14a and FIG. 14b illustrate a example of a THz optomechanical transducer 1 according to the present description with the electromagnetic characteristics of this example. In this example, the electromagnetic resonator comprises in one part the first element 2 and the opposite element 4 which may for example comprise a metal layer. The first element 2 and the opposite element 4 are separated by a gap 8. The first element 2 has the particularity to be suspended in the air over a substrate 32 between two dielectric layers 31 and in front of the opposite element 4. The suspension of the first element 2 between two dielectric layers 31 has the advantage to avoid the first element to stick to the substrate 32; moreover it allows a lighter first element to be made of just for example a layer of metal such as Au (as illustrated on the side view of this embodiment at the bottom of FIG. 14a). According one embodiment of this example, the entire electromagnetic resonator may rest on the dielectric layer 31 except the first element 2. FIG. 14b represents a simulation of electric fields generated in an electromagnetic resonator of the THz optomechanical transducer, in particular the horizontal electric field Ey distribution of the electromagnetic resonator. We observe from this simulation that the absolute maximum of the y components of the in-plane electric field is located in the gap 8. Thus under the influence of an incident THz radiation, an electromagnetic resonance is excited in the electromagnetic resonator composed of 2 and 4, this results of the excitation of charges with opposite signs in the electric poles 5, 6 and the resulting Coulomb force induces a displacement of the first element 2.",
                        "FIG. 15b illustrates an embodiment of a THz optomechanical transducer in a form of a patch antenna in two parts 23, 24, each part being an electrically-connected part of the electromagnetic resonator and are a metal layer. The first electrically-connected part 23 comprises the first element 2 which is the metal layer of the part 23 (mechanically responsive and the other electrically-connected part 24 comprises the opposite element 4. The first electrically-connected part 23 is suspended between two dielectric layers 31 above the second electrically-connected part 24. Thus the two-path connected parts 23, 24 are in two different planes separated by dielectric layers 31 and by for example air to electrically isolate the two electrically-connected parts. As the embodiment of FIG. 14a, this embodiment has the advantage to avoid the first element to stick to the substrate; moreover it allows a lighter first element to be realized with just for example a layer of metal such as Au. Further, the length L of the first electrically-connected part 23 allows controlling the number of dipoles in the electromagnetic resonator. The length L fixes the resonant wavelength λres of the electromagnetic mode, according to the formula kres=KL/2, with K=1, 2, . . . . For example, as illustrated in FIG. 15a, when the length L is equal to the wavelength corresponding to the frequency of the incident THz radiation, the resonance of the electromagnetic resonator is a second order resonance (K=2) with three dipoles and two nodes. For the embodiment of FIG. 15a, the applicant shows that the resulting Coulomb force is higher with the second order than with the first order (K=1). Indeed, in the case of the K=1 mode the Coulomb force develops at the edges of the suspended part, while in the case of the K=2 mode it develops at the center of the suspended part where the mechanical displacement is maximum.",
                        "FIG. 15b illustrates an embodiment of a THz optomechanical transducer in form of a “horseshoe” resonator. The two-path connected parts 23, 24 are in two different planes separated by a dielectric layer 31 to electrically isolate the two electrically-connected parts. The first electrically-connected part 23 is a “horseshoe” that acts as an inductive element. The first electrically-connected part 23 comprises the first element 2 which is mechanically responsive. The other electrically-connected part 24 is rectangular and comprises the opposite element 4, and also acts as an inductor. The regions where 23 and 24 overlap act as capacitors. The whole structure acts as THz capacitance-inductor resonator. When the electromagnetic resonance of the structure is excited by an incident electromagnetic wave, there is a pair of electrical poles that appear in each capacitive part. In particular, there is a electric field generated between a first electric pole 6 of the first pair of electric poles generated in the first element 2 and a second electric pole 5 of the second pair of electric poles generated in the opposite element 4, the two electric poles forming the electric field having opposite signs. This resonator architecture allows the capacitive part between 2 and 4 to be made very small, and hence the mechanical element 2 to be made with nonmetric dimensions. As the element 2 is made very small, its mechanical response frequency is very high and can be tuned in the GHz region. At the same time, the smaller capacitor volume means higher intensity of the local electric field, and hence a stronger quasi-static Coulomb force.",
                        "Optical detection means may include optical interferometry techniques, near-field optical read-out, balanced optical detection technique, optical quadrant detectors, and optical cavity enhanced techniques.",
                        "Electrical detection means may include capacitive read-out, piezo-resistive read-out, electron tunneling detection, piezo-electric techniques, magneto-resistive and magneto-electric techniques, electrostatic and dielectric read-out. The read-out mechanical response may be in direct relation to the impinging THZ radiation, which allows to either detect this radiation or to transfer the information carried by the THZ waves onto another information carrier signal, whether optical or electric.",
                        "An optomechanical THz detector and a THz optomechanical transducer that operate at room temperature and feature modulation frequencies that are much higher than current pyroelectric or bolometric detectors have been disclosed. This scheme is suitable for industrial applications that rely on powerful THz sources such as QCLs or synchrotron sources, such as tomography, free space communications through mists. Reducing the cantilever dimensions or using other types of resonators can increase even further the modulation frequencies. The planar geometry of the terahertz optomechanical transducer is also very convenient for large scale integration for imaging arrays, or for packaging the transducer on a single chip. Furthermore, the transducer is based on semiconductor technology and operates in frequency ranges where THz electronic transitions in quantum heterostructures can be achieved.",
                        "The optomechanical THz detector does not rely on a thermally sensitive material linking a substrate to an electromagnetic resonator. In other terms, the terahertz optomechanical transducer does not rely on an absorption of the terahertz wave which would deform thermally the element and displace the electromagnetic resonator. The first element need not to be linked to a substrate of the electromagnetic resonator by a thermally sensitive material.",
                        "In general, in one aspect, the present description relates to a terahertz optomechanical transducer/device for transducing an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use. The terahertz optomechanical transducer comprises an electromagnetic resonator having a response bandwidth including the frequency; the electromagnetic resonator comprising a first element and an opposite element forming with the first element a capacitive gap. The first element is configured to response mechanically to the action of a force stemming from an electric field generated by interaction of said incident electromagnetic wave with electric charges in said electromagnetic resonator. The electric field is generated between a first electric pole induced in said first element by first electric charges having a first electrical sign, and a second electric pole induced in said opposite element by second electric charges having a second electrical sign opposite to the first electrical sign. The first electric charges and the second electric charges alternate between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave.",
                        "In one or more embodiment, the first element is a mechanical resonator. The mechanical resonance frequency of this mechanical resonator is much lower, for example in the kHz domain or MHz domain, e.g. between 1 kHz and 10 GHz than the electromagnetic resonance frequency of the electromagnetic resonator and may thus be easily detected, for example using an optical or electrical detection scheme.",
                        "To generalize, it can be said that the terahertz frequency of the incident electromagnetic wave is at least six to three orders of magnitude higher than said mechanical resonance frequency",
                        "In one or more embodiments, multiple pairs of electric poles of opposite signs are generated by the interaction of the incident electromagnetic wave with electric charges in said electromagnetic resonator.",
                        "In one or more embodiments, the first or second electric charges are excited by said incident electromagnetic wave in a part of the electromagnetic resonator made of a dielectric material or a piezoelectric material.",
                        "In one or more embodiments, the first or second electric charges are excited by said incident electromagnetic wave in a part of the electromagnetic resonator made of a metal or a doped semiconductor material.",
                        "In one or more embodiments, the electromagnetic resonator comprises at least one split ring and the first element is a cantilever.",
                        "In general, in one aspect, the present description relates to a detector for detecting electromagnetic waves, said detector comprising at least one optomechanical terahertz transducer according to the present disclosure and a detection device for detecting an output signal representative of a mechanical response of a first element of at least one of said optomechanical terahertz transducer.",
                        "In general, in one aspect, the present description relates to method for transducing an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use. The method comprises: collecting the incident electromagnetic wave by an electromagnetic resonator having a response bandwidth including said frequency, said electromagnetic resonator comprising a first element and an opposite element forming with the first element a capacitive gap; and producing a mechanical response of the first element by action of an force stemming from an electric field generated by interaction of said electromagnetic wave on electric charges present in said electromagnetic resonator, wherein said electric field is generated between a first electric pole induced in said first element by first electric charges having a first electrical sign and a second electric pole induced in the opposite element by second electric charges having a second electrical sign opposite to the first electrical sign, wherein the first electric charges and the second electric charges alternate between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave.",
                        "In one or more embodiments, the mechanical response of the first 30 element is a frequency shift of the mechanical resonance of the first element.",
                        "In one or more embodiments, the mechanical response of the first element is a mechanical deformation or a motion of the first element or a piezoelectric strain.",
                        "In general, in one aspect, the present description relates to a method for detecting electromagnetic waves. The method comprises: transducing an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use by a method according to any method for transducing an electromagnetic wave disclosed herein; detecting an output signal representative of said mechanical response, the amplitude of the output signal being proportional to the intensity of said incident electromagnetic wave.",
                        "In one or more embodiments, the intensity of the incident electromagnetic wave is modulated at a frequency within a response bandwidth of a mechanical resonator comprising the first element.",
                        "Although described by way of a number of detailed example embodiments, the detector and the terahertz optomechanical transducer for transducing an incident electromagnetic wave having a frequency within a terahertz frequency band according to the present description comprise various variants, modifications and improvements that will be obvious to those skilled in the art, it being understood that these various variants, modifications and improvements fall within the scope of the disclosed devices or methods such as defined by the following claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce terahertz optomechanical transducer",
                        "define terahertz frequency band",
                        "describe electromagnetic resonator",
                        "specify response bandwidth of electromagnetic resonator",
                        "explain usage of incident electromagnetic wave",
                        "describe geometric characteristics of electromagnetic resonator",
                        "provide exemplary embodiments of electromagnetic resonator",
                        "describe split hollow form of electromagnetic resonator",
                        "describe dog-bone form of electromagnetic resonator",
                        "describe materials used in electromagnetic resonator",
                        "explain activation of electric charges",
                        "describe inductive-capacitive type of electromagnetic resonator",
                        "explain collection and conversion of incident electromagnetic wave",
                        "describe structure resonating devices",
                        "describe device with one or multiple electromagnetic resonators",
                        "describe detector with multiple optomechanical transducers",
                        "describe THz electromagnetic resonator and mechanical resonator",
                        "explain co-localization of THz wave and mechanical resonance mode",
                        "describe mechanical response of mechanically responsive element",
                        "provide examples of mechanically responsive elements",
                        "describe shift of mechanical equilibrium position",
                        "describe micromechanical movement of mechanically responsive element",
                        "describe mechanically responsive element with fixed and movable extremities",
                        "describe different embodiments of terahertz optomechanical transducer",
                        "describe electromagnetic resonator",
                        "detail deformable cantilever",
                        "explain capacitive gap",
                        "motivate Coulomb force",
                        "describe electric field generation",
                        "detail mechanical resonator",
                        "explain modulation of incident wave",
                        "compare to LC circuit",
                        "describe alternating electric charges",
                        "detail synchronous vibration",
                        "describe tuning fork embodiment",
                        "detail double split ring embodiment",
                        "explain symmetric electromagnetic resonator",
                        "describe two distinct electrically-connected parts",
                        "detail planar antenna embodiment",
                        "describe patch antenna embodiment",
                        "explain advantages of planar antennas",
                        "explain advantages of patch antennas",
                        "describe measurement of electromagnetic characteristics",
                        "detail set-up for measurement",
                        "show measurement results",
                        "simulate electric fields",
                        "describe vertical electric field distribution",
                        "describe horizontal electric field distribution",
                        "describe mechanical characteristics measurement",
                        "detail set-up for mechanical measurement",
                        "show mechanical measurement results",
                        "simulate fundamental mechanical mode",
                        "describe optical detection scheme",
                        "detail mechanical resonance frequency and quality factor",
                        "compute effective mass of oscillator",
                        "compute peak noise spectral density",
                        "calibrate voltage readings",
                        "simulate displacement of cantilever",
                        "describe displacement of free extremity",
                        "describe displacement of middle of cantilever",
                        "describe texture of element 4",
                        "detail first element and opposite element",
                        "explain electric field generation",
                        "describe force stemming from electric field",
                        "detail dynamic distribution of electric charges",
                        "describe fundamental electromagnetic resonance mode",
                        "describe detector embodiment",
                        "introduce optomechanical THz transducer",
                        "describe detection device",
                        "explain measurement of mechanical response",
                        "derive equation of motion",
                        "describe electric energy oscillation",
                        "explain effect of THz radiation",
                        "define internal responsivity",
                        "explain double effect of recycling",
                        "estimate effective capacitive gap",
                        "derive internal Noise Equivalent Power",
                        "apply equations to other geometries",
                        "describe detector embodiment with QCL",
                        "illustrate spectrum obtained by detector",
                        "show variation of signal amplitude",
                        "describe modulation of THz power",
                        "explain conditions for mechanical response",
                        "describe characteristics of signal",
                        "illustrate experimental set-up",
                        "show spectra of mechanical response",
                        "determine amplitude and NEP",
                        "summarize linear dynamics of detector",
                        "describe Lock-in signal, noise level, and NEP as a function of modulation frequency",
                        "analyze detector performance and operation bandwidth",
                        "show lock-in signal and phase in high resolution scans near mechanical resonances",
                        "describe piezoelectric detector and its operation",
                        "illustrate method for collecting and transducing THz radiation",
                        "describe step of generating incident electromagnetic wave",
                        "describe step of collecting electromagnetic wave by THz optomechanical transducer",
                        "describe step of producing mechanical response of mechanically responsive element",
                        "describe step of detecting output signal representative of mechanical response",
                        "illustrate example of THz optomechanical transducer with electromagnetic characteristics",
                        "simulate electric fields generated in electromagnetic resonator",
                        "describe embodiment of THz optomechanical transducer in form of patch antenna",
                        "describe embodiment of THz optomechanical transducer in form of \"horseshoe\" resonator",
                        "describe optical detection means",
                        "describe electrical detection means",
                        "summarize advantages of optomechanical THz detector and THz optomechanical transducer",
                        "describe planar geometry of THz optomechanical transducer",
                        "describe semiconductor technology and frequency ranges of THz electronic transitions",
                        "describe optomechanical THz detector without thermally sensitive material",
                        "define terahertz optomechanical transducer for transducing incident electromagnetic wave",
                        "describe electromagnetic resonator with response bandwidth including frequency",
                        "describe first element as mechanical resonator",
                        "describe multiple pairs of electric poles of opposite signs",
                        "describe electric charges excited in part of electromagnetic resonator",
                        "describe electromagnetic resonator with at least one split ring and cantilever",
                        "define detector for detecting electromagnetic waves",
                        "describe method for transducing incident electromagnetic wave",
                        "describe mechanical response of first element",
                        "describe method for detecting electromagnetic waves",
                        "describe intensity modulation of incident electromagnetic wave",
                        "describe variants, modifications, and improvements of detector and THz optomechanical transducer",
                        "describe detector and THz optomechanical transducer for transducing incident electromagnetic wave",
                        "describe various embodiments of detector and THz optomechanical transducer",
                        "describe operation of detector and THz optomechanical transducer",
                        "describe advantages of detector and THz optomechanical transducer",
                        "describe applications of detector and THz optomechanical transducer",
                        "describe scope of detector and THz optomechanical transducer",
                        "conclude description of detector and THz optomechanical transducer"
                    ],
                    "num_characters": 64609,
                    "outline_medium": [
                        "introduce terahertz optomechanical transducer",
                        "define terahertz frequency band",
                        "describe electromagnetic resonator",
                        "explain response bandwidth of electromagnetic resonator",
                        "motivate geometric characteristics of electromagnetic resonator",
                        "exemplify different forms of electromagnetic resonator",
                        "describe materials used for electromagnetic resonator",
                        "explain mechanical response of electromagnetic resonator",
                        "describe detector comprising multiple optomechanical transducers",
                        "explain electromagnetic/mechanical resonator",
                        "describe mechanical response of mechanically responsive element",
                        "exemplify different embodiments of terahertz optomechanical transducer",
                        "describe terahertz electromagnetic resonator",
                        "detail deformable cantilever element",
                        "explain capacitive gap formation",
                        "motivate high quasi-static Coulomb force",
                        "describe mechanical action induced by THz wave",
                        "detail electric field generation",
                        "explain cantilever vibration",
                        "describe modulation of incident electromagnetic wave",
                        "compare to LC circuit oscillation",
                        "detail alternating electric charges",
                        "describe deformable element motion",
                        "illustrate tuning fork embodiment",
                        "describe distinct electrically-connected parts",
                        "detail double split ring embodiment",
                        "explain single terahertz electromagnetic resonance",
                        "describe planar antenna embodiment",
                        "detail patch antenna embodiment",
                        "illustrate electromagnetic characteristics measurement",
                        "simulate electric fields generated",
                        "illustrate mechanical characteristics measurement",
                        "simulate fundamental mechanical mode of cantilever",
                        "describe detector embodiment",
                        "illustrate detector components",
                        "explain detection and measurement methods",
                        "derive equation of motion for deformable element",
                        "analyze effect of THz radiation on cantilever",
                        "define internal responsivity and noise equivalent power",
                        "illustrate detector operation with figures",
                        "describe modulation of THz power and detection of mechanical response",
                        "show spectra of mechanical response with and without THz source",
                        "illustrate characteristics of signal representative of mechanical response",
                        "analyze amplitude of cantilever motion and NEP of structure",
                        "describe THz optomechanical transducer performance",
                        "show lock-in signal and noise level",
                        "analyze mechanical resonances",
                        "illustrate high resolution scans of lock-in signal and phase",
                        "describe piezoelectric detector",
                        "illustrate piezoelectric detector embodiment",
                        "describe method for collecting and transducing THz wave",
                        "illustrate THz optomechanical transducer embodiment",
                        "simulate electric fields in electromagnetic resonator",
                        "describe patch antenna embodiment",
                        "illustrate patch antenna embodiment",
                        "describe \"horseshoe\" resonator embodiment",
                        "illustrate \"horseshoe\" resonator embodiment",
                        "describe optical and electrical detection means",
                        "summarize THz detector and transducer advantages",
                        "describe optomechanical THz detector and transducer",
                        "describe terahertz optomechanical transducer device",
                        "describe detector for detecting electromagnetic waves",
                        "describe method for transducing and detecting electromagnetic waves"
                    ],
                    "outline_short": [
                        "define terahertz frequency band",
                        "describe electromagnetic resonator structure",
                        "explain response bandwidth and quality factor",
                        "illustrate various embodiments of electromagnetic resonator forms",
                        "describe mechanical response and detector structure",
                        "detail specific embodiments of mechanically responsive elements",
                        "describe terahertz electromagnetic resonator",
                        "explain mechanically responsive element",
                        "detail Coulomb force and electric field",
                        "describe modulation of incident electromagnetic wave",
                        "compare to LC circuit",
                        "illustrate various embodiments of electromagnetic resonator",
                        "describe electric poles and electric field generation",
                        "illustrate planar and patch antennas",
                        "describe measurement of electromagnetic characteristics",
                        "illustrate mechanical characteristics of THz optomechanical transducer",
                        "describe detector embodiment",
                        "derive equation of motion",
                        "analyze effect of THz radiation",
                        "illustrate detector operation",
                        "show experimental results",
                        "describe THz optomechanical transducer performance",
                        "illustrate lock-in signal and noise spectrum",
                        "show high resolution scans of lock-in signal and phase",
                        "describe piezoelectric detector embodiment",
                        "outline method for collecting and transducing THz radiation",
                        "illustrate THz optomechanical transducer embodiments",
                        "describe detection means",
                        "summarize advantages and applications",
                        "define terahertz optomechanical transducer and detector"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. Detector for terahertz electromagnetic waves comprising:\nat least one first device configured to collect and transform an incident electromagnetic wave, having a terahertz frequency within a terahertz frequency band, into 5 a measurable mechanical response; and\na detection device for detecting an output signal representative of the measurable mechanical response;\nsaid first device comprising a first element and an opposite element forming with the first element a capacitive gap;\nsaid first element being a mechanical resonator having a mechanical resonance frequency and being configured to response mechanically to the action of a force stemming from an electric field,\nwherein said electric field is generated between at least one first electric pole induced in said first element, by first electric charges having a first electrical sign, and at least one second electric pole induced in said opposite element, by second electric charges having a second electrical sign opposite to the first electrical sign,\nwherein the first device is a terahertz optomechanical transducer which is a terahertz electromagnetic resonator made at least of metal, configured by geometric characteristics and dimensions to collect the incident terahertz electromagnetic wave and to transform the incident electromagnetic wave into a measurable mechanical response,\nwherein the terahertz frequency of the incident electromagnetic wave corresponds to the electromagnetic resonance frequency of the terahertz electromagnetic resonator or is in a response frequency bandwidth of the terahertz electromagnetic resonator,\nwherein the terahertz electromagnetic resonator comprises the first element and the opposite element,\nwherein the first element and the opposite element each comprise a support layer and an electrically conductive layer which is a metal pattern,\nwherein the electric field is generated by interaction of said incident electromagnetic wave with electric charges in said terahertz electromagnetic resonator,\nwherein the first electric charges and the second electric charges alternate in signs between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave, and\nwherein the mechanical resonance frequency of the mechanical resonator is lower than the electromagnetic resonance frequency of the terahertz electromagnetic resonator.",
        "2. (canceled)",
        "3. The detector according to claim 1, wherein the electromagnetic resonance frequency of the terahertz electromagnetic resonator is at least three orders of magnitude higher than said mechanical resonance frequency.",
        "4. The detector according to claim 1, wherein the detector comprises modulation means for modulating the intensity of the incident electromagnetic wave at a frequency in a response bandwidth of the mechanical resonator.",
        "5. The detector according to claim 1, wherein the opposite element is configured to response mechanically to the action of the force stemming from the electric field.",
        "6. The detector according to claim 1, wherein the first element and/or the opposite element comprise at least one support layer in semiconductor or dielectric material supporting the electrically conductive layer.",
        "7. The detector according to claim 1, wherein the terahertz electromagnetic resonator is on a substrate, and the first element has a flexible part suspended above the substrate, the flexible part having a movable extremity and a fixed extremity relative to the substrate, or being fixed on two extremities.",
        "8. The detector according to claim 1, wherein the first element is one element from the group consisting of a vibrating arm/bar/beam, a wire, a lever, a membrane, a disk, a plate, a pillar, a post, an array, a torsional system, a ring, a rectangular patch, a circular patch, a bulk-mode mechanical resonator, a contour mode mechanical system, a bulk acoustic wave resonator, a tuning fork, a surface acoustic wave resonator.",
        "9. The detector according to claim 1, wherein multiple pairs of electric poles of opposite signs are generated by the interaction of the incident electromagnetic wave with electric charges in said terahertz electromagnetic resonator, and wherein the terahertz optomechanical transducer comprises at least a second element in which a second pair of electric poles of opposite signs are induced by the action of the incident electromagnetic wave on the electric charges in said terahertz electromagnetic resonator.",
        "10. The detector according to claim 1, wherein the terahertz electromagnetic resonator comprises one continuous electrically-connected part which comprises at least the electrically conductive layer made of metal, the first element and the opposite element forming two opposite ends of said continuous electrically-connected part.",
        "11. The detector according to claim 1, wherein terahertz electromagnetic resonator comprises at least two continuous electrically-connected parts which are electrically separated, each continuous electrically-connected part presenting each at least one electrically conductive layer made of metal, the first element forming an end of a first continuous electrically-connected part and the opposite element forming an extremity of a second continuous electrically-connected part.",
        "12. The detector according to claim 10, wherein the terahertz electromagnetic resonator comprises at least one split ring.",
        "13. The detector according to claim 10, wherein the terahertz electromagnetic resonator comprises a single split ring comprising the first element and the opposite element.",
        "14. The detector according to claim 11, wherein the terahertz electromagnetic resonator comprises a double split ring having a single electromagnetic resonance, a first split ring which is a first electrically-connected part of the terahertz electromagnetic resonator and a second split ring which is a second electrically-connected part, of the terahertz electromagnetic resonator, the first element being formed at the end of the first split ring and the opposite element being formed at the end of the second split ring.",
        "15. The detector according to claim 1, wherein the electromagnetic resonance frequency of the terahertz electromagnetic resonator is at least six orders of magnitude higher than the mechanical resonance frequency of the mechanical resonator.",
        "16. The detector according to claim 1, wherein the terahertz optomechanical transducer operates without any electrical/magnetic device for moving the first element.",
        "17. The detector according to claim 1, wherein the distance between the first pole and the second pole 5 is between 10 nm and 10 μm.",
        "18. A method for detecting terahertz electromagnetic waves with a detector according to claim 1, comprising:\ntransforming an incident electromagnetic wave having a terahertz frequency within a terahertz frequency band of use, into a measurable mechanical response, with a terahertz optomechanical transducer configured by geometric characteristics and dimensions to collect the incident electromagnetic wave, the transducer having a first element and an opposite element forming with the first element a capacitive gap,\nthe first element and the opposite element each comprising a support layer and an electrically conductive layer which is a metal pattern;\ndetecting an output signal representative of said mechanical response by the detection device of the detector, the amplitude of the output signal being proportional to the intensity of said incident electromagnetic wave,\nwherein transforming the incident electromagnetic wave into a measurable mechanical response comprises:\ncollecting the incident electromagnetic wave by the terahertz optomechanical transducer of the detector;\nwherein the terahertz frequency of the incident electromagnetic wave corresponds to the electromagnetic resonance frequency of the terahertz electromagnetic resonator or is in a response bandwidth of the terahertz electromagnetic resonator,\nproducing a mechanical response of the first element by action of a force stemming from an electric field generated by interaction of said electromagnetic wave on electric charges present in said terahertz electromagnetic resonator,\nwherein said electric field is generated between a first electric pole induced in said first element, by first electric charges having a first electrical sign and a second electric pole induced in said opposite element, by second electric charges having a second electrical sign opposite to the first electrical sign, and\nwherein the first electric charges and the second electric charges alternate in signs between the first and the second electric poles in time at the terahertz frequency of the incident electromagnetic wave, and\nwherein the mechanical resonance frequency of the first element is lower than the electromagnetic resonance frequency of the terahertz electromagnetic resonator.",
        "19. (canceled)",
        "20. The method according to claim 18, wherein the mechanical response of the first element is a mechanical deformation or a motion of the first element or a piezoelectric strain.",
        "21. The method according to claim 18, wherein the intensity of the incident electromagnetic wave is modulated at a frequency within a response bandwidth of the mechanical resonator.",
        "22. The method according to claim 18, wherein the intensity of the incident electromagnetic wave is modulated at a frequency equal to or near to the mechanical resonance frequency of the mechanical resonator.",
        "23. The method according to claim 18, wherein the first element deforms mechanically to the action of a force only stemming from the electric field generated by interaction of said incident terahertz electromagnetic wave with electric charges in said terahertz electromagnetic resonator.",
        "24. The detector according to claim 3, wherein the detector comprises modulation means for modulating the intensity of the incident electromagnetic wave at a frequency in a response bandwidth of the mechanical resonator.",
        "25. The detector according to claim 11, wherein the terahertz electromagnetic resonator comprises at least one split ring."
    ]
}