{
    "id": "https://semopenalex.org/work/W1980831148",
    "authors": [
        "Jinjun Wang",
        "Kwing-So Choi",
        "Li-Hao Feng",
        "Takayuki Matsunuma",
        "Takehiko Segawa",
        "Timothy Jukes",
        "Richard D. Whalley"
    ],
    "title": "Plasma Virtual Actuators for Flow Control",
    "date": "2015-01-01",
    "abstract": "Dielectric-barrier-discharge (DBD) plasma actuators are all-electric devices with no moving parts. They are made of a simple construction, consisting only of a pair of electrodes sandwiching a dielectric sheet. When AC voltage is applied, air surrounding the upper electrode is ionized, which is attracted towards the charged dielectric surface to form a wall jet. Control of flow over land and air vehicles as well as rotational machinery can be carried out using this jet flow on demand. Here we review recent developments in plasma virtual actuators for flow control that can replace conventional actuators for better aerodynamic performance.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Dielectric-barrier-discharge (DBD) plasma actuators are unique devices that are useful for flow control applications. They are all-electric devices with a simple construction, consisting only of a pair of electrodes sandwiching a dielectric sheet. When AC voltage is applied, air surrounding the upper electrode is ionized, which is attracted towards the charged dielectric surface to form a wall jet [1]- [3]. Figure 1 shows a typical configuration of an asymmetric DBD plasma actuator, showing the region of the plasma and the direction of induced flow (to the right in this figure). The flow velocity could reach to 10 m/s. The induced flow will develop into a wall jet during a continuous operation of plasma actuators, as shown in Figure 2 [4]. Strong entrainment towards the  wall is clearly seen around the actuator, while the wall-jet velocity profile becomes similar to that created from a two-dimensional nozzle.",
                "Unlike conventional actuators, such as pneumatic, hydraulic and electromagnetic actuators, DBD plasma actuators do not require any moving parts, such as valves, diaphragms, cylinders or gears, in order to activate them. For example, it is possible to replace conventional \"mechanical\" vortex generators with DBD plasma actuators, called plasma vortex generators (VGs). Here, the profile drag penalty that is associated with mechanical vortex generators can be avoided by activating DBD plasma actuators on demand when and as required. DBD plasma actuators can be used to actively control the flow around vehicles, easily adapting to their operating conditions. They are much faster acting than any actuators currently available, which can be integrated well with hybrid and electric motor vehicles as well as future all-electric aircraft.",
                "In this review paper, we introduce a number of examples where plasma actuators can be used for flow control purposes in place of conventional actuators. Our examples include plasma vortex generators, plasma Gurney flaps, plasma travelling wave makers and plasma tip-clearance seals, although there are many more potential plasma virtual actuators."
            ],
            "subsections": []
        },
        {
            "title": "Plasma Vortex Generators",
            "paragraphs": [
                "By tailoring the direction of the wall jet from a DBD plasma actuator it is possible to create strong longitudinal vortices, similar to those created by vane-type vortex generators (VGs). A typical DBD plasma VG is configured with a single plasma actuator aligned along the primary air flow direction. The electro-hydrodynamic body force and resulting wall jet are directed into the spanwise direction, perpendicular to the incoming flow. The wall jet consequently becomes twisted into the streamwise direction by the oncoming boundary layer [4]. This forms a streamwise vortex from the plasma actuator tip by the twisting and folding of spanwise vorticity in the boundary layer into the outer shear layer of the wall jet, as drawn schematically in Figure 3. The wall jet then continually adds vorticity to increase the circulation along the length of the actuator. In addition to creating longitudinal vortices like conventional VGs, there is extra wall-ward suction due to entrainment into the DBD plasma [4]. Of course the DBD plasma VGs can be rapidly switched on and off as required without adding profile drag because it is a flush mounted device.",
                "DBD plasma VGs have been studied singly [4] [5], where it was found that the streamwise vortex circulation increases with wall jet-to-freestream velocity ratio. The circulation also increases with the actuator length and is maximized when the actuator is placed parallel to the freestream direction (i.e. with no yaw angle). Thus stronger vortices are created by long, stream wise-oriented DBD plasma VGs at high voltage and/or frequency. For practical use, however, DBD plasma VGs can be easily configured into VG arrays [5] [6]. Different types of array may be produced by simply changing the configuration of the lower electrode (see Figure 4). Streamwise vortices created from two different types of VG arrays are shown for example in Figure 5. DBD plasma VGs   with continuous lower electrodes produce wall jets on both sides of the upper electrodes, thus forming pairs of counter-rotating vortices with common-flow towards the wall. DBD plasma VGs with staggered lower electrodes produce wall jets only on one side of each upper electrode, forming arrays of co-rotating vortices. Generally counter-rotating DBD plasma VGs are more effective for flow separation control due to larger wall-ward velocity component, but care should be taken to choose the correct spacing to prevent unfavorable interactions between adjacent vortices whilst maintaining sufficient coverage for effective flow control [5] [6].",
                "The DBD plasma VG arrays have been applied near the leading edge of a NACA 4418 airfoil for flow separation control [6]. These mitigated separation at wall jet-to-freestream velocity ratio W p /U ∞ = 14% for all angles of attack less than 22˚ at Re c = 3.5 × 10 4 . This resulted in up to 65% reduction in drag coefficient and an increase in lift coefficient by ΔC l = 0.4, as shown in Figure 6. These actuators were also effective at Re c = 9.5 × 10 4 , where a separation bubble could be eliminated at low angles of attack (2˚ < α < 8˚), and leading-edge stall delayed until α = 16˚. This stall delay is very similar behavior to conventional VGs [7], except that conventional VGs cause a significant drag increase whereas plasma VGs do not (see Figure 6(a)). A counter-rotating array of DBD plasma VGs was also successfully used on a NACA 0015 airfoil at Re c = 1.6 × 10 5 , as shown in Figure 7. Here, a trailing-edge flow separation was controlled and stall prevented up to α = 14.8˚ [8]. DBD plasma VG arrays have also been used to mitigate stall on a 20˚ backward facing ramp for W p /U ∞ > 7% (U ∞ < 15 m/s) [5].",
                "DBD plasma VGs can be more versatile and effective than plasma actuators aligned across the span, largely because plasma VGs can act over a large streamwise domain. As such there is potential for DBD plasma VGs in rotating stall applications, for example on a wind turbine.   reduces. With plasma, rotating stall was delayed which causes a shift in the flow separation zone back towards the hub. This can be clearly seen in Figure 8, where the dark stalled region (low velocity) moves from around 0.35 < r/R < 0.7 to 0.3 < r/R < 0.5 when DBD plasma VGs are turned on. Since it is the outer part of the blade that generates the majority of the power, this should have a significant improvement on the turbine power output in unfavorable wind conditions such as during start-up and with wind shear. The plasma can also respond very quickly to enhance power generation in gusty wind conditions, potentially through feedback control [9]."
            ],
            "subsections": []
        },
        {
            "title": "Plasma Gurney Flaps",
            "paragraphs": [
                "Gurney flaps consist of a small vertical plate of a few percent chord attached over the pressure side of an airfoil at the trailing edge. Despite its size and simplicity of its design, the lift coefficient can be greatly increased by Gurney flaps with only a small increase in drag coefficient [10]. The lift enhancement by Gurney flaps comes from two sources. The first is a low-speed separation bubble formed in front of the flap, creating a high pressure region. This increases the pressure difference across the airfoil to help increase the lift coefficient. The second is a recirculation region formed in the downstream of the flap, which acts to increase the airfoil camber to help attach the separating flow near the trailing edge. Zhang et al. set a plasma actuator on the blunt trailing edge of a NACA 0012 airfoil [11], demonstrating that the plasma control could increase the lift coefficient in a similar way as a mechanical Gurney flap. Here, the Kutta condition at the airfoil trailing-edge was altered by the plasma-induced wall jet to give an observed lift enhancement [12]. Feng et al. [13] placed a plasma actuator on the downstream surface of a mechanical Gurney flap as shown in Figure 9(a). Three different Gurney flaps with different height h/c = 3.0%, 4.5% and 7.0% were tested with the momentum coefficient of plasma jet C μ = 0.11%, 1.15%, and 1.39%, respectively. The result is given in Figure 9(b), showing that the lift coefficient of the airfoil is increased with an increase in the Gurney flap height. When the plasma actuator is activated, a further increase in the lift coefficient was observed for all angles of attack tested. The result also suggests that 1% increase in momentum coefficient C μ of the plasma forcing corresponds to an effective Gurney flap height increment of 1%.",
                "Feng et al. [14] proposed a new concept in designing virtual Gurney flaps by placing DBD plasma actuators onto the bottom surface of the airfoil near the trailing edge. The first configuration of the virtual Gurney flap consisted of two 1 mm-wide exposed electrodes and a common 4 mm-wide embedded electrode over a 250 μm thick Mylar dielectric sheet (see Figure 10  Without plasma, there is a recirculation region downstream of the airfoil trailing edge, which is extended to x/c = 0.12 at the angle of attack α = 0˚ (Figure 11(a)). With plasma control by configuration 1, the size of the recirculation region downstream of the airfoil trailing edge is reduced with the downstream edge located at x/c = 0.04 (Figure 11(b)). There is a high-speed region near the plasma actuators, which is formed by the interaction between the plasma-induced jet and the free stream. On the other hand, there is no difference in the flow field by plasma over the upper surface of the airfoil. When the plasma actuator with configuration 2 is applied, the interaction between the plasma-induced jet and the free stream results in a formation of a recirculation region near the plasma actuator over the pressure surface (Figure 11(c)). This recirculation region draws air from the suction side of the airfoil to increase the velocity, increasing suction on the upper surface. At the same time, a stagnation region with higher pressure is created in the upstream of the recirculation region. Further, the wake region downstream of the airfoil is decreased in size and is shifted downwards (in negative y direction), suggesting that the plasma control increases the equivalent camber of the airfoil. Therefore, the mechanism of the lift enhancement by the virtual Gurney flap is very similar to that of a mechanical Gurney flap but with no profile drag associated with it, just like for DBD plasma VGs."
            ],
            "subsections": []
        },
        {
            "title": "Plasma Travelling Wave Makers",
            "paragraphs": [
                "Skin-friction drag reduction by transverse wall motions have been studied extensively in recent years: see Karniadakis and Choi [15] for a review. One particular type of transverse wall motion is achieved by using the spanwise travelling-wave technique, which was first studied by Du and Karniadakis [16] using a direct numerical simulation (DNS). They implemented the spanwise travelling waves at the wall of a turbulent channel flow using a Lorentz force with the following form, ( )",
                "Here, F z is the spanwise force, I is the forcing amplitude, ∆ is the penetration depth, λ z = 2π/k z is the spanwise wavelength (k z is the spanwise wave number), T = 2π/ω is the period of forcing (ω is the angular frequency) and t is time. The coordinate system x, y and z are in the streamwise, wall-normal and spanwise direction, respectively. Du et al. [17] demonstrated that the spanwise travelling-wave technique can yield a drag reduction of up to 30% once I, ∆, λ z and ω were optimized. The spanwise travelling waves had a profound effect on the nearwall turbulence: they amalgamated the sublayer streaks into wide ribbons of low-speed fluid, which caused significant disruption to the turbulence regeneration cycle. Experimental investigations of spanwise travelling waves with electromagnetic actuation soon followed [18] [19], where Xu and Choi [19] observed the formation of the wide ribbons of low-speed fluid within the viscous sublayer and measured a 30% reduction in skin-friction drag.",
                "Spanwise travelling waves were also implemented with out-of-plane motions of a flexible wall. In their DNS, Zhao et al. [20] observed a skin-friction drag reduction of 30% due to the change in boundary-vorticity flux that was generated by the acceleration of the deforming wall. Itoh et al. [21] and Itoh and Tamano [22] studied experimentally the out-of-plane motion of a flexible wall in a turbulent boundary layer. They observed a skin-friction drag reduction of the order of 10%, which was attributed to the reduction in sweep intensity and the increase in the contribution of Reynolds stress by inward-wall interactions. Until recently, spanwise travelling waves have only been created by either a Lorentz force or by a deformable wall. Yet these approaches have drawbacks: Lorentz force actuation works only in a liquid flow, while deformable walls have difficulties in practical implementation. For these reasons, Whalley and Choi [23] conducted an experimental investigation into the use of a plasma travelling wave in air in order to make this innovative flow control technique more applicable to the aerospace sector.",
                "The boundary-layer measurements of Whalley and Choi [23] were performed at a free-stream velocity of U ∞ = 1.8 m/s, in a boundary layer with thickness of δ = 90 mm, giving the Reynolds number of Re τ = δu τ /ν = 435, where u τ is the friction velocity and ν is the kinematic viscosity. The plasma travelling waves were generated over a four-phase forcing cycle with either a unidirectional or bidirectional forcing configuration: see Figure 12(a The amalgamation of the sublayer streaks into wide ribbons of low-speed fluid is a prominent and recurring observation of spanwise travelling-wave control whether implemented with a Lorentz or plasma forcing. Therefore, the formations of the wide ribbons of low streamwise velocity within the viscous sublayer are thought to play an important role in the drag reduction mechanism [16] [17] [23]. Whalley and Choi [23] were able to show using the quadrant analysis that it is the second quadrant (Q-II) and the third quadrant (Q-III) turbulence events created by the plasma-induced streamwise vortices that are directly responsible for the formation of the wideribbons of low-speed fluid within the viscous sublayer with plasma travelling-wave control."
            ],
            "subsections": []
        },
        {
            "title": "Plasma Tip-Clearance Seals",
            "paragraphs": [
                "Since Roth et al. [25] demonstrated their potential, conventional two-dimensional, sheet-type DBD plasma actuators (see Figure 1) were used in a number of flow control applications. However, there are many technical problems in attaching DBD plasma actuators on three-dimensional metallic (electrically conducting) surfaces.",
                "One of the solutions is to use new string-type DBD plasma actuators (Patent WO2014/024590 pending) being developed at AIST [26] [27]. Figure 14 shows a schematic view of a string-type DBD plasma actuator, consisting of a flexible metallic wire coated with an insulating (dielectric) material, instead of an encapsulated, sheet electrode. When string-type DBD plasma actuators are attached to a metallic surface, the exposed electrode is unnecessary because the metallic (electrically conductive) surface can be used as an exposed electrode for plasma discharge. If elastic materials such as polytetrafluoroethylene (PTFE) or silicone resin are chosen for the wire insulation material for string-type DBD plasma actuators, it is also possible to attach these actuators over three-dimensional surfaces. String-type DBD plasma actuators also offer an advantage over conventional sheettype DBD plasma actuators that damaged actuators can be easily replaced.",
                "With regard to tip clearance flow control of turbines, Van Ness et al. [28] investigated the effect of active control using blade-tip-mounted plasma actuators. Saddoughi et al. [29] also investigated the tip clearance flow control using plasma actuators upstream of the rotor leading edge of a transonic compressor. Here, tip clearance loss of a turbine blade can account for as much as 40% of the total energy loss [30], therefore, this topic has been intensively studied over the years. For a comprehensive review of tip clearance flow and its effects on the performance of turbo-machineries, readers are referred to Sjolander [31].",
                "String-type DBD plasma actuators can be used to mitigate of tip clearance flow in turbo-machineries such as gas turbines and turbochargers, by simply applying high voltages at radio frequencies. Our strategy in using string-type DBD plasma actuators is quite simple, which is illustrated in Figure 15. Here, the turbine blades, casing wall, and other surface conductive materials are connected to ground for safety. On the other hand, metal wires, for which high voltages are applied, are covered by insulating materials and embedded in the casing wall. DBD plasma is formed selectively in the regions where the turbine blade tips come close to the casing wall during the rotation of turbine blades.  Figure 16 shows the flow field of hot-wire measurements [32]. The axial distance of the measurement plane is 10.3 mm from the rotor trailing edge. This is 60% of the axial chord length of the turbine blade at the tip (C ax,tip ) downstream (in z-direction) from the trailing edge, i.e. z/C ax,tip = 1.60. Figure 17 shows the turbulence intensity distributions at the rotor exit for various input voltages. Here, the turbulence intensity was normalized by the main flow velocity at the rotor exit. At the baseline condition (Figure 17(a)), a high turbulence intensity region exists near the tip endwall, due to the tip leakage flow (tip leakage vortex). No significant change was observed at the lower input voltages (Figure 17(b) and Figure 17(c)) when the plasma is applied to string-type actuators; however, at the higher input voltages (Figure 17(d) and Figure 17(e)), the high turbulence intensity region is gradually reduced. The peak of turbulence intensity, at V AC = ±6.0 kV, is 0.18, which represents a 22% reduction compared to the peak at the baseline (0.23). The reduction in turbulence intensity confirms the successful reduction of tip leakage flow by this type of plasma actuator."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "DBD plasma actuators have been demonstrated as virtual vortex generators, virtual Gurney flaps, travelling wave makers and tip-clearance seals, where significant improvements in aerodynamic and flow control performance could be made. As such, DBD plasma actuators offer advantages over conventional actuators in such applications. The main issue for an industrial application of DBD plasma actuators is their authority at higher speeds. This requires further development of the power supply as well as actuator materials and construction, which are, however, feasible with the existing technology. The design of these plasma virtual actuators does not require as high jet velocity as some of other actuator concepts; therefore, they are readily available for application to automobiles and UAVs (unmanned aerial vehicles).   "
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgements",
            "paragraphs": [
                "Gratitude is due to EPSRC Research Grant EP/G025150/1, the China Scholarship Council and the Royal Academy of Engineering for supporting this research programme. T.J. would like to acknowledge funding from the University of Nottingham Advance Research Fellowship (NARF), while L.F. would like to thank the support of Specialized Research Fund for the Doctoral Program of Higher Education (20121102120015) and the Fundamental Research Funds for the Central Universities (YWF-14-HKXY-007). R.D.W. acknowledges the support in part of the EPSRC PhD plus Fellowship to carry out this work."
            ],
            "subsections": []
        }
    ]
}