{
    "id": "https://semopenalex.org/work/W4281677085",
    "authors": [
        "Thierry Conard",
        "Jef Poortmans",
        "Jan D’Haen",
        "Yaser Abdulraheem",
        "Bart Ruttens",
        "Tom Aernouts",
        "I. Vaesen",
        "Yinghuan Kuang",
        "Weiming Qiu",
        "Wenya Song",
        "Yiqiang Zhan",
        "Stijn Lammar",
        "Xin Zhang"
    ],
    "title": "Critical Role of Perovskite Film Stoichiometry in Determining Solar Cell Operational Stability: a Study on the Effects of Volatile A-Cation Additives",
    "date": "2022-06-10",
    "abstract": "Volatile A-cation halide (AX) additives such as formamidinium chloride and methylammonium chloride have been widely employed for high-efficiency perovskite solar cells (PSCs). However, it remains unstudied how they influence the perovskite film stoichiometry and the solar cell performance and operational stability. Hereby, our work shows that over annealing of formamidinium chloride-containing perovskite films leads to a Pb-rich surface, resulting in a high initial efficiency, which however decays during maximum power point tracking (MPPT). On the contrary, perovskite films obtained by a shorter annealing time at the same temperature provide good stability during MPPT but a lower initial efficiency. Thus, we deduce that an optimal annealing is vital for both high efficiency and operational stability, which is then confirmed in the case where methylammonium chloride additive is used. With optimized perovskite annealing conditions, we demonstrate efficient and stable p-i-n PSCs that show a best power conversion efficiency of 20.7% and remain 90% of the initial performance after a 200 h MPPT at 60 °C under simulated 1 sun illumination with high UV content. Our work presents a comprehensive understanding on how volatile AX impacts perovskite film stoichiometry and its correlation to the device performance and operational stability, providing a new guideline for fabricating high-efficiency and operationally stable PSCs.",
    "sections": [
        {
            "title": "INTRODUCTION",
            "paragraphs": [
                "Organometal halide perovskite solar cells (PSCs) have achieved more than 25% efficiency [1][2][3][4] and their operational stability has also seen significant progress. [5][6][7][8] However, the root-causes of device degradation under operation are still not fully understood, which is critical for further improvement of device operational stability. Previous studies have shown that the composition of perovskite films plays a crucial role in determining device stability. 6,9 On the one hand, it is generally believed that methylammonium-free perovskites, e.g. Formamidinium cesium (FACs) cation based perovskites, are better than the ones containing methylammonium cation (MA + ), due to the volatile nature of MA compound that changes the perovskite film stoichiometry. 10,11 On the other hand, volatile additives such as FACl [12][13][14] and MACl [15][16][17][18][19] have been widely used to achieve high-efficiency perovskite solar cells, since they could optimize the perovskite crystal formation dynamics. 17,20 This brings the scientific question currently scarcely studied, i.e., how such volatile additives influence the perovskite film stoichiometry and how this correlates to the device performance and operational stability.",
                "We first carried out our investigation on the gas-quenched perovskite films with a nominal composition of Cs0.1FA0.9PbI2.865Br0.135 which were prepared with volatile FACl as the additive. By changing the thermal annealing time during film process, the stoichiometry of the perovskite film can be well controlled. This enables us to link the film stoichiometry to the device operational stability. Our results show that an optimal annealing condition is crucial to achieve both high efficiency and long-term stability. The over annealing of perovskite film with volatile A-cation additives results in an A-cation deficiency or in other words a Pb-rich surface, which leads to a high initial power conversion efficiency (PCE). However, this kind of high-PCE solar cells degrade fast under the solar cell operational MPPT condition. On the contrary, perovskite films obtained from less annealing time at the same temperature provide good stability under MPPT but at a lower initial efficiency. The same trend is then further confirmed in the case where MACl is used as the additive. With careful control on the thermal annealing condition, we demonstrate efficient and stable PSCs that show a best PCE of 20.7% and remain 90% of the initial performance after MPPT tracking for 200 hours at 60 °C under 1 sun illumination with high UV content. Our work presents a comprehensive understanding on the role of volatile additives on the perovskite film stoichiometry and its correlation to the device performance and operational stability, providing a new guideline for the fabrication of high-efficiency and operational stable PSCs."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS AND DISCUSSION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Stoichiometry control of perovskite films",
                    "paragraphs": [
                        "In this study, we employed the dual-cation perovskite films with a nominal ABX3 composition of Cs0.1FA0.9PbI2.865Br0.135 on glass/ITO/poly[bis(4-phenyl) (2,4,6-trimethylphenyl) amine] (PTAA) substrates, fabricated from a gas-quenching method shown in Figure 1. The perovskite films with volatile FACl additive were prepared from the precursor solution with 5 mol% excess FACl compared to the stoichiometric ABX3 composition (denoted as ABX3 + 5% excess FACl). To investigate the influence of thermal annealing condition on perovskite stoichiometry, we annealed the as-prepared films made from the same solution at 130 °C for 1, 5, 10, 20, 30 and 40 min in a N2-filled glovebox, respectively. Furthermore, two reference films are prepared respectively from stoichiometric precursor solution without any additive (denoted as ABX3) and with 3.17 mol% extra PbCl2 (denoted as ABX3 + 3.17% excess PbCl2). The reference films were both annealed at 130 °C for 10 min. This way, we covered precursor solution formulars from ABX3 + excess AX to stoichiometric ABX3, and further to ABX3 + excess BX2. Scanning electron microscopy (SEM), X-ray diffraction (XRD), X-ray photoelectron spectroscopy (XPS) and photoluminescence (PL) were carried out to examine morphology, crystallinity, and stoichiometry of the films.  Plate-like phases are present on stoichiometric and 3.17% excess PbCl2 films (Figure 2 (g,h)).",
                        "Positions of these plate-like phases correspond to bright phases in Inlens SEM images (Figure S1 and Figure S2 (g,h)). According to previous studies, such bright phases often represent PbI2. [21][22][23][24] On the contrary, the plate-like phases are absent in all the films prepared with 5% excess FACl solution and annealed for 1 -40 min (Figure 2 (a-f)). However, it is noticeable that as the annealing time increases, the surface morphology of 5% excess FACl films changes. The 5% excess FACl 30 min film started to show fringes on perovskite grains (Figure 2 001), (002), and (012) planes of cubic phase perovskite. [25][26][27][28] The stoichiometric 10 min film and the 3.17% excess PbCl2 film both show diffraction peaks at 12.7°, which is classified as the (001) peak in cubic phase PbI2. [29][30][31] The PbI2 peak intensity in the stoichiometric 10 min film is less than that of the 3.17% excess PbCl2 10 min film, just as the flake amount in the stoichiometric 10 min film is less than that in the 3.17% excess PbCl2 film. In the meantime, the PbBr2 and PbCl2 characteristic XRD peaks are not observed. 29 Thus, we can safely deduce the plate-like phases in Figure 2 (g,h) are PbI2.   S3, where the peaks at 138.4 eV originates from Pb 2+ , and the peaks at 136.6 eV are associated with metallic Pb. 32 According to precedent studies, 11,33,34 the metallic Pb is detected due to the photolysis of PbX2 into Pb and X2 under X-ray. To note, under X-ray irradiation, ABX3 perovskite also decomposes into PbX2, which can further decompose to Pb. 33 Thus, it is reasonable that the halide/Pb ratio of perovskite surface is lower than 3. As we can see from Figure 3 (b), the 3.17% excess PbCl2 10 min film shows the lowest halide/Pb ratio of 1.89 among all the films, suggesting this film has a large amount of PbX2 at the surface. The stoichiometric 10 min film shows a halide/Pb ratio of 2.33, implying the surface of this film is a mixture of ABX3 perovskite and PbX2 and it has less PbX2 compared to that in the 3.17% excess PbCl2 10 min film. These observations well align with those in SEM and XRD shown in Figure 2 (g,h) and Figure 3 (a). We can observe a trend that as the annealing time of the 5% excess FACl films increases from 1 min to 40 min, the halide/Pb ratio decreases from the highest point  Apart from deducing surface stoichiometry through a combination of SEM, XRD and XPS, we also deduce the perovskite bulk stoichiometry from bandgap obtained from steady-state photoluminescence (SSPL). Figure 4 shows the bandgap of stoichiometric 10 min and 3.17% excess PbCl2 10 min perovskite films are 1.576 eV and 1.595 eV, respectively. The bandgap of 5% excess FACl films first decreases from 1.583 eV to 1.578 eV as the annealing time increases from 1 min to 10 min, then the bandgap stabilizes around 1.578 eV as the annealing time increases from 10 min to 40 min. This trend suggests that in the beginning of annealing, most Cl is still incorporated in the perovskite crystals, leading to a high bandgap. 35 As annealing time increases to 10 min, the amount of Cl in perovskites gradually reduces due to the evaporation of Cl-containing volatile species, leading the bandgap to decrease. Once the Cl amount stabilizes in the perovskite film, the bandgap of the film also stabilizes. We can deduce that once the annealing time exceeds 10 min the bulk stoichiometry likely remains unchanged.",
                        "Combining the SEM, XRD, XPS and PL results, we can conclude that during the first 10 min of annealing at 130 °C, the bulk stoichiometry of the 5% excess FACl film changes. When the annealing time exceeds 10 min, the bulk stoichiometry of perovskite films stays unchanged, while the surface of perovskite becomes more Pb-rich. Hence, we can further conclude it's possible to control the bulk and surface stoichiometry of perovskite films with volatile AX excess through simply controlling their annealing time."
                    ],
                    "subsections": []
                },
                {
                    "title": "Linking perovskite film stoichiometry with solar cell operational stability.",
                    "paragraphs": [
                        "To unveil the relation between perovskite stoichiometry and solar cell operational stability, we fabricated solar cells with the structure of glass/ITO/PTAA/perovskite/C60/BCP/Cu (Figure 5 (a)), where perovskite layers are the eight types of films investigated in the previous section. The initial PCEs obtained from J-V scans in Figure 5 (b) show that as the annealing time of 5% excess FACl perovskites increase from 1 min to 40 min, the average initial PCE first increases from 5.5 % (1 min) to 18.3% (30 min) and then drops to 17.8% (40 min). The average initial PCE of stoichiometric 10 min and 3.17% excess PbCl2 10 min perovskites are 15.6% and 18.4%, respectively. The rest parameters from J-V scans are presented in  To further prove the above link between perovskite surface stoichiometry and the solar cell operational stability, we performed controlled experiments by changing annealing temperature, annealing time, AX species, and AX amount, then tracking their PCE during MPPT. First, we kept the FACl 5% excess and annealed it at 150 °C instead of 130 °C for 10 min to accelerate the FACl evaporation during annealing. This way, the surface of 5% excess FACl 150 °C 10 min perovskite film will be more Pb-rich than the 5% excess FACl 130 °C 10 min film. As a result, the 150 °C 10 min film indeed shows declining PCE as indicated by the purple curve in Figure 6 (a). Then we drastically increased the amount of FACl excess from 5 % to 30% so that even at the end of a long time annealing the FACl is not able to fully escape the films, potentially creating AX-rich perovskite films. Indeed, after annealing at 130 °C for 80 min, the PSC with this perovskite shows increasing PCE during MPPT as indicated by the blue curve in Figure 6 (a).",
                        "To follow up, we then replaced FACl additive with less volatile FAI additive. As is also shown in Figure 6 (a), with a limited amount of 1.5% excess FAI, the device behaves like the denoted stochiometric device, for which the PCE degrades under MPPT tracking. Nevertheless, with the amount of excess FAI increasing to 2.5% and 5%, the devices start to show the opposite trend under MPPT tracking, i.e., PCE first significantly increases and then stabilizes with tracking time. Interestingly, due to the much less volatile nature of FAI than FACl, the annealing time plays a marginal role in the case of FAI additive. In Figure S5, nearly identical initial PCEs and MPPT tracking behavior have been observed for the PSCs made with 5% excess FAI but annealed at 130 °C for 20 min, 40 min, 60 min, respectively. Their PCEs all rise in the same fashion from below 2% to above 10% at the end of 20-minute MPPT. The above controlled experiments clearly prove that despite of low initial PCE, the AX-rich devices are more stable under MPPT.",
                        "Finally, we designed another experiment where the 5% excess FACl perovskite film was first annealed at 130 ° C for 60 min to realize a Pb-rich surface. After this, we applied surface treatment on such films by spin coating FAI solutions with different concentrations. Figure 6 (b) shows that the 5% excess FACl 130 °C 60 min PSC presents typical declining MPPT PCE.",
                        "However, as the FAI solution concentration of the surface treatment increases, the perovskite film shall turn from Pb-rich to less Pb-rich and eventually to AX-rich. 24 Correspondingly, Figure 6 (b) shows that the devices turn from having the declining MPPT PCE (pristine) to a more stable MPPT PCE (0.5 mg/ml) and then an increasing MPPT PCE (1.0 mg/ml). To conclude, with the experimental results presented in this section, we can find a clear link between the perovskite film stoichiometry and the solar cell operational stability. Perovskites with Pb-rich surfaces result in high initial PCE but declining PCE during MPPT, while AX-rich perovskites lead to low initial PCE but increasing MPPT. Therefore, to be able to deliver both high initial PCE and stable MPPT PCE, a careful screening of annealing condition including temperature and duration is needed when the volatile additive is present in the perovskite solution."
                    ],
                    "subsections": []
                },
                {
                    "title": "Verify the generality using PSCs with MACl additive",
                    "paragraphs": [
                        "MACl is another commonly used additive for high-efficiency PSCs. [15][16][17][18][19] In order to verify the generality of the above-observed link between stoichiometry and device performance, we have done another case study, where 30 mol% MACl is used as the volatile AX additive in the perovskite precursor solution. The obtained perovskite precursor films were annealed at 110 °C for 50 min, 60 min, 70 min and 80 min, respectively. Figure 7 (a) shows the top-view SEM image of the perovskite with MACl additive that was annealed for 60 min. Compared to the one with FACl additive, much larger grain size is realized with MACl additive, which could be attributed to higher amount of chlorine used. 17   The test is carried under simulated 1 sun illumination from a metal halide lamp with strong UV.",
                        "The cell temperature reaches 60 °C."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "CONCLUSION",
            "paragraphs": [
                "To conclude, our work reveals the stoichiometry of perovskite films that contain volatile AX additives can be readily controlled by changing their thermal annealing temperature and time.",
                "We then unraveled how such volatile additives can influence the perovskite film stoichiometry and how this correlate to the device performance and operational stability. It is discovered that the over annealed perovskite films become Pb-rich at the surface, leading to PSCs with high initial PCE but poor stability under MPPT condition. On the contrary, the under annealed films lead to PSCs with low initial PCEs, but the PCEs increase during MPPT. We verified the generality of this by studying perovskite precursors using either FACl or MACl as an additive,",
                "showing it is important to control the annealing conditions to simultaneously achieve the high efficiency and operational stability. With optimally annealed perovskite films, we demonstrate efficient and stable p-i-n PSCs that show the best PCE of 20.7% and remain 90% of the initial performance after a 200-hour MPPT at 60 °C under 1 sun illumination with high UV content.",
                "Therefore, this work provides a new guideline for the fabrication of high-efficiency and operational stable PSCs."
            ],
            "subsections": []
        }
    ]
}