{
    "id": "https://semopenalex.org/work/W2105170774",
    "authors": [
        "George Georgiou",
        "Hiram F. Gilbert",
        "Silvia A. Arredondo",
        "Laura Segatori"
    ],
    "title": "De Novo Design and Evolution of Artificial Disulfide Isomerase Enzymes Analogous to the Bacterial DsbC",
    "date": "2008-11-01",
    "abstract": "The Escherichia coli disulfide isomerase, DsbC is a V-shaped homodimer with each monomer comprising a dimerization region that forms part of a putative peptide-binding pocket and a thioredoxin catalytic domain. Disulfide isomerases from prokaryotes and eukaryotes exhibit little sequence homology but display very similar structural organization with two thioredoxin domains facing each other on top of the dimerization/peptide-binding region. To aid the understanding of the mechanistic significance of thioredoxin domain dimerization and of the peptide-binding cleft of DsbC, we constructed a series of protein chimeras comprising unrelated protein dimerization domains fused to thioredoxin superfamily enzymes. Chimeras consisting of the dimerization domain and the alpha-helical linker of the bacterial proline cis/trans isomerase FkpA and the periplasmic oxidase DsbA gave rise to enzymes that catalyzed the folding of multidisulfide substrate proteins in vivo with comparable efficiency to E. coli DsbC. In addition, expression of FkpA-DsbAs conferred modest resistance to CuCl2, a phenotype that depends on disulfide bond isomerization. Selection for resistance to elevated CuCl2 concentrations led to the isolation of FkpA-DsbA mutants containing a single amino acid substitution that changed the active site of the DsbA domain from CPHC into CPYC, increasing the similarity to the DsbC active site (CGYC). Unlike DsbC, which is resistant to oxidation by DsbB-DsbA and does not normally catalyze disulfide bond formation under physiological conditions, the FkpA-DsbA chimeras functioned both as oxidases and isomerases. The engineering of these efficient artificial isomerases delineates the key features of catalysis of disulfide bond isomerization and enhances our understanding of its evolution.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Strains and Plasmids-The bacterial strains and plasmids used in this study are listed in supplemental Table S1A, published as supplemental data. The fkpA-dsbA chimeric genes were constructed by overlap extension PCR using the primers listed in supplemental Table S1B, digested with XbaI and HindIII, and cloned into pBAD33 (16). All the chimeric genes contain a sequence that encodes a C-terminal hexahistidine tag. For protein purification purposes the gene fusions were digested with XbaI and HindIII, cloned into pET28(a), and transformed into E. coli BL21(DE3) cells.",
                "In Vivo Disulfide Bond Formation and Isomerization-E. coli PB351 (SF100 ⌬degP::kan, ⌬dsbC) and E. coli PB401 (SF100 ⌬dsbA) were co-transformed with pBAD33 derivatives encoding the fkpA-dsbA chimera genes, and with pTrcStIIvtPA, a pTrc99a derivative encoding the vtPA gene fused to the stII leader peptide (17). Cell growth and vtPA assays were performed as described earlier (13).",
                "To measure in vivo oxidase activity, overnight cultures were grown in LB medium with 50 g/ml of kanamycin and 25 g/ml of chloramphenicol, and subcultured 1:100 in low phosphate minimal medium containing MOPS salts, 0.2% glycerol, 0.2% glucose, 0.2% casein amino acids, and 0.5 g/ml thiamine, with 50 g/ml of kanamycin and 25 g/ml of chloramphenicol. When the cell density reached A 600 ϭ 0.4, arabinose was added to a final concentration of 0.2% w/v. After 2 h of growth, 30 l of cells were mixed with 20 l of a buffer containing 0.4 M iodoacetamide and lysis buffer (B-PER TM , Pierce) in a 1:2 ratio. The activity of alkaline phosphatase was determined as described previously (18). Phytase activities were also determined as described (4).",
                "CuCl 2 resistance was evaluated in E. coli MB706 (DHB4 ⌬dsbC, dsbA::kan). Cells were grown on Brain Heart Infusion (BHI) medium at 37 °C with 25 g/ml of chloramphenicol, and 50 g/ml of kanamycin. Cell counts were normalized by dilution, and plated on BHI medium with 0.2% arabinose, antibiotics as above, and CuCl 2 concentrations between 0 and 12 mM. MB706 cells do not grow in the presence of CuCl 2 at concentrations higher than 3 mM; isomerization, resulting from the overexpression of DsbC, restores growth to wt levels (10 -11 mM CuCl 2 ).",
                "Directed Evolution for Increased CuCl 2 Resistance-The fkpA-dsbA2 gene was subjected to random mutagenesis by error-prone PCR (19), and digested and ligated into pBAD33 as previously described. The ligation product was transformed into E. coli XL1-blue yielding a library size of 10 6 clones with a 0.6% error rate. The plasmids were purified and re-transformed into E. coli MB706. To screen for CuCl 2 resistance, cells were collected, diluted, and plated on agar plates with BHI medium, 25 g/ml of chloramphenicol, 50 g/ml of kanamycin, and containing 11 mM CuCl 2 . After ϳ20 h, colonies were observed; 32 of these colonies were picked randomly and the fkpA-dsbA2 DNA was sequenced. In addition, the MB706 cells harboring the library were plated on BHI containing 10 mM CuCl 2 , result-ing colonies were grown overnight in LB medium, and screened for motility by making 1:50 dilutions in minimal medium (M9 salts, 0.1% casein amino acids, 2 mM MgSO 4 , 5 g/ml thiamine, 0.2% glycerol supplemented with 50 g/ml of kanamycin and 25 g/ml of chloramphenicol) and growing at 37 °C for an additional 6 h; plates containing the same medium with 0.3% agar and 0.2% arabinose were spotted with 3 l of the normalized cultures and incubated at 37 °C for 20 h. The presence of halos around the culture spots was indicative of motility as a result of in vivo oxidase activity.",
                "Expression, Purification, and Biochemical Assays-For the purification of the FkpA-DsbA chimera proteins, the appropriate genes were cloned behind the T7 promoter in pET28(a) at XbaI and HindIII sites, and transformed into E. coli BL21(DE3). Protein expression and purification were performed as previously described (13). All proteins used in this study were more than 95% pure as judged by Coomassie Blue-stained SDS-PAGE electrophoresis. The rate of insulin reduction, the renaturation of reduced, denatured RNase A, and the protection of citrate synthase from thermal inactivation were determined according to published procedures (13, 20 -22)."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS",
            "paragraphs": [
                "Initially, we examined whether simply forcing the dimerization of thioredoxin can give rise to a protein having disulfide isomerization activity. The E. coli thioredoxin with a PDI-like active site (CGHC), designated here as TrxA \"PDI-like,\" has a redox potential E 0 ϭ Ϫ235 mV (14,23), which is higher than that of the wt thioredoxin (E 0 ϭ Ϫ270 mV) (24). TrxA\"PDIlike\" becomes oxidized by DsbB and cannot catalyze disulfide bond reduction or isomerization in vivo (15). TrxA \"PDI-like\" was forced to dimerize by fusing it to the C terminus of the GCN4 coiled-coil dimerization domain (25). The in vivo disulfide isomerase activity of the dimerized TrxA \"PDI-like\" was evaluated by determining the yield of correctly folded vtPA, a truncated version of human tissue plasminogen activator consisting of the kringle 2 and protease domains, and containing a total of 9 disulfide bonds. The folding of vtPA, secreted into the periplasm using a bacterial signal peptide, is limited by disulfide isomerization and requires co-overexpression of DsbC (26). In cells expressing DsbC under the control of the arabinose promoter, and grown with 0.2% w/v arabinose, active vtPA accumulates at a 25-fold higher level relative to control cells (without plasmid). Periplasmic expression of dimerized TrxA \"PDI-like\" under identical conditions did not result in any increase in vtPA yield over the isogenic background cells (i.e. cells containing the empty vector). Gel filtration chromatography of the purified protein revealed that it was present exclusively as a dimer, as expected (data not shown). Next, to provide better spatial separation between the two active sites in the chimera, the ␣-helical linker that separates the catalytic thioredoxin domain from the dimerization domain in DsbC was inserted between the GCN4 leucine zipper and TrxA \"PDIlike\". Expression of the latter construct resulted in a modest, but statistically significant, increase in the yield of vtPA to a level about 20% of that afforded by DsbC (data not shown).",
                "The above results indicate that the fusion of a dimerization domain followed by an ␣-helical linker endows thioredoxin exported to the periplasm with a low but detectable level of disulfide isomerase activity. Natural disulfide isomerase enzymes in addition to having two catalytic domains also contain putative peptide binding sites that confer chaperone activity and may be involved in interactions with substrate proteins. Similar to the topology of DsbC, the cis/trans peptidyl-prolyl isomerase FkpA folds into a homodimer, with each monomer consisting of an N-terminal dimerization domain and a C-terminal catalytic domain, joined by a long ␣-helical linker. The two domains are structurally and functionally independent. FkpA exhibits chaperone activity, which, as in DsbC, is conferred by its dimerization domain, although its peptide-binding cleft is less hydrophobic (27). However, unlike DsbC, FkpA does not display disulfide isomerization activity; therefore, its overexpression results in background levels of correctly folded vtPA (supplemental Fig. S1).",
                "The dimerization domain and ␣-helical linker of FkpA were fused to TrxA \"PDI-like\" or to DsbA. DsbA, the periplasmic catalyst of oxidation, is also a thioredoxin superfamily enzyme, but shares little amino acid homology with the thioredoxin domain of DsbC (6% identity and 13% amino acid similarity). DsbA was selected because the redox potential of its catalytic cysteine pair (E 0 ϭ Ϫ120 mV) approximates that of DsbC (E 0 ϭ Ϫ130 mV). The N-terminal dimerization domain of FkpA (residues 1-114) including the long ␣-helical linker (amino acids 70 -114), which is the minimal protein domain exhibiting chaperone activity (27), was fused to either TrxA \"PDI-like\" or to DsbA. Previously, Segatori et al. (8) showed that deletions in the ␣-helical linker of DsbC, which alter the face to face alignment of the active site cysteines in the two domains, render the protein susceptible to oxidation by DsbB. To explore the effect of the fusion junction sequence, we constructed a series of chimeras in which the residue 114 of FkpA is fused to consecutive amino acids of the ␣-helical N-terminal region of the thioredoxin domain protein (Fig. 1B). Specifically, fusions were constructed to the 1st, 2nd, 3rd, or 4th amino acid of TrxA \"PDIlike\" or the 2nd, 3rd, 4th, or 5th residue of mature DsbA, generating, respectively, FkpA-TrxA1 to FkpA-TrxA4 and FkpA-DsbA2 to FkpA-DsbA5. Because the fusion junction is created by joining two ␣-helical segments, it is likely that the resulting chimeric region assumes helical secondary structure, Several of the chimeric proteins were purified to near homogeneity. Gel filtration FPLC revealed that the proteins elute as a single peak with identical retention times, which however were shorter relative to that of DsbC (supplemental Fig S2A). The fusions had an apparent molecular mass of around 100 kDa, which is higher than the predicted molecular mass for the dimers (67 kDa). Chemical cross-linking (28) further confirmed that the chimeras form dimers, consistent with the known ability of the FkpA-(1-114) domain to dimerize (27) (supplemental Fig. S2B).",
                "Following induction of protein expression with arabinose, all the FkpA chimeras accumulated to nearly identical levels in vivo, albeit at a slightly lower level than DsbC, as determined by Western blotting with a polyclonal antibody that recognizes the C-terminal hexahistidine tag present in all the fusions (representative data for the FkpA-DsbA fusions are shown in supplemental Fig. S3). While the FkpA-TrxA1-4 chimeras exhibited higher isomerase activity in the vtPA assay relative to TrxA \"PDI-like\" dimerized via a Leu zipper, they were nonetheless less efficient in the folding of vtPA relative to the FkpA-DsbA enzymes. Specifically the yield of active vtPA by the former proteins was between 35 and 50% of the level obtained in cells expressing DsbC. 5 In contrast, FkpA-DsbA2, FkpA-DsbA3, and FkpA-DsbA4 conferred yields of enzymatically active vtPA that were 80, 55, and 67% of the yields obtained by expressing DsbC under identical conditions (Fig. 2A). The ability of the chimeras to increase the yield of vtPA is also dependent on reduction by DsbD. In dsbD cells expressing either DsbC or the FkpA-DsbA chimeras, only a low yield of vtPA was obtained (data not shown). Importantly, expression of FkpA-DsbA enzymes resulted in maximal yields of phytase (AppA), a native E. coli enzyme whose folding in the periplasmic space is normally dependent on isomerization by DsbC (see Fig. 3C for representative results with FkpA-DsbA2). Thus, the FkpA-DsbA chimera can catalyze the rearrangement of protein disulfide bonds in both homologous and heterologous proteins in the E. coli periplasm.",
                "The folding of vtPA, in addition to requiring the overexpression of DsbC, is also dependent on the presence of DsbA. In E. coli strain SF100 dsbA, only background levels of active vtPA are observed. Multicopy expression of DsbC, failed to increase the yield of active vtPA, since DsbC cannot normally serve as a protein oxidant (Fig. 2A). However, the FkpA-DsbA chimeras allowed the folding of vtPA in a dsbA background, albeit with a lower efficiency relative to wt E. coli.",
                "These chimeras also catalyzed the formation of disulfide bonds in alkaline phosphatase (PhoA). The catalytically active form of PhoA is a homodimer with two intramolecular disulfide bonds per monomer. The formation of the disulfide bonds in PhoA is dependent on the action of the DsbA-DsbB electron transfer relay (29). Overexpression of the FkpA-DsbA proteins partially restored alkaline phosphatase activity in dsbA mutants (Fig. 2B); FkpA-DsbA3 exhibited the highest PhoA activity (70% of MC1000) while FkpA-DsbA5 gave the lowest activity corresponding to 30% of MC1000. These results indicate that the FkpA-DsbA enzymes simultaneously serve as catalysts for both disulfide bond formation and isomerization in the periplasmic space.",
                "Evolution of FkpA-DsbA Chimeras under Selective Pressure-We wondered whether selective pressure can be applied to isolate FkpA-DsbA mutants displaying enhanced disulfide isomerization activity. Because we do not have a reliable method to quantitatively measure the expression yield of multidisulfide proteins such as vtPA in high throughput, we instead took advantage of the finding that disulfide bond isomerization activity is required for growth of dsbA strains in media containing elevated concentrations of CuCl 2 (30). In the absence of DsbA, cysteine thiol oxidation is catalyzed by Cu 2ϩ ions, leading to aberrant disulfide bond formation that increase the need were transformed with pTrcStIIvtPA and pBAD derivatives encoding the respective FkpA-DsbA fusion proteins and grown in LB media. Protein synthesis was induced as described under \"Experimental Procedures,\" and the yield of active vtPA was determined 3 h after induction. Relative activities were obtained by dividing the ⌬A 405 of each strain (subtracted of the background consisting of a strain not expressing vtPA) by the ⌬A 405 of a strain expressing vtPA alone. B, PhoA activity in E. coli MC1000 dsbA (white bars) and MC1000 dsbB (black bars). The alkaline phosphatase activity in the parental isogenic strain MC1000 is shown by the gray bar.",
                "for isomerization by DsbC. Wt strain DHB4 forms normal colonies in media containing up to 10 mM CuCl 2 and smaller colonies in the presence of 11 mM CuCl 2 , whereas the dsbA dsbC mutant MB706 cannot grow with more than 3 mM CuCl 2 (Table 1). MB706 expressing the FkpA-DsbA enzymes formed normal colonies with 4 mM CuCl 2 and smaller colonies at 6 mM, conditions under which cells containing empty plasmid could not grow (Table 1). FkpA-DsbA2, which exhibited the highest isomerase activity in the expression of vtPA, allowed growth with up to 8 mM CuCl 2 . Error-prone PCR mutagenesis was used to introduce random mutations to the fkpA-dsbA2 gene giving rise to a library of 10 6 independent transformants in MB706. The library was plated in BHI medium containing 11 mM CuCl 2 . DNA was isolated from 32 colonies that grew and sequencing revealed 16 distinct clones (supplemental Fig. S4). Remarkably, 12/16 clones shared a point mutation (H145Y) that resulted in the substitution of the DsbA catalytic site histidine (CPHC), by a tyrosine (CPYC), the same amino acid found in the DsbC catalytic site (CGYC). One mutant, enzyme FkpA-DsbA2m7, which contained only the H145Y mutation, and FkpA-DsbA2m18, which had two additional mutations, D20G and D95N, were examined further. The overexpression of both mutant enzymes in the periplasm of MB706 gave rise to cells exhibiting copper resistance to a degree nearly identical to that of DsbC. In fact, FkpA-DsbA2m18-overexpressing strain exhibited larger colonies at 11 mM CuCl 2 (Table 1). However, the two mutant enzymes did not confer any further increase in the yield of vtPA or phytase (AppA), relative to the parental FkpA-DsbA2 protein (Fig. 3).",
                "One difference between FkpA-DsbA and the native disulfide isomerase DsbC is that the latter is resistant to oxidation by the DsbA-DsbB system in vivo. We wondered whether under selective pressure it would be possible to isolate FkpA-DsbA2 mutants that are as resistant to oxidation as DsbC. For this purpose, 180 mutant colonies that grew in 10 mM CuCl 2 BHI plates were picked at random and screened for inability to catalyze protein oxidation. The latter was evaluated using cell motility as readout. MB706 cells lack dsbA and are not motile because the oxidation of the essential flagellar component FlgI is impaired. As shown in Fig. 2B, FkpA-DsbA2 exhibits significant oxidase activity and therefore, as expected, MB706 cells expressing this enzyme are motile. Out of the 180 CuCl 2 -resistant colonies tested, several clones were found to be non-motile and then screened further for their ability to form active alkaline phosphatase. One clone, FkpA-DsbA2m33, which displayed no alkaline phosphatase activity, was found to contain four different mutations: M35T, A111V, C146S, and H154Y. Cys-146 is the C-terminal cysteine in the catalytic site (CPHC) of the DsbA domain of FkpA-DsbA2m33. DsbA lacking the C-terminal cysteine cannot function as a periplasmic oxidant since it becomes trapped in a mixed disulfide with DsbB and cannot be recycled to its oxidized active form (31,32). FkpA-DsbA2 containing only the mutation C146A exhibited the same phenotype as FkpA-DsbA2m33 (in terms of alkaline phosphatase activity, motility and active vtPA yield, supplemental Fig. S5). This allowed us to conclude that FkpA-DsbA2m33 is unable to restore motility or alkaline phosphatase activity because the substitution of Cys-146 impairs the oxidase activity.",
                "Biochemical Studies-FkpA-DsbA2-5, FkpA-DsbA2m7, FkpA-DsbA2m18, and DsbC as a control were purified by immobilized metal ion affinity chromatography (IMAC). CD spectroscopy analyses (supplemental Fig. S6) revealed that FkpA-DsbA2 had an ␣-helical content of 46%, which compares favorably with the calculated value of 42% deduced from the crystal structure of DsbA and of the FkpA dimerization domain. In addition, the CD spectrum of FkpA-DsbA2m18 was  NOVEMBER 14, 2008 • VOLUME 283 • NUMBER 46 identical to that of the parental protein, FkpA-DsbA2 (supplemental Fig. S6). The insulin reduction activity (20) of the FkpA-DsbA chimeras was only 7-10% of that of DsbC (Table 2). For comparison, DsbA exhibits about 10% of the activity of DsbC in this assay (13). All the chimeras, including FkpA-DsbA2m7 and FkpA-DsbA2m18 (data not shown), exhibited low disulfide isomerase activity in the refolding of reduced RNase A. Finally, chaperone activity was evaluated based on the protection of citrate synthase from thermal inactivation. The artificial disulfide isomerases exhibited robust chaperone activity, with inactivation half-times (t1 ⁄ 2 ) ranging from 64 to 121% of that displayed by DsbC and presumably conferred by the FkpA domain, (Table 2)."
            ],
            "subsections": []
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "A comparison of the bacterial disulfide isomerases DsbC/G and yeast PDI reveals a longer separation of the active sites in the bacterial enzymes (26,38, and 60 Å for yPDI, DsbC, and DsbG, respectively), a difference in the surface area of the hydrophobic cleft, and, finally, the presence of one or more ␣-helices within the bacterial thioredoxin motif catalytic domains (33). Unlike the bacterial enzymes, where the two catalytic sites are symmetric and catalytically identical, the a and aЈ domains of PDI are asymmetric and functionally distinct (6).",
                "In contrast to the disulfide isomerases, monomeric thioredoxin motif enzymes, such as the E. coli thioredoxin, glutaredoxin, DsbA, the a and aЈ domains of PDI, or the catalytic domain of DsbC exhibit either low or no disulfide isomerase activity (34 -36). How is it then that the thioredoxin catalytic domains are able to catalyze disulfide bond isomerization in the context of PDI or DsbC? Earlier we had shown that fusion to the N-terminal dimerization domain of DsbC converts DsbA into an efficient disulfide isomerase. The acquisition of disulfide isomerization activity in DsbA fused to DsbC (amino acids 1-59) could be a general consequence of: (i) the dimerization of thioredoxin domains, which is required for maintaining the protein in a reduced state, and could also be important for catalysis, by virtue of the high effective concentration of active site thiols, and/or (ii) the proximity of the catalytic domain to a putative peptide binding site.",
                "To circumvent the many difficulties of applying classical mutagenesis techniques, here we used a synthetic approach to delineate the key features that are required for catalysis of disulfide bond isomerization. We constructed and characterized, in some detail, fusion proteins in which either a thioredoxin mutant having the PDI active site or DsbA were fused to two different dimerization domains, namely either the ␣-helix-GCN4 leucine zipper, which merely serves as a dimerization device or the N-terminal of FkpA; the latter, also forms a peptide-binding cleft that is important for cis/trans proline isomerization in FkpA. The engineered disulfide isomerases displaying highest in vivo activity, FkpA-DsbAs, were constructed utilizing the dimerization and ␣-helical linker domains of FkpA and the thioredoxin catalytic domain of the cysteine oxidase DsbA. In a manner analogous to DsbC, the ability of the chimeric enzymes to catalyze disulfide bond isomerization was dependent on recycling by the membrane electron transfer enzyme DsbD. The amino acid at the fusion junction affected the in vivo isomerase activity as well as the sensitivity to oxidation by DsbB and the ability to serve as periplasmic protein oxidants. The most successful design, FkpA-DsbA2, restored the yield of active vtPA to 80% and of the native phytase AppA to 100% of the amount observed with DsbC expressed at the same level. FkpA-DsbA2 also conferred increased resistance to CuCl 2 to E. coli dsbA dsbC cells and mutants that allowed growth in the presence of high CuCl 2 concentrations were isolated.",
                "Collectively, these findings provide several important and unanticipated insights on the mechanism and evolution of disulfide isomerases. First, forcing the dimerization of thioredoxin domains gives rise to enzymes that catalyze the folding of multidisulfide proteins in vivo, an activity not displayed by monomeric thioredoxin. The introduction of an ␣-helical linker between the GCN4 and TrxA \"PDI-like\" domains is important for this activity. Specifically, expression of a fusion of TrxA \"PDI-like\" to the ␣-helical linker of DsbC and dimerization coiled-coil domain of GCN4 resulted in a vtPA yield 5-times higher than that of control cells, or 20% of the level   observed with DsbC. In contrast, exported thioredoxin without a dimerization domain is maintained in an oxidized form in the periplasm, and therefore does not support disulfide bond isomerization (15,37). Thus, the presence of two thioredoxin domains, properly spaced via ␣-helical linkers, seems to be a key prerequisite for the ability to catalyze disulfide bond isomerization.",
                "Second, fusing the thioredoxin catalytic domain to an ␣-helical linker and, in addition, to a suitable dimerization region, which folds into a DsbC-like V-shaped topology and presents an internal substrate binding surface (unrelated to that of DsbC), gave rise to fusion enzymes with improved in vivo activity. The catalytic activity of the FkpA chimeras was dependent on the identity of the thioredoxin domain, with FkpA-DsbA resulting in more efficient enzymes compared with FkpA-Trx-A\"PDI-like\" chimeras. A number of oxidoreductases have been observed to contain minor changes in this structural domain, such as different active site dipeptide sequence, small helical insertions, or fusion with different structural domains, which have been introduced during the evolution to fine-tune the functionality of different enzymes. The thioredoxin motif in the DsbA molecule contains a three helix insertion adjacent to the catalytic site. The helical insertion creates an exposed hydrophobic site that may play a role in peptide binding (33, 38 -40). The higher in vivo activity displayed by the FkpA-DsbA chimeras may either be due to subtle structural differences in the orientation of the respective catalytic domains or to the influence of the helical insertion in the thioredoxin fold of DsbA. In addition, the electrostatic potential of the FkpA and DsbC clefts are different, with the former being more negatively charged (27). It is thus possible that the hydrophobic surface formed by the helical insertion in DsbA serves to extend the cleft in the FkpA domain and assist in the binding of proteins requiring disulfide rearrangement. Accordingly we showed that FkpA-DsbA2 exhibits chaperone activity and therefore is able to bind protein substrates. Even though the FkpA-DsbA2 chimera could substitute for all the known in vivo functions of DsbC (folding of heterologous and native multidisulfide proteins, CuCl 2 resistance), in vitro it exhibited much lower activity in the refolding of reduced RNase A and in the reduction of insulin (Table 2). The lower in vitro activity of FkpA-DsbA2 in comparison to DsbC likely reflects differences in the substrate specificity of the two enzymes.",
                "Third, we show that under selective pressure FkpA-DsbA2 could be evolved to confer increased resistance of dsbA dsbC cells to CuCl 2 Earlier, Hiniker et al. (30) had shown that resistance to CuCl 2 requires disulfide bond isomerization in the periplasm. A single amino acid His 3 Tyr substitution in the CPHC active site of the DsbA domain of FkpA-DsbA2 conferred increased cellular fitness to CuCl 2 challenge. As a result the active site was changed to CPYC, which is identical to that of the second E. coli disulfide isomerase, DsbG. In addition the CPYC motif is found in certain other DsbC homologues (e.g. Pseudomonas aeruginosa) and also in the E. coli glutaredoxins 1 and 3 (41). It is noteworthy that the active site of DsbC also contains an aromatic amino acid next to the C-terminal Cys residue (DsbC active site: CGYC). The sequence of amino acids in the dipeptide between the two Cys in the active site plays a key role in determining the redox potential of the enzyme (42,43). While the dipeptide sequences in DsbA and DsbC are different, their redox potentials with glutathione are quite similar (E o,DsbA ϭ Ϫ120 mV, E o,DsbC ϭ Ϫ130 mV). The consensus mutation in the FkpA-DsbA2 that led to increased CuCl 2 resistance changed His-145 (corresponding to His-32 in DsbA) with Tyr. Huber-Wunderlich and Glockshuber (42) showed that the H32Y substitution in DsbA (CPYC) decreases its redox potential by 35 mV to E 0 ϭ Ϫ157 mV and leads to a thermodynamic stabilization of the oxidized state over the reduced state, which is opposite to wt DsbA. While changes in the thermodynamic properties of the DsbA domain may be responsible for its improved ability to confer CuCl 2 resistance, it is also possible that the H32Y mutation was selected for kinetic reasons, for example improved interaction with (and reduction by) DsbD. Regardless of the specific mechanism, it is noteworthy that under selective pressure the active site of the artificial enzyme seems to converge to the sequence found in the native disulfide isomerase, DsbC.",
                "Fourth, the FkpA-DsbA chimeras catalyze both isomerization, and protein oxidation, and could partially complement dsbA mutant strains in a DsbB-dependent fashion. Analysis of the data in Fig. 2 reveals that the oxidase activity and isomerase activity in a dsbA background are correlated and depend on the amino acid of the fusion junction between the ␣-helical linker from FkpA and DsbA. Similarly, deletions of one or more amino acids in the helical region of DsbC from various species disrupts the barrier that normally prevents its oxidation by DsbB, and allows it to catalyze the formation of disulfide bonds in addition to isomerization (8). An attempt to select for FkpA-DsbA variants that are protected from oxidation by DsbB/DsbA, and therefore more closely resemble DsbC, led only to the isolation of mutant proteins lacking the C-terminal catalytic cysteine. The absence of the C-terminal Cys in FkpA-DsbA2 eliminates oxidase activity but also reduces disulfide isomerization. Maintaining high isomerization activity and resistance to oxidation seems to be a complex trait that hinges both on the orientation of the catalytic sites (8) and other subtle features that prevent the interaction of the enzyme with DsbB.",
                "In summary, using a protein engineering approach, we have been able to assemble functional disulfide isomerases via the fusion of domains derived from proteins of unrelated function. We show that the dimerization of thioredoxin domains alone is not sufficient to grant isomerase activity. However, the insertion of a linker between a coiled-coil dimerization domain and the thioredoxin catalytic domain gave rise to proteins with basal disulfide isomerase activity. Substantially more active enzymes could be obtained by using a dimerization domain from FkpA, which contains a suitably located peptide cleft and displays an overall topological organization analogous to that of DsbC. Interestingly, even though the synthetic disulfide isomerase chimeras we report here bear no sequence similarity with DsbC, when placed under selective pressure for CuCl 2 resistance resulted in better fitness through mutations in the CXXC motif within the active site, indicating that an optimal active site is also critical for high catalytic activity.",
                "Our studies are consistent with the notion that vestigial disulfide isomerases could have readily originated by gene duplication of a thioredoxin catalytic domain that later acquired an appropriate substrate binding site, as well as structural features that prevented wasteful shuttling of electrons between the oxidation and the reduction pathways."
            ],
            "subsections": []
        }
    ]
}