{
    "id": "https://semopenalex.org/work/W2056809260",
    "authors": [
        "Johannes Czernin",
        "Harvey R. Herschman",
        "Caius G. Radu",
        "Jason T. Lee",
        "Dean O. Campbell",
        "Nagichettiar Satyamurthy",
        "A. Lavie",
        "Martin Auerbach",
        "Shahriar Yaghoubi",
        "Ying Su"
    ],
    "title": "Structure-guided Engineering of Human Thymidine Kinase 2 as a Positron Emission Tomography Reporter Gene for Enhanced Phosphorylation of Non-natural Thymidine Analog Reporter Probe",
    "date": "2012-01-01",
    "abstract": "Positron emission tomography (PET) reporter gene imaging can be used to non-invasively monitor cell-based therapies. Therapeutic cells engineered to express a PET reporter gene (PRG) specifically accumulate a PET reporter probe (PRP) and can be detected by PET imaging. Expanding the utility of this technology requires the development of new non-immunogenic PRGs. Here we describe a new PRG-PRP system that employs, as the PRG, a mutated form of human thymidine kinase 2 (TK2) and 2′-deoxy-2′-18F-5-methyl-1-β-l-arabinofuranosyluracil (l-18F-FMAU) as the PRP. We identified l-18F-FMAU as a candidate PRP and determined its biodistribution in mice and humans. Using structure-guided enzyme engineering, we generated a TK2 double mutant (TK2-N93D/L109F) that efficiently phosphorylates l-18F-FMAU. The N93D/L109F TK2 mutant has lower activity for the endogenous nucleosides thymidine and deoxycytidine than wild type TK2, and its ectopic expression in therapeutic cells is not expected to alter nucleotide metabolism. Imaging studies in mice indicate that the sensitivity of the new human TK2-N93D/L109F PRG is comparable with that of a widely used PRG based on the herpes simplex virus 1 thymidine kinase. These findings suggest that the TK2-N93D/L109F/l-18F-FMAU PRG-PRP system warrants further evaluation in preclinical and clinical applications of cell-based therapies.",
    "sections": [
        {
            "title": "Positron emission tomography (PET) reporter gene imaging can be used to non-invasively monitor cell-based therapies. Therapeutic cells engineered to express a PET reporter gene (PRG) specifically accumulate a PET reporter probe (PRP) and can be detected by PET imaging. Expanding the utility of this technology requires the development of new non-immunogenic",
            "paragraphs": [
                "PRGs. Here we describe a new PRG-PRP system that employs, as the PRG, a mutated form of human thymidine kinase 2 (TK2) and 2-deoxy-2-18 F-5-methyl-1-␤-L-arabinofuranosyluracil (L-18 F-FMAU) as the PRP. We identified L- 18 F-FMAU as a candidate PRP and determined its biodistribution in mice and humans. Using structure-guided enzyme engineering, we generated a TK2 double mutant (TK2-N93D/L109F) that efficiently phosphorylates L-18 F-FMAU. The N93D/L109F TK2 mutant has lower activity for the endogenous nucleosides thymidine and deoxycytidine than wild type TK2, and its ectopic expres-sion in therapeutic cells is not expected to alter nucleotide metabolism. Imaging studies in mice indicate that the sensitivity of the new human TK2-N93D/L109F PRG is comparable with that of a widely used PRG based on the herpes simplex virus 1 thymidine kinase. These findings suggest that the TK2-N93D/ L109F/L-18 F-FMAU PRG-PRP system warrants further evaluation in preclinical and clinical applications of cell-based therapies.",
                "The inability to routinely monitor the tissue pharmacokinetics of therapeutic genes and cells and correlate this information with therapeutic outcomes represents a significant roadblock in the clinical adoption of these emerging therapies. Most cell/ gene therapy trials use invasive biopsy techniques to localize therapeutic genes or therapeutic cells at target sites. However, invasive techniques are prone to sampling errors and carry risks for the patients. There is an unmet need for techniques to monitor the whole-body tissue distribution of therapeutic cells and therapeutic genes, to quantify therapeutic cells, and to measure therapeutic gene expression at all locations non-invasively and sequentially after treatment. This unmet need can be addressed by PET 3 reporter gene (PRG) imaging (1). A PRG encodes a protein that mediates the specific accumulation of a PET reporter probe (PRP) labeled with a positron-emitting isotope (2). Such non-invasive PET measurements may predict and/or evaluate treatment efficacy and the risk of side effects; they can provide information that complements data obtained using invasive techniques, such as serial biopsies (2). PRGs developed to date encode proteins with various activities, including enzymes, transporters, and receptors (for review, see Ref. 3). In theory, enzyme-encoding PRGs should have the highest sensitivity among different classes of PRGs as a result of signal amplification by the catalytic turnover of the enzymatic reaction that traps the probe. The most commonly used PRGs are based on herpes simplex virus type 1 thymidine kinase (HSV1-tk) (4) and its optimized mutant, sr39tk (5). Both wild type (WT) HSV1-tk and sr39tk have been used to study the kinetics of therapeutic cells in preclinical settings (6 -9). Several PRPs can be used to image cells engineered to express HSV1-tk-based PRGs: 9-[4-18 F-3-(hydroxymethyl)butyl]guanine ( 18 F-FHBG) (10 -12), 2Ј-deoxy-2Ј-18 F-5-ethyl-1-␤-D-arabinofuranosyluracil ( 18 F-FEAU) (13)(14)(15), and 2Ј-deoxy-2Ј-18 F-5-iodo-1-␤-D-arabinofuranosyluracil ( 18 F-FIAU) (15). To date, HSV1-tk is the only PRG that has been used to image therapeutic cells in patients (10).",
                "The main disadvantage of HSV1-tk as a PRG is its immunogenicity, which can lead to immune-mediated elimination of therapeutic cells. This phenomenon has been documented in clinical trials (16,17). The immunogenicity problem may be solved by replacing the viral kinase with a human orthologue (18). Two potentially non-immunogenic candidate PRGs based on human nucleoside kinases have been developed; that is, a double mutant of deoxycytidine kinase (dCK) (19) and a truncated form of mitochondrial thymidine kinase 2 (TK2) (20). These PRGs phosphorylate and trap the PRP 18 F-FEAU. The sensitivity of the dCK-double mutant/ 18 F-FEAU PRG-PRP system was comparable with that of HSV1-tk/ 18 F-FEAU, whereas TK2/ 18 F-FEAU had lower sensitivity. In non-human primates 18 F-FEAU has a favorable biodistribution as a candidate PRP, with tracer accumulation in the liver, small intestine, kidneys, and urinary bladder (21) but not in other organs and tissues. Human biodistribution data for this candidate PRP are not available.",
                "The utility of a PRG-PRP system is dependent on its sensitivity (the ability to detect few therapeutic cells at various anatomical locations) and specificity (the probe should accumulate only in cells engineered to express the PRG). Another equally important parameter is the requirement that a PRG should be biologically inert. In other words its ectopic expression in therapeutic cells should not alter the metabolism or normal function of these cells. This requirement is especially important in the case of nucleoside kinase PRGs. Ectopic expression of a nucleoside kinase could perturb the normal regulation of nucleotide metabolism through excess phosphorylation of endogenous nucleosides. Such metabolic alterations can lead to imbalanced nucleotide pools and increased risk of genotoxicity (22)(23)(24)(25). In this context the dCK-double mutant has significantly higher activity than WT dCK toward endogenous nucleosides such as deoxycytidine and thymidine (26). Truncated TK2 also retains normal activity with natural substrates. Whether these new PRGs fulfill the critical requirement of being biologically inert remains to be determined.",
                "Here we describe the development of a new PRG-PRP system that meets the specifications mentioned above. We determined the biodistribution of L-18 F-FMAU, the candidate PRP, in mice and humans. We used enzyme engineering to develop a mutant PRG enzyme that is orthogonal to the wild type enzyme regarding its ability to phosphorylate endogenous nucleosides. The resulting PRG-PRP system, TK2-N93D/L109F as PRG and L- 18 F-FMAU as PRP, should find utility in various preclinical and clinical therapeutic cell tracking applications. The approach used to develop this system should be generalizable to the identification and evaluation of other pairs of nucleoside analogs and nucleoside kinases for PET reporter gene imaging applications."
            ],
            "subsections": []
        },
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Radiochemical Synthesis of 18 F-Labeled PET Probes-18 F-FHBG was synthesized as previously described (12). The radiochemical synthesis of L-18 F-FMAU is described in the supplemental material.",
                "Molecular Modeling of Human TK2-We generated a homology model of TK2 using the SWISS-MODEL server (27). The solved structures of human dCK (35% identity, 50% homology to TK2) in both its closed (PDB ID 1P5Z) and open conformation (PDB ID 3QEO) (28,29) served as templates.",
                "Generation of TK2 Mutants-We used the ⌬50N truncation variant of TK2, and we are referring to this truncated form (which lacks the mitochondrial sorting signal) as the WT enzyme. Numbering of residues is based on the full-length sequence of human TK2 (Uniprot ID O00142). Cloning of human TK2 has been described previously (30). Mutants were produced on the WT TK2 sequence that was present in both the pMSCV vector for retroviral transduction and a modified pET14b expression vector for production of recombinant protein.",
                "Expression and Purification of Recombinant TK2 Proteins-Expression and purification of TK2 have been described previously (30). In short, Escherichia coli BL21 (DE3) C41 harboring the modified pET14b vector (to include a SUMO tag between the hexahistidine sequence and TK2) were grown at 37 °C until an optical density of ϳ0.8 was reached. At that point the temperature was reduced to 18 °C; the culture was induced with 0.5 mM isopropyl ␤-D-1-thiogalactopyranoside and left to shake overnight. Cells were harvested by centrifugation, washed, and stored at Ϫ80 °C until use. Purification involved two steps. The first step used a metal affinity column (HisTRAP HP column, GE Healthcare); after elution of the His-SUMO-TK2 fusion protein, the SUMO protease was added. The cleaved protein was reapplied onto the nickel column to separate TK2 from the His-SUMO tag. The second step involved a gel filtration column (S200, GE Healthcare) equilibrated with 25 mM Tris, pH 7.5, 200 mM NaCl, and 3 mM DTT. Pure TK2 was pooled, concentrated to ϳ10 mg/ml, separated into aliquots, flash-frozen in liquid nitrogen, and stored at Ϫ80 °C until use.",
                "Kinetic Analyses of TK2-based Candidate PRGs-We used an NADH-dependent enzyme coupled assay (31). Using a Cary UV spectrophotometer, measurements were made in triplicate at 37 °C in a buffer containing 100 mM Tris, pH 7.5, 100 mM KCl, 5 mM MgCl 2 , and 1 mM ATP. For data in which k obs is given, a single nucleoside concentration of 200 M was used. For data in which both K m and k cat are given, the nucleoside concentration was varied between 15 and 500 M. TK2 concentration in the cuvette was 400 nM. Data were fit to the Michaelis-Menten equation using SigmaPlot. Of note, in some previous reports, negative cooperativity was observed with thymidine but not with deoxycytidine (32,33). When we fit our data for WT TK2 using the Hill equation, we also see the same magnitude of negative cooperativity as reported by others (n ϭ ϳ0.7) with thymidine and the analogs tested. However, the quality of the fit of the data is only marginally improved compared with that using the simple Michaelis-Menten equation. When the data of the TK2 mutants are fit using the Hill equation, a more complicated behavior is observed, with some conditions having a Hill coefficient below 1, some above 1, and some nearly one. Here again, the quality of the fit is not dramatically improved by adding the extra parameter of the Hill coefficient. Therefore, we present all of the kinetic data using the Michaelis-Menten equation without the Hill coefficient.",
                "Cell Lines-The L1210 cell line (34) was a gift from Charles Dumontet (Université Claude Bernard Lyon I, Lyon, France). Cells were cultured at 5% v/v CO 2 and 37 °C in RPMI supplemented with 5% v/v FCS. Murine stem cell virus (pMSCV)based helper-free retroviruses encoding the TK2 mutants (or sr39tk), an internal ribosomal entry site, and the yellow fluorescent protein (YFP) were produced by transient co-transfection of the amphotrophic retrovirus packaging cell line Phoenix (American Type Culture Collection, SD 3443) (35). L1210 cells underwent spinfection with the pMSCV-TK2 mutants-internal ribosomal entry site-YFP retrovirus with 2 g/ml Polybrene (1000 ϫ g, 120 min, 37 °C). L1210 cells expressing various PRGs, (L1210-PRG) were FACS-sorted to ensure that each population had equivalent levels of PRG expression.",
                "Probe Uptake Assays Using Transduced L1210 Cell Lines-L1210 cells transduced with the indicated PET reporter genes (L1210-PRG) were seeded at a density of 500,000 cells/well in 24-well plates. 5 Ci of L-18 F-FMAU were added to the L1210- PRG cells simultaneously with the indicated amounts of D-thy- midine (D-dT) at a final volume of 1 ml/well. After 1 h at 37 °C, cells were harvested and washed four times with ice-cold PBS. Radioactivity was measured using a gamma counter.",
                "MicroPET/CT Imaging Studies in Mice-Animal studies were approved by the UCLA Animal Research Committee and were carried out according to the guidelines of the Department of Laboratory Animal Medicine at UCLA. C57/BL6 mice were injected with the indicated probe and underwent micro-PET/CT analyses at 1-and 3-h post probe injection (Inveon, Siemens Medical Solutions USA Inc.; microCAT; Imtek Inc.). For tumor imaging studies, SCID mice were injected subcutaneously on day Ϫ7 in the right and left flanks with 1 ϫ 10 6 L1210-PRG-expressing cells in 50% v/v phosphate-buffered saline and 50% v/v Matrigel TM (BD Biosciences). For imaging experiments, mice were kept warm and under gas anesthesia (2% v/v isoflurane) and were injected intravenously with 200 Ci of 18 F-labeled probes. A 3-h interval was allowed between probe administration and microPET/CT scanning. Static microPET images were acquired for 600 s. Image data were evaluated in three-dimensional histograms and reconstructed with a zoom factor of 2.1 using three-dimensional ordered set expectation maximization (OSEM) with 2 iterations followed by MAP (maximum a posteriori) reconstruction with 18 itera-tions (beta ϭ 0.1). Images were analyzed using OsiriX Imaging Software Version 3.8.",
                "Human PET/CT Studies-All studies involving human volunteers were approved by the UCLA Medical Internal Review Board. L-18 F-FMAU was approved by the UCLA Radioactive Drug Research Committee. L-18 F-FHBG has an FDA investigational new drug approval (IND #61,880) and was also approved by the UCLA Radioactive Drug Research Committee. A 53-year-old healthy male and a 44-year-old healthy female volunteer were recruited for the L- 18 F-FMAU biodistribution study. Each volunteer received a bolus intravenous injection of ϳ56 MBq (1.5 mCi) sterile L-18 F-FMAU and had four consecutive whole-body (starting from just above the head to above the knees, 6 bed positions, 5-min scan at each bed position) PET scans (Biograph 64, Siemens), with the first scan starting shortly after intravenous injection of L-18 F-FMAU. A low dose CT scan was also obtained for attenuation correction. Volunteers urinated after all scans had been performed. The region of interest analysis was performed to measure mean standard uptake values of L-18 F-FMAU in major organs/tissues. To illustrate the biodistribution of 18 F-FHBG, we used an unpublished scan from a previous study (10).",
                "Statistical Analysis-Data are presented as the means Ϯ S.E. All p values are two-tailed, and p values of Ͻ0.05 are considered to be statistically significant. Graphs were generated and analyzed using the Prism 5 software (GraphPad). 18 F-FMAU and 18 F-FHBG in Mice-Nucleoside analogs are being increasingly used as PET probes for assaying nucleotide metabolism, cell proliferation, and mitochondrial function (36 -40). Nucleosides can adopt one of two enantiomeric configurations. Naturally occurring nucleosides are in the D configuration (41). Recently there has been increasing interest in using nucleoside analogs with the non-natural L configuration as PET probes to image the activity of endogenous nucleoside kinases (42)(43)(44)(45). To date, L nucleosides have not been evaluated as PRPs. To start determining the potential value of L nucleosides as PRPs, we focused on L-18 F-FMAU, the non-natural counterpart of D-18 F-FMAU, one of the pyrimidine analogs that has been previously evaluated as a candidate PRP for the HSV1-tk PRG (46)."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Comparison of Biodistribution of L-",
                    "paragraphs": [
                        "We compared the biodistribution of L-18 F-FMAU in mice with that of 18 F-FHBG, a well characterized and frequently used PRP (12,47,48). To achieve optimal signal to noise ratios, PRPs should not accumulate in cells and tissues that do not express the corresponding PRG. For instance, the accumulation of the candidate PRP should be minimal or undetectable in all tissues, except in those involved in probe clearance from the body. C57/ BL6 mice were scanned 3 h after administration of either L-18 F-FMAU or 18 F-FHBG (Fig. 1A). Three-dimensional reconstructions of the whole body microPET/CT images are shown in Fig. 1B. Quantification of the signals is presented in supplemental Table 1. Both L-18 F-FMAU and 18 F-FHBG had very low retention in the thoracic cavity. At the 3-h time point neither probe showed any accumulation in the liver. Accumulation in the gallbladder was 4 times higher for 18 F-FHBG (7.45 Ϯ 5.31% injected dose/g) than for L-18 F-FMAU (1.68 Ϯ 0.46% injected dose/g). Retention in the abdominal cavity was three times higher for 18 F-FHBG than for L-18 F-FMAU. This was likely due to higher biliary excretion of 18 F-FHBG. Elevated 18 F-FHBG accumulation was detected throughout the GI tract. In contrast, in mice injected with L-18 F-FMAU signals were only detected in the lower GI tract. Thus, the biodistribution of L- 18 F-FMAU in mice was at least comparable with, if not better than that of 18 F-FHBG."
                    ],
                    "subsections": []
                },
                {
                    "title": "Development of New PRG to Be Used in Conjunction with",
                    "paragraphs": [
                        "L-18 F-FMAU Candidate PRP-L-FMAU has been shown to be a substrate for human TK2, a nucleoside kinase that due to its lack of enantiomeric specificity can phosphorylate both D and L nucleosides (49). Ideally, modifications to the TK2 sequence should achieve two objectives; (i) increase sensitivity by reducing the negative feedback regulation of the enzyme and by increasing the phosphorylation rate of the L-FMAU PRP; (ii) reduce the activity of the PRG kinase for the endogenous substrates thymidine and deoxycytidine (to avoid competition between L-FMAU and endogenous nucleosides and potentially genotoxic perturbations of endogenous nucleotide pools).",
                        "The enzymatic activity of TK2 is regulated by thymidine triphosphate (dTTP) through negative feedback inhibition (50). dTTP is produced by de novo synthesis and through the salvage of thymidine (via the cytosolic nucleoside kinase TK1). dTTP levels fluctuate throughout the cell cycle and are highest during the S phase, when they increase by as much as 2.5-20fold compared with the G 1 phase (51,52). It is possible that fluctuations in dTTP levels during the cell cycle will reduce sensitivity and result in difficult to interpret changes in PET signals.",
                        "To reduce the susceptibility of TK2 to dTTP-mediated feedback inhibition, we took advantage of the 40% sequence identity between human TK2 and Drosophila melanogaster deoxyribonucleoside kinase (Dm-DNK) (53) and of the identification of a point mutation (N64D) in Dm-DNK that has been shown to reduce the effect of dTTP feedback inhibition (54). The residue in TK2 corresponding to Asn-64 in D. melanogaster deoxyribonucleoside kinase is Asn-93; the corresponding mutation in TK2 is N93D. To predict the effects of the N93D mutation on the structure of TK2, we used molecular modeling. We took advantage of the fact that dCK belongs to the same family of nucleoside kinases as TK2. The sequence identity and homology between dCK and TK2 are 35 and 50%, respectively. Based on our previous work with dCK (28,29), we obtained a homology model of TK2 (Fig. 2A). We hypothesized that, similar to dCK, TK2 will also adopt an open or a closed conformation. The enzyme is expected to be active in the closed conformation and inactive in the open conformation. In our model, when TK2 is in the closed conformation, Asn-93 is involved in hydrogen bonding with the glutamine at position 200 (E200, Fig. 2A). When the enzyme is in the open conformation, the residues are too far apart to interact. Thus, the N93D mutation would be expected to disfavor the closed conformation due to disruption of the interaction between Asn-93 and Glu-200 (Fig. 2A). dTTP should be able to exert its negative feedback inhibition on TK2 only if the enzyme is in the closed conformation. Because the N93D mutation favors the open conformation of the enzyme, we predicted there would be a reduced probability for dTTP to bind and exert its inhibitory effect.",
                        "To test this hypothesis we performed kinase assays using L-FMAU and recombinant WT TK2 and TK2-N93D in the presence of varying amounts of dTTP (Fig. 2B). WT TK2 activity decreased by 20% in the presence of 10 M dTTP. In contrast, the activity of the N93D mutant decreased by only 4%. When the dTTP concentration was increased to 100 M, the activity of WT TK2 decreased by 55%, whereas that of TK2-N93D decreased by less than 5%.",
                        "We then used cell-based uptake assays to determine whether the decreased susceptibility to feedback inhibition conferred by the N93D mutation increases L- 18 F-FMAU uptake. As shown in Fig. 2C, we observed a 1.5-fold increase in L-18 F-FMAU uptake by the N93D TK2 expressing L1210 cells relative to cells expressing similar levels of WT TK2.",
                        "To confirm that the increase in signal can also be detected in vivo, we used mice implanted with L1210 cells transduced with the WT TK2 and mutant TK2-N93D PRGs (Fig. 2D). In vivo, L- 18 F-FMAU uptake by TK2-N93D PRG-expressing cells was nearly double of that observed with the WT TK2-expressing cells (Figs. 2, D andE). Thus, by engineering a TK2 mutant that is less sensitive to feedback inhibition, we were able to improve the sensitivity of this candidate PRG for L-18 F-FMAU.",
                        "Further Improvements of Selectivity and Affinity of TK2-derived PRG for L-18 F-FMAU-For enzymatic PRGs, the higher the catalytic turnover (k cat ) of the enzyme, the more the PRP will accumulate per unit time, leading to a higher PET signal. We determined the k cat of mutated TK2 PRG for L analogs compared with the endogenous substrate, D-dT. Relative to WT TK2, the N93D mutation reduced the k cat of the enzyme  1. B, bladder; GB, gallbladder. %ID/g, % injected dose/g. toward D-dT, L-dT, and L-FMAU (Table 1). However, the activity toward D-dT decreased by 77%, whereas that for L-dT and L-FMAU decreased only 48 and 32%, respectively. The k cat (L-FMAU)/k cat (D-dT) ratio for N93D nearly triples when compared with wild type. k cat /K m gives a measure of the substrate preference of an enzyme. Compared with WT TK2, the k cat /K m of N93D for L-FMAU increased by 77%, whereas the k cat /K m for D-dT decreased by 60%. Thus, the N93D mutation also achieved the goal of increasing the preference of the enzyme for L-FMAU over the natural substrate.",
                        "To identify additional mutations that may further improve the selectivity of the TK2 PRG for L analogs, high resolution structures of dCK in complex with L and D substrates (55) were used to generate a homology model of TK2 with bound L-dT and D-dT (Fig. 3A). We then used this model to identify residues that, when mutated, would result in an enzyme with increased affinity for L-dT and decreased affinity for D-dT. This approach led to the identification of residue Leu-109 (Fig. 3A). According to our homology model, this residue interacts with the pyrimidine base. We surmised that if Leu-109 were mutated to an amino acid with a bulkier side chain (e.g. phenylalanine), this would induce a steric clash with D nucleosides but less so with L nucleosides. In turn, this would lead to preferential binding of L versus D nucleosides. Contrary to our expectations, the L109F mutation led to a decrease in the K m for both the D and L forms of dT (Table 1). Notably, the L109F mutation made the enzyme faster at phosphorylating all of the substrates tested, with a bigger effect on D-dT. Thus, for WT TK2, the k cat (L-FMAU)/ k cat (D-dT) ratio is 3.7, whereas for TK2-L109F this is 2.4 (Table 1). Compared with WT TK2, the k cat /K m of L109F for L-FMAU increased 2.4 times, whereas the k cat /K m for D-dT increased 6.7 times. Thus, contrary to the prediction, the L109F mutation increased the preference of the enzyme for D-dT compared with L-FMAU. This demonstrates that although a homology model can be sufficient to identify \"hot spots\" for mutagenesis (in this case, position 109), such a model may lack accuracy that can only be attained by an experimentally derived model. Nevertheless, although the L109F did not provide the desired increase in selectivity toward L nucleosides, it is important to note that the L109F mutation did increase the overall speed of the enzyme for all tested substrates.",
                        "Based on these observations, we generated TK2-N93D/ L109F with the expectation that this double mutant will combine the enzymatic properties of the two single mutants. As shown in Table 1, this was indeed the case. Compared with TK2, the N93D/L109F double mutant had decreased k cat with D-dT (down 49%) but increased k cat with L-dT (up 54%) and L-FMAU (up 100%). The k cat (L-FMAU)/k cat (D-dT) ratio for the TK2-N93D/L109F mutant is 14.9, 4-fold higher than that for TK2 and nearly 40% higher than that for TK2-N93D. Importantly, the TK2-N93D/L109F mutant still retained resistance to inhibition by dTTP (Fig. 3B). In the presence of 10 M dTTP, the kinase activity of recombinant TK2-N93D/L109F decreased by only 4%, whereas that of TK2-L109F decreased by 25%. At 100 M dTTP, TK2-N93D/L109F decreased by only 11%, whereasTK2-L109F decreased by 56%.",
                        "To determine the preference of the TK2 mutants for L-18 F-FMAU over D-dT, we performed uptake assays using L1210 cells in the presence or absence of 5 M D-dT (Fig. 3C). L-18 F- FMAU uptake by TK2-N93D/L109F-expressing L1210 cells in the absence of D-dT was Ͼ1.5 times higher than that of TK2-N93D cells and nearly 4 times higher than that of TK2-L109F cells. In the presence of 5 M D-dT, L-18 F-FMAU uptake by TK2-N93D/L109F cells decreased by 47%, whereas that of TK2-N93D cells decreased by 75%. Although the L-18 F-FMAU uptake of TK2-L109F in the presence of 5 M D-dT decreased by 37%, it was still only 31% of the corresponding uptake for TK2-N93D/L109F.",
                        "Next, we investigated whether TK2-N93D/L109F had low activity toward deoxycytidine, the other endogenous nucleoside that is phosphorylated by WT TK2. TK2-N93D/L109F has a k obs (dC) that is 62% that of TK2 (supplemental Table 2). These data indicate that TK2-N93D/L109F is orthogonal to wild type TK2, with increased activity toward the L-18 F-FMAU PRP and decreased activity toward the endogenous nucleosides thymidine and deoxycytidine.",
                        "In Vivo Comparison between TK2-N93D/L109F/L-18 F-FMAU and HSV1-sr39tk/ 18 F-FHBG PRG-PRP Systems-Mice implanted with L1210 cells expressing TK2-based PRGs were scanned by microPET/CT using L-18 F-FMAU (Fig. 4A). For comparison, mice implanted with L1210 cells expressing HSV1-sr39tk were scanned by microPET/CT using 18 F-FHBG (Fig. 4B). L-18 F-FMAU uptake by the TK2-N93D/L109F-expressing L1210 cells was 2.6-fold higher than that of TK2-N93D-expressing cells (Fig. 4C). 18 F-FHBG accumulation into sr39tk-expressing L1210 cells was comparable with that of L- 18 F-FMAU into L1210 cells expressing TK2-N93D/L109F (24.1 Ϯ 6.2 versus 19.9 Ϯ 1.5% injected dose/g; p ϭ 0.37). Taken together, these findings demonstrate that the sensitivity of the TK2 N93D/L109F PRG is higher than that of the TK2-N93D PRG and is not significantly different from that of the sr39tk/ 18 F-FHBG pair.",
                        "L- 18 F-FMAU Biodistribution in Humans-As the first step toward clinical translation of the newly developed PRG-PRP system, we determined the biodistribution of L-18 F-FMAU in humans. Fig. 5 illustrates the biodistribution of L-18 F-FMAU in two healthy volunteers and the biodistribution of 18 F-FHBG in a female volunteer 2 h post-administration of the PRPs. Mean standard uptake values of the probes in different tissues for 18 F-FHBG and L-18 F-FMAU are listed in supplemental Table 3. For both probes, relatively high signals were observed in liver, kidneys, gall bladder, bladder, and the GI tract. L-18 F-FMAU accumulation was also observed in the myocardium. At 2 h, more intense activity was observed in the liver after L-18 F-FMAU injections than after 18 F-FHBG administration. However, L-18 F-FMAU activity was lower than that of 18 F-FHBG within the GI tract region."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "To develop a PRG that can be used in conjunction with L-18 F-FMAU, a thymidine analog with the unnatural L-conformation, we removed the mitochondrial sorting sequence in human TK2. As shown previously, the truncated protein is expected to localize in the cytosol rather than in the mitochondria (20). Rational design was then used to improve the sensitivity and selectivity of the TK2 PRG. This led to the development of TK2-N93D/L109F, a double mutant TK2 kinase characterized by reduced affinity for the natural substrates D-thymidine and D-deoxycytidine and increased affinity for L-FMAU. Studies in mice indicated that the TK2-N93D/L109F PRG has comparable sensitivity to that of the widely used HSV1-sr39tk/ 18 F-FHBG system. We have also determined the biodistribution of L-FMAU in humans.",
                "Advantages of TK2-N93D/L109F/L- 18 F-FMAU PRG System-In mice, L-18 F-FMAU accumulates in the liver 1-h post injection (data not shown). The progression of the signal from the liver to the gallbladder and then to the GI indicates that L-18 F-FMAU is excreted via a hepato-biliary mechanism, similar to  that observed for 18 F-FHBG (12). However, the GI activity in L- 18 F-FMAU-injected mice is significantly less intense than that observed in mice injected with 18 F-FHBG. The intense signal in the GI of mice injected with 18 F-FHBG leads to spillover in other organs in the lower abdomen, limiting the utility of 18 F-FHBG for cell tracking applications in mice if these cells localize in the abdominal cavity.",
                "In addition to its human origin (which is expected to reduce immunogenicity compared with the viral PRGs), the TK2-N93D/L109F PRG also has the advantage of reduced activity toward the endogenous nucleosides, D-thymidine and D-deoxycytidine. PRGs are typically overexpressed in therapeutic cells. In this context, if the mutant PRG retains the ability to efficiently phosphorylate thymidine and/or deoxycytidine, then this may alter cellular metabolism due to overproduction of dTTP and/or dCTP. Such effects would be of particular concern in preclinical settings as serum levels of thymidine in mice and rats are 9 -15 times higher than those in humans (56). Any changes in nucleotide metabolism and dNTP pools in therapeutic cells may have genotoxic consequences, especially when prolonged persistence in vivo of these cells is anticipated (for example in the case of stem cells). In contrast to previously reported PRG such as dCK-double mutant, TK2-N93D/L109F is less likely to perturb cellular nucleotide metabolism and genomic integrity due to the decreased activity of the double mutant enzyme toward natural substrates.",
                "Disadvantages of New TK2-N93D/L109F/L-18 F-FMAU PRG System and Potential Improvements-The observed differences between the biodistribution of L-18 F-FMAU biodistribution in mice and humans underscore the importance of performing such comparative studies at an early stage of the development process for new PRG-PRP systems. In contrast to the excellent biodistribution in mice, in humans L- 18 F-FMAU accumulates in the myocardium and liver. Regarding L-18 F-FMAU accumu-  lation in the heart, the myocardium has a very high density of mitochondria (57). Moreover, the reported activity of the WT mitochondrial TK2 enzyme from human heart tissue is nearly 10 times higher than that of the enzyme from mouse heart tissue (58,59). This difference may explain the observed differences in L-18 F-FMAU myocardial accumulation between mice and humans. L-18 F-FMAU is taken up by the liver of both mice and humans. However, L-18 F-FMAU eventually clears the murine liver but is retained in the human liver. One reason for this difference may be that, similar to 18 F-FLT (3Ј-deoxy-3Ј-18 fluorothymidine) (60), L-18 F-FMAU may also undergo glucuronidation in human liver tissue. Glucuronidation of thymidine analogs is significantly less extensive in mice than in humans (61). Given the accumulation of L-18 F-FMAU in human liver and myocardium, this probe may not be useful for PET imaging of therapeutic cells at these sites. Myocardial accumulation may be reduced if L-18 F-FMAU is modified to decrease its phosphorylation by WT TK2. Replacing the 5-methyl group with a larger substituent such as ethyl or propyl may achieve this objective.",
                "Conclusion-New PET reporter gene/probe systems are needed to assist the development and clinical translation of cell-based therapies. In the current study we used a structureguided approach to develop a human nucleoside kinase-based PRG characterized by high specificity and selectivity for L-18 F-FMAU, a non-natural nucleoside analog PRP. The initial findings in mice and the observed biodistribution of L-18 F-FMAU in mice and humans warrant additional studies in both species and suggest potential strategies to further improve the sensitivity and specificity of the new human TK2-based PET reporter gene assay."
            ],
            "subsections": []
        }
    ]
}