{
    "id": "US20140227627",
    "authors": [
        "Steve S. He",
        "Curtis W. Frank"
    ],
    "title": "Anion Transport Membrane",
    "date": "2014-02-12 00:00:00",
    "abstract": "An anion transport membrane is provided enabling efficient anion exchange across the membrane, which could be used in applications like fuel cells, water electrolyzers, or water filtration systems. The structural membrane morphology is based on a hydrophobic polysulfone membrane backbone and co-grafted thereon hydrophilic poly(ethylene glycol) grafts and anion conducting quaternary ammonium species. This structure defines a bi-continuous morphology with locally phase-separated hydrophobic-hydrophilic domains, and a co-localization of the anion conducting quaternary ammonium species with respect to the hydrophilic poly(ethylene glycol) grafts enabling efficient and continuous ion transport channels for facilitating anion transport.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "This invention relates to anion transport membranes. In particular, an embodiment of the invention relates to amphiphilic ionomer membranes for alkaline fuel cells."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to anion transport membranes"
                    ],
                    "num_characters": 164,
                    "outline_medium": [
                        "relate to anion transport membranes"
                    ],
                    "outline_short": [
                        "introduce anion transport membranes"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Fuel cells are electrochemical devices designed to convert the high energy density of chemical bonds into electricity. The proton exchange membrane (PEM) fuel cell is the most prominent low-temperature fuel cell technology. These devices typically employ a polymer electrolyte membrane with pendant acidic groups as a method of transporting protons between the anode and cathode. However, the high proton concentration in PEM fuel cells creates a corrosive acidic environment in which only platinum group catalysts are stable, severely hindering commercial feasibility.",
                        "Anion exchange membrane (AEM) fuel cells, which transport hydroxide ions as opposed to protons, overcome this limitation by nature of an alkaline operating environment in which earth-abundant catalysts, such as nickel and manganese derivatives, exhibit suitable activity and stability. The AEM acts as a semipermeable separator, simultaneously transporting hydroxide anions, while preventing fuel crossover between the anode and the cathode. Slow hydroxide transport leads to significant ohmic losses, while poor fuel separation limits the cell's electrochemical potential. An ideal AEM would therefore be characterized by an efficient, percolating hydroxide transport network supported by a robust, dimensionally stable matrix.",
                        "While great strides have been made over the past decade, AEM fuel cells continue to perform unfavorably compared to PEM fuel cells. The lower performance can be partially attributed to the relatively low ionic conductivities of current AEMs, where the typical hydroxide conductivity of reported AEMs is often an order of magnitude lower than the proton conductivity of Nafion, the de facto standard commercial PEM. Thus, despite the cost advantage of AEM fuel cells, their lower performance has limited their commercial viability.",
                        "Given the high performance of PEMs, it is no surprise that their structure and chemistry have heavily influenced AEM design. As in PEMs, the general motif for synthesizing AEMs has been to attach pendant ionic salts along a robust hydrophobic polymer backbone. This approach typically manifests as aryl- or benzyl-substituted cations along an aromatic polymer chain. Whereas sulfonate is the pendant counter-anion of choice for PEMs, the pendant counter-cation in AEMs has been more varied with the aim of improving hydroxide conductivity and alkaline stability. Various approaches have involved membranes based on quaternary ammonium, imidazolium, guanidinium, phosphonium, and sulfonium cations, amongst others. Quaternary ammonium based on trimethylamine has been introduced on a variety of different polyaromatic backbones, including polysulfone, poly(phenylene oxide), and poly(etheretherketone). However, in these systems, the close proximity of the pendant cation to the rigid polymer backbone inhibits the formation of strongly segregated hydrophilic-hydrophobic domains. Consequently, these membranes are often characterized by poorly defined water-rich phases, leading to ion transport occurring in highly constricted and tortuous pathways.",
                        "The present invention addresses at least some of the current issues with exchange membranes and provides an anion transport membrane with a different morphology enabling efficient anion transport."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce fuel cells",
                        "describe proton exchange membrane fuel cells",
                        "motivate anion exchange membrane fuel cells",
                        "describe limitations of anion exchange membrane fuel cells",
                        "summarize approaches to synthesizing anion exchange membranes",
                        "motivate present invention"
                    ],
                    "num_characters": 3281,
                    "outline_medium": [
                        "introduce fuel cells",
                        "limitations of proton exchange membrane fuel cells",
                        "motivate anion exchange membrane fuel cells"
                    ],
                    "outline_short": [
                        "motivate limitations of proton exchange membrane fuel cells"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "Micromorphology strongly influences the ion transport characteristics of a polyelectrolyte membrane. In this invention, we control the morphology of the material in such a way that facilitates hydroxide transport. In particular, we incorporate chains of poly(ethylene glycol monomethylether) (PEG) onto a chloromethylated polysulfone backbone. The polysulfone-graft-poly(ethylene glycol) (PSf-g-PEG) copolymer is then further functionalized with anion conducting quaternary ammonium species. The idea behind this is that the hydrophilic poly(ethylene glycol) grafts will thermodynamically microphase separate from the hydrophobic polysulfone backbone. This action then leads to co-localization of the conductive quaternary ammonium species and the subsequent formation of ion transport domains within the system.",
                        "The chemistry of the process is detailed as follows. First, chloromethyl groups are grafted onto commercial polysulfone (Udel P3500 MB8) via a Friedels-Craft alkylation reaction. Poly(ethylene glycol) grafts are introduced to the chloromethylated polysulfone through a modified Williamson Ether Synthesis. Finally, the polysulfone-graft-poly(ethylene glycol) product is reacted with trimethylamine to yield the quaternary ammonium species. The weight percent and degree of grafting is dependent on several important factors:\n\n\n- - the degree of chloromethylation of the modified polysulfone;\n  - initial reagent concentrations and ratio;\n  - the molecular weight of the poly(ethylene glycol monomethylether)\n    reagent; and\n  - the reaction time.",
                        "Our experimental tests have found that lower mass percent incorporation of the poly(ethylene glycol) grafts seems to yield the best results. In particular, our highest performance has come from 12% by mass incorporation of 750 g/mol poly(ethylene glycol monomethylether), with further optimization still to be done.",
                        "We have also found that higher weight (i.e., above 40%) incorporation of the PEG component leads to a notable decrease in the in-plane conductivity. This result is based on the fact that (1) the increase in PEG content causes a concomitant decrease in the concentration of ion-conducting quaternary ammonium groups (and subsequently the ion exchange capacity), and (2) the high degree of grafting may lead to increased tortuosity in the ion transport pathway.",
                        "Embodiments of the invention can found use in a variety of applications, such as:\n\n\n- - 1. Use as an anion-transporting semipermeable membrane in alkaline\n    exchange membrane fuel cells.\n  - 2. In biological applications use as a low protein adsorption\n    material.\n  - 3. As a semipermeable ion exchange membrane in electrodialysis and\n    electrodeionization for water treatment and food processing.",
                        "One of the advantages of embodiments of the invention is that the majority of anion exchange polyelectrolyte membranes exhibit ionic low conductivities (˜1 to 20 mS/cm). For example, typical literature values for the room temperature, inplane conductivity of various quaternary ammonium functionalized polymers are as follows: polysulfone, 10-20 mS/cm; poly(epichlorhydrin-allyl glycidyl ether), 3 mS/cm; poly(ether sulfone) cardo, 7 mS/cm; poly(ethylene-co-terafluoroethylene) 10-15 mS/cm. In contrast, the polysulfone-graft-poly(ethylene glycol) structure that we have developed can sustain 30-40 mS/cm at the same conditions, and perhaps more on further development. This value is comparable to state-of-the-art commercial anion exchange membranes, such as the Tokuyama A901, which has reported hydroxide conductivities of around 38 mS/cm.",
                        "The high conductivity of our membranes translates to better fuel cell performance when compared to its peers, notably in the reduction of ohmic polarization losses and the subsequent increase in peak power density. Our fuel cell characterization tests have shown an increase in the peak power density from 120 mW/sq cm to 180 mW/sq cm on 12% weight incorporation of PEG 750—a 50% increase.",
                        "Accordingly and in summary, the present invention provides an anion transport membrane with a hydrophobic polysulfone membrane backbone and co-grafted thereon hydrophilic poly(ethylene glycol) grafts and anion conducting quaternary ammonium species. The hydrophilic poly(ethylene glycol) grafts each could have a molecular weight ranging from about 350 to 5000 Da. The membrane has a top surface and a bottom surface and is further characterized by:\n\n\n- - (i) a bi-continuous morphology with locally phase-separated\n    hydrophobic-hydrophilic domains, and\n  - (ii) a co-localization of the anion conducting quaternary ammonium\n    species with respect to the hydrophilic poly(ethylene glycol)\n    grafts, which define an ion transport channels for facilitating\n    anion transport. The ion transport channels are continuous transport\n    channels across the membrane and between the top and bottom surfaces\n    of the membrane. The ion transport channels have an average diameter\n    of about 3-30 nm defined by the average width of a hydrophilic or\n    water-rich region separating hydrophobic or water-poor regions.",
                        "The anion transport membrane could transport anions like hydroxide, chloride, carbonate, bromide, bicarbonate, or the like. The anion transport membrane could be part of an anion exchange membrane fuel cell, a water electrolyzer (e.g. a reverse fuel cell), a water filtration system, or the like."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce micromorphology influence on ion transport",
                        "describe incorporation of poly(ethylene glycol) grafts",
                        "detail chemistry of process",
                        "describe factors affecting weight percent and degree of grafting",
                        "summarize experimental results",
                        "describe effect of high weight percent incorporation of PEG",
                        "list potential applications",
                        "compare ionic conductivity to literature values",
                        "describe fuel cell performance",
                        "summarize invention"
                    ],
                    "num_characters": 5398,
                    "outline_medium": [
                        "introduce micromorphology influence on ion transport",
                        "describe PSf-g-PEG copolymer synthesis",
                        "explain quaternary ammonium species incorporation",
                        "summarize experimental results",
                        "application of embodiments"
                    ],
                    "outline_short": [
                        "describe morphology-controlled anion transport membrane",
                        "summarize application of anion transport membrane"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "In this invention, we show that flexible, hydrophilic poly(ethylene glycol) (PEG) grafts along a typical pendant counterion-hydrophobic polyaromatic backbone ionomer can induce local phase separation and enhanced hydroxide conductivity. As an exemplary embodiment, we grafted PEG moieties along a benzyltrimethylammonium-functionalized polysulfone (QA PSf) AEM (FIGS. 1A-B). The design rationale for promoting phase separation is two-fold. First, the hydrophilic PEG graft has a repulsive x interaction parameter with the hydrophobic polysulfone backbone. Moreover, PEG's electron-rich ether groups are able to complex with cationic quaternary ammonium salts and are expected to interact favorably with the pendant benzyltrimethylammonium species along the polysulfone backbone. The culmination of these effects leads to co-localization and concentration of the quaternary ammonium groups into efficient, water-rich hydroxide transport domains, resulting in increased ionic conductivity.",
                        "The PEGylated quaternary ammonium polysulfone will be referred to as QA PSf-g-PEGx, where x=350 or 750 and reflects the molecular weight of the grafted PEG chains. In both exemplary cases, the PEG weight composition was fixed at 12%. In general, x could range from about 350 Da to 5000 Da.",
                        "Synthesis of QA PSf-g-PEGx follows a three-step process (FIG. 2 and described in more detail in section Process infra). First, chloromethyl groups are introduced along polysulfone (Udel P3500 MB8, Solvay Chemicals) following the modified Blanc Chloromethylation procedure described by Avram et al. (J. Macromol. Sci. Part A 1997, 34, 1701-1714). These labile chloromethyl groups act as the active sites for both PEGylation and quaternization with trimethylamine. PEGylation is achieved via a modified Williamson Ether Synthesis detailed by Park et al. (Biomaterials 2006, 27, 856-65). Here, PEG alkoxide is first generated by reacting PEG mono methyl ether in the presence of sodium hydroxide in THF. The alkoxide solution is then reacted with the choromethylated polysulfone to form the PEG grafts. The PEGylated polysulfone is treated with trimethylamine in DMF to yield QA PSf-g-PEGx.",
                        "We performed small angle x-ray scattering (SAXS) to characterize the morphology of the PEGylated membranes. The SAXS profiles of QA PSf, QA PSf-g-PEG350 and QA PSf-g-PEG750 are shown in FIG. 3. The absence of notable scattering features for QA PSf suggests a homogeneous morphology. This result is consistent with our expectation that the short methyl linkage between the polysulfone backbone and the quaternary ammonium species inhibits strongly separated hydrophobic-hydrophilic domains. On the other hand, the introduction of PEG grafts gives rise to a broad scattering peak in the mid-q region (0.1 nm−1 to 1 nm−1), indicating the formation of distinct microphase separated regions. This PEGylation-induced phase-separation is attributed to the strong x repulsion between the flexible PEG graft and the PSf backbone.",
                        "The Teubner-Strey bi-continuous model was used to help elucidate the structure associated with the SAXS data. A regression fit of the structure factor proposed by this model to the QA PSf-g-PEGx scattering curves yielded excellent agreement (FIG. 4), suggesting that the QA PSf-g-PEGx membranes adopt a mesostructure characterized by a percolating ionomer network co-continuous with a hydrophobic matrix.",
                        "The two distinct length scales associated with this fit are listed in Table 1.",
                        "Here, d is a length scale representing a quasi-periodic spacing in the pair correlation function and can be physically interpreted as the average size of an ionomer domain; is a characteristic length for correlation fall-off. The scattering data can be rationalized by the chain architecture for both QA PSf-g-PEG350 and QA PSf-g-PEG750. The larger domain size for QA PSf-g-PEG750 is ascribed to the larger contour length of the higher molecular weight PEG750 (5.8 nm) compared to PEG350 (2.8 nm). Water swelling in these hydrophilic channels results in domain sizes exceeding the contour length of the PEG grafts. Interestingly, an Alexander-de Gennes scaling analysis of the domain sizes gives a scaling exponent of -0.689 with respect to the linear graft density. This scaling behavior is very close to the theoretical exponent of -0.7 of surface-tethered real chains in a good solvent, hinting at a brush-like conformation of the PEG side-chains.",
                        "The weaker domain correlation (as manifest in the lower) of QA PSf-g-PEG750 can be explained by its lower PEG grafting density, which is roughly half that of QA PSf-g-PEG350 given the same PEG weight composition in the two systems. The larger average spacing between the PEG chains coupled with their random placement leads to decreased grafting regularity and diminished long-range interactions. This effect is again evidenced in the polydispersity of the domain sizes, as reflected by the ξ/d ratio, where a lower value corresponds to higher polydispersity. The ratio for QA PSf-g-PEG750 (0.20) is one-third of that of QA PSf-g-PEG350 (0.31), suggesting a broader distribution of hydrophilic domain sizes. In summary, PEGylation of QA PSf gives rise to a broad scattering feature analogous to that of a bicontinuous microemulsion. This scattering is attributed to microphase separation of hydrophilic, PEG-rich ionomer channels from the hydrophobic polysulfone matrix. Given the same weight composition, QA PSf-g-PEG350 has narrower, but less disperse domain sizes compared to QA PSf-g-PEG750.",
                        "Visual comparison between PEGylated and un-PEGylated quaternary ammonium polysulfone films showed striking macroscopic differences. The highly turbid PSf-g-PEG350 film became clear upon introduction of the benzyltrimethylammonium groups, underscoring the interaction between the PEG and the pendant quaternary ammonium ions.",
                        "Hydroxide conductivity is a critical performance metric for AEMs. Four-point probe cyclic voltammetry was used to measure the in-plane conductivity. The hydroxide ions in AEMs are susceptible to conversion to carbonate and bicarbonate on exposure to atmospheric carbon dioxide. To limit CO2 exposure, we performed all conductivity measurements with the membrane in a closed cell in contact with a water-saturated nitrogen stream. The temperature dependence of the in-plane hydroxide conductivity is shown in FIG. 5. The hydroxide conductivity of un-PEGylated QA PSf was 20 mS/cm at room temperature (22 degrees Celsius), consistent with previously reported data. The introduction of 12 wt. % PEG350 and PEG750 grafts increased the room temperature conductivity to 25 mS/cm and 38 mS/cm, respectively. Concomitant with the higher hydroxide conductivity was a decrease in the apparent Arrhenius activation energy, from 17.5 kJ/mol (QA PSf) to 15 kJ/mol (QA PSf-g-PEG350) and 11.2 kJ/mol (QA PSf-g-PEG750). The enhanced performance with PEGylation supports the notion that a microphase-separated structure is beneficial to ion transport.",
                        "Membrane electrode assemblies (MEAs) using the PEGylated membranes were fabricated to assess prototypical fuel cell performance. Although the ultimate goal for AEMs would be to utilize non-precious metal catalysts, the MEA tests were carried out using commercially available Pt/C and PtIr/C at the anode and cathode, respectively, to enhance reproducibility and offer literature comparability. Fuel cell performance, as characterized by the polarization and power density curves (FIG. 6), mirrors the enhanced conductivity of the PEGylated polymers. The introduction of PEG grafts showed a notable improvement in the peak power density and maximum current density.",
                        "We attribute the increased conductivity and device performance to the local heterogeneity afforded by the PEG grafts. These flexible side chains lead to a bi-continuous morphology characterized by locally phase-separated hydrophobic-hydrophilic domains. In contrast to QA PSf's homogeneous architecture, the quaternary ammonium species in both QA PSf-g-PEG350 and QA PSf-g-PEG750 are now concentrated into more efficient ion transport domains. The higher performance of QA PSf-g-PEG750 over QA PSf-g-PEG350 is ascribed to larger ion transport channels (via domain size d), leading to a less tortuous diffusion pathway.",
                        "The structural influence on the enhanced performance is underscored by comparing the ion exchange capacities of the materials. The gravimetric ion exchange capacity (IEC) reflects an ionomer's mass charge density, expressed here in mmol hydroxide ions per gram of dry polymer. The theoretical IEC was determined by 1H NMR and was corroborated by experimental back titration",
                        "(Table 2). Of particular interest is that the PEGylated membranes have lower IECs than QA PSf. While a decrease in IEC typically manifests in decreased ionic conductivity as a result of lower charge content, both QA PSf-g-PEG350 and QA PSf-g-PEG750 show increased hydroxide conductivities and device performance. Hydroxide conductivity normalized by the IEC has been used as a qualitative metric for assessing ion transport efficacy and is presented in Table 2. PEGylation increases the IEC normalized conductivity by 67% and 122% for QA PSf-g-PEG350 and QA PSf-g-PEG750, respectively, highlighting the influence of structure formation on ion transport properties.",
                        "The design objective of this invention was to induce the formation of water-rich ion transport domains and we have demonstrated that grafting hydrophilic poly(ethylene glycol) chains along a benzyltrimethylammonium polysulfone AEM can promote nanoscale hydrophobic-hydrophillic domain formation. Colocalization of the ion conducting quaternary ammonium moieties as a result of this phase separation results in more efficient hydroxide transport as demonstrated by increased in-plane conductivity and device performance.",
                        "QA PSf versus QA PSf-g-PEG",
                        "A structural comparison between quaternary ammonium polysulfone (QA PSf) and quaternary ammonium polysulfone grafted poly(ethylene) glycol (QA PSf-g-PEG) provides further insight in how a change in micromorphology strongly influences the ion transport characteristics of a polyelectrolyte membrane.",
                        "The mesostructure of QA PSf (FIGS. 7A-D) is defined by very poor phase separation between the charged (+), ion conducting quaternary ammonium groups and the polysulfone backbone 710, which evidenced by the lack of a scattering peak in the SAXS data (FIG. 3). This leads to a tortuous (i.e. maze-like), inefficient ion (-) transport pathways and lower anionic conductivities as shown in FIG. 7D.",
                        "In contrast as shown in FIG. 8A-B, QA PSf-g-PEG have ion-rich channels (830) facilitate hydroxide (-) transport. The ion channels create a continuous path between a top and bottom surface of an anion transport membrane (FIG. 9). The ion channels have approximately an average 3-30 nm in diameter from SAXS data (FIG. 3). The diameter is defined by the average width of a hydrophilic or water-rich region separating hydrophobic or water-poor regions. The thermodynamics of the system coupled with the brush-like conformation of the PEG grafts (820) causes the formation of these channels. The charged quaternary ammonium species (+) are localized and concentrated to these channels (830), creating an “ionic highway” supported by the polysulfone (810) matrix as shown in FIG. 8B. The result of this unique mesostructure (FIG. 8A-B) is more efficient ion transport compared to for example QA PSf. This is demonstrated by the fact that QA PSf-g-PEGx exhibits higher conductivity at lower charge content (“ion exchange capacity”, or IEC) compared to QA PSf . The decrease in IEC or charge density is due to two reasons. First, from a charge perspective, because both quaternization and PEGylation occur on the same reaction site, an increase in PEG content necessarily limits how much ion-conducting quaternary cations can be placed along the polysulfone backbone. Second, from a mass perspective, as the IEC is defined as charge per unit mass [mEq/g], PEGylation causes an increase in mass due to the higher molecular weights of PEG compared to quaternary ammonium. Both of these combine to lower the IEC. It should be noted that it is not clear and it would certainly not be expected a priori that the random grafting of PEG with QA onto the same backbone will give the mesostructure (FIGS. 8A-B). Hence, it is not clear and it would certainly not be expected that this combination would give better performance. In fact, one might expect the opposite to be true, as a decrease in IEC typically translates to decreased conductivities.",
                        "The mesostructure of QA PSf-g-PEG is not seen for QA PSf or PSf-g-PEG. PSf-g-PEG by itself exhibits micron-scale macrophase separation as the chains are no longer locally stabilized by the charged groups. Hence, the presence of both QA and PEG are necessary as they exhibit a synergistic effect in creating the ion transport channels. Moreover, the lack of charged species in PSf-g-PEG makes the un-quaternized system un-conductive.",
                        "In the case of PSf-g-PEG, the lack of charged species (e.g., quaternary ammonium) makes this system un-suitable for ion exchange membranes by itself as the ion transport kinetics would be far too low.",
                        "Variations",
                        "So far we described bisphenol-A polysulfone backbone with co-grafted PEG and quaternary ammonium species. The structure could be generalized as shown in FIG. 10A with bisphenol A polysulfone (Udel) as the backbone and co-grafted R1 and R2 groups.",
                        "R1 could be: hydrogen,",
                        "—CH2—N+R3R4R5, or",
                        "—CH2—O—(CH2CH2O)m—CH3",
                        "R2 could be: Hydrogen,",
                        "—CH2—N+R3R4R5, or",
                        "—CH2—O—(CH2CH2O)m—CH3",
                        "m could be about 7 (for 350 Da PEG) up to about 45 (for 2000 Da PEG) R3,R4,R5 can be any carbon side chain, typically ranging from C1 to C20. In one of examples described herein they are —CH3.",
                        "The actual chemical identity of R1 and R2 could be randomly selected from the above lists for each repeating unit of the polymer. For example, suppose the polymer is made of about 150 repeat units (n=150) and we introduce an index i describing the specific monomer along the chain, where i ranges from 1 (the first monomer at the beginning of the chain) to n=150 (the last monomer at the end of the chain). Then, for i=1 R1 might be PEG and R2 hydrogen; for i=2 R1 might be quaternary ammonium and R2 might be PEG, with varying permutations up to i=n. It is noted that the synthesis described herein could be extended to various other hydrophobic aromatic backbones with possible performance enhancements such as polyetheretherketone (FIG. 10B), polyphenylsulfone (Radel) (FIG. 10C), polystyrene (FIG. 10D) or polyphenylene oxide (FIG. 10E). The phenyl linkages in unmodified polysulfone exhibit low rotational hindrance, consequently imparting high flexibility to the polymer. Using a more rigid polymer backbone could therefore lead to different phase behavior and morphology, consequently affecting performance.",
                        "The embodiments described herein could also be varied accordingly to the following examples.\n\n\n- - 1. Incorporate as Block Copolymer. Amphiphilic block copolymers are\n    known to phase separate into precise structures at the nano- and\n    micro-scales. This thermodynamically driven self-assembly process is\n    directly linked to the volume fractions of the constituent blocks.\n    Here, we would be able to control the volume fractions of the PEG\n    and quaternary ammonium polysulfone blocks in an effort to optimize\n    the ion transport morphology.\n  - 2. Alternative Grafted Side Chain. In lieu of poly(ethylene glycol),\n    one can imagine grafting an alternative hydrophilic sidechain (e.g.,\n    poly(vinyl alcohol)). The nature of the side-group can significantly\n    influence the behavior of the system from a polymer physics\n    perspective. For example, incorporating a bulkier graft would hinder\n    the rotational freedom of the polymer, leading to a stiffer backbone\n    and different aggregation behavior. PEG complexes with quaternary\n    ammonium cations. Accordingly, an alternative membrane without such\n    complexing behavior may yield different morphologies.\n  - 3. Alternative Ion Conductor. Alternative species such as quaternary\n    phosphonium and guanidinium could be used instead of quaternary\n    ammonium.",
                        "Process",
                        "Chloromethylation of Polysulfone",
                        "Udel P3500 MB8 polysulfone was used as provided by Solvay Chemicals. Chlorotrimethylsilane (42.5 mL) and paraformaldehyde (10.0 g) were added to round-bottom flask containing a polysulfone solution (14.88 g polysulfone in 750 mL of chloroform). After 30 minutes of mixing, stannic chloride (0.392 mL) was added dropwise to the reaction solution. The reaction flask was then fitted with a reflux condenser and heated to 50 degrees Celsius in a silicone oil bath, and the reaction was stirred for 60 to 72 hours, depending on the desired degree of substitution. Upon completion, excess reagents were filtered out and the filtrate was precipitated into ethanol in a 3:1 ratio of ethanol to filtrate. The precipitate was washed with excess ethanol and collected as a white powder. The powder was redissolved in choloroform, repurified following the precipitation process just described, and vacuum dried at room temperature for 24 hours.",
                        "PEGylation",
                        "A typical PEGylation reaction is described as follows. In a nitrogen glove bag, 1.6 mmol of sodium hydride (60 wt % suspension in mineral oil) was first dissolved in THF at a concentration of 0.01 g/mL, and then added to a 25 wt % poly(ethylene)glycol monomethylether (1.2 mmol) solution in THF. The reaction was allowed to proceed for 2 hours with stirring, after which it was added dropwise to a solution of chloromethylated polysulfone (1.0 g of DS 1.05 in 20 mL THF). The solution was reacted for 20.5 hours at room temperature under nitrogen, and then precipitated into a 3:1 mixture of petroleum ether to ethanol. The precipitate was collected by vacuum filtration and used immediately.",
                        "Quaternization",
                        "Quaternary ammonium polysulfone-graft-poly(ethylene glycol) (QA PSf-g-PEGx) was synthesized by in situ quaternization of trimethylamine. Specifically, trimethylamine (4.6M in ethanol) was added dropwise to a solution of either chloromethylated polysulfone or polysulfone-graft-poly(ethylene glycol) (1 g in 10 mL DMF) at 3× molar excess. The reaction mixture was stirred under ambient conditions for 48 hours, and then filtered onto a 3 in×2 in glass slide. The polymer-coated slide was then placed in vacuum for 48 hours at room temperature to cast a thin film. The film was removed in water and pretreated by soaking it in a 1M potassium hydroxide (KOH) solution for 24 hours. Following the KOH treatment, the film was thoroughly rinsed with DI water until the pH of the wash stabilized and used immediately to prevent extensive conversion of the hydroxide anions to carbonate/bicarbonate.",
                        "Electrode Preparation",
                        "Catalyst ink for electrode fabrication was prepared by combining 11 mg of Pt/C (TKK TEC10E50E) and 26 uL ionomer (Fumion FAA-3) in 413 uL of a 40% water 60% isopropanol solution. The ink was sonicated for 10 minutes at room temperature and then painted onto 5 cm2 squares of graphite paper (Sigracet GDL35 BC) to a loading of 0.5 mg/cm2 for both anode and cathode. The membrane electrode assembly was prepared by sandwiching the ionomer film between the anode and cathode in the fuel cell testing fixture, with teflon gaskets (0.25 mm thick) at both electrodes to prevent puncturing by the serpentine flow channels.",
                        "Composition Examples",
                        "The following composition ranges produce functioning membranes within the spirit of the invention. The overall degree of chloromethylation (DCM) could be 0.3 to 1.5 (which is the average number of methyl chlorides per repeat unit). The percentage PEGylation (out of overall DCM) could be about 5% to 75%. The percentage of quaternary ammonium (out of overall DCM) could be about 25% to 95%. Mn PEG could be about 350 Da up to 5000 Da.",
                        "The specific example of QA PSf-g-PEG350 described herein had the following composition:\n\n\n- - PEG Mn 350 Da\n  - Overall DCM: 1.1\n  - % PEGylation: 18%\n  - % QA: 82%",
                        "The specific example of QA PSf-g-PEG750 described herein had the following composition:\n\n\n- - Peg Mn 750 Da\n  - Overall DCM: 1.1\n  - % PEgylation: 9%\n  - % QA: 91%"
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce PEGylated quaternary ammonium polysulfone (QA PSf-g-PEGx)",
                        "design rationale for promoting phase separation",
                        "describe synthesis of QA PSf-g-PEGx",
                        "characterize morphology of PEGylated membranes using SAXS",
                        "analyze SAXS data using Teubner-Strey bi-continuous model",
                        "interpret SAXS results in terms of domain size and correlation length",
                        "discuss effect of PEG molecular weight on domain size",
                        "describe visual differences between PEGylated and un-PEGylated films",
                        "measure hydroxide conductivity using four-point probe cyclic voltammetry",
                        "show temperature dependence of hydroxide conductivity",
                        "compare conductivity of QA PSf and QA PSf-g-PEGx",
                        "discuss effect of PEGylation on apparent Arrhenius activation energy",
                        "fabricate membrane electrode assemblies (MEAs) using PEGylated membranes",
                        "test MEAs in fuel cell setup",
                        "show polarization and power density curves for MEAs",
                        "attribute improved performance to local heterogeneity afforded by PEG grafts",
                        "compare ion exchange capacities of QA PSf and QA PSf-g-PEGx",
                        "discuss effect of PEGylation on IEC normalized conductivity",
                        "summarize design objective of inducing water-rich ion transport domains",
                        "compare mesostructure of QA PSf and QA PSf-g-PEG",
                        "describe poor phase separation in QA PSf",
                        "describe ion-rich channels in QA PSf-g-PEG",
                        "discuss thermodynamics of PEG grafts and quaternary ammonium species",
                        "describe \"ionic highway\" supported by polysulfone matrix",
                        "compare conductivity of QA PSf and QA PSf-g-PEGx at lower IEC",
                        "discuss decrease in IEC due to PEGylation",
                        "describe synergistic effect of QA and PEG on creating ion transport channels",
                        "discuss limitations of PSf-g-PEG without quaternary ammonium species",
                        "generalize structure of QA PSf-g-PEGx",
                        "describe variations of R1 and R2 groups",
                        "discuss random selection of R1 and R2 groups",
                        "show examples of alternative hydrophobic aromatic backbones",
                        "discuss potential performance enhancements of alternative backbones",
                        "describe variations of the invention",
                        "incorporate as block copolymer",
                        "use alternative grafted side chain",
                        "use alternative ion conductor",
                        "describe chloromethylation of polysulfone",
                        "describe PEGylation reaction",
                        "describe quaternization reaction"
                    ],
                    "num_characters": 20293,
                    "outline_medium": [
                        "introduce PEGylated quaternary ammonium polysulfone (QA PSf-g-PEGx)",
                        "describe design rationale for promoting phase separation",
                        "synthesize QA PSf-g-PEGx via three-step process",
                        "characterize morphology using small angle x-ray scattering (SAXS)",
                        "analyze SAXS data using Teubner-Strey bi-continuous model",
                        "discuss domain size and correlation length",
                        "compare QA PSf-g-PEG350 and QA PSf-g-PEG750",
                        "describe visual differences between PEGylated and un-PEGylated films",
                        "measure hydroxide conductivity using four-point probe cyclic voltammetry",
                        "discuss temperature dependence of hydroxide conductivity",
                        "fabricate membrane electrode assemblies (MEAs) for fuel cell testing",
                        "compare fuel cell performance of QA PSf-g-PEG350 and QA PSf-g-PEG750",
                        "attribute enhanced performance to local heterogeneity",
                        "discuss ion exchange capacities of QA PSf and QA PSf-g-PEGx",
                        "compare hydroxide conductivity normalized by IEC",
                        "describe structural comparison between QA PSf and QA PSf-g-PEG",
                        "illustrate mesostructure of QA PSf-g-PEG",
                        "discuss variations of the invention",
                        "describe alternative backbones and side chains",
                        "outline process for synthesizing QA PSf-g-PEGx"
                    ],
                    "outline_short": [
                        "introduce PEGylated quaternary ammonium polysulfone AEM",
                        "describe design rationale for promoting phase separation",
                        "synthesize QA PSf-g-PEGx via three-step process",
                        "characterize morphology of PEGylated membranes using SAXS",
                        "analyze SAXS data using Teubner-Strey bi-continuous model",
                        "measure hydroxide conductivity using four-point probe cyclic voltammetry",
                        "fabricate membrane electrode assemblies and assess fuel cell performance",
                        "attribute increased conductivity and device performance to local heterogeneity",
                        "compare ion exchange capacities of PEGylated and un-PEGylated membranes",
                        "discuss variations of the invention, including alternative backbones and side chains"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An anion transport membrane, comprising:\na hydrophobic polysulfone membrane backbone with co-grafted thereon hydrophilic poly(ethylene glycol) grafts and anion conducting quaternary ammonium species, wherein the membrane has a top surface and a bottom surface, and wherein the membrane is further characterized by having:\n(i) a bi-continuous morphology with locally phase-separated hydrophobic-hydrophilic domains, and\n(ii) a co-localization of the anion conducting quaternary ammonium species with respect to the hydrophilic poly(ethylene glycol) grafts, therewith having defined ion transport channels for facilitating anion transport, wherein the ion transport channels are continuous ion transport channels across the membrane and between the top and bottom surfaces of the membrane, and wherein the ion transport channels have an average diameter of about 3-30 nm defined by an average width of a hydrophilic or a water-rich region separating hydrophobic or water-poor regions.",
        "2. The anion transport membrane as set forth in claim 1, wherein the anion is hydroxide, chloride, bromide, carbonate, or bicarbonate.",
        "3. The anion transport membrane as set forth in claim 1, wherein the hydrophilic poly(ethylene glycol) grafts each have a molecular weight ranging from 350 to 5000 Da.",
        "4. The anion transport membrane as set forth in claim 1, wherein the anion transport membrane is part of an anion exchange membrane fuel cell, a water electrolyzer, or a water filtration system."
    ]
}