{
    "id": "US20210189353",
    "authors": [
        "Alfonso Gautieri",
        "Emilio Parisini",
        "Federica Rigoldi",
        "Stefano Donini",
        "Alberto Redaelli"
    ],
    "title": "THERMOSTABILIZED AMADORIASES AND USES THEREOF",
    "date": "2018-06-21 00:00:00",
    "abstract": "The present invention refers to Amadoriase enzyme protein variants having de-glycating activity and improved thermostability compared to the wild type Amadoriase. The present invention refers also to the use of the thermostabilized Amadoriase as deglycating agent, preferably in the food industry. Moreover, the present invention refers to the use of the thermostabilized Amadoriase as diagnostic and/or therapeutic tools. Preferably, the Amadoriase enzyme protein variants of the invention can be used for determining the level of glycated haemoglobin in a biological sample and therefore for monitoring diabetes.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [
                "Sequence listing ASCII file sequence.txt, created on Feb. 26, 2021 and of size of 19.2 KB is incorporated herein by reference."
            ],
            "subsections": [
                {
                    "title": "DESCRIPTION",
                    "paragraphs": [
                        "The present invention refers to an Amadoriase enzyme having improved thermostability compared to the wild-type Amadoriase.",
                        "The present invention refers also to the use of the thermostabilized Amadoriase as deglycating agent, preferably in the food industry, such as milk pasteurization.",
                        "Moreover, the present invention refers to the use of the thermostabilized Amadoriase for determining the level of glycated haemoglobin in a biological sample and therefore for monitoring diabetes."
                    ],
                    "subsections": [
                        {
                            "title": "STATE OF THE ART",
                            "paragraphs": [
                                "Glycation is the spontaneous, non-enzymatic and irreversible reaction that covalently adds a sugar moiety onto a protein.",
                                "The glycation of haemoglobin protein (HbA1c) is of particular interest for diabetes diagnosis and monitoring. The hyperglycemia associated with diabetes results in the non-enzymatic glycation of blood proteins, including haemoglobin (which has a half-life of 120 days) and albumin (half-life of 20 days). For this reason, the measurement of glycated haemoglobin in the blood is a very powerful method for monitoring the insurgence and development of diabetes. Indeed, while the direct blood sugar level measurement is affected by daily fluctuations, the long lifetime of haemoglobin combined with the slow, yet irreversible, glycation process makes the detection of HbA1c a good indicator of the average blood glucose concentration over a period of 2-3 months. For this reason, in 2010 the American Diabetes Association designated the level of HbA1c as a powerful indicator for the diagnosis of diabetes.",
                                "Since the assessment of glycated haemoglobin is becoming an indispensable part of diabetes diagnosis and control, the HbA1c test demands robustness, high-throughput, and cost effectiveness. As a result, several systems have been developed that are used in the clinics to measure HbA1c. Most methods rely on the separation of HbA1c from non-glycated haemoglobin based on their different chemical properties. These methods include ion exchange chromatography (based on the different isoelectric point), affinity chromatography (based on the different affinity for boronic acid) and capillary electrophoresis (based on the different charge). These current methods, while meeting the requirement for quality and robustness, are based on specialized and expensive techniques that require trained staff and thus fall short for cost-effectiveness and delivery at a point-of-care.",
                                "An Alternative Method for HbA1c Detection Exploits the Deglycating Properties of Amadoriases",
                                "Amadoriase is a flavoenzyme that catalyzes the oxidative deglycation of Amadori products (fructosyl amino acids or aliphatic amines) to yield free amine, glucosone, and hydrogen peroxide.",
                                "Based on their activities, Amadoriases have been used to develop and commercialize a fast, easy and cost-effective HbA1c monitoring enzyme-based system (Direct Enzymatic HbA1c Assay, Diazyme Laboratories). Compared to chromatography- and electrophoresis-based sensing methods, the enzymatic assays have the advantage of being simple and inexpensive, hence good candidates for a point-of-care device. However, one of the issues of these enzyme sensors is their unsatisfactory absolute activity and stability. This issue affects storage stability against temperature changes, which in turn limits the applicability of enzymatic HbA1c monitoring systems based on enzymes.",
                                "In addition to the application of Amadoriase enzyme for HbA1c sensing, these enzymes have been proposed as a therapeutic tool for protein deglycation in the human body. However, since the wild type enzymes are able to act only on small substrates or digested proteins, extensive engineering will be necessary before their likely use as therapeutic tool.",
                                "Finally, glycation of food proteins is a drawback effect of several thermal treatment (e.g., milk UHT treatment), which results in alteration of the sensory and nutritional profile of the products. Amadoriase enzymes have a potential use in food industry in controlling and preventing protein glycation in food products, but the enzymes should be able to sustain the thermal treatments without losing activity.",
                                "There are many possible industrial applications where an increased stability of specific enzymes, such as Amadoriases, may be considered beneficial. Indeed, increasing the thermal and pH resistance of these enzymes can often greatly expand their natural operational range, thus allowing the use of engineered enzymes in environments that are unfavorable to their wildtype counterparts.",
                                "The present invention solves the needs of the prior art by identifying heat resistant variants of Amadoriase enzyme characterized by an improved thermal stability compared to the wild type enzyme. In particular, the heat resistant Amadoriase variants of the invention are characterized by specific amino acid changes/mutations that improve the foldability and the thermal stability of the wild type protein. Indeed, the identified heat resistant Amadoriase variants keep the 3D stability and are active up to 95° C., while the wild type protein is active only at less than 50° C."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define glycation reaction",
                                "motivate HbA1c measurement for diabetes diagnosis",
                                "summarize current HbA1c measurement methods",
                                "limitations of current methods",
                                "introduce Amadoriase enzyme for HbA1c detection",
                                "motivate need for improved Amadoriase stability",
                                "application of Amadoriase in food industry",
                                "potential therapeutic use of Amadoriase",
                                "motivate need for heat-resistant Amadoriase variants"
                            ],
                            "num_characters": 4589,
                            "outline_medium": [
                                "define glycation reaction",
                                "motivate HbA1c measurement for diabetes diagnosis",
                                "summarize limitations of current HbA1c detection methods",
                                "introduce Amadoriase as deglycating agent"
                            ],
                            "outline_short": [
                                "describe glycation reaction and its importance in diabetes diagnosis",
                                "discuss limitations of current HbA1c detection methods"
                            ]
                        },
                        {
                            "title": "SUMMARY OF THE INVENTION",
                            "paragraphs": [
                                "A first aspect of the present invention refers to an isolated thermostable Amadoriase protein characterized by the replacement of amino acid serine in position 67 (S67) and/or proline in position 121 (P121) and/or aspartic acid in position 295 (D295) and/or lysine in position 303 (K303) with cysteine (C), wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, that preferably has amino acid sequence SEQ ID NO: 1. Preferably, the mRNA/cDNA corresponding to SEQ ID NO: 1 is SEQ ID NO: 2 and/or SEQ ID NO: 3.",
                                "According to a preferred embodiment, the thermostable Amadoriase protein is characterized by an amino acid sequence comprising SEQ ID NO: 4 and/or 6. The isolated thermostable Amadoriase protein can be chemically modified in any way, preferably conjugated and/or flagged and/or marked, at the C-End and/or at the N-End, with metals, fluorophores, dyes, tags, reporters, wherein the tag is preferably selected from: a histidine-tag, a GST tag, and a MBP tag.",
                                "According to a preferred embodiment, the polynucleotide sequence codifying the isolated thermostable Amadoriase protein of the invention is preferably SEQ ID NO: 5 and/or 7.",
                                "A further aspect of the invention refers to a derivative from isolated thermostable Amadoriase protein of the invention or from polynucleotide sequence thereof, preferably said derivative being selected from: an oligopeptide, a peptide/oligopeptide, and any engineered Amadoriase mutant/variant carrying at least one of the replacement disclosed above, preferably the replacement of amino acid serine in position 67 (S67) and/or proline in position 121 (P121) and/or aspartic acid in position 295 (D295) and/or lysine in position 303 (K303) with cysteine (C).",
                                "A further aspect of the invention refers to a crystal or isomorph of the isolated thermostable Amadoriase protein of the invention.",
                                "A further aspect of the invention refers recombinant vector or a host cell comprising and/or transformed/transfected with the recombinant vector comprising the polynucleotide sequence of the invention.",
                                "A further aspect of the invention refers to the use of the isolated thermostable Amadoriase protein of the invention to de-glycate molecules and/or proteins, wherein said molecules/proteins are preferably from animal and/or human body or from foods.",
                                "A further aspect of the invention refers to the use of the isolated thermostable Amadoriase protein of the invention in food industry, preferably for thermal treatments, preferably selected from: milk UHT treatment, any treatment causing the glycation of food proteins and/or the loss of organoleptic and/or quality profile of food.",
                                "A further aspect of the invention refers to the use of the isolated thermostable Amadoriase protein, or the polynucleotide sequence, or the derivative, or the crystal or isomorph of the invention as therapeutic tool, preferably to reduce the in vivo glycation of molecules and/or proteins.",
                                "Moreover, the invention refers to the use of the isolated thermostable Amadoriase protein, or the polynucleotide sequence, or the derivative, or the crystal or isomorph of the invention as diagnostic tool and/or biosensor, preferably to detect glycated hemoglobin and/or to monitor the insurgence and/or the development diabetes, preferably diabetes mellitus.",
                                "A further aspect of the invention refers to a kit for detecting glycated hemoglobin and/or for evaluating/measuring diabetes, preferably diabetes mellitus comprising the isolated thermostable Amadoriase protein, or the polynucleotide sequence, or the derivative, or the crystal or isomorph of the invention.",
                                "Finally, the invention refers also to a method for measuring glycated haemoglobin in a biologic sample, preferably in blood, and/or for determining the insurgence and/or the development of diabetes, preferably diabetes mellitus said method comprising the following steps:",
                                "(i) Digesting a sample comprising heamoglobin to proteases in order to release amino acids, preferably the glycated valine from the N-terminus of haemoglobin;",
                                "(ii) Deglycating the valine released according to step (i) by adding the thermostable Amadoriase protein variants disclosed above; and",
                                "(iii) Measuring/determining the amount of hydrogen peroxide produced after step (ii)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define isolated thermostable Amadoriase protein",
                                "specify amino acid changes for improved stability",
                                "describe preferred embodiments of thermostable Amadoriase",
                                "define derivative of isolated thermostable Amadoriase protein",
                                "define crystal or isomorph of isolated thermostable Amadoriase protein",
                                "describe recombinant vector or host cell",
                                "application of thermostable Amadoriase in food industry",
                                "application of thermostable Amadoriase as diagnostic tool and/or biosensor"
                            ],
                            "num_characters": 4281,
                            "outline_medium": [
                                "define thermostable Amadoriase protein",
                                "describe preferred embodiments of thermostable Amadoriase protein",
                                "summarize uses of thermostable Amadoriase protein",
                                "outline method for measuring glycated haemoglobin"
                            ],
                            "outline_short": [
                                "define thermostable Amadoriase protein with specific amino acid changes",
                                "outline various aspects of the invention, including derivatives, vectors, and uses"
                            ]
                        },
                        {
                            "title": "DETAILED DESCRIPTION OF THE INVENTION",
                            "paragraphs": [
                                "A first aspect of the present invention refers to an isolated thermostable Amadoriase protein characterized by the substitution (mutation/alteration/replacement) of amino acid serine in position 67 (S67) and/or proline in position 121 (P121) and/or aspartic acid in position 295 (D295) and/or lysine in position 303 (K303) with cysteine (C), wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, that preferably has amino acid sequence SEQ ID NO: 1. Preferably the mRNA/cDNA corresponding to SEQ ID NO: 1 is SEQ ID NO: 2.",
                                "Amadoriases, also known as fructosyl amine oxidases (abbreviated as FAOX or FAOD), are a family of enzymes derived from fungi and bacteria that are able to cleave low molecular weight Amadori product (i.e, glycated amino acids) to yield a free amine, glucosone, and hydrogen peroxide. At present, this enzyme family is composed of around 15 different forms as summarized in Table 1, which share common structural features, such as FAD-binding motifs. The physiological role of eukaryotic FAODs remains unknown, while extensive studies showed that prokaryotic FAOD as the key enzyme in the catabolic pathway of naturally occurring fructosyl amino acids. In this context, Amadoriase is preferably Amadoriase I. Moreover, as already mentioned, in the context of the present invention, the amino acid sequence of the wild type Amadoriase is preferably SEQ ID NO: 1 and the corresponding mRNA/cDNA is SEQ ID NO: 2. The position of the amino acid residues modified according to the present invention is calculated considering SEQ ID NO: 1 as reference sequence. However, the variants derived from the modification(s)/mutation(s) of the corresponding amino acid residues on the sequence of the different (known) forms of the Amadoriase enzyme family are part of this disclosure.",
                                "Preferably, the Amadoriases of the present invention are from any source, preferably from eukaryotes, more preferably from fungi, still more preferably of genera Aspergillus, still more preferably the Asperigillus species fumigatus.",
                                "Amadoriases are currently used as biosensors meaning that they are used to detect glycated proteins, such as hemoglobin to monitor diabetes. These enzymes have also been proposed to be used as a therapeutic tool to reduce in vivo glycation.",
                                "Finally, Amadoriase enzymes have a potential use also in the food industry, preferably to control and/or to prevent protein glycation in food products, preferably during and after heat treatment of food products, for example milk pasteurization.",
                                "The new protein variants of Amadoriase enzyme having the mutation(s) reported above are characterized by an improved heat resistance. In other words, they show a better thermostability compared to the wild type Amadoriase enzyme. In this regard, indeed, as well demonstrated and explained in the examples below, while the wild type protein is stable, and consequently functional and/or biologically active, at temperature values less than 50° C., the Amadoriase variants of the present invention keep their stability and functionality at a temperature up to 95, preferably up to 90° C., more preferably up to 80° C. In particular, the Amadoriase variants of the present invention show an improved T50, that is the temperature at which the enzyme loses 50% of the activity compared to the activity at 25° C. The thermostable Amadoriase variants of the invention show preferably a T50 ranging from 50° C. to 70° C., more preferably from 55° C. to 60° C., still more preferably from 55.3° C. and 60.6° C. Preferably, SS03 shows the minimum value of T50 while SS17 the maximum. Preferably, the wild-type enzyme presents a T50 of around 50° C., more preferably 52, still more preferably 52.4° C. Preferably, the disclosed values of T50 are referred to the experimental conditions of the invention.",
                                "Moreover, advantageously the Amadoriase variants of the present invention are characterized by an improved shelf life and/or longer expiry date/time storage.",
                                "In view of these features, the Amadoriase variants of the present invention are ideal to be used as molecular components of processes involving heat treatments and/or to preserve the integrity and/or provides long-term stability to samples by preventing amino acid glycation.",
                                "Moreover, the Amadoriase variants of the present invention are ideal to be used in food industry. Examples of specific applications in this field are: milk pasteurization, production of bakery products or treatment of food additives, preferably artificial sweeteners or flavor enhancers.",
                                "Moreover, the Amadoriase variants of the present invention can be used in the pharmaceutical or cosmetic industry, preferably for drug formulation or thermal treatment of pharmaceutical excipients.",
                                "As mentioned before, the Amadoriase protein variants of the present invention are characterized by a protein sequence having the substitution (mutation/alteration/replacement) of amino acid serine in position 67 (S67) and/or proline in position 121 (P121) and/or aspartic acid in position 295 (D295) and/or lysine in position 303 (K303) with cysteine (C), wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1.",
                                "These Amadoriase variants show de-glycating activity and an improved thermostability compared to the wild type enzyme (the Amadoriase variants of the invention are stable at a temperature up to 95° C., preferably up to 90° C., more preferably up to 80° C., while the wild type is stable at a temperature less than 55° C.).",
                                "In the context of the present invention, “substitution of amino acid” means to modify or to mutate in the context of a protein/peptide sequence an amino acid into another. In this case, the amino acid(s) of interest is(are) mutated, singularly or in any combinations, into cysteine. In particular, the codons on the cDNA/mRNA sequence of the protein corresponding to the amino acid residues have been modified through genetic engineering techniques so that the translated proteins contain the mutation.",
                                "SEQ ID NO: 1 is preferably the sequence of the wild type amodoriase enzyme. SEQ ID NO: 2 is preferably the corresponding mRNA/cDNA sequence. The specific amino acid residues of SEQ ID NO: 1 (serine 67 and/or proline 121 and/or aspartic acid 295 and/or lysine 303) eventually modified in cysteine individually or in any combinations according to the invention are bold-underlined in Table I wherein all the all the sequences disclosed in the present application are listed.",
                                "The present invention refers also to SEQ ID NO: 3 that is the cDNA sequence optimized for the E. coli expression (Codon Optimized—CO); in other words SEQ ID NO: 3 is SEQ ID NO: 2 modified according to the codon usage of E. coli in order to boost the expression of the protein in this bacterium.",
                                "According to a preferred embodiment of the invention, the isolated thermostable Amadoriase protein variant is characterized by the substitution (mutation) of the amino acid serine in position 67 and the proline in position 121 with a cysteine wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1. This variant is named Amadoriase SS03 from now on and it is characterized by the following mutation/substitution Ser67Cys and Pro121Cys. Amadoriase SS03 is characterized by a protein 3D structure (the folded protein) having an additional disulfide bond between the mutated residues mentioned above (FIG. 1), that are the cysteine (instead of the wild type serine) in position 67 and the cysteine in position 121 (instead of the wild type proline).",
                                "According to a further preferred embodiment of the invention, the isolated thermostable Amadoriase protein variant is characterized by the substitution (mutation) of the amino acid aspartic acid in position 295 and the lysine in position 303 with a cysteine wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1. This variant is named Amadoriase SS17 from now on and it is characterized by the following mutation/substitution Asp295Cys and Lys303Cys. Amadoriase SS17 is characterized by a protein 3D structure (the folded protein) having an additional disulfide bond between the mutated residues mentioned above (FIG. 1), that are the cysteine (instead of the wild type aspartic acid) in position 295 and the cysteine in position 303 (instead of the wild type lysine).",
                                "According to a preferred embodiment of the invention, the isolated thermostable Amadoriase protein variant is characterized by the substitution (mutation) of amino acid serine in position 67, proline in position 121, aspartic acid in position 295 and lysine in position 303 (each one) with a cysteine wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1. This Amadoriase variant is characterized by a protein 3D structure (the folded protein) having two additional disulfide bonds between the mutated residues mentioned above (one between cysteine in position 67 and cysteine in position 121 and another between cysteine in position 295 and cysteine in position 303).",
                                "According to a further preferred embodiment of the invention, the isolated thermostable Amadoriase protein variant is characterized by an amino acid sequence comprising SEQ ID NO: 4 and/or 6. As already mentioned for SEQ ID NO: 1-3, SEQ ID NO: 4 and 6 are listed in Table I and the mutated/modified amino acid residues are marked as bold-underlined.",
                                "SEQ ID NO: 4 corresponds to the amino acid (protein) sequence of the Amadoriase comprising a mutation/substitution from serine in position 67 and proline 121 to cysteine (Ser67Cys and Pro121Cys) wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1. This Amadoriase variant is named SS03.",
                                "SEQ ID NO: 6 corresponds to the amino acid (protein) sequence of the Amadoriase variant comprising a mutation/substitution from aspartic acid in position 295 and lysine in position 303 to cysteine (Asp295Cys and Lys303Cys) wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, preferably SEQ ID NO: 1. This Amadoriase variant is named SS17.",
                                "A further aspect of the present invention, refers to a polynucleotide sequence codifying the isolated thermostable Amadoriase protein variants as disclosed above, preferably said polynucleotide sequence being SEQ ID NO: 5 and/or 7, wherein SEQ ID NO: 5 corresponds to the polynucleotide sequence codifying the Amadoriase SS03 variant, while SEQ ID NO: 7 corresponds to the polynucleotide sequence codifying the Amadoriase SS17 variant.",
                                "SEQ ID NO: 5 and 7 are listed in Table I and the codons (the trinucleotides codifying for the amino acid residues) corresponding to the amino acid residues mutated/modified according to the invention are marked bold-underlined.",
                                "The present invention refers also to any derivative from the thermostable Amadoriase variants disclosed above, preferably oligopeptides, peptides, or further engineered Amadoriase mutants carrying one and/or both the disulfide bonds described herein.",
                                "A further aspect of the present invention refers to the protein crystal of the isolated thermostable Amadoriase protein variants disclosed above, preferably of SS03 and/or SS17 Amadoriase variant(s).",
                                "Alternatively, the thermostable Amadoriase proteins of the invention can be chemically modified in any way, preferably they can be conjugated and/or flagged and/or marked with metals, fluorophores, dyes, tags, reporters. Only as an example, the thermostable Amadoriase proteins can be tagged by introducing, at the C-terminus and/or at the N-terminus, a histidine-tag, a GST tag, a MBP tag, one or more N-terminal or C-terminal cysteines or any further tag, in order to facilitate the purification step of the proteins from the host cells and/or to conjugate the protein onto a natural and/or chemically modified surface.",
                                "A further aspect of the present invention refers to a recombinant vector comprising the polynucleotide sequence codifying the isolated thermostable Amadoriase protein variants, said polynucleotide sequence being preferably SEQ ID NO: 5 and/or 7. Preferably, the recombinant vector is any vector useful for the posed scope and known to the skilled in the art, more preferably the vector is from pET generation, more preferably pET3a.",
                                "A further aspect of the present invention refers to a host cell comprising and/or transformed/transfected with the recombinant vector disclosed above and/or permanently expressing the thermostable Amadoriase protein variants of the invention. The host cell is preferably selected from: bacteria, preferably E. coli, more preferably the strain BL21(DE3) and/or BL21(DE3)pLysS, yeasts, eukaryotic cells and insect cells.",
                                "A further aspect of the invention refers to a method for producing the thermostable Amadoriase protein variants of the invention comprising at least one of the following steps:",
                                "(i) culturing host cells comprising and/or transformed/transfected by using the recombinant vector disclosed above and/or permanently expressing the thermostable Amadoriase protein variants of the invention, and",
                                "(ii) collecting the thermostable Amadoriase protein variants said thermostable Amadoriase protein variants having preferably de-glycating activity and/or a thermostability up to 95° C., preferably up to 90° C., more preferably up to 80° C.",
                                "The thermostable Amadoriase protein variants collected according to step (ii) can be purified (purifying step) by using the canonical processes used to this end.",
                                "Table I lists the sequences herein disclosed. In particular, it shows the specific sequence, the name of the sequence and the corresponding SEQ ID NO. The sequences are also provided with a Sequence Listing generated by using Patentln software. Any sequence having 80-99% identity with the sequences hereby disclosed should be considered part of the invention.",
                                "A further aspect of the present invention refers to the use of the thermostable Amadoriase protein variants disclosed above to de-glycate molecules, preferably molecules and/or proteins. Preferably, said molecules/proteins are from animal and/or human body. Alternatively, said molecules/proteins are from foods. Indeed, for example, in food industry, some treatments, preferably thermal treatments, such as milk UHT treatment, cause the glycation of food proteins and therefore the loss of organoleptic and quality profile of food. In this context, the thermostable Amadoriase protein variants of the invention can be used to avoid and/or to reduce the glycation of food proteins caused preferably by thermal treatments and/or consequently they can be used to avoid and/or to reduce the loss of organoleptic and/or the quality profile of food.",
                                "Moreover, the thermostable Amadoriase protein variants disclosed above are useful for medical purposes and/or for diagnostic purposes. Preferably, the thermostable Amadoriase protein variants disclosed above are used as biosensor, preferably to detect glycated hemoglobin. Therefore they can be used to monitor diabetes, preferably diabetes mellitus.",
                                "Indeed, the measurement of systemic heamoglobin glycation (HbA1c) is a well-established method to diagnose the insurgence and/or the development of diabetes.",
                                "Therefore, a further aspect of the present invention refers to the thermostable Amadoriase protein variants as disclosed above as diagnostic tool.",
                                "Alternatively, the thermostable Amadoriase protein variants as disclosed above can be used as therapeutic tool, preferably to reduce the in vivo glycation of molecules and/or proteins.",
                                "A further aspect of the present invention refers to a kit for measuring glycated haemoglobin and, more preferably, for evaluating/measuring diabetes, preferably diabetes mellitus. The kit is an Amadoriase-based kit that uses the thermostable Amadoriase protein variants disclosed above because these variants show an improved resistance to thermal treatment and/or to proteases.",
                                "A further aspect of the present invention refers to a method for measuring glycated haemoglobin in a biological sample, preferably in blood, said method comprising the following steps:",
                                "(i) digesting a sample comprising heamoglobin to proteases in order to release amino acids, preferably the glycated valine from the N-terminus of haemoglobin;",
                                "(ii) deglycating the valine released according to step (i) by adding the thermostable Amadoriase protein variants disclosed above;",
                                "(iii) measuring/determining the amount of hydrogen peroxide produced after step (ii).",
                                "As mentioned before, the method for measuring glycated haemoglobin in a biologic sample can be useful for determining the insurgence and/or the development of diabetes, preferably diabetes mellitus.",
                                "Example",
                                "Protein Expression and Purification",
                                "The wild type Amadoriase I gene (SEQ ID NO: 3), has been cloned in a pET-3a vector (Novagen).",
                                "The double-cysteine mutations were introduced in the wild type sequence using the Quickchange kit (Agilent).",
                                "All constructs and mutations were verified by DNA sequencing.",
                                "E. coli BL21(DE3)pLysS cells (Invitrogen) were then transformed with the mutated DNA and grown in Lysogeny Broth (LB) medium supplemented with 50 mg/liter ampicillin (Sigma).",
                                "Cells were grown at 37° C. until A600=0.6 was reached and expression was induced by adding isopropyl 1-thio-β-D-galactopyranoside (Sigma) to a final concentration of 0.5 mM. Subsequent overnight protein expression at 25° C. provided soluble protein. The cell lysate was then purified by nickel affinity chromatography.",
                                "A second and final purification step using a Hiprep 26/60 Sephacryl S-100 size exclusion column (GE Healthcare) was performed to provide 100% sample purity as detected by Coomassie staining. Absorbance at 450 nm was monitored in order to identify the fractions with the most intense yellow color, which is typical of FAD-dependent enzymes.",
                                "The fractions of this last affinity chromatography step were collected and dialyzed into a 10 mM Tris buffer, pH 8.0.",
                                "Different aliquots of highly purified SS-enzymes (the Amadoriase protein variants) at different concentration have been prepared and stored at −80° C. All the protein concentrations were determined using a Bradford assay14 kit (Bio-Rad) and bovine serum albumin (Sigma) as the standard.",
                                "Enzyme Activity Assay",
                                "Enzymatic activity was followed by a continuous assay that detects glucosone formation over time from fructosyl-lysine at 322 nm. The 200 μl reaction mixture contained 10 mM Tris HCl pH 7.4, 20 mM o-Phenylenediamine, 2 mM fructosyl-lysine. After 1 minute of pre-incubation, the reaction was started adding 4.5 μg of enzyme, and the increase in absorbance at 322 nm (glucosone ε322=149.25 M−1cm−1) was monitored in a Spark10M (Tecan).",
                                "Steady-State Kinetics",
                                "Apparent steady-state parameters for the enzymes over its natural substrate were determined by means of the assay described above, with fructosyl-lysine concentrations varied from 0.05 mM to 2 mM. Data points were obtained from three independent experiments. Kinetic parameters were calculated using a non-linear least-square fit of the data, and fitted with Eq. 1 (the Michaelis-Menten equation for hyperbolic substrate kinetics) using Hyperbola fit function of GraphPad Prism version 5.00 for Windows, GraphPad Software, La Jolla Calif. USA.",
                                "\\(\\begin{matrix}\n{v = \\frac{V_{\\max}*S}{\\left( {K_{m} + S} \\right)}} & \\left( {{Eq}{.1}} \\right)\n\\end{matrix}\\)",
                                "in which v, Vmax, S, and Km represent the steady state reaction rate, maximum reaction rate, substrate concentration, and Michaelis-Menten constant for the substrate, respectively.",
                                "Results of Steady-State Kinetics",
                                "Kinetics parameters calculated for the wild type and the two mutants towards fructosyl-lysine are consistent with those reported in literature for other enzymes of the same family. In particular, it is shown that for the SS03 and SS17 variants the mutations do not significantly affect the kinetic parameters when compared with the WT. In other words, the data confirmed that the introduced modifications increase the stability without impairing the catalytic properties of the enzymes.",
                                "All the kinetic data are summarized in Table II.",
                                "Measurement of Thermal Stability",
                                "Thermal stability test was performed using the assay described above after heat treatment, by incubating for 10 minutes the enzyme to target temperature ranging from 25° C. to 100° C. (with 5° C. steps) in the absence of ligands, and then cooling it down at 4° C. until test. The reduced forms of the enzymes were obtained by supplementing the buffer with 100 mM 1,4-Dithiothreitol (DTT). After 1 h of incubation, the heat treatment and enzymatic assay are performed as for the oxidized forms. Data points were obtained from three independent experiments.",
                                "T50 values were obtained by fitting data with Boltzmann Equation (Eq. 2) with the Boltzmann sigmoidal fit function implemented in GraphPad Prism version 5.00 for Windows, GraphPad Software, La Jolla Calif. USA.",
                                "\\(\\begin{matrix}\n{A = {A_{bottom} + \\frac{\\left( {A_{top} - A_{bottom}} \\right)}{1 + e^{(\\frac{T - T_{50}}{S})}}}} & \\left( {{Eq}.\\mspace{14mu} 2} \\right)\n\\end{matrix}\\)",
                                "where A represents the residual activity, Abottom the lower asymptote of residual activity, Atop the higher asymptote of residual activity, T the temperature, T50 the temperature at which residual activity is halfway between Atop and Abottom, and s describes the steepness of the curve.",
                                "Thermal Stability Results",
                                "The thermal stability is assessed by testing the activity of Amadoriase variants from 25° C. to 100° C. and then calculating the T50, that is the temperature at which the enzymes lose 50% of the activity with respect to the activity at 25° C. (see FIG. 2 and Table III).",
                                "The results show that the Amadoriase variants of the invention—SS03 and SS17—display a significant improvement in T50 compared to the wild type (WT) enzyme, of ≈3° C. and ≈8° C., respectively.",
                                "It is worth noting that, while wild type and SS03 lose completely their activity at temperatures 60° C., the SS17 mutant retains a residual activity of 50% at 60° C. and it is still active after heat treatment at 90° C. (with 6% residual activity (see FIG. 2).",
                                "To confirm the disulfides bonds formation we performed the same experiments supplementing the buffer with 100 mM Dithiothreitol (DTT), in order to reduce the disulfide bonds.",
                                "The results show that all the SS-variants lose the improved thermal resistance and behave very similar to the wild type.",
                                "Protein Crystallization and Structure Determination",
                                "Crystals of both the SS03 and the SS17 mutant were obtained using the vapor diffusion method at room temperature by mixing a 1 μl drop of ˜15 mg/ml protein sample with an equal volume of a 0.1 M sodium citrate pH 5.6, 14% PEG4K, 15 isopropanol and 0.1 M sodium citrate pH 5.6, 14% Peg4K, 5% dimethyl sulfoxide solution respectively. Medium-size (150×100×50 μm) rod-like crystals appeared within a few days. Prior to X-ray data collection, crystals were frozen in a chemically identical solution supplemented with 25% (v/v) glycerol for cryo-protection. A 2.19 Å resolution data set was collected from a crystal of SS03 and a 2.85 Å resolution data set was collected from a crystal of SS07, in both cases using λ=1.000 Å in the X06DA-PXIII beamline at the Swiss Light Source (Paul Scherrer Institute, Villigen, Switzerland). Diffraction images were processed and scaled using XDS. The structures were determined by molecular replacement using MOLREP from the CCP4 package and the free Amadoriase I structure (PDB code: 4WCT) as the search probe. Model building and refinement were carried out using REFMAC5 and PHENIX. Water molecules were added both automatically using the phenix_refine tool from the PHENIX package and manually from visual inspection of the electron density map."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce Amadoriase protein",
                                "describe Amadoriase function",
                                "summarize Amadoriase family",
                                "motivate Amadoriase I",
                                "describe SEQ ID NO: 1 and 2",
                                "introduce thermostable Amadoriase protein variants",
                                "describe mutations in Amadoriase variants",
                                "motivate improved thermostability",
                                "describe application in food industry",
                                "describe application in pharmaceutical industry",
                                "describe application in cosmetic industry",
                                "define \"substitution of amino acid\"",
                                "describe SEQ ID NO: 3",
                                "describe Amadoriase SS03 variant",
                                "describe Amadoriase SS17 variant",
                                "describe additional disulfide bonds",
                                "describe SEQ ID NO: 4 and 6",
                                "describe polynucleotide sequences",
                                "describe SEQ ID NO: 5 and 7",
                                "describe recombinant vector",
                                "describe host cell",
                                "describe method for producing thermostable Amadoriase protein variants",
                                "describe culturing host cells",
                                "describe collecting thermostable Amadoriase protein variants",
                                "describe purifying thermostable Amadoriase protein variants",
                                "describe use of thermostable Amadoriase protein variants",
                                "describe de-glycation of molecules",
                                "describe application in food industry",
                                "describe application in medical purposes",
                                "describe application in diagnostic purposes",
                                "describe use as biosensor",
                                "describe use as therapeutic tool",
                                "describe kit for measuring glycated haemoglobin",
                                "describe method for measuring glycated haemoglobin",
                                "describe digesting sample",
                                "describe deglycating valine",
                                "describe measuring hydrogen peroxide",
                                "describe protein expression and purification",
                                "describe cloning Amadoriase I gene",
                                "describe introducing double-cysteine mutations",
                                "describe verifying constructs and mutations",
                                "describe transforming E. coli cells",
                                "describe inducing protein expression",
                                "describe purifying protein",
                                "describe enzyme activity assay",
                                "describe steady-state kinetics",
                                "describe measurement of thermal stability"
                            ],
                            "num_characters": 24015,
                            "outline_medium": [
                                "introduce Amadoriase protein",
                                "describe Amadoriase function",
                                "motivate thermostable Amadoriase",
                                "define thermostable Amadoriase protein",
                                "describe mutations in thermostable Amadoriase",
                                "specify amino acid positions modified",
                                "describe application of thermostable Amadoriase",
                                "mention food industry application",
                                "mention pharmaceutical industry application",
                                "describe de-glycating activity",
                                "describe improved thermostability",
                                "specify T50 values",
                                "describe protein 3D structure",
                                "describe disulfide bonds",
                                "introduce SEQ ID NO: 1-7",
                                "describe polynucleotide sequences",
                                "describe derivatives of thermostable Amadoriase",
                                "describe protein crystal",
                                "describe recombinant vector",
                                "describe host cell",
                                "describe method for producing thermostable Amadoriase",
                                "describe use of thermostable Amadoriase",
                                "describe kit for measuring glycated hemoglobin"
                            ],
                            "outline_short": [
                                "introduce Amadoriase protein",
                                "describe Amadoriase function and applications",
                                "motivate thermostable Amadoriase variants",
                                "describe mutations of Amadoriase variants",
                                "characterize thermostable Amadoriase variants",
                                "describe uses of thermostable Amadoriase variants",
                                "introduce polynucleotide sequences codifying Amadoriase variants",
                                "describe recombinant vector and host cell",
                                "outline method for producing Amadoriase variants",
                                "describe use of Amadoriase variants as diagnostic tool",
                                "describe kit for measuring glycated hemoglobin"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce Amadoriase enzyme with improved thermostability"
                    ],
                    "num_characters": 485,
                    "outline_medium": [
                        "introduce Amadoriase enzyme with improved thermostability"
                    ],
                    "outline_short": [
                        "introduce Amadoriase enzyme with improved thermostability"
                    ]
                }
            ],
            "outline_long": [
                "incorporate sequence listing"
            ],
            "num_characters": 126,
            "outline_medium": [
                "incorporate sequence listing"
            ],
            "outline_short": [
                "incorporate sequence listing"
            ]
        }
    ],
    "claims": [
        "1. An isolated thermostable Amadoriase protein characterized by the replacement of amino acid serine in position 67 (S67) and/or proline in position 121 (P121) and/or aspartic acid in position 295 (D295) and/or lysine in position 303 (K303) with cysteine (C), wherein the amino acid position refers to the amino acid sequence of the wild type Amadoriase, that has amino acid sequence SEQ ID NO: 1, or a polynucleotide sequence codifying said isolated thermostable Amadoriase, wherein said polynucleotide sequence is SEQ ID NO: 5 or 7, or a recombinant vector comprising the polynucleotide, or a host cell comprising the polynucleotide or the recombinant vector or permanently expressing the thermostable Amadoriase protein.",
        "2. The isolated thermostable Amadoriase protein according to claim 1, wherein the mRNA/cDNA corresponding to SEQ ID NO: 1 is SEQ ID NO: 2 and/or SEQ ID NO: 3.",
        "3. The isolated thermostable Amadoriase protein according to claim 1 characterized by an amino acid sequence comprising SEQ ID NO: 4 and/or 6",
        "4. The isolated thermostable Amadoriase protein according to claim 1 conjugated and/or flagged and/or marked, at the C-end and/or at the N-end, with metals, fluorophores, dyes, tags and reporters.",
        "5-9. (canceled)",
        "10. A method for reducing the glycation of molecules or proteins derived from animal or human body or from foods, said method comprising\ncontacting said molecules or proteins with the isolated thermostable Amadoriase protein according to claim 1.",
        "11. The method according to claim 10, wherein said food is subjected to a thermal treatment.",
        "12. An in vivo method for reducing glycation of molecules or proteins said method comprising\nadministering to an individual in need thereof the isolated thermostable Amadoriase protein, or the polynucleotide sequence according to claim 1.",
        "13-14. (canceled)",
        "15. A method for measuring glycated haemoglobin in a biologic sample or for determining the insurgence or the development of diabetes said method comprising the following steps:\n(i) Digesting a sample comprising heamoglobin to proteases in order to release amino acids;\n(ii) Deglycating the amino acids released according to step (i) by adding the thermostable Amadoriase protein variants disclosed above; and\n(iii) Measuring/determining the amount of hydrogen peroxide produced after step (ii).",
        "16. The isolated thermostable Amadoriase protein according to claim 4, wherein the Tag is selected from: a histidine, -tag, a GST tag and a MBP tag."
    ]
}