{
    "id": "US20210393188",
    "authors": [
        "Daniel A. Beard",
        "Daniel E. Michele",
        "Brian E. Carlson",
        "Feng Gu"
    ],
    "title": "QUANTIFICATION OF INTERMITTENT FUNCTION OF BAROREFLEX FROM CONTINUOUS ARTERIAL PRESSURE DATA",
    "date": "2021-06-21 00:00:00",
    "abstract": "An apparatus for measuring arterial pulse and heart rate of a subject includes a wearable sensor assembly configured to be attached to the subject to measure the blood pressure of the subject. The apparatus further includes a signal processor configured to receive blood pressure data from the wearable sensor assembly and to perform time-series analysis on the blood pressure data. The processor then determines baroreflex functionality of the patient, from the blood pressure data. Further, the processor determines an indication of hypertension in the subject from the baroreflex functionality.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE DISCLOSURE",
                    "paragraphs": [
                        "The present disclosure relates to health related monitors and, more particularly, to techniques for analyzing blood pressure data and classification of hypertension through baroreflex functionality."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to health monitors"
                    ],
                    "num_characters": 198,
                    "outline_medium": [
                        "relate to health monitors"
                    ],
                    "outline_short": [
                        "relate to health monitors"
                    ]
                },
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The background description provided herein is for the purpose of generally presenting the context of the disclosure. Work of the presently named inventors, to the extent it is described in this background section, as well as aspects of the description that may not otherwise qualify as prior art at the time of filing, are neither expressly nor impliedly admitted as prior art against the present disclosure.",
                        "Hypertension, or high blood pressure, is a common condition that can cause other health problems such as organ failure if untreated. Hypertension is often undetected in individuals because people may have hypertension for years without exhibiting or noticing any symptoms. Moreover, there exist no reliable accepted means of predicting the future onset of hypertension in individuals. Untreated hypertension may cause damage to blood vessels and the heart. Undetected and untreated hypertension eventually may lead to heart attack and stroke. Hypertension usually develops over years and eventually affects nearly every person over time.",
                        "Monitoring blood pressure and detecting hypertension is typically only performed during a physical examination by a healthcare practitioner, and therefore many people with hypertension go undiagnosed. Wearable devices have the potential to provide continuous monitoring of pressure in a nonintrusive manner. Future healthcare applications making use of data from these devices will require means to assess current and future disease status from the data collected. Therefore, an effective technique for analyzing and assess large amounts of continuous blood pressure data could provide caregivers with a variety of valuable clinical decision-making tools.",
                        "Current applications for continuous blood pressure (BP) and blood pressure waveform measurement and analysis mainly use invasive approaches and confined to stationary complex clinical settings such as the intensive care unit (ICU). Hence, the techniques are not suitable for a wide range of applications, including personal healthcare monitoring at home.",
                        "At present, assessment of hypertensive disease relies on blood pressure measurements to determine and classify disease status. Although continuous data on blood pressure and heart rate fluctuations contain data on dynamic interactions between the autonomic nervous system and the cardiovascular system, analysis of such data is not effectively done in clinical applications. With the development of low-cost wearable monitoring systems, large quantities of dynamic pressure and heart rate data are becoming available. Therefore, a reliable and effective approach for extracting actionable diagnoses or monitoring effectiveness of interventions from these data is needed.",
                        "Non-continuous monitoring systems have been proposed, but these too are problematic. Some of these non-continuous monitoring systems are relatively portable and non-invasive. However, these conventional techniques typically provide limited data from limitations in sensor sensitivity or limitations in data analysis. Moreover, the majority of current noninvasive systems are cumbersome, since inflation of their mechanical cuff (or balloon) obstructs the normal everyday activities of life for the users. Typical blood pressure measurement systems are not continuously wearable; and the information they provide lacks the frequency and granularity required for meaningful signal processing and further, for use in artificial intelligence analysis and machine learning.",
                        "In light of these limitations and needs, and given the increased need for new health care delivery models, there is a need for methods that can provide diagnostic insight from continuous noninvasively obtained data to detect, predict, classify, and manage hypertensive disease."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce hypertension",
                        "describe undetected hypertension",
                        "motivate wearable devices",
                        "describe limitations of current BP measurement",
                        "describe limitations of non-continuous monitoring",
                        "highlight need for new health care delivery models",
                        "highlight need for diagnostic insight"
                    ],
                    "num_characters": 3781,
                    "outline_medium": [
                        "introduce hypertension",
                        "describe limitations of current monitoring systems",
                        "highlight need for new health care delivery models"
                    ],
                    "outline_short": [
                        "motivate hypertension monitoring"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The present techniques include techniques for identifying pathologies of the autonomic nervous system, diagnosing hypertension associated with autonomic dysfunction, predicting onset and/or progression of hypertensive disease, and predicting optimal treatments for patients with hypertension and other diseases of blood pressure control.",
                        "The techniques employ a computational analysis of time-series data on arterial blood pressure and heart rate to identify periods of time during which fluctuations in pressure and heart rate are coupled in a way that that indicates normal operation of the physiological baroreflex. Time periods where the baroreflex is controlling heart rate are labeled “on” states, and time periods where the baroreflex is not controlling heart rate are labeled “off” states. As used herein, “heart rate” and “pulse rate” are interchangeable as the rate of a subject's pulse is the subject's heart rate.",
                        "In an embodiment, an apparatus for characterizing the cardiovascular state in individuals includes a wearable sensor assembly configured to be attached to a subject or individual to measure blood pressure of the subject. In some embodiments the wearable sensor assembly may include a plurality of sensors configured to measure heart rate, blood pressure, blood-oxygen level, and other metrics of cardiovascular function. The apparatus further includes a processor configured to receive blood pressure data from the wearable sensor assembly, and perform time-series analysis on the received blood pressure data. The processor determines baroreflex functionality of the subject from the blood pressure data, and determines an indicator of cardiovascular disease state in the subject from the baroreflex activity.",
                        "In some examples, the processor is configured to compare the measured blood pressure data with a mathematical regression, or mathematical model of a baroreflex arc. In examples, the measure blood pressure data includes mean arterial pressure data, or the processor may be configured to process the received blood pressure data to determine a mean arterial pressure waveform.",
                        "In some examples, the processor determines the indicator of autonomic (or “neurogenic”) hypertension and may distinguish between different diagnoses in the subject based on the existence of a correlation relationship between fraction of time in the “off” baroreflex state and mean arterial pressure. In some examples, the processor determines the indicator of autonomic (or “neurogenic”) hypertension and may distinguish between different diagnoses in the subject based on differences in trends in mean arterial pressure during baroreflex “on” and “off” states.",
                        "In some examples, the processor determines the likelihood of development of hypertension in the subject based on the existence of a correlation relationship between fraction of time in the “off” baroreflex state and mean arterial pressure. The processor may determine an indicator of hypertension with the indicator being one of a likelihood of developing hypertension, a prediction of an onset of hypertension, an identification of etiology of hypertension, a prediction to a responsiveness of a treatment, or an identification of a dysfunction associated with autonomic regulation of heart rate.",
                        "In some examples, the processor may determine different physiological mechanisms indicative of a classification of hypertension which may provide insight into which types of therapies a patient may, or may not, respond to.",
                        "In some examples, the processor may perform statistical analysis of heart rate and blood pressure data to identify characteristics for diagnoses of dysfunctions of the autonomic nervous system such as the diagnosis and prediction of diabetes, severe preeclampsia, acute stroke, heart failure, chronic kidney disease, atherosclerosis, Parkinson's disease, depression, familial dysautonomia, chronic fatigue syndrome (CFS), and the postural orthostatic tachycardia syndrome (POTS).",
                        "In some examples, the processor determines the likelihood of development of hypertension in the subject based on differences in trends in mean arterial pressure during baroreflex “on” and “off” states.",
                        "In some examples, the processor, signal processor, or a plurality of processors and controller may be external to the wearable sensor assembly and communicatively connected to the wearable sensor assembly. The processors, and/or processors may each be in communication with the wearable sensor assembly through a wired or wireless connection. Additionally, the processor and/or processors may be configured to receive signals and data from the wearable sensor assembly, provide control signals, data, or information to the wearable sensor assembly (e.g., for calibration of sensors, firmware or sensor update information, etc.), or the processor and/or processors may be in two-way communication with the wearable sensor assembly."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce techniques for identifying pathologies",
                        "describe diagnosing hypertension",
                        "describe predicting onset of hypertensive disease",
                        "describe predicting optimal treatments",
                        "introduce computational analysis of time-series data",
                        "describe identifying baroreflex functionality",
                        "describe determining indicator of cardiovascular disease",
                        "describe comparing measured BP data with mathematical model",
                        "describe determining likelihood of developing hypertension"
                    ],
                    "num_characters": 4916,
                    "outline_medium": [
                        "identify pathologies of autonomic nervous system",
                        "diagnose hypertension associated with autonomic dysfunction",
                        "predict onset and progression of hypertensive disease",
                        "predict optimal treatments for patients"
                    ],
                    "outline_short": [
                        "introduce baroreflex analysis",
                        "outline applications of baroreflex analysis"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "The present techniques provide devices and methods for measuring and monitoring blood flow dependent measurements over a sensing region of a subject, such as over a finger, wrist, or other peripheral arterial region. Example devices include wearable sensor devices having two or more sensors of different types.",
                        "Physiological control of arterial blood pressure (BP) is achieved via the interaction of multiple organs and organ systems. The pressure waveforms in the systemic arteries are governed by the interactions between ventricular pumping and arterial mechanics, the ionotropic and chronotropic state of the heart, and the preloads driving filling of the left and right sides of the heart. These governing processes are, in turn, regulated by the autonomic nervous system and endocrine signals, notably the baroreflex and the renin-angiotensin-aldosterone system. Since each one of these systems—mechanical, autonomic, and endocrine—has a direct influence on the functions of the others, no single controller of arterial pressure nor single root cause of primary hypertension has been identified. Rather, just as the physiological control of blood pressure is a multifactorial systems-level phenomenon, it may be that the pathophysiology of hypertension is most generally understood as a multifactorial phenomenon. Moreover, because chronic increases in pressure can, in principle, both cause and be caused by mechanical remodeling and changes to autonomic and renal function, it is possible that many different primary insults affecting different systems could all drive the system toward the same multifactorial pathological phenotype.",
                        "The arterial baroreflex controls heart rate via a negative feedback system, where increases in arterial pressure cause decreases in heart rate and decreases in pressure cause increases in heart rate. Dysfunction of the autonomic systems associated with the baroreflex are associate with numerous diseases and disorders. Disclosed herein are methods for analyzing time-course arterial pressure data to identify and characterize a markedly intermittent functioning of the baroreflex arc. Applying this methodology to data from rats features of the intermittent nature of the baroreflex are identified which are useful in predicting hypertensive disease and in distinguishing different etiologies of disease in different rat models of hypertension. Also, the methods may be successfully applied to analyze arterial pressure time-series data obtained from human subjects, and the features identified in the data from animal models can be identified in the human data. Further, a wearable monitor for measuring physiological data may be used to perform the measurements of the arterial pressure and heart rate.",
                        "The disclosed system and method have the potential to be adopted for numerous health care applications. For example, when a patient is diagnosed with hypertension, physicians typically start treatment by prescribing medicine to determine how the patient reacts to the medicine and specifically if the medicine is effective in treating a patients form of hypertension. A patient may be prescribed a diuretic, an angiotensin-converting enzyme (ACE) inhibitor, an angiotensin II receptor blocker (ARB), a calcium channel blocker, an alpha blocker, an alpha-beta blocker, a beta blocker, an aldosterone antagonist, a renin inhibitor, a vasodilator, a central-acting agent, or another medication for medicating hypertension. Each medication, or combination of medications, prescribed are target different physiological mechanisms and the medication efficacy depends on the type of hypertension and specific cause of hypertension. Therefore, a number of trials of different medications is typically required before a proper diagnosis and prescription is found for a given hypertensive patient. It is therefore beneficial to know a classification of the hypertension to give insight into which medication is likely to be effective for a given hypertensive patient. The system and methods disclosed may allow for the classification of specific mechanisms of hypertension, and/or the ability to rule out specific types of classifications of hypertension which reduces the number of medication trials for a patient, and the amount of time and money spent for a proper diagnosis and treatment to be found. Further, the disclosed system and methods use non-perturbative techniques to determine indicators of hypertension.",
                        "FIG. 1 is an example schematic block diagram 800 illustrating the various components used in implementing an example embodiment of an autonomic baroreflex monitoring system discussed herein. A signal-processing device 802 (or “signal processor”) may be coupled to a patient 820 via one or more wearable sensors 816 (or a “wearable sensor assembly”) in accordance with executing the functions of the disclosed embodiments. The wearable sensor assembly having wearable sensors 802 may include a wrist band, an armband, a waist band, an ankle band, a head band, a patch that adheres to a patient, a watch, other jewelry with sensors, a garment, or another item that may be operatively coupled to a patient with sensors for measuring biometrics of the patient. The one or more wearable sensors 816 may be coupled to the patient via an elastic band, a Velcro band, an adhesive, a belt, or via a garment such as wearing a shirt or pants, among other means. Further, the wearable sensor assembly may be in physical contact with the patient, or the wearable sensor array may not be in direct physical contact with the patient, for example, by using optical sensors in a set of glasses.",
                        "The signal-processing device 802 may have a controller 804 operatively connected to the database 814 via a link 822 connected to an input/output (I/O) circuit 812. It should be noted that, while not shown, additional databases may be linked to the controller 804 in a known manner. The controller 804 includes a program memory 806, one or more processors 808 (may be called microcontrollers or a microprocessors), a random-access memory (RAM) 810, and the input/output (I/O) circuit 812, all of which are interconnected via an address/data bus 820. It should be appreciated that although only one processor 808 is shown, the controller 804 may include multiple microprocessors 808. Similarly, the memory of the controller 804 may include multiple RAMs 810 and multiple program memories 806. Although the I/O circuit 812 is shown as a single block, it should be appreciated that the I/O circuit 812 may include a number of different types of I/O circuits. The RAM(s) 810 and the program memories 806 may be implemented as semiconductor memories, magnetically readable memories, and/or optically readable memories, for example. A link 824, which may include one or more wired and/or wireless (Bluetooth, WLAN, etc.) connections, may operatively connect the controller 804 to a wearable sensor 816 through the I/O circuit 812. The wearable sensor 816 may be operatively connected to the patient 820. The wearable sensor 816 may include an optical heart rate sensor, a physical pressure sensor, an electrocardiography sensor, a photoplethysmography sensor, a sphygmomanometer, an inflatable cuff, a digital blood pressure monitor, or another sensor capable of measuring arterial pressure and/or pulse pressure.",
                        "The program memory 806 and/or the RAM 810 may store various applications (i.e., machine readable instructions) for execution by the processor 808. For example, an operating system 830 may generally control the operation of the signal-processing device 802 and provide a user interface to the signal-processing device 802 to implement the process 100 described herein. The program memory 806 and/or the RAM 810 may also store a variety of subroutines 832 for accessing specific functions of the signal-processing device 802. By way of example, and without limitation, the subroutines 832 may include, among other things: a subroutine for taking measurements with the wearable sensor 816, a subroutine for filtering measurement (or data) from the wearable sensor 816, a subroutine for performing signal decomposition on raw signal data from the wearable sensor 816, and a subroutine for extracting one or more features of a sensing region from the raw signal data from the wearable sensor 816. The subroutines 832 may also include other subroutines, for example, implementing software keyboard functionality, interfacing with other hardware in the signal-processing device 802, etc. The program memory 806 and/or the RAM 810 may further store data related to the configuration and/or operation of the signal-processing device 802, and/or related to the operation of the one or more subroutines 832. For example, the data may be data gathered by the wearable sensor 816, data determined and/or calculated by the processor 808, etc. In addition to the controller 804, the signal-processing device 802 may include other hardware resources. The signal-processing device 802 may also include various types of input/output hardware such as a visual display 826 and input device(s) 828 (e.g., keypad, keyboard, etc.). In an embodiment, the display 826 is touch-sensitive, and may cooperate with a software keyboard routine as one of the software routines 832 to accept user input. It may be advantageous for the signal-processing device 802 to communicate with a broader medical treatment network (not shown) through any of a number of known networking devices and techniques (e.g., through a commuter network such as an hospital or clinic intranet, the Internet, etc.). For example, the testing apparatus may be connected to a medical records database, hospital management processing system, health care professional terminals (e.g., doctor stations, nurse stations), patient monitoring systems, automated drug delivery systems such as smart pumps, smart infusion systems, automated drug delivery systems, etc. Accordingly, the disclosed embodiments may be used as part of an automated closed loop system or as part of a decision assist system.",
                        "Although depicted as separate entities or components in FIG. 1, it is understood that any or the entire signal processing functionality and/or components of the signal-processing device 802 may be combined with a wearable sensor assembly, such as the wearable sensor 816. In this manner, a wearable sensor may both gather data about the patient 820 and process the gathered data to extract one or more waveform features, as discussed further below.",
                        "Also, although depicted as a single component in FIG. 1, the wearable sensor 816 may include multiple of the same type or different types of sensors. For example, the wearable sensor 816 may include both a piezoelectric pressure sensor for measuring raw signal pressure data and a secondary sensor for collecting photoplethysmograph derived blood flow and hemoglobin oxygen saturation data. Generally, the wearable sensor 816 may include one or more piezoelectric sensors or electrodes. In some examples, the wearable sensor 816 may be implemented with one or more of a variety of other (or secondary) sensors, such as temperature sensors, motion sensors, actigraphy sensors, galvanic skin response sensors, impedance sensors, etc.",
                        "In some examples in which the wearable sensor 816 includes a secondary sensor for collecting photoplethysmograph derived blood flow data, the secondary sensor may provide (e.g., to a signal processing computer) a waveform that is flow related. The changes in the waveform may provide information related to the arterial tone at both the site of measure and, in some cases, more centrally (i.e., at a central artery such as the aorta and carotid arteries). When compared with central aortic pressure, peripheral arterial waveforms have higher systolic pressure, lower diastolic pressure, and greater pulse pressure, but despite differences between peripheral and central arterial waveforms, the mean arterial pressure (MAP) in the aorta is just slightly greater than MAP in the radial artery.",
                        "Changes in the waveform from the secondary sensor along with changes in a waveform from the piezoelectric sensor (amplitude, width, time differences in peaks, delta responses to provocative movements such as breathing, volume infusion, etc.) may provide complementary information about the patient as it relates to circulating vascular volumes and vascular tone. Thus, the ability to look at these two signals together allows for determining which components are responsible for changes and as well as how best to favorably affect changes, such as providing medications to tighten or relax arterial wall tone."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce devices and methods for measuring blood flow",
                        "describe wearable sensor devices",
                        "describe physiological control of arterial BP",
                        "describe multifactorial systems-level phenomenon",
                        "introduce arterial baroreflex",
                        "describe dysfunction of autonomic systems",
                        "describe methods for analyzing time-course arterial pressure data",
                        "apply methodology to data from rats",
                        "apply methodology to data from human subjects",
                        "describe wearable monitor for measuring physiological data",
                        "describe potential health care applications",
                        "describe classification of hypertension",
                        "describe medication efficacy",
                        "describe non-perturbative techniques",
                        "introduce autonomic baroreflex monitoring system",
                        "describe signal-processing device",
                        "describe wearable sensor assembly",
                        "describe controller and database",
                        "describe program memory and processor",
                        "describe RAM and I/O circuit",
                        "describe link to wearable sensor",
                        "describe operating system and subroutines",
                        "describe data related to configuration and operation",
                        "describe input/output hardware",
                        "describe communication with medical treatment network"
                    ],
                    "num_characters": 12674,
                    "outline_medium": [
                        "describe devices and methods for measuring blood flow",
                        "explain physiological control of arterial blood pressure",
                        "discuss multifactorial nature of hypertension",
                        "describe autonomic nervous system and baroreflex",
                        "analyze time-course arterial pressure data",
                        "identify intermittent functioning of baroreflex arc",
                        "apply methodology to rat models of hypertension",
                        "analyze arterial pressure time-series data from human subjects",
                        "describe wearable monitor for measuring physiological data",
                        "discuss potential health care applications",
                        "illustrate autonomic baroreflex monitoring system",
                        "describe signal-processing device and wearable sensor assembly"
                    ],
                    "outline_short": [
                        "describe autonomic nervous system regulation",
                        "introduce wearable sensor devices",
                        "explain baroreflex arc analysis",
                        "describe hypertension classification",
                        "outline system architecture",
                        "detail signal processing and analysis"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [
                        "A radio-telemetry system (PA-C10, Data Sciences International; St. Paul, Minn.) was used to collect real-time arterial pressure waveforms data. Seven days after implantation of the telemetry system, the arterial pressure was recorded for 5 minutes continuously (500.Hz) for the whole dark-cycle (6 pm-6 am). Data from spontaneously hypertensive rats (SHR) and Wistar-Kyoto (WKY) were recorded at 7 weeks, 10 weeks, and 15 weeks of age. Data from Sprague-Dawley (SD) animals were recorded at 8 weeks, 11 weeks, and 15 weeks. Data from salt-sensitive (SS) rats fed on high- and control fat diets were collected at 13 weeks and 20 weeks. Data from salt-sensitive (SR) rats fed on high fat diets were collected at 13 weeks. Vessel ultrasound was also performed to measure the elasticity of the aorta and carotid arteries at the same times.",
                        "Time-series analysis of the telemetry data is based on the assumption that when the baroreflex is operational, changes in arterial pressure should affect changes in heart rate: transient increases in mean and/or pulse pressure should be followed by proportional increases in pulse interval or RR interval, while transient decreases in pressure should be followed by proportional decreases in RR interval. A linear filter-based approach was used to distinguish time windows when the baroreflex is and is not functioning—that is, times when the expected relationship between pressure and heart rate does and does not exist.",
                        "Conscious blood pressure was recorded continuously during the active dark cycle (6 pm-6 am). One five-minute window of uncorrupted data from each one-hour block was analyzed for each animal at each age studied. Hence, a total of 12 individual five-minute time courses of pressure representative of each hour were collected of the 12-hour raw data for analysis. The five-minute periods were selected as close as possible to the middle of each hour. Systolic (SP) and diastolic (DP) pressures were taken as the local maxima and minima of the pulse pressure signal, and mean arterial pressure (MAP) was approximated at each cardiac cycle tj for j=1, N and N the total number of cardiac cycles in each five-minute period as",
                        "\\(\\begin{matrix}\n{{{MAP}\\left( t_{j} \\right)} = {\\left( {{S{P\\left( t_{j} \\right)}} + {2D{P\\left( t_{j} \\right)}}} \\right)/3.}} & (1)\n\\end{matrix}\\)",
                        "FIG. 2A shows two examples of plots of continuous five-minute time-course blood pressure data obtained from a WKY rat at 10 weeks. Data on R-R interval (RR(t), heart rate=1/RR) are compared to predictions from a linear filter to analyze the autonomic response to the Valsalva maneuver in human subjects. The model assumes that RR(t) determined by the autonomic baroreflex is captured by a first-order linear filter applied to the mean arterial pressure, MAP(t):",
                        "\\(\\begin{matrix}\n{{{\\tau\\frac{dRR}{dt}} + {R{R(t)}} - R_{0}} = {\\alpha MA{{P(t)}.}}} & (2)\n\\end{matrix}\\)",
                        "where α, , and R0 are parameters. An alternative mathematical model may be used and is likely to give equivalent results for the present applications, as long as the alternative model captures the central phenomenon that a change in blood pressure effects a proportional change in RR. Here, the parameter a represents the baroreflex sensitivity (measured in units of change in RR interval time per unit change in pressure). The parameter  is a time constant that determines how quickly change in BP will generate change in HR. The inverse 1/ is the response rate. Assuming a piecewise constant right-hand side of Equation (1) over an individual beat of duration Δt, the solution to Equation (1) is:",
                        "\\(\\begin{matrix}\n{{R{R\\left( t_{j} \\right)}} = {{R{R\\left( {t_{j - 1} - {\\Delta t}} \\right)}e^{- \\frac{\\Delta t}{\\tau}}} + {\\left( {1 - e^{- \\frac{\\Delta t}{\\tau}}} \\right){\\left( {{\\alpha MA{P\\left( {t_{j - 1} - {\\Delta t}} \\right)}} + R_{0}} \\right).}}}} & (3)\n\\end{matrix}\\)",
                        "For the rat data sets, each five-minute time course of BP data is analyzed separately. FIG. 1A shows two examples of continuous five-minute time-course pressure data obtained from a 10-wk WKY rat. Systolic (SP), diastolic (DP), and mean arterial (MAP) pressures and pulse intervals (RR) are extracted for each cardiac cycle in each record. Initial estimates of  and  are obtained by fitting the data to the linear filter model of Equations (1) and (2). The expected relationship between the parameter R0 and the gain  is used as a constraint:",
                        "\\(\\begin{matrix}\n{R_{0} = {\\left\\langle {RR} \\right\\rangle - {\\alpha{\\left\\langle {MAP} \\right\\rangle.}}}} & (3)\n\\end{matrix}\\)",
                        "where · indicates the average value over a given five-minute time course. This approach yields substantial variability in the ability of the model to match the data, as illustrated in FIG. 2B. This approach yields substantial variability in the ability of the model to match the data as illustrated in FIG. 2B, which shows example plots of the mathematical model fitting the pulse interval data well (left panel) and poorly (right panel).",
                        "The RR data are compared to the fits (solid red lines) to a simple mathematical model of the baroreflex arc in FIG. 2B. When the baroreflex is functioning, as in the left panels of FIG. 2A and 2B, transient reductions in MAP result in transient reductions in RR; transient peaks in MAP are followed by transient peaks in RR. The dynamic coupling between MAP and RR is reflected in a close match between the model and the data in the left panel of FIG. 2B. For the time window illustrated in the right panels of FIGS. 2A and 2B the MAP and RR interval are not coupled in a way that would be predicted by physiological operation of the baroreflex. For example, transient pressure increases are followed by transient increases in heart rate. The lack of physiological coupling of the baroreflex is reflected in the lack of a match between model simulations and data in the right panel of FIG. 2B. An assessment of the relatively bad fits suggests an intermittent engagement and disengagement of the baroreflex-mediated control of heart rate. At times the RR interval tends to be changing in the direction predicted by the model. These time periods are identified as times when the baroreflex arc is operating in an “on” state. Time periods when the model cannot be made to coincide with the data are identified as representing baroreflex “off” states. To identify and quantify time periods where the baroreflex is “on” or “off”, the change in RR interval over a fixed period Tis compared to the change in RR interval predicted by the model. For calculations shown here the period for comparison is set to T=10 seconds. Similar results are obtained when T is half or twice this value.",
                        "To determine the time constant τ and gain α for each subject a given age, the cost function (J) is minimized, and the relative difference in the variability of the heart rate between the model output and the data is calculated. The variability is quantified by computing the slope of the line of regression within a fixed window T centered at cardiac cycle tj during a five-minute time course i=1, . . . ,12 for both the model output (μm,i,j) and the data (μd,i,j). Thus μm,i,j and μd,i,j are unitless numbers reflecting the local rates of change in RR per unit time. Simultaneous fits are generated for all 12 five-minute data sets obtained from a given animal at a given age. T was chosen to be 10 seconds, though largely equivalent results are obtained when T is set to half or twice this value. The standard deviation of the slopes of the model output σm=std(μm) and data σd=std(μd) were computed for",
                        "\\(\\begin{matrix}\n{{\\mu_{m} = \\left\\lbrack {\\mu_{m,1,1},\\ldots\\mspace{14mu},\\ \\mu_{m,1,N},\\mu_{m,2,1},\\ldots\\mspace{14mu},\\mu_{m,2,N},\\ldots\\mspace{14mu},\\mu_{m,{12},1},\\ldots\\mspace{14mu},\\mu_{m,{12},N}} \\right\\rbrack},{and}} & (5) \\\\\n{\\mu_{d} = {\\left\\lbrack {\\mu_{d,1,1},\\ldots\\mspace{14mu},\\mu_{d,1,N},\\mu_{d,2,1},\\ldots\\mspace{14mu},\\ \\mu_{d,2,N},\\ldots\\mspace{14mu},\\ \\mu_{d,12,1},\\ldots\\mspace{14mu},\\ \\mu_{d,12,N}} \\right\\rbrack.}} & \\;\n\\end{matrix}\\)",
                        "Hence, the cost functional was minimized to obtain optimal parameter values for τ and α for each subject at each age.",
                        "\\(\\begin{matrix}\n{J = {{\\frac{\\sigma_{m}}{\\sigma_{a}} - 1}}} & (6)\n\\end{matrix}\\)",
                        "FIG. 2C shows plots of rate of change in RR interval expected from a functioning baroreflex (μm) versus the observed rate of change of RR interval (μd) for determining “on” and “off” states from the blood pressure time-course data. To compare the model predicted change in RR interval to the observed data and determine “on” and “off” states from the blood pressure time-course data, regions were located in the plot of the slopes μm versus μd in FIG. 2C for which the linear response model does not predict the observed response, that is, when the points lie away from the y=x line. The boundary for the “on” and “off” domains are demarcated by the hyperbola",
                        "\\(\\begin{matrix}\n{{\\mu_{m}^{2} + \\mu_{d}^{2} - {a\\mu_{m}\\mu_{d}}} = r^{2}} & (7)\n\\end{matrix}\\)",
                        "which is about y=x symmetry. The parameter r is the magnitude of the x- and y-intercepts and α is a parameter determining the curvature of the hyperbola. To exclude relatively small fluctuations in μ from being identified as representing “off” states, the parameter r is set to ⅕σd representing the 7-week WKY cohort. The unitless parameter α is set to a value of 4. The computed trends are not sensitive to the choice of α. In plotting μm versus μd. “On” states are determined to be indicated by points that fall inside the hyperbola (white region) bounded by the curves. Specifically, the on states are durations of time where the measured increases in arterial pressure are followed by increases in RR, and measured decreases in arterial pressure are followed by decreases in RR due to the action of the arterial baroreflex. The off states are durations where the relationship between arterial pressure and RR is not present (i.e., there is no discernible relationship between the trends of the arterial pressure and the RR). The points that lie outside the hyperbola (gray regions) are considered “off”. FIG. 2D shows plots of RR over time that that display the “on” and “off” states for the blood pressure time-course given in FIGS. 2A and 2B, which white shading representing “on” and gray shading representing “off”. FIG. 2E is a plot of the RR over time data presented in FIG. 2D with the noise filtered out, resulting in the final determinate of on and off states for these time windows.",
                        "We apply a smoothing procedure to filter out noise in the sequences of “on” and “off” designations. A cardiac cycle tj is initially assigned a value of 1 if it is “on” and 0 if it is “off”. The resulting time series is smoothed by iteratively computing the 10-second moving average of the data until the result converges. After smoothing, time points that are <0.5 are “off” and ≥0.5 are “on”. FIG. 1E illustrates the final “off” and “on” states after smoothing the results from FIG. 1D.",
                        "“On” fraction. We define the index “on” fraction as",
                        "\\(\\begin{matrix}\n{{{{``{On}\"}\\mspace{14mu}{fraction}} = \\frac{{Total}\\mspace{14mu}{time}\\mspace{14mu}{in}\\mspace{14mu}{``{on}\"}\\mspace{14mu}{state}}{{Total}\\mspace{14mu}{time}}},} & (8)\n\\end{matrix}\\)",
                        "which describes the fraction of time when an individual animal at a given age is in the “on” state. It may be determined that a hypertensive person or organism, and/or a person or organism that is susceptible to developing hypertension exhibits an “on” fraction below a threshold of 40%. The “on” fraction may decrease with age depending on health conditions of the person or organism. It may also be determined that the intermittent functioning of the baroreflex is one of multiple causes of developing hypertension in an individual or organism.",
                        "FIGS. 3A-3F and FIG. 4 summarize data on the relationships between baroreflex function, hypertension, and age. FIGS. 3A-3F presents multiple plots of blood pressure versus “on” fraction, and FIG. 4 is a table of numerical findings. The estimated baroreflex sensitivity is not found to be different between any of the strains or ages studied as shown by the table in FIG. 4. No correlations were found between baroreflex sensitivity and MAP, arterial mechanics, or age. However, the on fraction was found to decreasing with MAP and age (FIGS. 3A and 3D) in the SHR and WKY. In addition, the average on fraction was lower in the SHR than in the WKY, as shown in FIG. 3C. Combining the data on MAP and on fraction in WKY and SHR rats, it can be determined that the “on” fraction is a strong predictor of MAP and degree of hypertension.",
                        "Given that the SHR and WKY share similar origins and genetic background, the predictive relationship between on fraction and MAP was investigated to determine if the relationship is a universal phenomenon or unique to the SHR/WKY genetic background. FIGS. 3D and 3F are plots of MAP versus on fraction from analogous analysis performed on the SS, SR, and SD rats. FIG. 3D shows that results from conscious direct BP measurements in SD rats at 8, 11, and 15 weeks of ages show no significant relationship between MAP and on fraction. FIG. 3E shows that data from hypertensive SS rats (induced from high-fat feeding) and from normotensive control-diet SS rats also show no significant relationship between MAP on fraction. Finally, in FIG. 3F, data from normotensive SR rats on high-fat diet also show no such relationship. Thus among the animal models studied here, only the SHR and WKY strains show a predictive relationship between baroreflex on fraction and MAP.",
                        "To probe how “on” fraction affects BP regulation in the SHR/WKY model, probability density distributions of MAP observed during baroreflex on and off states were constructed. Each of the probability densities has a mean and variance which may be indicative of hypertension. For example, a wider distribution (i.e., larger variance), or a shift in the probability density (e.g., a larger or smaller mean) may be indicative of hypertension. Further, the indicator of hypertension may be determined by comparing probability densities of the on functionality durations, and the off functionality durations of blood pressure data. Comparing probability density functions may include comparing a mean, variance, skew, and/or a shape or profile of the probability density functions. Further, the indicator of hypertension may be determined by comparing a probability density function of a subject with a probability density function of normal or non-hypertensive baroreflex functionality.",
                        "FIG. 5A-5F shows plots of the probability densities of MAP measured at the per-beat level during on and off states in SHR, WKY, and SD strains at the three ages studied. In SHR and WKY animals the pressure distributions become wider with increased age, indicating larger fluctuations in pressure compared to younger animals. The widest distribution (most variable MAP) is observed for the 15-week SHR. FIGS. 5B, 5D, and 5F plot the average MAP values obtained during on and off times at different ages and in the different strains. MAP is the per-beat mean arterial pressure and thus fluctuates, as indicated in the figures. The average MAP is denoted <MAP>. In all rat strains and at all ages, the <MAP> is higher during baroreflex off times than it is during on times. However the observed difference in <MAP> between on and off times becomes greater than 1.6 mmHg only for the SHR and WKY groups at ages 10 and 15 weeks. In SD rats the difference in <MAP> is always less than 0.9 mmHg. FIGS. 5A and 5C show that similarly small differences are observed for the SS and SR animals studied.",
                        "FIGS. 6A-6G shows plots of time courses of MAP during the first 20 seconds of baroreflex on and off times in SHR, WKY, and SD rats at 15 weeks of age. Although there is a high degree of variability in the individual time courses of MAP, the average trend of FIG. 6A (solid black lines in the time-series figures) shows a clear increase with time during off times in the 15-week SHR rats. Similarly, in FIGS. 6B and 6D, there are clear decreases in the average trend during on times in the 15-week SHR and WKY animals. Overall, MAP tended to increase during the off state and tend to decrease when the baroreflex was on state both in the SHR and WKY, with statistically significant increases in MAP during the first 20 seconds of off times are observed for SHR rats at 10 and 15 weeks. Statistically significant decreases in MAP during the first 20 seconds of on times are observed for SHR rats at 7 weeks and WKY rats at 7 and 15 weeks. No significant trends are observed for SD rats at any age. FIG. 6G summarizes the changes in MAP observed during the initial 20 seconds of baroreflex on and off times.",
                        "Summarizing the results plotted in FIGS. 5A-5F, and 6A-6G: (i.) both the MAP and the MAP variability were higher during baroreflex “off” state than during the “on” state in only the SHR/WKY model; (ii.) during on and off times 20 s, the MAP tended to increase in the first 20 s during the “off” state and decrease during the “on” state only in the SHR/WKY model; (iii.) in the SHR, the amount that MAP decreases during the first 20 s of “on” states became smaller with age and the onset of the hypertensive phenotype, while the amount that MAP tends to increase in the “off” state increases with age.",
                        "FIG. 7 is a flow diagram of a method 700 of classifying hypertension in a subject. At block 702, the method 700 includes sensing the blood pressure of a subject. A wearable sensor assembly, according to embodiments described herein, may be used to measure the blood pressure of the subject. The sensor assembly generates a signal indicative of blood pressure data representing the sensed blood pressure. In examples, the blood pressure data may be indicative of a mean arterial pressure waveform. At block 704, the method 700 further includes obtaining the blood pressure data at a processor that is in communication with the wearable sensor array. The processor and wearable sensor assembly may be communicably coupled through any suitable wireless, or wired means. In examples, the processor may be included in the wearable sensor assembly, or the processor may be external and independent from the wearable sensor assembly.",
                        "At a block 706, the processor performs a time-series analysis on the blood pressure data and determines the baroreflex function from the blood pressure data at block 708. To determine the baroreflex function, the processor may determine on and off states of the baroreflex functionality, and further determine an on fraction of the baroreflex functionality by comparing the on and off states. At a block 710, the processor determines, from the baroreflex functionality, an indicator of hypertension in the subject. To determine the baroreflex functionality, the processor may compare the blood pressure data to a mathematical model of a baroreflex arc. In examples, the mathematical model may represent a typical hypertensive, or non-hypertensive, baroreflex arc. The processor may compare the determined on fraction to a threshold on fraction amount to determine the indicator of hypertension. Further, to determine the indicator of hypertension, the processor determine a probability density of the blood pressure data, and the processor may compare the probability density of the blood pressure data to probability density data of blood pressure for normal baroreflex functionality. For example, the probability density function may have a mean value that is indicative of a likelihood of developing hypertension. The probability density may have a variance that may be used to determine the indicator of hypertension.",
                        "The indicator of hypertension may include one or more of a likelihood of developing hypertension, a prediction of an onset of hypertension, an identification of etiology of hypertension (e.g.,, the underlying cause of the hypertension being neurogenic, renal, etc.), a prediction to a responsiveness of a treatment (e.g., prediction of a subjects responsiveness to a medication, or other type of treatment), or an identification of a dysfunction associated with autonomic regulation of heart rate such as an abnormally low on fraction (e.g., below 50%, below 40% or below another limit based on age and other factors). The indicator of hypertension may be a binary indication (e.g., an indicator of hypertension or non-hypertension), a probabilistic indication, a probability of hypertension in the future, a score, a classification, or another type of indicator.",
                        "In examples, the method 700 may further include sensing, by the wearable sensor assembly, the arterial pulse of the subject and the wearable sensor array may generate a signal indicative of pulse data representing the sensed pulse pressure. In examples, the pulse data may be continuous blood pressure data indicative of a blood pressure of the subject. The continuous blood pressure data may be obtained over night or during a period of time where the subject is asleep. The processor then obtains the pulse data from the wearable sensor assembly, further analyzes the pulse data, and determines the baroreflex functionality from the pulse data. In examples, the obtained pulse data may be data indicative of arterial pressure, systolic pressure, diastolic pressure, heart rate, pulse interval, or another measurable metric indicative of the arterial pulse and/or blood pressure of the subject.",
                        "FIG. 8 is a flow diagram of a method 850 for identifying characteristics for diagnosis of dysfunctions of the autonomous nervous system in a subject. The method 850 may be perform by an apparatus as described herein, including a wearable sensor assembly. At a block 852, a signal processor receives blood pressure and heart rate data from the wearable sensor assembly. At a block 854, the signal processor performs statistical analysis on the blood pressure and heart rate data, and determines from the blood pressure and heart rate data, periods of baroreflex on and baroreflex off times at block 856. The baroreflex on times are periods of time when the baroreflex is determined to be controlling the heart rate of the subject, and the baroreflex off times are periods of times when it is determined that the baroreflex is not controlling the heart rate of the subject.",
                        "At a block 858, the processor identifies trends of blood pressure during the baroreflex on and/or off times, and at a block 860 the processor identifies trends of heart rate during the baroreflex on and/or off times. The processor then determines baroreflex functionality from the baroreflex on and off times at block 862. To determine the baroreflex functionality, the processor may compare the baroreflex on and off times to determine a baroreflex on fraction. At a block 864, the processor identifies characteristics to use for diagnosis of dysfunctions of the autonomous nervous system of the subject. The characteristics may be identified from one or more of the identified trends of blood pressure, the identified trends of heart rate, and the determined baroreflex function.",
                        "The described methods and systems have the ability to identify relatively long time periods, lasting on the order of several minutes, during which the baroreflex system is, and is not, operating in a manner in which fluctuations in arterial pressure are coupled to corresponding fluctuations in heart rate. With the techniques herein, the “on” fraction metric distinguishes between different etiologies of disease in different rat models of hypertension. The “on” fraction metric may therefore be useful in distinguishing between different etiologies of hypertensive disease in humans. Statistical trends in arterial pressure during “on” versus “off” states provide additional classifiers of etiology and are shown to be predictive of the development of hypertension of specific etiologies in animal models. The method and associated algorithms may therefore prove useful in predicting future development of hypertensive disease in humans. Further, the “on” fraction may predict the responsiveness to carotid baroreceptor stimulation (CBS) therapy in patients with resistant hypertension. Thus, the disclosed methods and systems may be used in early diagnosis and prediction of diabetes, severe preeclampsia, acute stroke, heart failure, chronic kidney disease, atherosclerosis, Parkinson's disease, depression, familial dysautonomia, chronic fatigue syndrome (CFS), and the postural orthostatic tachycardia syndrome (POTS).",
                        "Throughout this specification, plural instances may implement components, operations, or structures described as a single instance. Although individual operations of one or more methods are illustrated and described as separate operations, one or more of the individual operations may be performed concurrently, and nothing requires that the operations be performed in the order illustrated. Structures and functionality presented as separate components in example configurations may be implemented as a combined structure or component. Similarly, structures and functionality presented as a single component may be implemented as separate components. These and other variations, modifications, additions, and improvements fall within the scope of the subject matter herein.",
                        "Additionally, certain embodiments are described herein as including logic or a number of routines, subroutines, applications, or instructions. These may constitute either software (e.g., code embodied on a machine-readable medium or in a transmission signal) or hardware. In hardware, the routines, etc., are tangible units capable of performing certain operations and may be configured or arranged in a certain manner. In example embodiments, one or more computer systems (e.g., a standalone, client or server computer system) or one or more hardware modules of a computer system (e.g., a processor or a group of processors) may be configured by software (e.g., an application or application portion) as a hardware module that operates to perform certain operations as described herein.",
                        "In various embodiments, a hardware module may be implemented mechanically or electronically. For example, a hardware module may comprise dedicated circuitry or logic that is permanently configured (e.g., as a special-purpose processor, such as a field programmable gate array (FPGA) or an application-specific integrated circuit (ASIC)) to perform certain operations. A hardware module may also comprise programmable logic or circuitry (e.g., as encompassed within a general-purpose processor or other programmable processor) that is temporarily configured by software to perform certain operations. It will be appreciated that the decision to implement a hardware module mechanically, in dedicated and permanently configured circuitry, or in temporarily configured circuitry (e.g., configured by software) may be driven by cost and time considerations.",
                        "Accordingly, the term “hardware module” should be understood to encompass a tangible entity, be that an entity that is physically constructed, permanently configured (e.g., hardwired), or temporarily configured (e.g., programmed) to operate in a certain manner or to perform certain operations described herein. Considering embodiments in which hardware modules are temporarily configured (e.g., programmed), each of the hardware modules need not be configured or instantiated at any one instance in time. For example, where the hardware modules comprise a general-purpose processor configured using software, the general-purpose processor may be configured as respective different hardware modules at different times. Software may accordingly configure a processor, for example, to constitute a particular hardware module at one instance of time and to constitute a different hardware module at a different instance of time.",
                        "Hardware modules can provide information to, and receive information from, other hardware modules. Accordingly, the described hardware modules may be regarded as being communicatively coupled. Where multiple of such hardware modules exist contemporaneously, communications may be achieved through signal transmission (e.g., over appropriate circuits and buses) that connects the hardware modules. In embodiments in which multiple hardware modules are configured or instantiated at different times, communications between such hardware modules may be achieved, for example, through the storage and retrieval of information in memory structures to which the multiple hardware modules have access. For example, one hardware module may perform an operation and store the output of that operation in a memory device to which it is communicatively coupled. A further hardware module may then, at a later time, access the memory device to retrieve and process the stored output. Hardware modules may also initiate communications with input or output devices, and can operate on a resource (e.g., a collection of information).",
                        "The various operations of the example methods described herein may be performed, at least partially, by one or more processors that are temporarily configured (e.g., by software) or permanently configured to perform the relevant operations. Whether temporarily or permanently configured, such processors may constitute processor-implemented modules that operate to perform one or more operations or functions. The modules referred to herein may, in some example embodiments, comprise processor-implemented modules.",
                        "Similarly, the methods or routines described herein may be at least partially processor-implemented. For example, at least some of the operations of a method may be performed by one or more processors or processor-implemented hardware modules. The performance of certain of the operations may be distributed among the one or more processors, not only residing within a single machine, but also deployed across a number of machines. In some example embodiments, the processor or processors may be located in a single location (e.g., within a home environment, an office environment or as a server farm), while in other embodiments the processors may be distributed across a number of locations.",
                        "The performance of certain of the operations may be distributed among the one or more processors, not only residing within a single machine, but also deployed across a number of machines. In some example embodiments, the one or more processors or processor-implemented modules may be located in a single geographic location (e.g., within a home environment, an office environment, or a server farm). In other example embodiments, the one or more processors or processor-implemented modules may be distributed across a number of geographic locations.",
                        "Unless specifically stated otherwise, discussions herein using words such as “processing,” “computing,” “calculating,” “determining,” “presenting,” “displaying,” or the like may refer to actions or processes of a machine (e.g., a computer) that manipulates or transforms data represented as physical (e.g., electronic, magnetic, or optical) quantities within one or more memories (e.g., volatile memory, non-volatile memory, or a combination thereof), registers, or other machine components that receive, store, transmit, or display information.",
                        "As used herein any reference to “one embodiment” or “an embodiment” means that a particular element, feature, structure, or characteristic described in connection with the embodiment is included in at least one embodiment. The appearances of the phrase “in one embodiment” in various places in the specification are not necessarily all referring to the same embodiment.",
                        "Some embodiments may be described using the expression “coupled” and “connected” along with their derivatives. For example, some embodiments may be described using the term “coupled” to indicate that two or more elements are in direct physical or electrical contact. The term “coupled,” however, may also mean that two or more elements are not in direct contact with each other, but yet still co-operate or interact with each other. The embodiments are not limited in this context.",
                        "As used herein, the terms “comprises,” “comprising,” “includes,” “including,” “has,” “having” or any other variation thereof, are intended to cover a non-exclusive inclusion. For example, a process, method, article, or apparatus that comprises a list of elements is not necessarily limited to only those elements but may include other elements not expressly listed or inherent to such process, method, article, or apparatus. Further, unless expressly stated to the contrary, “or” refers to an inclusive or and not to an exclusive or. For example, a condition A or B is satisfied by any one of the following: A is true (or present) and B is false (or not present), A is false (or not present) and B is true (or present), and both A and B are true (or present).",
                        "In addition, use of the “a” or “an” are employed to describe elements and components of the embodiments herein. This is done merely for convenience and to give a general sense of the description. This description, and the claims that follow, should be read to include one or at least one and the singular also includes the plural unless it is obvious that it is meant otherwise.",
                        "This detailed description is to be construed as an example only and does not describe every possible embodiment, as describing every possible embodiment would be impractical, if not impossible. One could implement numerous alternate embodiments, using either current technology or technology developed after the filing date of this application."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "collect arterial pressure waveforms data",
                        "record data from different rat strains",
                        "perform vessel ultrasound",
                        "analyze telemetry data",
                        "apply linear filter-based approach",
                        "select five-minute windows of data",
                        "extract systolic, diastolic, and mean arterial pressures",
                        "extract pulse intervals",
                        "fit data to linear filter model",
                        "obtain initial estimates of parameters",
                        "use constraint to estimate R0",
                        "compare model fits to data",
                        "identify times when baroreflex is on or off",
                        "calculate cost function",
                        "minimize cost function",
                        "compute standard deviation of slopes",
                        "plot rate of change in RR interval",
                        "determine on and off states",
                        "apply smoothing procedure",
                        "filter out noise",
                        "define on fraction",
                        "plot relationships between baroreflex function and hypertension",
                        "plot relationships between baroreflex function and age",
                        "summarize data on baroreflex sensitivity",
                        "analyze relationships between on fraction and MAP",
                        "analyze relationships between on fraction and age",
                        "discuss predictive relationship between on fraction and MAP",
                        "introduce examples of BP regulation in SHR/WKY model",
                        "construct probability density distributions of MAP",
                        "analyze probability density distributions",
                        "compare probability density functions",
                        "determine indicator of hypertension",
                        "plot probability densities of MAP",
                        "analyze MAP values during on and off times",
                        "compare MAP values between on and off times",
                        "plot time courses of MAP",
                        "analyze trends of MAP during on and off times",
                        "summarize results of MAP analysis",
                        "introduce method of classifying hypertension",
                        "sense blood pressure of subject",
                        "obtain blood pressure data",
                        "perform time-series analysis on blood pressure data",
                        "determine baroreflex function",
                        "determine on fraction of baroreflex functionality",
                        "determine indicator of hypertension",
                        "compare blood pressure data to mathematical model",
                        "determine probability density of blood pressure data",
                        "compare probability density to normal baroreflex functionality",
                        "identify characteristics of hypertension",
                        "introduce method of identifying characteristics of dysfunctions",
                        "receive blood pressure and heart rate data",
                        "perform statistical analysis on blood pressure and heart rate data",
                        "determine baroreflex on and off times",
                        "identify trends of blood pressure during on and off times",
                        "identify trends of heart rate during on and off times",
                        "determine baroreflex functionality",
                        "identify characteristics for diagnosis of dysfunctions",
                        "discuss ability to identify etiologies of disease",
                        "discuss predictive capabilities of method",
                        "discuss potential applications of method",
                        "discuss hardware and software implementation",
                        "discuss configuration of hardware modules",
                        "discuss communication between hardware modules",
                        "discuss processor-implemented modules",
                        "discuss distribution of operations among processors",
                        "discuss geographic distribution of processors",
                        "provide general statements about embodiments"
                    ],
                    "num_characters": 33686,
                    "outline_medium": [
                        "collect arterial pressure waveforms data",
                        "perform time-series analysis of telemetry data",
                        "apply linear filter-based approach to distinguish baroreflex on/off states",
                        "extract systolic, diastolic, and mean arterial pressures and pulse intervals",
                        "fit data to linear filter model of baroreflex arc",
                        "compare model fits to data to identify baroreflex on/off states",
                        "quantify variability in heart rate between model output and data",
                        "minimize cost function to determine time constant and gain",
                        "identify on/off states from blood pressure time-course data",
                        "apply smoothing procedure to filter out noise in on/off designations",
                        "define on fraction as fraction of time in on state",
                        "analyze relationships between baroreflex function, hypertension, and age",
                        "summarize data on baroreflex function, hypertension, and age",
                        "present examples of hypertension regulation",
                        "analyze probability density distributions of MAP",
                        "describe plots of probability densities of MAP",
                        "summarize results of MAP analysis",
                        "introduce method of classifying hypertension",
                        "describe sensing of blood pressure",
                        "describe obtaining blood pressure data",
                        "perform time-series analysis on blood pressure data",
                        "determine baroreflex function from blood pressure data",
                        "determine indicator of hypertension",
                        "describe optional sensing of arterial pulse",
                        "describe method for identifying characteristics of autonomous nervous system dysfunction",
                        "receive blood pressure and heart rate data",
                        "perform statistical analysis on blood pressure and heart rate data",
                        "identify trends of blood pressure and heart rate",
                        "determine baroreflex functionality",
                        "identify characteristics for diagnosis of dysfunctions",
                        "describe use of \"on\" fraction metric",
                        "discuss implementation of hardware modules",
                        "provide general information on patent application structure"
                    ],
                    "outline_short": [
                        "collect arterial pressure waveforms data",
                        "perform time-series analysis of telemetry data",
                        "develop linear filter-based approach to distinguish baroreflex on/off states",
                        "estimate baroreflex sensitivity and time constant using mathematical model",
                        "identify and quantify baroreflex on/off states using cost function minimization",
                        "analyze relationships between baroreflex function, hypertension, and age",
                        "present examples of hypertension regulation",
                        "analyze probability density distributions of MAP",
                        "describe method of classifying hypertension",
                        "determine baroreflex function from blood pressure data",
                        "identify characteristics for diagnosis of dysfunctions",
                        "describe apparatus for identifying characteristics",
                        "discuss hardware and software implementation",
                        "explain communicative coupling of hardware modules",
                        "describe processor-implemented modules",
                        "provide general information on embodiments"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An apparatus comprising:\na wearable sensor assembly attachable to a subject, and comprising a sensor that measures continuous blood pressure data of the subject, the continuous blood pressure data indicative of a blood pressure of the subject;\na signal processor configured to:\nreceive the continuous blood pressure data from the wearable sensor assembly;\nperform time-series analysis on the continuous blood pressure data and determine, from the continuous blood pressure data, one or more durations of baroreflex on functionality and baroreflex off functionality; and\ndetermine an indicator of hypertension from the one or more durations of baroreflex on functionality and baroreflex off functionality.",
        "2. The apparatus of claim 1, wherein the continuous blood pressure data comprises arterial pressure data and heart rate data of the subject; and\nwherein to determine the one or more durations of baroreflex on functionality, the signal processor is configured to identify durations of time in the continuous blood pressure data wherein the blood pressure data and the heart rate data are correlated; and\nwherein to determine the one or more durations of baroreflex off functionality, the signal processor is configured to identify durations of time in the continuous blood pressure data wherein the blood pressure data and the heart rate data are non correlated.",
        "3. The apparatus of claim 1, wherein to determine the indicator of hypertension in the subject from the baroreflex functionality, the signal processor is configured to:\ndetermine a total amount of time of baroreflex on functionality from the one or more durations of baroreflex on functionality;\ndetermine a total amount of time of the baroreflex off functionality from the one or more durations of baroreflex off functionality;\ndetermine an on fraction of the baroreflex functionality, wherein the on fraction is a ratio of the total amount of time of baroreflex on functionality and the a total amount of time of the baroreflex off functionality;\nand compare the on fraction of baroreflex on functionality to a range of values of baroreflex on functionality, wherein the indication of hypertension is determined from whether the on fraction of baroreflex functionality is within the range of values or outside of the range of values.",
        "4. The apparatus of claim 1, wherein to determine the indicator of hypertension in the subject from the one or more durations of baroreflex on functionality and baroreflex off functionality, the signal processor is configured to:\nidentify one or more trends in the continuous blood pressure data during the durations of the baroreflex on functionality; and\ndetermine the indicator of hypertension from the one or more identified trends.",
        "5. The apparatus of claim 1, wherein to determine the indicator of hypertension in the subject from the one or more durations of baroreflex on functionality and baroreflex off functionality, the signal processor is configured to:\nidentify one or more trends in the continuous blood pressure data during the durations of the baroreflex off functionality; and\ndetermine the indicator of hypertension from the one or more identified trends.",
        "6. The apparatus of claim 1, wherein to determine the indicator of hypertension in the subject from the one or more durations of baroreflex functionality, the signal processor is configured to:\ndetermine a first probability density of the continuous blood pressure data during the one or more durations of baroreflex on functionality, the first probability having a mean of the data in the durations of baroreflex on functionality, a variance of the data in the durations of baroreflex on functionality, and a probability density profile;\ndetermine a second probability density of the continuous blood pressure data during the one or more durations of baroreflex off functionality, the second probability density having a mean of the data in the durations of baroreflex off functionality, and a variance of the data in the durations of baroreflex off functionality, and a probability density profile; and\ndetermine the indicator of hypertension by comparing the first probability density and the second probability density.",
        "7. The apparatus of claim 6, wherein comparing the first probability density and the second probability density comprises one of comparing the mean of the first probability density and the mean of the second probability density, comparing the variance of the first probability density and the variance of the second probability density, comparing the probability density profile of the first probability density and the probability profile of the second probability density.",
        "8. The apparatus of claim 6, wherein determining the indicator of hypertension further comprises determining the indicator of hypertension by comparing one of the first probability density profile or second probability density profile with a probability density profile of normal baroreflex functionality.",
        "9. The apparatus of claim 1, wherein the indicator of hypertension is one of a likelihood of developing hypertension, a prediction of an onset of hypertension, an identification of etiology of hypertension, a prediction to a responsiveness of a treatment, or an identification of a dysfunction associated with autonomic regulation of heart rate.",
        "10. The apparatus of claim 1, wherein the blood pressure data comprises mean arterial pressure waveform data.",
        "11. The apparatus of claim 1, wherein the wearable sensor assembly comprises at least one of an optical heart rate sensor, a physical pressure sensor, a transducer, an invasive catheter, an electrocardiography sensor, a photoplethysmography sensor, a sphygmomanometer, an inflatable cuff, or a digital blood pressure monitor.",
        "12. A method for classification of hypertension comprising:\nsensing, by a wearable sensor assembly having a sensor, continuous blood pressure data of a subject, wherein the continuous blood pressure data is indicative of a blood pressure of the subject;\nobtaining, by a processor in communication with the wearable sensor assembly, the continuous blood pressure data;\nperforming, by the processor, time-series analysis on the continuous blood pressure data and determining, by the processor and from the continuous blood pressure data, one or more durations of baroreflex on functionality and baroreflex off functionality; and\ndetermining, by the processor, an indicator of hypertension from the one or more durations of baroreflex on functionality and baroreflex off functionality.",
        "13. The method of claim 12, wherein the continuous blood pressure data comprises arterial pressure data and heart rate data of the subject; and\nwherein determining the one or more durations of baroreflex on functionality, comprises identifying durations of time in the continuous blood pressure data wherein the blood pressure data and the heart rate data are correlated; and\nwherein to determining the one or more durations of baroreflex off functionality, comprises identifying durations of time in the continuous blood pressure data wherein the blood pressure data and the heart rate data are non correlated.",
        "14. The method of claim 12, wherein determining the indicator of hypertension in the subject from the baroreflex functionality comprises:\ndetermining, by the processor, a total amount of time of baroreflex on functionality from the one or more durations of baroreflex on functionality;\ndetermining, by the processor, a total amount of time of the baroreflex off functionality from the one or more durations of baroreflex off functionality;\ndetermining, by the processor, an on fraction of the baroreflex functionality, wherein the on fraction is a ratio of the total amount of time of baroreflex on functionality and the a total amount of time of the baroreflex off functionality;\nand comparing, by the processor, the on fraction of baroreflex on functionality to a range of values of baroreflex on functionality, wherein the indication of hypertension is determined from whether the on fraction of baroreflex functionality is within the range of values or outside of the range of values.",
        "15. The method of claim 12, wherein to determining the indicator of hypertension in the subject from the one or more durations of baroreflex on functionality and baroreflex off functionality comprises:\nidentifying, by the processor, one or more trends in the continuous blood pressure data during the durations of the baroreflex on functionality; and\ndetermining, by the processor, the indicator of hypertension from the one or more identified trends.",
        "16. The method of claim 12, wherein determining the indicator of hypertension in the subject from the one or more durations of baroreflex on functionality and baroreflex off functionality comprises:\nidentifying, by the processor, one or more trends in the continuous blood pressure data during the durations of the baroreflex off functionality; and\ndetermining, by the processor, the indicator of hypertension from the one or more identified trends.",
        "17. The method of claim 12, wherein determining the indicator of hypertension in the subject from the one or more durations of baroreflex functionality comprises:\ndetermining, by the processor, a first probability density of the continuous blood pressure data during the one or more durations of baroreflex on functionality, the first probability having a mean of the data in the durations of baroreflex on functionality, a variance of the data in the durations of baroreflex on functionality, and a probability density profile;\ndetermining, by the processor, a second probability density of the continuous blood pressure data during the one or more durations of baroreflex off functionality, the second probability density having a mean of the data in the durations of baroreflex off functionality, and a variance of the data in the durations of baroreflex off functionality, and a probability density profile; and\ndetermining, by the processor, the indicator of hypertension by comparing the first probability density and the second probability density.",
        "18. The method of claim 12, wherein the indicator of hypertension is one of a likelihood of developing hypertension, a prediction of an onset of hypertension, an identification of etiology of hypertension, a prediction to a responsiveness of a treatment, or an identification of a dysfunction associated with autonomic regulation of heart rate.",
        "19. The method of claim 12, wherein the blood pressure data comprises mean arterial pressure waveform data.",
        "20. The method of claim 12, wherein the wearable sensor assembly comprises at least one of an optical heart rate sensor, a physical pressure sensor, a transducer, an invasive catheter, an electrocardiography sensor, a photoplethysmography sensor, a sphygmomanometer, an inflatable cuff, or a digital blood pressure monitor."
    ]
}