{
    "id": "https://semopenalex.org/work/W2001651232",
    "authors": [
        "Stephen R. Wilson",
        "Krishan Kumar",
        "Zhiguo Zhou",
        "Christopher L. Kepley",
        "Robert Lenk",
        "Anthony Dellinger",
        "Darren K. MacFarland"
    ],
    "title": "Fullerene nanomaterials potentiate hair growth",
    "date": "2009-06-01",
    "abstract": "Hair loss is a common symptom resulting from a wide range of disease processes and can lead to stress in affected individuals. The purpose of this study was to examine the effect of fullerene nanomaterials on hair growth. We used shaved mice as well as SKH-1 bald mice to determine if fullerene-based compounds could affect hair growth and hair follicle numbers. In shaved mice, fullerenes increase the rate of hair growth as compared with mice receiving vehicle only. In SKH-1 hairless mice fullerene derivatives given topically or subdermally markedly increased hair growth. This was paralleled by a significant increase in the number of hair follicles in fullerene-treated mice as compared with those mice treated with vehicle only. The fullerenes also increased hair growth in human skin sections maintained in culture. These studies have wide-ranging implications for those conditions leading to hair loss, including alopecia, chemotherapy, and reactions to various chemicals.",
    "sections": [
        {
            "title": "Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Materials",
                    "paragraphs": [
                        "All mice (8-week-old males) were purchased from Charles River Laboratories (Wilmington, Massachusetts) and humanely treated under standard conditions. All studies were approved by the Institutional Review Board at Hamner Institute of Health Science (Research Triangle Park, North Carolina). Mice (C57/B6) were shaved on the interscapular part of the back. To examine the induction of hair growth we also used SKH-1 mice (nude), which are euthymic and immune competent. SKH-1 hairless mice were chosen for the study, because they provide a background on which changes in hair growth and follicle number can be easily assessed. SKH-1 mice lose all external hair in their first hair cycle after birth, so that all the tested mice are in the same stage of the hair growth cycle. The presence of a small number of hair follicles in telogen phase was observed histologically, as has been described elsewhere in these mice. 9 Fullerene derivatives (a general structure is given in Figure 1) were synthesized and characterized using matrix-assisted laser desorption ionization mass spectrometry, nuclear magnetic resonance, and high performance liquid chromatography. A description of the synthesis and characterization is described elsewhere (unpublished data). The fullerene derivatives or controls, in phosphate-buffered saline (PBS), were injected intradermally using a 0.4-mL tuberculin syringe. Alternatively, fullerene derivatives were applied topically in dimethyl sulfoxide (DMSO), or di ethylene glycol monomethyl ether (DGME) on the interscapular part of the mouse back (using a 0.5-mL syringe) every other day for up to 14 days. After photodocumentation, mice were killed and the skin and hair were removed from the test area, fixed in 4% paraformaldehyde, and sectioned for histochemical analysis using hematoxylin and eosin (H&E). The number of hair follicles per square millimeter was quantitated by light microscopy by a blinded observer. For studies with human skin, tissue was obtained anonymously by the Cooperative Human Tissue Network (CHTN; Charlottesville, Virginia). All studies were exempt and approved by the Institutional Review Committee at CHTN. Samples were cut into 1-cm 2 sections, so that the epidermis, dermis, and subcutis remained intact together. Triplicate sections were placed in 1 mL of Ex-Vivo (Lonza, Walkersville, Maryland; with penicillin/streptomycin and l-glutamine) with or without 10 μg/mL of fullerene for 14 days, with fresh medium added every fourth day. After removing any subcutaneous adipose tissue, sections were placed on slides and coverslips pressed down over the skin so as to minimize the section thickness. Hair numbers were quantitated and photo documented using a 4× objective lens and counting the number of hairs per square centimeter. Adjacent sections from before and after treatment were fixed in 4% paraformaldehyde and H&E slides obtained for hair follicle quantitation."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Results",
            "paragraphs": [
                "Although fullerenes have certain intrinsic properties that make them attractive candidates for therapeutic development, they are not water soluble and they nonspecifically accumulate within cells. We developed several amphiphilic fullerenes that are hypothesized to target intracellular membranes to test in preclinical hair growth models. We first tested the fullerene derivatives for their ability to affect hair growth on mice that had been shaved bald in the interscapular part of the back. Mice were injected with fullerenes or vehicle only subcutaneously every other day for up to 14 days. As seen in Figure 2, A and B, mice injected with fullerene derivatives had accelerated hair growth as compared with those mice receiving vehicle only. The effects of fullerene derivatives on mice genetically deficient in hair follicle formation and hair was also examined. As seen in Figure 2, C and D, mice injected every other day had significantly more hair strands as compared with those mice injected with vehicle only. Similar results were obtained using the same compound dissolved in DMSO (Figure 2, E andF). This enhancement was paralleled by a marked increase in the number of hair follicles within the dermis (Figure 3, A and B compared to Figure 3, C andD). Quantification of the number of hair follicles in treated vs. nontreated animals revealed a statistically significant increase in fullerene-treated mice when given intradermally (Figure 4, A) or topically (Figure 4,B). Thus, fullerenes not only accelerate the rate at which hair shafts grow but also induce de novo synthesis of new hair follicles.    2 and the number of hair follicles counted using microscopy by an observer blinded to the content of the injections. The results represent the average number of hair follicles per square millimeter in treated (black box) and untreated (white box) mice (±SEM). Significance was determined using the Student's t-test.",
                "To determine if the fullerene could induce hair growth from human skin, we incubated human skin sections in medium with or without fullerenes. As seen in Figure 5, there was a significant increase in the number of hairs visualized in the skin sections incubated for 14 days with fullerenes as compared with those sections incubated in medium alone. Thus, fullerene derivatives stimulate hair growth in human skin. "
            ],
            "subsections": []
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The loss of hair is a widespread problem in both women and men that can cause emotional stress and low self-esteem for affected individuals. Although the vast majority of hair loss is due to underlying genetic predispositions, several other factors can accelerate the process. Certain illnesses or a major surgery, hormonal problems, overactive or underactive thyroid disease, certain medicines, and infections can all lead to hair loss. The problem is that there are limited effective treatments that can prevent hair loss and induce new hair growth. In this report we show that fullerene derivatives can accelerate hair strand growth and induce new hair follicles within the dermis in mice with genetically underlying factors that limit hair follicle numbers and hair growth. Thus, these compounds may represent a new way to treat hair loss.",
                "As with minoxidil (Rogaine) and finasteride (Propecia), the only two hair loss treatments approved by the US Food and Drug Administration, it is unclear how fullerenes induce hair growth. In animal studies, minoxidil shortens telogen, causing premature entry of resting hair follicles into anagen, and causes prolongation of anagen, thus increasing hair follicle size. 10 Finasteride is an anti-androgen that inhibits human type 2 5α-reductase and decreases the formation of dihydrotestosterone from testosterone. However, neither minoxidil nor finasteride seems to have any significant effect on hair follicle numbers in hairless mice and human scalp tissue. 11,12,13 In contrast, we have discovered a new way in which hair follicles can be induced de novo. As seen above, the fullerene derivatives described here significantly increase the number of hair follicles in the skin.",
                "Oxidative stress through the production of reactive oxygen species (ROS) is thought to be a significant underlying factor in aging and has been shown to be present in human hair. 14,15 Intriguingly, the continuous melanin synthesis in the growing (anagen) hair follicle generates high oxidative stress, which leads to their selective premature aging and apoptosis. In addition, a direct correlation between hair loss and oxidative stress has been implied in studies of patients with alopecia. 16 The fullerene core can react with free-radical species given its capacity to absorb electrons and disperse them through the 20 benzene rings distributed over its surface. In fact, it is one of the most potent free-radical scavengers known, with the potential for being \"sponges\" in diseases involving ROS, 5 making them attractive therapeutic options in acute and chronic neurodegenerative diseases such as Parkinson's, Alzheimer's, and Lou Gehrig's, which involve ROS. 7,17,18 We recently showed that fullerenes can prevent allergic responses in vitro and in vivo, probably through the inhibition of ROS. 8 Thus, it is possible that fullerenes prevent the oxidative stress associated with hair follicle degradation. We are currently investigating the mechanisms of how fullerenes induce hair regeneration.",
                "There is little evidence to suggest that the mouse hair cycle differs structurally in any way from the human hair follicle cycle. 19 Indeed, we demonstrate that fullerenes induce hair growth in human skin, suggesting that the mechanism that potentiates hair growth in mice is similar to that in humans. Thus, we predict the results presented here will translate into new ways to induce hair growth in the approximately 20% to 50% of individuals in whom minoxidil and finasteride have no effect. 13,20,21,22 "
            ],
            "subsections": []
        }
    ]
}