{
    "id": "https://semopenalex.org/work/W2143684129",
    "authors": [
        "Marco Mor",
        "Daniele Piomelli",
        "Giorgio Tarzia",
        "Roberto Russo",
        "Andrea G. Hohmann",
        "Ana Guijarro",
        "Andrea Duranti",
        "Antonio Calignano",
        "Andrea Tontini",
        "Federica Vacondio",
        "Jason R. Clapper",
        "Jessica Marie Spradley",
        "Guillermo Moreno-Sanz",
        "Silvano Sanchini",
        "Natale R. Sciolino"
    ],
    "title": "Anandamide suppresses pain initiation through a peripheral endocannabinoid mechanism",
    "date": "2010-09-19",
    "abstract": "The authors have developed a new inhibitor of the enzyme that degrades the endocannabinoid anandamide. This new drug does not cross the blood-brain barrier. It elevates peripheral anandamide only, which, acting on peripheral CB1 receptors, attenuates pain responses in rodents. Peripheral cannabinoid receptors exert a powerful inhibitory control over pain initiation, but the endocannabinoid signal that normally engages this intrinsic analgesic mechanism is unknown. To address this question, we developed a peripherally restricted inhibitor (URB937) of fatty acid amide hydrolase (FAAH), the enzyme responsible for the degradation of the endocannabinoid anandamide. URB937 suppressed FAAH activity and increased anandamide levels outside the rodent CNS. Despite its inability to access brain and spinal cord, URB937 attenuated behavioral responses indicative of persistent pain in rodent models of peripheral nerve injury and inflammation and prevented noxious stimulus–evoked neuronal activation in spinal cord regions implicated in nociceptive processing. CB1 cannabinoid receptor blockade prevented these effects. These results suggest that anandamide-mediated signaling at peripheral CB1 receptors controls the access of pain-related inputs to the CNS. Brain-impenetrant FAAH inhibitors, which strengthen this gating mechanism, might offer a new approach to pain therapy.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Pain perception can be effectively controlled by neurotransmitters that operate within the CNS. This modulation has been well characterized in the dorsal horn of the spinal cord, where impulses carried by nociceptive (pain-sensing) fibers are processed before they are transmitted to the brain. In addition to these central mechanisms, intrinsic control of pain transmission can occur at terminals of afferent nerve fibers outside the CNS. One prominent example of peripheral regulation is provided by the endogenous opioids, which are released from activated immune cells during inflammation and inhibit pain initiation by interacting with opioid receptors localized on sensory nerve endings 1,2 .",
                "Endocannabinoid mediators might serve an analogous function to that of the opioids, because pharmacological activation of peripheral CB 1 and CB 2 cannabinoid receptors inhibits pain-related behaviors [3][4][5][6][7] while genetic disruption of CB 1 receptor expression in primary nociceptive neurons exacerbates such behaviors 8 . Moreover, there is evidence that clinical conditions associated with neuropathic pain or inflammation are accompanied by peripheral elevations in the levels of the endocannabinoid anandamide (e.g., complex regional pain syndrome and arthritis) 9,10 . Another major endocannabinoid transmitter, 2arachidonoylglycerol (2-AG), has also been implicated in nociceptive signaling outside the CNS 8,11 .",
                "Although these findings suggest that the endocannabinoid system serves an important function in the peripheral regulation of nociception, they offer no definitive insight on the identity of the endogenous ligand, or ligands, involved in this function. Filling this gap is essential, however, to both define the molecular underpinnings of intrinsic mechanisms controlling pain initiation and to discover new analgesic agents devoid of unwanted central effects. In the present study, we describe a potent brain-impenetrant inhibitor of the anandamide-degrading enzyme FAAH, and use this drug to magnify the actions of peripheral anandamide and unmask its possible role in the control of pain initiation 12 ."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Discovery of a peripherally restricted FAAH inhibitor",
                    "paragraphs": [
                        "Current FAAH inhibitors readily cross the blood-brain barrier 12 . To produce inhibitors with restricted access to the CNS, we added chemical groups of varying polarity to the proximal phenyl ring of the brain-permeant O-arylcarbamate URB597 13,14 (Table 1, 1a), in a position where small-sized hydrophilic substituents are not expected to impair biological activity 15 . The new compounds had comparable potencies when tested in membrane preparations of rat brain FAAH, and were equally effective at blocking liver FAAH activity when administered systemically in mice (1 mg-kg -1 , intraperitoneal, i.p.) (Table 1, compounds 1b-1f). They markedly differed, however, in their ability to access the CNS. In particular, the phydroxyphenyl derivative URB937 (Table 1, 1b) suppressed FAAH activity in peripheral tissues of mice and rats, yet failed to affect FAAH activity in the brain (Table 1, Supplementary Table 1). A dose-exploration study in mice showed that the median effective dose (ED 50 ) of URB937 for FAAH inhibition in brain (40 mg-kg -1 , subcutaneous, s.c.) was 200 times higher than the ED 50 for FAAH inhibition in liver (0.2 mg-kg -1 , s.c.) (Fig. 1a). Moreover, after systemic administration, URB937 (1 mg-kg -1 , i.p.) distributed rapidly in blood and liver, but remained undetectable in brain tissue (Fig. 1b). As seen with other Oarylcarbamates, which are known to interact with FAAH through a covalent mechanism 13,16 , URB937 inhibited peripheral FAAH activity in vivo both rapidly and lastingly (Supplementary Figure 1)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mechanism of peripheral segregation",
                    "paragraphs": [
                        "Because of its lipophilicity, URB937 should passively diffuse into the CNS unless this diffusion process is actively countered (distribution coefficient, LogD oct,pH7.4 : URB937, 3.03±0.01; CNS-penetrant inhibitor, URB597, 3.71±0.01; mean±s.e.m, n = 3). To test these alternative possibilities, we determined the permeability and efflux ratios of URB937 through polarized monolayers of human epithelial TC7 cells, which express various protein transporters involved in the extrusion of drugs from the brain 17 . URB937 did not equally distribute across the apical (A) and basal (B) compartments of TC7 monolayers, as would be expected of a lipophilic molecule moving by passive diffusion. Rather, the compound accumulated into the A compartment [permeability, in nm-s -1 (% recovery) A-B, 38 (83%); B-A, 371 (95%); efflux ratio, 9.8; mean of 2 independent experiments]. This result suggests that URB937 might be extruded from the CNS. Supporting this interpretation, injection of URB937 into the lateral cerebral ventricles of rats (0.01-0.1 mg-kg -1 ) was followed by appearance of the compound in peripheral blood (Fig. 1c) and concurrent inhibition of FAAH activity in liver (Fig. 1d). Conversely, systemic administration of a 250 times higher dose of URB937 (25 mg-kg -1 , i.p.) had no effect on brain FAAH activity (Fig. 1e), which was markedly reduced by a low dose of the CNS-penetrant inhibitor URB597 (1 mg-kg -1 , i.p.) (Fig. 1e).",
                        "To gain insight into the transport mechanism involved in the extrusion of URB937 from the CNS, we administered various inhibitors of drug transport across the blood-brain barrier, together with a systemic dose of URB937 that did not achieve brain penetration (25 mgkg -1 , i.p.). Treatment with Ko-143 (10 mg-kg -1 , i.p.) -an inhibitor of the ATP-binding cassette transporter, breast cancer resistance protein (BCRP) 17 -markedly increased access of URB937 to the brain (Fig. 1e). A similar effect was obtained with 2,6-dichloro-4nitrophenol 18 , which blocks the sulfate conjugation required for BCRP-mediated transport of xenobiotics 19 (Fig. 1e). By contrast, administration of other drug-transport inhibitorsincluding verapamil, probenecid and rifampicin 17 -was ineffective (Fig. 1e). The results suggest that URB937 is exported from the CNS by a transport system that is pharmacologically indistinguishable from BCRP. The molecular identification of such system will require, however, additional experimentation."
                    ],
                    "subsections": []
                },
                {
                    "title": "Enhancement of peripheral anandamide signaling",
                    "paragraphs": [
                        "Administration of URB937 (1 mg-kg -1 , i.p.) in mice increased anandamide levels in peripheral tissues, but not forebrain or hypothalamus (Fig. 1f, Supplementary Figure 2a). This effect was caused by selective inhibition of FAAH activity because (i) it was accompanied by elevations of other FAAH substrates, such as palmitoylethanolamide (PEA) 20 (Fig. 1f); and (ii) it was not observed in mutant FAAH-deficient mice 21 (Fig. 1g). Importantly, URB937 did not affect monoacylglycerol lipase activity in vitro (median inhibitory concentration, IC 50 , >100 μM; n = 3) or alter tissue levels of its endocannabinoid substrate, 2-AG, in vivo (Supplementary Figure 2b)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Modulation of visceral pain",
                    "paragraphs": [
                        "Current FAAH inhibitors attenuate behavioral responses to noxious stimuli in rodents, a property that is generally attributed to their ability to augment anandamide signaling in brain and spinal cord 12,13 . To test whether peripheral anandamide contributes to these actions, we examined the effects of URB937 on nocifensive responses evoked by acetic acid injection into the peritoneal cavity of mice. Subcutaneous administration of URB937 reduced acetic acid-induced writhing with an ED 50 of 0.1 mg-kg -1 (Fig. 2a and data not shown). This effect was (i) comparable in efficacy to those elicited by CNS-penetrant FAAH inhibitor URB597 and cyclooxygenase inhibitor indomethacin (each at 1 mg-kg -1 , s.c.) (Fig. 2a); (ii) correlated with the degree of peripheral FAAH inhibition (Pearson correlation coefficient, r = 0.96, Fig. 2b); and (iii) absent in mutant FAAH-deficient mice, compared to their wildtype littermates (Fig. 2c). The antinociceptive effect of URB937 was blocked by the selective CB 1 antagonists rimonabant and AM251, but not by the CB 2 antagonist AM630 (each at 1 mg-kg -1 , s.c.) (Fig. 2d). Although anandamide can activate vanilloid type-1 transient receptor potential (TRPV-1) channels 22 , URB937 evoked no detectable nocifensive behavior when administered alone (Fig. 2a), which suggests that the tissue concentrations reached by endogenous anandamide following peripheral FAAH inhibition are insufficient to engage TRPV-1 channels.",
                        "Treatment with URB937 elevated tissue levels of PEA (Fig. 1f), an endogenous peroxisome proliferator-activated receptor-α (PPAR-α) agonist that acts synergistically with anandamide to attenuate pain responses in rodents 3,23,24 . Co-administration of PPAR-α antagonist MK-886 (1 mg-kg -1 , s.c.) or genetic disruption of PPAR-α prevented the effects of URB937 in mice (Fig. 2d,e). We interpret these findings to indicate that URB937 inhibits acetic acidinduced pain responses through a mechanism that requires both anandamide-dependent activation of CB 1 receptors and PEA-dependent activation of PPAR-α."
                    ],
                    "subsections": []
                },
                {
                    "title": "Modulation of neuropathic and inflammatory pain",
                    "paragraphs": [
                        "We next asked whether URB937 might influence persistent pain caused by nerve damage or inflammation. We produced peripheral nerve injury in mice by loosely tying the left sciatic nerve 25 . A single dose of URB937 (1 mg-kg -1 , i.p., 2 h before testing), administered one week after surgery, attenuated thermal hyperalgesia and suppressed mechanical hyperalgesia and mechanical allodynia on the operated side (Fig. 3a-c). Notably, this response was not accompanied by changes in the reactivity to cutaneous stimuli applied to the non-operated side, indicating that URB937 normalized mechanical and thermal thresholds altered by nerve injury, rather than exerting a generalized antinociceptive action (Fig. 3a-c). This conclusion was further supported by the lack of activity of URB937 in the hot-plate test (Supplementary Figure 3). As previously shown for URB597 26 , subchronic treatment with URB937 (1 mg-kg -1 , i.p.) once daily for 7 days, starting 3 days after nerve ligation, elicited a set of analgesic effects that were indistinguishable from those caused by single drug dosing (Fig. 3d-f). Moreover, such effects were completely blocked by rimonabant, but not by AM630 (Fig. 3g-i) or MK886 (each at 1 mg-kg -1 , s.c.) (Supplementary Figure 4).",
                        "In another group of mice, we induced peripheral inflammation by injecting the polysaccharide carrageenan into one of the hind paws. This resulted in the development of mechanical and thermal hyperalgesia as well as local edema (Fig. 4). A single systemic injection of URB937 (1 mg-kg -1 , i.p.), administered at the same time as carrageenan, decreased mechanical and thermal hyperalgesia, assessed 4 h and 24 h following carrageenan treatment (Fig. 4a,b). URB937 also reduced mechanical allodynia measured 24 h after carrageenan (Fig. 4c). Similar results were obtained when treating mice with the CNS-permeant inhibitor URB597 (1 mg-kg -1 , i.p.) (Supplementary Figure 5). The antihyperalgesic effects of URB937 were restricted to the inflamed paws (Supplementary Figure 6) and were prevented by rimonabant, but not by AM630 (Fig. 4a-c) or MK886 (Supplementary Figure 7) (each at 1 mg-kg -1 , i.p.). Moreover, URB937 reversed paw edema 24 h after carrageenan injection through a mechanism that was sensitive to both CB 1 and CB 2 receptor blockade (Fig. 4d). Subchronic treatment with URB937 (1 mg-kg -1 , i.p., once daily for 3 days) was effective at inhibiting carrageenan-induced pain and edema (Supplementary Figure 8). Together, the results indicate that URB937 alleviates neuropathic and inflammatory pain in mice through a mechanism that primarily depends on the activation of peripheral CB 1 receptors by endogenously produced anandamide."
                    ],
                    "subsections": []
                },
                {
                    "title": "Modulation of spinal nociceptive processing",
                    "paragraphs": [
                        "To determine whether URB937 alters the central processing of nociceptive inputs, we measured spinal cord expression of Fos protein, a marker of neuronal activity, in a model of persistent pain produced by administration of formalin into the dorsal hind paw of rats. Formalin elicited a marked nocifensive response, which was attenuated by co-injection of URB937 (1 mg-kg -1 , i.p.). The drug reduced formalin-induced pain behavior relative to vehicle, the CB 1 antagonist rimonabant (2 mg-kg -1 , i.p.), or a combination of rimonabant and URB937 (Fig. 5a). Further analyses revealed that (i) URB937 decreased the area under the curve of formalin-induced pain behavior, compared to all other treatment groups (Supplementary Figure 9a); and (ii) this effect was due to a reduction in the late phase (Phase 2) of the formalin response (Fig. 5b, Supplementary Figure 9b), during which ongoing primary afferent fiber activity is accompanied by inflammation and central sensitization of spinal nociceptive circuits 27,28 .",
                        "URB937 lowered the Fos response to formalin in spinal cord regions implicated in nociceptive processing (Fig. 5c-e), namely the superficial (lamina I,II) and neck regions of the dorsal horn (lamina V, VI) (Fig. 5f). To a lesser extent, URB937 also suppressed Fos protein expression in the nucleus proprius (lamina III, IV) and ventral horn (Fig. 5f). These effects were prevented by the CB 1 antagonist rimonabant (2 mg-kg -1 , i.p.), which did not significantly alter Fos levels when administered without URB937 (Fig. 5f). The ability of URB937 to modulate spinal nociceptive processing, despite its lack of CNS penetration, suggests that peripheral FAAH inhibition attenuates pain-related inputs before they enter the spinal cord."
                    ],
                    "subsections": []
                },
                {
                    "title": "Effects on food intake and spontaneous locomotion",
                    "paragraphs": [
                        "Cannabinoid receptor agonists stimulate feeding through both central and peripheral mechanisms 29 . As previously shown for the CNS-penetrant FAAH inhibitor URB597 14 , administration of URB937 (1 mg-kg -1 , i.p., 30 min before dark) did not alter daily food intake, feeding pattern (latency to feed, meal frequency, satiety ratio) or spontaneous locomotor activity in mice (Supplementary Figure 10)."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The compound URB937, which we disclose in the present study, is a potent FAAH inhibitor that does not readily enter the CNS and thus interrupts anandamide deactivation only in peripheral tissues. Despite this restricted range of action, URB937 causes marked antinociceptive effects in rodent models of acute and persistent pain, which are prevented by cannabinoid CB 1 receptor blockade. These findings suggest that inhibition of peripheral FAAH activity magnifies an endogenous analgesic mechanism, mediated by anandamide, which regulates the transmission of emerging pain signals to the spinal cord and the brain.",
                "We hypothesize that peripheral anandamide acts as a diffuse paracrine signal to modulate the intensity of pain stimuli as they arise in damaged tissues. Two lines of evidence support this idea. Firstly, signals generated by inflammation and neural injury can trigger the local production and release of anandamide. For example, membrane depolarization and activation of TRPV-1 channels each stimulates anandamide formation in cultures of sensory neurons 30 , while activation of Toll-like receptor 4 causes a similar effect in macrophages 31 . These signals, and likely others that remain to be identified, may contribute to the elevations in peripheral anandamide documented in animal models of spinal nerve injury and inflammation 8,11 as well as in painful human conditions such as complex regional pain syndrome 9 and arthritis 10 . Secondly, CB 1 receptors are broadly distributed throughout mammalian tissues and organs. In particular, they are expressed in primary sensory neurons of heterogeneous sizes and are transported to peripheral nerve endings 32,33 . There, CB 1 receptor activation may be both necessary to maintain normal pain thresholds 8 and sufficient to exert marked antinociceptive effects 3,6 . CB 1 receptors present on pain-sensing terminals may mediate the analgesic and anti-inflammatory actions of locally produced anandamide through their inhibitory influence on the release of excitatory neuropeptides 34 . Other receptors are likely to contribute, along with CB 1 , to anandamide signaling in response to injury. Two candidates are CB 2 and PPAR-α, which are present in immune cells and peripheral sensory neurons, and act synergistically with CB 1 to reduce pain 3,23,24,35,36 . Our results suggest, indeed, that CB 1 receptors cooperate both with PPAR-α, to modulate visceral pain in the acetic acid model, and with CB 2 , to reduce edema in the carrageenan model. Importantly, however, CB 1 receptors appear to play an exclusive role in mediating the analgesic effects of URB937 in models of neuropathic and inflammatory pain.",
                "Mutant mice in which FAAH expression is selectively disrupted in non-neuronal cells, but is preserved in peripheral and central neurons, display a striking phenotype in which normal nociceptive transmission is accompanied by reduced responsiveness to pro-inflammatory triggers 37 . A plausible explanation for this finding is that the signaling activity of anandamide at peripheral nociceptive neurons is influenced by FAAH localized to the nociceptors themselves, rather than to neighboring non-neural cells. This view is consistent with the observation that peripheral axotomy induces FAAH expression in large-sized sensory neurons of the dorsal root ganglia, a response that is expected to extend the colocalization of FAAH with CB 1 receptors and thus enhance the ability of this enzyme to terminate anandamide signaling 38 .",
                "Direct activation of peripheral cannabinoid receptors causes profound analgesic effects in experimental models of pain 2,39 . Our findings indicate that significant analgesia can also be obtained by magnifying the intrinsic activity of an anandamide-based signaling system involved in the dynamic regulation of nociceptive homeostasis outside the CNS. These findings offer new insights into the intrinsic control of pain and might be exploited therapeutically to develop analgesic agents devoid of central side effects."
            ],
            "subsections": []
        },
        {
            "title": "Materials and Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Synthesis of FAAH inhibitors",
                    "paragraphs": [
                        "A description of the synthetic procedures is found in the Supplementary Methods section."
                    ],
                    "subsections": []
                },
                {
                    "title": "Drug distribution coefficients",
                    "paragraphs": [
                        "We determined Log D values at room temperature (25±1°C) partitioning the solutes between n-octanol and an aqueous solution buffered at pH 7.4 40 ."
                    ],
                    "subsections": []
                },
                {
                    "title": "Enzyme assays",
                    "paragraphs": [
                        "We conducted standard FAAH and monoacylglycerol lipase assays as described 15,41 , using as substrates [ 3 H]-anandamide (American Radiolabeled Chemicals, Inc., St. Louis, MO) and 2-oleoyl-sn-glycerol (Nu-Check Prep, Elysian, MN), respectively."
                    ],
                    "subsections": []
                },
                {
                    "title": "Drug transport assays",
                    "paragraphs": [
                        "Assays were performed at Cerep Inc. (Redmond, WA), following protocols outlined in the Supplementary Methods section.      "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Acknowledgments",
            "paragraphs": [
                "We thank Emmanuel Dotsey for help with experiments. This research was supported by grants from the National Institutes on Drug Abuse (to D.P. and A.G.H.), the University of Parma (to M.M.), and the Italian Ministry for Public Education, University and Research (MIUR) (to G.T. A.D and A.T.). Guillermo Moreno-Sanz was partially supported by the Fulbright Commission and the Exchange Abroad Program, University of California. The support of the Agilent Foundation is gratefully acknowledged."
            ],
            "subsections": [
                {
                    "title": "Tissue analyses",
                    "paragraphs": [
                        "We performed tissue extractions and liquid chromatography/mass spectrometry analyses of endocannabinoids as described 42 . Procedures for tissue extraction and quantification of URB937 are detailed in Supplementary Methods."
                    ],
                    "subsections": []
                },
                {
                    "title": "Surgery",
                    "paragraphs": [
                        "We performed sciatic nerve ligations in male Swiss Webster mice, as previously described for rats 25 with minor modifications 26 . Cannula implantation for i.c.v. infusions is described in Supplementary Methods."
                    ],
                    "subsections": []
                },
                {
                    "title": "Behavioral tests",
                    "paragraphs": [
                        "We measured nocifensive responses elicited by i.p. injection of acetic acid in male Swiss Webster and C57Bl/6 (wild-type, FAAH-deficient, PPAR-α-deficient) mice 43 , intraplantar injection of carrageenan in male Swiss Webster mice 20 , intraplantar injection of formalin in male Sprague-Dawley rats 44 , and sciatic nerve ligation in male Swiss Webster mice 26 ."
                    ],
                    "subsections": []
                },
                {
                    "title": "Fos expression",
                    "paragraphs": [
                        "We measured Fos protein levels by quantitative immunocytochemistry 5 on slices of lumbar (L4/L5) spinal cord from the same rats used for the formalin test."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Supplementary Material",
            "paragraphs": [
                "Refer to Web version on PubMed Central for supplementary material."
            ],
            "subsections": []
        }
    ]
}