{
    "id": "US20160220603",
    "authors": [
        "Jenny J. Yang",
        "Jason Y. Jiang"
    ],
    "title": "MODULATING DRUG EFFECTS AGAINST METABOTROPIC GLUTAMATE RECEPTOR WITH EXTRACELLULAR CALCIUM",
    "date": "2014-09-15 00:00:00",
    "abstract": "Disclosed are methods for modulating the activity of an orthosteric or allosteric drug on a group I metabotropic glutamate receptor (mGluR) by increasing or decreasing the levels of extracellular Ca2+.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [
                        "The eight subtypes of metabotropic glutamate receptors (mGluRs) belong to family C G protein-coupled receptors (GPCRs) and possess a large extracellular domain (ECD), seven transmembrane domains (TMD) and cytosolic C-terminal tail. The mGluRs are widely expressed in the central nervous system and play critical roles in regulating neuronal excitability and synaptic plasticity at both excitatory and inhibitory synapses (Neyman, S., et al. (2008) The European journal of neuroscience 27:1345-1352). Extensive structural studies have revealed that the endogenous agonist, L-Glutamate (L-Glu), the major excitatory neurotransmitter in the central nervous system, binds at the hinge region of the ECD within the receptor's Venus Fly Trap (VFT) motif to activate the protein. This subsequently stimulates phospholipase C (PLC) and leads to accumulation of inositol trisphosphate (IP3) and an increase of intracellular calcium concentration ([Ca2+]i) (Lavreysen, H., et al. (2003) Molecular pharmacology 63:1082-1093; Lindsley, C. W., et al. (2004) Journal of medicinal chemistry 47:5825-5828; Kubo, Y., et al. (1998) Science 279:1722-1725).",
                        "In recent years, mGluRs have received increasing interest as potential drug targets for the treatment of a range of psychiatric and neurological diseases (Whang, P. G., et al. (2008) Orthopedics 31(10)) (FIG. 1). The ligands targeting mGluRs can be classified as orthosteric agonists and antagonists as well as allosteric modulators. Orthosteric agonists and antagonists induce and attenuate, respectively, the activity of the receptor by competitively binding to the L-Glu binding pocket. L-Quisqualate (L-Quis), the most potent agonist of mGluR1 reported to date (Yuan, K., et al. (2011) J Biol Chem 286:24776-24784; Chen, Y., et al. (2011) The Biochemical journal 435:711-722), has been speculated to share nearly the same binding pocket as L-Glu (Levant, J. A., et al. (1973) The New England journal of medicine 289:555-558; Sato, T., et al. (2003) J Biol Chem 278:4314-4321). In contrast, (S)-α-Methyl-4-carboxyphenylglycine (“(s)-MCPG”) is an analog of L-Glu and a non-selective competitive antagonist that has been shown to occupy the L-Glu binding pocket, thereby blocking the function of group I/II members in the mGluR family (Tsuchiya, D., et al. (2002) Proc Natl Acad Sci USA. 99:2660-2665). On the other hand, allosteric modulators bind to sites other than the orthosteric center to affect the activity of the receptor. The molecule (9H-xanthene-9-carbonyl) carbamic acid butyl ester (“Ro 67-4853”) is a positive allosteric modulator (PAM) of mGluR1 that enhances the potency of L-Glu by interacting with the TMDs of the receptor. The molecule (−)-ethyl (7E)-7-hydroxyimino-1,7a-dihydrocyclopropa[b]chromene-1a-carboxylate (“CPCCOEt”) is a negative allosteric modulator (NAM) that inhibits the activation of mGluR1 by L-Glu by specifically binding to a site residing at the third extracellular loop of mGluR1α (Nagar, B., et al. (1996) Nature 380:360-364)."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce metabotropic glutamate receptors",
                        "describe receptor structure",
                        "explain receptor function",
                        "discuss ligands and their effects",
                        "mention potential therapeutic applications",
                        "provide background references"
                    ],
                    "num_characters": 3008,
                    "outline_medium": [
                        "introduce metabotropic glutamate receptors",
                        "describe structure and function",
                        "discuss ligands and modulators"
                    ],
                    "outline_short": [
                        "introduce metabotropic glutamate receptors"
                    ]
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Disclosed are methods for modulating the activity of an orthosteric or allosteric drug on a group I metabotropic glutamate receptor (mGluR), such as mGluR1, mGluR5, or a combination thereof, by increasing or decreasing extracellular Ca2+. The orthosteric or allosteric drugs can be an agonists, antagonists, or allosteric regulators. Also disclosed is a method for treating a disease or disorder in a subject that is fully or partially mediated by a group I mGluRs.",
                        "Selective pharmacological antagonists and/or negative allosteric modulators of group I mGluRs are potential therapeutic agents for the treatment of numerous disorders of the central nervous system (CNS), including depression, anxiety, drug addiction, chronic pain, Fragile X syndrome (FXS), autism spectrum disorders (ASD), Parkinson's disease, and gastroesophageal reflux disease. Moreover, agonists and positive allosteric modulators (PAMs) of group I mGluRs are potential therapeutic agents for the treatment of other CNS disorders, including schizophrenia, cognitive deficits associated with chronic drug use, and deficits in extinction learning. Therefore, these activities can be enhanced by increasing extracellular Ca2+.",
                        "The method can involve administering to the subject an orthosteric agonist, orthosteric antagonist, or allosteric modulator of one or more group I mGluRs (such as those set forth in Table 1A or 1B). The method can further involve administering to the subject a calcium agent for increasing or decreasing extracellular Ca2+ levels in an amount to modulate the activity of the orthosteric agonist, orthosteric antagonist, or allosteric modulator. Therefore, in some embodiments, the orthosteric agonist, orthosteric antagonist, or allosteric modulator may be administered at a dosage below its normally effective dosage (ED) if administered with the calcium agent. For example, the orthosteric agonist, orthosteric antagonist, or allosteric modulator may be administered in an amount that is at least 10, 20, 30, 40, 50, 60, 70, 80, or 90% below its normal ED50.",
                        "In some aspects of the disclosed method, the orthosteric agonist, orthosteric antagonist, or allosteric modulator is formulated with the calcium agent in a single dosage unit. Therefore, also disclosed is a composition comprising an orthosteric agonist, orthosteric antagonist, or allosteric modulator of one or more mGluRs (referred to collectively herein as “mGluR orthosteric or allosteric drug”), in combination with a calcium agent. This composition can contain the mGluR orthosteric or allosteric drug and the calcium agent in amounts and ratios sufficient to provide an effective dose to promote or inhibit mGluR activity. It is understood that the amount of calcium agent in the composition can affect the amount of mGluR orthosteric or allosteric drug needed for an effective dose. Optimal amounts and ratios can therefore be determined empirically for each combination and intended use.",
                        "In some embodiments, the calcium agent is a food or calcium supplement. In some embodiments, the calcium agent is a neurotransmitter or amino acid that affects sensitivity of the mGluR to calcium. In some embodiments, the calcium agent is a neurotransmitter that promotes calcium release from cellular calcium stores. In some embodiments, the calcium agent is an electric or mechanical stimulation.",
                        "The details of one or more embodiments of the invention are set forth in the accompanying drawings and the description below. Other features, objects, and advantages of the invention will be apparent from the description and drawings, and from the claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce method for modulating mGluR activity",
                        "describe orthosteric and allosteric drugs",
                        "mention potential therapeutic applications",
                        "introduce method for treating diseases",
                        "describe administering calcium agents",
                        "discuss dosage and formulation",
                        "mention composition and optimal amounts"
                    ],
                    "num_characters": 3612,
                    "outline_medium": [
                        "disclose methods for modulating mGluR activity",
                        "describe therapeutic applications",
                        "outline composition and administration"
                    ],
                    "outline_short": [
                        "modulate mGluR activity with calcium"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Like other members of the family of C GPCRs, such as the calcium-sensing receptor (CaSR), mGluR1α senses [Ca2+]o using the extracellular domain (Huang, Y., et al. (2009) Biochemistry 48:388-398; Huang, Y., et al. (2007) J Biol Chem 282:19000-19010). mGluR1-mediated activation of Ca2+-activated Cl− channels is modulated by [Ca2+]o in addition to L-Glu (Kubo, Y., et al. (1998) Science 279:1722-1725). Purkinje cells from mGluR1 knockout mice lose sensitivity to [Ca2+]o, with this sensitivity to [Ca2+]o being restored after mGluR1 was genetically reintroduced into the mice (Tabata, T., et al. (2002) Mol Cell Neurosci 20:56-68). There are sparse reports of [Ca2+]o affecting the action of various classes of compounds acting on mGluRs (Suzuki, Y., et al. (2004) J Biol Chem 279:35526-35534). However, it was not clear how [Ca2+]o is able to modulate the activity of mGluR1 or the actions of various mGluR1 ligands, and no Ca2+-binding sites have been identified in the 15 structures solved by X-ray crystallography to date.",
                        "Using a recently developed computational algorithm, a [Ca2+]o-binding site was identified within the hinge region of the ECD of mGluR1α, adjacent to the reported L-Glu-binding site (Wang, X., et al. (2009) Proteins 75:787-798; Wang, X., et al. (2010) Protein science: a publication of the Protein Society 19:1180-1190). It is comprised of D318, E325, D322, and the carboxylate side chain of the natural agonist, L-Glu. The carboxylate side chains of both L-Glu and D318 are involved in both L-Glu- and [Ca2+]o-binding. A mutagenesis study indicated that binding of L-Glu and Ca2+ to their distinct but partially-overlapping binding sites synergistically modulates mGluR1α-mediated activation of intracellular Ca2+ ([Ca2+]i signaling. Mutating the L-Glu-binding site completely abolished L-Glu signaling, while leaving its Ca2+ sensing capability largely intact. Mutating predicted Ca2+-binding residues not only abolished or significantly reduced the sensitivity of mGluR1α to [Ca2+]o but also, in some cases, to L-Glu (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474).",
                        "The role of [Ca2+]o in modulating the actions of different orthosteric ligands acting on mGluR1α, including L-Quis, (s)-MCPG, was examined, as well as reciprocal interactions between Ca2+ and the mGluR1 allosteric modulators, Ro 67-4853 and CPCCOEt. Predicted Ca2+-binding site was found to be adjacent to the orthosteric agonist and antagonist interaction sites and to exhibit a good dynamic correlated motion with these sites as assessed by Molecular Dynamics (MD) simulations. These studies furthermore demonstrated that [Ca2+]o enhances [3H]-L-Quis binding to wild type mGluR1α and consistently induces [Ca2+]i. Furthermore, these studies indicated that (s)-MCPG efficiently antagonizes both L-Glu- and [Ca2+]o-induced receptor activation at low concentrations, but that increasing the concentration of L-Glu or [Ca2+]o can overcome this inhibition. In addition, these studies demonstrated that Ro-674853 and CPCCOEt potentiate and inhibit responses to [Ca2+]o, respectively, and [Ca2+]o increases the potency of Ro-674853 but reduces the inhibition of mGluR1α by CPCCOEt. Therefore, [Ca2+]o modulates the sensitivity of mGluR1α to not only orthosteric agonists and antagonists but also allosteric modulators, likely by interacting with the predicted [Ca2+]o-binding site in the ECD of the receptor.",
                        "Therefore, as disclosed herein, there is a Ca2+-binding site in the hinge region of group I mGluRs that is adjacent to the site where orthosteric agonist and antagonist drugs bind on the extracellular domain of the receptor. Moreover, extracellular Ca2+ enhances group I mGluR-mediated intracellular Ca2+ responses evoked by orthosteric agonists, and diminishes the inhibitory effect of mGluR orthosteric antagonists. In addition, selective positive and negative allosteric modulators of mGluR potentiate and inhibit responses to extracellular Ca2+, respectively. Therefore, binding of extracellular Ca2+ to the predicted Ca2+-binding site in the ECD of mGluR modulates not only glutamate-evoked signaling but also the actions of both orthosteric and allosteric drugs on mGluRs.",
                        "Orthosteric and Allosteric mGluR Modulators",
                        "To date, eight different mGluR receptor subtypes have been cloned and characterized, and these receptors appear to have diverse neuroanatomical distributions as well as unique pharmacological and intracellular signaling properties. The group I family of mGluRs consists of mGluR1 and mGluR5 receptors, whereas the group II family consists of mGluR2 and mGluR3 and the group III family consists of mGluR4, mGluR6, mGluR7 and mGluR8. The disclosed methods and compositions can involve the use of any orthosteric agonist or antagonist of mGluR that binds in the L-Glu binding pocket of a group I mGluR.",
                        "The methods and compositions can also be used with any allosteric modulators that affect the binding of L-Glu to a group I mGluR. Examples of agonists, antagonists, and allosteric regulators of mGluR1 and mGluR5 are set forth in Tables 1A and 1B.",
                        "Extracellular Calcium Modulators",
                        "The disclosed compositions and methods can involve the use of any agent, regimen, system, or process that can modulate the extracellular levels of calcium near group I mGluR receptors. In particular, the compositions and methods relate to calcium agents that modulate the extracellular levels of calcium in the central or peripheral nervous system, such as in the brain.",
                        "In some embodiments, calcium levels are raised by at least 5%, 10%, 15%, 20%, 25%, 30%, 40%, 45%, 50%, 55%, 60%, 65%, 70%, 75%, 80%, 90%, 100%, 200%, or 300% above current levels. In some embodiments, calcium levels are decreased by at least 5%, 10%, 15%, 20%, 25%, 30%, 40%, 45%, 50%, 55%, 60%, 65%, 70%, 75%, 80%, or 90%.",
                        "Calcium Supplement",
                        "The disclosed calcium agent can be any source of calcium that is capable of raising the free ionized calcium concentration in the plasma to at least 1.0 mmol/L (2.0 mEq/L) in the plasma of a subject. Calcium (Ca2+) must be present in a soluble form for efficient absorption from the gastrointestinal tract. This soluble form is generally Ca2+ ions, which are hydrated by solvent water or loosely complexed to anionic ligands in solution. Calcium absorption from gastrointestinal tract takes place by both active transport and passive diffusion. The active transport is saturable, stimulated by 1,25-dihydroxyvitamin D3, and predominates in the duodenum and proximal jejunum; while passive transport is the principal mechanism for absorbing large loads of Ca2+ (which saturate the active process), and involves the distal jejunum and ileum which have longer transit times.",
                        "Many of the studies of Ca2+ absorption have employed a single oral dose, ranging from 250 mg up to 2000 mg. With a smaller dose, 15-500 mg of Ca2+, the fractional absorption varies inversely with the logarithm of the load size. With a larger load (>500 up to 2000 mg), the fractional absorption increases linearly with load size, reflecting a role of the passive transport over the active transport. Calcium absorption has also been modeled by fitting the amount absorbed to an equation with a hyperbolic term for the saturable process and a linear term for the nonsaturable process.",
                        "In some embodiments, the calcium agent can include elemental calcium, calcium salt, and complexed calcium supplements. In various embodiments, the calcium increasing agent is a calcium salt. In some embodiments, the calcium increasing agent can be elemental calcium or a calcium salt or complexed calcium that upon a single and/or multiple administration doses over a period of hours to days, days to weeks, or weeks to months, raises the plasma concentration of free ionized calcium to at least 1.0 mmol/L (2.0 mEq/L) in the subject.",
                        "Free ionized calcium is amenable to calculation once the concentration of total plasma calcium concentration is known. The total plasma calcium concentration consists of three fractions. Approximately 15 percent is bound to multiple organic and inorganic anions such as sulfate, phosphate, lactate, and citrate. About 40 percent is bound to albumin in a ratio of 0.8 mg/DI (0.2 mmol/L or 0.4 mEq/L) of calcium per 1.0 g/DI (10 g/L) of albumin. The remaining 45 percent circulates as physiologically active ionized (or free) calcium. The ionized calcium concentration is tightly regulated by parathyroid hormone and vitamin D. The wide range in the normal total plasma calcium concentration is probably due to variations in the plasma concentration of albumin among normal healthy individuals and to variations in the state of hydration and arterial acid-base balance or increased blood concentrations of lactate, citrate and the like in subjects that can alter the albumin concentration and thus the free ionized calcium levels. The net effect is that measurement of the total plasma calcium concentration alone can be misleading, since these parameters can change affecting the ionized calcium fraction.",
                        "In some embodiments, the calcium agent can include calcium supplements. The disclosed compositions can also be formulated with one or more calcium supplements by providing sufficient calcium supplement in the composition to reach a predetermined elemental calcium amount for example, from about 100 mg to about 5000 mg, from 100 mg to about 2000 mg, from about 500 mg to about 1,000 mg in the composition.",
                        "Neurotransmitter or Amino Acid",
                        "In some embodiments, the calcium agent is a neurotransmitter or amino acid that affects sensitivity of the mGluR to calcium. In some embodiments, the calcium agent is a neurotransmitter that promotes calcium release from cellular calcium stores. For example, L-glutamate is a neurotransmitter that can bind with mGluRs to trigger the increase of IP3. IP3 further causes the release of CA2+ from the endoplasmic reticulum (ER).",
                        "Electric or Mechanical Stimulation",
                        "In some embodiments, the calcium agent is an electric or mechanical stimulation. Electrical or mechanical stimulation of neurons causes extracellular calcium to enter cells via channels in the plasma membrane (e.g. voltage gated calcium channel, ligand gated calcium channel). This can increase the average cytosolic calcium concentration from around 100 nM to around 1 μM.",
                        "Calcium Sensing",
                        "Methods and biosensors for measuring levels of extracellular calcium are known and described, for example, in WO 2012/054648 by Yang et al. and WO 2008/076365 by Yang et al, which are hereby incorporated by reference in their entireties for these teachings. Therefore, in some embodiments, the disclosed methods further involve measuring extracellular Ca2+ levels and adjusting the levels of extracellular Ca2+ as described above to optimal levels suitable to enhance the activity of one or more group I mGluR orthosteric agonists, orthosteric antagonists, or allosteric modulators. Normal extracellular concentrations of calcium in the brain are in the range from 1.5-2.0 mM range (Jones, H. C., and R. F. Keep. 1987. J. Physiol. (Lond.). 383:441-453). In some embodiments, “optimal levels” of extracellular Ca2+ includes levels that are at least 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%, or 200% higher than physiological levels. In particular embodiments, “optimal levels” of extracellular Ca2+ includes levels that are at least 50% higher than physiological levels.",
                        "Methods of Treatment",
                        "The disclosed compositions and methods may be used to treat or prevent any disease or disorder involving dysfunctional group I metabotropic glutamate receptor activity. Metabotropic glutamate receptors have been implicated in a wide range of biological functions. This has suggested a potential role for these receptors in a variety of disease processes in humans or other species.",
                        "For example, the disclosed compositions and methods may be used to treat or prevent a variety of neurological and psychiatric disorders associated with glutamate dysfunction, including one or more of the following conditions or diseases: cognitive disorders including dementia (associated with Alzheimer's disease, ischemia, trauma, vascular problems or stroke, HIV disease, Parkinson's disease, Huntington's disease, Pick's disease, Creutzfeldt-Jacob disease, perinatal hypoxia, other general medical conditions or substance abuse); delirium, amnestic disorders or age related cognitive decline; anxiety disorders including acute stress disorder, agoraphobia, generalized anxiety disorder, obsessive-compulsive disorder, panic attack, panic disorder, post-traumatic stress disorder, separation anxiety disorder, social phobia, specific phobia, substance-induced anxiety disorder and anxiety due to a general medical condition; schizophrenia or psychosis including schizophrenia (paranoid, disorganized, catatonic or undifferentiated), schizophreniform disorder, schizoaffective disorder, delusional disorder, brief psychotic disorder, shared psychotic disorder, psychotic disorder due to a general medical condition and substance-induced psychotic disorder; substance-related disorders and addictive behaviors (including substance-induced delirium, persisting dementia, persisting amnestic disorder, psychotic disorder or anxiety disorder; tolerance, dependence or withdrawal from substances including alcohol, amphetamines, cannabis, cocaine, hallucinogens, inhalants, nicotine, opioids, phencyclidine, sedatives, hypnotics or anxiolytics); movement disorders, including akinesias and akinetic-rigid syndromes (including Parkinson's disease, drug-induced parkinsonism, postencephalitic parkinsonism, progressive supranuclear palsy, multiple system atrophy, corticobasal degeneration, parkinsonism-ALS dementia complex and basal ganglia calcification), medication-induced parkinsonism (such as neuroleptic-induced parkinsonism, neuroleptic malignant syndrome, neuroleptic-induced acute dystonia, neuroleptic-induced acute akathisia, neuroleptic-induced tardive dyskinesia and medication-induced postural tremor), Gilles de la Tourette's syndrome, epilepsy, and dyskinesias including tremor (such as rest tremor, postural tremor and intention tremor), chorea (such as Sydenham's chorea, Huntington's disease, benign hereditary chorea, neuroacanthocytosis, symptomatic chorea, drug-induced chorea and hemiballism), myoclonus (including generalized myoclonus and focal myoclonus), tics (including simple tics, complex tics and symptomatic tics), and dystonia (including generalized dystonia such as iodiopathic dystonia, drug-induced dystonia, symptomatic dystonia and paroxysmal dystonia, and focal dystonia such as blepharospasm, oromandibular dystonia, spasmodic dysphonia, spasmodic torticollis, axial dystonia, dystonic writer's cramp and hemiplegic dystonia)]; obesity, bulimia nervosa and compulsive eating disorders; pain including bone and joint pain (osteoarthritis), repetitive motion pain, dental pain, cancer pain, myofacial pain (muscular injury, fibromyalgia), perioperative pain (general surgery, gynecological), chronic pain, neuropathic pain, post-traumatic pain, trigeminal neuralgia, migraine and migraine headache; obesity or eating disorders associated with excessive food intake and complications associated therewith; attention-deficit/hyperactivity disorder; conduct disorder; mood disorders including depressive disorders, bipolar disorders, mood disorders due to a general medical condition, and substance-induced mood disorders; muscular spasms and disorders associated with muscular spasticity or weakness including tremors; urinary incontinence; amyotrophic lateral sclerosis; neuronal damage including ocular damage, retinopathy or macular degeneration of the eye, hearing loss or tinnitus; emesis, brain edema and sleep disorders including narcolepsy. Illustrative examples of the neuropathic pain include diabetic polyneuropathy, entrapment neuropathy, phantom pain, thalamic pain after stroke, post-herpetic neuralgia, atypical facial neuralgia pain after tooth extraction and the like, spinal cord injury, trigeminal neuralgia and cancer pain resistant to narcotic analgesics such as morphine. The neuropathic pain includes the pain caused by either central or peripheral nerve damage. And it includes the pain caused by either mononeuropathy or polyneuropathy.",
                        "In particular, selective pharmacological antagonists and/or negative allosteric modulators of group I mGluRs are potential therapeutic agents for the treatment of numerous disorders of the central nervous system (CNS), including depression, anxiety, drug addiction, chronic pain, Fragile X syndrome (FXS), autism spectrum disorders (ASD), Parkinson's disease, and gastroesophageal reflux disease. Moreover, agonists and positive allosteric modulators (PAMs) of group I mGluRs are potential therapeutic agents for the treatment of other CNS disorders, including schizophrenia, cognitive deficits associated with chronic drug use, and deficits in extinction learning. Therefore, these activities can be enhanced by increasing levels of extracellular Ca2+.",
                        "Combinations",
                        "The disclosed orthosteric antagonists, orthosteric agonists, or allosteric modulators, in combination with calcium agents, may be used in further combination with one or more other therapeutic agents. Such other agents may be administered, by a route and in an amount commonly used therefor, contemporaneously or sequentially with the disclosed compositions. When the disclosed compositions are used contemporaneously with one or more other drugs, a pharmaceutical composition in unit dosage form containing such other drugs and the disclosed compositions is preferred. However, the combination therapy may also include therapies in which the disclosed compositions and one or more other drugs are administered on different overlapping schedules. It is also contemplated that when used in combination with one or more other active ingredients, the disclosed compositions and the other active ingredients may be used in lower doses than when each is used singly. Accordingly, the disclosed pharmaceutical compositions include those that contain one or more other active ingredients, in addition to orthosteric antagonists, orthosteric agonists, or allosteric modulators, in combination with calcium agents.",
                        "Therapeutic agents suitable for combination with the disclosed compositions are well known to those with skill in the art, and can be identified by inspection of, inter alia, in Physician's Desk Reference (Medical Economics Company, Montvale, N.J.) and The Merck Index (Merck and Co., Inc., Whitehouse Station, N.J.).",
                        "In some embodiments, the disclosed compositions may be employed in combination with anti-Alzheimer's agents, beta-secretase inhibitors, gamma-secretase inhibitors, HMG-CoA reductase inhibitors, NSAID's including ibuprofen, vitamin E, and anti-amyloid antibodies.",
                        "In some embodiments, the disclosed compositions may be employed in combination with sedatives, hypnotics, anxiolytics, antipsychotics, antianxiety agents, cyclopyrrolones, imidazopyridines, pyrazolopyrimidines, minor tranquilizers, melatonin agonists and antagonists, melatonergic agents, benzodiazepines, barbiturates, 5HT-2 antagonists, and the like, such as: adinazolam, allobarbital, alonimid, alprazolam, amitriptyline, amobarbital, amoxapine, bentazepam, benzoctamine, brotizolam, bupropion, busprione, butabarbital, butalbital, capuride, carbocloral, chloral betaine, chloral hydrate, chlordiazepoxide, clomipramine, clonazepam, cloperidone, clorazepate, clorethate, clozapine, cyprazepam, desipramine, dexclamol, diazepam, dichloralphenazone, divalproex, diphenhydramine, doxepin, estazolam, ethchlorvynol, etomidate, fenobam, flunitrazepam, flurazepam, fluvoxamine, fluoxetine, fosazepam, glutethimide, halazepam, hydroxyzine, imipramine, lithium, lorazepam, lormetazepam, maprotiline, mecloqualone, melatonin, mephobarbital, meprobamate, methaqualone, midaflur, midazolam, nefazodone, nisobamate, nitrazepam, nortriptyline, oxazepam, paraldehyde, paroxetine, pentobarbital, perlapine, perphenazine, phenelzine, phenobarbital, prazepam, promethazine, propofol, protriptyline, quazepam, reclazepam, roletamide, secobarbital, sertraline, suproclone, temazepam, thioridazine, tracazolate, tranylcypromaine, trazodone, triazolam, trepipam, tricetamide, triclofos, trifluoperazine, trimetozine, trimipramine, uldazepam, venlafaxine, zaleplon, zolazepam, zolpidem, and salts thereof, and combinations thereof, and the like, or the subject compound may be administered in conjunction with the use of physical methods such as with light therapy or electrical stimulation.",
                        "In some embodiments, the disclosed compositions may be employed in combination with levodopa (with or without a selective extracerebral decarboxylase inhibitor such as carbidopa or benserazide), anticholinergics such as biperiden (optionally as its hydrochloride or lactate salt) and trihexyphenidyl(benzhexyl)hydrochloride, COMT inhibitors such as entacapone, MOA-B inhibitors, antioxidants, A2a adenosine receptor antagonists, cholinergic agonists, NMDA receptor antagonists, serotonin receptor antagonists and dopamine receptor agonists such as alentemol, bromocriptine, fenoldopam, lisuride, naxagolide, pergolide and pramipexole. It will be appreciated that the dopamine agonist may be in the form of a pharmaceutically acceptable salt, for example, alentemol hydrobromide, bromocriptine mesylate, fenoldopam mesylate, naxagolide hydrochloride and pergolide mesylate. Lisuride and pramipexol are commonly used in a non-salt form.",
                        "In some embodiments, the disclosed compositions may be employed in combination with acetophenazine, alentemol, benzhexyl, bromocriptine, biperiden, chlorpromazine, chlorprothixene, clozapine, diazepam, fenoldopam, fluphenazine, haloperidol, levodopa, levodopa with benserazide, levodopa with carbidopa, lisuride, loxapine, mesoridazine, molindolone, naxagolide, olanzapine, pergolide, perphenazine, pimozide, pramipexole, risperidone, sulpiride, tetrabenazine, trihexyphenidyl, thioridazine, thiothixene or trifluoperazine.",
                        "In some embodiments, the disclosed compositions may be employed in combination with a compound from the phenothiazine, thioxanthene, heterocyclic dibenzazepine, butyrophenone, diphenylbutylpiperidine and indolone classes of neuroleptic agent. Suitable examples of phenothiazines include chlorpromazine, mesoridazine, thioridazine, acetophenazine, fluphenazine, perphenazine and trifluoperazine. Suitable examples of thioxanthenes include chlorprothixene and thiothixene. An example of a dibenzazepine is clozapine. An example of a butyrophenone is haloperidol. An example of a diphenylbutylpiperidine is pimozide. An example of an indolone is molindolone. Other neuroleptic agents include loxapine, sulpiride and risperidone. It will be appreciated that the neuroleptic agents when used in combination with the subject compound may be in the form of a pharmaceutically acceptable salt, for example, chlorpromazine hydrochloride, mesoridazine besylate, thioridazine hydrochloride, acetophenazine maleate, fluphenazine hydrochloride, flurphenazine enathate, fluphenazine decanoate, trifluoperazine hydrochloride, thiothixene hydrochloride, haloperidol decanoate, loxapine succinate and molindone hydrochloride. Perphenazine, chlorprothixene, clozapine, haloperidol, pimozide and risperidone are commonly used in a non-salt form.",
                        "In some embodiments, the disclosed compositions may be employed in combination with an anoretic agent such as aminorex, amphechloral, amphetamine, benzphetamine, chlorphentermine, clobenzorex, cloforex, clominorex, clortermine, cyclexedrine, dexfenfluramine, dextroamphetamine, diethylpropion, diphemethoxidine, N-ethylamphetamine, fenbutrazate, fenfluramine, fenisorex, fenproporex, fludorex, fluminorex, furfurylmethylamphetamine, levamfetamine, levophacetoperane, mazindol, mefenorex, metamfepramone, methamphetamine, norpseudoephedrine, pentorex, phendimetrazine, phenmetrazine, phentermine, phenylpropanolamine, picilorex and sibutramine; selective serotonin reuptake inhibitor (SSRI); halogenated amphetamine derivatives, including chlorphentermine, cloforex, clortermine, dexfenfluramine, fenfluramine, picilorex and sibutramine; and pharmaceutically acceptable salts thereof.",
                        "In some embodiments, the disclosed compositions may be employed in combination with an anti-depressant or anti-anxiety agent, including norepinephrine reuptake inhibitors (including tertiary amine tricyclics and secondary amine tricyclics), selective serotonin reuptake inhibitors (SSRIs), monoamine oxidase inhibitors (MAOIs), reversible inhibitors of monoamine oxidase (RIMAs), serotonin and noradrenaline reuptake inhibitors (SNRIs), corticotropin releasing factor (CRF) antagonists, .alpha.-adrenoreceptor antagonists, neurokinin-1 receptor antagonists, atypical anti-depressants, benzodiazepines, agonists or antagonists, especially 5-HT.sub. 1A partial agonists, and corticotropin releasing factor (CRF) antagonists. Specific agents include: amitriptyline, clomipramine, doxepin, imipramine and trimipramine; amoxapine, desipramine, maprotiline, nortriptyline and protriptyline; fluoxetine, fluvoxamine, paroxetine and sertraline; isocarboxazid, phenelzine, tranylcypromine and selegiline; moclobemide: venlafaxine; aprepitant; bupropion, lithium, nefazodone, trazodone and viloxazine; alprazolam, chlordiazepoxide, clonazepam, chlorazepate, diazepam, halazepam, lorazepam, oxazepam and prazepam; buspirone, flesinoxan, gepirone and ipsapirone, and pharmaceutically acceptable salts thereof.",
                        "In some embodiments, the disclosed compositions may be employed in combination with an opiate agonist, a lipoxygenase inhibitor, such as an inhibitor of 5-lipoxygenase, a cyclooxygenase inhibitor, such as a cyclooxygenase-2 inhibitor, an interleukin inhibitor, such as an interleukin-1 inhibitor, an NMDA antagonist, an inhibitor of nitric oxide or an inhibitor of the synthesis of nitric oxide, a non-steroidal antiinflammatory agent, or a cytokine-suppressing antiinflammatory agent, for example with a compound such as acetaminophen, asprin, codiene, fentanyl, ibuprofen, indomethacin, ketorolac, morphine, naproxen, phenacetin, piroxicam, a steroidal analgesic, sufentanyl, sunlindac, tenidap, and the like. Similarly, the subject compound may be administered with a pain reliever; a potentiator such as caffeine, an H2-antagonist, simethicone, aluminum or magnesium hydroxide; a decongestant such as phenylephrine, phenylpropanolamine, pseudophedrine, oxymetazoline, ephinephrine, naphazoline, xylometazoline, propylhexedrine, or levo-desoxy-ephedrine; an antitussive such as codeine, hydrocodone, caramiphen, carbetapentane, or dextramethorphan; a diuretic; and a sedating or non-sedating antihistamine.",
                        "Dosage Forms",
                        "Also disclosed is a pharmaceutical composition comprising an orthosteric agonist, orthosteric antagonist, or allosteric modulator of one or more mGluRs (referred to collectively herein as “mGluR orthosteric or allosteric drug”). The pharmaceutical composition may optionally also contain the calcium agent. Alternatively, the calcium agent may be present in a second pharmaceutical or nutraceutical composition. The mGluR orthosteric or allosteric drug and/or calcium agent are collectively referred to as “active agents.”",
                        "The disclosed pharmaceutical compositions may conveniently be presented in dosage unit form and may be prepared by any of the methods well known in the art of pharmacy. All methods include the step of bringing the active ingredient into association with the carrier which constitutes one or more accessory ingredients. In general, the pharmaceutical compositions are prepared by uniformly and intimately bringing the active ingredient into association with a liquid carrier or a finely divided solid carrier or both, and then, if necessary, shaping the product into the desired formulation. In the pharmaceutical composition the active object compound is included in an amount sufficient to produce the desired effect upon the process or condition of diseases.",
                        "The disclosed pharmaceutical compositions may be in a form suitable for oral use, for example, as tablets, troches, lozenges, aqueous or oily suspensions, dispersible powders or granules, emulsions, hard or soft capsules, or syrups or elixirs. Compositions intended for oral use may be prepared according to any method known to the art for the manufacture of pharmaceutical compositions and such compositions may contain one or more agents selected from the group consisting of sweetening agents, flavoring agents, coloring agents and preserving agents in order to provide pharmaceutically elegant and palatable preparations. Tablets contain the active ingredient in admixture with non-toxic pharmaceutically acceptable excipients which are suitable for the manufacture of tablets. These excipients may be for example, inert diluents, such as calcium carbonate, sodium carbonate, lactose, calcium phosphate or sodium phosphate; granulating and disintegrating agents, for example, corn starch, or alginic acid; binding agents, for example starch, gelatin or acacia, and lubricating agents, for example magnesium stearate, stearic acid or talc. The tablets may be uncoated or they may be coated by known techniques to delay disintegration and absorption in the gastrointestinal tract and thereby provide a sustained action over a longer period. For example, a time delay material such as glyceryl monostearate or glyceryl distearate may be employed.",
                        "Formulations for oral use may also be presented as hard gelatin capsules wherein the active ingredient is mixed with an inert solid diluent, for example, calcium carbonate, calcium phosphate or kaolin, or as soft gelatin capsules wherein the active ingredient is mixed with water or an oil medium, for example peanut oil, liquid paraffin, or olive oil.",
                        "Aqueous suspensions contain the active materials in admixture with excipients suitable for the manufacture of aqueous suspensions. Such excipients are suspending agents, for example sodium carboxymethylcellulose, methylcellulose, hydroxy-propylmethylcellulose, sodium alginate, polyvinyl-pyrrolidone, gum tragacanth and gum acacia; dispersing or wetting agents may be a naturally-occurring phosphatide, for example lecithin, or condensation products of an alkylene oxide with fatty acids, for example polyoxyethylene stearate, or condensation products of ethylene oxide with long chain aliphatic alcohols, for example heptadecaethyleneoxycetanol, or condensation products of ethylene oxide with partial esters derived from fatty acids and a hexitol such as polyoxyethylene sorbitol monooleate, or condensation products of ethylene oxide with partial esters derived from fatty acids and hexitol anhydrides, for example polyethylene sorbitan monooleate. The aqueous suspensions may also contain one or more preservatives, for example ethyl, or n-propyl, p-hydroxybenzoate, one or more coloring agents, one or more flavoring agents, and one or more sweetening agents, such as sucrose or saccharin.",
                        "Oily suspensions may be formulated by suspending the active ingredient in a vegetable oil, for example arachis oil, olive oil, sesame oil or coconut oil, or in a mineral oil such as liquid paraffin. The oily suspensions may contain a thickening agent, for example beeswax, hard paraffin or cetyl alcohol. Sweetening agents such as those set forth above, and flavoring agents may be added to provide a palatable oral preparation. These compositions may be preserved by the addition of an anti-oxidant such as ascorbic acid.",
                        "Dispersible powders and granules suitable for preparation of an aqueous suspension by the addition of water provide the active ingredient in admixture with a dispersing or wetting agent, suspending agent and one or more preservatives. Suitable dispersing or wetting agents and suspending agents are exemplified by those already mentioned above. Additional excipients, for example sweetening, flavoring and coloring agents, may also be present.",
                        "The disclosed pharmaceutical compositions may also be in the form of oil-in-water emulsions. The oily phase may be a vegetable oil, for example olive oil or arachis oil, or a mineral oil, for example liquid paraffin or mixtures of these. Suitable emulsifying agents may be naturally-occurring gums, for example gum acacia or gum tragacanth, naturally-occurring phosphatides, for example soy bean, lecithin, and esters or partial esters derived from fatty acids and hexitol anhydrides, for example sorbitan monooleate, and condensation products of the said partial esters with ethylene oxide, for example polyoxyethylene sorbitan monooleate. The emulsions may also contain sweetening and flavoring agents. Syrups and elixirs may be formulated with sweetening agents, for example glycerol, propylene glycol, sorbitol or sucrose. Such formulations may also contain a demulcent, a preservative, flavoring and coloring agents.",
                        "The disclosed pharmaceutical compositions may be in the form of sterile injectable aqueous solutions, micellar formulations or oleaginous suspensions. Suspensions may be formulated according to the known art using those suitable dispersing or wetting agents and suspending agents which have been mentioned above. The sterile injectable preparation may also be a sterile injectable solution or suspension in a non-toxic parenterally-acceptable diluent or solvent, for example as a solution in 1,3-butane diol. Among the acceptable vehicles and solvents that may be employed are water, Ringer's solution and isotonic sodium chloride solution. In addition, sterile, fixed oils are conventionally employed as a solvent or suspending medium. For this purpose any bland fixed oil may be employed including synthetic mono- or diglycerides. In addition, fatty acids such as oleic acid find use in the preparation of injectables.",
                        "The mGluR orthosteric or allosteric drug is present in the pharmaceutical composition in a therapeutically effective amount. For example, an appropriate dosage level can be about 0.01 to 500 mg per kg patient body weight per day which can be administered in single or multiple doses. In some embodiments, the dosage level is about 0.1 to about 250 mg/kg per day; more preferably about 0.5 to about 100 mg/kg per day. A suitable dosage level may be about 0.01 to 250 mg/kg per day, about 0.05 to 100 mg/kg per day, or about 0.1 to 50 mg/kg per day. Within this range the dosage may be 0.05 to 0.5, 0.5 to 5 or 5 to 50 mg/kg per day. For oral administration, the compositions are preferably provided in the form of tablets, capsules, caplets, or pills containing 1.0 to 1000 milligrams of the active ingredient, particularly 1.0, 5.0, 10, 15, 20, 25, 50, 75, 100, 150, 200, 250, 300, 400, 500, 600, 750, 800, 900, and 1000 milligrams of the active ingredient for the symptomatic adjustment of the dosage to the patient to be treated. The compounds may be administered on a regimen of 1 to 4 times per day. This dosage regimen may be adjusted by healthcare providers with knowledge and skill in the art to provide the optimal therapeutic response. It will be understood, however, that the specific dose level and frequency of dosage for any particular patient may be varied and will depend upon a variety of factors including the activity of the specific compound employed, the metabolic stability and length of action of that compound, the age, body weight, general health, sex, diet, mode and time of administration, rate of excretion, drug combination, the severity of the particular condition, and the host undergoing therapy.",
                        "Therapeutic Administration",
                        "The herein disclosed compositions, including pharmaceutical composition, may be administered in a number of ways depending on whether local or systemic treatment is desired, and on the area to be treated. For example, the disclosed compositions can be administered by oral, parenteral (e.g., intramuscular, intraperitoneal, intravenous, ICV, intracisternal injection or infusion, subcutaneous injection, depot, or implant), by inhalation spray, nasal, vaginal, rectal, sublingual, or topical routes of administration and may be formulated, alone or together, in suitable dosage unit formulations containing conventional non-toxic pharmaceutically acceptable carriers, adjuvants and vehicles appropriate for each route of administration."
                    ],
                    "subsections": [
                        {
                            "title": "DEFINITIONS",
                            "paragraphs": [
                                "As used herein, antagonists and agonists of receptors which bind to and are active at only a particular receptor subtype are “selective” agents, whereas those which bind to and are active at more than one receptor subtype are “non-selective.” “Orthosteric” ligands are agonists or antagonists which bind to and are active at the primary receptor binding site of a receptor, e.g., the portion of the mGluR receptor to which the endogenous neurotransmitter (glutamate) binds. Orthosteric agents therefore can compete with the neurotransmitter for binding at the primary site, and may be further classified as “competitive” agonists or antagonists. Agonists or antagonists which bind to and are active at a secondary, and in some cases a tertiary, receptor binding site, which are spatially distinct domains for which the endogenous neurotransmitter has very little or no affinity, are termed “allosteric” ligands. These allosteric ligands are “non-competitive” in that, even in high concentration, they will not displace the endogenous ligand by competing for the primary binding site. However, compounds which bind to an allosteric site in a receptor may mitigate, modify, attenuate, enhance, diminish, inhibit, or prohibit the binding of the endogenous neurotransmitter or other orthosteric ligand to the primary binding site. Alternatively compounds which bind to an allosteric site in a receptor may mitigate, modify, attenuate, enhance, diminish, inhibit, or prohibit the physiological function of the activated receptor which include, among others, ion flux regulation, signaling, phosphorylation, and recruitment of proteins. The potency of attraction of an agonist or antagonist, whether orthosteric or allosteric, to its binding site in the receptor, is determined by the sum of non-covalent attractive and repulsive chemical forces of the ligand for the binding site, and is referred to as “affinity”. A high affinity agonist or antagonist will bind to its respective site in the receptor at very low concentration, while much higher concentrations of low-affinity molecules are required before significant binding occurs. Agonists or antagonists with sufficient affinity to bind to an allosteric site will produce a dramatic change in the physiological function of an activated mGluR. Such agonists or antagonists are referred to herein as “allosteric modulators” and may exhibit positive (enhanced physiological function) or negative (diminished physiological function) modulation.",
                                "The term “subject” refers to any individual who is the target of administration or treatment. The subject can be a vertebrate, for example, a mammal. Thus, the subject can be a human or veterinary patient. The term “patient” refers to a subject under the treatment of a clinician, e.g., physician.",
                                "The term “therapeutically effective” refers to the amount of the composition used is of sufficient quantity to ameliorate one or more causes or symptoms of a disease or disorder. Such amelioration only requires a reduction or alteration, not necessarily elimination.",
                                "The term “pharmaceutically acceptable” refers to those compounds, materials, compositions, and/or dosage forms which are, within the scope of sound medical judgment, suitable for use in contact with the tissues of human beings and animals without excessive toxicity, irritation, allergic response, or other problems or complications commensurate with a reasonable benefit/risk ratio.",
                                "The term “[Ca2+]o” refers to concentrations of extracellular calcium, whereas the term “[Ca2+]i” refers to concentrations of intracellular calcium.",
                                "The term “calcium agent” refers to any molecule, regimen, system, or process that can modulate the extracellular levels of calcium near mGluR receptors.",
                                "A number of embodiments of the invention have been described. Nevertheless, it will be understood that various modifications may be made without departing from the spirit and scope of the invention. Accordingly, other embodiments are within the scope of the following claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define selective agents",
                                "define orthosteric ligands",
                                "define allosteric ligands",
                                "explain affinity",
                                "define allosteric modulators",
                                "define subject and patient",
                                "define therapeutically effective",
                                "define pharmaceutically acceptable"
                            ],
                            "num_characters": 4023,
                            "outline_medium": [
                                "define selective agents",
                                "classify orthosteric ligands",
                                "define allosteric ligands",
                                "define terms related to subjects and pharmaceuticals"
                            ],
                            "outline_short": [
                                "define receptor terminology",
                                "define pharmaceutical terms"
                            ]
                        },
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "**Example 1**",
                                "**Experimental Procedures**",
                                "Dock L-Quis to ECD-mGluR1α Using Autodock-Vina and Hinge Motion Analysis.",
                                "To elucidate L-Quis's binding to the ECD of mGluR1α, L-Quis was docked into the crystal structure (1EWK). After removing the coordinates of the bound endogenous ligand, L-Glu, the pdb file was loaded into Autodock tools to add polar hydrogen atoms and choose the docking center and grid box. The docking work was carried out by Autodock tool—Vina (Scripps). The binding residues were analyzed by measuring the atoms within 6 Å of L-Quis. The L-Glu and the (s)-MCPG binding sites within the hinge region were analyzed using Dymdon.",
                                "MD Simulation and Correlation Analysis Using Amber.",
                                "The initial coordinates for all the simulations were taken from a 2.20 Å resolution x-ray crystal structure with PDBID 1EWK (Kunishima, N., et al. (2000) Nature 407:971-977). The AMBER 10 suite of programs (Case, D. A., et al. (2008) AMBER 10) was used to carry out all of the simulations in an explicit TIP3P water model (Jorgensen, W. L., et al. (1983) J. Chem. Phys. 79:926-935), using the modified version of the all-atom Cornell et. al. (Cornell, W. D., et al. (1995) J. Am. Chem. Soc. 117:5179-5197) force field and the re-optimized dihedral parameters for the peptide ω-bond (Urmi, D., et al. (2009) J. Phys. Chem. 113:16590-16595). The crystal structure contains only PHE substrate. Ca2+ ion was placed at the suggested Ca2+-binding site that is defined by residues D318, D322, and E325. An initially 2 ns simulation was performed using NOE restraint during the equilibration in order to reorient the side chains residues in the Ca2+-binding site, but no restraints were used during the actual simulation. A total of four MD simulations were carried out for 50 ns each on wild type and three mutant mGluRs. The mutations were D318I, D322I, and E325I. First, the structures were minimized to achieve the lowest-energy conformation in each complex. The structures were then equilibrated for 2 ns, starting the MD simulations from the equilibrated structures. During the simulations, an integration time step of 0.002 ps was used to solve Newton's equation of motion. The long-range electrostatic interactions were calculated using Particle Mesh Ewald method (Darden, T., et al. (1993) J. Chem. Phys. 98:10089-10092) and a cutoff of 9.0 Å was applied for non-bonded interactions. All bonds involving hydrogen atoms were restrained using the SHAKE algorithm (Ryckaert, J. P., et al. (1977) J. Comput. Phys. 23:327-341). The simulations were carried out at a temperature of 300 K and a pressure of 1 bar. A Langevin thermostat was used to regulate the temperature with a collision frequency of 1.0 ps−1. The trajectories were saved every 500 steps (1 ps). The trajectories were then analyzed using the ptraj module in Amber 10.",
                                "Constructs, Site-Directed Mutagenesis, and Expression of mGluR1α Variants.",
                                "The red fluorescent protein, mCherry, was genetically tagged to the C-terminal of mGluR1α by a flexible linker—GGNSGG (SEQ ID NO:1) (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). Point mutations were introduced using a site-directed mutagenesis kit (Strategene). HEK293 cells were seeded and cultured on glass coverslips. MGluR1α and its mutants were transfected into cells utilizing lipofectamine 2000 (Invitrogen). The cells were then incubated for two additional days, so that mGluR1α and its mutants were expressed at sufficient levels for study. Cells were fixed on the coverslips with 4% formaldehyde, and nuclei were stained with DAPI. The expression of mGluR1α and its variants were detected by measuring red fluorescence using confocal microscopy at 587 nm.",
                                "Determining the Effect of [Ca2+]o on Activation of mGluR1α and its Mutants by L-Quis.",
                                "Measurement of [Ca2+]i was performed as described (Huang, Y., et al. (2007) J Biol Chem 282:19000-19010). In brief, wild type mGluR1α was transiently transfected into the cells and cultured for two additional days. The cells on the coverslips were subsequently loaded using 4 M Fura-2 AM in 2 mL physiological saline buffer (10 mM HEPES, 140 mM NaCl, 5 mM KCl, 0.55 mM MgCl2, 1 mM CaCl2 and pH 7.4) for 30 min. The coverslips were then mounted in a bathing chamber on the stage of a fluorescence microscope at room temperature. Fura-2 emission signals at 510 nm from single cells excited at 340 or 380 nm were collected utilizing a Leica DM6000 fluorescence microscope in real time as the concentration of L-Quis was progressively increased in the presence or absence of [Ca2+]o. The ratio of fluorescence emitted at 510 nm resulting from excitation at 340 or 380 nm was further analyzed to obtain the [Ca2+]i response as a function of changes in L-Quis. Only the individual cells with mCherry expressed were selected for analysis.",
                                "Measurement of [Ca2+]i Responses of mGluR1α to [Ca2+]o or L-Glu in the Presence of 0.5 mM s-MCPG.",
                                "The methods for measuring [Ca2+]i responses were as described above. In the presence of (s)-MCPG, the cells were incubated with 0.5 mM (s)-MCPG in a saline buffer for 30 more minutes after Fura-2 loading. Then, the sensitivity of mGluR1α to [Ca2+]o or L-Glu was measured either by increasing the concentration of L-Glu in the presence of 1.8 mM [Ca2+]o, or by increasing [Ca2+]o in a stepwise manner in the saline buffer with or without 0.5 mM (s)-MCPG. The L-Glu concentrations were recorded at which the [Ca2+]i responses of mGluR1α were first observed and then were saturated.",
                                "Determining the Effects of [Ca2+]o on the Potency of Ro 67-4853 on mGluR1α.",
                                "Fura-2AM was used for monitoring [Ca2+]i in real time as described above. Ro 67-4853 did not potentiate mGluR1α in the absence of L-Glu (Hepler, R. W., et al. (2006) Biochemistry 45:15157-15167; Nemeth, E. F., et al. (1998) Proc Natl Acad Sci USA. 95:4040-4045). To obtain the [Ca2+]i readout, HEK293 cells expressing mGluR1α were pre-incubated with 0.5 mM Ca2+ and 5 nM Ro 67-4853 for at least 10 minutes. Cells loaded with Fura-2AM were mounted onto a chamber perfused with saline buffer. By increasing the concentration of Ro 67-4853 stepwise in the presence of 0.5 mM or 1.8 mM [Ca2+]o [Ca2+]i was recorded as before by the ratiometric change of fura-2AM in response to changes in [Ca2+]i. The effect of [Ca2+]o was analyzed by comparing the intracellular Ca2+ responses elicited by Ro 67-4853 at two different concentrations of Ca2+ in the perfusion buffer. To determine the effect of Ro 67-4853 on the sensitivity of mGluR1α to [Ca2+]o, an additional 30 nM or 300 nM Ro 67-4853 was applied as [Ca2+]o was increased.",
                                "Measurement of [Ca2+]i Responses of mGluR1α to [Ca2+]o or L-Glu in the Presence of CPCCOEt.",
                                "After the coverslip was mounted in the microscope, the cells were perfused with a saline buffer containing 0, 5 or 40 μM CPCCOEt for more than 10 min. Increasing concentrations of [Ca2+]o or L-Glu were added to the chamber in the presence of varying concentrations of CPCCOEt, and the [Ca2+]i response was recorded.",
                                "Determining the Effect of [Ca2+]o on [3H]-L-Quis Binding to mGluR1α and its Mutants.",
                                "HEK293 cells transiently transfected with wild type mGluR1α or its mutants were maintained in a 5% CO2 37° C. incubator for an additional 48 hours as before. Cells were then collected in ice cold hypotonic buffer (20 mM HEPES, 100 mM NaCl, 5 mM MgCl2, 5 mM KCl, 0.5 mM EDTA, and 1% protease inhibitors at pH 7.0-7.5). The cell pellet was washed twice more using hypotonic buffer to remove the L-Glu in the cellular debris. The crude membrane protein (100 μg) was mixed with 30 nM [3H]-L-Quis in 100 μL of hypotonic buffer. The nonspecific binding was determined by measuring bound [3H]-L-Quis in the presence of 200 μM L-Glu. To study the effects of [Ca2+]o on L-Quis binding to mGluR1α, increasing concentrations of [Ca2+]o were applied. The reaction mixtures were incubated on ice for at least 1 hour, and the membrane-bound [3H]-L-Quis was captured on filter paper using a Brandel cell harvester under vacuum. The filter paper was then transferred to scintillation fluid, and [3H]-L-Quis was detected using a Beckman LS 6500 multi-purpose scintillation counter.",
                                "Results",
                                "Predicted [Ca2+]o-Binding Site is Adjacent to Orthosteric Agonist and Antagonist Binding Sites.",
                                "Using recently developed computational algorithms, a Ca2+-binding site was identified at the hinge region of the ECD of mGluR1α (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). FIG. 1 shows that the predicted Ca2+-binding site is comprised of D318, E325, D322, and the carboxylate side chain of the natural agonist, L-Glu, in the hinge region in the ECD of mGluR1α, adjacent to the reported L-Glu-binding site. D318 is involved in both L-Glu- and Ca2+-binding (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474).",
                                "Using the crystal structure (1EWK, closed-open form) of the receptor's ECD and Autodock-Vina program, the binding site for the orthosteric agonist, L-Quis was modeled. As shown in FIG. 1B, the docked binding site of the agonist, L-Quis, corresponds well with the L-Glu-binding residues previously suggested by the crystal structure. The predicted Ca2+-binding site is also adjacent to the L-Quis pocket and interacts with L-Quis similarly to L-Glu (FIG. 1B). In the reported crystal structure of mGluR1 complexed with an orthosteric antagonist, (s)-MCPG (PDBID: 1ISS), (s)-MCPG interacts with Y74, W110, S165, T188, and K409 in lobe one (LB1) and D208, Y236 and D318 in lobe two (LB2) (FIG. 1B) (Tsuchiya, D., et al. (2002) Proc Natl Acad Sci USA. 99:2660-2665). It shares with L-Glu most of the residues of the L-Glu-binding pocket (Tsuchiya, D., et al. (2002) Proc Natl Acad Sci USA. 99:2660-2665) and is also adjacent to the predicted Ca2+-binding site.",
                                "Molecular Dynamics simulations were next performed to reveal any possible interaction between the predicted [Ca2+]o-binding site and the orthosteric ligand-binding site. Residues involved in the [Ca2+]o-binding pocket, such as D318, D322, and E325, have strong correlated motions, as expected given their roles as [Ca2+]o-binding ligands. In addition, residues D318 and R323 residing within the same loop as the predicted Ca2+-binding site are also concurrently correlated. As shown in FIG. 2, most of the critical L-Glu-binding residues, including W110, S165, T188, D208, Y236, D318 and R323, are well correlated to the [Ca2+]o-binding site (D318, D322 and E325). However, mutations at the charged residues involved in [Ca2+]o-binding, such as D318I and E325I, markedly attenuate the correlation of the Ca2+-binding site with the L-Glu binding pocket. The Ca2+-binding site in mutant D318I only correlates with G293 and D208, and mutant D325I only correlates with Y236 and G293. The mutant D322I also exhibits impaired correlation between the [Ca2+]o-binding site and L-Glu-binding site, but to a lesser degree. As shown in Table 2, D318 in the [Ca2+]o-binding site still correlates with four residues in the L-Glu-binding pocket (FIG. 2). Similarly, residues that are involved in binding L-Quis and (s)-MCPG also correlate well with residues involved in the predicted [Ca2+]o-binding site. Results from these analyses and previous studies on the effect of binding of [Ca2+]o to its site on L-Glu-mediated activation of mGluR1 indicate that [Ca2+]o regulates the effects of orthosteric ligands on mGluR1α.",
                                "Based on the correlation map shown in FIG. 2, the correlation of reported L-Glu-binding pocket to the [Ca2+]o-binding site (D318, D322 and E325) was observed. The residues with absolute correlation values greater than 0.3 are listed in this table. Of note, WT has five residues (shadowed not included because they resides at the same loop of [Ca2+]o-binding site and would have same motion) in the L-Glu-binding site that correlate with [Ca2+]o-binding 1, while there are only correlations between two residues in variants D318I and E325I, and four in D322I. Bolded residues are in the same loop as the [Ca2+]o-binding site, and they have same movements as the [Ca2+]o-binding site by default.",
                                "Ca2+ Enhances Sensitivity of Activation of mGluR1α by L-Quis by Increasing [3H]-L-Quis Binding Via Interaction with [Ca2+]o-Binding Site 1 of the Receptor.",
                                "To test the effect of [Ca2+]o on the activation of mGluR1α by the orthosteric agonist, L-Quis, a single cell fluorescence imaging assay was performed by measuring changes in [Ca2+]i using HEK293 cells transiently transfected with mGluR1α and loaded with fura-2. To eliminate of the potential effect of trace L-Glu secreted from cells, experiments were conducted using continuous superfusion of cells. FIG. 3A-D show that L-Quis induces intracellular calcium responses mediated by mGluR1 in a similar manner to the activation of the receptor by L-Glu. [Ca2+]o behaves as a PAM of the L-Quis response and induces a leftward shift in the L-Quis CRC (concentration-response curve) for activation of mGluR1α (FIG. 3A-D). In the absence of [Ca2+]o (Ca2+-free buffer with less than 2 μM calcium), the EC50 for the activation of mGluR1a by L-Quis is 12.8 nM. The addition of 1.8 mM [Ca2+]o reduces the EC50 of L-Quis to 2.8 nM (about 4.6 fold) (FIG. 3D, Table 3). This [Ca2+]o-mediated increase in the potency of L-Quis is similar to the effect of [Ca2+]o on the activation of mGluR1 by its natural agonist, L-Glu (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474).",
                                "To test whether this [Ca2+]o-mediated increase in the potency of L-Quis occurs via the predicted [Ca2+]o-binding site in the ECD of the receptor, three mGluR1 variants were examined with mutations around the [Ca2+]o-binding site adjacent to the orthosteric binding site at the hinge region. The negatively charged side chain of E325 is important for [Ca2+]o-binding by mGluR1 and not directly involved in L-Glu-binding (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). Removal of the [Ca2+]o-binding ligand residue in the mGuR1 variant E325I reduces potency, increasing the EC50 from 12.6 to 20 nM in the absence of [Ca2+]o (FIG. 3D and Table 3). Importantly, this mutation significantly reduces the [Ca2+]o-mediated enhancement in potency for L-Quis from 4.6-fold to 1.6-fold in 1.8 mM [Ca2+]o, although both the potency and efficacy of L-Quis-mediated activation of the E325I mutant are still enhanced relative to WT mGluR1 (FIG. 3A-D). On the other hand, mutant D322I exhibits WT-like behavior in its response to L-Quis both in the absence and presence of [Ca2+]o (FIG. 3A-D, Table 3), consistent with D322 contributing to [Ca2+]o-binding to a lesser degree, with only its main chain oxygen serving as a ligand atom. WT-like modulation of the L-Glu response of D332I by Ca2+ was also observed (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). These [Ca2+]i imaging data suggest that [Ca2+]o plays a key role in modulating the activation of mGluR1α by L-Quis, possibly via interaction of [Ca2+]o at the predicted [Ca2+]o-binding site.",
                                "A direct binding assay with radioactive L-Quis ([3H]-L-Quis) was used to assess the impact of [Ca2+]o on the binding of [3H]-L-Quis to mGluR1α or its variants with mutations at the predicted [Ca2+]o-binding ligand residues in the absence or presence of [Ca2+]o. L-Quis binds to the wild type receptor expressed in HEK293 with a KD in the range of 30 nM. L-Glu reduces L-Quis binding by competing for the similar orthosteric binding pocket (FIGS. 1B, 4B Insert). [Ca2+]o significantly enhances L-Quis-binding to the wild type receptor with an EC50 in the range of 0.3 mM (FIG. 3E, Table 3). Variant E325I, with removal of negative charge on the key [Ca2+]o-binding residue E325, abolishes L-Quis binding, and this effect is not influenced by the addition of L-Glu or [Ca2+]o (Kd>20 mM) (Table 3). On the other hand, variant D322I retains the binding properties of the wild type receptor for L-Quis suggesting its less essential role in L-Quis binding (FIG. 3E), which is consistent with its role in activation of increases in [Ca2+]i described earlier. Taken together, both the studies of [Ca2+]i responses and L-Quis-binding suggest that [Ca2+]o enhances the activation of mGluR1 by L-Quis by directly modulating binding of L-Quis to mGluR1 through an interaction with predicted [Ca2+]o-binding site 1 in the hinge region.",
                                "(s)-MCPG Reduces the Sensitivity of mGluR1α to L-Glu and [Ca2+]o.",
                                "The effects of [Ca2+]o on various mGluR1 ligands acting by different mechanisms on mGluR1 were evaluated using L-Glu as the orthosteric agonist, since it is the physiological activator of the receptor in vivo. As shown in FIG. 4, (s)-MCPG induces a concentration-dependent decrease in the L-Glu-evoked [Ca2+]i response (FIG. 4A). A concentration of 0.5 mM (s)-MCPG elicits a parallel rightward shift in the L-Glu CRC, and increases the EC50 for L-Glu from 1.7 to 3.7 μM. This is consistent with the known action of MCPG as a competitive antagonist at the orthosteric L-Glu binding site.",
                                "Interestingly, FIG. 4A shows that MCPG also induces a concentration-dependent inhibition of the 5 mM [Ca2+]o− induced [Ca2+]i response, even in the absence of added L-Glu. Unlike the effect of MCPG on the response to L-Glu, MCPG does not completely block the response to [Ca2+]o. This is consistent with the hypothesis that MCPG inhibits the response to [Ca2+]o by acting at a site distinct from the one that allosterically regulates the response to [Ca2+]o. MCPG also induces a rightward shift in the [Ca2+]o CRC. The EC50 for [Ca2+]o increases by ˜1.7 fold (from 3.5 to 6.0 mM at 0 and 0.5 mM MCPG, respectively) (FIG. 4C, Table 4). The maximal response to [Ca2+]o was not affected by 0.5 mM MCPG. However, as noted above, higher concentrations of MCPG could not fully block the maximal effect of 5 mM [Ca2+]o.",
                                "NAM CPCCOEt Noncompetitively Inhibits Both L-Glu-Induced and [Ca2+]o-Induced Activation of mGluR1α.",
                                "CPCCOEt is known as a selective, non-competitive negative allosteric modulator (NAM) of mGluR1 that binds to residues T815 and A818 in the 7th TMD of the receptor (Harrington, P. E., et al. (2007) Current medicinal chemistry 14:3027-3034) (FIG. 1). As shown in FIG. 5A, the L-Glu-triggered [Ca2+]i response is significantly depressed in the presence of 5 and 40 μM CPCCOEt. In the presence of 40 μM CPCCOEt, the maximal response decreases to only about half of the control level, while the EC50 value increases from 1.7 to 10.1 μM (FIG. 5A, Table 5). To determine the effects of CPCCOEt on the activation of mGluR1α by [Ca2+]o, the effect of CPCCOEt on [Ca2+]o-induced [Ca2+]i responses was examined. FIG. 5B reveals that CPCCOEt significantly inhibits the [Ca2+]o sensitivity of mGluR1α. In the presence of 5 μM CPCCOEt, the EC50 of mGluR1α for [Ca2+]o was increased from 3.5 to 14.7 mM. A concentration of 40 μM CPCCOEt produces an even higher EC50 value of 28.7 mM (FIG. 5B, Table 5). The maximal response is also significantly decreased by 40 μM CPCCOEt, although the maximal response with 5 μM CPCCOEt is still comparable. This indicates that 30 mM [Ca2+]o cannot completely reverse the antagonism induced by CPCCOEt, and thus the inhibitory effects of CPCCOEt on the response of mGluR1α to [Ca2+]o appears to be non-competitive (FIG. 5B, Table 5).",
                                "The mGluR1α PAM Ro 67-4853 Potentiates Activation of mGluR1 by [Ca2+]o.",
                                "The finding that CPCCOEt inhibits activation of mGluR1 by [Ca2+]o suggests that the CPCCOEt site, in the transmembrane-spanning domain of mGluR1, and the [Ca2+]o-binding site, in the ECD of the receptor, interact in a manner similar to the interactions between the orthosteric L-Glu binding site and the allosteric CPCCOEt site. Analogous experiments were performed to determine whether the mGluR1 PAM, Ro 67-4853, which binds to the extracellular loops of the TMDs of mGluR1α, (Lavreysen, H., et al. (2003) Molecular pharmacology 63:1082-1093; Litschig, S., et al. (1999) Molecular pharmacology 55:453-461) (FIG. 1B), can also potentiate responses to [Ca2+]o. FIG. 6A shows that L-Glu-induced activation of WT mGluR1α is enhanced by the addition of 10 or 100 nM Ro 67-4853 using single cell [Ca2+]i imaging. The effects of Ro 67-4853 on the [Ca2+]o sensitivity of wild type mGluR1α in the absence of L-Glu was then examined. FIG. 6B shows that both 30 and 300 nM Ro 67-4853 enhanced the [Ca2+]i response induced by [Ca2+]o, reducing the EC50 values for [Ca2+]o from 3.5 mM to 2.1 and 0.7 mM, respectively. As with the effect of Ro 67-4853 on the response to L-Glu, the maximal response to [Ca2+]o is not changed by Ro 67-4853 (FIG. 6B and Table 6).",
                                "To further evaluate the effect of Ro 67-4853 on mGluR1α, HEK293 cells transiently expressing mGluR1α were pre-incubated with 0.5 mM Ca2+ and 5 nM Ro 67-4853 for up to 10 minutes, and then the responses to multiple concentrations of Ro 67-4853 were tested. In the presence of 0.5 mM [Ca2+]o, Ro 67-4853 enhances L-Glu-induced mGluR1α activity in a concentration-dependent manner. Increasing [Ca2+]o to 1.8 mM increases the potency of Ro 67-4853 for mGluR1α (FIG. 6C). At the same time, the EC50 value decreases from 20.7 to 10.0 nM (FIG. 6C, Table 6). Interestingly, [Ca2+]i oscillations are observed when the cells are treated with Ro 67-4853. Similar to the Ca2+-sensing receptor, three different patterns of response are noted (Huang, Y., et al. (2010) J Biol Chem 285:35919-35931). Most of the cells display a transient spike in [Ca2+]i. Some cells start oscillating after the first peak, while others have a transient peak and oscillations first appear a few minutes later. By analyzing the number of cells oscillating out of the total number of responsive cells, 1.8 mM [Ca2+]o significantly increases the number of oscillatory cells compared to the cells in 0.5 mM [Ca2+]o. The starting point of oscillation is also shifted leftward. This suggests that [Ca2+]o enhances the potency of Ro 67-4853 in activating mGluR1α.",
                                "To understand whether this modulation by [Ca2+]o f the action of this allosteric modulator acting via the TMDs is indeed a result of [Ca2+]o-binding to the predicted [Ca2+]o-binding site 1 in the ECD (e.g., FIG. 1), studies were conducted using an mGluR variant with a key [Ca2+]o-binding ligand residue mutated, E325I. FIG. 1B shows that E325 is not directly involved in L-Glu-binding, and variant E325I is able to sense L-Glu and activate mGluR1α in a manner similar to WT (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). FIG. 7A shows that addition of 30 μM L-Glu enhances the responsiveness of E325I to Ro 67-4853. Of note, FIG. 7B shows that E325I responds to 10 μM Ro 67-4853 in the absence of L-Glu in [Ca2+]o-free saline. Increasing [Ca2+]o from 0 to 5.0 mM does not affect the sensitivity of E325I to Ro 67-4853, but elevating [Ca2+]o increases the responses of WT mGluR1α to 300 nM Ro 67-4853 (FIG. 7B). This suggests mutating the Ca2+ binding site (E325I) eliminates the Ca2+ effect on Ro 67-4853, but not WT mGluR1α. To determine if the receptors were saturated by Ro 67-4853, higher concentrations of the PAM were applied to both WT mGluR1 and E325I. As shown in FIG. 7B, higher concentrations of Ro 67-4853 increase the responses of both WT mGluR1 and E325I. This result suggests that [Ca2+]o-binding at its predicted site in the hinge region is essential for the positive allosteric action of this modulator.",
                                "Discussion",
                                "As disclosed herein, [Ca2+] has significant modulating effects on the actions of various orthosteric and allosteric ligands on mGuR1a, as assessed using a functional readout (i.e., [Ca2+]i responses) in receptor-transfected HEK293 cells. [Ca2+]o exerted several different effects on the compounds studied here, including the orthosteric agonist, L-Quis, the orthosteric antagonist, MCPG, and allosteric modulators, e.g., the PAM Ro 67-4853 and the NAM CPCCOEt.",
                                "As shown in FIG. 1, the predicted [Ca2+]o-binding site partially overlaps the predicted orthosteric binding site for the agonist, L-Quis, and the antagonist, MCPG. [Ca2+]o affects [L-Glu]o-induced activation of the receptor. Consistent with this, activation of mGluR1α by L-Quis was enhanced by [Ca2+]o in a similar manner. Through binding to the Ca2+ binding site on ECD-mGluR1, [Ca2+]o was capable of inducing the hydrolysis of PIP2, thus increasing IP3 and Ca2+ release from ER (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). [Ca2+]o was shown to synergistically activate mGluR1α with L-Glu (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). However, activation of GPCRs also induces Ca2+ influx through store-operated Ca2+ entry channels. By utilizing Gd3+, an inhibitor of these Ca2+ channels, it was noted that mGluR1α still could induce a [Ca2+]i increase. But comparing this to the Ca2+-induced response curve, the Gd3+ response brought the curve to the baseline. This suggests that Ca2+ release from the ER predominantly induces a transient peak, while Ca2+ influx elevates the plateau portion of the response. Increasing [Ca2+]o enhanced L-Quis binding to HEK293 cells over-expressing mGluR1α, while the mutant E325I abolished this effect of [Ca2+]o on the activation of mGluR1 (FIG. 3). Moreover, a clear difference in L-Quis and L-Glu binding was observed in the presence of very low [Ca2+]o. Using purified ECD of mGluR1α, Jingami et al. reported that [Ca2+]o enhances the increase in Trp fluorescence induced by L-Quis and L-Glu (Suzuki, Y., et al. (2004) J Biol Chem 279:35526-35534), although [Ca2+]o was reported to have no effect on L-Quis binding (Selkirk, J. V., et al. (2001) Neuropharmacology 40:645-656). Nash et al. also observed that [Ca2+]o produces a higher plateau [Ca2+]i response and greater IP3 accumulation in CHO cells mediated by mGluR1α (Nash, M. S., et al. (2001) J Biol Chem 276:19286-19293), although the transient increase in [Ca2+]i was not affected. Thus, the disclosed observation that [Ca2+]o enhanced both L-Quis-induced [Ca2+]i responses and L-Quis binding to the receptor has a physiological implication similar to the modulation by [Ca2+]o of the action of L-Glu on mGluR1α. FIG. 1 shows that the predicted [Ca2+]o-binding site is located adjacent to the (s)-MCPG binding pocket in mGluR1 in the X-ray structure (PDBID: 1ISS), which is in the hinge region of the ECD and occupies most of the residues involved in L-Glu-binding (Tsuchiya, D., et al. (2002) Proc Natl Acad Sci USA. 99:2660-2665). The effects of gradually increasing concentrations of the orthosteric antagonist, (s)-MCPG, was tested on [Ca2+]o-induced signaling by mGluR1α. As shown in FIG. 4, (s)-MCPG reduced the [Ca2+]o sensitivity of mGluR1α (FIGS. 4A and C). Increases in the concentrations of either [Ca2+]o or L-Glu overcame the inhibition induced by (s)-MCPG (FIG. 4). It is interesting to note that (s)-MCPG could not completely block the [Ca2+]o sensitivity of mGluR1 (FIG. 4C). [Ca2+]o-induced responses mediated by mGluR1α were found to be only partially antagonized by (s)-MCPG (Kubo, Y., et al. (1998) Science 279:1722-1725). (s)-MCPG, was shown to have a capacity to completely inhibit L-Glu-potentiated Ca2+-activated Cl− currents in Xenopus laevis oocytes transiently expressing mGluR1 (Kubo, Y., et al. (1998) Science 279:1722-1725). These data indicate that [Ca2+]o modulates the effects of orthosteric ligands on mGluR.",
                                "The observed [Ca2+]o-modulated orthosteric effect is likely dependent on communication of the predicted [Ca2+]o-binding site with the adjacent-binding site for orthosteric agonists and antagonists. The L-Quis binding pocket predicted here using AutoDock-Vina overlaps extensively with the L-Glu-binding pocket in the reported crystal structure (Table 7). The sidechain of D318 is involved in both [Ca2+]o- and agonist-binding. Mutation D318I abrogates both the sensitivity to [Ca2+]o and responsiveness to L-Glu (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). In this study, it also completely eliminated L-Quis-mediated activation of mGluR1 (FIG. 3E). Consistently, mutants T188A, D208A, Y236A and D318A abolished the sensitivity of the receptor to both L-Quis and L-Glu, while the mutants R78E and R78L exhibited clearly impaired L-Quis binding (Levant, J. A., et al. (1973) The New England journal of medicine 289:555-558; Sato, T., et al. (2003) The Journal of biological chemistry 278:4314-4321). The key residue E325 is involved in [Ca2+]o-binding, and the mutant, E325I, indeed significantly impaired both the [Ca2+]o and L-Glu sensitivity of the receptor (FIG. 3). On the other hand, variant D322I produced less reduction of the modulatory effects of [Ca2+]o on both L-Quis and L-Glu agonist action and is consistent with its lesser role in [Ca2+]o-binding with a contribution of only a main chain ligand atom (FIG. 1).",
                                "The observed effect of [Ca2+]o on responses to orthosteric agonists and antagonists of mGluR1 is consistent with Molecular Dynamics studies performed here on the correlated motions of the hinge region in the ECD of mGluR (FIG. 2, Table 2). A strong correlation among residues in the predicted [Ca2+]o-binding site and residues involved in the orthosteric binding sites shared by L-Glu, L-Quis and MGPG were observed. Interestingly, mutation of the [Ca2+]o-binding site largely removed this correlation. FIG. 1A shows that the predicted [Ca2+]o-binding site at the hinge region is conserved in the group I mGluRs, e.g., mGluR1 and mGluR5 (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474), calcium-sensing receptor and T1R3, a taste receptor for [Ca2+]o, (Dorr, P., et al. (2005) Antimicrobial agents and chemotherapy 49:4721-4732). In our previous study, [Ca2+]o exhibits synergy with L-Glu in activating mGluR1α (Jiang, Y., et al. (2010) J Biol Chem 285:33463-33474). The effect of [Ca2+]o in modulating orthosteric ligands that act on mGluR via communication at the hinge region of the ECD. Binding of L-Phe and other amino acids to a site in the hinge region of the CaSR likely communicates with the predicted [Ca2+]o-binding site at the hinge region to increase the sensitivity of the receptor to [Ca2+]o (Huang, Y., et al. (2009) Biochemistry 48:388-398; Huang, Y., et al. (2007) J Biol Chem 282:19000-19010; Conigrave, A. D., et al. (2007) The Journal of nutrition 137:1524S-1527S; discussion 1548S; Zhang, Z., et al. (2002) J Biol Chem 277:33727-33735). In recent years, increasing numbers of family C GPCRs, have been found to exhibit synergistic modulation of the primary orthosteric agonist by allosteric modulators. Sweet enhancers binding to the hinge region of the human taste receptor are known to stabilize the active form of the receptor, thus leading to altered perception of sweet taste, while IMP and L-Glu also synergistically activate the umami taste receptor (Zhang, F., et al. (2010) Proc Natl Acad Sci USA. 107:4752-4757; Zhang, F., et al. (2008) Proc Natl Acad Sci USA. 105:20930-20934). It is also interesting to note that a suggested allosteric ligand acting at the ECD domain of mGluR is located at the hinge region (Acher, F. C., et al. (2011) Neuropharmacology 60:102-107; Ogawa, H., et al. (2010) Protein science: a publication of the Protein Society 19:544-557). Thus, the disclosed evidence has strong implications for the role of the hinge region of the ECD in modulating action of small molecule ligands on family C GPCRs.",
                                "As for allosteric modulators targeting the TMDs, the binding sites of positive and negative modulators of mGluR1α are distinct (Hemstapat, K., et al. (2006) Molecular pharmacology 70:616-626). These allosteric modulators effectively modulate receptor activation by L-Glu, but little is known about the effects of the endogenous mineral ion, Ca2+, on these modulators. In this study, the effects of [Ca2+]o on CPCCOEt (NAM) and Ro 67-4853 (PAM) were further assessed.",
                                "The non-competitive NAM, CPCCOEt, is known to inhibit the L-Glu response by binding to T815 and A818 on the 7th TMD) (Rodriguez, A. L., et al. (2005) Molecular pharmacology 68:1793-1802; Brauner-Osborne, H., et al. (1999) Neuroreport 10:3923-3925). Our data shown in FIG. 5 support the contention that CPCCOEt, acting as a non-competitive inhibitor, also can diminish the [Ca2+]i response of mGluR1α. Interestingly, increasing [Ca2+]o restored [Ca2+]o sensitivity of the receptor. CPCCOEt not only inhibits proliferation of melanoma cells, but also reverses morphine tolerance (Haas, H. S., et al. (2007) The Oncol Rep 17:1399-1404; Smith, F. L., et al. (2004) Eur J Pharmacol 492:137-142). Thus, the findings in this study indicate that a drug targeting the [Ca2+]o-binding site in mGluR1 has the potential to tune the therapeutic effect of CPCCOEt on melanoma or addiction. V757 in the TMD was revealed to be critical to the activation of mGluR1 by the PAMs (Nemeth, E. F., et al. (1998) Proc Natl Acad Sci USA. 95:4040-4045; Hemstapat, K., et al. (2006) Molecular pharmacology 70:616-626). By analyzing the [Ca2+]i transients and oscillations observed here, [Ca2+]o not only reduced the concentration of Ro 67-4853 required to initiate [Ca2+]i oscillations, but also decreased the EC50 value and increased the maximal responses of HEK293 cells expressing mGluR1 (FIG. 6 and Table 6). In the presence of Ro 67-4853, the [Ca2+]o sensitivity of mGluR1α was also enhanced, indicating an allosteric interaction between the [Ca2+]o-binding site and the site for Ro 67-4583. Interestingly, Ro 67-4853 only enhanced activation of mGluR1α by physiological [Ca2+]o concentrations, while further increases in [Ca2+]o abolished the Ro 67-4853 effect. This indicates that a change in [Ca2+]o within the physiological range could serve as a PAM, similar to Ro 67-4853, and suggests that [Ca2+]o-induced enhancement of the potency of Ro 67-4853 may activate mGluR1 via the TMDs, and that the activation of the TMDs could enhance the sensitivity of the receptor to agonist. Since site-directed mutagenesis suggests that Ro 67-4853 along with the other PAMs, Ro 01-6128, and Ro 67-7476, likely share the same binding pocket involving V757. [Ca2+]o could potentially enhance the potencies of other members of the Ro and VU series.",
                                "The observed modulation of the effects of PAM and NAM by [Ca2+]o can be explained by the integrated action of the ECD domain with the TMDs of the receptor. This is supported by studies using a mutation of a key [Ca2+]o-binding ligand residue, E325I, at the predicted [Ca2+]o-binding site adjacent to the L-Glu-binding site. Variant E325I markedly reduces the modulation of the action of Ro67-4853 by [Ca2+]o (FIG. 7). PAMs binding to the TMDs have been shown to enhance L-Quis binding to mGluR1α (Nemeth, E. F., et al. (1998) Proc Natl Acad Sci USA. 95:4040-4045). It is possible that the incomplete reduction in the inhibitory effect of MCPG by [Ca2+]o is due to an additional synergistic effect involving the TMD region of the receptor. By tagging the FRET pair YFP/CFP to the two intracellular loops 2 (i2) of the dimeric mGluR1α, Muto et al. observed that the re-arrangement of the TMD induced by L-Glu was reversed by (s)-MCPG (Tateyama, M., et al. (2004) Nat Struct Mol Biol 11:637-642). Such an integrated effect of the TMDs with the ECD region is further supported by studies of mGluRs with deletions of the VFT. It was found that PAMs not only potentiate the action of agonists on the full-length receptors, but sometimes can display strong agonist activity on VFT truncated receptors (El Moustaine, D., et al. (2012) Proc Natl Acad Sci USA. 109:16342-16347; Goudet, C., et al. (2004) Proc Natl Acad Sci USA. 101:378-383). The VFTs of the ECDs are not only responsible for agonist-induced activation, but also prevent PAMs from activating the full-length receptor (El Moustaine, D., et al. (2012) Proc Natl Acad Sci USA. 109:16342-16347; Goudet, C., et al. (2004) Proc Natl Acad Sci USA. 101:378-383). Taken together, this study reveals that [Ca2+]o-binding at the hinge region is likely to be responsible for its capacity to modulate action of other allosteric modulators. [Ca2+]o at physiological levels (1.8 mM) enhanced the potency of Ro 67-4853 in modulating mGluR1α, while increasing [Ca2+]o diminished the inhibitory effects of CPCCOEt (FIGS. 5-7, Tables 5-6). Over the past decade, many new PAMs and NAMs for various receptors have been developed, and the potential exists for developing allosteric modulators with greater subtype specificity than is possible for orthosteric agonists (Wang, L., et al. (2009) J Pharmacol Exp Ther 331:340-348). The co-activation induced by endogenous agonists and PAMs binding to the receptors' hinge regions could be a common feature of family C GPCRs. These data provide further insight into the modulation of mGluR1α by [Ca2+]o and suggest that [Ca2+]o has the potential to modulate the profile of a variety of agents acting on mGluR1α, including agonists, antagonists and allosteric modulators.",
                                "**Example 2**",
                                "**Methods**",
                                "HEK293 cells were fed on a Dulbecco's Modified Eagle Medium (DMEM) and 10% fetal bovine serum (Invitrogen) and cultured at 37° C. in a humidified incubator with 5% CO2. One day before transfection, HEK293 cells were grown on 22×44 mm coverslips and then were transfected with mGluR5 plasmid (received as a gift from Dr. Randy Hall, Emory University, Atlanta, Ga.) with the aid of lipofectamine 2000 (Invitrogen). mGluR5 transfected HEK293 cells were grown for 48 hours and then loaded with 4 M Fura-2 AM in loading buffer containing 10 mM HEPES (pH 7.4), 140 mM NaCl, 5 mM KCl, 0.55 mM MgCl2 for 30 minutes at 37° C. The coverslips were then mounted in a bathing chamber on the stage of a fluorescence microscope. Fura-2 emission signals at 510 nm from single cells excited at 340 or 380 nm were recorded using a Leica DM6000 fluorescence microscope in real time as the Ca2+ was progressively increased. The ratio of fluorescence emitted at 510 nm resulting from excitation at 340 or 380 nm was analyzed to obtain the [Ca2+]i response as a function of changes in [Ca2+]o.",
                                "Results",
                                "Belong to the group I metabotropic glutamate receptor family, mGluR5 also processes the conserved Ca2+ binding site in the extracellular domain. Extracellular Ca2+ concentration change induced the intracellular Ca2+ oscillation of cells transfected with mGluR5. 0.05 mM extracellular Ca2+ concentration change started to induce intracellular oscillation (FIG. 8). Larger extracellular Ca2+ concentration changes leaded to higher oscillation frequency (FIGS. 9 and 10).",
                                "**Example 3**",
                                "**Effects of Extracellular Ca2+ on the Response of mGluR5 to L-Glu, Ro-674853 and L-Quis**",
                                "Methods",
                                "HEK293 cells were cultured and transfected as described above. Intracellular Ca2+ concentration was recorded using the method as described previously. In the presence of different extracellular Ca2+, L-Glu or Ro-674853 or L-Quis were progressively added to activate mGluR5 and intracellular Ca2+ response was monitored.",
                                "Results",
                                "Extracellular Ca2+ Modulating mGluR5 Response to Addition of L-Glu",
                                "Cells placed in bath solutions with different concentrations of Ca2+ displayed various response to the addition of same amount of L-Glu. In the absence of extracellular Ca2+, less percentages of cell could be activated by L-Glu and high L-Glu was needed to potentiate the mGluR. Compared with 0 mM Ca2+ bath solution, 1.8 mM resulted in the most percentages of cells to oscillate at low L-Glu (1 M), followed by 0.5 mM Ca2+. Besides, intracellular Ca2+ oscillation triggered by high concentration of L-Glu in the absence of extracellular Ca2+ exhibited much slower oscillation. Extracellular Ca2+ can enhance the L-Glu initiated mGluR5 response.",
                                "Extracellular Ca2+ Modulating mGluR5 Response to Addition of Ro-674853",
                                "mGluR5 transfected HEK293 cells were placed in bath solution containing 0 or 0.5 mM Ca2+ and Ro-674853 was added to stimulate mGluR5 expressed on the cytoplasmic membrane. In absence of extracellular Ca2+, no intracellular Ca2+ response was observed, while adding 0.5 mM Ca2+ plus Ro-674853 at the end of the experiment can activate the mGluR5 and trigger the intracellular Ca2+ oscillation, which indicated that mGluR5 were expressed on the membrane and could be activated. In the presence of 0.5 mM Ca2+, high frequency Ca2+ oscillation was observed upon the addition of Ro-674853 and 5 nM Ro-674853 could lead to the stimulation of mGluR5 (FIG. 14A to 14B).",
                                "Extracellular Ca2+ Modulating mGluR5 Response to Addition of L-Quis",
                                "mGluR5 transfected HEK293 cells were placed in bath solution containing 0 or 0.5 mM Ca2+ and L-Quis was added to stimulate mGluR5 expressed on the cytoplasmic membrane. Without extracellular Ca2+ supply, L-Quis almost could not initiate any mGluR5 response, while cells in the 0.5 or 1.8 mM Ca2+ bath solution can be stimulated by addition L-Quis. It is notable that cells in higher Ca2+ bath solution started to oscillate at lower L-Quis concentration. Besides, the oscillation frequency is much higher when cells were present in higher Ca2+ bath solution (FIGS. 15 and 16). Further analysis indicated that more percentage of cells showed response to the L-Quis stimulation when 0.5 mM or 1.8 mM was applied (FIG. 17).",
                                "**Example 4**",
                                "**Methods**",
                                "mGluR1-transfected HEK293 cells were grown on 13.5×20 mm coverslips. After the cells reached 90% confluence, they were loaded by incubation with 4 μM Fura-2 AM in 20 mM HEPES, containing 125 mM NaCl, 5 mM KCl, 1.25 mM CaCl2, 1 mM MgCl2, 1 mM NaH2PO4, 1% glucose, and 1% BSA (pH 7.4) for 1 h at 37° C. and then washed once with 20 mM HEPES, pH 7.4, containing 125 mM NaCl, 5 mM KCl, 0.5 mM CaCl2, 0.5 mM MgCl2, 1% glucose, and 1% BSA (bath buffer). The coverslips with transfected, Fura-2-loaded HEK293 cells were placed diagonally in 3-ml quartz cuvettes containing bath buffer. The fluorescence spectra at 510 nm were measured during stepwise increases in [Ca2+]o with alternating excitation at 340 or 380 nm. The ratio of the intensities of the emitted light at 510 nm when excited at 340 or 380 nm was used to monitor changes in [Ca2+]i. mCherry was genetically fused into mGluR1 pcDNA. so cells have fluorescent intensity at 550 nm was selected for further analysis.",
                                "Results",
                                "mGluR1 can not only be activated by glutamate but also by calcium. Extracellular calcium can enhance glutamate induced intracellular calcium release in mGluR1 transfected HEK293 cell (FIGS. 18 and 19). Glutamate and extracellular calcium together will induce intracellular calcium oscillation (FIG. 20 and FIG. 21). 0 mM calcium was first used to incubate mGluR1 transfected HEK293 cells. The cells were treated by different concentration of glutamate (1.7 uM/17 uM), causing corresponding transient peaks. After peaks return to baseline, 0 mM calcium was further applied to wash away the remaining buffer. And then 3 mM/6 mM calcium were used to trigger the activation of mGluR1, no response was observed. Again, 0 mM calcium was used to wash away the reaming buffer, and finally the cells were treated by glutamate and calcium (1.7 uM glutamate with 3 mM calcium, 17 uM with 6 mM calcium). More cells response and more intracellular calcium was released, meanwhile calcium oscillation was observed (FIGS. 20 and 21). As shown in FIG. 21, calcium oscillation which triggered by Ringer buffer with 17 uM glutamate and 6 mM calcium can last for 1 h. Calcium oscillation frequency is faster and peak amplitude is larger by higher concentration of glutamate and extracellular calcium.",
                                "Unless defined otherwise, all technical and scientific terms used herein have the same meanings as commonly understood by one of skill in the art to which the disclosed invention belongs. Publications cited herein and the materials for which they are cited are specifically incorporated by reference.",
                                "Those skilled in the art will recognize, or be able to ascertain using no more than routine experimentation, many equivalents to the specific embodiments of the invention described herein. Such equivalents are intended to be encompassed by the following claims."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce experimental procedures",
                                "dock L-Quis to ECD-mGluR1α using Autodock-Vina",
                                "analyze binding residues using Dymdon",
                                "perform MD simulation and correlation analysis using Amber",
                                "construct mGluR1α variants with site-directed mutagenesis",
                                "express mGluR1α variants in HEK293 cells",
                                "measure effect of [Ca2+]o on activation of mGluR1α by L-Quis",
                                "measure [Ca2+]i responses to L-Glu or L-Quis",
                                "determine effect of [Ca2+]o on potency of Ro 67-4853",
                                "measure [Ca2+]i responses in presence of CPCCOEt",
                                "determine effect of [Ca2+]o on [3H]-L-Quis binding",
                                "analyze predicted [Ca2+]o-binding site",
                                "model binding site for L-Quis using Autodock-Vina",
                                "analyze correlation between [Ca2+]o-binding site and L-Glu-binding site",
                                "perform molecular dynamics simulations",
                                "analyze correlation between [Ca2+]o-binding site and L-Quis-binding site",
                                "determine effect of [Ca2+]o on activation of mGluR1α by L-Quis",
                                "analyze effect of [Ca2+]o on L-Quis CRC",
                                "test effect of [Ca2+]o on activation of mGluR1α variants",
                                "analyze effect of [Ca2+]o on L-Quis binding to mGluR1α variants",
                                "determine effect of (s)-MCPG on sensitivity of mGluR1α to L-Glu",
                                "analyze effect of (s)-MCPG on L-Glu CRC",
                                "determine effect of (s)-MCPG on sensitivity of mGluR1α to [Ca2+]o",
                                "analyze effect of (s)-MCPG on [Ca2+]o CRC",
                                "test effect of CPCCOEt on L-Glu-induced [Ca2+]i response",
                                "analyze effect of CPCCOEt on L-Glu CRC",
                                "test effect of CPCCOEt on [Ca2+]o-induced [Ca2+]i response",
                                "analyze effect of CPCCOEt on [Ca2+]o CRC",
                                "determine effect of Ro 67-4853 on activation of mGluR1α by [Ca2+]o",
                                "analyze effect of Ro 67-4853 on [Ca2+]o CRC",
                                "summarize predicted [Ca2+]o-binding site",
                                "summarize correlation between [Ca2+]o-binding site and L-Glu-binding site",
                                "summarize effect of [Ca2+]o on activation of mGluR1α by L-Quis",
                                "summarize effect of [Ca2+]o on L-Quis binding to mGluR1α",
                                "summarize effect of (s)-MCPG on sensitivity of mGluR1α to L-Glu and [Ca2+]o",
                                "summarize effect of CPCCOEt on L-Glu-induced and [Ca2+]o-induced [Ca2+]i responses",
                                "summarize effect of Ro 67-4853 on activation of mGluR1α by [Ca2+]o",
                                "conclude that [Ca2+]o regulates effects of orthosteric ligands on mGluR1α",
                                "introduce mGluR1α",
                                "describe Ca2+ binding site",
                                "motivate Ca2+ effect on mGluR1α",
                                "describe L-Glu-induced activation",
                                "show Ca2+ enhancement of L-Glu binding",
                                "discuss Ca2+ release from ER",
                                "describe Ca2+ influx through store-operated channels",
                                "show Ca2+ effect on L-Quis binding",
                                "discuss Ca2+ modulation of orthosteric ligands",
                                "describe predicted Ca2+ binding site",
                                "show correlation between Ca2+ binding site and orthosteric binding sites",
                                "discuss conservation of Ca2+ binding site",
                                "describe effect of Ca2+ on responses to orthosteric agonists and antagonists",
                                "discuss Molecular Dynamics studies",
                                "describe effect of Ca2+ on allosteric modulators",
                                "show CPCCOEt inhibition of L-Glu response",
                                "describe Ca2+ restoration of CPCCOEt sensitivity",
                                "discuss potential therapeutic effect of CPCCOEt",
                                "describe Ro 67-4853 enhancement of L-Glu response",
                                "show Ca2+ reduction of Ro 67-4853 EC50 value",
                                "discuss allosteric interaction between Ca2+ binding site and Ro 67-4853 site",
                                "describe E325I mutation effect on Ca2+ modulation of Ro 67-4853",
                                "discuss integrated action of ECD and TMDs",
                                "describe potential of Ca2+ to modulate profile of agents acting on mGluR1α",
                                "introduce Example 2",
                                "describe Methods for Example 2",
                                "describe mGluR5 transfection and Fura-2 loading",
                                "describe fluorescence microscopy measurement",
                                "show Ca2+ induction of intracellular Ca2+ oscillation in mGluR5-transfected cells",
                                "describe Ca2+ concentration effect on oscillation frequency",
                                "discuss mGluR5 Ca2+ binding site conservation",
                                "describe Ca2+ effect on mGluR5",
                                "discuss potential of Ca2+ to modulate mGluR5",
                                "describe potential therapeutic implications",
                                "discuss family C GPCRs modulation by Ca2+",
                                "describe potential for developing allosteric modulators",
                                "discuss co-activation induced by endogenous agonists and PAMs",
                                "conclude modulation of mGluR1α by Ca2+",
                                "describe experimental methods",
                                "report effects of extracellular Ca2+ on mGluR5 response to L-Glu",
                                "report effects of extracellular Ca2+ on mGluR5 response to Ro-674853",
                                "report effects of extracellular Ca2+ on mGluR5 response to L-Quis",
                                "describe methods for Example 4",
                                "report results of Example 4",
                                "describe activation of mGluR1 by glutamate and calcium",
                                "report results of mGluR1 activation",
                                "define technical and scientific terms",
                                "discuss equivalents to specific embodiments"
                            ],
                            "num_characters": 43839,
                            "outline_medium": [
                                "introduce experimental procedures",
                                "describe docking of L-Quis to ECD-mGluR1α",
                                "perform MD simulation and correlation analysis",
                                "construct and express mGluR1α variants",
                                "measure effect of [Ca2+]o on activation of mGluR1α by L-Quis",
                                "measure [Ca2+]i responses to [Ca2+]o or L-Glu in presence of s-MCPG",
                                "determine effect of [Ca2+]o on potency of Ro 67-4853 on mGluR1α",
                                "measure [Ca2+]i responses of mGluR1α to [Ca2+]o or L-Glu in presence of CPCCO",
                                "determine effect of [Ca2+]o on [3H]-L-Quis binding to mGluR1α and its mutants",
                                "analyze predicted [Ca2+]o-binding site",
                                "model binding site for orthosteric agonist L-Quis",
                                "perform molecular dynamics simulations",
                                "analyze correlation between [Ca2+]o-binding site and L-Glu-binding site",
                                "show Ca2+ enhances sensitivity of activation of mGluR1α by L-Quis",
                                "test effect of [Ca2+]o on activation of mGluR1α by L-Quis",
                                "examine mGluR1 variants with mutations around [Ca2+]o-binding site",
                                "show (s)-MCPG reduces sensitivity of mGluR1α to L-Glu and [Ca2+]o",
                                "show NAM CPCCOEt noncompetitively inhibits both L-Glu-induced and [Ca2+]o-induced activation of mGlu",
                                "show mGluR1α PAM Ro 67-4853 potentiates activation of mGluR1 by [Ca2+]",
                                "introduce mGluR1α",
                                "motivate Ca2+ effect on mGluR1α",
                                "describe CPCCOEt site",
                                "describe Ro 67-4853 site",
                                "summarize L-Glu-induced activation",
                                "summarize Ca2+ effect on L-Glu-induced activation",
                                "describe E325I mutation",
                                "summarize Ro 67-4853 effect on mGluR1α",
                                "summarize Ca2+ effect on Ro 67-4853",
                                "discuss modulation of orthosteric ligands",
                                "discuss modulation of allosteric modulators",
                                "discuss role of hinge region",
                                "introduce Example 2",
                                "describe methods for Example 2",
                                "describe results for Example 2",
                                "introduce mGluR5",
                                "describe Ca2+ effect on mGluR5",
                                "describe Ca2+ concentration change effect",
                                "summarize oscillation frequency",
                                "describe experimental methods",
                                "present results of extracellular Ca2+ on mGluR5 response",
                                "present results of extracellular Ca2+ on mGluR1 response",
                                "define technical and scientific terms",
                                "discuss equivalents to specific embodiments"
                            ],
                            "outline_short": [
                                "introduce experimental procedures",
                                "describe molecular dynamics simulation",
                                "outline constructs and site-directed mutagenesis",
                                "measure effect of [Ca2+]o on activation of mGluR1α",
                                "determine effect of [Ca2+]o on potency of Ro 67-4853",
                                "measure [Ca2+]i responses to [Ca2+]o or L-Glu",
                                "determine effect of [Ca2+]o on [3H]-L-Quis binding",
                                "analyze results of [Ca2+]o binding site prediction",
                                "discuss effects of (s)-MCPG and CPCCOEt on mGluR1α",
                                "introduce mGluR1α",
                                "motivate Ca2+ effect on mGluR1α",
                                "describe experiments on CPCCOEt and Ro 67-4853",
                                "discuss modulation of orthosteric ligands by Ca2+",
                                "discuss modulation of allosteric modulators by Ca2+",
                                "discuss implications for family C GPCRs",
                                "introduce Example 2",
                                "describe methods for Example 2",
                                "present results for Example 2",
                                "describe experimental methods",
                                "present results of experiments"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce mGluR1α and its sensing of [Ca2+]o",
                        "describe mGluR1-mediated activation of Ca2+-activated Cl− channels",
                        "discuss modulation of mGluR1 activity by [Ca2+]o",
                        "identify [Ca2+]o-binding site in the hinge region of the ECD of mGluR1α",
                        "describe the role of D318, E325, D322, and L-Glu in [Ca2+]o binding",
                        "discuss synergistic modulation of mGluR1α by L-Glu and Ca2+",
                        "examine the effect of mutating L-Glu- and Ca2+-binding sites on mGluR1α activity",
                        "investigate the role of [Ca2+]o in modulating the actions of orthosteric ligands",
                        "study the interaction between Ca2+ and mGluR1 allosteric modulators",
                        "discuss the enhancement of [3H]-L-Quis binding to mGluR1α by [Ca2+]o",
                        "examine the effect of (s)-MCPG on mGluR1α activity",
                        "discuss the potentiation of Ro-674853 by [Ca2+]o",
                        "describe the inhibition of mGluR1α by CPCCOEt",
                        "summarize the modulation of mGluR1α activity by [Ca2+]o",
                        "introduce orthosteric and allosteric mGluR modulators",
                        "describe the use of orthosteric agonists and antagonists of mGluR",
                        "discuss the use of allosteric modulators of mGluR",
                        "introduce extracellular calcium modulators",
                        "describe the use of calcium agents to modulate extracellular calcium levels",
                        "discuss the effect of calcium levels on mGluR activity",
                        "introduce calcium supplements",
                        "describe the absorption of calcium from the gastrointestinal tract",
                        "discuss the role of vitamin D in calcium absorption",
                        "introduce neurotransmitters or amino acids that affect mGluR sensitivity to calcium",
                        "describe the effect of L-glutamate on mGluR activity",
                        "introduce electric or mechanical stimulation as a calcium agent",
                        "discuss the use of biosensors to measure extracellular calcium levels",
                        "describe the adjustment of extracellular calcium levels to optimal levels",
                        "introduce methods of treatment using disclosed compositions and methods",
                        "discuss the treatment of neurological and psychiatric disorders",
                        "describe the treatment of cognitive disorders and anxiety disorders",
                        "summarize the treatment of various diseases and disorders using disclosed compositions and methods",
                        "introduce therapeutic agents for CNS disorders",
                        "describe combinations of disclosed compositions with other therapeutic agents",
                        "list examples of therapeutic agents for combination therapy",
                        "describe administration of disclosed compositions with sedatives, hypnotics, anxiolytics, antipsychotics, and antidepressants",
                        "list examples of sedatives, hypnotics, anxiolytics, antipsychotics, and antidepressants",
                        "describe administration of disclosed compositions with levodopa and other neuroleptic agents",
                        "list examples of neuroleptic agents",
                        "describe administration of disclosed compositions with anoretic agents",
                        "list examples of anoretic agents",
                        "describe administration of disclosed compositions with antidepressant or anti-anxiety agents",
                        "list examples of antidepressant or anti-anxiety agents",
                        "describe administration of disclosed compositions with opiate agonists, lipoxygenase inhibitors, and other agents",
                        "list examples of opiate agonists, lipoxygenase inhibitors, and other agents",
                        "introduce dosage forms of pharmaceutical compositions",
                        "describe preparation of pharmaceutical compositions",
                        "list examples of excipients for tablets",
                        "describe coating of tablets",
                        "describe hard gelatin capsules",
                        "describe soft gelatin capsules",
                        "describe aqueous suspensions",
                        "list examples of suspending agents",
                        "describe oily suspensions",
                        "describe dispersible powders and granules",
                        "describe oil-in-water emulsions",
                        "describe syrups and elixirs",
                        "describe sterile injectable aqueous solutions, micellar formulations, and oleaginous suspensions",
                        "describe vehicles and solvents for injectables",
                        "introduce therapeutically effective amounts of mGluR orthosteric or allosteric drug",
                        "describe dosage levels",
                        "describe dosage regimens",
                        "describe factors affecting dosage regimens",
                        "introduce therapeutic administration of disclosed compositions",
                        "describe routes of administration",
                        "describe formulation of disclosed compositions",
                        "describe carriers, adjuvants, and vehicles for administration",
                        "describe oral administration",
                        "describe parenteral administration",
                        "describe inhalation administration",
                        "describe topical administration",
                        "conclude therapeutic administration of disclosed compositions"
                    ],
                    "num_characters": 36433,
                    "outline_medium": [
                        "introduce mGluR1α and its sensing of [Ca2+]o",
                        "motivate Ca2+ modulation of mGluR1α activity",
                        "describe computational algorithm for identifying Ca2+-binding site",
                        "identify Ca2+-binding site in hinge region of ECD",
                        "summarize mutagenesis study on L-Glu- and Ca2+-binding",
                        "examine role of [Ca2+]o in modulating actions of orthosteric ligands",
                        "discuss reciprocal interactions between Ca2+ and allosteric modulators",
                        "describe MD simulations of predicted Ca2+-binding site",
                        "introduce orthosteric and allosteric mGluR modulators",
                        "describe extracellular calcium modulators",
                        "discuss calcium supplements and absorption",
                        "introduce calcium agents, including elemental calcium and calcium salts",
                        "describe neurotransmitter or amino acid as calcium agent",
                        "discuss electric or mechanical stimulation as calcium agent",
                        "introduce methods for measuring extracellular Ca2+ levels",
                        "outline methods of treatment for diseases involving dysfunctional group I mGluR activity",
                        "introduce therapeutic agents for CNS disorders",
                        "combinations of disclosed compositions with other therapeutic agents",
                        "therapeutic agents suitable for combination with disclosed compositions",
                        "employ disclosed compositions with sedatives, hypnotics, anxiolytics, antipsychotics, and antidepressants",
                        "employ disclosed compositions with neuroleptic agents",
                        "employ disclosed compositions with anoretic agents",
                        "employ disclosed compositions with antidepressant or anti-anxiety agents",
                        "employ disclosed compositions with opiate agonists, lipoxygenase inhibitors, and cyclooxygenase inhibitors",
                        "dosage forms of pharmaceutical compositions",
                        "prepare pharmaceutical compositions by bringing active ingredient into association with carrier",
                        "pharmaceutical compositions in form suitable for oral use",
                        "pharmaceutical compositions in form of tablets, troches, lozenges, aqueous or oily suspensions, dispersible powders or granules,",
                        "pharmaceutical compositions in form of emulsions, hard or soft capsules, or syrups or elixirs",
                        "pharmaceutical compositions in form of oil-in-water emulsions",
                        "pharmaceutical compositions in form of sterile injectable aqueous solutions, micellar formulations or oleaginous suspensions",
                        "therapeutically effective amount of mGluR orthosteric or allosteric drug",
                        "dosage level of mGluR orthosteric or allosteric drug",
                        "administration frequency of mGluR orthosteric or allosteric drug",
                        "factors affecting dosage regimen",
                        "therapeutic administration of disclosed compositions"
                    ],
                    "outline_short": [
                        "introduce mGluR1α and its sensing of [Ca2+]o",
                        "describe Ca2+-binding site in the hinge region of the ECD of mGluR1α",
                        "discuss modulating effects of [Ca2+]o on mGluR1α-mediated activation of intracellular Ca2+ signaling",
                        "examine role of [Ca2+]o in modulating actions of orthosteric and allosteric mGluR modulators",
                        "describe orthosteric and allosteric mGluR modulators and their interactions with mGluR1α",
                        "discuss extracellular calcium modulators and their effects on mGluR1α activity",
                        "describe methods for measuring extracellular Ca2+ levels and adjusting them to optimal levels",
                        "outline methods of treatment for diseases or disorders involving dysfunctional group I metabotropic glutamate receptor activity",
                        "describe therapeutic agents for CNS disorders",
                        "discuss combinations of disclosed compositions with other therapeutic agents",
                        "list examples of therapeutic agents for combination therapy",
                        "describe dosage forms of pharmaceutical compositions",
                        "outline methods for preparing pharmaceutical compositions",
                        "describe formulations for oral use",
                        "describe formulations for non-oral use",
                        "discuss therapeutically effective amounts of mGluR orthosteric or allosteric drug",
                        "outline dosage levels and frequency of administration",
                        "describe therapeutic administration routes"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for treating a disease or disorder central nervous system (CNS) in a subject that is fully or partially mediated by a group I metabotropic glutamate receptor (mGluR), comprising administering to the subject:\n(a) an orthosteric agonist, orthosteric antagonist, positive allosteric modulator, or negative allosteric modulator of one or more group I mGluRs, and\n(b) a calcium agent for increasing or decreasing extracellular Ca2+ levels in an amount to modulate the activity of the orthosteric agonist, orthosteric antagonist, or allosteric modulator.",
        "2. The method of claim 1, wherein the one or more group I mGluRs are selected from the group consisting of mGluR1 and mGluR5.",
        "3. The method of claim 1, wherein the orthosteric agonist, orthosteric antagonist, positive allosteric modulator, or negative allosteric modulator is selected from a molecule set forth in Table 1.",
        "4. The method of claim 1, wherein the calcium agent comprises a food or calcium supplement.",
        "5. The method of claim 1, wherein the calcium agent comprises a neurotransmitter or amino acid that affects sensitivity of the mGluR to calcium.",
        "6. The method of claim 1, wherein the calcium agent comprises a neurotransmitter that promotes calcium release from cellular calcium stores.",
        "7. The method of claim 1, wherein the calcium agent comprises an electric or mechanical stimulation.",
        "8. The method of claim 1, wherein the orthosteric agonist, orthosteric antagonist, positive allosteric modulator, or negative allosteric modulator is formulated with the calcium agent in a single dosage unit.",
        "9. The method of claim 1, wherein the disease or disorder is selected from the group consisting of depression, anxiety, drug addiction, chronic pain, Fragile X syndrome (FXS), autism spectrum disorders (ASD), Parkinson's disease, and gastroesophageal reflux disease.",
        "10. The method of claim 9, comprising administering to the subject an orthosteric antagonist or negative allosteric modulator of the one or more group I mGluRs.",
        "11. The method of claim 10, wherein the orthosteric antagonist comprises (s)-MCPG.",
        "12. The method of claim 10, wherein the negative allosteric modulator comprises CPCCOEt.",
        "13. The method of claim 1, wherein the disease or disorder is selected from the group consisting of schizophrenia, cognitive deficits associated with chronic drug use, and deficits in extinction learning.",
        "14. The method of claim 13, comprising administering to the subject an orthosteric agonist or positive allosteric modulator of the one or more group I mGluRs.",
        "15. The method of claim 14, wherein the orthosteric agonist comprises L-Quisqualate.",
        "16. The method of claim 14, wherein the positive allosteric modulator comprises Ro 67-4853.",
        "17. A composition comprising an orthosteric agonist, orthosteric antagonist, positive allosteric modulator, or negative allosteric modulator of one or more group I mGluRs, and a calcium agent for increasing or decreasing extracellular Ca2+ levels.",
        "18. The composition of claim 17, wherein the one or more group I mGluRs are selected from the group consisting of mGluR1 and mGluR5.",
        "19. The composition of claim 17, wherein the orthosteric agonist, orthosteric antagonist, positive allosteric modulator, or negative allosteric modulator is selected from a molecule set forth in Table 1.",
        "20. The composition of claim 17, wherein the calcium agent comprises a food or calcium supplement.",
        "21. The composition of claim 17, wherein the calcium agent comprises a neurotransmitter or amino acid that affects sensitivity of the mGluR to calcium.",
        "22. The composition of claim 17, wherein the calcium agent comprises a neurotransmitter that promotes calcium release from cellular calcium stores.",
        "23. The composition of claim 17, wherein the orthosteric agonist comprises L-Quisqualate.",
        "24. The composition of claim 17, wherein the orthosteric antagonist comprises (s)-MCPG.",
        "25. The composition of claim 17, wherein the positive allosteric modulator comprises Ro 67-4853.",
        "26. The composition of claim 17, wherein the negative allosteric modulator comprises CPCCOEt."
    ]
}