{
    "id": "https://semopenalex.org/work/W2988136993",
    "authors": [
        "Paolo Rossi",
        "Allan L. Goldstein",
        "Claudio Costantini",
        "Luigina Romani",
        "Andréa Bartoli",
        "Enrico Garaci",
        "Silvia Moretti",
        "Vasileios Oikonomou",
        "Marilena Pariano",
        "Claudia Stincardini",
        "Giorgia Renga",
        "Stefano Brancorsini",
        "Andrea Finocchi",
        "Paolo Mosci",
        "Marina Maria Bellet"
    ],
    "title": "Thymosin β4 promotes autophagy and repair via HIF-1α stabilization in chronic granulomatous disease",
    "date": "2019-11-12",
    "abstract": "Chronic granulomatous disease (CGD) is a genetic disorder of the NADPH oxidase characterized by increased susceptibility to infections and hyperinflammation associated with defective autophagy and increased inflammasome activation. Herein, we demonstrate that thymosin β4 (Tβ4), a g-actin sequestering peptide with multiple and diverse intracellular and extracellular activities affecting inflammation, wound healing, fibrosis, and tissue regeneration, promoted in human and murine cells noncanonical autophagy, a form of autophagy associated with phagocytosis and limited inflammation via the death-associated protein kinase 1. We further show that the hypoxia inducible factor-1 (HIF-1)α was underexpressed in CGD but normalized by Tβ4 to promote autophagy and up-regulate genes involved in mucosal barrier protection. Accordingly, inflammation and granuloma formation were impaired and survival increased in CGD mice with colitis or aspergillosis upon Tβ4 treatment or HIF-1α stabilization. Thus, the promotion of endogenous pathways of inflammation resolution through HIF-1α stabilization is druggable in CGD by Tβ4.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Chronic granulomatous disease (CGD) is an immunodeficiency caused by mutations in the proteins forming the NADPH complex, which results in defective production of reactive oxygen species (ROS), impaired microbial killing by phagocytic cells, and increased susceptibility to infections (Rider et al, 2018). A common feature of CGD patients is the presence of a hyperinflammatory state in multiple organs, including the gastrointestinal and urogenital tract, lungs, and eyes (Rider et al, 2018), to which inflammation caused by defective LC3-associated phagocytosis (LAP) greatly contributes (de Luca et al, 2014).",
                "LC3-associated phagocytosis is a noncanonical autophagy pathway that plays a key role in the process of linking signals from phagocytosis to inflammation and innate immune responses (Henault et al, 2012; Martinez et al, 2016). Different from canonical autophagy, LAP is activated during phagocytosis upon recognition of microbes by pattern recognition receptors for rapid pathogen degradation (Simon & Clarke, 2016; Sprenkeler et al, 2016). The efficient clearance of the infectious products promoted by LAP could by itself be sufficient to reduce the inflammatory response and, hence, immunopathology. However, a mechanism by which inflammation is regulated during LAP has been recently described and involves the death-associated protein kinase 1 (DAPK1) (Oikonomou et al, 2016), a kinase mediating many different cellular functions such as cell death and repair (Bialik & Kimchi, 2006; Singh et al, 2016). Activated by IFN-γ, DAPK1 not only mediates LAP of the fungus Aspergillus fumigatus but also concomitantly inhibits nod-like receptor protein 3 (NLRP3) activation, thus restraining pathogenic inflammation (Oikonomou et al, 2016). Of interest, DAPK1 activity was defective in murine and human CGD (Oikonomou et al, 2016), a finding suggesting that the LAP/DAPK1 axis may represent a druggable pathway in CGD (Oikonomou et al, 2018).",
                "Besides participating in direct microbial killing, the generation of ROS by the influx of neutrophils during infection is accompanied by local oxygen consumption that results in a condition known as inflammatory hypoxia, with stabilization of the hypoxia inducible factor-1 (HIF-1)α and resolution of inflammation (Campbell et al, 2014). This phenomenon is particularly relevant in the colonic mucosa, and the effect of HIF-1α in the induction of angiogenesis- and glycolysis-related genes as well as genes involved in mucosal barrier protection has been validated in animal models of colitis and in human-derived colonic tissue (Campbell & Colgan, 2019). Consistent with the role of ROS in inflammatory hypoxia, most CGD patients manifest inflammatory bowel disease–like symptoms (Campbell & Colgan, 2019), and pharmacological stabilization of HIF-1α within the mucosa protected CGD mice from severe colitis (Campbell et al, 2014). Although the contribution of inflammatory hypoxia in the lung is disputed (Taylor & Colgan, 2017), hypoxia develops during pulmonary invasive fungal infection in models of invasive aspergillosis, including CGD mice (Grahl et al, 2011), and HIF-1α stabilization is required for protection (Shepardson et al, 2014). Of note, HIF-1α mediates the autophagic process induced by a hypoxic environment (Bellot et al, 2009), thus raising the interesting hypothesis that a defective HIF-1α induction/stabilization in CGD patients might be causally related to the impaired autophagy and that pharmacological stabilization of HIF-1α might restore LAP/DAPK1 and immune homeostasis during infection with CGD.",
                "Thymosin β4 (Tβ4) is a major g-actin sequestering peptide found in eukaryotic cells and represents 70–80% of the total thymosin content in human tissues. It is an active peptide with 43 amino acids with moonlighting properties and multiple and diverse intracellular and extracellular activities (Goldstein et al, 2005). Several physiological properties of Tβ4 have been reported, including the regulation of wound healing, inflammation, fibrosis, and tissue regeneration (Goldstein et al, 2012). The circumstantial evidence points to Tβ4 as a potential molecule that could link HIF-1α stabilization to LAP in CGD. First, Tβ4 promotes HIF-1α stabilization (Oh et al, 2008; Jo et al, 2010; Oh & Moon, 2010) and, in turn, HIF-1α may transcriptionally regulate Tβ4 expression (Ryu et al, 2014). Second, Tβ4 is the major actin-sequestering molecule in all eukaryotic cells (Ballweber et al, 2002) and the actin networks contribute to autophagosome formation and membrane remodeling during autophagy (Aguilera et al, 2012), which suggests a possible role for Tβ4 in autophagy.",
                "Based on these premises, in the present study, we have resorted to in vitro and in vivo studies involving human cells and mice with CGD to provide evidence that Tβ4 promotes LAP involving DAPK1 in murine and human CGD although concomitantly impairing granuloma formation in the lung and gut of mice with CGD. Both autophagy and repair were dependent on HIF-1α stabilization, in the lung and likely in the gut, a finding qualifying Tβ4 as a promising peptide with beneficial effects in CGD through the promotion of endogenous pathways of autophagy and inflammation resolution."
            ],
            "subsections": []
        },
        {
            "title": "Results",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Tβ4 Promotes Lc3-Associated Phagocytosis Involving Dapk1",
                    "paragraphs": [
                        "In order to assess the ability of Tβ4 to promote autophagy, we first evaluated the ratio of LC3-II to LC3-I, widely used to monitor autophagy (Oikonomou et al, 2016), on RAW264.7 cells exposed to live Aspergillus conidia in the presence of different concentrations of Tβ4. We have already shown that internalized conidia undergo swelling and concomitantly induce autophagy in these cells (de Luca et al, 2014; Oikonomou et al, 2016). Immunoblotting revealed that Tβ4, although not inducing autophagy in unpulsed cells (Fig 1A), dose-dependently increased the LC3-II to LC3-I ratio in cells pulsed with conidia, an effect observed as early as 2 h after the exposure to the fungus (Fig 1B). This finding suggests that Tβ4 could be able to activate LAP. To confirm this, the expression of DAPK1 and Rubicon proteins, known to be involved in LAP (Martinez et al, 2016), was dose-dependently increased by Tβ4 (Fig 1C), a finding suggesting that Tβ4 promotes noncanonical autophagy involving DAPK1 and Rubicon. This result prompted us to assess the ability of Tβ4 to restore LAP in CGD, in vitro and in vivo. To this purpose, we purified macrophages from the lungs of C57BL/6 and p47phox–/– mice and pulsed them in vitro with A. fumigatus conidia in the presence of Tβ4. Consistent with previous findings (de Luca et al, 2014; Oikonomou et al, 2016), both autophagy and DAPK1 expression were defective in the cells from p47phox–/– mice but were dose-dependently restored by Tβ4 (Fig 1D). Confirming the murine observation, Tβ4 also increased LC3B expression in monocytes from CGD patients exposed to Aspergillus conidia in vitro (Fig 1E), a finding suggesting that Tβ4 is able to restore LAP involving DAPK1 in human CGD. For in vivo, we resorted to two different experimental models that mimic the human pathology, such as lung and gut inflammation. To this purpose, we infected C57BL/6 and p47phox–/– mice with A. fumigatus intranasally and treated them with Tβ4 for 7 consecutive days starting a week after the infection. LC3-II (Fig 1F) and DAPK1 (Fig 1G) expression were both defective in p47phox–/– mice but restored by Tβ4 and ablated (LC3-II) upon siTβ4 (Fig S1). For gut inflammation, we resorted to the acute colitis in p47phox–/– mice by administering 2.5% dextran sulfate sodium (DSS) in drinking water for 7 d followed by 7 d of DSS-free autoclaved water. Tβ4 was therapeutically administered daily for 7 d, after DSS treatment, at the time at which mice started to lose weight. The DSS treatment has been reported to repress Dapk1 gene expression in colonic epithelial cells (Takeshima et al, 2012). Consistent with previous findings (de Luca et al, 2014), LC3-II (Fig 1H) and DAPK1 (Fig 1I) expression were both defective in the colon of p47phox–/– mice with colitis as opposed to WT mice but restored upon treatment with Tβ4 (Fig 1H and I)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tβ4 Promotes Hif-1Α Expression In Cgd",
                    "paragraphs": [
                        "Given that the defective LAP in CGD is amenable to restoration by Tβ4, we wonder whether the production of Tβ4 could be defective in CGD. To this purpose, we assessed Tβ4 gene and protein expression in p47phox–/– mice. We found a lower expression of Tβ4 in CGD lungs than that in C57BL/6 mice, both in terms of gene and protein expression, as revealed by real-time (RT) PCR and immunoblotting (Fig 2A) and confirmed by immunofluorescence staining (Fig 2B). Given the reciprocal regulation between Tβ4 and HIF-1α (Oh et al, 2008; Ryu et al, 2014), we assessed whether defective Tβ4 levels in CGD mice could be associated with altered HIF-1α expression. This turned out to be the case, as HIF-1α levels were reduced in CGD mice (Fig 2C and D) and Tβ4 ablation decreased HIF-1α in C57BL/6 mice (Fig S1A). Interestingly, administration of Tβ4 could restore HIF-1α levels in CGD mice (Fig 2E and F), whereas HIF-1α silencing decreased Tβ4 expression (Fig 2B). Defective Tβ4 expression (Fig 2G) and restoration of HIF-1α expression upon administration of Tβ4 (Fig 2H) were also observed in the colon. Consistent with the murine results, Tβ4 also increased HIF-1α expression in monocytes from CGD patients challenged with Aspergillus conidia (Fig 2I), thus suggesting that Tβ4 is able to restore HIF-1α expression in human CGD. These results indicate that intracellular autocrine crosstalk between Tβ4 expression and HIF-1α induction occurs in CGD."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tβ4 Promotes Lap And Mucosal Barrier Protection In An Hif-1Α–Dependent Manner",
                    "paragraphs": [
                        "To assess whether a causal link exists between HIF-1α stabilization and induction of autophagy by Tβ4, we first observed that Tβ4 induced the expression in vitro of Bnip3 and Bnip3l, known to be involved in hypoxia-induced autophagy (Bellot et al, 2009) (Fig S2A). To assess this in vivo, we infected p47phox–/– mice with A. fumigatus intranasally and treated them with Tβ4 in the presence or absence of siRNA for HIF-1α. The restoration of LC3-II (Fig S2B) expression in p47phox–/– mice by Tβ4 was abrogated by HIF-1α inhibition, thus indicating that Tβ4 requires HIF-1α to induce LAP. Moreover, as HIF-1α is also directly involved in mucosal barrier protection in hypoxia (Campbell & Colgan, 2019), this would predict a role for Tβ4 in mucosal protection. To prove this, we selected genes known to be regulated by HIF-1α and measured their levels in vivo after treatment with Tβ4. Our screening revealed that genes involved in angiogenic signaling (Angpt2, Tie2, and Vegfa), remodeling (Fgf2), hormonal regulation (Epo), and cell migration (Cxcr4) were all up-regulated in the lungs of Aspergillus-infected mice upon treatment with Tβ4 (Fig S2C). A similar up-regulation occurred in colons of p47phox–/– mice in the DSS-induced colitis model (Fig S2D). Strikingly, treatment with HIF-1α siRNA completely abrogated the up-regulation induced by Tβ4 in the lung (Fig S2C). Overall, our results indicate that HIF-1α mediates fundamental effects of Tβ4, in the lung and likely in the gut, including LAP and induction of genes involved in the angiogenesis and repair, thus pointing to the Tβ4-HIF-1α axis as a potential therapeutic pathway in CGD."
                    ],
                    "subsections": []
                },
                {
                    "title": "Tβ4 Ameliorates Tissue And Immune Pathologies In Cgd Mice",
                    "paragraphs": [
                        "These results would anticipate a beneficial effect of Tβ4 in diseased CGD mice. To this purpose, we evaluated the effect of Tβ4 in mice with aspergillosis and colitis. The p47phox–/– mice are known to be highly susceptible to pulmonary aspergillosis and inflammation (Romani et al, 2008). Mice were monitored for fungal growth, antifungal activity of effector cells, survival, lung histopathology, and innate and adaptive Th immunity. Thymosin β4 reduced the fungal growth in the lung of both types of mice (Fig 3A), an effect to which the ability of Tβ4 to potentiate phagocytosis and fungal killing of effector phagocytes likely contributed (Fig 3B), and significantly increased the survival of infected mice, being more that 50% of mice survived at the time of which all the untreated mice have died (Fig 3C). Impressively, in p47phox–/– mice, gross lung pathology and histological examination (Fig 3D) revealed no signs of inflammatory lung injury and granuloma formation after Tβ4 administration. Conversely, Tβ4 deficiency by means of siTβ4 administration promoted lung pathology in C57BL/6 mice (Fig S1B). Consistent with the finding that resistance to infection could be restored in these mice by dampening inflammation through NLRP3/IL-1β blocking (de Luca et al, 2014; Iannitti et al, 2016), Tβ4 down-regulated NLRP3 expression in these mice (Fig 3E) and, accordingly, reduced IL-1β, along with TNF-α, IL-17A, and increased IFN-γ production, an effect negated upon siHif1α treatment (Fig 3F). Pathogenic Th2/Th17/Th9 cell responses were down-regulated and protective Th1/Treg cell responses promoted upon Tβ4 treatment (data not shown). Strikingly, the effects on tissue pathology (Fig 3D) and inflammasome expression (Fig 3E) were all abolished by treatment with HIF-1α siRNA, further strengthening the relevance of HIF-1α in mediating Tβ4 effects. These results suggest that Tβ4 ameliorates inflammation and granuloma formation in the CGD lung via HIF-1α. In the murine colitis model, mice were evaluated a day after Tβ4 treatment for weight loss, colon histology, cytokine levels, and tight junction gene expression. Consistent with previous findings (de Luca et al, 2014; Falcone et al, 2016), p47phox–/–mice lost more weight than C57BL/6 mice (about 50% loss of their initial body weight on day 14) (Fig 4A) and had more severe colitis as observed by significantly increased disease activity index scores (Fig 4B). Hematoxylin and eosin staining of colon sections showed severe patchy inflammation characterized by transmural lymphocytic infiltrates, epithelial ulceration, and complete crypt loss (Fig 4C). In addition, p47phox–/– mice displayed high levels of NLRP3 expression (Fig 4D) and IL-1β production (Fig 4E), along with high levels of myeloperoxidase (MPO), TNF-α, and IL-17A (Fig 4F) and low levels of TGF-β (Fig 4G). Treatment with Tβ4 significantly led to weight regain (Fig 4A), decreased disease activity index scores (Fig 4B), amelioration of inflammatory pathology and tissue architecture (Fig 4C), decreased NLRP3 expression (Fig 4D) and inflammatory cytokine levels (Fig 4E and F), and up-regulation of the anti-inflammatory cytokines (Fig 4G). Of interest, Tβ4 greatly promoted the expression of both Cldn1 and Ocln, tight junction proteins that regulate intestinal permeability (Gunzel & Yu, 2013; Kyoko et al, 2014) (Fig 4H), thus suggesting a positive effect on the mucosal barrier function. The protective effect of Tβ4 also occurred when treatment was given concomitantly with DSS (that is, from day 0 to day 7 [Fig S3]), a finding suggesting that prophylactic Tβ4 is also beneficial. Altogether, these results suggest that Tβ4, by activating LAP-DAPK1 and inhibiting inflammasome activity, could have beneficial effects on the outcome of colitis in CGD."
                    ],
                    "subsections": []
                },
                {
                    "title": "Hif-1Α Stabilization Recapitulates The Effects Of Tβ4",
                    "paragraphs": [
                        "Because HIF-1α mediates the effects of Tβ4 in CGD, we sought to investigate whether the stabilization of HIF-1α independent of Tβ4 could similarly exert beneficial effects. For this reason, given the well-known beneficial effects of HIF-1α stabilization on disease outcomes and barrier function in animal models of intestinal inflammation (Colgan et al, 2015), we treated p47phox–/– mice with aspergillosis with dimethyloxalylglycine (DMOG)—a cell-permeable competitive inhibitor of prolyl hydroxylase (PHD) that stabilizes HIF-1α (Mole et al, 2003)—for 5 d. Similar to Tβ4, DMOG reduced fungal burden (Fig 5A), ameliorated lung pathology (Fig 5B), increased HIF-1α expression (Fig 5C), and up-regulated HIF-1α-responsive genes (Fig 5D). Thus, HIF-1α stabilization could be a therapeutic target in CGD."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Discussion",
            "paragraphs": [
                "The results of the present study show that Tβ4 restored autophagy and up-regulated hypoxia-responsive genes in human and murine CGD and this resulted in amelioration of disease pathology (Fig 5E). The increased autophagy, epithelial barrier protection, and repair induced by Tβ4 are consistent with its antioxidative and antiapoptotic effects (Kumar & Gupta, 2011) and represents a plausible mechanism through which inflammation and granuloma formation are balanced in CGD by Tβ4. It is clear that the innate immune system is pivotal in orchestrating granuloma formation in response to microbial and foreign body challenge (Petersen & Smith, 2013). Impaired antibacterial autophagy links inflammation to granuloma formation in intestinal diseases (Lassen & Xavier, 2018). By promoting LAP, Tβ4 may successfully contribute to pathogen elimination, thus clearly preventing granuloma formation. Thus, the beneficial activity of Tβ4 may encompass a possible activity on the microbial composition at different body sites. Moreover, by inducing TGF-β (Sosne et al, 2004)—known to modulate the fibrotic repair process accompanying granuloma healing (Limper et al, 1994)—Tβ4 may impair granuloma formation. However, excess TGF-β activity, by preventing effective granuloma formation, may interfere with antimicrobial mechanisms (Toossi et al, 1995). Thus, whether the high levels of TGF-β (Toossi et al, 1995) and Tβ4 (Kang et al, 2014) observed in granulomatous lung lesions or colorectal cancer (Gemoll et al, 2015) are the cause or effect of defective granuloma formation needs clarification.",
                "In lung aspergillosis, and likely in DSS-induced colitis, the effects of Tβ4 were dependent on HIF-1α that mediated not only the induction of autophagy but also the up-regulation of hypoxia-responsive genes. Interestingly, Tβ4 up-regulated HIF-1α–dependent genes, involved in barrier protection and angiogenesis and not in glycolysis, are known to contribute to inflammation in myeloid cells (Palazon et al, 2014) (Fig S4A), thus suggesting the unique ability of Tβ4 to activate physiologic HIF-1α to resolve inflammation. HIF-1α can be regulated by both oxygen-dependent and oxygen-independent mechanisms in hypoxic and normoxic conditions, respectively, and strategies are being studied to either activate or inhibit the activity of HIF-1α depending on the clinical setting (Giaccia et al, 2003; Yee Koh et al, 2008). Indeed, whereas HIF-1α inhibition is recognized as an antitumor therapeutic strategy, up-regulation of HIF-1α is critical in the treatment of ischemic states (Giaccia et al, 2003; Yee Koh et al, 2008). In the context of CGD, HIF-1α was underexpressed in the gastrointestinal mucosa and lung, suggesting that a potential therapy for CGD should include the elevation of HIF-1α levels to restore the hypoxia-mediated tissue homeostasis and the optimal antimicrobial response. It has indeed been reported that hypoxia and HIF proteins are required for protection against Pseudomonas aeruginosa in vitro (Schaible et al, 2013) and against A. fumigatus in vivo (Shepardson et al, 2014).",
                "The dependency of Tβ4 activity on HIF-1α in lung aspergillosis, and likely in DSS-induced colitis, underpins a more general relationship between the two molecules. In agreement with the published literature (Oh et al, 2008; Ryu et al, 2014), we found that Tβ4 and HIF-1α crossregulate their reciprocal expression being the levels of HIF-1α defective in CGD mice but restored by Tβ4 and, conversely, silencing of HIF-1α in wild-type mice being associated with reduced levels of Tβ4. Several mechanisms might underlie the ability of Tβ4 to regulate HIF-1α expression. Thymosin β4 may inhibit PHDs that target HIF-1α to degradation. Prolyl hydroxylases can be inhibited through succinate upon accumulation by inhibition of succinate dehydrogenase (Selak et al, 2005). Interestingly, in the mouse model of lung inflammation, Tβ4 increased the levels of Irg1 (Fig S4B), the enzyme responsible for the production of the anti-inflammatory mediator itaconate, an inhibitor of succinate dehydrogenase (Lampropoulou et al, 2016), thus raising the intriguing possibility that Tβ4, by regulating succinate levels, might modulate the levels of HIF-1α via PHDs. However, it has been reported that itaconate may also down-regulate HIF-1α levels (Lampropoulou et al, 2016). Alternatively, Tβ4 might stabilize HIF-1α through the production of mitochondrial reactive oxygen species (mtROS), as previously reported (Oh & Moon, 2010). Indeed, we could detect production of mtROS from isolated alveolar macrophages challenged with conidia and treated with Tβ4 (Fig S4C and D), thus supporting the hypothesis that mtROS might mediate the regulation of HIF-1α levels by Tβ4. The ability of Tβ4 to induce mtROS is reminiscent of the activity of pioglitazone, a peroxisome proliferator–activated receptor γ (PPARγ) agonist, currently approved for the treatment of diabetes mellitus type 2 and recently proposed as a therapeutic molecule for CGD (Migliavacca et al, 2016). In normal phagocytes, PPARγ activation linked NADPH oxidase activity with enhanced mtROS production (Fernandez-Boyanapalli et al, 2010), but this mechanism was defective in CGD. Peroxisome proliferator–activated receptor γ agonists, such as pioglitazone, could bypass the need for the NADPH oxidase for enhanced mtROS production and partially restored host defense in CGD. Given that pioglitazone is currently in a phase1/phase2 trial in CGD patients with severe infection (https://clinicaltrials.gov/ct2/show/NCT03080480), it will be intriguing to assess whether endogenous Tβ4 is involved in the clinical efficacy of pioglitazone.",
                "Whatever the mechanism by which Tβ4 regulates HIF-1α expression, the recent finding that HIF-1α reprograms ILC3 metabolism for mucosal barrier protection (Di Luccia et al, 2019), offers a further plausible explanation for the protective function of Tβ4 at the mucosal level.",
                "In conclusion, by unraveling the biological activity of Tβ4 in CGD, this study points to the relevance of mtROS production and HIF-1α stabilization as druggable pathways promoting autophagy and repair in CGD."
            ],
            "subsections": []
        },
        {
            "title": "Materials And Methods",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Ethics Statement",
                    "paragraphs": [
                        "Patients and healthy volunteers gave written consent to participate as approved by the pediatric hospital Bambino Gesù Institutional Review Board. Murine experiments were performed according to the Italian Approved Animal Welfare Authorization 360/2015-PR and Legislative degree 26/2014 regarding the animal license obtained by the Italian Ministry of Health lasting for 5 yr (2015–2020)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Cell Culture And Treatments",
                    "paragraphs": [
                        "RAW264.7 cells (American Type Culture Collection) were grown in supplemented Roswell Park Memorial Institute (RPMI) medium as described (De Luca et al, 2012). Cells were exposed to 10 or 100 nM of Tβ4 (RegeneRx Biopharmaceuticals) for 2 and 4 h at 37°C in 5% CO2 or pretreated for 1 h with Tβ4 at the same concentration before 2 h pulsing with live A. fumigatus conidia or inert beads (LB30; Sigma-Aldrich). Alveolar macrophages from the lung of C57BL/6 and p47phox–/– uninfected mice were obtained after 2 h of plastic adherence at 37°C. Cells were treated as above and evaluated for cellular autophagy markers. Monocytes were isolated from PBMC of healthy donors or two CGD patients, harbouring the mutations c.736C>T, p.Q246X, and whole CYBB gene deletion (69, 84 kb), after informed consent, as described (De Luca et al, 2012). Cells were assessed for LC3 and HIF-1α expression by immunofluorescence."
                    ],
                    "subsections": []
                },
                {
                    "title": "Mice",
                    "paragraphs": [
                        "The 6- to 8-wk C57BL/6 (wild type, WT) mice were purchased from Charles River (Calco). Genetically engineered homozygous p47phox–/– mice were bred at the Animal Facility of Perugia University, Perugia, Italy."
                    ],
                    "subsections": []
                },
                {
                    "title": "Fungal Infection And Treatments",
                    "paragraphs": [
                        "Viable conidia from the A. fumigatus Af293 strain were obtained as described (De Luca et al, 2012). Mice were anesthetized in a plastic cage by inhalation of 3% isoflurane (Forane Abbott) in oxygen before intranasal instillation of 2 × 107 resting conidia/20 μl saline. For survival curves, p47phox–/– mice were challenged with 3 × 109 conidia/20 μl saline. Thymosin β4 was administered i.p. at a dose of 5 mg/kg as an effective dose as described (Badamchian et al, 2003), every day in concomitance with (days 0→7) or after (days 7→14) infection. Dimethyloxalylglycine (Merck Millipore) was administered i.p. at a dose of 8 mg/mouse concomitantly to the infection. For Hif1a (duplex name mm.Ri.Hif1a.13.1; 5′-GAUAUGUUUACUAAAGGACAAGUCA-3′; 3′-UACUAUACAAAUGAUUUCCUGUUCAGU-5′) and Tmsb4x silencing (duplex name mm.Ri.Tmsb4x.13.1; 5′-CACAUCAAAGAAUCAGAACUACUGA-3′; 3′-AAGUGUAGUUUCUUAGUCUUGAUGACU-5′), each mouse received intranasal administration of 10 mg/kg unmodified siRNA or equivalent dose of nonspecific control siRNA duplex in a volume of 20 μl of duplex buffer (IDT). Intranasal siRNA was given once the day before infection and 1, 3, and 5 d after infection (Iannitti et al, 2013b). It is known that lung-specific siRNA delivery can be achieved by intranasal administration without the use of viral vectors or transfection agents in vivo (Iannitti et al, 2013a). Mice were euthanized 7 or 14 d postinfection. Fungal burden was determined by quantitative PCR and expressed as conidial equivalents. Lung tissue was aseptically removed and homogenized in 3 ml of sterile saline. Lung homogenates were subjected to a secondary homogenization step with 0.5 mm glass beads in Bead Beater homogenizer (Gemini BV) and then processed for DNA extraction with the QIAamp DNA Mini Kit (QIAGEN) according to the manufacturer’s directions. Fungal burden was quantified by quantitative PCR by using the sequences for the multicopy 18S ribosomal DNA gene. For lung histology, sections (3–4 μm) of paraffin-embedded tissues were stained with periodic acid-Schiff."
                    ],
                    "subsections": []
                },
                {
                    "title": "Dss-Induced Colitis",
                    "paragraphs": [
                        "DSS (2.5% wt/vol, 36,000–50,000 kD; MP Biomedicals) was administered in drinking water ad libitum for 7 d. Fresh solution was replaced on day 3. Mice were injected with 5 mg/kg of Tβ4 every day i.p. in concomitance with (days 0→7) or after (days 7→14) DSS administration. The control received the diluent alone. Weight loss, stool consistency, and faecal blood were recorded daily. Upon necropsy (7 and 14 d after DSS administration), tissues were collected for histology and cytokine analysis. Colonic sections were stained with hematoxylin and eosin. The colitis disease activity index was calculated daily for each mouse based on weight loss, occult blood, and stool consistency. A score of 1–4 was given for each parameter as described (McNamee et al, 2011)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunoblotting",
                    "paragraphs": [
                        "For immunoblotting, organs or cells were lysed in Radio-Immunoprecipitation Assay buffer. The lysate was separated in SDS–PAGE and transferred to a nitrocellulose membrane. The membranes were incubated with the following primary antibodies at 4°C overnight: anti-DAPK1 (antibodies-online.com), anti-Rubicon and anti-NLRP3 (Cell Signaling), anti-Tβ4 (Abcam), and anti-LC3B (Novus; Cell Signaling or Abcam). Normalization was performed by probing the membranes with mouse anti-β-actin and anti-Gapdh antibodies (Sigma-Aldrich). Normalization was performed on mouse β-actin or Gapdh, and corresponding pixel density was depicted. LC3-II band density was normalized to LC3-I to obtain the ratio. The ratio of the untreated control was set as one. Chemiluminescence detection was performed with LiteAblot Plus chemiluminescence substrate (EuroClone S.p.A.), using the ChemiDocTM XRS+ Imaging System (Bio-Rad) and quantification was obtained by densitometry image analysis using Image Lab 5.1 software (Bio-Rad)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Immunofluorescence Staining",
                    "paragraphs": [
                        "For immunofluorescence, monocytes from CGD patients or controls were grown in supplemented RPMI and placed on microscope glass slides at 37°C for adhesion. Slides were then washed with PBS and fixed with 4% of paraformaldehyde. Cells were incubated in blocking solution (PBS-3% BSA-0.1% Triton X-100) with anti-LC3B antibody (Nanotools) and anti-HIF-1α (Abcam). After overnight staining with primary antibodies, slides were washed and incubated with anti-IgG and rabbit-TRITC (Sigma-Aldrich). Alexa Fluor 488 phalloidin was used for selective labelling of F-actin. LC3B (Abcam), Tβ4 (ABclonal), HIF-1α, and NLRP3 (Abcam) staining of lung sections were performed as described. Nuclei were counterstained with DAPI. Images were acquired using a fluorescence microscope (BX51; Olympus) and analySIS image processing software (Olympus)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Rt Pcr",
                    "paragraphs": [
                        "Real-time PCR was performed using CFX96 Touch RT PCR Detection System and SYBR Green chemistry (Bio-Rad). Organs or cells from pooled mice (n = 6–8 mice/group for lungs and n = 10 mice/group for colons) were lysed, and total RNA was reverse transcribed with PrimeScript RT Reagent Kit with gDNA Eraser (Takara), according to the manufacturer’s instructions. The PCR primers sequences (5′-3′) are as follows:Ptmb4: ACAAACCCGATATGGCTGAG and GCCAGCTTGCTTCTCTTGTTHif1a: TCAAGTCAGCAACGTGGAAG and TTCACAAATCAGCACCAAGCHif1b: CAAGCATCTTTCCTCACTGATC and ACACCACCCGTCCAGTCTCACldn1: AGCCAGGAGCCTCGCCCCGCAGCTGCA and CGGGTTGCCTGCAAAGTOcln: GTTGATCCCCAGGAGGCTAT and CCATCTTTCTTCGGGTTTTCVegfa: CAGGCTGCTGTAACGATGAA and GCATTCACATCTGCTGTGCTFgf2: CGACCCACACGTCAAACTAC and GCCGTCCATCTTCCTTCATABnip3: GCTCCCAGACACCACAAGAT and TGAGAGTAGCTGTGCGCTTCBnip3l: CCTCGTCTTCCATCCACAAT and GTCCCTGCTGGTATGCATCTAngpt2: GAACCAGACAGCAGCACAAA and TGGTCTGATCCAAAATCTGCTTie2: CGGCCAGGTACATAGGAGGAA and TCACATCTCCGAACAATCAGCEpo: ACTCTCCTTGCTACTGATTCCT and ATCGTGACATTTTCTGCCTCCCxcr4: GGGTCATCAAGCAAGGATGT and GGCAGAGCTTTTGAACTTGGDapk1: CCTGGGTCTTGAGGCAGATA and TCGCTAATGTTTCTTGCTTGGLdha: AGGCTCCCCAGAACAAGATT and TCTCGCCCTTGAGTTTGTCTPkm: CGATCTGTGGAGATGCTGAA and AATGGGATCAGATGCAAAGCGlut1: GCTGTGCTTATGGGCTTCTC and CACATACATGGGCACAAAGCIrg1: AGTTCCAACACCTCCAGCAC and GGTGCCATGTGTCATCAAAA",
                        "Amplification efficiencies were validated and normalized against Gapdh. The thermal profile for SYBR Green RT PCR was at 95°C for 3 min, followed by 40 cycles of denaturation for 30 s at 95°C, and an annealing/extension step of 30 s at 60°C. Each data point was examined for integrity by analysis of the amplification plot."
                    ],
                    "subsections": []
                },
                {
                    "title": "Elisa",
                    "paragraphs": [
                        "To evaluate cytokine production in DSS-induced colitis, colons were opened longitudinally and washed in complete medium with antibiotics and were cultured at 37°C for 24 h in RPMI and 5% FBS. The supernatants were collected for ELISA. The levels of cytokines were determined by using specific ELISAs (R&D Systems) in accordance with the manufacturer’s protocols. The concentration of secreted cytokines in the colon supernatants or lung homogenates was normalized to total tissue protein by using Quant-iT Protein Assay Kit (Life Technologies). Results are expressed as picogram of cytokine per microgram of total protein. The myeloperoxidase (MPO) content in colonic tissues were determined using commercially available kits (Nanjing Jiancheng Bioengineering Institute)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Antifungal Effector Activity",
                    "paragraphs": [
                        "Murine polymorphonuclear (PMN) cells from C57BL/6 or p47phox–/– uninfected mice were positively selected with magnetic beads (Miltenyi Biotec) from the peritoneal cavity of mice 8 h after the intraperitoneal injection of 1 ml endotoxin-free 10% thioglycolate solution. On FACS analysis, Gr-1+PMNs were 98% pure and stained positive for the CD11b myeloid marker. Monolayers of plastic-adherent macrophages were obtained, after 2 h plastic adherence, from the lung of C57BL/6 and p47phox–/– uninfected mice. Cells were pretreated for 1 h with different concentrations of Tβ4 (10 and 100 nM) before pulsing with A. fumigatus conidia (1:3 cell:fungus for phagocytosis and 10:1 cell:fungus for conidiocidal activity) for 120 min at 37°C. The percentage of CFU inhibition (mean ± SD) was determined as described previously (Bellocchio et al, 2004)."
                    ],
                    "subsections": []
                },
                {
                    "title": "Ros Determination",
                    "paragraphs": [
                        "Alveolar macrophages from the lung of C57BL/6 and p47phox–/– uninfected mice were assessed for intracellular ROS production by dihydrorhodamine 123 (DHR) evaluation. As an inhibitor, we used MitoTEMPO to scavenge mitochondrial ROS. For ROS determination, 10 μM DHR (Sigma-Aldrich) was added to cells exposed to 100 nM Tβ4, 10 ng/ml PMA (phorbol 12-myristate 13-acetate) (Sigma-Aldrich), and/or A. fumigatus conidia at cell:fungus of 1:1 for 1 h at 37°C. Cells were plated on a 96-well culture plate in HBSS buffer with Ca2+ and Mg2+ but without phenol red. Cells were preincubated with 50 μM MitoTEMPO (Enzo Life Science) for 1 h before the addition of Tβ4. The DHR was measured by the multifunctional microplate reader Tecan Infinite 200 (Tecan) at different time points. The results expressed as relative fluorescence units are the means ± SD of at least two experiments in duplicate."
                    ],
                    "subsections": []
                },
                {
                    "title": "Statistical Analysis",
                    "paragraphs": [
                        "GraphPad Prism 6.01 program (GraphPad Software) was used for analysis. Data are expressed as mean ± SD. Statistical significance was calculated by using two-way ANOVA (Tukey or Bonferroni post hoc test) for multiple comparisons and unpaired t test for single comparisons. Statistical analysis of the survival curves was performed using the log-rank (Mantel–Cox) test. The variance was similar in the groups being compared. Cell fluorescence intensity was measured by using ImageJ software."
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}