{
    "id": "https://semopenalex.org/work/W1503841649",
    "authors": [
        "Gaetano Iaquaniello",
        "Emma Palo",
        "Annarita Salladini",
        "L. Basini",
        "A. Lainati",
        "Elena Antonetti",
        "Alessandra Guarinoni",
        "B. Cucchiella"
    ],
    "title": "Natural Gas Catalytic Partial Oxidation: A Way to Syngas and Bulk Chemicals Production",
    "date": "2012-10-31",
    "abstract": "© 2012 Iaquaniello et al., licensee InTech. This is an open access chapter distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/3.0), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. Natural Gas Catalytic Partial Oxidation: A Way to Syngas and Bulk Chemicals Production",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "The term Syngas is used for describing a mixture containing H2 and CO, together with minor amounts of CO2 and CH4. Syngas can be produced from Natural Gas (NG), refinery off-gases, naphtha, heavy hydrocarbons and also from coal. The choice of a particular raw material depends on cost and availability of the feedstock, and on downstream use of syngas.",
                "Main utilisations of syngas (Figure 1) are: i) the synthesis of Ammonia/Urea, ii) the oil refining operations, iii) the synthesis of Methanol and its derivatives, iv) the synthesis of liquid hydrocarbons via Fischer-Tropsch processes and v) other \"minor\" applications such as Iron ores reduction, fine chemistry productions, electronic, glass industry activities (Song and Guo, 2006). The H2/Syngas production capacity has always been increasing and it is still rising, particularly in the growing economies, in Middle East Countries and in almost all refineries spread worldwide.",
                "Since syngas is an intermediate for feeding very different processes its composition and particularly the H2/CO ratios are also very different (Moulijn et al., 2001). For example, in the synthesis of methanol, CO2 and CO are both reactants and its composition is determined by a module M = (H2-CO2)/(CO+CO2) that should be close to 2.0 (mole/mole). Instead for Fischer Tropsch synthesis Gas to Liquid (GTL) applications, in which CO2 is not a reactant molecule, the required synthesis gas compositions have a H2/CO ratio of about 2.0 (mole/mole). The optimal H2/CO ratio is lowered to 1.0 mole/mole for aldehydes productions via olefins hydroformylation. Sometimes, pure CO is required for the carbonylation process. However, the two main synthesis gas applications, the synthesis of Ammonia/Urea and the Oil Refining treatments, require the maximisation of H2 production.",
                "The most utilised synthesis gas production processes are:",
                "Steam reforming is a catalytic and energy efficient technology for producing a H2 rich syngas from light hydrocarbons like NG, refinery off-gases, LPG or Naphta. Partial oxidation is a non-catalytic technology with a unique possibility of utilising heavy hydrocarbon feedstock and produces a CO rich syngas at temperatures between 1100-1400°C. Its energy efficiency is lower than SR. ATR combines gaseous phase combustion reactions and catalytic steam/CO2 reforming reactions; it is much less applied than SR and POx but it is the optimal choice for integration with large scale MeOH production plants and GTL processes (Holladay et al., 2009).",
                "Despite the long term R&D and industrialisation effort that has lead to the optimisation of these technologies a relevant effort is still ongoing for defining new radical improvements allowing a reduction of the capital and energy requirements of the syngas production step. The Short Contact Time -Catalytic partial Oxidation technology, among the various proposed solutions, has reached enough reliability to promote its industrialisation and in the following chapters this promising new solution will be compared with the most consolidated technologies."
            ],
            "subsections": []
        },
        {
            "title": "Main current technologies for syngas production",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "The Steam Reforming (SR)",
                    "paragraphs": [
                        "SR is the most utilised technology for producing synthesis gas. This technology reacts light desulphurised hydrocarbons (S content ca. 50 ppb) with steam; for instance SR of Methane is represented with eq. ( 1):",
                        "When utilised for H2 production the SR step is followed by a Water Gas Shift (WGS) step for CO conversion (2):",
                        "Subsequently H2 is purified with a Pressure Swing Adsorption (PSA) step (Song and Guo, 2006).",
                        "SR units include two sections, namely a radiant and a convective section. Reforming reactions take place inside the radiant section. In the convective section, heat is recovered from the hot product gases for preheating the reactants feeds and for generating superheated steam.",
                        "The endothermic SR reactions are catalysed by Ni based materials in which the Ni species are deposited onto ceramic supports composed by alumina and/or alumina and magnesium spinels (Rostrup-Nielsen, 1993). Some discussions on the possible utilisation of noble metal based catalyst also including alkaline earth species are reported in literature (Faur Ghenciu, 2002;Navarro et al., 2007). The catalysts are included inside tubes inserted into the radiant furnace. The catalytic tubes have a diameter between 3 and 5 inches and a length ranging between 6 and 13 m. A radiant furnace may contain 500-600 reaction tubes. Typically gas temperatures at the exit of the tubes are higher than 800°C and pressures are comprised between 15-30 barg. One criticality of SR is represented by the thermo-mechanical resistance of the tubes, whose skin temperature remains at values 100-150°C higher than those of the reaction environment for allowing high heat transfer rates. For this reason the tubes are casted with alloys having a high Cr and Ni content (25-35%) and their positioning inside the radiant furnace is determined both by the necessity of increasing heat fluxes towards the reaction zone and by the requirements on the avoidance of impingement between tubes and flames produced by the burners. This impingement would lead to rapid collapse of the tubes (Ahmed and Krumpelt, 2001).",
                        "The hydrocarbons feedstock is fed into the reforming tubes after being mixed with steam at steam/carbon ratios higher than 2.3 v/v, more often higher than 2.7 v/v; this excess Steam is required both for completing the hydrocarbon reactions and for avoiding the occurrence of carbon formation reactions (3-5).",
                        "Carbon and soot formation reactions would lead to pressure drop increase, catalyst deactivation and reaction rates reduction, causing serious heat transfer problems and tube damages (Peña et al., 1996).",
                        "Higher hydrocarbons are much more reactive towards reaction (3) than methane. For this reason, sometimes, these C2+ molecules are converted inside an adiabatic pre-reformer unit (Rostrup-Nielsen et al., 1998). This unit can be designed and operated at relatively low temperatures (ca. 550°C) leading to several advantages such as size reduction of the reformer furnace and/or increase of the production capacity (Joensen and Rostrup-Nielsen, 2002;Christensen, 1996)."
                    ],
                    "subsections": []
                },
                {
                    "title": "The non-catalytic Partial Oxidation (POx)",
                    "paragraphs": [
                        "The chemistry of the POx technology is based on the partial combustion of fuels that in case of CH4 is represented with equation ( 6)",
                        "However this process is mainly utilised for producing syngas from heavy hydrocarbons, including deasphalter pitch and petroleum coke. These are pre-heated and then mixed with Oxygen within a burner; after ignition, reactions occur inside a high temperature combustion chamber producing an effluent that contains various amounts of soot, depending on feedstock composition. Reactor exit gas temperatures are typically comprised between 1200-1400°C. The obtained syngas has to be cooled and cleaned within a \"washing\" section for removing the impurities. The high temperature (1400-1100°C) heat recovery in POx is not very efficient and indeed the POx advantage over SR is in the possibility of utilising a \"low value\" feedstock, even containing sulphur and other compounds that would poison the SR catalysts. Currently the main utilisations of POx are: (i) in H2 production for refinery applications, (ii) synthesis gas production from coal and (iii) in electric energy production from petroleum coke and deasphalter bottoms, through large Integrated Gas Turbine Combined Cycles (IGCC)."
                    ],
                    "subsections": []
                },
                {
                    "title": "The Autothermal reforming (ATR)",
                    "paragraphs": [
                        "ATR combines non-catalytic partial oxidation and catalytic steam and CO2 reforming of light and highly de-sulphurated NG in a single reactor. The process was developed in the late 1950s by Haldor Topsøe A/S, mainly for producing syngas for methanol and ammonia plants and also for the Fischer-Tropsch synthesis (Christensen and Primdhal, 1994;Aasberg-Petersen et al., 2001). The NG is mixed at high temperature with a mixture of Oxygen and Steam and ignited in a combustion chamber originating a sub-stoichiometric flame that can be represented with eq. ( 7). ",
                        "By proper adjustment of oxygen to carbon and steam to carbon ratios the partial combustion in the thermal zone (7) supplies the heat for completing the subsequent endothermic steam and CO2 reforming reactions (Joensen and Rostrup-Nielsen, 2002). The product gas composition at the exit of the reactor results very close to the thermodynamic equilibrium of an adiabatic reactor, especially in large scale processes (Rostrup-Nielsen, 2000).",
                        "ATR is also utilised as a \"secondary reformer\" (for lowering the CH4 residue) and it is placed after a primary SR in syngas plants integrated with Ammonia synthesis reactors. In this case the \"secondary\" ATR is fed with the syngas produced from SR and Air."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "The Short Contact Time -Catalytic Partial Oxidation (SCT-CPO) technology",
            "paragraphs": [
                "Initial observation on the occurrence of short contact time hydrocarbon oxidation processes were reported in the years 1992-1993 (Choudary et al., 1992;Hickman et al. 1992). These processes have been deeply studied since then, and the number of scientific articles published every year on this topic, is still high. They are produced by colliding for few milliseconds, gaseous premixed reactant flows with extremely hot catalytic surfaces. The fast and selective chemistry that is originated is confined inside a thin (<1 mm) solid-gas inter-phase zone surrounding the catalyst particles. Here, the molecules spend 10 -6 s at temperatures variable between 600 -1200° C. A key issue for the technological exploitation is in the possibility of avoiding the propagation of reactions into the gas phase, that has to remain at a \"relatively low\" temperature. This condition favours the formation of primary reaction products (namely CO and H2) inhibiting chain reactions. Indeed some experimental studies whose results have been partially described in literature (Schwiedernoch et al., 2003;Hickman et al., 1993;Basini et al., 2000;Grunwaldt et al., 2001;Grunwaldt et al., 2002;Bizzi et al., 2002;Bizzi et al., 2003;York et al., 2003) indicate that partial and total oxidation products are directly produced through parallel and competing surface reactions and that the formation of partial oxidation products is favoured under SCT conditions due to the very high surface temperatures. By proper choice of the operating conditions, surface temperatures are locally much higher than those predicted by thermodynamic equilibrium calculations assuming adiabatic reactors. The occurrence of the reactions in these local environments determines in some cases conversion and selectivity values higher than those predicted by the thermodynamic equilibrium at the reactor exit temperatures (Basini, 2001). Moreover, the very high surface temperatures inhibit catalyst deactivation phenomena related to chemical poison effects (Basini, 2005 andBasini, 2006). For these and other related reasons, this chemical process is carried out in very small reactors having a very high flexibility towards reactant flow variations. It has also been found that several hydrocarbon feedstocks, even containing sulphur and aromatic compounds can be fed to a SCT-CPO reactor for producing synthesis gas. Now a long term R&D effort is approaching the industrialization phase of a technology whose main advantages concern:",
                "i. Small dimensions, technical and operational simplicity ii. Possibility of modular construction of pre-fabricated and skid mounted units iii. Flexibility towards feedstock composition & production capacity iv. Reduction of investment costs and energy consumption v. Reduction of CO2 production and possibility of an almost complete CO2 capture in case of H2 production plants"
            ],
            "subsections": [
                {
                    "title": "SCT-CPO for H2 production and CO2 sequestration",
                    "paragraphs": [
                        "Selectivity and conversion of SCT-CPO are determined by the high temperatures of catalytic surfaces, much higher than gas phase temperatures resulting in an adiabatic equilibrium reactor. This allows mild pre-heating of the reactants, thus reducing CO2 emissions coming from pre-heating furnaces. Pre-heating is required only for the hydro-desulphurisation (HDS) of the feedstock, occurring in a temperature range typically comprised between 340-390°C depending on the hydrocarbon feedstock.",
                        "Figure 2 includes a schematic description of the SCT-CPO characteristics indicating that several feedstocks can be utilised for H2 production and showing that in the absence of preheating furnaces great part of the produced CO2 can be removed after the WGS section.  Now it is noted that CO2 emissions from SR result from two sources:",
                        "1. Steam Reforming and Water Gas Shift reactions producing ca. 60% of total CO2 2. Total combustion inside the reformer furnace producing the other 40% of total CO2 However, while the removal of CO2 from source (1) with an absorbent medium (i.e. amine or carbonate solutions) is feasible at a reasonable cost, the removal from source (2), a Flue Gas at low pressure including a large volume of Air, would be really expensive and complex. Indeed H2 production via SR is a very important Green House Gas (GHG) producer in refining operations (20-40% of the overall CO2 emissions).",
                        "Nowadays, in a context wherein CO2 taxation is increasing and refining operation are required to reduce GHG, the utilisation of SCT-CPO technology, particularly if integrated with CO2 removal, would be really advantageous. This point is further discussed by commenting the Process Flow Diagram of Figures 4 and5.",
                        "In the PFD shown in Figure 4 the feed is mixed with hydrogen and pre-heated for the next HDS step accounting for 2% wt of the total produced CO2. The preheated stream is then mixed with steam and oxygen into the SCT-CPO reactor to produce synthesis gas. The hot synthesis gas is cooled in a Waste Heat Boiler (WHB) generating high pressure steam, partially utilized for a two-step WGS section, namely a high temperature shift (HTS) and a low temperature shift (LTS). Then a CO2 removal section is included before the H2 purification step, performed with a Pressure Swing Adsorption unit (PSA).",
                        "An alternative process scheme solution (see Figure 5) could also be utilized in situations in which a low H2 purity (ca. 98% v/v) is required.",
                        "An effort for assessing the potential advantages of these process scheme solutions has been performed by comparing the economics of SCT-CPO and SR in several different scenarios and for different plant capacities (10,000 -50,000 and 100,000 Nm 3 /h of H2), as summarized in Figure 6 (Basini and Iaquaniello, 2011). It appears evident that in any scenario case (D), namely the H2 production with SR including a CO2 removal section would be the less advantageous solution. Instead in the great part of the examined conditions case (B), namely the H2 production with SCT-CPO including a CO2 removal section is the most advantageous solution."
                    ],
                    "subsections": []
                },
                {
                    "title": "SCT-CPO to remove the bottleneck for H2 production inside a refinery",
                    "paragraphs": [
                        "Small size, technological simplicity and easy operability of SCT-CPO technology allows the pre-fabrication of the syngas production unit and the transportation of the reactor package to the utilisation site where it would be installed, requiring few interconnections minimising the interference risks with the ongoing industrial operations. Accordingly, one of the application of the SCT-CPO technology currently pursued, concerns removing the bottleneck of an existing SR (Figure 7). In this case the SCT-CPO reactor placed in parallel to an existing SR unit will utilise the same feedstock and will release the produced synthesis gas to an existing WGS and PSA \"train\". A similar concept could be used to revamp ammonia/urea plant to enhance the urea production. In this case the CPO reactor installed in parallel to the exiting train provides the extra CO2 required increasing the urea production."
                    ],
                    "subsections": []
                },
                {
                    "title": "Notes on SCT-CPO integration in Ammonia/Urea production processes",
                    "paragraphs": [
                        "Ammonia/Urea production is currently achieved with the following main steps:",
                        "1. hydro-desulphurisation 2. pre-reforming (optional)",
                        "3. primary SR section with H2O/C ratio of about 3 v/v 4. secondary air blown ATR reformer 5. high temperature and low temperature shift conversion 6. CO2 removal 7. CO methanation 8. syngas compression Two different schemes can be proposed for producing ammonia and Urea via SCT-CPO. These schemes are reported in Figures 8 and9 and both include the following steps:",
                        "1. hydro-desulphurisation 2. mixing of desulfurized feed with enriched air and super-heated steam 3. SCT-CPO reforming for producing the syngas 4. cooling of the syngas in a process gas boiler (PGB) and Steam addition 5. high temperature and low temperature shift conversion 6. CO2 removal unit 7. CO methanation 8. syngas compression In the PFD schematised in Figure 8 the SCT-CPO reactor is fed with enriched Air, while the PFD shown in Figure 9 utilises an O2-blown SCT-CPO reactor and a PSA unit, positioned after the CO2 removal unit for increasing H2 purity.",
                        "Both schemes consider that SCT-CPO allows producing a syngas mixture with an H2/CO2 ratio  3 v/v, very close to the most appropriate ratio for maximising the Urea production. In other words, the SCT-CPO technology would allow the increase of the urea production per unit volume of produced Ammonia. This point can be appreciated by considering equation ( 9) and assuming that the produced CO could be completely converted into CO2 and H2.",
                        "422",
                        "Taking as basis an ammonia plant with a capacity of 3,000 MTPD (for an Urea production around 4,440 MTPD), we performed a preliminary technical economical comparison between the conventional process scheme, based on SR and ATR, and the two novel schemes based on SCT-CPO.",
                        "It is noted that an Urea production of 4,440 MTPD requires a syngas plant capacity corresponding to 352,000 Nm 3 /h of syngas with a H2/N2 ratio equal to 2.78 v/v and CH4 content lower than 1.0% v/v, delivered at a pressure around 30 barg. Table 1 includes a comparison between consumption and production features of the \"state of the art\" technological solutions and those achievable with SCT-CPO based on the process schemes of Figures 8 and9."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "State of the Art Case",
            "paragraphs": [
                "ENRICHED AIR (Figure 8) OXYGEN (Figure 9) FEED + FUEL (10 3 Nm 3 /h) It is quite evident that with the above mentioned assumptions, Urea productivity can be increased by ca. 15% utilizing the same Ammonia production capacity and avoiding any excess ammonia export. Moreover the produced CO2 can be completely recovered achieving a 60% reduction of the CO2 emissions. Feed and fuel consumptions would also be reduced while power consumption would increase. The specific consumption is lowered of about 18% compared with the \"state of the art\" case. However it is also noted that the HP Steam Export would be reduced and if considered in the energy balance, this point would strongly reduce the energy consumption advantage. In other words, it can be said that the SCT-CPO based processes would be more efficient, but would produce a lower amount of HP Steam export. It also appears that the SCT-CPO processes would be favored by high NG price and low electric energy price scenarios. The data of Table 1 have been transformed in cost and incomes and an overall economical balance was done to make a preliminary assessment.",
                "The conclusions indicated that SCT-CPO based processes become very convenient in situations in which the excess of ammonia has to be converted into Urea and/or when the variation of the Ammonia/Urea prices require a flexible process. A first qualitative comparison indicated that either operating and investment costs are reduced with both SCT-CPO based process schemes ( "
            ],
            "subsections": [
                {
                    "title": "Notes on SCT-CPO integration in methanol production processes",
                    "paragraphs": [
                        "A typical large scale methanol production process (5,000 MTPD) requires a syngas flow (about 560.000 Nm 3 /h) at 36 barg with the following characteristics:",
                        "-\"Methanol Module\" M = (H2-CO2)/(CO2+CO) = 2 (v/v) -ratio CO2/CO = 0.38 corresponding to CO/CO2=2.6 (v/v) -methane residue in the syngas lower than 1.30% (v/v dry basis)",
                        "The conventional process scheme for producing such a syngas includes the following main steps:",
                        "1. hydro-desulphurisation (HDS) 2. pre-reforming 3. splitting of the feed into two separate streams (60/40%) one to be processed from a SR (60% of total feed) the other (40% of total feed) from an O2 Blown ATR which combines the Steam Reformed Stream with the fresh feed 4. syngas cooling and high pressure steam generation",
                        "The utilisation of SCT-CPO integrated with MeOH synthesis loop can be envisaged accordingly to the scheme of Figure 10. Here in order to achieve a Methanol Module M = 2 v/v, 12% v/v of the synthesis gas has been shifted (WGS) and purified (PSA) for producing pure H2, that was added to the main synthesis gas stream (directly produced from the SCT-CPO reactor).",
                        "The scheme based on SCT-CPO technology (Figure 10) includes the following main steps for synthesis gas production:",
                        "1. hydro-desulphurisation (HDS) 2. mixing the de-sulphurated feed with super-heated Steam and Oxygen 3. SCT-CPO reforming 4. splitting the reformed gas for obtaining a pure H2 stream 5. mixing the pure H2 stream with the syngas directly produced from the SCT-CPO reactor for reaching an M value of 2 v/v More in detail it is reported that desulfurized feed and steam flows are characterised by S/C = 0.6 v/v while in the \"state of the art\" process scheme this ratio corresponds to 1.8 v/v (this implies that extra heat is available from the synthesis loop). The feed + steam stream, at the outlet of saturator, is heated up to 480°C and mixed with Oxygen at 180°C for feeding the SCT-CPO reactor. The produced syngas at 1060°C is cooled down in the process gas boiler to raise HP steam, which is superheated in a separate furnace. The reformed gas at 320°C is split in two streams. One of these streams (ca. 42% v/v of total) is routed to a WGS section. The shifted gas is also split into two streams, the first, about 28% v/v of total is cooled and treated in a PSA unit to produce pure H2, the second is mixed as such with the un-shifted gas. In this way the Methanol Module is raised by adding a proper amount of H2 while CO/CO2 ratio is controlled via the WGS section. The purge gas together with others streams from the methanol synthesis section, are fired in a SSH heater, in a feed preheater and in a boiler to raise HP steam to be used within ASU for making the extra O2 required.",
                        "Ongoing technical and economical evaluations comparing the \"State of the Art\" and the SCT-CPO based technology figures are indicating that the new process scheme has the potential for reducing the CAPEX but slightly raises the OPEX. However it is clear that many of the possibilities accessible with this new \"technological key\", have still to be examined. and is pursuing a multi-disciplinary long term approach for developing catalysts and precompetitive technologies. The project is examining novel (at a pre-competitive level) routes, particularly suited for remote and stranded areas, for transforming NG into liquid products either for chemical or for fuel production. In this latter case, a better balance between diesel vs. gasoline pools would be achieved. In particular, one of the three lines investigated, for which Tecnimont KT S.p.A. is workpackage leader concerns the definition of new routes for syngas production utilising membrane systems (Capoferri et al., 2011) coupled with steam reforming reactors integrated in process schemes also including SCT-CPO."
                    ],
                    "subsections": []
                },
                {
                    "title": "Notes on",
                    "paragraphs": [
                        "The basic concept is that the use of membrane reactors for steam reforming reactions, enables the shift of chemical equilibrium towards products by removing the produced hydrogen, thus enhancing feed conversion or achieving the same feed conversion at lower temperature (as an example, conventional plants usually require outlet temperatures around 850-880°C, that can be lowered to 600-650°C by adopting membrane reactors).",
                        "The integration of selective membranes in a chemical process can be made: (i) directly inside the reaction environment (\"closed\" architecture), (ii) after the reaction step, thus realizing a sequence of reactor/membrane modules (\"open\" architecture, Iaquaniello and Salladini, 2011). The integrated approach can be more efficient and allows higher system compactness, however the possibility to integrate the membrane module outside the reaction environment can i) assure higher system flexibility, ii) simplify the reactor mechanical design and membrane geometry, iii) make possible the optimization of the operating conditions in each stage separately.",
                        "Such a conceptual membrane reactor scheme derives from recent experience developed by Tecnimont KT/INSTM together with other partners in the framework of the Italian FISR Project \"Pure hydrogen from natural gas reforming up to total conversion obtained by integrating chemical reaction and membrane separation\". This consortium grouped Italian universities and the engineering company Tecnimont KT, cooperating in the development of this innovative technology, that individuated as critical points membrane manufacture and assembling and catalyst optimization. The project resulted in the design and operation of a demonstrative plant (capacity of 20 Nm 3 /h oh hydrogen), placed in Chieti Scalo, based on the integration of a steam reforming reactor with Pd and Pd/Ag based membranes for hydrogen separation (Barba et al., 2008;Iaquaniello et al., 2008;De Falco et al., 2011a;De Falco et al., 2011b). This installation, the first of this type and size, made it possible to completely understand the potential of selective membrane application in industrial hightemperature chemical processes.",
                        "During the first stage of the Next-GTL project, an optimized process scheme was developed, characterized by the sequence of the following steps: (i) pre-reforming stage; (ii) SCT-CPO reactor; (iii) membrane for H2 separation. The aim of the proposed architecture is to produce syngas and hydrogen with higher flexibility in terms of H2/CO ratio and H2 capacity at a more competitive production cost, exploiting all the advantages relevant to a prereformer unit, such as: (i) to increase the feedstock flexibility; (ii) to lower export steam production;",
                        "(iii) to recover the maximum waste heat in the process (which in CPO architecture, downstream of the reactor, is largely available); (iv) to remove the bottleneck in an existing facility; (v) to protect downstream catalysts; (vi) to increase the capacity of an existing plant.",
                        "The experimental feasibility of the proposed architecture will be assessed at the pilot plant in Chieti Scalo, that will be operated at lower temperature (like a pre-reforming Unit).",
                        "The current plant configuration is reported in the block diagram in Figure 11. NG from battery limits is fed to the feed desulphurization (HDS) reactor for sulphur compounds removal. The desulphurised feed is mixed with steam, preheated in the convective section and fed to the first reforming reactor (R-01). Reforming temperatures can be set as required by the tests, adjusting the amount of fuel fed to two independent hot gas generators coupled to two steam reforming reactors. Typically the reactors operate at temperatures around 500-600°C.",
                        "The reformed gas produced in the first reactor is cooled down at 400-450°C and routed to the first separation module (M-01): the retentate is preheated and recycled to the second reformer stage (R-02), and a mixture of H2 plus sweeping steam are produced. Reformed gas coming from the second reformer stage is cooled down and routed to the second separation module (M-02). H2 from both modules are mixed together and sent to final cooling and condensate separation while retentate from the second stage is collected to the flare.",
                        "According to our considerations, the current configuration could be modified as reported in the following block diagram (Figure 12), where it can be observed that the retentate coming from the first membrane module is sent to a SCT-CPO reactor whereas the second steam reformer is eliminated. The process scheme of the existing pilot plant after the rearrangement procedure is reported in Figure 13. It can be observed that the main difference with respect to the previous process scheme is represented by the fact that the retentate stream coming from the first separation module (M-01) is sent to the CPO reactor, which outlet is further routed to the second separation module (M-02). Before this passage, the exhaust stream coming from the CPO reactor is forced to flow through the second steam reformer reactor, which in this case is empty, so that any catalytic reaction occurs in it, thus simulating a reactor by-pass operation.",
                        "It is expected to have the first catalytic activity tests results within the end of 2012.",
                        "This system configuration could in principle be integrated also with membranes for O2 and CO2 separation since the former may contribute to a reduction of the costs for air separation, one of the more costly components of the overall GTL process, while the latter can be used to separate carbon dioxide to reduce greenhouse gas emissions and allow its reuse."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Conclusions",
            "paragraphs": [
                "Syngas production is a key step for many industrial manufacturing schemes. The technological issues involved are quite relevant to determine the overall energy efficiency and the economic characteristics of syngas processes. Well established industrial solutions, namely the SR, the POx and the ATR will be soon challenged by a radical innovation; namely the SCT-CPO technology that has matured inside the ENI S.p.A., which has been extensively experimented in pilot scale plants and has reached the maturation for initiating the first industrial unit. Technimont KT S.p.A. has also been very active, among the other companies, in this field by studying in recent years, process scheme solution including SCT-CPO not only for H2 production but also with NH3/Urea and MeOH production units. This integration appears already feasible. Some more explorative studies are also ongoing for examining process scheme solutions including membranes separation units. "
            ],
            "subsections": []
        },
        {
            "title": "Acknowledgement",
            "paragraphs": [
                "This work received a financial support by the European Community throughout the Next GTL project-Contract NMP3- LA-2009-229183"
            ],
            "subsections": []
        },
        {
            "title": "Author details",
            "paragraphs": [
                "Gaetano Iaquaniello and Emma Palo Tecnimont KT S.p.A., Roma, Italy Alessandra Guarinoni, Andrea Lainati and Luca Basini"
            ],
            "subsections": []
        },
        {
            "title": "ENI S.p.A., Refining & Marketing Division, San Donato Milanese (MI), Italy",
            "paragraphs": [
                "Elena Antonetti, Barbara Cucchiella and Annarita Salladini Processi Innovativi s.r.l., Roma, Italy"
            ],
            "subsections": []
        }
    ]
}