{
    "id": "US20140103260",
    "authors": [
        "Gaetano Iaquaniello",
        "Barbara Cucchiella",
        "Elena Antonetti"
    ],
    "title": "PROCESS FOR PRODUCING A SYNGAS INTERMEDIATE SUITABLE FOR THE PRODUCTION OF HYDROGEN",
    "date": "2012-06-25 00:00:00",
    "abstract": "Disclosed is a process for the production of a syngas mixture by catalytic partial oxidation. The syngas mixture is suitable as an intermediate in the production of hydrogen. According to the invention, the syngas is cooled, prior to a water gas shift reaction, with liquid water. This has the advantage of avoiding the problem of metal dusting, and it presents a gas mixture comprising water vapor that is particularly suitable for a water gas shift reaction in the production of hydrogen.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "FIELD OF THE INVENTION",
                    "paragraphs": [
                        "The invention pertains to a process for the production of syngas by means of catalytic partial oxidation. In another aspect the invention relates to a method of making ammonia and/or urea using the syngas obtained by the process. In yet another aspect the method relates to a method for producing hydrogen."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "define catalytic partial oxidation process"
                    ],
                    "num_characters": 306,
                    "outline_medium": [
                        "relate to syngas production by catalytic partial oxidation"
                    ],
                    "outline_short": [
                        "define catalytic partial oxidation process"
                    ]
                },
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Syngas (which is a short for “synthesis gas”) comprises carbon monoxide (CO) and hydrogen (H2), and is an important source for the production of H2. The conventional industrial process for producing syngas on an industrial scale is steam reforming, whereby a carbonaceous material is reacted with water in the form of steam. Another process, of increasing importance, involves subjecting the carbonaceous material to Catalytic Partial Oxidation. The present invention pertains to a process of this type, referred to hereinafter as “CPO process.”",
                        "A typical CPO process, used for producing H2, a carbonaceous material is subjected to catalytic partial oxidation, after which steam is added and a water gas shift reaction is allowed to take place. In this water gas shift reaction, carbon monoxide reacts with water so as to form carbon dioxide and hydrogen. The CPO reaction being exothermic, heat is produced. At the outlet temperatures of the CPO a corrosion problem called “metal dusting.” may appear. Metal dusting is a catastrophic form of corrosion that occurs when susceptible materials are exposed to environments with high carbon activities. The corrosion manifests itself as a break-up of bulk metal to metal powder. This may shorten the life of the equipment involved, and may lead to contamination problems in end-product obtained from such equipment. Metal dusting for any given material tends to occur in a relatively narrow range (100-300° C.) of a temperature regime from 400 to 900° C. The particular temperature window of susceptibility depends on the material, gas composition, thermodynamic consideration and kinetics. In the case of the typical syngas composition the critical range of temperature is within 450-750° C.",
                        "It is believed that the phenomenon of metal dusting in syngas service is caused by the precipitation of carbon into the metals that comprise the material of construction. The mechanism underlying the metal dusting phenomenon is not completely understood, but it is known that the higher concentration of CO in the gas exiting the CPO reactor compared to a steam reforming reactor worsens the metal dusting phenomenon.",
                        "The latter phenomenon particularly occurs downstream of the CPO reactor, where the initial syngas mixture is subjected to cooling prior to the water gas shift reaction. As a result of the cooling, the gas passes the temperature range in which metal dusting is bound to occur. The temperature reduction is generally achieved in a Process Gas Boiler (PGB), which is a heat exchanger designed to quickly reduce the temperature of the process gas to a temperature suitable for the water gas shift reaction. Thus, also the PGB should be protected from metal dusting. A known method to reduce this phenomenon is to design the process gas boiler for a minimum residence time, preferably less than 2 seconds, preferably between 0.25 and 1 seconds, more preferably between 0.25 and 0.5 seconds. However, it is practically difficult to design and operate the PGB for lower residence times because lower residence times lead to very high gas velocities which in turn may increase the material problems incurred.",
                        "WO2010/144544 A1 discloses a method for producing synthesis gas from biomass. The document discloses solar driven refining of biomass and the lowering of the temperature after the reaction to avoid the reverse reaction by various means, for example by indirect heat exchange or by quenching with water. It is disclosed that rapid cooling e.g. between 0.1 and 10 seconds, may reduce the metal dusting phenomenon. There is no disclosure of the particular problems associated with the use of a catalytic partial oxidation reaction followed by a water gas shift (WGS) reaction, i.e. the increased corrosiveness and the need to adjust the S/G ratio before the WGS reaction. A typical temperature of less than 800° C. is disclosed as required to prevent the reverse reaction and optimize the amount of syngas.",
                        "It is thus desired to provide a process which is capable of providing syngas and reduce or avoid conditions that could promote the phenomenon of metal dusting."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe conventional syngas production",
                        "describe steam reforming process",
                        "describe catalytic partial oxidation process",
                        "describe metal dusting phenomenon",
                        "describe limitations of conventional CPO process",
                        "describe prior art method for producing synthesis gas",
                        "describe limitations of prior art method",
                        "describe need for improved process"
                    ],
                    "num_characters": 4126,
                    "outline_medium": [
                        "describe conventional steam reforming process",
                        "describe catalytic partial oxidation process",
                        "describe metal dusting phenomenon",
                        "describe prior art solutions to metal dusting"
                    ],
                    "outline_short": [
                        "describe conventional syngas production",
                        "limitations of conventional syngas production"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "In order to better address one or more of the foregoing desires, the invention presents, in one aspect, a process for producing a synthesis gas mixture, the method comprising the steps of:",
                        "(a) providing a composition comprising a hydrocarbon material;",
                        "(b) subjecting the hydrocarbon material to catalytic partial oxidation (CPO) so as to produce initial synthesis gas comprising carbon monoxide, hydrogen and carbon dioxide;",
                        "(c) adding liquid water to the initial synthesis gas obtained in (b) in an amount sufficient to obtain a synthesis gas mixture comprising H2O as the primary component.",
                        "In another aspect, the invention pertains to a process for the production of a gas mixture comprising hydrogen and carbon dioxide, the method comprising the above steps (a)-(c), and subjecting the synthesis gas mixture to",
                        "(d) a water gas shift reaction so as to react carbon monoxide with water under the formation of a gas mixture comprising hydrogen and carbon dioxide.",
                        "In a still further aspect, the invention serves to produce hydrogen by a method comprising the above steps (a)-(d), and separating the hydrogen from the gas mixture.",
                        "In yet another aspect, the invention presents a method of making urea, comprising above steps (a)-(d), removing CO2 from the gas mixture comprising hydrogen and carbon dioxide, so as to obtain a gas mixture enriched in H2, reacting the H2-enriched gas mixture with N2 so as to form ammonia, and reacting the ammonia with the removed CO2 under urea-forming conditions.",
                        "In a further aspect the invention pertains to the use of liquid water for the purpose of setting the steam/gas ratio (S/G, v/v %) in a synthesis gas mixture to be subjected to a water gas shift reaction for the production of hydrogen.",
                        "In a still further aspect, the invention pertains to a plant for the production of hydrogen, said plant comprising a catalytic partial oxidation reactor and a water gas shift reactor downstream of the catalytic partial oxidation reactor, wherein an injector for water is placed between a gas outlet of the catalytic partial oxidation reactor and a gas inlet of the water gas shift reactor."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce process for producing synthesis gas",
                        "describe addition of liquid water to initial synthesis gas",
                        "describe water gas shift reaction",
                        "describe production of hydrogen and carbon dioxide"
                    ],
                    "num_characters": 2132,
                    "outline_medium": [
                        "introduce process for producing synthesis gas mixture",
                        "describe various aspects of the invention"
                    ],
                    "outline_short": [
                        "introduce novel syngas production process"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "In a broad sense, the invention is based on the judicious insight that the addition of liquid water is capable of serving a double goal in the field of CPO syngas production. Accordingly, the water contributes to achieving the desired rapid cooling, as well as to enabling the production of a gas mixture having a more desirable composition for the water gas shift reaction.",
                        "It will be understood that the heat exchange that occurs when liquid water is added to the initial synthesis gas mixture, will result in the water to become evaporated, thus adding steam to the gas mixture. The amount of liquid water added is such, that the steam (i.e. H2O in the gas phase) becomes the primary component of the gas mixture. By “primary” it is meant that the H2O is present in relatively the highest amount.",
                        "The addition of liquid water serves to achieve a fast cooling, that in turn serves to avoid the metal dusting phenomenon which would otherwise occur in the range of 450-750° C. Further, the step of adding liquid water does not only provide an elegant way of achieving rapid cooling, it also means that, by adapting the amount of liquid water to be added, one can adapt the total composition of the gas mixture.",
                        "The hydrocarbon material can be a single hydrocarbon, a mixture of hydrocarbons, or any other composition comprising at least one hydrocarbon. Preferred sources are natural gas (CH4), liquid hydrocarbons, for example naphtha or gasoline, gasification of coal, biomass, and waste-to-energy gasification facilities.",
                        "The hydrocarbon material can be in a gaseous (e.g. methane or natural gas) and/or in liquid state and also from biomass; The hydrocarbon material may be suitable for direct feed to the CPO or can be pre-treated for removal of any impurities, such as sulfur compounds, that might be present.",
                        "CPO reactors are known to the skilled person. A CPO reactor generally comprises a reaction zone, made up of a vertical cylindrically shaped steel pressure vessel lined with a refractory material. A CPO reactor typically is distinguished from an autothermal reformer reactors, as the latter comprises a burner, which a CPO generally does not.",
                        "The CPO process results in synthesis gas, or syngas, comprising CO, CO2 and H2.",
                        "The CPO reaction is known to the skilled person. It will generally be carried out in a catalytic partial oxidation reactor, comprising a suitable catalyst bed that serves to catalyze the partial oxidation of hydrocarbon into CO and H2. It will be understood that some complete oxidation product (viz. CO2) may also be formed.",
                        "The term CPO (also often referred to as SCT-CPO) is known to the skilled person. SCT-CPO refers to Short Contact Time Catalytic Partial Oxidation. The CPO reaction takes place in a reactor under the influence of a catalyst at residence times between 10−2 to 10−4 and with typical catalyst surface contact times around 10−6 s−1. These contact time correspond to typical space velocities of 100,000 to 250,000 hr−1 preferably 100,000 to 200,000 hr−1. Catalysts employed for SCT-CPO comprise Ni, Pd, Pt, Rh, or Ru. The reaction takes place at catalyst surface temperatures above 950° C., preferably above 1000° C. By employing said short contact times and high catalyst surface temperatures the formation of CO his highly favoured and the formation of carbon or CO2 is suppressed. This leads to a highly favourable synthesis gas composition. A reference to CPO is (a) L. Basini, Catalysis Today 117 (2006) 384-393. Other references include (b) L. Basini, K. Aasberg-Petersen, A. Guarinoni, M. Oestberg, Catalysis Today (2001) 64, 9-20 “Catalytic Partial Oxidation of Natural Gas at Elevated Pressure and Low Residence Time”; (c) H. Hickman, L. D. Schmidt, J. Catal. 138 (1992) 267; (d) D. Hichman, L. D. Schmidt Science, 259 (1993) 343; (e) L. Basini, G. Donati WO 97/37929; (f) Sanfilippo, Domenico; Basini, Luca; Marchionna, Mario; EP-640559; (g) D. Schaddenhorst, R. J. Schoonebeek; WO 00/00426; (h) K. L. Hohn, L. D. Schmidt, S. Reyes, J. S. Freeley, WO 01/32556; (i) A. M. Gaffney, R. Songer, R. Ostwald, D. Corbin, WO 01/36323.",
                        "According to the invention, the initial synthesis gas resulting from the CPO reaction, is modified by the addition of liquid water. This results in a useful gas mixture comprising the components of the synthesis gas, and additionally H2O as the primary component. The addition of water to the initial syngas mixture is carried out preferably by a direct injection of preheated water into the gas at the outlet of the CPO reactor. By setting the proper operating conditions on the CPO reactor (oxygen/carbon, O2/C, and steam/carbon, S/C, ratios) and the temperature of the heated injected water (typically Boiler Feed Water is used for this purpose), the optimum ratio, S/G, is achieved without any further addition of steam and the proper temperature at the inlet of WGS reactor without the need of installing a Process Gas Boiler (PGB) downstream of the CPO reactor. By adjusting the temperature and/or the amount of the liquid water to be added, the skilled person can relatively simply determine the desired composition and temperature of the synthesis gas mixture obtained. Put simply, at a relatively low water temperature, a lower amount of water will be required to cool the initial synthesis gas, and vice versa. The invention, in one aspect, embodies a quite unexpected phenomenon, viz. that the amount of water required to perform the cooling as well as to adjust the S/G ratio, happens to be in the range that is capable of being adjusted by adjusting the temperature of the preheated water.",
                        "This synthesis gas mixture preferably serves as an intermediate in the production of hydrogen, involving a water gas shift reaction. In that case, it is preferred that the temperature of the initial synthesis gas mixture be reduced (from a typical value such as 950° C. to 1050° C.) to below 450° C., and preferably to below 400° C. . The proper temperature of water to be injected downstream the CPO reactor is preferably achieved by using heat from the syngas at the outlet of the water gas shift reactor to preheat the water.",
                        "For the purpose of producing hydrogen, the mixture is subjected to a water gas shift reaction. To this end, the mixture is routed to a water gas shift reactor (WGSR), wherein the gas mixture comprising carbon monoxide and steam is converted to hydrogen and carbon dioxide. The WGS reaction is typically carried out using either a single stage or multi stage to attain the desired degree and rate of conversion. In a multi stage process, the high temperature stage (HTS) operates at 300-450° C. and typically in the presence of an iron-based catalyst such as Fe/Cr. In the HTS the largest amount of CO is converted, usually more than 90% such as between 96 and 98%. In the following stage, medium or low temperature stage (MTS or LTS), the operating temperature is about 180-280° C. and typically a copper/zinc catalyst supported on alumina (Cu/Zn/Al) catalyst is used. In these latter stages the residual CO concentration in the outlet stream is typically as low as 0.1-0.3%.",
                        "The gas stream resulting from the WGSR contains mainly hydrogen and carbon dioxide. Optionally, hydrogen is separated from this stream by pressure swing absorption (PSA) to yield a pure hydrogen stream. Several options exist for further treatment of the gas mixture resulting from the water gas shift reaction. E.g., in order to produce hydrogen, the hydrogen can be separated from the gas mixture. It is also possible to use the method for the express production of hydrogen and carbon dioxide.",
                        "In a particular embodiment, the method is used for the production of ammonia and urea. To this end, almost all CO2 is removed from the gas mixture comprising hydrogen and carbon dioxide, so as to obtain a gas mixture enriched in H2. The latter is reacted with N2 so as to form ammonia. This reaction is well-known, and the skilled person is familiar with production methods and plants to carry this out. The ammonia is then reacted with the removed CO2 under urea-forming conditions. This reaction too is well-known, and production methods and plants are available to the skilled person. The invention thus provides a very economical way of using the components of the gas mixture obtained, in producing the important bulk chemical compound, urea. The advantage of using the above scheme instead of a conventional steam reforming process is that all CO2 is present in the reaction mixture and as such can be easily removed. In a conventional steam reforming process, only part of the CO2 is present in the reaction mixture, a significant amount of CO2 is present in the flue gas originating from the burning of the fuel needed to supply the heat of reaction.",
                        "The invention further pertains to a plant for the production of hydrogen. In connection with the above-mentioned process embodiments, the plant comprises a catalytic partial oxidation reactor and a water gas shift reactor, downstream of the catalytic partial oxidation reactor. It will be understood that the catalytic partial oxidation reactor may comprise the conventional elements of such a reactor. These comprise, e.g., an inlet for a hydrocarbon feed, a synthesis section comprising a catalytic bed, and an outlet for synthesis gas formed. The water gas shift reactor too, will comprise its conventional elements, such as an inlet for synthesis gas, a reactor chamber, and an outlet for a resulting H2-containing gas stream. In accordance with the invention, an injector for water is placed between the gas outlet of the catalytic partial oxidation reactor and the gas inlet of the water gas shift reactor. The injector may be in the form of a separate quenching unit, comprising a quenching chamber provided with a device to inject water. It may also be provided as an injector into a piping system.",
                        "In a preferred embodiment, a heater, typically a heat exchanger, is added to the injector, preferably upstream thereof, so as to preheat the water before it is used.",
                        "The present invention will further be described with respect to particular embodiments and with reference to certain drawings but the invention is not limited thereto but only by the claims. Any reference signs in the claims shall not be construed as limiting the scope. The drawings described are only schematic and are non-limiting. In the drawings, the size of some of the elements may be exaggerated and not drawn on scale for illustrative purposes. Where the term “comprising” is used in the present description and claims, it does not exclude other elements or steps. Where an indefinite or definite article is used when referring to a singular noun, e.g., “a” or “an”, “the”, this includes a plural of that noun unless something else is specifically stated. All ratios such as steam/gas (S/G), steam/carbon (S/C) and oxygen/carbon (O/C) are expressed as volume ratios (v/v)"
                    ],
                    "subsections": [
                        {
                            "title": "DETAILED DESCRIPTION OF THE FIGURES",
                            "paragraphs": [
                                "In FIG. 1, a first embodiment of the present invention is illustrated in a schematic form.",
                                "FIG. 1 shows the block diagram of the process with the following sections:\n\n\n- **100**, CPO section;\n- **101**, quenching section;\n- **102**, first HTS section;\n- **103**, process steam generation section;\n- **104**, feed preheater;\n- **105**, second HTS section;\n- **106**, BFW preheater section\n- **107**, low pressure steam generation section\n- **108**, oxygen preheater section;\n- **120**, sulfur removal reactor;\n- **121**, furnace.",
                                "To the syngas stream from CPO reactor, 100, water is added in 101 to cool the syngas temperature to 320-350° C. which represents a proper temperature to carry out the high temperature water gas shift reaction and which is outside the critical temperature range for metal dusting phenomenon. Unless indicated otherwise all percentages referred to are vol. %.",
                                "The synthesis gas exits the water quencher, 101, with a product containing about 32.7% of H2, 0.5% of unconverted CH4, 2.6% of CO2, 16.7% CO and 47.5% of H2O.",
                                "Due to water addition, the S/G ratio in the stream 6 rises to 0.9-1, which represents the optimum value for the subsequent shift.",
                                "In the invention, as a result of the judicious step serving to control the amount of the added water, the mixture entering the WGS reactor has the correct composition for an optimal reaction. This refers to step (c), according to which liquid water is added in an amount sufficient to obtain a synthesis gas mixture comprising, in deviation from the state of the art, H2O as the component that is present in the mixture in the highest amount relative to the other components, i.e., as the primary component. Preferably, the amount of liquid water injected is such that it comprises 30 to 60 percent by volume relative to the total mixture.",
                                "Preferably, in addition to controlling the amount of the added water, also the temperature of the added water is controlled so as to be in a range of from 120° C. to 250° C. As a result, the mixture entering the WGS reactor has the correct composition and temperature for an optimal reaction.",
                                "In addition the amount of energy needed after the WGS to cool will be minimized. The optimum Steam to Gas ratio (S/G) of the mixture entering the WGS reactor is between 0.75 and 1.1, preferably between 0.9 and 1.0.",
                                "In the reactor 102, a first high temperature shift reactor, a substantial portion of the CO present in the stream 6 is converted into CO2+H2.",
                                "Downstream to reactor 102 and before the second temperature shift reactor, 105, a process steam generation, 103, to produce the steam necessary for the CPO reactor and feed preheater 104 installed to preheat the natural gas feed, flowing through the sulfur removal reactor 120.",
                                "Stream 9 enters into the second shift reactor, 105, to convert remaining CO in the H2 product.",
                                "In the outlet stream, 10, at a temperature of 345° C., residual CO is 1.8%.",
                                "The water stream preheater 106 will heat the water to between 150° C. and 250° C. Typical pressures are between 10 and 40 barg preferably between 10 to 30 barg, for example 20 barg. The low pressure steam generation, 107, and oxygen preheater, 108, are placed downstream of reactor 105 to cool down the syngas product.",
                                "In one embodiment the gas at the exit of the CPO reactor is cooled in less than 100 ms, preferably the gas is cooled in less than 50 ms, more preferably less than 30 ms, for example 20 ms.",
                                "In the scheme is included a furnace, 121, to raise the temperatures of the steam and of the feed at the values desired at the inlet of CPO reactor.",
                                "Referring now to FIG. 2, a second embodiment of the present invention is illustrated in schematic form.",
                                "For simplicity, units and streams, FIG. 2 has in common with FIG. 1 have retained the unit or stream number of FIG. 1 so it shows only the following section.\n\n\n- **109**, CO₂ removal section;\n- **110**, methanizer reactor section;\n- **111**, water dryer section.",
                                "The shifted gas, 10, is processed in acid gas unit 109.",
                                "In acid gas stream, 13, the CO2 is separated from the syngas product. Stream 14 consists of CO2 removed.",
                                "The raw H2 stream, 15, is routed in reactor, 110, where CO is converted in CH4 and in reactor 111, where water is removed.",
                                "The H2 product, 17, has purity of 93.7% and can be used for applications which do not require high purity H2. If desired the H2 stream can be further purified with a pressure swing absorption (PSA) unit (not shown) or in case a CO2 separated stream is not required instead of steps 109, 110 or 111.",
                                "The above illustrated embodiments are intended to serve as simplified schematic diagrams of potential embodiments of the present invention. One of ordinary skill in the art of chemical engineering should understand and appreciate the specific details of any particular embodiment may be different and will depend upon the locations and needs of the scheme under consideration.",
                                "All alternatives scheme capable of achieving the present invention are considered to be within the capabilities of a person having skill in the art and thus within the scope of the present invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe FIG. 1",
                                "describe CPO section",
                                "describe quenching section",
                                "describe first HTS section",
                                "describe process steam generation section",
                                "describe feed preheater",
                                "describe second HTS section",
                                "describe BFW preheater section",
                                "describe low pressure steam generation section",
                                "describe oxygen preheater section"
                            ],
                            "num_characters": 5119,
                            "outline_medium": [
                                "describe FIG. 1, a first embodiment of the invention",
                                "describe quenching section",
                                "describe high temperature shift reactor",
                                "describe process steam generation and feed preheater",
                                "describe FIG. 2, a second embodiment of the invention"
                            ],
                            "outline_short": [
                                "describe FIG. 1",
                                "describe FIG. 2"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe CPO reaction",
                        "describe catalyst used in CPO reaction",
                        "describe operating conditions for CPO reaction",
                        "describe addition of liquid water to initial synthesis gas",
                        "describe effect of water addition on gas mixture",
                        "describe adjustment of water temperature and amount",
                        "describe water gas shift reaction",
                        "describe production of hydrogen and carbon dioxide",
                        "describe separation of hydrogen from gas mixture",
                        "describe production of ammonia and urea",
                        "describe plant for production of hydrogen",
                        "describe catalytic partial oxidation reactor",
                        "describe water gas shift reactor",
                        "describe injector for water",
                        "describe heater for preheating water",
                        "describe quenching unit",
                        "describe piping system",
                        "describe heat exchanger",
                        "describe process steam generation",
                        "describe feed preheater",
                        "describe sulfur removal reactor"
                    ],
                    "num_characters": 10927,
                    "outline_medium": [
                        "describe CPO reaction and reactor",
                        "describe addition of liquid water to initial synthesis gas",
                        "describe effect of water addition on gas mixture composition",
                        "describe water gas shift reaction",
                        "describe production of hydrogen and carbon dioxide",
                        "describe production of ammonia and urea",
                        "describe plant for production of hydrogen",
                        "describe injector for water",
                        "describe heater for preheating water",
                        "describe various embodiments of the invention"
                    ],
                    "outline_short": [
                        "describe CPO reaction",
                        "describe addition of liquid water",
                        "describe water gas shift reaction",
                        "describe production of hydrogen and carbon dioxide",
                        "describe production of ammonia and urea"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A process for producing a synthesis gas mixture, the method comprising the steps of:\n(a) providing a hydrocarbon material;\n(b) subjecting the hydrocarbon material to catalytic partial oxidation (CPO) so as to produce initial synthesis gas comprising carbon monoxide, hydrogen and carbon dioxide;\n(c) adding liquid water to the initial synthesis gas obtained in (b) in an amount sufficient to obtain a synthesis gas mixture comprising H2O as the primary component.",
        "2. A process according to claim 1, wherein the amount of liquid water injected is such that it comprises 30 to 60 percent by volume relative to the total mixture.",
        "3. A process according to claim 1, wherein the liquid water is preheated to a temperature of 120 to 250° C.",
        "4. A process for the production of a gas mixture comprising hydrogen and carbon dioxide, the method comprising the steps (a)-(c) as defined in claim 1, and subjecting the synthesis gas mixture to\n(d) a water gas shift reaction so as to react carbon monoxide with water to form a gas mixture comprising hydrogen and carbon dioxide.",
        "5. A process for the production of hydrogen comprising the steps (a)-(d) as defined in claim 4, and separating the hydrogen from the gas mixture.",
        "6. A process for the production of urea, comprising steps (a)-(d) as defined in claim 4, removing CO2 from the gas mixture comprising hydrogen and carbon dioxide, and using the obtained CO2 in the preparation of urea.",
        "7. (canceled)",
        "8. A plant for the production of hydrogen, said plant comprising a catalytic partial oxidation reactor and a water gas shift reactor downstream of the catalytic partial oxidation reactor, wherein an injector for water is placed between a gas outlet of the catalytic partial oxidation reactor and a gas inlet of the water gas shift reactor.",
        "9. A plant according to claim 8, wherein a heater is added upstream of the injector, so as to heat the water to be injected.",
        "10. The process according to claim 4, further comprising removing CO2 from the gas mixture comprising hydrogen and carbon dioxide, so as to obtain a gas mixture enriched in H2.",
        "11. A process for the production of a gas mixture enriched in H2, comprising steps (a)-(d) as defined in claim 4, and removing CO2 from the gas mixture comprising hydrogen and carbon dioxide."
    ]
}