{
    "id": "https://semopenalex.org/work/W2937192530",
    "authors": [
        "Joanna McFarlane",
        "James W. Klett",
        "Gyoung Gug Jang",
        "Kai Xiao",
        "Mina Yoon",
        "James E. Parks",
        "Jong K. Keum",
        "Anton V. Ievlev",
        "Piljae Im",
        "Michael Z. Hu"
    ],
    "title": "Efficient Solar‐Thermal Distillation Desalination Device by Light Absorptive Carbon Composite Porous Foam",
    "date": "2019-04-08",
    "abstract": "Solar-thermal driven desalination based on porous carbon materials has promise for fresh water production. Exploration of high-efficiency solar desalination devices has not solved issues for practical application, namely complicated fabrication, cost-effectiveness, and scalability. Here, direct solar-thermal carbon distillation (DS-CD) tubular devices are introduced that have a facile fabrication process, are scalable, and use an inexpensive but efficient microporous graphite foam coated with carbon nanoparticle and superhydrophobic materials. The black composite foam serving as a solar light absorber heats up salt water effectively to produce fresh water vapor, and the superhydrophobic surface of the foam traps the liquid feed in the device. Two proof-of-principle distillation systems are adopted, i.e., solar still and membrane distillation and the fabricated devices are evaluated for direct solar desalination efficiency. For the solar still, nanoparticle and fluorosilane coatings on the porous surface increase the solar energy absorbance, resulting in a solar-steam generation efficiency of 64% from simulated seawater at 1 sun. The membrane distillation demonstrates excellent vapor production (≈6.6 kg m-2 h-1) with >99.5% salt rejection under simulated 3 sun solar-thermal irradiation. Unlike traditional solar desalination, the adaptable DS-CD can easily be scaled up to larger systems such as high-temperature tubular modules, presenting a promising solution for solar-energy-driven desalination.",
    "sections": [
        {
            "title": "Experimental Section",
            "paragraphs": [
                "Materials: GFs with various pore sizes were acquired from Koppers Inc. and CFOAM, LLC. The foam was made from the heat‐treated PI Mesophase Pitch, sieved with 250 mesh, with 7% concentrations of the Ground Foam Graphene platelets added to prepare tubes and chambers.28 Graphite particles (grade 4827, 225–275 m2 g−1) were purchased from Asbury Graphite Mills Inc. and Penolic resin (Durite SC1008) was purchased from Hexion Specialty Chemicals. (Heptadecafluoro‐1,1,2,2‐tetrahydrodecyl) trichlorosilane was purchased from Gelest. Sodium chloride was purchased from Mallinckrodts Chemicals.",
                "Preparation of photothermal SP carbon membrane: The GFs were machined with an electrical saw and drills for tubes and chambers. Fluorosilane molecules were then deposited on the GF tube and chamber via solution immersion (0.1 wt% in Hexane) overnight. After the fluorosilane coating, the GF chamber was oven‐dried at 100 °C for 1 h. The GF chamber was rinsed with copious amounts of water and ethanol to remove unbounded silanes. For the pore‐controlled GF membrane, graphite particles and phenolic resins were mixed at weight ratio of 2:1. The particle slurry was coated on the membrane chamber and its lid with a wood stick knife. After drying overnight, the coated GF chamber was thermally cured at 300 °C for 1 h.",
                "Material Characterization: Scanning electron microscopy was carried out using a field emission scanning electron microanalyzer (Merlin, Carl Zeiss AG). Water contact angles were measured by an optical tensiometer (OneAttension, Biolin Scientific). Specular and total reflectance from the 330 to the 2500 nm spectra region was measured by a portable reflectometer (410‐Solar, Surface Optics Corporation). The absorption (A) efficiency was then calculated by A = 1−R−T, where R and T are reflectance and transmission efficiency, respectively.29 The transmission efficiency was not considered in the thick GF system (thickness = 5 mm). The surface chemistry of coated samples was measured by time‐of‐flight secondary ion mass spectrometry. The solar irradiation processing was under an illumination of 100 mW cm−2 AM 1.5 G solar spectrum using a solar simulator (Radiant Source Technology, 300 W, Class A). The light intensity was calibrated using a NIST‐certified silicon reference cell."
            ],
            "subsections": []
        },
        {
            "title": "Conflict Of Interest",
            "paragraphs": [
                "The authors declare no conflict of interest."
            ],
            "subsections": []
        }
    ]
}