{
    "id": "US20080214408",
    "authors": [
        "Deb K. Chatterjee",
        "Kalavathy Sitaraman",
        "James L. Hartley",
        "Cassio Baptista",
        "David J. Munroe"
    ],
    "title": "IN SITU ASSEMBLY OF PROTEIN MICROARRAYS",
    "date": "2008-04-18 00:00:00",
    "abstract": "The invention provides a microarray and methods for producing a protein microarray. The array comprises multiple nucleic acid molecules immobilized on a substrate, each comprising (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein that binds the protein-binding domain, and one or more fusion proteins produced from the multiple nucleic acid molecules. Each fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain present on the nucleic acid molecule from which the fusion protein is produced or on the substrate. The invention also provides a method of analyzing protein interactions with, for example, other proteins, lipids and drugs.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "Protein microarrays provide a powerful tool for the study of protein function and protein-protein interactions. In particular, protein microarrays have been used to investigate protein interaction with various drugs, antibodies, lipids, nucleic acids, and other proteins. Protein microarrays currently are available in two general formats: antibody arrays and target protein arrays. Antibody arrays contain an array of antibodies that measure the abundance of specific proteins in samples (see, e.g., Haab et al., Genome Biology, 2: research004.1-0004.13 (2001) (published on-line at http://genomebiology.com/2001/2/2/research/0004). Target protein arrays, on the other hand, contain an array of proteins of interest that are used to measure the abundance of proteins in response to specific exogenous stimuli (e.g., drugs, antibodies, lipids, etc.), or to identify enzyme substrates (see, e.g., Cahill et al., Adv. Biochem. Eng. Biotechnol., 83: 177 (2003) and Jona et al., Curr. Opin. Mol. Ther., 5: 271 (2003)).",
                        "Target protein microarrays typically are generated in two steps. First, proteins are separately produced, and then applied (or “spotted”) on the array surface using a variety of linkage chemistries (see, e.g., Lueking et al., Anal. Biochem., 270: 103 (1999), MacBeath et al., Science, 289: 1760 (2000), Zhu et al., Science, 293: 2101 (2001), and Newman et al., Science, 300: 2097 (2003)). Despite their demonstrated utility, the widespread use of target protein microarrays has been limited by a number of factors. For example, current protein microarray technologies are labor-intensive. In addition, currently there are no high-throughput expression systems that produce significant yields of mammalian proteins of sufficiently high purity. Moreover, protein instability, both before and after spotting on the array, is another obstacle to the implementation of target protein microarrays on a large-scale.",
                        "To circumvent the problems associated with current protein microarray technology, researchers have developed new systems in which immobilized DNA molecules are transcribed and translated on the microarray in situ, whereupon newly synthesized proteins are immobilized on the microarray surface at the site of expression. For example, Nord et al., J. Biotech., 106: 1-13 (2003) discloses an array technology called microbead display of proteins. In this technology, proteins are captured by antigen-antibody binding as they are synthesized. Specifically, biotin labeled PCR products (containing a bacteriophage T7 promoter and a FLAG epitope in-frame with two IgG binding domains) are first anchored onto microbeads through streptavidin-biotin affinity binding. Anti-FLAG antibody also is immobilized onto the same microbead. The beads are then incubated with a coupled cell-free transcription-translation extract to produce the corresponding protein. The newly synthesized proteins are trapped via FLAG peptide-FLAG antibody interaction. In addition, Ramachandran et al., Science, 305: 86-90 (2004), discloses a similar antibody-mediated protein microarray format. In this case, purified plasmids are arrayed on a microscope slide through biotin-avidin binding. The genes encoded by the plasmids are fused with glutathione-S-transferase (GST) protein to produce GST-fusion proteins. The slides also are printed with polyclonal GST antibody to capture the newly synthesized GST-fusion proteins following coupled cell-free transcription-translation reactions. Other methods for generating protein microarrays utilizing direct immobilization of proteins synthesized in situ are disclosed in, for example, He, Methods in Molecular Biology, 264: 25-31 (2004) and International Patent Application Publication WO 02/14860.",
                        "While the above methods have met with some success, their widespread use is limited by a number of factors. First, both methods require a second protein, i.e., an antibody, to capture the synthesized protein of interest. Antibody generation and purification adds time and cost to the process. Second, methods for maintaining long-term antibody stability, and therefore, array stability, have yet to be developed.",
                        "Accordingly, there remains a need for more robust and stable protein microarrays and more efficient methods for producing such protein microarrays. The invention provides such microarrays and methods. These and other advantages of the invention, as well as additional inventive features, will be apparent from the description of the invention provided herein."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce protein microarrays",
                        "describe antibody arrays",
                        "describe target protein arrays",
                        "limitations of current protein microarray technology",
                        "describe microbead display of proteins",
                        "describe antibody-mediated protein microarray format",
                        "describe other methods for generating protein microarrays",
                        "limitations of current methods",
                        "need for more robust and stable protein microarrays"
                    ],
                    "num_characters": 4515,
                    "outline_medium": [
                        "introduce protein microarrays",
                        "describe antibody arrays",
                        "describe target protein arrays",
                        "limitations of current technology"
                    ],
                    "outline_short": [
                        "introduce protein microarrays",
                        "limitations of current technology"
                    ]
                },
                {
                    "title": "BRIEF SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "The invention provides a microarray comprising (a) a substrate, (b) multiple nucleic acid molecules immobilized on the substrate, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, and (c) one or more fusion proteins produced from the multiple nucleic acid molecules, wherein each fusion protein is immobilized on the substrate via binding to the protein-binding domain on the nucleic acid molecule.",
                        "The invention also provides methods for producing a protein microarray. In one embodiment, the method comprises (a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, (b) contacting a substrate with the multiple nucleic acid molecules, (c) immobilizing the multiple nucleic acid molecules on the substrate, (d) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to the protein-binding domain on the nucleic acid molecule.",
                        "In another embodiment, the method comprises (a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein that binds the protein-binding domain, (b) contacting a substrate with the multiple nucleic acid molecules, wherein the substrate comprises multiple DNA-binding proteins and multiple nucleic sequences comprising the protein-binding domain, whereupon each of the multiple nucleic acid molecules is immobilized on the substrate via binding to a DNA-binding protein on the substrate, (c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain on the substrate.",
                        "The invention also provides a method of analyzing interactions between two proteins. The method comprises (a) preparing at least a first nucleic acid molecule and a second nucleic acid molecule, wherein the first nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a first fusion protein comprising a first polypeptide of interest and a DNA-binding protein, and the second nucleic acid molecule comprises (i) a protein binding domain and (ii) a nucleic acid sequence encoding a second fusion protein comprising a second polypeptide of interest and an epitope that binds an antibody, (b) contacting a substrate with the first and second nucleic acid molecules, wherein the substrate comprises multiple DNA-binding proteins and multiple nucleic sequences comprising the protein-binding domain, whereupon the first and second nucleic acid molecules are immobilized at the same location on the substrate via binding to a DNA-binding protein on the substrate, (c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequences encoding the first and second fusion proteins are expressed and the first and second fusion proteins are produced, whereupon the first fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain on the substrate, and (d) detecting immobilization of the epitope of the second fusion protein on the substrate, wherein immobilization of the epitope of the second fusion protein on the substrate indicates binding of the second polypeptide of interest to the first polypeptide of interest."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce microarray invention",
                        "describe microarray components",
                        "describe fusion protein production",
                        "describe method for producing protein microarray",
                        "describe alternative method for producing protein microarray",
                        "describe method of analyzing interactions between two proteins",
                        "describe advantages of invention",
                        "summarize invention"
                    ],
                    "num_characters": 4074,
                    "outline_medium": [
                        "introduce microarray invention",
                        "describe microarray components",
                        "describe method for producing microarray",
                        "describe method for analyzing interactions"
                    ],
                    "outline_short": [
                        "describe microarray composition",
                        "outline methods for producing microarray"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE INVENTION",
                    "paragraphs": [
                        "The invention provides a microarray. In an embodiment, the microarray comprises (a) a substrate, (b) multiple nucleic acid molecules immobilized on the substrate, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, and (c) one or more fusion proteins produced from the multiple nucleic acid molecules as a result of contacting the microarray with an expression composition, wherein each fusion protein is immobilized on the substrate via binding to the protein-binding domain on the nucleic acid molecule.",
                        "The invention also provides methods for producing protein microarrays. In one embodiment, the method comprises (a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, (b) contacting a substrate with the multiple nucleic acid molecules, (c) immobilizing the multiple nucleic acid molecules on the substrate, and (d) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to a protein-binding domain on the nucleic acid molecule.",
                        "In another embodiment, the method comprises (a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, (b) contacting a substrate with the multiple nucleic acid molecules, wherein the substrate comprises multiple nucleic acid sequences comprising the protein-binding domain and multiple DNA binding proteins, whereupon each of the multiple nucleic acid molecules is immobilized on the substrate via binding to a DNA-binding protein on the substrate, and (c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising a protein-binding domain on the substrate.",
                        "The inventive microarray and methods for producing protein microarrays comprises using or preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein. Each of the nucleic acid molecules can be any type of nucleic acid molecule, such as DNA, RNA, or cDNA. The multiple nucleic acid sequences can be of different types (e.g., a mixture of DNA and cDNA), but preferably they are of the same type. Desirably, each of the nucleic acid molecules is DNA, preferably supercoiled DNA, and most preferably supercoiled plasmid DNA. Any suitable number of nucleic acid sequences can be prepared. In that the inventive method can provide for high-throughput analysis of proteins, the invention typically comprises preparing at least 50 nucleic acid molecules (e.g., 50, 60, 70, 80, 90, or more nucleic acid molecules), preferably at least 100 nucleic acid molecules (e.g., 100, 200, 300, 400, or more nucleic acid molecules), and more preferably at least 500 nucleic acid molecules (e.g., 500, 600, 700, 800, 900, or more nucleic acid molecules). One of ordinary skill in the art will appreciate that the number of nucleic acid molecules prepared for use in the inventive array or method will depend upon the particular system or conditions used.",
                        "Each of the multiple nucleic acid molecules comprises a protein-binding domain. The term “protein-binding domain,” as used herein, refers to any nucleic acid sequence that is capable of being recognized and bound by a protein or peptide. Each nucleic acid molecule comprises one or more protein-binding domains (e.g., 1 or more, 2 or more, 5 or more, or 10 or more protein-binding domains). The protein-binding domain can be any suitable prokaryotic or eukaryotic protein-binding domain known in the art. Examples of suitable protein-binding domains include, but are not limited to, homeobox responsive elements (HRE) and operator sequences. Protein-binding domains are further described in, for example, Alberts et al., eds., Molecular Biology of the Cell, 3rd edition, Garland Publishing, Inc., New York (1994).",
                        "In a preferred embodiment of the invention, the nucleic acid sequence comprising a protein-binding domain is selected from the group consisting of an E. coli Ter sequence, an E. coli lactose (lac) operon operator sequence, and an E. coli galactose (gal) operon operator sequence. Most preferably, the nucleic acid sequence comprises an E. coli Ter nucleic acid sequence. A “Ter nucleic acid sequence,” as used herein, refers to any replication termination sequence from any source including those found in eukaryotic and prokaryotic organisms (including gram positive and gram negative microorganisms). A Ter nucleic acid sequence also includes any portion of a full-length Ter nucleic acid sequence that is recognized and bound by one or more Ter-binding proteins (e.g., replication terminator proteins or peptides). A portion of a Ter nucleic acid sequence comprises at least 5 nucleotides (e.g., 5, 6, 7, 8, 9, 10, or more nucleotides) of a full-length Ter nucleic acid sequence, but less than an entire Ter nucleic acid sequence. The Ter nucleic acid sequence can be double stranded or single stranded. The Ter nucleic acid sequence preferably is a wild-type Ter nucleic acid sequence, but can also be a mutated Ter nucleic acid sequence, so long as the mutated Ter nucleic acid sequence retains the ability to bind a Ter-binding protein. Mutant Ter nucleic acid sequences can be generated using standard mutagenesis techniques (e.g., to make deletions, substitutions, and/or insertions in the Ter sequence or by standard chemical synthesis techniques (e.g., oligonucleotide synthesis)). Functional domains and regions of Ter nucleic acid sequences necessary for proper function are described in, for example, Kamada et al., Nature, 383: 598-603 (1996) and Coskun-Ari and Hill, J. Biol. Chem., 272: 26448-26456 (1997). As discussed above, the Ter nucleic acid sequence preferably is an E. coli Ter nucleic acid sequence. Particularly preferred E. coli Ter nucleic acid sequences include SEQ ID NO:1, SEQ ID NO: 2, SEQ ID NO: 3, SEQ ID NO: 4, SEQ ID NO: 5, SEQ ID NO: 6, and SEQ ID NO: 7. Ter nucleic acid sequences are further described in U.S. Patent Application Publication No. 2003/0176644 A1.",
                        "Each of the multiple nucleic acid molecules also encodes a fusion protein. A “fusion protein,” as used herein, refers to a hybrid protein comprising polypeptide portions derived from two or more different proteins, and is synonymous with “chimeric protein.” In the context of the invention, each of the multiple nucleic acid molecules encodes a fusion protein comprising a polypeptide of interest and a DNA-binding protein (as described above) (hereinafter referred to as “the fusion protein”). The polypeptide of interest can be any suitable polypeptide obtained from any suitable organism. In one embodiment, the polypeptide is an animal polypeptide. The polypeptide can be derived from any suitable animal. Suitable animals include, for example, protozoa, echinoderms (e.g., sea urchins), annelids (e.g., earthworms), nematodes (e.g., C. elegans), mollusks, arthropods (e.g., crustaceans), insects, birds, amphibians, reptiles, and mammals (e.g., primates and rodents). Preferably, the organism is a mammal, and most preferably the organism is a human. In one embodiment, the polypeptide of interest is a target for a therapeutic agent (i.e., a drug). In this regard, the polypeptide of interest is a target for a known therapeutic agent, such as those described in, for example, Physician's Desk Reference, Medical Economics Co., Inc., Montvale, N.J. (2004). Alternatively, the polypeptide of interest is not a target for a known drug, but is a target against which a new drug is developed.",
                        "The fusion protein also comprises a DNA-binding protein. The term “DNA-binding protein,” as used herein, refers to any peptide, polypeptide, or protein that recognizes and binds to a nucleic acid sequence, preferably a DNA sequence. The DNA-binding protein can recognize and bind to a specific sequence of DNA, however, the DNA-binding protein need not be sequence-specific. One of ordinary skill in the art will appreciate that most DNA-binding proteins bind to DNA as homodimers or heterodimers and recognize DNA through one of a small number of structural motifs. Examples of such structural motifs include, for example, the helix-turn-helix motif, the homeodomain motif, the zinc finger motif, the leucine zipper motif, and the helix-loop-helix motif. The precise amino acid sequence that is folded into the binding motif determines the particular DNA sequence that is recognized by the DNA-binding protein. The DNA-binding protein can be any suitable eukaryotic or prokaryotic DNA-binding protein known in the art. Suitable DNA-binding proteins include, for example, TATA-box binding proteins, E. coli lacI protein, E. coli lac repressor protein (lacR), E. coli galactose operon repressor protein (GalR), eukaryotic transcription factor TFIIIA, bacteriophage lambda Cro protein, yeast GCN4 transcription activator, AP-1, and Ter-binding proteins (e.g., E. coli Tus protein). Artificial DNA binding proteins generated by methodologies known in the art (e.g., ribosome display, mRNA display, phage display, etc.) also can be used. Other DNA-binding proteins are described in, for example, Alberts et al, supra.",
                        "Preferably, the DNA-binding protein is a Ter-binding protein. A “Ter-binding protein” includes any protein that binds a Ter nucleic acid sequence. As discussed above, such proteins include, for example, replication terminator proteins (RTPs). An RTP is a sequence specific DNA-binding protein which, when bound to a double stranded Ter nucleic acid sequence, induces DNA replication arrest. In the context of the invention, the Ter-binding protein preferably is an E. coli Tus protein. The Tus protein (also referred to in the art as tau) is an RTP from E. coli with a molecular weight of 36,000 daltons (Da). The gene encoding Tus has been identified (see Hidaka, et al., J. Biol. Chem., 264: 21031-21037 (1989) and Hill et al., Proc. Natl. Acad. Sci. U.S.A., 86: 1593-1597 (1989)). The Tus protein binds Ter-sites as a monomer, and the crystal structure of the Tus-Ter complex has been elucidated (Bussiere, et al., Molecular Microbiology, 31(6): 1611-1618 (1999)). Tus binds the TerB site tightly with a dissociation constant of up to 3×10−13 M in vitro (depending on the buffer conditions). The binding of Tus to other Ter-sites is somewhat less tight with dissociation constants on the order of 10−10 to 10−11 M. The Ter-binding protein employed in the fusion protein preferably has a dissociation constant from a Ter-site of about 10−9 M to about 10−15 M, more preferably from about 10−10 M to about 10−14 M, and most preferably from about 10−11 M to about 10−13 M.",
                        "While the fusion protein preferably comprises a wild type Tus protein, a fusion protein comprising a mutant or variant of the Tus protein which retains the ability to bind a Ter nucleic acid sequence is within the scope of the invention. Suitable mutants include those with mutations in the DNA-binding domain such as those disclosed in Skokotas et al., J. Biol. Chem., 270: 30941-30948 (1995)). Functional domains of some Ter-binding proteins have been defined and may be altered to increase their ability to bind Ter. For example, mutations can be made in the replication fork-blocking domain of a Ter binding protein (see, e.g., Duggin et al, J. Mol. Biol., 286: 1325-1335 (1999)).",
                        "The fusion protein can comprise a modified Ter-binding protein. The modified Ter-binding protein may be a full length Ter-binding protein or a fragment of a Ter-binding protein that retains the ability to bind a Ter nucleic acid sequence. The Ter-binding protein can be modified by covalently attaching a moiety to the Ter-binding protein. The moiety may be covalently attached to the Ter-binding protein, for example, through the use of coupling reagents known in the art, such as those commercially available from, for example, Pierce Chemical Co., Rockford, Ill. The modifying moiety can be any suitable moiety that can be covalently attached to the Ter-binding protein. Suitable moieties include, but are not limited to, peptides, carbohydrates, and polysaccharides. In addition, the moiety can be a detection molecule. Suitable detection molecules are known to those skilled in the art and include, but are not limited to, enzymes with detectable activities such as horseradish peroxidase, alkaline phosphatase, luciferase, beta-galactosidase and beta-glucuronidase, fluorescent moieties, chromophores, haptens and/or epitopes recognized by an antibody. In embodiments where the fusion protein comprises a fragment of a Ter-binding protein, the fragment can be of any size that is less than the full-length Ter-binding protein but which retains the ability to bind a Ter nucleic acid sequence with sufficient affinity. Fragments of a Ter binding protein can be assayed for their ability to bind a Ter sequence using routine methods known in the art, such as, for example, gel mobility shift assays and DNA footprinting assays.",
                        "The nucleic acid sequence encoding the fusion protein is operably linked to a promoter. A “promoter” is a DNA sequence that directs the binding of RNA polymerase and thereby promotes RNA synthesis. A nucleic acid sequence is “operably linked” to a promoter when the promoter is capable of directing transcription of that nucleic acid sequence. Any promoter (i.e., whether isolated from nature or produced by recombinant DNA or synthetic techniques) can be used in connection with the invention to provide for transcription of the nucleic acid sequence encoding the fusion protein. The promoter preferably is capable of directing transcription in a eukaryotic or prokaryotic cell. The functioning of the promoter can be altered by the presence of one or more enhancers and/or silencers present on the vector. “Enhancers” are cis-acting elements of DNA that stimulate or inhibit transcription of adjacent genes. An enhancer that inhibits transcription also is termed a “silencer.” Enhancers differ from DNA-binding sites for sequence-specific DNA binding proteins found only in the promoter (which also are termed “promoter elements”) in that enhancers can function in either orientation, and over distances of up to several kilobase pairs (kb), even from a position downstream of a transcribed region.",
                        "Promoter regions can vary in length and sequence and can further encompass one or more DNA binding sites for sequence-specific DNA binding proteins and/or an enhancer or silencer. Enhancers and/or silencers can similarly be present on a nucleic acid sequence outside of the promoter per se. Desirably, a cellular or viral enhancer, such as the cytomegalovirus (CMV) immediate-early enhancer, is positioned in the proximity of the promoter to enhance promoter activity. In addition, splice acceptor and donor sites can be present on a nucleic acid sequence to enhance transcription.",
                        "The nucleic acid sequence can be operably linked to a viral promoter. Suitable viral promoters are known in the art and include, for instance, cytomegalovirus (CMV) promoters, such as the CMV immediate-early promoter, promoters derived from human immunodeficiency virus (HIV), such as the HIV long terminal repeat promoter, Rous sarcoma virus (RSV) promoters, such as the RSV long terminal repeat, mouse mammary tumor virus (MMTV) promoters, HSV promoters, such as the Lap2 promoter or the herpes thymidine kinase promoter (Wagner et al., Proc. Natl. Acad. Sci., 78, 144-145 (1981)), promoters derived from SV40 or Epstein Barr virus, an adeno-associated viral promoter, such as the p5 promoter, and the like.",
                        "Alternatively, the invention employs a cellular promoter, i.e., a promoter that drives expression of a cellular protein. In this regard, the cellular promoter can be a constitutive promoter that works in a variety of cell types, and drives expression of genes encoding transcription factors, housekeeping genes, or structural genes common to eukaryotic cells. For example, the Ying Yang 1 (YY1) transcription factor (also referred to as NMP-1, NF-E1, and UCRBP) is a ubiquitous nuclear transcription factor that is an intrinsic component of the nuclear matrix (Guo et al., PNAS, 92: 10526-10530 (1995)). YY1 is a regulatory protein that responds to changes in the cellular environment. While the promoters described herein are considered as constitutive promoters, it is understood in the art that constitutive promoters can be upregulated. Promoter analysis shows that the elements critical for basal transcription reside from −277 to +475 of the YY1 gene relative to the transcription start site from the promoter, and include a TATA and CCAAT box. JEM-1 (also known as HGMW and BLZF-1) also is a ubiquitous nuclear transcription factor identified in normal and tumorous tissues (Tong et al., Leukemia, 12(11): 1733-1740 (1998), and Tong et al., Genomics, 69(3): 380-390 (2000)). JEM-1 is involved in cellular growth control and maturation, and can be upregulated by retinoic acids. Sequences responsible for maximal activity of the JEM-1 promoter haves been located at −432 to +101 of the JEM-1 gene relative the transcription start site of the promoter. Unlike the YY1 promoter, the JEM-1 promoter does not comprise a TATA box. The ubiquitin promoter, specifically UbC, is a strong constitutively active promoter functional in several species. The UbC promoter is further characterized in Marinovic et al., J. Biol. Chem., 277(19): 16673-16681 (2002).",
                        "Many of the above-described promoters are constitutive promoters. Instead of being a constitutive promoter, the promoter can be an inducible promoter, i.e., a promoter that is up- and/or down-regulated in response to appropriate signals. Examples of suitable inducible promoter systems include, but are not limited to, the IL-8 promoter, the metallothionine inducible promoter system, the bacterial lacZYA expression system, and the tetracycline expression system. The promoter sequence that regulates expression of the nucleic acid sequence can contain at least one heterologous regulatory sequence responsive to regulation by an exogenous agent. The regulatory sequences are preferably responsive to exogenous agents such as, but not limited to, drugs, hormones, or other gene products.",
                        "Preferably, the promoter is a bacteriophage promoter. Suitable bacteriophage promoters include, for example, a phage T3 promoter, a phage T7 promoter, a phage M13 promoter, a phage SP6 promoter, and a hybrid phage T5 promoter. Most preferably, the promoter is a phage T7 promoter.",
                        "The construction of fusion proteins is routine in the art (see, e.g., U.S. Pat. Nos. 5,130,247 and 6,254,870). The polypeptide of interest may be fused to the N-terminal of the DNA-binding protein, the C-terminal of the DNA-binding protein or at an interior position of the DNA-binding protein. Any site of fusion may be used so long as the binding capability of the DNA-binding protein is not substantially reduced. In this context, substantially reduced indicates that the DNA-binding protein does not bind a protein binding domain with sufficient affinity to allow immobilization and detection of the fusion protein comprising a DNA-binding protein.",
                        "The invention further comprises a substrate which is contacted with the multiple nucleic acid molecules. Substrates for use in the invention can be any support or matrix suitable for attaching nucleic acid molecules and proteins. Suitable substrates include, but are not limited to, silicon, nitrocellulose, diazocellulose, glass, polystyrene (including microtitre plates), polyvinylchloride, polypropylene, polyethylene, polyvinylidenedifluoride (PVDF), dextran, sepharose, agar, starch, nylon, and metal. The substrate can be in any form or configuration, including chips, plates, beads, filters, membranes, sheets, frits, plugs, columns, and the like. The substrate can also include multi-well tubes or plates, such as 12-well plates, 24-well plates, 48-well plates, 96-well plates, and 384-well plates. Preferred beads are made of glass, latex, or a magnetic material (magnetic, paramagnetic, or superparamagnetic beads).",
                        "In one embodiment of the invention, the multiple nucleic acid molecules encoding the fusion proteins are immobilized directly on the substrate using routine methods known in the art. In another embodiment of the invention, the substrate comprises multiple DNA-binding proteins and multiple nucleic acid sequences comprising a protein-binding domain. In this embodiment, the DNA-binding protein on the substrate binds to the protein-binding domain present in each fusion protein-encoding nucleic acid molecule. Nucleic acid molecules can be applied, printed, or spotted onto the substrate using photolithography, pipetting, drop-touch methods, piezoelectric (ink-jet) methods, electric methods, robotic methods, and other methods known in the art. Nucleic acid molecules can be immobilized on a particular substrate by noncovalent or covalent interactions. In this regard, nucleic acid sequences can be noncovalently immobilized on a glass slide coated with, for example, either poly-L-lysine or aminopropyltri-ethoxysilane. The noncovalent charge interactions between the negatively charged phophodiester groups of the nucleic acids and the positively charged amino groups of, for example, surface-bound lysine side-chains, can result in decreased sensitivity of the microarray due to loss of nucleic acids from the glass surface. Thus, the nucleic acid molecules preferably are immobilized on the substrate via covalent interactions. Methods for covalently immobilizing nucleic acids onto various microarray substrates are described in, for example, Beaucage, Curr. Medicinal Chem., 8:1213-1244 (2001). DNA microarray fabrication, immobilization, and analysis are further described in, for example, Schena, ed., Microarray Biochip Technology, Eaton Publishing Company/Biotechniques Books, 298 pp. (2000). Proteins can be applied, printed, or spotted onto the substrate using, for example, piezoelectric dispensing methods, robotic methods, contact-pin printing technology, and other methods known in the art. Like nucleic acids, proteins can be immobilized on a substrate via noncovalent or covalent interactions, but covalent interactions preferably are used. In this regard, for example, proteins can be spotted on glass slides coated with aminosilane, poly-L-lysine, or agarose film, and immobilized on the slides by the Schiff base aldehyde-amine chemistry. Protein microarray fabrication, immobilization, and analysis are further described in, for example, Schena, ed., Protein Microarrays, Jones and Bartlett Publishers, Inc., 496 pp. (2004), MacBeath, Nature Genetics, 32: 526-532 (2002), MacBeath et al., Science, 289: 1760-1763 (2000), and Tang et al., Advanced Nanomaterials and Nanodevices, 8th International Conference on Electronic Materials, Xi'an, China, Jun. 10-14 (2002)).",
                        "In a preferred embodiment of the invention, the multiple nucleic acid molecules are oriented on the substrate such that the protein-binding domain (e.g., a Ter site) and the nucleic acid sequence encoding the fusion protein are more readily available to the expression composition (discussed below), resulting in more efficient production of the fusion protein and subsequent binding of the fusion protein to the protein-binding domain. In this regard, the nucleic acid molecule can be immobilized on the substrate such that the protein-binding domain and the nucleic acid sequence encoding the fusion protein are more readily available and accessible to the expression composition (see FIG. 8). To ensure that the nucleic acid molecules are immobilized on the substrate in a more desired orientation, triple helix technology can be used. Oligonucleotides can bind as third strands of DNA in a sequence-specific manner in the major groove in homopurine/homopyrimidine stretches in duplex DNA (Havre et al., Proc. Natl. Acad. Sci. USA, 90: 7879-7883 (1993)). In the context of the invention, a short double-stranded oligonucleotide with homopurine/homopyrimidine stretches can be cloned into the nucleic acid molecule in a location separate from both the protein-binding domain and the nucleic acid sequence encoding the fusion protein. A third oligonucleotide is then designed that is complementary to the short double-stranded oligonucleotide. By way of this complementarity, the third oligonucleotide hybridizes to the short double-stranded oligonucleotide, thereby forming a triple helix structure within the nucleic acid molecule. The third oligonucleotide typically contains an active group (e.g., psoralen, biotin, or an amino group) at the 5′ and 3′ ends of the molecule (“A” and “B” in FIG. 8). One active group (e.g., psoralen) facilitates covalent bonding between the third oligonucleotide and the short double-stranded oligonucleotide cloned into the nucleic acid molecule. The active group at the other end of the third oligonucleotide (e.g., biotin or amine) facilitates immobilization of the nucleic acid molecule to an appropriate substrate, and the nucleic acid molecule is immobilized on the substrate in the desired orientation. Triple helix technology is known in the art, and described in, for example, Thuong et al., Angewandte Chemie. Intl. Ed. Eng, 32: 666-690 (1993), and Frank-Kamenetskii et al., Annu. Rev. Biochem., 64: 65-95 (1995). The present invention, however, is not limited to the use of triple helix technology to specifically position a nucleic acid molecule on a substrate. Other methods for specifically positioning a nucleic acid molecule on a substrate are known in the art and are within the scope of the present invention.",
                        "The invention further comprises contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced. The term “expression composition,” as used herein, refers to a composition comprising all of the elements required for transcription and translation of a nucleic acid sequence. Such elements are known in the art and include, for example, RNA polymerase, transcription factors, splicing factors, tRNA molecules, etc. The expression composition can be any suitable composition that enables cell-free transcription and translation. The expression composition preferably comprises the transcription and translation machinery of rabbit reticulocytes, wheat germ extract, E. coli, or any other suitable source. Rabbit reticulocytes can translate large mRNA transcripts and carry out post-translational processing, such as glycosylation, phosphorylation, acetylation, and proteolysis. Wheat germ extract is best suited for expression of smaller proteins, and E. coli cell-free extracts are capable of carrying out transcription and translation in the same reaction environment. Commercially available cell-free expression compositions include, for example, rabbit reticulocyte extracts (Promega, Madison, Wis.), pCOLADuet™ (Novagen, Madison, Wis.), Expressway™ Linear Expression System (Invitrogen Corp., Carlsbad, Calif.), pIEX™ Insect Cell Expression Plasmids (Novagen, Madison, Wis.) and the Rapid Translation System (Roche Diagnostics Corp., Indianapolis, Ind.).",
                        "Upon transcription of the multiple nucleic acid sequences and translation of the encoded fusion proteins, each fusion protein is immobilized on the substrate via interaction of the DNA-binding protein portion of the fusion protein with a nucleic acid sequence comprising a protein-binding domain. In embodiments where the multiple nucleic acid molecules encoding the fusion proteins are immobilized directly on the substrate, the fusion proteins are immobilized on the substrate via binding to the protein-binding domain present on the nucleic acid molecules from which the fusion proteins are produced. For example, plasmids comprising a Ter nucleic acid sequence and encoding a fusion protein comprising a polypeptide of interest and a Tus protein can be spotted on a substrate and subjected to cell-free transcription/translation. The resulting fusion protein is immobilized on the substrate by binding to the Ter nucleic acid sequence on the plasmid (see FIG. 3). One of ordinary skill in the art will appreciate that this example is equally applicable to other DNA-binding proteins and protein binding domains disclosed herein. Alternatively, in embodiments where the substrate comprises multiple nucleic acid sequences comprising the protein-binding domain, the fusion proteins are immobilized on the substrate via the DNA-binding protein portion of the fusion protein binding to a protein-binding domain on the substrate (see, e.g., FIG. 4).",
                        "The invention further provides a method of analyzing interactions between a protein and a compound of interest. The method comprises (a) producing a protein microarray as described herein, (b) contacting the protein microarray with a sample comprising one or more compounds of interest, and (c) detecting binding of the one or more compounds of interest with one or more of the fusion proteins immobilized on the protein microarray. Descriptions of the protein microarray, the DNA-binding protein, the protein-binding domain, and the nucleic acid molecules encoding a fusion protein set forth above in connection with other embodiments of the invention also are applicable to those same aspects of the aforesaid inventive method for analyzing protein-protein interactions.",
                        "It will be appreciated that the method for analyzing interactions between a protein and a compound of interest is used to identify compounds that interact with the polypeptide of interest present in the fusion protein immobilized on the substrate. In this manner, the inventive method can be employed to elucidate potential drug targets, and to map particular biological pathways. Thus, the compound of interest can be any compound that interacts with a protein, including, but not limited to, other proteins, nucleic acid molecules, lipids, and drugs. The sample comprising one or more compounds of interest can be any suitable sample, but preferably is a sample obtained from a mammal (e.g., a human). The sample can be a solid sample, such as a tissue sample, or the sample can be fluid, such as a sample of body fluid. For instance, a section of whole tissue can be homogenized to liquefy the components found in the tissue. The tissue sample can be obtained from any suitable organ, including diseased organs (e.g., organs affected by cancer). Suitable fluid samples include, but are not limited to, blood, saliva, serum, plasma, lymph, interstitial fluid, and cerebrospinal fluid.",
                        "Whatever sample is used, each of the one or more compounds in the sample preferably comprises a detectable label. The detectable label preferably is attached to each protein via covalent linkage to the amino groups on the proteins. Any suitable detectable label known in the art can be employed in the inventive method. Preferably, the detectable label is a fluorescent dye, such as, for example, Cy5 (red fluorescence) and Cy3 (green fluorescence). The sample preferably is in a solution, and is applied to the protein microarray using methods described in the art. Methods for preparing protein samples for protein microarrays are described in, for example, Haab et al., supra.",
                        "Once the sample has been applied to the protein microarray, the microarray is incubated under conditions that allow for compounds in the sample to bind one or more fusion proteins on the microarray. Incubation conditions will vary depending on the type of compounds analyzed and the detectable labels employed. Detection schemes are generally described in, for example, Haab et al., supra, MacBeath et al., supra, and Kodadek, Chemistry & Biology, 8: 105-115 (2001)). Typically and preferably, all unbound compounds are washed off the microarray, leaving only bound compounds. The binding of a compound in the sample to a fusion protein on the microarray preferably is visualized via fluorescence detection. To maximize the robustness and quantitative accuracy of the microarray, comparative fluorescence measurements can be made, using an internal standard for each protein to be assayed. In this respect, two differentially labeled solutions containing compounds of interest can be mixed together and then incubated with the microarray so that the fluorescence ratio at each spot on the microarray corresponds to the ratio of each compound in the two solutions (see, e.g., Haab et al., supra).",
                        "In a preferred embodiment of the invention, the compound of interest is another protein. In this respect, the invention provides a method of analyzing interactions between two proteins. The method comprises (a) preparing at least a first nucleic acid molecule and a second nucleic acid molecule, wherein the first nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a first fusion protein comprising a first polypeptide of interest and a DNA-binding protein, and the second nucleic acid molecule comprises (i) a protein binding domain and (ii) a nucleic acid sequence encoding a second fusion protein comprising a second polypeptide of interest and an epitope that binds an antibody, (b) contacting a substrate with the first and second nucleic acid molecules, wherein the substrate comprises multiple DNA-binding proteins and multiple nucleic sequences comprising the protein-binding domain, whereupon the first and second nucleic acid molecules are immobilized at the same location on the substrate via binding to a DNA-binding protein on the substrate, (c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequences encoding the first and second fusion proteins are expressed and the first and second fusion proteins are produced, whereupon the first fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain on the substrate, and (d) detecting immobilization of the epitope of the second fusion protein on the substrate, wherein immobilization of the epitope of the second fusion protein on the substrate indicates binding of the second polypeptide of interest to the first polypeptide of interest. Descriptions of the substrate, the DNA-binding protein, the protein-binding domain, the expression composition, and the nucleic acid molecules encoding a fusion protein set forth above in connection with other embodiments of the invention also are applicable to those same aspects of the aforesaid inventive method for analyzing protein-protein interactions.",
                        "In this embodiment, preferably at least two nucleic acid molecules are applied to the same location on the substrate. One of ordinary skill in the art will appreciate that more than one location (or “spot”) on the substrate can contain two or more (e.g., 2, 5, 10, 20, 100, or more) nucleic acid sequences. The first and second nucleic acid molecules can be applied to the substrate using any suitable method described herein. The first nucleic acid molecule comprises a nucleic acid sequence encoding a first fusion protein, while the second nucleic acid molecule comprises a nucleic acid sequence encoding a second fusion protein. The first and second fusion proteins preferably are different. In this respect, the first fusion protein comprises a first polypeptide of interest and a DNA-binding protein, while the second fusion protein comprises a second polypeptide of interest and an epitope that binds an antibody. One of ordinary skill will appreciate that conventional methods for identifying protein-protein interactions, such as yeast two-hybrid screens, typically involve generating proteins of interest comprising DNA binding domains and/or other analyte domains (e.g., activation domains) fused to the carboxy terminus of the protein of interest. In the context of this embodiment of the invention, the DNA-binding protein and the epitope can be located at the amino or carboxy terminus of the first or second fusion protein, respectively.",
                        "The epitope present in the second fusion protein preferably binds an antibody, the binding of which is detected visually. The epitope can be any suitable epitope that can be recognized by any suitable antibody known in the art. Suitable epitopes include, for example, FLAG, HA, HIS, c-Myc, VSV-G, V5 and HSV. In this manner, the epitope is immobilized on the substrate and detected only if the first polypeptide of interest interacts with the second polypeptide of interest. To illustrate, the first nucleic acid molecule can be a plasmid that encodes a fusion protein comprising protein “A” and a DNA-binding protein (as described herein). The second nucleic acid molecule can be a plasmid that encodes a fusion protein comprising protein “B” and an epitope. Each of these nucleic acid molecules are applied to the same location (or “spot”) on the substrate and immobilized as described herein. The immobilized nucleic acid molecules are contacted with an expression composition as described herein, and the fusion proteins encoded by each of the at least two nucleic acid molecules located in the same position on the microarray are produced. In the event that protein “A” interacts with (i.e., binds to) protein “B”, the epitope present in the fusion protein containing protein “B” will be immobilized on the substrate and detected by exposing the substrate to the appropriate antibody (see FIGS. 5 and 6).",
                        "The following examples further illustrate the invention but, of course, should not be construed as in any way limiting its scope."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLE 1",
                            "paragraphs": [
                                "This example demonstrates the production of a protein microarray in accordance with the invention.",
                                "**Construction of Base Microarray Plasmid**",
                                "A base microarray plasmid vector (pDest Microarray TT-1) containing a Ter site and a Tus protein for cloning genes of interest was constructed. First, a destination vector was made with E. coli Tus protein as a carboxy fusion partner. A Tus protein with greater affinity for a Ter sequence (Tus E47Q) was amplified from plasmid DNA by standard procedures (see Henderson et al., Mol. Genet. Genomics, 265: 941-953 (2001)). The sequences of the oligonucleotides used for the Tus amplifications are set forth below as SEQ ID NO: 8 and SEQ ID NO: 9. Restriction sites NheI and MunI are indicated as bold and underlined. A six-histidine tag (underlined and italics) was incorporated in the reverse primer so to enable downstream identification of Tus.",
                                "The PCR product was purified and digested with NheI and MunI, and run on an agarose gel. The fragment was purified again and cloned into a derivative pDest47 vector (Invitrogen Corp., Carlsbad, Calif.), called pDest472, and digested to create pDest 472-Tus. Correct clones were selected by restriction digestion and by sequencing.",
                                "A Ter site (bold and underlined) was synthesized by annealing two complementary oligos having the following sequences:",
                                "Upon annealing, the complementary oligonucleotides formed a double stranded Ter site with ClaI and NgoMIV digested overhangs. The annealed oligonucleotide was cloned into pDest 472-Tus digested with NgoMIV and ClaI to create pDest Microarray TT-1 (see FIG. 1). The clone was verified by sequencing. As stated above, this base plasmid is suitable for constructing an in-frame Tus fusion with any protein of interest using the Gateway™ recombinational cloning system (Invitrogen Corp., Carlsbad, Calif.).",
                                "In addition to a wild-type Ter site, a mutant Ter site was also tested for Tus fusion capture. During the course of cloning the Ter site above, a mutant Ter site was obtained. The mutated Ter site has the following sequence (the mutation site is underlined) CACTTTAGTTACAACATATTTATT (SEQ ID NO: 12). It has been shown that mutation at this particular site reduces the Tus binding affinity by almost 4-fold (see Coskun-Ari et al., supra).",
                                "**Construction of GFP Fusion Plasmid**",
                                "Green fluorescent protein (GFP) was cloned as a fusion with the Tus protein. The plasmid pEL100 contains a GFP gene inserted into pDonr223 (Invitrogen Corp., Carlsbad, Calif.). The vector pEL100 contains a Kozak sequence upstream of ATG and no stop codon at the C-terminus. Thus, upon recombinational cloning into pDest Microarray TT-1, GFP was in frame with Tus (GFP-Tus-His6 plasmid) (see FIG. 2). Recombinational cloning using the Gateway™ system (Invitrogen Corp., Carlsbad, Calif.) was performed as per the manufacturer's instructions. The clone was sequenced to confirm proper insertion. To demonstrate the specificity of Tus-Ter binding, a GFP-Tus-His6 plasmid lacking a Ter site also was tested.",
                                "**Microarray Fabrication**",
                                "GFP-Tus-His6 plasmids were prepared in 3× standard saline citrate (SSC) in a 384-well plate (Genetix USA, Inc., Boston, Mass.) and arrayed on FAST™ nitrocellulose coated slides (Schleicher & Schuell BioScience, Keene, N.H.) using a Microgrid II arrayer at 50% humidity. After printing the FAST™ slides with the GFP-Tus-His6 plasmids, they were baked at 80° C. for 30 minutes. Slides were blocked with 0.1% PVP/0.05% Tween 20 for 1 hour prior to expression.",
                                "**In Situ Protein Expression**",
                                "In situ expression was performed using a cell-free expression system (TNT Quick coupled transcription/translation system (Promega Corp., Madison, Wis.)). Briefly, 30 μl of rabbit reticulocyte lysate supplemented with methionine, according to manufacturer's instructions, was added directly to the slide. Expression and immobilization were carried out at 30° C. for 1.5 hours followed by incubation at 15° C. for 2 hours in a water bath.",
                                "**Confirmation of Expression and Immobilization of Expressed Proteins**",
                                "Expression of the GFP-Tus fusion protein was confirmed with Cy3 and Cy5 labeled monoclonal antibodies to the His6 (poly-his) tag. Prior to incubation with the labeled antibody, slides were blocked for 1 hour with 0.1% PVP/0.05% Tween 20. The monoclonal antibody to the poly-his tag (Sigma-Aldrich, St. Louis, Mo.) was labeled with fluorescent dye N-hydroxysuccinimide (NHS) ester-linked Cyanine 3 (Cy3) and Cyanine 5 (Cy5) (Amersham BioSciences, Piscataway, N.J.). Briefly, 90 μl of the anti-poly-his antibody diluted to the concentration of 0.55 mg/ml in 0.1 M sodium bicarbonate/carbonate buffer pH 9.0 was mixed with 20 μl of 60 μM of Cy3 or Cy5 in sodium bicarbonate/carbonate buffer and incubated on ice. After the reaction had proceeded for 90 minutes, 8 μl of Blocking Buffer (BD Biosciences, San Jose, Calif.) was added to the solution to quench the reactions, and the solutions were allowed to sit for another 30 minutes with additional mixing approximately every 10 minutes. The unconjugated dye was removed by passing each sample through a size-exclusion chromatography spin column (sephadex G-15 (Sigma Aldrich, St. Louis, Mo.) in Micro Bio-spin columns (Bio-Rad Laboratories, Inc., Hercules, Calif.). Molar concentrations for labeled protein and dye were calculated. The Cy5-labeled anti-his antibody was mixed with an equal amount of the Cy3-labeled anti-his antibody and diluted in the array buffer (0.1% PVP/0.05% Tween 20). Hybridization to the array was performed in an incubation chamber at 4° C. with gentle rocking for at least 12 hours. After incubation, slides were washed three times for 5 minutes each in 10 mM PBS/0.05% Tween 20, followed by one wash in 10 mM PBS for one minute. All washes were performed at 4° C. Slides were dried and subjected to fluorescence detection.",
                                "The hybridized arrays were scanned with an Axon GenePix 4000 scanner (Molecular Devices Corporation, Sunnyvale, Calif.), and fluorescence data were collected and evaluated with the GenePix Pro 5.0 software (Molecular Devices Corporation, Sunnyvale, Calif.). For the microarray imaging, the Axon GenePix 4000 scanner was set at 100% laser power and 350% PMT gain.",
                                "Significant signal intensities (see Table 1, arbitrary units of 14000 and 20574 with Cy5 and Cy3, respectively) were observed from the array containing the vector with a wild type Ter site, confirming the expression and binding of the GFP-Tus fusion protein. On the other hand, no signal intensity was observed in Cy5 and a faint signal was observed in Cy3 (2463 units) from the array containing the vector without any Ter site. The signal ratio of TER−/TER+ (no mutation; wild-type) was 0 for Cy5 and 0.12 for Cy3. These numbers represent higher binding of labeled anti-his antibody to the fusion protein expressed from the plasmid with wild-type Ter (no mutation) when compared with the control plasmid without any Ter site (no TER), and suggest that no binding occurred between the fusion protein and the plasmid without any Ter site.",
                                "To determine whether a mutation in the Ter sequence could influence the formation of the Tus-Ter binding complex and affect microarray fabrication, the hybridization signal from the wild-type Ter vector was compared with the hybridization signal from the mutated Ter (Mut) vector described above. The results of these experiments are set forth below in Table 1.",
                                "The signal ratio of TER(−)/mutant TER(+) was 0 for Cy5 and 0.22 for Cy3.",
                                "These data confirm the expression and binding of the GFP-Tus fusion protein to the vector comprising a mutated Ter site. This vector, however, produced lower signal intensities than those observed with the vector comprising a wild-type Ter site. These results demonstrate that an intact Ter sequence is necessary for Tus binding, which in turn enables the binding of the expressed fused protein to the vector immobilized on the microarray slide."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "construct base microarray plasmid",
                                "amplify Tus protein",
                                "clone Tus protein into pDest472 vector",
                                "synthesize Ter site",
                                "clone Ter site into pDest472-Tus vector",
                                "construct GFP fusion plasmid",
                                "clone GFP into pDest Microarray TT-1 vector",
                                "fabricate microarray",
                                "perform in situ protein expression",
                                "confirm expression and immobilization of expressed proteins",
                                "test specificity of Tus-Ter binding",
                                "compare signal intensities with and without Ter site",
                                "test effect of mutated Ter site on Tus-Ter binding",
                                "compare signal intensities with wild-type and mutated Ter sites",
                                "conclude necessity of intact Ter sequence for Tus binding"
                            ],
                            "num_characters": 7948,
                            "outline_medium": [
                                "construct base microarray plasmid",
                                "construct GFP fusion plasmid",
                                "fabricate microarray",
                                "perform in situ protein expression",
                                "confirm expression and immobilization of expressed proteins",
                                "test Tus-Ter binding complex formation",
                                "analyze microarray results"
                            ],
                            "outline_short": [
                                "construct base microarray plasmid",
                                "construct GFP fusion plasmid",
                                "fabricate and test microarray"
                            ]
                        },
                        {
                            "title": "EXAMPLE 2",
                            "paragraphs": [
                                "This example demonstrates a method of analyzing interactions between two proteins.",
                                "Microarray plasmids and microarrays are generated as described in Example 1. Specifically, plasmids are generated containing nucleic acid sequences encoding fusion proteins containing combinations of a first protein (“protein A”), a second protein (“protein B”), an epitope that can be detected with an antibody, and/or a DNA-binding protein (DBP) that recognizes a DNA sequence present in a spot on a microarray. The DNA-binding protein may be located on one or more expression plasmids, or on a separate plasmid or oligonucleotide in each spot. To test for an interaction between proteins A and B, expression cassettes encoding fusion proteins containing protein A, protein B, an epitope, and/or a DNA-binding protein can be cloned into plasmids according to Table 2. The order of the nucleic acid sequences set forth in Table 2 is not fixed, and the optimal arrangement of nucleic acid sequences can be determined by experiment.",
                                "To determine whether protein A interacts with (i.e., binds to) protein B, the plasmids of Table 2 can be applied as “spots” to a microarray substrate as set forth in Table 3.",
                                "Spots 3 and 4 are not necessary if a preliminary screen shows that very few proteins interact with the epitope. Detection of protein expression (spots 1 and 2) and protein-protein interactions (spots 7 and 8) is achieved using an antibody specific for the epitope. These four spots should be positive, the others should be negative.",
                                "The following information can be derived from spots 1-9: (1) comparison of spots 1 and 2 demonstrates how well fusion proteins containing protein A and protein B are expressed, bound to the microarray, and detected. Plasmid 9 (mock, no protein expression) is added to the microarray so that the amount of protein expressed in spots containing one expression plasmid should approximate the amount of that protein expressed when there are two expression plasmids in a single spot, (2) spots 5 and 6 are equivalent to “self-activators” in yeast 2-hybrid screens, and are necessary for assessing interactions in spots 7 and 8, (3) if protein A interacts with protein B and vice versa, spot 7 will be brighter than spot 6, and spot 8 will be brighter than spot 5, (4) spots 7 and 8 need not be the same intensity (as fusions to proteins A and B may express, bind, and/or detect differently), but should be brighter than spots 6 and 5, respectively, (5) spots 5 and 6 need not be completely negative, only fainter (preferably much fainter) than spots 8 and 7, respectively.",
                                "Thus, each protein to be tested must be cloned into three different plasmids, two of which are applied to the microarray as control spots. In addition, plasmids 7, 8, and 9 are required for negative controls. FIG. 5. illustrates this method when two proteins interact with each other, and FIG. 6 illustrates this method when two proteins do not interact with each other.",
                                "In a more specific embodiment, protein A, for example, can be the Fos protein, and protein B can be the Jun protein. The epitope can be a FLAG epitope, and the DNA binding protein can be a Tus protein as described herein (see, e.g., Kaplan, Curr. Biol., 16(17): R684-686 (2006)). The Myc protein can be used as a negative control for protein interaction, DNA binding, and antibody interaction. An additional negative control protein can be phosphofructokinase (PFK).",
                                "To test for an interaction between Fos and Jun, expression cassettes encoding fusion proteins containing protein Fos, Jun, the FLAG epitope, and/or the Tus protein can be cloned into plasmids according to Table 4.",
                                "To determine whether Fos interacts with (i.e., binds to) Jun, the plasmids of Table 4 can be applied as “spots” to a microarray substrate as set forth in Table 5.",
                                "Even if two proteins interact, the intensity of the spot that is observed depends on how much of each protein is made. This can be evaluated by expressing each protein alone but fused to both the DBP and the epitope, e.g., Fos-Tus-FLAG in one spot and Jun-Tus-FLAG in another spot. Thus, each fusion protein can both bind to the microarray and be detected. Comparison of the intensity of these spots to the intensity of the interaction spot is an indicator of the strength of interaction. A false positive could result if either the Jun-Tus fusion protein or the Fos-Tus fusion protein can bind the epitope (which would thus be immobilized on the spot). To control for this event, a spot on the microarray containing a Jun-Tus fusion protein and a Myc-epitope fusion protein (where Myc is a known non-interactor and non-DNA binder), and a spot on the microarray containing a Fos-Tus fusion protein and a Myc-epitope fusion protein should both be negative.",
                                "Another type of false positive could result if either Jun or Fos can bind a spot directly, via binding the DNA on the solid support itself. To control for this event, a spot containing a Jun-FLAG fusion protein and a spot containing a Fos-FLAG fusion protein should give no signal.",
                                "In another embodiment, the method can be used to confirm that two proteins do not interact, such as Fos and Myc. To this end, for example, the plasmids of Table 4 can be applied as “spots” to a microarray substrate as set forth in Table 6.",
                                "In yet another embodiment, the method can be used to confirm that two proteins interact, even if one of the proteins is poorly expressed on the microarray. To this end, for example, protein A can be the Kal7 protein, and protein B can be the EphB7 protein. The epitope can be a FLAG epitope, and the DNA binding protein can be a Tus protein. The PFK protein can be used as a negative control. To test for an interaction between Kal7 and EphB7, expression cassettes encoding fusion proteins containing Kal7, EphB7, the FLAG epitope, and/or the Tus protein can be cloned into plasmids according to Table 7.",
                                "To determine whether Kal7 interacts with (i.e., binds to) EphB7, the plasmids of Table 7 can be applied as “spots” to a microarray substrate as set forth in Table 8.",
                                "This method also can be used to detect a weak interaction between two proteins, even if high levels of both proteins are expressed on the microarray. To this end, for example, protein A can be the Nmd2p protein, and protein B can be the Upf1p protein. The epitope can be a FLAG epitope, and the DNA binding protein can be a Tus protein. The PFK protein can be used as a negative control. To test for an interaction between Kal7 and EphB7, expression cassettes encoding fusion proteins containing Nmd2p, Upf1p, the FLAG epitope, and/or the Tus protein can be cloned into plasmids according to Table 9.",
                                "To determine whether Nmd2p interacts with (i.e., binds to) Upf1p, the plasmids of Table 9 can be applied as “spots” to a microarray substrate as set forth in Table 10.",
                                "This example demonstrates a method of analyzing protein-protein interactions in accordance with the invention."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "generate microarray plasmids and microarrays",
                                "design expression cassettes for protein-protein interaction analysis",
                                "clone expression cassettes into plasmids",
                                "apply plasmids to microarray substrate",
                                "detect protein expression and protein-protein interactions",
                                "analyze spots for protein-protein interactions",
                                "control for false positives",
                                "test for interaction between Fos and Jun proteins",
                                "test for interaction between Fos and Myc proteins",
                                "test for interaction between Kal7 and EphB7 proteins",
                                "test for weak interaction between Nmd2p and Upf1p proteins",
                                "illustrate method for protein-protein interaction analysis",
                                "conclude method for analyzing protein-protein interactions"
                            ],
                            "num_characters": 6950,
                            "outline_medium": [
                                "generate microarray plasmids and microarrays",
                                "design expression cassettes for protein-protein interaction analysis",
                                "apply plasmids to microarray substrate",
                                "detect protein expression and protein-protein interactions",
                                "analyze interaction results",
                                "control for false positives and negatives"
                            ],
                            "outline_short": [
                                "generate microarray plasmids and microarrays",
                                "test for protein-protein interactions",
                                "analyze and interpret results"
                            ]
                        },
                        {
                            "title": "EXAMPLE 3",
                            "paragraphs": [
                                "This example demonstrates the production of a protein microarray in accordance with the invention.",
                                "Using the methods disclosed in Example 1, expression plasmids comprising a wild-type Ter site and encoding a fusion protein comprising (a) one of 14 different proteins, (b) a Tus protein, and (c) a poly-histidine sequence were immobilized onto the surface of a microarray. The 14 different proteins included integrin-B, Stat4, cyclin dependent kinase (CDK), interleukin-13 (IL-13), F-box, importin alpha, interferon gamma (IFNG), Cyclin D2, β-globin, hypoxia-inducible factor 1 (HIF-1), Fos, Jun, green fluorescent protein (GFP), and Chk2. The following expression plasmids served as negative controls: (a) a Fos-encoding plasmid lacking a Ter site, (b) a GFP-encoding plasmid lacking a Ter site, and (c) a plasmid lacking any expression cassette. The expression plasmids in the array were incubated in a cell-free rabbit reticulocyte transcription/translation extract as described herein. Duplicate microarrays were then hybridized with cyanine-labeled monoclonal antibodies specific for His, GFP, and human β-globin.",
                                "Expression from, and immobilization of, each of the plasmids was confirmed by probing with the cyanine labeled antibody directed against the His-tag engineered into each construct (FIG. 7A). No signals were detected in the negative control positions. Although an equal amount of plasmid DNA was immobilized on the substrate, the relative amount of protein produced and retained by each construct varied modestly, presumably due to characteristic differential transcription/translation efficiencies (FIG. 7A) of individual genes. To validate that the individual targeted proteins were expressed and captured at their designated location on the microarray, replicate arrays were probed with antibodies directed against the unique fusion protein partners specific for each plasmid (FIGS. 7B and 7C). Each of the target proteins was expressed and captured at a specific and designated location that was pre-determined by the insert encoded in the immobilized expression plasmid.",
                                "These data confirm that target proteins fused with the E. coli Tus protein can be synthesized and immobilized onto microarrays containing an E. coli Ter site.",
                                "All references, including publications, patent applications, and patents, cited herein are hereby incorporated by reference to the same extent as if each reference were individually and specifically indicated to be incorporated by reference and were set forth in its entirety herein.",
                                "The use of the terms “a” and “an” and “the” and similar referents in the context of describing the invention (especially in the context of the following claims) are to be construed to cover both the singular and the plural, unless otherwise indicated herein or clearly contradicted by context. The terms “comprising,” “having,” “including,” and “containing” are to be construed as open-ended terms (i.e., meaning “including, but not limited to,”) unless otherwise noted. Recitation of ranges of values herein are merely intended to serve as a shorthand method of referring individually to each separate value falling within the range, unless otherwise indicated herein, and each separate value is incorporated into the specification as if it were individually recited herein. All methods described herein can be performed in any suitable order unless otherwise indicated herein or otherwise clearly contradicted by context. The use of any and all examples, or exemplary language (e.g., “such as”) provided herein, is intended merely to better illuminate the invention and does not pose a limitation on the scope of the invention unless otherwise claimed. No language in the specification should be construed as indicating any non-claimed element as essential to the practice of the invention.",
                                "Preferred embodiments of this invention are described herein, including the best mode known to the inventors for carrying out the invention. Variations of those preferred embodiments may become apparent to those of ordinary skill in the art upon reading the foregoing description. The inventors expect skilled artisans to employ such variations as appropriate, and the inventors intend for the invention to be practiced otherwise than as specifically described herein. Accordingly, this invention includes all modifications and equivalents of the subject matter recited in the claims appended hereto as permitted by applicable law. Moreover, any combination of the above-described elements in all possible variations thereof is encompassed by the invention unless otherwise indicated herein or otherwise clearly contradicted by context."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "produce protein microarray",
                                "immobilize expression plasmids onto microarray surface",
                                "incubate microarray in cell-free transcription/translation extract",
                                "hybridize microarray with cyanine-labeled antibodies",
                                "confirm expression and immobilization of proteins",
                                "validate target protein expression and capture",
                                "illustrate protein microarray production",
                                "conclude target protein synthesis and immobilization",
                                "summarize protein microarray production"
                            ],
                            "num_characters": 4671,
                            "outline_medium": [
                                "produce protein microarray",
                                "confirm expression and immobilization of proteins",
                                "validate protein capture at designated locations",
                                "analyze microarray results"
                            ],
                            "outline_short": [
                                "produce protein microarray",
                                "validate protein expression and immobilization"
                            ]
                        }
                    ],
                    "outline_long": [
                        "describe microarray composition",
                        "define protein-binding domain",
                        "describe nucleic acid molecules",
                        "detail fusion protein composition",
                        "describe DNA-binding protein",
                        "define Ter nucleic acid sequence",
                        "describe Ter-binding protein",
                        "detail Tus protein",
                        "describe modified Ter-binding protein",
                        "describe promoter",
                        "define operable linkage",
                        "describe enhancers and silencers",
                        "detail viral promoters",
                        "describe cellular promoters",
                        "describe YY1 promoter",
                        "describe JEM-1 promoter",
                        "describe UbC promoter",
                        "describe method for producing protein microarrays",
                        "prepare multiple nucleic acid molecules",
                        "contact substrate with nucleic acid molecules",
                        "immobilize nucleic acid molecules",
                        "contact immobilized nucleic acid molecules with expression composition",
                        "express and produce fusion protein",
                        "immobilize fusion protein",
                        "describe alternative method for producing protein microarrays",
                        "prepare multiple nucleic acid molecules",
                        "contact substrate with nucleic acid molecules",
                        "immobilize nucleic acid molecules via DNA-binding protein",
                        "contact immobilized nucleic acid molecules with expression composition",
                        "express and produce fusion protein",
                        "immobilize fusion protein",
                        "describe advantages of inventive microarray",
                        "describe high-throughput analysis of proteins",
                        "describe preparation of multiple nucleic acid molecules",
                        "describe selection of protein-binding domain",
                        "describe selection of DNA-binding protein",
                        "describe constitutive promoters",
                        "describe inducible promoters",
                        "describe bacteriophage promoters",
                        "describe construction of fusion proteins",
                        "describe substrates for nucleic acid molecules",
                        "describe immobilization of nucleic acid molecules",
                        "describe covalent interactions for immobilization",
                        "describe noncovalent interactions for immobilization",
                        "describe protein microarray fabrication",
                        "describe protein microarray immobilization",
                        "describe protein microarray analysis",
                        "describe triple helix technology",
                        "describe expression composition",
                        "describe cell-free transcription and translation",
                        "describe fusion protein production",
                        "describe fusion protein immobilization",
                        "describe protein-binding domain interaction",
                        "describe DNA-binding protein interaction",
                        "describe protein microarray analysis",
                        "describe method for analyzing interactions",
                        "describe sample preparation",
                        "describe detectable labels",
                        "describe incubation conditions",
                        "describe detection schemes",
                        "describe fluorescence detection",
                        "describe internal standard",
                        "describe comparative fluorescence measurements",
                        "describe method for analyzing protein-protein interactions",
                        "describe preparing nucleic acid molecules",
                        "describe contacting substrate with nucleic acid molecules",
                        "describe immobilizing nucleic acid molecules",
                        "describe expressing fusion proteins",
                        "describe detecting immobilization of epitope",
                        "describe detecting protein-protein interactions",
                        "describe applying nucleic acid molecules to substrate",
                        "describe first and second fusion proteins",
                        "describe epitope binding antibody",
                        "describe detecting epitope immobilization",
                        "describe illustrating protein-protein interactions",
                        "describe examples of the invention"
                    ],
                    "num_characters": 38479,
                    "outline_medium": [
                        "describe microarray composition",
                        "describe method for producing protein microarrays",
                        "describe multiple nucleic acid molecules preparation",
                        "describe protein-binding domain composition",
                        "define protein-binding domain",
                        "describe preferred protein-binding domain selection",
                        "describe Ter nucleic acid sequence composition",
                        "define Ter nucleic acid sequence",
                        "describe preferred Ter nucleic acid sequence selection",
                        "describe fusion protein composition",
                        "define fusion protein",
                        "describe DNA-binding protein composition",
                        "define DNA-binding protein",
                        "describe preferred DNA-binding protein selection",
                        "describe modified Ter-binding protein composition",
                        "describe promoter composition",
                        "define promoter",
                        "describe preferred promoter selection",
                        "describe constitutive promoters",
                        "describe inducible promoters",
                        "describe bacteriophage promoters",
                        "describe fusion protein construction",
                        "describe substrate options",
                        "describe immobilization methods",
                        "describe covalent immobilization",
                        "describe protein microarray fabrication",
                        "describe protein microarray immobilization",
                        "describe expression composition",
                        "describe cell-free transcription and translation",
                        "describe fusion protein immobilization",
                        "describe protein-binding domain interaction",
                        "describe method for analyzing interactions",
                        "describe sample preparation",
                        "describe detectable labels",
                        "describe incubation and detection",
                        "describe protein-protein interaction analysis",
                        "describe epitope detection",
                        "describe examples of the invention"
                    ],
                    "outline_short": [
                        "describe microarray composition",
                        "describe method for producing protein microarrays",
                        "describe nucleic acid molecules used in microarray",
                        "define protein-binding domain",
                        "describe fusion protein composition",
                        "describe DNA-binding protein used in fusion protein",
                        "describe Ter-binding protein used in fusion protein",
                        "describe operable linkage of promoter to nucleic acid sequence",
                        "describe types of promoters used in invention",
                        "describe inducible promoters",
                        "specify bacteriophage promoters",
                        "outline construction of fusion proteins",
                        "describe substrates for nucleic acid molecules",
                        "explain immobilization of nucleic acid molecules",
                        "detail expression composition and fusion protein production",
                        "describe method of analyzing interactions between protein and compound",
                        "specify sample preparation and detection methods",
                        "outline method of analyzing interactions between two proteins",
                        "provide examples of the invention"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A microarray comprising\n(a) a substrate,\n(b) multiple nucleic acid molecules immobilized on the substrate, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein, and\n(c) one or more fusion proteins produced from the multiple nucleic acid molecules, wherein each fusion protein is immobilized on the substrate via binding to the protein-binding domain on the nucleic acid molecule.",
        "2. The microarray of claim 1, wherein the protein-binding domain is selected from the group consisting of an E. coli Ter sequence, a lactose operon operator sequence, and a galactose operon operator sequence.",
        "3. The microarray of claim 1, wherein the DNA-binding protein is selected from an E. coli Tus protein, a lac I protein, and a Gal repressor protein.",
        "4. The microarray of claim 1, wherein the substrate is selected from the group consisting of silicon, nitrocellulose, diazocellulose, glass, polystyrene, polyvinylchloride, polypropylene, polyethylene, polyvinylidenedifluoride, dextran, sepharose, agar, starch, nylon, and metal.",
        "5. The microarray of claim 1, wherein each of the multiple nucleic acid molecules is a plasmid.",
        "6. The microarray of claim 1, wherein each of the multiple nucleic acid molecules is supercoiled.",
        "7. The microarray of claim 1, wherein the nucleic acid sequence encoding the fusion protein is operably linked to a phage T7 promoter.",
        "8. A method for producing a protein microarray, which method comprises:\n(a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein,\n(b) contacting a substrate with the multiple nucleic acid molecules,\n(c) immobilizing the multiple nucleic acid molecules on the substrate,\n(d) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to the protein-binding domain on the nucleic acid molecule.",
        "9. The method of claim 8, wherein the protein-binding domain is selected from the group consisting of an E. coli Ter sequence, a lactose operon operator sequence, and a galactose operon operator sequence.",
        "10. The method of claim 8, wherein the DNA-binding protein is selected from an E. coli Tus protein, a lac I protein, and a Gal repressor protein.",
        "11. The method of claim 8, wherein the substrate is selected from the group consisting of silicon, nitrocellulose, diazocellulose, glass, polystyrene, polyvinylchloride, polypropylene, polyethylene, polyvinylidenedifluoride, dextran, sepharose, agar, starch, nylon, and metal.",
        "12. The method of claim 8, wherein each of the multiple nucleic acid molecules is a plasmid.",
        "13. The method of claim 8, wherein each of the multiple nucleic acid molecules is supercoiled.",
        "14. The method of claim 8, wherein the nucleic acid sequence encoding the fusion protein is operably linked to a phage T7 promoter.",
        "15. A method of analyzing interactions between a protein and compound of interest, which method comprises\n(a) producing a protein microarray according to the method of claim 8,\n(b) contacting the protein microarray with a sample comprising one or more compounds of interest, and\n(c) detecting binding of the one or more compounds of interest with one or more of the fusion proteins immobilized on the protein microarray.",
        "16. The method of claim 15, wherein the compound of interest is selected from the group consisting of a protein, a nucleic acid molecule, a lipid, and a drug.",
        "17. A method for producing a protein microarray, which method comprises:\n(a) preparing multiple nucleic acid molecules, wherein each nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a fusion protein comprising a polypeptide of interest and a DNA-binding protein,\n(b) contacting a substrate with the multiple nucleic acid molecules, wherein the substrate comprises multiple DNA-binding proteins and multiple nucleic sequences comprising the protein-binding domain, whereupon each of the multiple nucleic acid molecules is immobilized on the substrate via binding to a DNA-binding protein on the substrate,\n(c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequence encoding the fusion protein is expressed and the fusion protein is produced, whereupon each fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain on the substrate.",
        "18. The method of claim 17, wherein the nucleic acid sequence comprising a protein-binding domain is selected from the group consisting of an E. coli Ter sequence, a lactose operon operator sequence, and a galactose operon operator sequence.",
        "19. The method of claim 17, wherein the DNA-binding protein is selected from an E. coli Tus protein, a lac I protein, and a Gal repressor protein.",
        "20. The method of claim 17, wherein the substrate is selected from the group consisting of silicon, nitrocellulose, diazocellulose, glass, polystyrene, polyvinylchloride, polypropylene, polyethylene, polyvinylidenedifluoride, dextran, sepharose, agar, starch, nylon, and metal.",
        "21. The method of claim 17, wherein each of the multiple nucleic acid molecules is a plasmid.",
        "22. The method of claim 17, wherein each of the multiple nucleic acid molecules is supercoiled.",
        "23. The method of claim 17, wherein the nucleic acid sequence encoding the fusion protein is operably linked to a phage T7 promoter.",
        "24. A protein microarray produced by the method of claim 17.",
        "25. A method of analyzing interactions between two proteins, which method comprises:\n(a) preparing at least a first nucleic acid molecule and a second nucleic acid molecule, wherein the first nucleic acid molecule comprises (i) a protein-binding domain and (ii) a nucleic acid sequence encoding a first fusion protein comprising a first polypeptide of interest and a DNA-binding protein, and the second nucleic acid molecule comprises (i) a protein binding domain and (ii) a nucleic acid sequence encoding a second fusion protein comprising a second polypeptide of interest and an epitope that binds an antibody,\n(b) contacting a substrate with the first and second nucleic acid molecules, wherein the substrate comprises multiple DNA-binding proteins and multiple nucleic sequences comprising the protein-binding domain, whereupon the first and second nucleic acid molecules are immobilized at the same location on the substrate via binding to a DNA-binding protein on the substrate,\n(c) contacting the immobilized nucleic acid molecules with an expression composition, wherein the nucleic acid sequences encoding the first and second fusion proteins are expressed and the first and second fusion proteins are produced, whereupon the first fusion protein is immobilized on the substrate via binding to a nucleic acid sequence comprising the protein-binding domain on the substrate, and\n(d) detecting immobilization of the epitope of the second fusion protein on the substrate, wherein immobilization of the epitope of the second fusion protein on the substrate indicates binding of the second polypeptide of interest to the first polypeptide of interest.",
        "26. The method of claim 25, wherein immobilization of the epitope of the second fusion protein on the substrate is detected via binding of an antibody to the epitope.",
        "27. The method of claim 8, wherein each of the multiple nucleic acid molecules comprises a triple helix structure."
    ]
}