{
    "id": "US20210387144",
    "authors": [
        "Maohong Fan",
        "Xiaowen Zhang",
        "Yangyan Gao",
        "Armistead G. Russell",
        "Xin He"
    ],
    "title": "ULTRAFAST CATALYTIC CO2 CAPTURE CATALYZED BY A NOVEL ULTRASOUND-TREATED IONIC LIQUID",
    "date": "2021-02-17 00:00:00",
    "abstract": "A transformational energy efficient technology using ionic liquid (IL) to couple with monoethanolamine (MEA) for catalytic CO2 capture is disclosed. [EMmim+][NTF2−] based catalysts are rationally synthesized and used for CO2 capture with MEA. A catalytic CO2 capture mechanism is disclosed according to experimental and computational studies on the [EMmim+][NTF2−] for the reversible CO2 sorption and desorption.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "I. Field of the Disclosure",
                            "paragraphs": [
                                "The present disclosure relates to a fast and stable approach for catalytic CO2 capture from both gas streams (e.g., flue gas) and atmosphere. Particularly, but not exclusively, the present disclosure relates to the development of homogeneous catalyst a new bifunctional ionic liquid (IL), [CH2COOCH3mim+][NTF2−] denoted as [EMmim+][NTF2−] (see SI) in a CO2 capture process and used as catalysts for CO2 desporbtion and sorption instead of a sorbet. This present disclosure also relates to the integration of ultrasonic treatment into the catalysis performance improvement of [EMmim+][NTF2−] for development of a new generation of CO2 capture catalysts. The ionic liquid [EMmim][NTf2] providing a stable transformative catalyst instead of a sorbent for CO2 capture."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce CO2 capture"
                            ],
                            "num_characters": 764,
                            "outline_medium": [
                                "introduce CO2 capture"
                            ],
                            "outline_short": [
                                "introduce CO2 capture"
                            ]
                        },
                        {
                            "title": "II. Description of the Prior Art",
                            "paragraphs": [
                                "Carbon dioxide (CO2) is a primary greenhouse gas that makes a great contribution to global warming, owing to the excessive emissions from the combustion of fossil fuels. Carbon capture, utilization, and storage (CCUS) is the mature technology that can be carried out to alleviate the CO2 discharge, which is urgently needed for achieving the goals set in the Paris Climate Accord. Amine-based CO2 absorption is one of the potentially cost-effective options for capturing CO2 from both gas streams (e.g., flue gas) and atmosphere. CO2 capture is critical because of its increasing importance as a resource for material and fuel synthesis.",
                                "The fundamental challenge of chemisorption-based technologies can be the slow absorption and desorption reaction kinetics when CO2 desorption at >100° C., which excessive energies may be needed to vaporize a large amount of liquid water during CO2 desorption operation and condense the same amount of water vapor prior to CO2 desorption during cyclic CO2 sorption and desorption. Monoethanolamine (MEA) solution has low price and high reactivity with CO2, which apply to the benchmark solvent for evaluating amine-based CO2 capture processes at small scale. However, this technology is still not acceptable for versatile and large-scale uses mainly, attributed to (1) the critical limitations for >100° C. CO2 desorption or very energy intensive MEA regeneration process, and (2) the resultant aggregated MEA degradation, as well as (3) severe corrosion at such high temperatures. In other words, to render fast CO2 desorption from aqueous solvent, high temperature (120-140° C.) must be required for the current state-of-the-art, resulting in excessive energy demands for the water vaporization. Therefore, there is a need for [EMmim+][NTF2−] as the new bifunctional IL catalysts in CO2 capture process instead of a sorbent, which is not only very effective for catalyzing CO2 desorption but also CO2 sorption. Thus, in accordance with one or more aspects of the present disclosure, [EMmim][NTf2] is used as a transformative catalyst instead of a sorbent for CO2 capture."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "motivate CO2 capture",
                                "describe limitations of amine-based CO2 absorption",
                                "summarize MEA solution",
                                "highlight need for new catalysts"
                            ],
                            "num_characters": 2111,
                            "outline_medium": [
                                "describe CO2 capture challenges",
                                "motivate new catalyst development"
                            ],
                            "outline_short": [
                                "limitations of amine-based CO2 absorption"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "SUMMARY",
                    "paragraphs": [
                        "Therefore, it is a primary object, feature, or advantage of the present disclosure to improve over the state of the art.",
                        "According to at least one exemplary aspect, it is an object of the present disclosure to provide for a new use of monoethanolamine (MEA) solution",
                        "According to at least one other exemplary aspect, it is an object of the present disclosure to provide for controlled ultrasonic hydrolysis to enhance the catalytic ability of [EMmim+][NTF2−] (IL).",
                        "According to at least another exemplary aspect, it is an object of the present disclosure to provide for [EMmim+][NTF2−] based catalysts that can be synthesized and used for CO2 capture with MEA.",
                        "According to at least another exemplary aspect, it is an object of the present disclosure to provide for [EMmim+][NTF2−] based catalysts that can be used for CO2 capture with MEA without the presence of H2O.",
                        "According to at least another exemplary aspect, it is an object of the present disclosure to provide for [EMmim+][NTF2−] based catalysts that can be used for solid based CO2 capture.",
                        "According to at least another exemplary aspect, it is an object of the present disclosure to provide for [EMmim+][NTF2−] based catalysts that can be used for liquid based CO2 capture.",
                        "According to at least one other exemplary aspect, it is an object of the present disclosure to provide a solution where [EMmim+][NTF2−] can not only significantly move the initial CO2 desorption point to earlier times, but can also increase the rates of CO2 desorption (rd, CO) from the spent MEA solutions containing the same amounts CO2.",
                        "According to at least one exemplary aspect, it is an object of the present disclosure to provide a solution for low energy efficient technologies that demonstrates much quicker CO2 desorption kinetics at low temperature enabled with the use of the catalyst, which significantly advances the development of a new generation of CO2 capture technologies, from at least the perspectives of decreasing the parasitic penalty of these systems, capital investment, and environmental protection.",
                        "According to at least one other exemplary aspect of the present disclosure, ionic liquid [EMmin][NTf2] promotes both CO2 absorption and desorption.",
                        "According to at least another exemplary aspect, the time needed for reaching the maximum desorption rate with the use of [EMmim][NTf2] is shortened by 150 seconds in comparison to the time required for CO2 desorption without the use of the IL catalyst.",
                        "According to at least one other exemplary aspect, the ionic liquid (ILS) [EMmim][NTf2] catalyst can make CO2 capture much less demanding for high quality energy.",
                        "According to still another exemplary aspect of the present disclosure, the increases in desorption rate and the desorbed CO2 amount that can be obtained with [EMmim][NTf2] can reach as high as 791% at 507 seconds and 534% at 551 seconds.",
                        "According to yet another exemplary aspect, the ionic liquid [EMmim][NTf2] is beneficial to the elimination of the secondary environmental pollutants resulting from MEA degradation during high-temperature CO2 desorption of conventional CO2 capture technologies.",
                        "According to another exemplary aspect, MEA and the [EMmim][NTf2] are optimally configured to be stable with 50 cyclic tests in view of the FT-IR spectra of the regenerated MEA solution confirming no change in both quantities of absorbed and desorbed CO2",
                        "According to still another exemplary aspect of the present disclosure, ionic liquid [EMmim][NTf2] can be thermally stable at temperatures as high as 300° C.",
                        "According to yet another exemplary aspect of the present disclosure, direct evidence is shown of hydrolysis of —COOCH3 in the IL into COOH, a key function group in catalyzing the subsequent CO2 desorption.",
                        "According to at least one other exemplary aspect, observations of the changes in concentrations of intermediates with FT-IR spectra may cause significant catalytic effect of the ionic liquid [EMmim][NTf2].",
                        "According to still one other exemplary aspect of the present disclosure, [mimCH2COOH]+, P1-WHcat-MEA-CO2 decreases the overall CO2 capture energy consumption.",
                        "According to at least one other exemplary aspect, a method for catalytic CO2 capture is disclosed. The method includes, for example, steps such as providing a catalyst and a monoethanolamine (MEA), coupling ultrasonically treated ionic liquid with the MEA, and capturing CO2 from the catalyst with the MEA.",
                        "According to at least one other exemplary aspect, a method for catalytic CO2 capture is disclosed. The method includes, for example, steps such as providing a catalyst selected from the group of [EMmim+][NTF2−] based catalysts and a CO2 loaded monoethanolamine (MEA) solution, treating the catalyst with an ionic liquid, and capturing CO2 from the catalyst with the MEA.",
                        "In accordance with at least one exemplary aspect of the present disclosure, a method for catalyzing both CO2 sorption and desorption is disclosed. The method includes, in at least one aspect, the exemplary steps of providing a catalyst selected from the group of [EMmim+][NTF2−] based catalysts and a CO2 loaded monoethanolamine (MEA) solution, treating the MEA with an ionic liquid (IL) for providing a IL [EMmim+][NTF2−] based catalyst, and absorbing and desorbing CO2 with IL catalyst.",
                        "One or more of these and/or other objects, features, or advantages of the present invention will become apparent from the specification and claims that follow. No single embodiment need provide every object, feature, or advantage. Different embodiments may have different objects, features, or advantages. Therefore, the present invention is not to be limited to or by any objects, features, or advantages stated herein."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "improve over state of the art",
                        "provide new use of MEA solution",
                        "enhance catalytic ability of [EMmim+][NTF2−]",
                        "provide [EMmim+][NTF2−] based catalysts",
                        "provide for CO2 capture with MEA without H2O",
                        "provide for solid based CO2 capture",
                        "provide for liquid based CO2 capture",
                        "increase CO2 desorption rates",
                        "promote CO2 absorption and desorption",
                        "shorten time for maximum desorption rate",
                        "make CO2 capture less energy demanding"
                    ],
                    "num_characters": 5716,
                    "outline_medium": [
                        "summarize primary object",
                        "summarize new use of MEA solution",
                        "summarize controlled ultrasonic hydrolysis",
                        "summarize [EMmim+][NTF2−] based catalysts",
                        "summarize low energy efficient technologies"
                    ],
                    "outline_short": [
                        "motivate new CO2 capture approach",
                        "summarize objects of the disclosure"
                    ]
                },
                {
                    "title": "BRIEF DESCRIPTION OF THE TABLES",
                    "paragraphs": [
                        "Illustrated embodiments of the disclosure are described in detail below with reference to the attached Tables, which are incorporated by reference herein, and where:",
                        "Table 1 provides tabulated pH values of aqueous IL solution and MEA solution;",
                        "Table 2 provides Hammett functions of [EMmim+][NTF2−] IL in water with different concentrations and pretreated conditions; and",
                        "Table 3 provides pH values of Aqueous IL Solution and MEA Solution."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe tables"
                    ],
                    "num_characters": 441,
                    "outline_medium": [
                        "describe tables"
                    ],
                    "outline_short": [
                        "describe tables"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "1. Introduction",
                            "paragraphs": [
                                "Carbon dioxide (CO2) has been determined as a primary greenhouse gas that makes a great contribution to global warming, owing to the excessive emissions from the combustion of fossil fuels. Carbon capture, utilization, and storage (CCUS) is the mature technology that can be carried out to alleviate the CO2 discharge, which has been urgently needed for achieving the goals set in the Paris Climate Accord. CO2 capture is critical not only because of its close connection with climate change according to Paris Climate Accord but also because of its increasing importance as a resource for material and fuel synthesis. Thus, CO2 capture is very important. Chemisorption is one of the most important methods for CO2 capture. The fundamental challenge of chemisorption-based technologies is the slow absorption and desorption reaction kinetics, especially the latter one, which leads to the need for CO2 desorption at >100° C. Consequently, excessive energies are needed to vaporize a large amount of liquid water during CO2 desorption operation and condense the same amount of water vapor prior to CO2 desorption during cyclic CO2 sorption and desorption. Also, severe corrosion and sorbent degradations that could result in secondary environmental and health issues, especially when organic amines are used as sorbents.",
                                "Amine-based CO2 absorption can be one of the potentially cost-effective options for capturing CO2 from both gas streams (e.g., flue gas) and atmosphere. It has relatively low price and high reactivity with CO2, monoethanolamine (MEA) solution can be considered the benchmark solvent for evaluating amine-based CO2 capture processes at small scale. However, this technology can still not be acceptable for versatile and large-scale uses mainly, attributed to (1) the critical limitations for >100° C. CO2 desorption or very energy intensive MEA regeneration process, and (2) the resultant aggregated MEA degradation, as well as (3) severe corrosion at such high temperatures. For rendering fast CO2 desorption from aqueous solvent, high temperature (120-140° C.) must be required for the current state-of-the-art, resulting in excessive energy demands for the water vaporization.",
                                "A key question is whether it can be possible to overcome the three challenges by desorbing CO2 or regenerating spent MEA at temperatures less than 100° C., which can be the pivotal to reduce the heat duty while still achieving a desired CO2 desorption rate. Heterogeneous catalysis has been considered to be a promising solution because it can not only simultaneously overcome the above-mentioned challenges, due to its function in accelerating energy-intensive CO2 desorption at low temperatures, but it can also significantly lower the energy quantity and quality required for CO2 capture. Fan et al. reported that the use of nanostructured TiO(OH)2 to catalyze MEA-based CO2 capture could drastically increase the rate of CO2 desorption from spent MEA solution by over 4,000% at 88° C. with 2% or 20,000 ppm TiO(OH)2. Furthermore, the TiO(OH)2 catalyzed-MEA CO2 capture system showed excellent stability, even with 50 cyclic CO2 absorption-desorption tests. However, to date, homogeneous catalysis with no potential diffusional limitations has not been utilized for the CO2 capture technologies.",
                                "Ionic liquids (ILs), consisting of organic cations and organic or inorganic anions, are environmentally friendly due to their various desired characteristics, including high chemical/thermal stability, tunable physicochemical characters (acid/base sites), low corrosiveness and low heat capacity, which can be highly desirable for CO2 capture systems. To date, there can be no study reported in the disclosure on the use of ILs as the catalyst for the CO2 capture process despite the fact that high solubility of CO2 can be reported in some IL. After a long time of study, a homogeneous CO2 capture catalyst a new ionic liquid (IL), [CH3COOCH2mim][NTf2] denoted as [EMmim][NTf2] was discovered. The IL, used as a CO2 capture catalyst instead of a sorbent, is not only very effective for catalyzing CO2 desorption but also CO2 sorption. It should be emphasized that [EMmim][NTf2] is used as a transformative catalyst instead of a sorbent for CO2 capture in this work. In addition, ultrasonic chemistry can be an important modern method for modifying materials. The transitory collapse of cavitation microbubbles formed during the ultrasound wave traveling process can result in high temperature, high pressure, enhanced mass transfer and shear forces in the microenvironment. It has been used for significant acceleration of chemical changes. Also, it can be utilized in modifying catalysts for improving their catalytic performance. Thus, the research can be designed to integrate ultrasonic treatment into the catalysis performance improvement of [EMmim+][NTF2−] for development of a new generation of CO2 capture catalysts.",
                                "A method is disclosed for chemisorption based capture CO2 technologies. The method comprises providing a catalyst and a monoethanolamine (MEA); treating the catalyst with ultrasonically treated ionic liquid (IL); and capturing CO2 from the catalyst with the MEA.",
                                "In another exemplary aspect of the present disclosure, a method is disclosed for chemisorption based capture CO2 technologies. The method comprises providing a catalyst selected from the group of [EMmim+][NTF2−] based catalysts and a CO2 loaded monoethanolamine (MEA) solution; treating the MEA with an ionic liquid (IL) for providing a IL [EMmim+][NTF2−] based catalyst; and absorbing and desorbing CO2 with IL catalyst.",
                                "In yet another aspect of the present disclosure, another method for both CO2 sorption and desorption of chemisorption-based technologies is disclosed. The method comprises providing an aqueous solution of monoethanolamine (MEA); providing CO2 through a gas inlet; and absorbing and desorbing CO2 without the presence of water."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce CO2 capture technology",
                                "motivate CCUS technology",
                                "describe chemisorption method",
                                "highlight limitations of chemisorption",
                                "introduce amine-based CO2 absorption",
                                "describe limitations of amine-based absorption",
                                "introduce heterogeneous catalysis",
                                "introduce ionic liquids (ILs) as catalysts",
                                "describe benefits of ILs",
                                "introduce ultrasonic treatment",
                                "summarize research objective"
                            ],
                            "num_characters": 5941,
                            "outline_medium": [
                                "introduce CO2 capture technology",
                                "motivate chemisorption-based CO2 capture",
                                "describe limitations of amine-based CO2 absorption",
                                "introduce heterogeneous catalysis for CO2 capture",
                                "introduce ionic liquids as catalysts for CO2 capture"
                            ],
                            "outline_short": [
                                "motivate CO2 capture",
                                "introduce chemisorption-based CO2 capture technologies"
                            ]
                        },
                        {
                            "title": "2. Effect of Designed Homogeneous Il Catalyst",
                            "paragraphs": [
                                "FIGS. 1A and 1B display the CO2 desorption performances of 20 wt % MEA solution catalyzed by [CH2COOCH3mim+][NTF2−] or [EMmim+][NTF2−] with and without ultrasonic pre-treatment. For example, as shown in FIG. 1A, the effect of catalysts on the CO2 desorption rate (qd, CO) and as shown for example in FIG. 1B the effect of catalysts on the quantity of desorbed CO2 (rd, CO). Desorption conditions: 100 g of 20 wt % spent MEA solutions without and with catalysts contain the same amounts of CO2; catalyst concentrations: 2,000 ppm; flow rate of carrier gas N2: 500 mL/min; temperature: 30-85° C.; time: 1800 s. It should be noted that the methods for synthesizing [EMmim+][NTF2−] and the results of [EMmim+][NTF2−] characterization are provided in the FIGS. 6, and 8-11B. The catalytic CO2 capture setup can be shown in FIGS. 12A and 12B. Two commercial IL catalysts [Emim+][HSO4−] and [Bmim+][PF6−] (FIGS. 7A and 7B) were also obtained and compared for the CO2 desorption process. For example, as shown in FIG. 7A, [Emim+][HSO4−] and as shown in FIG. 7B, [Bmim+][PF6−]. [Emim+][HSO4−] (Purity>98.0%; CAS No.: 412009-61-1; MDL Number MFCD06798195) can be purchased from Tokyo Chemical Industry Co., Ltd. (TCI). [Bmim+][PF6−] (Purity>97.0% (HPLC); CAS No.: 174501-64-5; MDL number MFCD03093295) can be obtained from Sigma-Aldrich, Inc. According to FIG. 14D, [EMmim+][NTF2−] can not only significantly move the initial CO2 desorption point to earlier times, but can also increase the rates of CO2 desorption (rd, CO) from the spent MEA solutions. The FIGS. 14A-16C show the favorable catalytic effects of the [EMmim+][NTF2−] on the CO2 absorption process. Notice that the catalytic CO2 desorption performance of the EMmim+][NTF2−] gives much better performance than that without the ultrasonic pre-treatment and are significantly superior to the two commercial IL catalysts (as shown in FIGS. 13A and 13B), where, for example, the CO2 absorption curves of 20 wt % MEA solution are shown in FIG. 13B. The CO2 desorption rate of rich 20 wt % MEA solution, for example are shown in FIG. 13A. The catalyst dosage can be 3,000 ppm equivalently containing 10.1 ppm of —COOH. Note that the three ILs catalysts could enhance the CO2 desorption performance when compared to the blank run. While the catalytic CO2 desorption performance of the synthesized IL catalyst [EMmim+][NTF2−] can be better than that of the two commercial IL catalysts. Thus, the FIGS. 14A-16C clearly show that the ultrasonic pre-treatment can significantly promote the catalytic function of [EMmim+][NTF2−]. It has been found that the dosage of 3,000 ppm [EMmim+][NTF2−] can rapidly hydrolyse the IL to give equivalently 10.1 ppm of fully disassociated —COOH moiety within 20 min using an ultrasonic power of 9 w.",
                                "The maximum rate rd, COor rm, d, COachieved with and without using [EMmim+][NTF2−] and US-[EMmim+][NTF2−], as well as the corresponding desorption times, are shown in FIGS. 1A-1B. The relative rate rd, COimprovements obtained with [EMmim+][NTF2−] and US-[EMmim+][NTF2−] presented in FIG. 1B can reach as high as 1,140 and 6,000% respectively, while the corresponding absolute rate rd, COimprovements shown in FIG. 1B are 149% and 293%, respectively. Also, the times needed for reaching the rate maximum rm, d, COwith [EMmim+][NTF2−] and US-[EMmim+][NTF2−] are shortened by 116 and 222 s, respectively, as shown, in comparison to the time required for CO2 desorption without the use of the organocatalyst",
                                "As shown in FIG. 1A, there can be only 12.2 mmol quantity of desorption of CO2 a A d CO2 for the blank run, and the significant improvement of the qd, COcan be 95% (23.7 mmol) when US-[EMmim+][NTF2−] can be introduced. When the desorption time can be shortened to 1,200 s, the use of US[EMmim+][NTF2−] can increase the qd, COby about 120% (as shown FIGS. 16A-16C). It can be seen from FIG. 1A that the presence of [EMmim+][NTF2−] and US-[EMmim+][NTF2−] can increase qd, COas high as 766% higher at 554 s and 1,807% larger at 544 s, respectively. US-[EMmim+][NTF2−] not only has a much lower dosage (6.7 times lower) but also has a higher catalytic CO2 desorption rate (1.33 times higher) than that of the reported TiO(OH)2 catalyst1. Also, as a homogeneous catalyst, US-[EMmim+][NTF2−] can be used directly in existing CO2 capture plants without the need for modifying the existing CO2 desorption facility in an industrial application. Therefore, the experimental results demonstrate that [EMmim+][NTF2−] can be effective and US-[EMmim+][NTF2−] can be even much more effective, for catalyzing the CO2 desorption.",
                                "The optimal dosage of this catalyst for accelerating CO2 desorption, the key step for reducing overall CO2 capture energy consumption, is 2,000 ppm according to FIGS. 14C-14E, which illustrate the CO2 absorption profiles of 20 wt % MEA sorbent in FIG. 14C, the CO2 desorption rates of 20 wt % MEA sorbent in FIG. 14D, and the total CO2 desorption amounts in FIG. 14E.",
                                "FIGS. 15C-15F exhibit the CO2 absorption and desorption performances of 20 wt % MEA solution catalyzed by 2,000 ppm [EMmim][NTf2]. The IL [EMmin][NTf2] can promote both CO2 absorption and desorption. Capturing 90% CO2 is targeted by the U.S. Department of Energy, and thus the period with 90% CO2 capture efficiency is defined as effective absorption time. According to FIG. 15C, 20 wt % MEA sorbent without catalyst can absorb only 144.34 mmol CO2 within the shorter effective absorption time of 4,446 s, while the sorbent with 2,000 ppm IL catalyst can absorb 210.09 mmol CO2, and extend effective absorption time to 6,350 s, which are 45.55% and 42.83% absorption improvements, respectively, compared to the sorbent without catalyst.",
                                "Variations of desorption with time with and without uses of catalyst are illustrated in FIG. 15D. The time needed for reaching the maximum desorption rate with the use of [EMmim][NTf2] is shortened by 150 s in comparison to the time required for CO2 desorption without the use of the IL catalyst. Meanwhile, the peak desorption rate improvement is 175%. The increases in desorption rate and the desorbed CO2 amount obtained with [EMmim][NTf2] can reach as high as 791% at 507 s and 534% at 551 s (see FIG. 15D, FIG. 15E, and FIG. 15F), respectively. The quantities of CO2 desorbed from uncatalytic and catalytic solutions are 18.7 and 28.2 mmol, respectively. When the absorption time is 7,000 s or the outlet CO2 concentrations of both uncatalyzed and catalyzed CO2 absorption are 3.2 vol % (FIGS. 15G-151), use of [EMmim][NTf2] can increase the total desorbed CO2 amount by 88.90%. Where, specifically, in accordance with aspects of the present disclosure, FIG. 15G discloses the CO2 absorption profiles of 20 wt % MEA sorbent. Where, specifically, in accordance with aspects of the present disclosure, FIG. 15H shows, by example, the CO2 desorption rates of 20 wt % MEA sorbent. And, where, specifically, in accordance with aspects of the present disclosure FIG. 151 shows, for example, the total CO2 desorption amounts. It should be noted that dosage of [EMmim][NTf2] is only 2,000 ppm the lowest dosage for achieving such significant CO2 capture catalysis effect. To the best knowledge, such a low catalyst dosage has not been reported for achieving such a significant CO2 capture. Also, as a homogeneous catalyst, [EMmim][NTf2] is easy to use. Therefore, [EMmim][NTf2] is quite effective for catalyzing both the CO2 absorption and desorption processes."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe CO2 desorption performance",
                                "show effect of catalyst on CO2 desorption rate",
                                "show effect of catalyst on CO2 desorption quantity",
                                "describe experimental conditions",
                                "compare with commercial IL catalysts",
                                "show catalytic CO2 desorption performance",
                                "describe effect of ultrasonic pre-treatment",
                                "show CO2 absorption profiles",
                                "show CO2 desorption rates",
                                "show total CO2 desorption amounts",
                                "describe optimal dosage of catalyst",
                                "show CO2 absorption and desorption performances",
                                "describe effective absorption time",
                                "summarize catalytic CO2 capture performance"
                            ],
                            "num_characters": 7462,
                            "outline_medium": [
                                "describe CO2 desorption performance with [EMmim+][NTF2−] catalyst",
                                "compare CO2 desorption performance with commercial IL catalysts",
                                "show effect of ultrasonic pre-treatment on CO2 desorption",
                                "describe CO2 absorption performance with [EMmim+][NTF2−] catalyst",
                                "show optimal dosage of [EMmim+][NTF2−] catalyst",
                                "describe CO2 absorption and desorption performances with 2,000 ppm [EMmim][NTf2]",
                                "summarize catalytic CO2 capture performance of [EMmim+][NTF2−]"
                            ],
                            "outline_short": [
                                "describe CO2 desorption performances",
                                "compare catalytic CO2 desorption performances",
                                "discuss optimal dosage of catalyst"
                            ]
                        },
                        {
                            "title": "3.0 Stabilities of the Catalytic CO2 Capture System",
                            "paragraphs": [
                                "The long-term stabilities of US-[EMmim+][NTF2−] for CO2 absorption-desorption can be studied with 110 cyclic tests during more than 4 months, and the results are shown in FIGS. 2A and 2B where, for example, For Stage 1: CO2 absorption-desorption cyclic test for 1-100 cycles within 30 days. For Stage 2: tests were performed with the same solvent system used in stage 1 after the tests of stage 1 had been completed for 110 days (101-110 cyclic tests). Absorption conditions: 100 g 20 wt % MEA solution with 3,000 ppm catalyst; composition of inlet gas: 10 vol % CO2, 10 vol % O2, and 80 vol % N2; flow rate of inlet gas: 500 mL/min; temperature: 30° C.; time: 1,800 s. Desorption conditions: flow rate of carrier gas N2: 500 mL/min; temperature: 30-85° C.; time: 1,800 s, and FIG. 17A-17H, where, for example, FIGS. 17C and 17D are the amount of absorbed and desorbed CO2 for the 1-50 cycle tests. FIGS. 17E and 17F are the amount of absorbed and desorbed CO2 for the 51-100 cycle tests. FIGS. 17A and 17B are the amount of absorbed and desorbed CO2 for the 101-110 cycle tests. For the amount absorbed and desorbed, as shown in FIGS. 17A and 17B, after the 100 cycle tests were completed, and the catalytic CO2 capture system can be placed for 110 days, and then started for the 101-110 cycle tests. Absorption conditions: 100 g 20 wt % MEA solution with 3,000 ppm catalyst; composition of inlet gas: 10 vol % CO2, 10 vol % O2, and 80 vol % N2; flow rate of inlet gas: 500 mL/min; temperature: 30° C.; time: 1,800 s. Desorption conditions: flow rate of carrier gas N2: 500 mL/min; temperature: 85° C.; time: 1,800 s. It can be seen that the MEA/US-[EMmim+][NTF2−] solution or both MEA and US-[EMmim+][NTF2−] are stable within more than 4 months, which can be quite satisfactory from industrial application perspective. It can be seen that no apparent change in both quantities of absorbed and desorbed CO2 with the 100 cycles in Stage 1. The average working CO2 capture capacity within the 100 cyclic tests conducted within 30-day under the given conditions can be 23.2 mmol, which can be very close to the 24.3 mmol obtained in the first run. The slight decrease can be due to the accumulative MEA losses, resulting from the difficulty in condensing and recycling the regenerated MEA in each CO2 desorption step. In other words, a trace amount of the regenerated MEA can be taken away during each cyclic CO2 absorption desorption operation. As shown in FIGS. 18A-18C, FT-IR and Raman results of the regenerated MEA solution also confirm that no change in the structure of MEA molecules can be observed after 100 cycles of the tests. Thus, the chemical reversibility of both MEA and the organocatalyst can be easily realized for the tested CO2 absorption and desorption temperatures, 30° C. and 85° C., respectively. It should be noted that [EMmim+][NTF2−] can thermally be stable at as high as 300° C. as shown in FIG. 19, where, for example, Thermogravimetric analyses (TGA) curve of IL can be obtained using a TA Instruments SDT Q600 apparatus with a heating ramp of 10° C./min at the temperature of 20-550° C. It should be noted that [EMmim+][NTF2−] can thermally be stable at as high as 300° C.",
                                "To further confirm the outstanding stability of the coexisting MEA/US-[EMmim+][NTF2−] based CO2 capture solution, 10 more cyclic or Stage 2 tests were performed after 110 days of the completion of 100 cyclic or Stage 1 tests, by using the same used MEA/US-1EMmim+1[NTF2−] system. For Stage 2, each of the cyclic test results are shown in FIGS. 2A and 2B and FIGS. 17A and 17B, where it can be seen that the average working CO2 capture capacity can be 23.0 mmol, which represents only a 1.7% decrease compared to that obtained in Stage 1. Furthermore, the FT-IR results (FIG. 18C), of the MEA/US-[EMmim+][NTF2−] CO2 capture system indicate both MEA and US-[EMmim+][NTF2−] are stable for more than 4 months. For example, the Raman and FT-IR spectra of MEA solution with IL after 100 cycle tests are shown in FIGS. 18A and 18B. FIG. 18C shows the FT-IR spectra of MEA solution with IL after placing 110 days and 120 cycle tests. These Raman and FT-IR spectra further confirmed the outstanding stability of the coexisting MEA/US-[EMmim+][NTF2−] based CO2 capture solution Such a good cyclic performance has not yet been reported in the disclosure.",
                                "The great repeatability of the CO2 capture system lies in the good stability of the catalytic CO2 capture solution. According to Valeur et al. in FIG. 20, strict conditions, not only desired catalysts but also high operation temperatures (>200° C.) must be required to complete the energetic demands for reversible CO2 capture. For example, the reaction between the mim+COOH and amine cannot take place unless at the high temperature condition or the presence of coupling reagents. Also, due to the alkyl ester is an inert substrate, the reaction between the alkyl ester and amine requires rather harsh reaction conditions, such as high temperature, high pressure or the use of strongly basic reagent. The listed reaction cannot occur in the present work, due to the lower CO2 desorption temperature (no more than 85° C.) and the absence of the required catalyst for the reaction. However, much milder CO2 absorption and desorption temperatures were actually adopted in this case, and thus [EMmim+][NTF2−] should be stable which can be further confirmed by the FT-IR spectra of the mixture of US-[EMmim+][NTF2−] and MEA or catalytic CO2 capture system as shown in FIG. 10 and FIGS. 21A-21C, where, for example, the peaks of the COOH in US-[EMmim+][NTF2−] and the mixture of US-[EMmim+][NTF2−] and MEA are identical, a sign of no interaction between two function groups, —COOH and NH2, or no formation of stable CONH2. The observation indicates that the catalytic function of trace amount of US-[EMmim+][NTF2−] should not be affected by even large quantity of MEA via the formation of CONH2. The peaks of the COOH in US-[EMmim+][NTF2−] and the mixture of US-[EMmim+][NTF2−] and MEA are similar, a sign of no interaction between the two functional groups, —COOH and NH2, or no formation of CONH2 and thus the catalytic CO2 capture system can be stable.",
                                "In another exemplary aspect of the present invention, stability characteristic of [EMmim][NTf2] for CO2 capture was studied with 50 cyclic tests, and the results are shown in FIGS. 2B, 17G and 17H. Where, specifically, in accordance with aspects of the present disclosure, FIG. 2B discloses the quantities of absorbed and desorbed CO2 with the presence of [EMmim][NTf2] catalyst during 50 cyclic tests. Where, specifically, in accordance with aspects of the present disclosure FIG. 17G discloses the CO2 absorption profiles of 50 cyclic tests. And, where, specifically, in accordance with aspects of the present disclosure FIG. 17H discloses the CO2 desorption profiles of 50 cyclic tests. There is no apparent change in both quantities of absorbed and desorbed CO2. The average CO2 capture working capacities within the 50 cyclic tests are 31.94 and 32.77 mmol for absorption and desorption amounts, respectively, as shown in FIG. 31. HCO3−, CO32− and MEACOO− are generated during CO2 absorption process, which is the FT-IR spectra of the regenerated MEA solution confirming that no change in the structure of MEA molecules was observed after 50 cycles of the tests. Thus, both MEA and the [EMmim][NTf2] are stable. Moreover, [EMmim][NTf2] can thermally be stable at as high as 300° C. as shown in FIG. 19."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe long-term stability tests",
                                "show CO2 absorption-desorption cyclic tests",
                                "describe experimental conditions",
                                "show amount of absorbed and desorbed CO2",
                                "describe stability of MEA/US-[EMmim+][NTF2−] solution",
                                "show FT-IR and Raman results",
                                "describe thermal stability of [EMmim+][NTF2−]",
                                "describe Stage 2 tests",
                                "show average working CO2 capture capacity",
                                "describe FT-IR results",
                                "describe Raman and FT-IR spectra",
                                "compare with reported results",
                                "describe reaction conditions",
                                "describe stability of catalytic CO2 capture system",
                                "summarize stability characteristics"
                            ],
                            "num_characters": 7507,
                            "outline_medium": [
                                "describe long-term stability of US-[EMmim+][NTF2−] for CO2 absorption-desorption",
                                "show stability of MEA/US-[EMmim+][NTF2−] solution after 100 cycles",
                                "describe stability of MEA/US-[EMmim+][NTF2−] solution after 110 days",
                                "show FT-IR and Raman results of regenerated MEA solution",
                                "describe thermal stability of [EMmim+][NTF2−] up to 300° C.",
                                "describe stability of [EMmim][NTf2] for CO2 capture with 50 cyclic tests",
                                "summarize stability of catalytic CO2 capture system"
                            ],
                            "outline_short": [
                                "study long-term stabilities of US-[EMmim+][NTF2−]",
                                "confirm stability of MEA/US-[EMmim+][NTF2−] solution",
                                "discuss thermal stability of [EMmim+][NTF2−]"
                            ]
                        },
                        {
                            "title": "4. Exemplary Mechanism",
                            "paragraphs": [
                                "**4.1 Experimental**",
                                "**4.1.1 Activation of the IL Catalyst Via Ultrasound**",
                                "The proposed mechanism for activating-[EMmim+][NTF2−] with ultrasound to obtain the US-[EMmim+][NTF2−] has been shown in FIGS. 3A-3C, where, for example, as shown in FIG. 3A, the schematic representation of the [EMmim+][NTF2-] catalyst and the [EMmim+][NTF2-] catalyst ultrasound activation process. FIG. 3B shows the FT-IR spectra of [EMmim+][NTF2-] and US-[EMmim+][NTF2-]. The conditions of ultrasonic activation: time: 20 min; ultrasonic power: 9 W; temperature: 30° C.; ultrasonic system: 80 g H2O+0.3 g [EMmim+][NTF2-] are shown in FIG. 3C. FIG. 22, shows for example, having the following ultrasonic conditions: time: 20 min, temperature: 30° C., ultrasonic power: 9 W; ultrasonic system: 80 g water 0.3 g IL catalyst. Note that after the ultrasonic activation, the part of ester group in the [EMmim+][NTF2−] can be hydrolyzed into desired form of mim+COOH. The molecular structure of the IL, [EMmim+][NTF2−] has shown in FIG. 3A. [EMmim+][NTF2−] possesses a degree of acidity, which can be verified via the measurement of the pH, 5.73, of the solution resulting from the addition of 0.3 g [EMmim+][NTF2−] to 80 g H2O (Table 1).",
                                "Also, the acidity of the [EMmim+][NTF2−] can be observed with its FT-IR spectrum presented in FIG. 3C, which mainly attributes to the slight hydrolysis of the ester group (—COOR) in IL to form the terminal carboxylic acid groups (—COOH). The acidity of US-[EMmim+][NTF2−] can be considerably enhanced due to the generation of more —COOH moiety via ultrasound-activated hydrolysis of the —COOR in the [EMmim+][NTF2−], as given in FIGS. 3A-3C. The activation of [EMmim+][NTF2−] can be attributed to a controlled degree of hydrolysis from ester group (—COOR) to form corresponding carboxylic acid groups (—COOH), which can be based on the formation, growth, and implosive collapse of cavitation microbubbles occurring during the traveling of a high power ultrasound wave via aqueous [EMmim+][NTF2−].",
                                "The FT-IR spectra of [EMmim+][NTF2−] and US-[EMmim+][NTF2−] are shown in FIGS. 3B and 3C. The bands around 1056, 1144 and 1123 cm−1 are assigned to the signature of —COOR groups. Compared to the spectrum of [EMmim+][NTF2−], the spectrum of US-[EMmim+][NTF2−] presents several additional and intensive peaks at 1208, 1128, 1284 and 1415 cm−1, which are attributed to the stretching vibration of COOH. Also, the spectrum of US-[EMmim+][NTF2−] shows the enhanced peak intensities for stretching vibration of the hydroxyl group (—OH) at 1159, 1178, 1454 and 1470 cm−1. The pH of the US-[EMmim+][NTF2−] can be decreased to 3.55 (Table 1), equivalent to an increase in concentration of H+ by ˜151 times, a large jump via a green activation process as proven with the obvious enhancement in the peak intensity of COOH in FIG. 3C.",
                                "Also, as shown in FIG. 3C, the peak intensity of —COOR can be evidently decreased for the US-[EMmim+][NTF2−]. The Brønsted acid sites of IL catalysts were further confirmed with the characteristic parameter of the Hammett functions, H0, obtained by the UV-Vis spectroscopy. The H0 values of the 8.6 mM [EMmim+][NTF2−] and US-[EMmim+][NTF2−] solutions are 2.49 and 2.26, respectively (FIG. 23, where, for example, the H0 values of the 8.6 mM [EMmim+][NTF2−] and US-[EMmim+][NTF2−] solutions are 2.49 and 2.26, respectively, another indication of significant effect of ultrasound on the degree of the hydrolysis of ester group into desired mim+COOH, and Table 2), another indication of the significant effect of ultrasound on the degree of hydrolysis of the —COOR group into desired mim+COOH.",
                                "**4.1.2. Mechanistic Studies**",
                                "Although the catalytic effect of the 3,000 ppm US-[EMmim+][NTF2−] can be clearly observed with the significant enhancement of CO2 desorption rate at 85° C., the associated essential mechanism needs to be investigated for further development of next generation CO2 capture catalysts. As a result, Raman and FT-IR spectroscopies were utilized for analyzing the solutions collected during CO2 desorption with and without uses of US-[EMmim+][NTF2−] at different desorption times. FIGS. 4A and 4B show the Raman spectra, while FIGS. 4C and 4D exhibit the FT-IR results. In the Raman spectrum of spent MEA solution, the peaks at 1018 (C—OH stretching), 1068 (C—O stretching) and 1160 cm−1 (C—N stretching) are attributed to the bicarbonate (HCO3−), carbonate (CO32) and carbamate (MEACOO−) ions, respectively. With the use of the catalyst, the MEA-H2O—CO2 system contains higher amounts of HCO3− groups. The peak intensities of HCO3−, and CO32− in the spent MEA solution with the use of the US-[EMmim+][NTF2−], especially the HCO3− highlighted in FIGS. 4A and 4B, decrease more quickly than the catalyst-free spent MEA solution does. Also, similar observations on the catalytic effects were obtained with FT-IR spectra for the spent MEA solutions at different desorption times. In FIGS. 4C and 4D, the bands at 1323 (stretching of N—COO−), 1488 (symmetric stretching of COO−) and 1561 cm−1 (asymmetric stretching of COO−) are ascribed to the MEACOO−, while the peaks at 1384 and 1630 cm−1 are assigned to CO32− and HCO3−, respectively. The peak intensity of HCO3− in the spent MEA solution without use of US-[EMmim+][NTF2−] decreases slowly with the continuous CO2 desorption, and the intensities of CO32− and MEACOO− peaks and thus the concentrations of CO32− and MEACOO− barely change during the first 8 min, in spite of the subsequent slightly noticeable variations. However, the changes in the peak intensities of HCO3−, CO32−, and MEACOO−, especially HCO3− shown in FIG. 4D during the initial 8 min of the catalytic spent MEA solutions decrease considerably fast. Obviously, the observations of the changes of the concentrations of intermediates, with both Raman and FT-IR spectra confirm the significant catalytic effect of the US-[EMmim+][NTF2−], where, for example, as shown in FIGS. 4A and C, CO2 desorption without catalyst, for example as shown in FIGS. 4B and 4D, CO2 desorption with 3,000 ppm US-[EMmim+][NTF2−] equivalently containing 10.1 ppm of —COOH.",
                                "**4.1.3 Experimental Study of the Reaction Mechanisms**",
                                "The molecular structure of the IL, [EMmim][NTf2] is shown in FIG. 6. After CO2 absorption, the pH of the capture system decreased from 12.01 to 8.52, indicating the increase of H+ concentration and promotion of the hydrolysis of the —COOCH3 in [EMmim][NTf2] into COOH, which is need for catalyzing CO2 desorption. Thus, the activation of [EMmim][NTf2] is accompanied with the enhancement of the acidity of [EMmim][NTf2] after CO2 absorption, as illustrated in FIG. 32A, which provides a schematic representation of the [EMmim][NTf2] catalyst and the hydrolysis activation process. The FT-IR spectra of water, and the 2,000 ppm [EMmim][NTf2] aqueous solution with or without CO2 as shown in FIG. 32B(1)-(4) further confirms this mechanism. Anhydrous CH3OH and CH3COOCH3 as well as CH3COOH and 50% CH3COOH solutions were used to identify the functional groups in the catalytic solutions with or without additions of CO2. The bands around 1381-1339 cm−1 in the catalytic solutions [as shown in FIG. 32B(1)] are assigned to the —CH3 group in the IL catalyst (—COOCH3), observed in anhydrous CH3OH, CH3COOCH3 and CH3COOH and 50% CH3COOH solutions. With the increase in the introduced CO2 in the solution, hydrolysis of —COOCH3 is enhanced, leading to the increase the concentration of —CH3 or CH3OH in the catalytic solution as illustrated in FIG. 32A. Bands with wavenumbers between 1221-1190 cm−1 [as shown in FIG. 32B(2)], detected in anhydrous CH3OH as well, confirm the formation of CH3OH with an enhanced hydrolysis process with CO2. As concentration of —COOCH3 decreases, the —C—O—C peak [1160-1128 cm−1, shown in FIG. 32B(3)] in the catalytic solution with the addition of CO2 was weaker than that of the solution without addition of CO2 according to the reference peaks of anhydrous CH3COOCH3. Consequently, more —COO— or COOH formation or more —COOCH3 hydrolysis, was detected within 1079-1050 cm−1 [shown in FIG. 13B(4)], which are concluded from the observations of peaks of anhydrous CH3COOCH3 and CH3COOH, and 50% CH3COOH solution. Also, the acidity of the [EMmim][NTf2] was verified via the measurement of the pH (6.19) of the solution resulting from the addition of 0.2 g [EMmim][NTf2] to 80 g H2O (Table 3). The FT-IR spectra of fresh catalytic solution, catalytic solutions after the 1st absorption and the 1st cyclic absorption-desorption runs are displayed in FIGS. 21A-21C. According to FIG. 21C, peak at 1023-1017 cm−1 is assigned to —C—OH, belonging to MEA (—CH2—OH) and HCO3− (—COOH) after absorption. Peak at 1075-1066 cm−1 is assigned to —COO—/C—C, belonging to MEA (—CH2—CH2—), and HCO3−(—COO—) resulting from absorption. Peaks at 1171-1157 cm−1 and 1385 cm−1 are assigned to CO32− resulting from absorption. Peaks at 1240-1185 cm−1 and 1468-1406 cm−1 are assigned to —C—OH, belonging to HCO3− (—C—OH) resulting from absorption. Peaks at 1559, 1488, 1324 cm−1 are assigned to —COO— in MEACOO-resulting from absorption. Peak at 1635 cm−1 is assigned to HCO3− or —OH, which is also a signature peak of water. The differences in the changes of the quantities of CO2 absorbed and desorbed, and pH values of the uncatalytic and catalytic solutions with absorption and desorption times as shown in FIG. 33A-33B result from the use of the catalyst. For example, the pH value (8.65) of the catalytic solution at 120 min is lower than that (8.79) of the uncatalytic solution at 130 min, when both solutions absorb the same amount of CO2, another direct evidence of hydrolysis of —COOCH3 in the IL into COOH, a key function group in catalyzing the subsequent CO2 desorption.",
                                "The catalytic effect of [EMmim][NTf2] at different absorption and desorption times is observed through FT-IR spectra, as shown in FIGS. 4E-4H. The bands at 1324 cm−1 (stretching of N—COO−), 1488 cm−1 (symmetric stretching of COO−) and 1559 cm−1 (asymmetric stretching of COO−) are ascribed to the MEACOO−8, while peaks at 1385 cm−1 and 1635 cm−1 are assigned to CO32− and HCO3−, respectively. Intensities of peaks of HCO3− in the catalytic MEA solution during CO2 absorption (see FIG. 4F) increase faster than those of the uncatalytic ones, shown in FIG. 4E. Moreover, peak intensities of MEACOO− and CO32− for the catalytic MEA solutions at the end of CO2 absorption (7800 s or 130 min) are stronger than those of the uncatalytic one. Differences are more obvious for the desorption tests, as shown in FIG. 4G and FIG. 4H. Peak intensities of HCO3− in the uncatalytic MEA solutions decrease slowly with the continuous CO2 desorption, and the intensities of CO32− and MEACOO− peaks and thus the concentrations of CO32− and MEACOO− barely change, in spite of the subsequent slightly noticeable variations. However, peak intensities of HCO3−, CO32− and MEACOO− of the catalytic MEA solutions decrease considerably fast with time during CO2 desorption, especially in the initial 10 min. The experimental observations of the changes in concentrations of intermediates with FT-IR spectra confirm the significant catalytic effect of the [EMmim][NTf2].",
                                "**4.2. Unanalyzed and Catalyzed CO2 Sorption Pathways, Desorption Pathways, and Essential Differences**",
                                "The density functional theory (DFT) calculations in this research have been performed by means of the Dmol3 program in the Materials Studio package. In order to evaluate the accuracy of the methods set for computing the catalytic effect of [EMmim+][NTF2−], DFT based calculations for the reactions during CO2 capture without use of the catalyst were conducted and compared to those reported in the disclosure. The reaction processes with and without use of catalysts are shown vertically and horizontally in FIG. 5A, respectively, while the corresponding energy changes for each step are provided in FIG. 5B. Also, the calculation results can help to identify the high energy barrier step in CO2 desorption process, which give hints on the effectiveness of the [EMmim+][NTF2−] catalyst.",
                                "When catalyst [EMmim+][NTF2−] cannot be used, there are two possible CO2 capture pathways, P1-WOcat-MEA-CO2 (pathway without use of both the catalyst and or in the presence of H2O) and P2-WOcat-MEA-CO2—H2O (pathway without use of the catalyst but with the presence of H2O), based on the zwitterion (ZW) mechanism and bicarbonate (HCO3−) formation, respectively. The step reactions in P1-WOcat-MEA-CO2 (without the presence of water) which is the reactions of —NH2 function groups in any amines, such as MEA, including solid —NH2 containing sorbent with CO2 or liquid amine groups, include:",
                                "CO2+MEA↔MEA+COO−(ZW)  (P1-R1)",
                                "MEA+COO−+MEA↔MEACOO−+MEAH+  (P1-R2),",
                                "which are shown in FIG. 5A. If water is present, the reaction only forms MEAH+ along with HCO3− (Carbonic acid). The P1-WOcat-MEA-CO2 reaction mechanism allows solid based CO2 capture. MEA is a —NH2 based amine or one of the —NH2 carrying amine compounds or containing an amine compound. The ring configuration of MEA as shown in FIG. 24 can be the most stable structure, where, for example, the stability order of MEA can be: Ring configuration>Open-Ring configuration>Chain configuration. However, the activation energies for transformation between each other can be moderate, indicating they could exist at the same time. Ring configuration, the most stable structure can be chosen for our calculations. As shown in FIG. 5B, the absorption process in P1-WOcat-MEA-CO2, including P1-R1 and P1-R2 can be exothermic because it can release between 24.0 kJ/mol and 29.1 kJ/mol, which can be not only consistent with the experimental observation that the solvent temperature can be found increase slightly during the CO2 absorption process, but also agreed with the measured value. Furthermore, the calculated reaction energies (Er) and activation energies (Ea) in the forward (for CO2 absorption) and reverse (for CO2 desorption) of P1-WOcat-MEA-CO2, P1-R1 and P1-R2, as well as P1-R−1 and P1-R−2, respectively, are very close to those in the same literature, shown in FIGS. 25A and 25B. Thus, the computational methods are agreeable to these values. Special attention should be paid to P1-R−1 because it can be identified as the rate determining step of CO2 desorption for P1-WOcat-MEA-CO2 due to its high reaction energy (31.1 kJ/mol). Due to the lack of the presence of water, HCO3− is not formed in the first step of the reaction. P1-R1 and P1R2 are the reactions of —NH2 function groups in any amines including solid —NH2 contain sorbent with CO2.",
                                "For P2-WOcat-MEA-CO2—H2O where HCO3− can be involved due to the presence of water. The commonly bicarbonate generation reactions are:",
                                "CO2+MEA+H2O↔HCO3−+MEAH+  (P2-R1)",
                                "CO2+H2O↔HCO3−+H+  (P2-R2-1)",
                                "HCO3−+MEA↔MEACOO−+H2  (P2-R2-2)",
                                "MEACOO−+H3O+↔HCO3−+MEAH+  (P2-R2-3)",
                                "CO2+MEA↔MEA+COO−  (P2-R3-1)",
                                "MEA+COO−+H2O→HCO3−+MEAH+.  (P2-R3-2)",
                                "The reaction energy values of P2-R1 to P2-R3 were calculated and compared in FIG. 26. [mimCH2COOH]+ as a Brønsted acid is the core of the catalytic CO2 capture technology, thus, [mimCH2COOH]+ instead of [EMmim][NTf2] is used for modeling the catalyst, For example, the highest step reaction energy changes during catalytic CO2 desorption, P2-R1-WOcat-MEA-CO2-H2O is the most sensitive step. In addition, CO2 absorption in P2-R1-WOcat-MEA-CO2-H2O has the lowest maximum reaction energy, indicating that CO2 absorption with P2-R1-WOcat-MEA-CO2-H2O is the easiest one among the three pathways. Thus, can be P2-WOcat-MEA-CO2-H2O (P2-R1) can be the preferred pathway because of its lowest energy barrier among all the steps of P2-R1 to P2-R3. That energy barrier can be 66.7 kJ/mol, which can be close to the value (74.4 kJ/mol) obtained by others. Also, P2-WOcat-MEA-CO2-H2O can be a very possible reaction pathway in the presence of water according to the data in FIGS. 4A-4H. Thus, FIGS. 5A and 5B only show P2-WOcat-MEA-CO2-H2O and its step reactions as well as the associated energy data. The ionic catalyst can accelerate CO2 capture with and without the presence of water or the liquid and solid —NH2 containing sorbents.",
                                "Then, the assured computational methods were applied to explain how the catalyst −[EMmim+][NTF2−] can overcome the challenge of chemisorption-based CO2 capture via significant acceleration of CO2 desorption with catalysis in P1-WHcat-MEA-CO2 (pathway with use of the organocatalyst but without the presence of H2O) and P2-WHcat-MEA-CO2-H2O (pathway with use of both the catalyst, such as an organocatalyst, and H2O). A liquid catalyst can accelerate CO2 capture with and without the presence of water or a liquid and solid —NH2 containing sorbent. The calculated results in FIGS. 5A and 5B clearly show that mim+COOH in EMmim+][NTF2−] prefers to react with MEA to form the complex of MEAH+ and mim+COO−, denoted as MEA-cat Complex in FIGS. 5A and 5B without any energy barrier. As shown in FIGS. 27A-27D, after the decomposition of the MEA-cat Complex, where the acidic [mimCH2COO−]+ reacts with the basic MEA, into MEAH+ and mim+COO−. The latter intermediate (mim+COO−) or [mimCH2COO−]+ can be found to be more effective than the MEA-cat Complex in accelerating MEACOO− formation in P1-WHcat-MEA-CO2. After a comparison, the individual [mimCH2COO−]+ or (mim+COO−) is preferred to be the catalyst of the process. Where, specifically, in accordance with aspects of the present disclosure FIG. 27D discloses the optimized geometries associated with the possible catalyzed pathways for MEA-CO2 and H2O-MEA-CO2. And, where, specifically, in accordance with aspects of the present disclosure FIG. 27C discloses the reaction energy profiles for the possible catalyzed pathways for MEA-CO2 and H2-MEA-CO2. Eabs marked with yellow stands for the energy barriers for absorption process and Edes marked with yellow represents that for desorption process. Therefore, after the decomposition of the MEA-cat Complex into MEAH+ and [mimCH2COOH]+, the latter intermediate ([mimCH2COO−]+) is found to be more effective than the MEA-cat Complex in accelerating the formation of MEACOO− in P1-WHcat-MEA-CO2. As a result, in the presence of [mimCH2COOH]+, P1-WHcat-MEA-CO2 can avoid the rate determining step of P1-WOcat-MEA-CO2, P1-R1, which is the key point to lowering the overall CO2 capture energy consumption. Instead, reactions in the catalyzed desorption pathway are in way of:",
                                "MEACOO−+mim+COOH→MEA+CO2+mim+COO−  (P1-R−2-WHcat)",
                                "MEAH++mim+COO−→MEA+mim+COOH.  (P1-R−1-WHcat)",
                                "Or",
                                "Or MEACOO−+mimCH2COOH+→MEA+CO2+[mimCH2COO−]+  (P1-R−2-WHcat)",
                                "MEAH++[mimCH2COO−]+→MEA+[mimCH2COOH]+.  (P1-R−1-WHcat)",
                                "P1-R1-WHcat and P1-R1-WHcat provide the catalytic function of the ionic liquid for CO2 capture without the presence of H2O. Notice that the highest energy changes of the step reactions of P1-WHcat-MEA-CO2 in FIG. 5B, 11.0 kJ/mol for CO2 absorption and 27.2 kJ/mol for CO2 desorption, respectively, are lower than the corresponding values in P1-WOcat-MEA-CO2, 21.3 kJ/mol and 31.1 kJ/mol. Thus, [EMmim+][NTF2−] can clearly facilitate the route of P1-WOcat-MEA-CO2 based CO2 capture, with the P1-WHcat-MEA-CO2 more preferable.",
                                "Also, the energy profiles for CO2 absorption-desorption in P2-R1 to P2-R3, with and without the presences of [EMmim+][NTF2−], were calculated. The highest step reaction energy changes during catalytic CO2 desorption, P2-R1-WHcat-MEA-CO2-H2O, P2-R2-WHcat-MEA-CO2-H2O and P2-R3-WHcat-MEA-CO2-H2O, are 31.5 kJ/mol, 65.9 kJ/mol and 65.9 kJ/mol, respectively, which are substantially lower than the corresponding values of non-catalytic P2-R1-WOcat-MEA-CO2-H2O, P2-R2-WOcat-MEA-CO2-H2O, and P2-R3-WOcat-MEA-CO2-H2O, which are 75.9 kJ/mol, 111.3 kJ/mol and 89.6 kJ/mol as shown in FIGS. 27A-27D. Although CO2 desorption in all the three pathways can be accelerated with [EMmim+][NTF2−], P2-R1-WOcat-MEA-CO2-H2O appears to be the most easiest one for the non-catalytic steps. Also, the CO2 absorption in P2-R1-WOcat-MEA-CO2-H2O has the lowest maximum reaction energy, 32.5 kJ/mol, while those values for P2-R2-WOcat-MEA-CO2-H2O and P2-R3-WOcat-MEA-CO2-H2O are 104.3 kJ/mol and 55.1 kJ/mol, respectively. This result indicates that CO2 absorption with P2-R1-WOcat-MEA-CO2-H2O can be the easiest one among the three pathways. Therefore, the P2-R1-WHcat-MEA-CO2-H2O based CO2 capture pathway using catalyst can be also likely to be the most significant step. Accordingly, it can be further studied as detailed below.",
                                "For P2-R1-WHcat-MEA-CO2-H2O with the presence of mim+COOH or [mimCH2COO−]+, the CO2 desorption can be very different from that in the uncatalyzed P2-R1-WOcat-MEA-CO2-H2O. The optimized geometries associated with the proton transfer reactions of ZW with [mimCH2COOH]+ or mim+COOH, [NTF2−], H2O and MEA are shown by way of example in FIG. 28A. In FIG. 28B, the reaction energy profiles for proton transfer reactions of ZW with [mimCH2COOH]+, [NTF2−], H2O and MEA are shown. When taking protons from ZW, the order of ability in withdrawing protons is: MEA>[mimCH2COO−]+ or mim+COO−>[NTf2]− >H2O. The activation energies for the proton transfer process could be considered as the index of basicity.",
                                "As shown in FIG. 27A-27D, mim+COO− and [mimCH2COO−]+ can be more effective than MEA-cat Complex in accelerating both HCO3− formation for CO2 absorption and HCO3− decomposition into CO2 in P2-R1-WHcat-MEA-CO2-H2O, the latter especially from a reaction energy perspective. As shown in FIG. 5B, the highest step reaction energy changes of P2-R1-WHcat-MEA-CO2-H2O are 32.5 kJ/mol and 31.5 kJ/mol for CO2 absorption and CO2 desorption, respectively, which are lower than those corresponding values in P2-R1-WOcat-MEA-CO2-H2O, 66.7 kJ/mol and 75.9 kJ/mol. This result indicates that the CO2 desorption (the proton transfer process from MEAH+ to HCO3− in P2-WOcat-MEA-CO2-H2O, or in the presence of water) in FIG. 5A can be a difficult step, which can be significantly facilitated by using [EMmim+][NTF2−]. Clearly, MEA can be stronger than [mimCH2COOH]+ or mim+COO− in withdrawing protons (FIG. 28A and FIG. 28B), thus the conjugated acid MEAH+ can be weaker than [mimCH2COOH]+ or mim+COO− in proton donation. It ise consistent with the computed results because the change of MEAH+ to HCO3− requires as high as 80.5 kJ/mol as marked in P2-R1-WOcat-MEA-CO2-H2O in FIG. 5B. However, with the presence of [EMmim+][NTF2−], CO2 desorption starts by the combination of HCO3− (another major species in spent MEA solution) with [mimCH2COOH]+ or mim+COOH. The step only needs 31.5 kJ/mol and forms CO2 and H2O as highlighted in FIG. 5B, which can be much easier than the formation of CO2 and OH−, as well as [mimCH2COOH]+ or mim+COO−, due to its higher activation energy (102 kJ/mol) when catalysts are not used. Then, the resultant [mimCH2COOH]+ or mim+COO− and MEAH+ can easily react and form mim+COOH and MEA. The regenerated [mimCH2COOH]+H can continuously catalyze CO2 desorption during CO2 desorption, thus [EMmim+][NTF2−] can be a very effective catalyst for CO2 desorption the key step in reducing the overall energy consumption of CO2 capture. Also, the regenerated MEA can be used for CO2 absorption in the subsequent cyclic CO2 capture.",
                                "The reactions in the desorption pathway with the use of [EMmim+][NTF2−] are given below (P2-R−1,1-WHcat occurs without the presence of water):",
                                "HCO3−+mim+COOH→CO2+H2O+mim+COO−  (P2-R−1,2-WHcat)",
                                "MEAH++mim+COO−→MEA+mim+COOH.  (P2-R−1,1-WHcat);",
                                "or",
                                "HCO3−+mimCH2COOH+→CO2+H2O+mimCH2COOH+  (P2-R−1,2-WHcat)",
                                "MEAH++mimCH2COO−]+→MEA+[mimCH2COOH]+.  (P2-R−1,1-WHcat).",
                                "Obviously, [mimCH2COOH]+ or mim+COOH as a Brønsted acid or the core of the novel catalytic CO2 capture process and the chemisorption based capture CO2 technologies including liquid and solid based CO2 capture technologies, can be necessary for initiating and driving P2-R−1-WHcat, which further confirms the significant function of ultrasonic [EMmim+][NTF2−] activation or formation of-[EMmim+][NTF2−]. The electrophilic characteristic of mim+ in mim+COOH or [mimCH2COOH]+ can enhance the acidity of the COOH in [mimCH2COOH]+ or mim+COOH via inductive effect, which can be desired for P2-R−1,2-WHcat or formation of CO2 and H2O as well as mim+COO− or [mimCH2COOH]+. The stable intermediate [mimCH2COO−]+ or (mim+COO−) resulting from the inherent resonance effect existing in —COO− can be a conjugate base of [mimCH2COOH]+ or mim+COOH, which can quickly react with Brønsted acid, MEAH+ in P2-R−1,1-WHcat for realization of MEA regeneration. Furthermore, the essential part of P2-R−1,2-WHcat can be to convert HCO3− into CO2 and H2O, which can be the common rate limiting step. Thus, [MAMmim+][NTF2−] with the desired Brønsted acidity can be shown to be an highly effective organocatalyst for chemisorption based capture CO2 technologies.",
                                "Consequently, the much quicker CO2 desorption kinetics at low temperature enabled with the use of the catalyst can significantly advance the development of a new generation of CO2 capture technology, from the perspectives of decreasing the parasitic penalty of these systems, capital investment, and environmental protection. The catalyst can make CO2 capture much less demanding for high quality energy, and thus widely available low-temperature heat (e.g., those from solar collectors or waste heat) can be effectively used for CO2 capture, which will not only lead to a significant decrease in parasitic energy penalty, capital and operating costs, but also be beneficial to the elimination of the secondary environmental pollutant resulting from MEA degradation during high-temperature CO2 desorption of conventional CO2 capture technologies. Therefore, [EMmim+][NTF2−] can be a green transcendent catalyst for CO2 capture technology."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce IL catalyst activation via ultrasound",
                                "describe experimental conditions for ultrasound activation",
                                "show FT-IR spectra of [EMmim+][NTF2−] and US-[EMmim+][NTF2−]",
                                "discuss acidity of [EMmim+][NTF2−] and its enhancement via ultrasound",
                                "show pH values of [EMmim+][NTF2−] and US-[EMmim+][NTF2−] solutions",
                                "introduce mechanistic studies of CO2 desorption",
                                "describe Raman and FT-IR spectroscopies for analyzing solutions",
                                "show Raman spectra of spent MEA solutions with and without US-[EMmim+][NTF2−]",
                                "show FT-IR spectra of spent MEA solutions with and without US-[EMmim+][NTF2−]",
                                "discuss catalytic effects of US-[EMmim+][NTF2−] on CO2 desorption",
                                "show changes in peak intensities of HCO3−, CO32−, and MEACOO− with and without US-[EMmim+",
                                "discuss significance of catalytic effects of US-[EMmim+][NTF2−]",
                                "introduce experimental study of reaction mechanisms",
                                "show molecular structure of [EMmim][NTf2]",
                                "discuss pH changes after CO2 absorption",
                                "show FT-IR spectra of water and [EMmim][NTf2] aqueous solutions with and without CO2",
                                "discuss hydrolysis of —COOCH3 in [EMmim][NTf2] into COOH",
                                "show bands assigned to —CH3 group in IL catalyst",
                                "discuss formation of CH3OH with enhanced hydrolysis process",
                                "show bands assigned to —C—O—C peak",
                                "discuss —COOCH3 hydrolysis and COOH formation",
                                "show FT-IR spectra of fresh catalytic solution and catalytic solutions after absorption and desorption",
                                "discuss changes in peak intensities of —C—OH, —COO—/C—C, CO32−, and —OH",
                                "discuss differences in CO2 absorption and desorption with and without catalyst",
                                "show pH values of uncatalytic and catalytic solutions with absorption and desorption times",
                                "introduce catalytic effect of [EMmim][NTf2] at different absorption and desorption times",
                                "show FT-IR spectra of catalytic MEA solutions during CO2 absorption and desorption",
                                "discuss changes in peak intensities of HCO3−, CO32−, and MEACOO− with and without [EMmim][NT",
                                "discuss significance of catalytic effect of [EMmim][NTf2]",
                                "introduce reaction mechanisms",
                                "calculate reaction energy values",
                                "compare reaction energy values",
                                "identify preferred pathway",
                                "explain catalyst function",
                                "apply computational methods",
                                "analyze reaction energy profiles",
                                "identify rate-determining step",
                                "describe catalytic function",
                                "compare energy barriers",
                                "analyze reaction pathways",
                                "identify effective catalyst",
                                "describe proton transfer reactions",
                                "analyze reaction energy profiles",
                                "identify key step",
                                "describe CO2 desorption process",
                                "analyze reaction energy changes",
                                "identify effective catalyst",
                                "describe regeneration process",
                                "analyze reaction pathways",
                                "conclude catalyst effectiveness"
                            ],
                            "num_characters": 25770,
                            "outline_medium": [
                                "introduce IL catalyst activation via ultrasound",
                                "describe FT-IR spectra of IL catalyst",
                                "discuss acidity of IL catalyst",
                                "explain ultrasound-activated hydrolysis of ester group",
                                "show Raman and FT-IR spectra of spent MEA solutions",
                                "analyze catalytic effects on CO2 desorption",
                                "discuss molecular structure of IL catalyst",
                                "describe hydrolysis activation process of IL catalyst",
                                "analyze FT-IR spectra of catalytic solutions",
                                "identify functional groups in catalytic solutions",
                                "discuss acidity of IL catalyst after CO2 absorption",
                                "explain catalytic effects on CO2 desorption pathways",
                                "describe DFT calculations for CO2 capture without catalyst",
                                "analyze energy changes for each step in CO2 capture pathways",
                                "present reaction mechanisms",
                                "calculate reaction energy values",
                                "compare reaction energy values",
                                "explain catalytic function of ionic liquid",
                                "describe reaction pathways with catalyst",
                                "analyze energy profiles for CO2 absorption-desorption",
                                "discuss proton transfer reactions",
                                "explain role of mim+COO− and [mimCH2COO−]+",
                                "describe desorption pathway with catalyst",
                                "discuss significance of catalyst for CO2 capture technology"
                            ],
                            "outline_short": [
                                "describe ultrasound activation of IL catalyst",
                                "illustrate mechanistic studies of CO2 desorption",
                                "study reaction mechanisms experimentally",
                                "analyze FT-IR spectra of catalytic solutions",
                                "discuss acidity of IL catalyst",
                                "compare catalytic and uncatalytic CO2 sorption pathways",
                                "calculate energy changes for CO2 capture and desorption reactions",
                                "describe reaction mechanisms",
                                "analyze energy profiles",
                                "discuss catalytic effects",
                                "illustrate reaction pathways",
                                "highlight benefits of catalyst"
                            ]
                        },
                        {
                            "title": "5.0 Methods",
                            "paragraphs": [
                                "**5.1. Synthesis and Pre-Treatment of IL**",
                                "The [EMmim+][NTF2−] catalyst can be synthesized in accordance with the present disclosure, and the detailed synthesis information are presented as shown in FIG. 6.",
                                "(1) Synthesis of [CH2COOCH3mim+]Br, [CH2COOCH3mim+]Br can be synthesized by the reaction of 1-methylimidazole with methyl bromoacetate. In a typical experiment, methyl bromoacetate (0.155 mol) can be added dropwise to a solution of 1-methylimidazole (0.15 mol) in acetonitrile (150 ml) under nitrogen atmosphere. The mixture can be continuously stirred at room temperature until it can be thoroughly mixed, and then can be heated for 12 h at 55° C. The resulting solution can be evaporated under reduced pressure and can be repeatedly can be washed with ethyl acetate to remove excess methyl bromoacetate. After that, the above solution can be rotary evaporated under reduced pressure to obtain [CH2COOCH3mim+]Br also referred to as [EMmim][Br]. The resultant material can be dried under vacuum for at least 24 h before use (31.6 g, yield 89.6%).",
                                "(2) Synthesis of [CH2COOCH3mim+][NTF2−], [CH2COOCH3mim+][NTF2−] can be prepared from metathesis reaction of [CH2COOCH3mim+]Br with Li[NTF2−]. In a typical procedure, [CH2COOCH3mim+]Br ([EMmim][Br]) (0.06 mol) can be mixed with equimolar amount of Li[NTF2−] in water (20 ml), and the mixture can be vigorously stirred for 4 h at room temperature. Then, the bottom phase can be repeatedly washed with water or deionized water to remove excess salt. After that, the resulting solution can be rotary evaporated under reduced pressure to obtain [CH2COOCH3mim+][NTF2−] ([EMmim+][NTF2−]). The IL can be dried under vacuum for at least 24 h before use (23.1 g, yield 88.3%).",
                                "The structure of the synthesized IL can be confirmed by 1H NMR, 13C NMR, FT-IR and ESI-MS spectrum (as shown in FIGS. 8-11B).",
                                "To further enhance the catalytic performance of the synthesized IL catalyst, the [EMmim+][NTF2−] can be treated by ultrasonic treatment with the different conditions at room temperature (Powersonic P1100D-45, Advanced Ceramics Technology (M) SDN. BHD.), and then used for the catalytic CO2 capture process. Structures of the synthesized IL were confirmed by 1H NMR, 13C NMR, FT-IR and ESI-MS spectra in FIGS. 8, 9, 11A, 11B and 30, respectively. Where, specifically, in accordance with aspects of the present disclosure, FIG. 8 shows data of the 1H NMR (Bruker spectrometer, 400 MHz, d6-DMSO) spectrum of [EMmim][NTf2] is δ 9.07 (s, 1H, H2), 7.72 (s, 2H, H4 and H5), 5.24 (s, 2H, H6), 3.91 (s, 3H, H8), 3.75 (s, 3H, H3). Where, specifically, in accordance with aspects of the present disclosure, FIG. 9 shows data of the 13C NMR (Bruker spectrometer, 400 MHz, d6-DMSO) spectrum of [EMmim][NTf2]: 636.49 (C3), 49.90 (C8), 52.94 (C6), 118.17, 121.61 (C9), 123.88, 124.16 (C4, C5), 138.17 (C2), 167.80 (C7). And, where, specifically, in accordance with aspects of the present disclosure, FIG. 8 shows as further illustrated in FIG. 30, the FT-IR spectrum of [EMmim][NTf2] collects with a Thermo Nicolet Magna-IR 760 spectrometer with a resolution of 4 cm−1 by scanning 32 times from 4000 to 400 cm−1. Moreover, as shown in FIGS. 11A-11B, the ESI-MS spectrum of [EMmim][NTf2] may present m/z=155.1 for [EMmim]+ in FIG. 11A, and m/z=279.9 for [NTf2]− in FIG. 11B, which the ESI-MS spectrum was obtained, by way of example, by ultra-high-resolution electro-spray time-of-flight mass spectrometry (Bruker micro TOF II, Germany).",
                                "**5.2. Characterizations**",
                                "1H NMR and 13C NMR spectra were recorded on a Bruker spectrometer (400 MHz) in DMSO. ESI-MS spectrum can be obtained by Ultra-high-resolution electro-spray time-of-flight mass spectrometry (Bruker microTOF II, Germany). FT-IR spectra were collected using a Thermo Nicolet Magna-IR 760 spectrometer with a resolution of 4 cm−1 by scanning 60 times from 400 to 4000 cm−1. Raman spectrum measurements were conducted using an Advantage 785 Raman Spectrometer with a 758 nm laser and up to 60 mW radiation power during determination. About 1.5 mL liquid sample can be introduced into a clear shell vial, and then use for the Raman test. Thermogravimetric analyses (TGA) curve of IL can be obtained using a TA Instruments SDT Q600 apparatus with a heating ramp of 10° C./min at the temperature of 20-550° C.",
                                "The Brønsted acid sites of the IL can be monitored using the Hammett function (H0) which obtained by UV-Vis spectroscopy technique. The 4-nitroaniline solution (25 μm) can be employed as an basic indicator to trap the dissociated acidic protons of the [EMmim+][NTF2−] in water following the published method. The acidity parameter H0 can be calculated using the following equation (1).",
                                "H0=pKa+log([I]/[IH+])  (1)",
                                "where pKa can be 0.99 for the aqueous 4-nirtoaniline solution, [I] and [IH+] respectively represent the molar concentrations of the unprotonated and protonated forms of the 4-nirtoaniline in the aqueous solution. The absorbance of the indicator and the indicator with [EMmim+][NTF2−] solution can be measured using a spectrophotometer (SpectraMax M2e, CA, USA) at wavelength from 250 to 500 nm. The maximum absorbance of the samples can be found at 380 nm (aqueous 4-nirtoaniline solution).",
                                "**5.3. CO2 Absorption-Desorption Test**",
                                "The CO2 absorption-desorption test can be carried out using the experimental apparatus presented in FIGS. 12A and 12B. 250 mL three-necked flask can be employed as a reactor. 100 mL of 20 wt % aqueous MEA (99+%, product number: 11016-7-4L, Aldrich chemical company, Inc.) solution with desired quality of IL catalyst were added for each test. The first run of CO2 absorption process was conducted at 30° C. and atmospheric pressure (0.78 bar at Laramie, Wyo., USA, where the experiment was conducted), while the cyclic tests were conducted at 22° C. (room temperature). The 20 wt % MEA solution can be obtained by diluting pure MEA solvent with DI-water. CO2 absorption process can be conducted at 30° C. and atmospheric pressure. The simulated flue gas containing 10 vol % CO2, 10 vol % O2 and 80 vol % N2 with a flow rate of 500 mL/min can be bubbled into amine solution sing the inlet gas 15. (Gas flow can be calibrated at local atmospheric pressure: 0.78 bar at Laramie). The N2 gas is kept in the N2 gas cylinder 1, the O2 gas may be housed in the O2 gas cylinder 12 or stored in the mixed gas cylinder 2. The CO2 gas may be housed in the CO2 gas cylinder 11 or the mixed gas cylinder 2 along with the O2. Other gases may be housed in their own cylinders or in the mixed gas cylinder 2. The gas flow from each cylinder may be controlled through the mass flow controller 3. The outlet gas concentration can be monitored with an inline gas analyzer 5 (NDIR ZRE, California Analytical Instruments) or flue gas analyzer 5, and then recorded using a data recording unit 5 and sent to a data analyzing computer 10. The quality of absorbed CO2 in the MEA solution can be calculated by integrating the obtained CO2 absorption curves (CO2 concentration vs. absorption time). For the fresh MEA solution absorbed CO2 process, when the desired amount of absorbed CO2 can be obtained (178.0 mmol), the absorption process can be stopped. Absorption time for the first run test was 7800 s and that for each cyclic test was 1800 s.",
                                "Upon the finish of the CO2 absorption experiment, the temperature of the MEA solution, housed in a furnace 6 of a thermostatic water bath system 4, can be gradually heated to 85° C. using a thermocouple 14 controlled by a temperature controller 13. During the desorption process, the released CO2 can be carried by the N2 gas with the flow rate of 500 mL/min from the reaction system to the gas analyzer. Each CO2 desorption process can be duration for 1,800 s. A magnetic stirring 16 or mechanical stirring can be used to make the MEA solution and catalyst uniform. A condenser 7 with a cooling water (5° C.) can be connected with the three-necked flask to avoid the loss of MEA solution. A cooling unit 17 may be operatively connected to the condenser 7 to cool the condenser 7 or control the temperature. Moisture is removed by the moisture remover 8 prior to being sent to the flue gas analyzer 5 or the mass spectrometer 9.",
                                "**5.4. Theoretical Studies**",
                                "Density functional theory (DFT) studies on catalytic mechanism of CO2 absorption and desorption processes are performed by means of Dmol3 program in Materials studio 6.0 package. The exchange correlation functional utilized can be the local density approximation with Perdew-Burke-Ernzehof, known as GGA-PBE, and a double numerical basis set with polarization function on all atoms (the DNP basis set) can be used throughout the study. The following thresholds are used for the geometry optimization: 1×105 Hartree for the maximum energy change, 2×10−3 Hartree/A for the maximum force, and 5×10−3 Å for the maximum displacement. The complete linear synchronous transit and quadratic synchronous transit (LST/QST) calculations are performed to obtain the structures of transition state. Vibrational frequencies are calculated at the optimized geometries to identify the nature of the stationary points (no imaginary frequency) and the transition state (only one imaginary frequency). Bond dissociation energy of A-B bond can be calculated as follow:",
                                "BDE(A-B)=Energy(A)+Energy(B)−Energy(A-B).",
                                "FIG. 29 provides graphs illustrating all the configurations, including reactants, intermediate, such as complexes, transition states and products listed in the Figures.",
                                "The disclosure is not to be limited to the particular aspects described herein. In particular, the disclosure contemplates numerous variations in ultrafast catalytic CO2 capture catalyzed by a novel ultrasound-treated ionic liquid. The foregoing description has been presented for purposes of illustration and description. It is not intended to be an exhaustive list or limit any of the disclosure to the precise forms disclosed. It is contemplated that other alternatives or exemplary aspects are considered included in the disclosure. The description is merely examples of aspects, processes, or methods of the disclosure. It is understood that any other modifications, substitutions, and/or additions can be made, which are within the intended spirit and scope of the disclosure."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize [EMmim+][NTF2−] catalyst",
                                "detail synthesis information",
                                "introduce reaction of 1-methylimidazole with methyl bromoacetate",
                                "describe synthesis of [CH2COOCH3mim+]Br",
                                "detail metathesis reaction of [CH2COOCH3mim+]Br with Li[NTF2−]",
                                "confirm structure of synthesized IL by 1H NMR, 13C NMR, FT-IR and ESI-MS spectrum",
                                "treat [EMmim+][NTF2−] by ultrasonic treatment",
                                "introduce characterizations",
                                "describe 1H NMR and 13C NMR spectra",
                                "detail ESI-MS spectrum",
                                "describe FT-IR spectra",
                                "introduce Raman spectrum measurements",
                                "detail thermogravimetric analyses (TGA) curve of IL",
                                "monitor Brønsted acid sites of IL using Hammett function (H0)",
                                "introduce CO2 absorption-desorption test",
                                "describe experimental apparatus",
                                "detail CO2 absorption process",
                                "describe CO2 desorption process",
                                "introduce theoretical studies",
                                "detail density functional theory (DFT) studies on catalytic mechanism"
                            ],
                            "num_characters": 10282,
                            "outline_medium": [
                                "synthesize IL catalyst",
                                "pre-treat IL catalyst",
                                "confirm IL structure",
                                "characterize IL properties",
                                "monitor Brønsted acid sites",
                                "conduct CO2 absorption-desorption test",
                                "describe experimental apparatus",
                                "perform theoretical studies on catalytic mechanism",
                                "calculate bond dissociation energy",
                                "provide graphs of configurations"
                            ],
                            "outline_short": [
                                "synthesize IL catalyst",
                                "characterize IL structure",
                                "conduct CO2 absorption-desorption test",
                                "perform theoretical studies on catalytic mechanism",
                                "discuss variations and limitations of disclosure"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. An ionic liquid catalyst for catalytic CO2 capture, the ionic liquid catalyst comprising:\na catalytic amine configured to capture CO2;\nan ionic liquid;\nwherein the ionic liquid reacts with the catalytic amine to produce an ionic liquid catalyst;\nwherein the ionic liquid catalyst is configured to capture CO2.",
        "2. The ionic liquid catalyst of claim 1, wherein the ionic liquid catalyst is a catalyst for any chemisorption based CO2 captures.",
        "3. The ionic liquid catalyst of claim 1, wherein the ionic liquid catalyst is selected from the group of [EMmim+][NTF2−] based catalysts.",
        "4. The ionic liquid catalyst of claim 3, wherein the catalyst comprises COOH.",
        "5. The ionic liquid catalyst of claim 1, wherein the catalytic amine is monoethanolamine.",
        "6. The ionic liquid catalyst of claim 1, wherein the ionic liquid catalyst\nreduces the overall CO2 capture energy consumption.",
        "7. A process for synthesizing an ionic liquid (IL) catalyst for capturing CO2; the process comprising:\nmixing a basic amine with an acid, wherein the acid is added to the basic amine under a nitrogen atmosphere to form a cation solution;\nevaporating the cation solution to obtain a cation;\nreacting the cation with an anion in water to form an IL solution;\nwashing a bottom phase of the IL solution to remove excess salt;\nevaporating the IL solution to form the IL catalyst.",
        "8. The process of claim 7, wherein the IL catalyst comprises [CH3COOCH2mim][NTF2], denoted as [EMmim][NTF2].",
        "9. The process of claim 7, further comprising: hydrolyzing an ester group of the IL catalyst to form carboxylic acid groups.",
        "10. The process of claim 7, wherein the IL catalyst comprises Brønsted acid sites.",
        "11. The process of claim 7, wherein the cation comprises [EMmim][Br+] and the anion comprises Li[NTF−].",
        "12. The process of claim 7, wherein the basic amine comprises methylimidazole and the acid comprises methylbromoacetate.",
        "13. The process of claim 7, wherein the IL catalyst is ultrasonic treated.",
        "14. The process of claim 7, wherein the IL catalyst is thermally stable at temperatures of at least 300° C.",
        "15. A method for catalyzing both CO2 sorption and desorption of chemisorption-based technologies, comprising:\nproviding an ionic liquid catalyst;\nproviding CO2 through a gas inlet; and\nabsorbing and desorbing CO2.",
        "16. The method of claim 15, wherein the CO2 reacts with monoethanolamine (MEA) to form MEA+COO− intermediate and wherein the reaction is the rate limiting step.",
        "17. The method of claim 15, further comprising treating MEA with an ionic liquid (IL) for providing an IL catalyst.",
        "18. The method of claim 17, wherein the IL catalyst is a [EMmin][NTf2] catalyst promoting both CO2 absorption and desorption.",
        "19. The method of claim 15, wherein the absorbing and desorbing CO2 without the presence of water is a solid based CO2 capture.",
        "20. The method of claim 15, wherein the absorbing and desorbing CO2 without the presence of water is a liquid based CO2 capture."
    ]
}