{
    "id": "US20090058335",
    "authors": [
        "Peter E. Kascak",
        "Ralph H. Jansen",
        "Timothy P. Dever"
    ],
    "title": "CONTROL SYSTEM FOR BEARINGLESS MOTOR-GENERATOR",
    "date": "2008-10-30 00:00:00",
    "abstract": "A control system for an electromagnetic rotary drive for bearingless motor-generators comprises a winding configuration comprising a plurality of individual pole pairs through which phase current flows, each phase current producing both a lateral force and a torque. A motor-generator comprises a stator, a rotor supported for movement relative to the stator, and a control system. The motor-generator comprises a winding configuration supported by the stator. The winding configuration comprises at least three pole pairs through which phase current flows resulting in three three-phase systems. Each phase system has a first rotor reference frame axis current that produces a levitating force with no average torque and a second rotor reference frame axis current that produces torque.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF INVENTION",
                    "paragraphs": [
                        "The present invention generally relates to an electromagnetic rotary drive and more particularly, to an electromagnetic rotary drive that functions as a bearingless motor-generator. Most particularly, the invention relates to a control system for a bearingless motor-generator.",
                        "Electromagnetic rotary drives are commonly used in standard motors as well as bearingless motor-generators. A conventional electromagnetic rotary drive includes a rotating part and a stationary part. The rotary part is commonly referred to as a rotor and the stationary part is commonly referred to as a stator. The stationary part supports a set of windings. A conventional control system for an electromagnetic rotary drive for a standard motor is shown in FIG. 1. The control system, generally indicated at 10, includes six switches 12, which control the flow of phase currents into a set of windings to produce forces, which exert a torque on a rotating part. However, this control system produces no forces for levitating the rotating part, since poles carry the same flux, and balance their forces out.",
                        "Unlike the standard motor described above, a conventional bearingless motor-generator produces forces for levitating the rotating part. An example of a bearingless motor-generator is described in U.S. Pat. No. 6,559,567, issued May 6, 2003, to Schob, the description of which is incorporated herein by reference. This bearingless motor-generator has a control system for an electromagnetic rotary drive that includes control devices, which control the flow of phase currents into two windings. The phase currents have a mutual phase shift of about 120°. The control system produces forces transverse to the windings. These transverse forces can be repulsive forces or attractive forces. By orienting the windings as described by Schob, the forces may be directed at an angle greater than 0° and less than 90° relative to the axis of rotation of the rotor. In this way, the rotor can be axially or radially levitated.",
                        "It should be noted that the bearingless motor-generator described above includes a drive winding for producing a drive field and a separate control winding for producing a control field. The drive field exerts a torque on the rotating part to rotate the rotating part and the control field exerts a force on the rotating part to levitate the rotating part.",
                        "A control system is needed that permits both drive and control fields to be produced from the same set of windings, thus eliminating the need to separate drive and control windings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce electromagnetic rotary drives",
                        "describe conventional control system",
                        "limitations of conventional control system",
                        "describe bearingless motor-generator",
                        "motivate new control system"
                    ],
                    "num_characters": 2546,
                    "outline_medium": [
                        "introduce electromagnetic rotary drives",
                        "limitations of conventional control systems"
                    ],
                    "outline_short": [
                        "motivate bearingless motor-generator"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [
                        "The present invention is directed toward a control system for an electromagnetic rotary drive for bearingless motor-generators that meets the foregoing needs. The control system comprises a winding configuration comprising a plurality of individual pole pairs through which phase currents flow, each phase current producing both a lateral force and a torque.",
                        "The present invention is also directed toward a bearingless motor-generator. The motor-generator comprises a stator, a rotor supported for movement relative to the stator, and a control system. The motor-generator comprises a winding configuration supported by the stator. The winding configuration comprises at least three pole pairs through which phase currents flow resulting in three three-phase systems. Each phase system has a first rotor reference frame axis current that produces a levitating force with no average torque and a second rotor reference frame axis current that produces torque.",
                        "Various objects and advantages of this invention will become apparent to those skilled in the art from the following detailed description of the preferred embodiment, when read in light of the accompanying drawings."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce control system for bearingless motor-generator",
                        "describe bearingless motor-generator embodiment"
                    ],
                    "num_characters": 1176,
                    "outline_medium": [
                        "introduce control system for bearingless motor-generators"
                    ],
                    "outline_short": [
                        "introduce control system"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION",
                    "paragraphs": [
                        "Referring now to the drawings, there is illustrated in FIG. 2 a cylindrical motor control system 20 for an electromagnetic rotary drive for use in a cylindrical bearingless motor-generator (hereinafter “motor”). It should be noted that the standard motor drive control system described above has only six switches 12, while the control system 20 shown in FIG. 2 has eighteen switches 22. As a consequence, the control system 20 can stimulate three systems of three phases. Each of these systems comprises a pole pair system, generally indicated at 24, resulting in three pole pair systems. Although there are three times as many switches, the required power rating for each switch 22 is much smaller than that for the conventional control system 10 described above. For example, if the number of turns in the motor is kept constant, the voltage switches 22 would be required to block would be one third of the normal system voltage of the conventional control system 10. If the motor is required to have the same bus voltage as the conventional control system 10, the number of winding turns could be increased and the switches 22 would only carry one third the normal current of the conventional control system 10. In addition, the new control system 20 provides fault tolerance. If any of the coils in the new control system 20 or the power electronics for a pole pair system 24 fails, the other two three-phase systems will still be able to provide motor torque and magnetic bearing forces.",
                        "A winding configuration with individually stimulated pole pairs is shown in FIG. 3. In this winding configuration, phase currents ia1, ia2, ia3, ib1, ib2, ib3, ic1, ic2, ic3 are defined in the three pole pairs 24 shown in FIG. 2. These are essentially three three-phase systems. The first system contains phase currents ia1, ib1, and ic1. This system can be transformed into a rotor reference frame with known transformations, as follows:",
                        "\\(\\begin{matrix}\n{\\begin{bmatrix}\ni_{{qs}\\; 1}^{r} \\\\\ni_{{ds}\\; 1}^{r} \\\\\ni_{01}\n\\end{bmatrix} = {\\begin{bmatrix}\n{\\cos \\mspace{14mu} \\theta_{r}} & {\\cos \\left( {\\theta_{r} - \\frac{2\\pi}{3}} \\right)} & {\\cos \\left( {\\theta_{r} + \\frac{2\\pi}{3}} \\right)} \\\\\n{\\sin \\mspace{14mu} \\theta_{r}} & {\\sin \\left( {\\theta_{r} - \\frac{2\\pi}{3}} \\right)} & {\\sin \\left( {\\theta_{r} + \\frac{2\\pi}{3}} \\right)} \\\\\n\\frac{1}{2} & \\frac{1}{2} & \\frac{1}{2}\n\\end{bmatrix}\\begin{bmatrix}\ni_{a\\; 1} \\\\\ni_{b\\; 1} \\\\\ni_{c\\; 1}\n\\end{bmatrix}}} & (1)\n\\end{matrix}\\)",
                        "FIG. 4 shows fictional coils (illustrating the manner in which the three three-phase systems operate), generally indicated at 26, 28, which rotate with the rotor 30 representing the rotor reference frame q and d-axis currents. It should be noted that the rotor reference frame d-axis current produces no average torque and the rotor reference frame q-axis current produces torque.",
                        "Note that while the d-axis current produces no torque, it does produce a lateral force. It should be noted what happens if the rotor reference frame d-axis currents are permitted to be different in the three different three-phase pole pairs 24, while keeping the rotor reference frame q-axis currents the same. FIG. 5 shows the force produced on the rotor 30 when 10 amps (first positive, then negative) is applied individually to each of the pole pairs 24 of the rotor reference frame d-axes while the other pole pairs have zero rotor reference frame d-axis and q-axis currents. FIG. 6 shows the magnitude of the force on the rotor 30 with ids1r=+10 A, and the rest of the rotor reference frame d-axis and q-axis currents set to zero. This force has an average value of 1.8 lbs. This force has a strong fourth harmonic ripple, and also a much smaller second harmonic component. The rotor force components in the x and y directions, which are plotted in FIG. 7, each have second harmonic ripples, and combine to generate the fourth harmonic ripple in the force.",
                        "The above results demonstrate that the forces generated by the rotor reference frame d-axis current idsr have fairly constant magnitudes. The force phases generated on the rotor using constant d-axis currents are plotted in FIG. 8. Note that this Fig. plots the phases of the force in mechanical degrees versus the electrical angle of the motor. The phases of the rotor forces generated by exciting separate rotational reference frame d-axis currents are 120 mechanical degrees apart from each other, and vary 46 mechanical degrees (+/−23 mechanical degrees) over an electrical revolution.",
                        "FIG. 9 shows the force vectors PP1, −PP1, PP2, −PP2, PP3, −PP3 that are possible with the different pole pairs 24. There are six possible force directions, using the positive and negative rotational reference frame d-axis currents. These forces bound six distinct regions. A desired force within any region can be produced optimally by using the vectors bordering that region as the basis. From this, a control system can be developed.",
                        "First, the phases of the six force vectors PP1, −PP1, PP2, −PP2, PP3, −PP3 need to be determined. By fitting the results in FIG. 8, the force phase β is calculated for each of the six force vectors PP1, −PP1, PP2, −PP2, PP3, −PP3 as a function of electrical angle of the rotor θr:",
                        "\\(\\begin{matrix}\n{\\beta_{1} = {4.3050 + {23.155 \\cdot {\\cos \\left( {{2 \\cdot \\left( {\\theta_{r} + 105} \\right)}\\frac{\\pi}{180}} \\right)}}}} & (2) \\\\\n{\\beta_{1 - {negative}} = {\\beta_{1} + 180}} & (3) \\\\\n{\\beta_{2} = {\\beta_{1} - 120}} & (4) \\\\\n{\\beta_{2 - {negative}} = {\\beta_{2} + 180}} & (5) \\\\\n{\\beta_{3} = {\\beta_{1} + 120}} & (6) \\\\\n{\\beta_{3 - {negative}} = {\\beta_{3} + 180}} & (7)\n\\end{matrix}\\)",
                        "During rotor levitation, the phase of the desired force is calculated and compared with the six available force vectors PP1, −PP1, PP2, −PP2, PP3, −PP3, and the two force vectors that border the region containing the desired force are then chosen as the basis. Next, the desired force is transformed from the x, y basis to the basis containing the phase of the two vectors to be used, βboundry-1, and βboundary-2. The transformation is performed using the following matrix:",
                        "\\(\\begin{matrix}\n{P = \\begin{bmatrix}\n{{real}\\left( ^{{j \\cdot \\beta_{{boundary} - 1}}\\frac{180}{\\pi}} \\right)} & {{real}\\left( ^{{j \\cdot \\beta_{{boundary} - 2}}\\frac{180}{\\pi}} \\right)} \\\\\n{{imag}\\left( ^{{j \\cdot \\beta_{{boundary} - 1}}\\frac{180}{\\pi}} \\right)} & {{imag}\\left( ^{{j \\cdot \\beta_{{boundary} - 2}}\\frac{180}{\\pi}} \\right)}\n\\end{bmatrix}} & (8)\n\\end{matrix}\\)",
                        "This allows the two currents that make up the boundary to the region, ids-boundary1r, Ids-boundary2r, to be defined as follows.",
                        "\\(\\begin{matrix}\n{\\begin{bmatrix}\ni_{{ds} - {{boundary}\\; 1}}^{r} \\\\\ni_{{ds} - {{boundary}\\; 2}}^{r}\n\\end{bmatrix} = {P^{- 1} \\cdot \\begin{bmatrix}\n\\frac{F_{x - {com}}}{currentstiffness} \\\\\n\\frac{f_{y - {com}}}{currentstiffness}\n\\end{bmatrix}}} & (9)\n\\end{matrix}\\)",
                        "where Fx-com and Fy-com are magnetic force bearing commands and current stiffness is a constant that determines the amount of force delivered to the rotor for 1 amp of current, in this case it is 0.18 lbs/A (per FIG. 6). This technique is used to generate various force commands; the results can be seen in FIG. 10. It should be noted that there may be some ripple in the force. This may be expected, as no attempt is made to reduce the natural ripple inherent to constant d-axis rotor reference frame current.",
                        "Now, a mechanical model of the rotor 30 is generated, with motor torques and forces as inputs, and the rotor angle, speed, lateral position and lateral velocity as outputs. This motor rotor is a mass which is free to move in the x and y directions, and begin by defining the following complex quantities:",
                        "x1=Posx+i·Posy",
                        "x2=Velx+i·Vely",
                        "where x1 and x2 are system states defining rotor lateral position and velocity, i is imaginary number, Posx and Posy are x and y rotor positions in inches, and Velx and Vely are x and y rotor positions in meters per second.",
                        "From Newton's second law:",
                        "F=ma=m·{dot over (x)}2",
                        "where F is force in Newtons, m is mass in kilograms.",
                        "With this information, the system can be described as follows:",
                        "\\(\\begin{matrix}\n{\\begin{bmatrix}\n{\\overset{.}{x}}_{1} \\\\\n{\\overset{.}{x}}_{2}\n\\end{bmatrix} = {{{\\begin{bmatrix}\n0 & 1 \\\\\n0 & 0\n\\end{bmatrix}\\begin{bmatrix}\nx_{1} \\\\\nx_{2}\n\\end{bmatrix}} + {\\begin{bmatrix}\n0 \\\\\n\\frac{1}{m}\n\\end{bmatrix}F}} = {{A\\begin{bmatrix}\nx_{1} \\\\\nx_{2}\n\\end{bmatrix}} + {BF}}}} & (10)\n\\end{matrix}\\)",
                        "where A and B are linear state space description matrices.",
                        "Note that the controllability matrix C of this system is:",
                        "\\(\\begin{matrix}\n{C = {\\left\\lbrack {B\\mspace{14mu} {A \\cdot B}} \\right\\rbrack = \\begin{bmatrix}\n0 & \\frac{1}{m} \\\\\n\\frac{1}{m} & 0\n\\end{bmatrix}}} & (11)\n\\end{matrix}\\)",
                        "This matrix has full rank so the system is controllable. Now, angular quantities are defined as follows:",
                        "x3=θmechanical",
                        "x4=ωmechanical",
                        "where x3 and x4 are angular position and velocity, θmechaninical mechanical is the mechanical angle of the rotor in radians, and ωmechanical is mechanical speed in radians per second.",
                        "With these quantities, the angular system can be described as:",
                        "\\(\\begin{matrix}\n{\\begin{bmatrix}\n{\\overset{.}{x}}_{3} \\\\\n{\\overset{.}{x}}_{4}\n\\end{bmatrix} = {{\\begin{bmatrix}\n0 & 1 \\\\\n0 & 0\n\\end{bmatrix}\\begin{bmatrix}\nx_{3} \\\\\nx_{4}\n\\end{bmatrix}} + {\\begin{bmatrix}\n0 \\\\\n\\frac{1}{J}\n\\end{bmatrix}T}}} & (12)\n\\end{matrix}\\)",
                        "where J is rotational inertia and T is torque in newton-meters.",
                        "The controllability matrix C of this system is:",
                        "\\(\\begin{matrix}\n{C = {\\left\\lbrack {B\\mspace{14mu} {A \\cdot B}} \\right\\rbrack = \\begin{bmatrix}\n0 & \\frac{1}{J} \\\\\n\\frac{1}{J} & 0\n\\end{bmatrix}}} & (13)\n\\end{matrix}\\)",
                        "The controllability matrix is again full rank, thus the system is controllable.",
                        "Now the position of the rotor can be described using the differential equations above along with the calculated torques and forces.",
                        "As was mentioned previously, motor torque will be controlled by enforcing the same appropriate rotor reference frame q-axis currents iqsr on all three pole pair systems. Also, it has been demonstrated that any desired radial force can be obtained by correctly controlling the rotational reference frame d-axis currents in the individual pole pairs 24. Using the results above, a rudimentary magnetic bearing controller can be designed to levitate the rotor 30; the position will be controlled with a proportional derivative (PD) controller (not shown). The controller has negative stiffness compensation, which essentially cancels the negative stiffness due to the motor permanent magnets (PMs). This controller outputs a force command, which is broken down into three pole pair rotor reference frame d-axis currents ids1r, ids2r, id3r. The motor may have mechanical touchdown bearings (not shown) which prevent the rotor 30 from contacting the lamination stacks of the stator 32 (see FIG. 4); they limit rotor motion to within 10 mils of center. On startup, the rotor 30 will be resting on these bearings, thus, the rotor will be levitated from the starting point on the touchdown bearing. Obviously these dimensions are dependent on the physical characteristics of the motor.",
                        "When the controller is implemented, the rotor 30 is levitated off of the touchdown bearing with an initial speed, such as 100 radians per second, and a torque command, which in this example is zero (thus iqsr=0 for all three systems). FIG. 11 shows the x, y plot of the rotor during this levitation, and FIG. 12 shows the x-component of position versus time during the levitation. FIG. 13 shows the PD force command separated into the negative stiffness compensation, proportional gain, and derivative components. The phase currents during this levitation period are seen in FIG. 14. The currents can be fairly high when the rotor 30 is being pulled off the back up bearings but the currents should decrease dramatically as time increases, and the rotor approaches the center. Rotor imbalance and sensor noise are present in the system, and some amount of current will be required to hold the rotor 30 in the center of the touchdown bearing. The rotor 30 may be intentionally rotated around its center of mass instead of its geometric center, which minimizes levitation currents, although in this case the position will not necessarily be forced to center.",
                        "In order to show that this control system provides simultaneous motor and magnetic bearing action, levitation is repeated, this time with 50 A of rotor reference frame q-axis current. The x position during this levitation is plotted in FIG. 15. This figure shows that the time response of levitation does not appreciably change with motoring current.",
                        "The phase currents present while levitating with 50 A Iqsr are shown in FIG. 16. The peak current of 95 A is achieved briefly during levitation in Ia2. The maximum current reached during the levitation period with no Iqsr is 61 A, also in Ia2. So, it is apparent that for a particular force level, the motor should be de-rated from its maximum power level. However, in this example, the magnetic bearing function needs a large force only during levitation, to overcome the negative stiffness while lifting the rotor 30 off of the back-up bearing. If this is the only time a large amount of current is required, temporarily exceeding the maximum phase limit of the motor will not be a problem, since the excess current will be present for such a brief period that no appreciable wire heating will occur. Actually, during most applications, levitation will occur before motoring starts, so the added current requirement may not exist at all.",
                        "The relevant factor to be considered when selecting ratings is the force needed to levitate the rotor. This involves factors that are not considered, including sensor noise, shaft runout, and rotor imbalance. In addition to compensating for these factors, if the motor is used as a flywheel in a satellite, it may be necessary to levitate the rotor on earth before sending it to orbit, which would require that the bearing system be able to support the weight of the rotor 30. Furthermore, the motor may be used to provide attitude control of the satellite in addition to energy storage. In this application, the magnetic bearing should be able to keep the rotor 30 levitated while the spacecraft is rotated.",
                        "Two conical motors, wound with three separated pole pairs, can be used together with the aforementioned control system to fully levitate and spin a rotor. An example of a machine 34 having two such conical motors is shown in FIGS. 17-19. In the illustrated embodiment of the machine 34, a rotor 36 rotates on the outside of stators 38, although a machine may be configured with rotors that rotate on the inside of the stators. Information on the position of the rotor 36 is received by a controller with eight radial eddy current sensors 40 and four axial eddy current sensors 42.",
                        "An exemplary control system 44 for driving the two conical motors is shown in FIG. 20. One conical motor comprises windings 46 comprised of three three-phase pole pair systems 24. The other conical motor comprises windings 48 also comprised of three three-phase pole systems 24. One advantage of this type of motor drive control system is that it provides fault tolerance; if any switch 22 or pole pair system 24 fails, the other two three-phase systems 24 will still provide rotation and levitation forces.",
                        "FIG. 21 shows the force vectors that are possible with the different pole pair systems 24. There are six force vectors that have an axial component as well as a radial component.",
                        "FIG. 22 shows a schematic force generation control code. Radial force control blocks 50, 52 use a radial control technique, as discussed above in connection with the cylindrical motor control system. The conical motor essentially reduces the current stiffness, as compared to that required by a similarly sized cylindrical motor, since all of the magnitude of force is no longer directed radially. The radial force control block 50 controls the radial force applied to Plane 1, while the radial force control block 52 controls the force applied to Plane 2. A new control block 53 is introduced to control the axial force. FIG. 23 shows a schematic of this control block 53. The inputs to this control block 53 are the axial force command at 56 and the rotor reference frame d-axis current commands, which were generated with the radial force control blocks 50 and 52, at 58. Axial force is created when the total force acting on Plane 1 is different than the total force acting on Plane 2. Thus, if one plane is creating a large radial force, it will have the effect of creating some axial force. However, the resultant axial force can be compensated for by adding equal parts of d-axis current to all of the pole pair systems 24 on the other motor. The axial force created by the radial controllers is calculated by taking the sum of the rotor reference frame d-axis current commands from the radial controller at Plane 1 minus the sum of the rotor reference frame d-axis current commands from the radial controller at Plane 2, then multiplying by the current stiffness at 60. This calculated axial force is then simply subtracted from the commanded axial force. This value, calculated at 62, is added to the rotor reference frame d-axis current commands of Motor I (shown in FIG. 21) and subtracted from the rotor reference frame d-axis current commands of Motor II. The final rotor reference frame d-axis current commands at 64 are sent out of this axial force control block 53 to the standard rotor reference frame current regulators 66 in FIG. 24.",
                        "A position controller 68 in FIG. 24 receives position information from the sensors 40, 42 and outputs force commands necessary to maintain levitation. FIG. 25 shows one implementation of the position controller as a proportional-integral-derivative (PID) controller. Note that while this specific example uses a PID controller, any other suitable controller type can be used, as well. The commanded position is input at 70, while measured position is input at 72. A standard PID control loop is executed at 74. Force commands at 76 are the output of this block 68.",
                        "The present invention is not intended to be limited to the control system described above. Similarly, the present invention is not intended to be limited to any particular winding configuration. It should be appreciated that any suitable winding configuration may be used for carrying out the invention.",
                        "The aforementioned invention is not intended to be limited to the motor described above but can be used on other motors with six or more poles. Motors with which the invention can be used include, but are not limited to, induction motors, synchronous reluctance motors, and permanent magnet motors. The motors may be configured as cylindrical or conical, interior rotor/exterior stator, or exterior rotor/interior stator.",
                        "The principle and mode of operation of this invention have been explained and illustrated in its preferred embodiment. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "illustrate cylindrical motor control system",
                        "describe advantages of new control system",
                        "introduce winding configuration with individually stimulated pole pairs",
                        "define phase currents in three pole pairs",
                        "transform phase currents into rotor reference frame",
                        "illustrate fictional coils and rotor reference frame",
                        "describe force produced on rotor with d-axis currents",
                        "show force magnitude and ripple",
                        "plot force phases generated by exciting separate rotational reference frame d-axis currents",
                        "determine phases of six force vectors",
                        "develop control system using force vectors",
                        "transform desired force into basis of two force vectors",
                        "define currents that make up boundary to region",
                        "generate various force commands",
                        "illustrate mechanical model of rotor",
                        "define complex quantities for rotor lateral position and velocity",
                        "describe system using Newton's second law",
                        "define linear state space description matrices",
                        "determine controllability matrix",
                        "define angular quantities for rotor position and velocity",
                        "describe angular system using differential equations",
                        "determine controllability matrix for angular system",
                        "describe position of rotor using differential equations and calculated torques and forces",
                        "design rudimentary magnetic bearing controller",
                        "implement controller with negative stiffness compensation",
                        "levitate rotor with initial speed and torque command",
                        "show x, y plot of rotor during levitation",
                        "show x-component of position versus time during levitation",
                        "show PD force command components",
                        "show phase currents during levitation period",
                        "repeat levitation with motoring current",
                        "show x position during levitation with motoring current",
                        "show phase currents while levitating with motoring current",
                        "discuss de-rating motor from maximum power level",
                        "introduce conical motor with two stators and rotor",
                        "describe control system for conical motor",
                        "show force vectors possible with different pole pair systems",
                        "describe axial force control block"
                    ],
                    "num_characters": 19293,
                    "outline_medium": [
                        "illustrate cylindrical motor control system",
                        "describe advantages of new control system",
                        "introduce winding configuration with individually stimulated pole pairs",
                        "transform phase currents into rotor reference frame",
                        "describe force produced on rotor by d-axis current",
                        "plot force components in x and y directions",
                        "show force vectors possible with different pole pairs",
                        "develop control system using force vectors",
                        "calculate phases of force vectors",
                        "transform desired force into basis of two force vectors",
                        "define currents making up boundary of region",
                        "generate mechanical model of rotor",
                        "describe system using differential equations",
                        "show controllability of system",
                        "define angular quantities",
                        "describe angular system using differential equations",
                        "show controllability of angular system",
                        "describe implementation of magnetic bearing controller",
                        "illustrate control system for conical motor"
                    ],
                    "outline_short": [
                        "describe cylindrical motor control system",
                        "illustrate winding configuration with individually stimulated pole pairs",
                        "derive rotor reference frame transformation",
                        "analyze force generation using rotor reference frame d-axis currents",
                        "develop control system for rotor levitation",
                        "generate mechanical model of rotor",
                        "design magnetic bearing controller",
                        "describe implementation of control system",
                        "generalize invention to other motor types and configurations"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A motor drive system comprising:\nan electrical motor having\ni) a stator with a core;\nii) a rotor supported for movement relative to the stator, and\niii) polyphase windings wound on the core, each polyphase winding being spatially separated by 360 electrical degrees;\n\na polyphase power supply for each of the polyphase stator windings, each polyphase power supply comprising a pole pair;\nan inner loop controller configured for controlling the polyphase power supply for each of the polyphase windings, the inner loop controller having a pole pair configured for controlling a rotor reference frame q-axis current and\na rotor reference frame d-axis current; and\nan outer loop controller configured for:\ni) determining torque and force requirements necessary for motoring and levitation (rotor lateral position control); and\nii) converting the torque and force requirements to appropriate commands for the rotor reference frame q-axis currents and the rotor reference frame d-axis currents for each of the polyphase systems,\n\nwhereby the rotor reference frame d-axis current commands and the rotor reference frame q-axis currents commands are sent to the inner loop control.",
        "2. The motor drive system of claim 1, wherein the 360 electrical degrees span exactly one of the motor pole pairs.",
        "3. The motor drive system of claim 1, wherein the rotor has the same number of poles as the stator.",
        "4. The motor drive system of claim 1, wherein each polyphase winding is separated by 360 electrical degrees, whereby each winding is configured to interact with exactly one of the motor pole pairs.",
        "5. The motor drive system of claim 1, wherein each polyphase winding which spans one pole pair has one terminal per phase by which power can be applied.",
        "6. The motor drive system of claim 5 wherein the polyphase windings have “n” phases, where “n” is an integer greater than 1.",
        "7. The motor drive system of claim 6, wherein, when “n” is equal to two, each phase in every two-phase winding is exactly the same but spatially separated by 90 electrical degrees.",
        "8. The motor drive system of claim 6, wherein, when “n” is greater than two, each phase in the polyphase windings is exactly the same but spatially separated by 360/n electrical degrees.",
        "9. The motor drive system of claim 6, wherein the “n” phase stationary reference frame is transformed to a two-phase rotating reference frame.",
        "10. The motor drive system of claim 6, wherein, when the “n” polyphase currents are transformed into a two-phase rotating reference frame, a first phase is aligned with rotor flux, which is the rotor reference frame d-axis current; and a second phase is aligned 90 electrical degrees to the rotor reference frame d-axis current, which is the rotor reference frame q-axis current.",
        "11. The motor drive system of claim 1, wherein each pole pair has an independent rotor reference frame q-axis current and an independent rotor reference frame d-axis current, whereby different a rotor reference frame q-axis flux and a different rotor reference frame d-axis flux are created for each polyphase system.",
        "12. The motor drive system of claim 1, wherein an imbalance of d-axis flux creates a lateral force on the rotor.",
        "13. The motor drive system of claim 1, wherein a d-axis flux requirement is imposed on all pole pairs for motoring, and d-axis flux is added or subtracted to each polyphase pole pair system to create a desired lateral force on the rotor.",
        "14. The motor drive system of claim 1, wherein the sum of all the q-axis flux creates a torque on the rotor.",
        "15. The motor drive system of claim 1, wherein the rotor reference frame q-axis current and the rotor reference frame d-axis current are not directly controlled, such that the q-axis current and the d-axis current do not have an explicit control loop, but are indirectly controlled, since the motor torque and stator flux are directly controlled;\nwherein constant motor torque and stator flux produce constant rotor reference frame q and d axis currents.",
        "16. The motor drive system of claim 1, wherein, when energy is converted from electrical energy to mechanical energy, the motor drive system is motoring.",
        "17. The motor drive of claim 1, wherein, when energy is converted from mechanical energy to electrical energy, the motor drive system is generating.",
        "18. The motor drive system of claim 1, wherein the lateral force is a levitating force which is directed in the radial direction for a radial motor, in the axial direction for an axial motor, and in both the radial and axial directions for a conical motor.",
        "19. The motor drive system of claim 1, wherein the lateral force is a levitating force which has components in both the radial and axial directions.",
        "20. The motor drive system of claim 1, wherein the outer loop controller is configured to control radial position.",
        "21. The motor drive system of claim 1, wherein the rotor radial position is determined and subtracted from a desired position to determine position error, wherein a controller determines the force necessary to force this error to zero, and wherein the force is translated to current commands for the inner loop.",
        "22. The motor drive system of claim 22, wherein the position error is forced to zero with PID control.",
        "23. The motor drive system of claim 1, wherein the rotor has permanent magnets which create the same number of poles as the stator.",
        "24. The motor drive system of claim 1, wherein the rotor is an induction motor type, wherein magnetic flux, induced by the difference of frequency of the stator current and the rotor current, has the same number of poles as the stator.",
        "25. The motor drive system of claim 1, wherein a magnetic circuit of a pole pair and the rotor has periodic varying magnetic reluctance.",
        "26. The motor drive system of claim 1, wherein the rotor has wound coils with the same number of poles as the stator.",
        "27. The motor drive of claim 1, wherein the stator windings are concentrated, one coil per phase.",
        "28. The motor drive of claim 1, wherein the stator windings are distributed, having multiple coils per phase.",
        "29. The motor drive of claim 1, wherein the stator is wound with six poles and the rotor has a six pole structure.",
        "30. The motor drive system of claim 1, wherein the outer loop controller uses six force vectors which are generated by applying rotor reference frame d-axis current to the three pole pairs in a positive or negative manner, to generate a desired arbitrary force.",
        "31. The motor drive system of claim 31, wherein the angle of the radial component of each of the available six vectors is calculated.",
        "32. The motor drive system of claim 32, wherein two of the available vectors are used to create a force on the rotor.",
        "33. The motor drive of system claim 33, wherein a desired arbitrary force is converted from the vector basis to two rotor reference frame d-axis currents.",
        "34. The motor drive system of claim 34, wherein the desired arbitrary force is given by its x and y components and converted to two rotor reference frame d-axis currents.",
        "35. The motor drive system of claim 1, wherein the desired force includes an axial component, and wherein the axial force is created by adding an equal amount of rotor reference frame d-axis current to each of the three phase pole pair systems.",
        "36. The motor drive system of claim 1, wherein the power supply is a plurality three-phase inverters comprised of a plurality of switches for controlling the flow of phase current.",
        "37. The motor drive system of claim 1, wherein the power supply is three three-phase inverters comprised of eighteen switches.",
        "38. A five axis suspended bearingless motor drive system comprising:\na plurality of motor drives that share a common rotor structure;\nan integrated position controller controlling five position quantities; and\nan integrated motoring controller.",
        "39. The motor drive system of claim 38, wherein two motors of conical shape, which produce axial force in opposite directions, are placed on a common rotor structure.",
        "40. The motor drive system of claim 38, wherein a desired net force in the axial direction is achieved by having a different sum of rotor reference frame d-axis currents on each motor.",
        "41. The motor drive system of claim 38, wherein the five axes are defined as the rotor center for a plane intersecting the first motor, in x1 and y1 Cartesian coordinates, and a rotor center at a plane intersecting the second motor, in x2 and y2 Cartesian coordinates, and a distance that the rotor is moved off center axially, defined as z.",
        "42. The motor drive system of claim 38, wherein the five axes are the x and y positions of the center of mass, the two tilt angles about the axes perpendicular to the axis or rotation running through the center of mass, and the displacement of the rotor in the axial direction."
    ]
}