{
    "id": "https://semopenalex.org/work/W2049778368",
    "authors": [
        "Nozomu Saito",
        "Teruo Umemoto",
        "Lloyd M Garrick"
    ],
    "title": "Discovery of practical production processes for arylsulfur pentafluorides and their higher homologues, bis- and tris(sulfur pentafluorides): Beginning of a new era of “super-trifluoromethyl” arene chemistry and its industry",
    "date": "2012-03-29",
    "abstract": "Various arylsulfur pentafluorides, ArSF 5 , have long been desired in both academic and industrial areas, and ArSF 5 compounds have attracted considerable interest in many areas such as medicines, agrochemicals, and other new materials, since the highly stable SF 5 group is considered a “super-trifluoromethyl group” due to its significantly higher electronegativity and lipophilicity. This article describes the first practical method for the production of various arylsulfur pentafluorides and their higher homologues, bis- and tris(sulfur pentafluorides), from the corresponding diaryl disulfides or aryl thiols. The method consists of two steps: (Step 1) treatment of a diaryl disulfide or an aryl thiol with chlorine in the presence of an alkali metal fluoride, and (step 2) treatment of the resulting arylsulfur chlorotetrafluoride with a fluoride source, such as ZnF 2 , HF, and Sb(III/V) fluorides. The intermediate arylsulfur chlorotetrafluorides were isolated by distillation or recrystallization and characterized. The aspects of these new reactions are revealed and reaction mechanisms are discussed. As the method offers considerable improvement over previous methods in cost, yield, practicality, applicability, and large-scale production, the new processes described here can be employed as the first practical methods for the economical production of various arylsulfur pentafluorides and their higher homologues, which could then open up a new era of “super-trifluoromethyl” arene chemistry and its applications in many areas.",
    "sections": [
        {
            "title": "Introduction",
            "paragraphs": [
                "Pentafluorosulfanyl (SF5) is considered a “super-trifluoromethyl group” as SF5 has the peculiarity of fluorine beyond a trifluoromethyl (CF3) group [1]. Arylsulfur pentafluorides (ArSF5) are very thermally and chemically stable [2]. Pioneering work by Sheppard half a century ago on the synthesis and properties of arylsulfur pentafluorides revealed that the SF5 group has absolutely unique properties [2–3]. SF5 is more electronegative (Hammet constants σI: +0.55 for SF5; +0.39 for CF3) [2] and more lipophilic than CF3 (Hansch hydrophobicity constants π: 1.51 for SF5; 1.09 for CF3) [4]. The high electronegativity results in high polarity in molecules. Thus, it is of significant note that there is no functional group other than SF5 that has both high electronegativity and high lipophilicity, because the two natures are generally in conflict. In addition, SF5 has high hydrolytic stability, which equals or exceeds CF3 [2]. These extraordinary properties render SF5 compounds highly attractive particularly in medicinal [5–14], agrochemical [15–18], and new material [19–23] chemistry and industry. However, there have been no practical, economical methods for the production of arylsulfur pentafluorides. In comparison, trifluoromethyl arenes (ArCF3) have grown into a significantly large field in chemistry and industry since their practical two-step production method was developed in the 1930s through to the 1940s. The first step was chlorination of ArCH3 to ArCCl3 with Cl2 and the second step was its conversion to ArCF3 with HF or SbF3 [24–26]. A large number of trifluoromethyl arenes are currently produced on a large scale and used in many areas such as medicines, agrochemicals, dyes, materials for electronics, and others [27–30]. Accordingly, many chemists have long desired to have easy access to the “super-trifluoromethyl” arenes; however, there have been no economical methods for their production until now.",
                "In 1961, Sheppard first reported the synthesis of phenylsulfur pentafluoride by stepwise fluorination of diphenyl disulfide with expensive silver difluorides (AgF2) in a fluorocarbon solvent [3]. However, the yield was only 9%. Since then, many substituted phenylsulfur pentafluorides have been prepared by this method, but still with very low yields [3,20,31–32]. In 2000, a new method using molecular fluorine (F2) was reported [33]. Thus, bis(p- or m-nitrophenyl) disulfide was treated with F2 diluted with nitrogen (F2:N2 = 1:9 v/v) at low temperature in acetonitrile to give the nitrophenylsulfur pentafluoride in ca. 40% yield. However, in addition to the low yields, this method requires F2, which is a highly toxic, corrosive and explosive gas, and it applies only for the case of electron-deficient nitrophenylsulfur pentafluorides, due to the extremely high reactivity of F2. These factors significantly limited the scope and application of this method. Another method reported used expensive xenon difluoride to fluorinate diphenyl disulfide giving phenylsulfur pentafluoride, but its yield was only 25% [34].",
                "Multiple-step methods have previously been developed for the preparation of arylsulfur pentafluorides. In 1964, it was reported that the reaction of sparsely available and toxic gaseous SF5Cl with acetylene, followed by bromination, dehydrobromination, and reduction with zinc, giving pentafluorosulfanylacetylene (HC≡CSF5), which was then reacted with butadiene, followed by an aromatization reaction at very high temperature, gave phenylsulfur pentafluoride [35]. Recently, phenylsulfur pentafluoride was prepared by reaction of 1,4-bis(acetoxy)-2-cyclohexene with SF5Br under 250 W sunlamp irradiation, followed by dehydrobromination and then aromatization reactions [36]. A triethylborane-catalyzed reaction of 4,5-dichloro-1-cyclohexene with SF5Cl followed by dehydrochlorination has also been reported [37]. The multistep method has recently been extended to the preparation of 2-naphthylsulfur pentafluoride and heteroarylsulfur pentafluorides [22,38–41].",
                "5-Nitrophenyl-1,3-bis(sulfur pentafluoride) was prepared by reaction of the corresponding polymeric disulfide with AgF2 in 12% yield [3]. Two isomers of phenyl tris(sulfur pentafluorides) were synthesized by many steps starting from the reaction of SF5Cl with acetylene via HC≡CSF5 [42]. Complex Co(CO)4(HC≡CSF5) derived from HC≡CSF5 and Co2(CO)8 was decomposed in the presence of Br2 to give phenyl-1,2,4-tris(sulfur pentafluoride). Photoreaction of HC≡CSF5 in the presence of SF5Cl gave phenyl-1,3,5-tris(sulfur pentafluoride), but in low yield (19%) [42].",
                "All of the previous methods described above suffer from multiple drawbacks of low yields, the necessity of costly and dangerous fluoro-reagents, and the quite limited scope and applicability. In response to these, we now report practical, inexpensive, and widely applicable methods suitable for the large-scale production of arylsulfur pentafluorides and their higher homologues, which have the potential to open up a new era of sulfur pentafluoride chemistry and its industry. These new methods have been described in patents and patent applications [43–48]."
            ],
            "subsections": []
        },
        {
            "title": "Results And Discussion",
            "paragraphs": [
                "Recently we synthesized various arylsulfur trifluorides (ArSF3) by treatment of diaryl disulfides with chlorine in the presence of potassium [49–50] or cesium fluoride [50] and thus discovered 4-tert-butyl-2,6-dimethylphenylsulfur trifluoride (Fluolead reagent) as an excellent fluorinating agent with high thermal stability, ease of handling, and wide applicability [50–51]. During the research, we unexpectedly discovered that an arylsulfur chlorotetrafluoride (ArSF4Cl) is formed when a diaryl disulfide is treated with an excess of chlorine in the presence of an excess of the alkaline metal fluoride. Janzen et al. reported that cis- and trans-phenylsulfur chlorotetrafluoride and its p-methyl- and p-nitro-derivatives were formed by reaction of diaryl disulfide with XeF2 and tetraethylammonium chloride [52]. However, the physical properties of the arylsulfur chlorotetrafluorides were not determined since they were not isolated, presumably because the chlorotetrafluorides were considered to be unstable. Instead, their chemical structures were assigned by 19F- and 13C NMR spectroscopy of the reaction solution.",
                "Arylsulfur chlorotetrafluorides were prepared in high yield by the reactions of diaryl disulfides with an excess amount of chlorine (ca. 7 mol or more per mole of the disulfide) in the presence of an excess amount of potassium or cesium fluoride (ca. 16 mol or more per mole of the disulfide) in dry acetonitrile at ice-bath temperature to room temperature. Although conventionally dried and powdered potassium fluoride can be used satisfactorily, spray-dried potassium fluoride, having a large surface area, is preferable. The normal dry potassium fluoride must be used in greater quantities than the spray-dried potassium fluoride. When the reaction is not taken to completion, the distilled product (ArSF4Cl) is contaminated with its intermediate ArSF3. By this method, many arylsulfur chlorotetrafluorides 2a–o having different substituents on the aromatic ring were prepared, as summarized in Scheme 1 and Table 1. The products were trans isomers, except for in the case of polyfluorinated arylsulfur chlorotetrafluorides, which formed a mixture of trans and cis isomers. The products were distilled under reduced pressure or crystallized and then characterized.",
                "Arylsulfur chlorotetrafluorides having an electron-donating alkyl group, such as methyl or tert-butyl, or an electron-withdrawing substituent, such as a halogen atom, a nitro-, or a methanesulfonyl group, were prepared in good to high yields from the corresponding diaryl disulfides. 2-Fluoro and 2,6-difluorophenylsulfur chlorotetrafluoride were formed in high yields due to the small steric effect of fluorine atom(s). However, bis(2-bromophenyl) disulfide gave a 11:1 mixture of 2-bromophenylsulfur trifluoride and chlorotetrafluoride. 2-Bromophenylsulfur chlorotetrafluoride was a minor product due to the steric hindrance of the relatively large bromo substituent at the ortho position. Arylsulfur chlorotetrafluorides were also prepared from the corresponding aryl thiols in high yields, as shown in runs 2 and 4, Table 1.",
                "The method using aryl thiols as starting materials was successfully applied to the preparation of aryl bis- and tris(sulfur chlorotetrafluorides) as shown in Scheme 2 and Table 2. The method using the corresponding polymeric disulfides did not work well because of their extremely low solubility.",
                "The reaction of a diaryl disulfide with Cl2 and KF is given as Equation 1. Per 1 mol of a diaryl disulfide, 5 mol of Cl2, and 8 mol of KF are theoretically consumed.",
                "Scheme 3 shows a postulated reaction mechanism, which consists of six steps including intermediates 4, 5, 6, 7 and 8. Treatment of p-nitrophenylsulfenyl chloride with Cl2/KF gave p-nitrophenylsulfur chlorotetrafluoride in 76% yield. Treatment of phenylsulfur trifluoride with Cl2/KF gave phenylsulfur chlorotetrafluoride in 84% yield. These results support the hypothesis that arylsulfenyl chloride 4 and trifluoride 7 are intermediates for the reaction of diaryl disulfide giving arylsulfur chlorotetrafluoride.",
                "In a typical reaction of diphenyl disulfide, an orange color appears immediately as chlorine (Cl2) gas is introduced into a mixture of Ar2S2 and KF in acetonitrile. Cl2 is absorbed as fast as it is introduced until ArSF3 7 is formed, at which point the solution becomes colorless. 19F NMR analysis of the reaction mixture at this moment confirms the formation of 7. After that, the absorption of Cl2 becomes slow. Thus, the sequence of steps 1 to 4 giving 7 is fast, while the sequence of steps 5 and 6 giving the final product 2 is slow. The slow reaction is probably due to an equilibrium reaction (step 5) between 7 and 8. The reaction of aryl thiol as a starting material is similar to that of the disulfide 1 since aryl thiol reacts with Cl2 to form disulfide 1.",
                "The arylsulfur chlorotetrafluorides 2a–j and bis(sulfur chlorotetrafluorides) 2p′ and 2q′ obtained were trans-isomers, while the polyfluorinated 2k–o, bromo and polyfluoro bis(sulfur chlorotetrafluorides) 2r′–t′, and tris(sulfur chlorotetrafluoride) 2u′ were a mixture of trans- and cis-configuration. Since we did not observe any isomerization at room temperature or upon distillation, it is reasonable to conclude that each isomer was formed through each isomeric salt of 8 as shown in Scheme 4. The multifluoro derivatives 2o and 2t′ have the highest ratio of cis-configuration. This suggests that the relative stability of the cis-isomeric salts 8 increases particularly with increased fluorine substitution. The high ratio of cis-configuration of 2u′ suggests the ability of electron-withdrawing groups, such as –SF4Cl, to stabilize the cis-configuration salt form.",
                "It is noticeable that, except for the polyfluorinated compounds and others discussed above, trans-isomeric ArSF4Cl was exclusively formed by the reactions of Ar2S2 with Cl2/KF, while the reactions of Ar2S2 with XeF2/Et4NCl gave a mixture of cis- and trans-isomers according to Janzen's report [52]. Janzen proposed radical reactions with Cl· species [52]. The Cl2/KF reactions are ionic in nature, in which trans-form salts 8 exclusively form and react with Cl2 to give the trans-isomers.",
                "Arylsulfur chlorotetrafluorides are stable during long periods of storage in a fluoropolymer vessel at room temperature. We did not observe any isomerization between trans- and cis-isomers on standing. Whereas arylsulfur trifluorides are extremely sensitive to moisture (water) [50,53], with the exception of the Fluolead reagent [50], arylsulfur chlorotetrafluorides are relatively insensitive to moisture. The half life time of decomposition of phenylsulfur chlorotetrafluoride (2a) in a CDCl3 solution (≈1.2 mol/L) on direct contact with water was 300 to 500 min at room temperature. The tracing experiment was conducted with a NMR tube. The 19F NMR was measured by using an internal standard (p-chlorobenzotrifluoride) and the NMR tube was shaken between the measurements. Gas chromatography (GC) could not be used because of decomposition of arylsulfur chlorotetrafluorides in the GC column. When a few drops of D2O were added to a solution of 2a in CD3CN (1 mL), 2a decomposed in 1 h and the decomposition product was phenylsulfonyl chloride. Phenylsulfonyl fluoride was detected in a trace amount (≤1%) by GC–mass analysis.",
                "Arylsulfur chlorotetrafluorides 2 have relatively high thermal stability. Thus, 2a did not decompose during 134 hours at 100 °C or 48 h at 150 °C in a Teflon tube. The isomerization of the trans- to the cis-isomer occurred very slowly. A very small amount (3–4%) of the cis-isomer was formed after heating of 2a (trans-isomer) at 150 °C for 48 h. The real thermal decomposition temperatures of 2 could not be determined by a differential scanning calorimeter (DSC), because 2 reacted with the cell materials, i.e., stainless steel and gold, at elevated temperature due to their strongly oxidizing effect on the hexavalent sulfur(VI) element. Many arylsulfur chlorotetrafluorides were measured with DSC and these are discussed in Supporting Information File 1.",
                "We examined reaction conditions for the conversion of trans-PhSF4Cl (2a) to PhSF5 (3a) with various reactive fluorides using an approximately one-gram scale of 2a, as seen in Table 3. Janzen et al. described in the experimental section that bubbling an excess of BF3 into a mixture of cis- and trans-2a in CD2Cl2 at 25 °C led to the gradual disappearance of 2a and the formation of PhSF5 (3a) [52]. We conducted the reaction of trans-2a (isolated) with BF3 in a sealed reactor and found that all the starting material became a solid residue, probably a polymer (run 1, Table 3). The reaction in dichloromethane solvent resulted in only a 28% yield of 3a (run 2). The use of HBF4·OEt2 at room temperature provided a better yield (40%) (run 3). A strong Lewis acid SbF5 led to polymeric product, but SbF3 at 80 °C gave 33% (run 4). A combination of SbF3/SbCl5(cat.) at room temperature provided a better yield (54%) (run 5). At 80 °C, transition-metal fluorides TiF4 and CuF2 afforded 35 and 57%, respectively (runs 7, 8). Finally, we found that inexpensive and easily handled ZnF2 produced 3a in high yield (runs 9, 10).",
                "A 19F NMR tracing experiment of the conversion reaction of trans-PhSF4Cl (trans-2a) provided some information on the reaction mechanism. With HBF4·OEt2, it was observed that the molar ratio of trans-2a:cis-2a:PhSF5 was 156:172:100 in the reaction mixture after 7 h, and 3:6:100 after 21 h. With ZnF2, the ratio observed was 22:117:100 during the reaction. A considerable amount of the cis-isomer was formed as an intermediate. It may thus be suggested that there are two routes, a direct route of the trans-isomers to the SF5 products and an indirect route via cis-isomers. The experiment with HBF4·OEt2 or ZnF2 may be considered to be thermal isomerization of trans-2a to cis-2a with an acid catalyst, suggesting that the cis-isomer is more thermodynamically stable than the trans-isomer. With ZnF2/SbCl5 the cis-isomer was barely detected (run 11, Table 3). The ratio of trans-2a:cis-2a:PhSF5 was 385:0:100 after 10 min; 63:trace:100 after 1.5 h; 34:trace:100 after 3 h; and 18:2:100 after 17 h. Thus, the lack of detectable cis-isomer may suggest that the addition of a strong Lewis acid such as SbCl5 gives priority to the direct route. However, we cannot rule out the possibility that the conditions could very quickly convert the cis-isomer to the product.",
                "The method with ZnF2 was applied to 10–50 gram scale reactions of PhSF4Cl (2a) and its derivatives 2b,d,e–i,k (Scheme 5). A fluoropolymer reactor charged with the reactants (ArSF4Cl and ZnF2) was heated under the pressure of a balloon filled with N2 gas (no flow of N2). The reaction conditions and yields are shown in Table 4. Liquid 2a,b,d–f,h efficiently reacted with solid ZnF2 (powder) under stirring without solvent. The two fluorine atoms of ZnF2 were effectively consumed for the reaction. 2a and monohalogenated 2d–h were converted to the corresponding products 3 in good to high yields at 120 °C (bath temperature). It was observed that the start of the exothermic reaction of halogenated 2f was significantly delayed compared to that of unsubstituted 2a. p-Methyl-2b reacted with ZnF2 at 90 °C (run 2). p-Nitro-2i and 2,6-difluoro-2k required a high temperature of 150 °C or more and their yields were fair to poor (runs 8 and 9). Thus, the electron-donating substituents increase the reactivity of –SF4Cl, while the electron-withdrawing ones decrease it.",
                "It was found that the product p-chloro-3f obtained after distillation (run 5, Table 4) was contaminated (3%) with p-dichlorobenzene (major) and trichlorobenzene (minor), which were formed by cleavage of the C–S bond, in the case of the major byproduct, and further chlorination, in the case of the minor one, during the reaction. The complete removal of the byproducts from 3f was difficult due to similar boiling points. We found that the byproducts were suppressed by the addition of a strong Lewis acid AlCl3 and that the addition of ZnCl2 modified the exothermic reaction of 2f with ZnF2. The addition of AlCl3 decreased the reaction temperature and the addition of ZnCl2 probably helped to form reactive “ZnFCl” species. Finally the byproduct was restricted to less than 1% with ZnF2/ZnCl2/AlCl3 (molar ratio 100:10:5). The detailed experimental procedure is described in Supporting Information File 1.",
                "The reaction of PhSF4Cl (2a) with ZnF2 in Table 4 was conducted under nonflowing N2 gas (under the pressure of a N2 balloon). When the reaction of 2a was conducted under a flow of N2 gas, the reaction rate became low. We then examined the reaction conditions for 2a in more detail and found that the reaction was dependent upon the atmosphere of the reaction mixture. While the reaction conducted under a N2 balloon (no flow of N2) was completed in 4 h in 88% yield, the reaction conducted under a flow of N2 (through a reactor) was not completed in 5 h and its yield was down to 67%. With a faster flow of N2, it became slower and the yield decreased. Apparently, a small amount of gas was generated at the beginning of the reaction. The gas was not analyzed because of experimental difficulty. Therefore, it was most likely that removal of the gas by the flow of N2 gas made the reaction slow. Surprisingly, when the reactor was filled with Cl2 gas, the reaction was completed in a short time (1.7 h) and its yield was very high (92%). Thus, the presence of Cl2 significantly accelerated the reaction rate and increased the yield. We assumed that one of the effects of the Cl2 atmosphere may be to inhibit a possible disproportionation reaction [2PhSF4Cl (2a) → PhSF5 + PhSF3 + Cl2 ↑], as the disproportionation leads to the formation of Cl2. Although it remains unclear as to why Cl2 accelerated the reaction, Cl2 may also activate ZnF2 or intermediate “ZnFCl” species.",
                "Interestingly, this Cl2 atmosphere was effective for the reaction of the p-methyl derivative 2b with ZnF2, but not for the p-chloro derivative 2f. The reaction of 2f with ZnF2 was not affected by N2 flow. As it is known that sulfur-related disproportionation, for instance arylsulfinic acid giving arylsulfonic acid and S-aryl arylthiosulfonate ester, is retarded by an electron-withdrawing group [55], it may thus be suggested that an electron-withdrawing substituent limits the disproportionation. Possibly the electron-withdrawing substituent lowers the disproportionation rate or increases the temperature necessary for disproportionation such that it is greater than that required for the replacement reaction of –SF4Cl to –SF5.",
                "The method with easily handled and inexpensive ZnF2 under a Cl2 atmosphere was successfully applied to a large-scale production (≈0.5 kg) of 3a from 2a, in which the addition method was adopted and a small amount of product 3a was used as the reaction solvent. This procedure is described in Supporting Information File 1.",
                "In contrast, anhydrous hydrogen fluoride (HF) is not easy to handle under normal laboratory conditions due to its high toxicity. However, in industry, in addition to its availability as a cheap fluorine source, the gaseous or liquid nature of HF (bp 19 °C) is quite suitable for large-scale industrial processes due to its ease in transfer, recovery and recycling.",
                "2a satisfactorily reacted with HF at less than its boiling point to produce 3a along with the evolution of hydrogen chloride (Scheme 6). As seen in Table 5, this method has successfully been applied to various substituted arylsulfur chlorotetrafluorides. The products obtained by the method were of high purity (≥99%) except for the cases of methyl derivative 2b (runs 4–6). When the reaction of 2a was conducted with the addition of KHF2 (KF:HF = 1:1), the yield improved (run 3). KF suppressed the formation of impurities, such as polymeric residue and chlorinated byproducts, because basic KF neutralizes the strong acid HCl formed in the reaction.",
                "In run 4, the purity of product 3b was 91%, which was contaminated with 8% of 3-chloro-4-methylphenylsulfur pentafluoride (3b·Cl) as the main byproduct. Compound 3b·Cl was tentatively assigned by GC–mass analysis. When the reaction was conducted with the addition of KHF2, the purity greatly increased to 97% (run 5). The occurrence of an intermolecular side chlorination reaction was clearly demonstrated by the experiment of run 6 in which benzene was used as an additive. The distilled product 3b (purity 90%) was contaminated with p-dichlorobenzene (6%) and o-dichlorobenzene (3%) in addition to the byproduct 3b·Cl (1%). The dichlorobenzenes were formed by chlorination of the added benzene. Chlorobenzene formed in this reaction was contained in an initial distillation fraction, which was separated. The method of run 7 using both KHF2 and benzene as additives provided product 3b with 99% purity, as the formation of impurity 3b·Cl was completely suppressed. It is likely that the SF4Cl part of 2b acts as a chlorinating agent toward 3b, or another 2b and benzene, under the strong acidic conditions that are formed from the HCl generated in the anhydrous HF.",
                "As seen in runs 8–11, halogenated arylsulfur pentafluorides 3d–g of high purity (≥99%) were obtained in good isolated yields without any additive. The side reactions such as polymerization and chlorination are restrained, as the aromatic nuclei are deactivated by the electron-withdrawing effect of the halogen atoms.",
                "It was also found that when PhSF4Cl (2a) was treated with a 70:30 w/w mixture of HF–pyridine at 55 °C, it gave PhSF5 (3a) in 63% isolated yield (Scheme 7). The HF–pyridine reagent is a nonvolatile and easily handled chemical in the laboratory.",
                "Polyfluorinated arylsulfur chlorotetrafluorides 2k–o were smoothly converted to the corresponding sulfur pentafluorides 3k–o in good yields by treatment with a combination of SbF3 and a strong Lewis acid, such as SbF5 or SbCl5, as shown in Scheme 8 and Table 6.",
                "While treatment of 2,4,6-trifluoro-2m with a mixture of SbF3/SbF5 (4.5/1) gave 77% of product 3m (run 3, Table 6), treatment of 2m with SbF5 alone gave a byproduct (20%) in addition to 3m (60%). The byproduct was tentatively assigned as 3-chloro-2,4,6-trifluorophenylsulfur pentafluoride by 1H and 19F NMR and GC–mass analysis. The chlorination as a side reaction may occur from the action of a strong Lewis acid SbF5 on the fluorine atoms of the SF4Cl group of ArSF4Cl 2m, forming a [ArSF3Cl]+ [SbF6]− species (Ar = 2,4,6-trifluorophenyl), which may act as a strong chlorinating agent (Cl+) toward 3m or another molecule of 2m. Pentafluoro-2o was converted to 3o in good yield with a high molar ratio of SbF5 (run 5) as the reactivity of 2o was considerably decreased by the five fluorine atoms.",
                "Phenyl bis(sulfur chlorotetrafluorides) 2p′ and 2q′, bromo derivative 2r′, and fluoro derivatives 2s′ and 2t′ were smoothly converted to the corresponding bis(sulfur pentafluorides) 3p″–t″ in fair to good yields with SbF5 alone, as shown in Scheme 9 and Table 7 (runs 1–5). Phenyl tris(sulfur chlorotetrafluoride) 2u′ was converted to phenyl tris(sulfur pentafluoride) 3u″ in 55% yield under similar conditions (run 6, Table 7)."
            ],
            "subsections": []
        },
        {
            "title": "Conclusion",
            "paragraphs": [
                "We have developed the first practical and economical method for the production of various arylsulfur pentafluorides and their higher homologues, which consists of the treatment of diaryl disulfides or aryl thiols with chlorine in the presence of potassium or cesium fluoride, followed by treatment of the resulting arylsulfur chlorotetrafluorides with a fluoride, such as ZnF2, HF, and Sb(III/V) fluorides. The important characteristics of these new reactions were revealed and some reactions were modified to provide the products in high purity and in high yields. Since these methods are superior to the previous methods using AgF2, F2, or XeF2, or multiple-step methods starting from SF5Br or SF5Cl, in terms of cost, applicability, and scalability of production, the processes developed here can be used as the first practical and economical methods for the production of many kinds of arylsulfur pentafluorides. Thus, it is expected that this will lead to new and rapid advances in “super-trifluoromethyl” arene chemistry and associated industries in many areas."
            ],
            "subsections": []
        }
    ]
}