{
    "id": "US20130324765",
    "authors": [
        "Teruo Umemoto",
        "Norimichi Saito"
    ],
    "title": "Industrial Methods for Producing Arylsulfur Pentafluorides",
    "date": "2012-02-14 00:00:00",
    "abstract": "Industrial methods for producing arylsulfur pentafluorides are disclosed. Methods include reacting arylsulfur halotetrafluoride with hydrogen fluoride in the absence or presence of one or more additives selected from a group of fluoride salts, non-fluoride salts, and unsaturated organic compounds to form arylsulfur pentafluorides.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "The invention relates to industrial methods useful in the production of arylsulfur pentafluorides."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "relate to industrial methods"
                    ],
                    "num_characters": 98,
                    "outline_medium": [
                        "relate to industrial methods"
                    ],
                    "outline_short": [
                        "introduce industrial methods for arylsulfur pentafluorides production"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "Arylsulfur pentafluoride compounds are used to introduce one or more sulfur pentafluoride groups into various commercial organic molecules. In particular, arylsulfur pentafluorides are useful (as product or intermediate) in the development of liquid crystals (Eur. J. Org. Chem. 2005, pp. 3095-3100) and as bioactive chemicals such as fungicides, herbicides, insecticides, paraciticides, anti-cancer drugs, enzyme inhibitors, antimalarial agent, and other like materials [see, for example, J. Pestic. Sci., Vol. 32, pp. 255-259 (2007); Chimia Vol. 58, pp. 138-142 (2004); ChemBioChem 2009, 10, pp. 79-83; Tetrahedron Lett. Vol. 51 (2010), pp. 5137-5140; J. Med. Chem. 2011, Vol. 54, pp. 3935-3949; J. Med. Chem. 2011, Vol. 54, pp. 5540-5561; WO 99/47139; WO 2003/093228; WO 2006/108700 A1; US 2005/0197370; U.S. Pat. No. 7,381,841 B2; US 2008/176865; U.S. Pat. No. 7,446,225 B2; WO 2010/138588 A2; WO 2011/44184].",
                        "Arylsulfur pentafluorides have been synthesized using one of the following synthetic methods: (1) fluorination of diaryl disulfies or arylsulfur trifluoride with AgF2 [see J. Am. Chem. Soc., Vol. 82 (1962), pp. 3064-3072, and J. Fluorine Chem. Vol. 112 (2001), pp. 287-295]; (2) fluorination of bis(nitrophenyl) disulfides, nitrobenzenethiols, or nitrophenylsulfur trifluorides with molecular fluorine (F2) [see Tetrahedron, Vol. 56 (2000), pp. 3399-3408; Eur. J. Org. Chem., Vol. 2005, pp. 3095-3100; and U.S. Pat. No. 5,741,935]; (3) fluorination of diaryl disulfides or arenethiols with F2, CF3OF, or CF2(OF)2 in the presence or absence of a fluoride source (see US Patent Publication No. 2004/0249209 A1); (4) fluorination of diaryl disulfides with XeF2 [see J. Fluorine Chem., Vol. 101 (2000), pp. 279-283]; (5) reaction of 1,4-bis(acetoxy)-2-cyclohexene with SF5Br followed by dehydrobromination or hydrolysis and then aromatization reactions [see J. Fluorine Chem., Vol. 125 (2004), pp. 549-552]; (6) reaction of 4,5-dichloro-1-cyclohexene with SF5Cl followed by dehydrochlorination [see Organic Letters, Vol. 6 (2004), pp. 2417-2419 and PCT WO 2004/011422 A1]; and (7) reaction of SF5Cl with acetylene, followed by bromination, dehydrobromination, and reduction with zinc, giving pentafluorosulfanylacetylene, which was then reacted with butadiene, followed by an aromatization reaction at very high temperature [see J. Org. Chem., Vol. 29 (1964), pp. 3567-3570].",
                        "Each of the above synthetic methods has one or more drawbacks making it either impractical (time and/or yield), overly expensive, and/or overly dangerous to practice. For example, synthetic methods (1) and (4) provide low yields and require expensive reaction agents, e.g., AgF2 and XeF2. Methods (2) and (3) require the use of F2, CF3OF, or CF2(OF)2, each of which is a toxic, explosive, and/or corrosive gas, and products produced using these methods are at a relatively low yield. Note that handling of these gasses is expensive from the standpoint of production, storage and use. In addition, synthetic methods that require the use of F2, CF3OF, and/or CF2(OF)2 are limited to the production of deactivated arylsulfur pentafluorides, such as nitrophenylsulfur pentafluorides, due to their extreme reactivity, which leads to side-reactions such as fluorination of the aromatic rings when not deactivated. Methods (5) and (6) also require expensive reactants, e.g., SF5Cl or SF5Br, and have narrow application because the starting cyclohexene derivatives have limited availability. Finally, method (7) requires an expensive reactant, SF5Cl, and this method includes numerous steps to reach the arylsulfur pentafluorides (timely and low yield).",
                        "As discussed above, conventional synthetic methodologies for the production of arylsulfur pentafluorides have proven difficult and are a concern within the art.",
                        "Recently, useful methods have been developed for solving the problems discussed above (see WO 2008/118787 A1; WO2010/014665 A1; US 2010/0130790 A1; US 2011/0004022 A1; U.S. Pat. No. 7,592,491 B2; U.S. Pat. No. 7,820,864 B2; U.S. Pat. No. 7,851,646 B2). One of the key steps described in each of these methods is the reaction of an arylsulfur halotetrafluoride with a fluoride source such as various fluorides compounds including elements found in groups 1, 2, 13-17 and transition elements of the Periodical Table. In particular, hydrogen fluoride is a useful fluoride source for the industrial process because of its availability and low cost, and in addition, its liquid nature having a boiling point 19° C. The liquid nature of hydrogen fluoride is suitable for large scale industrial processes because of its transportability, fluidity, and recyclability compared to solids, such as the fluorides of transition elements. However, methods using hydrogen fluoride still have several drawbacks, including: (1) as hydrogen fluoride is severely toxic, the amount of hydrogen fluoride used for a reaction must be minimized for safety and for the sake of the environment; (2) there is evolution of a large amount of a gaseous, toxic, corrosive hydrogen halide such as HCl (bp of HCl, −85° C.) from the reaction of an arylsulfur halotetrafluoride and hydrogen fluoride; (3) in some cases, a low yield or less purity of the product is obtained, because byproducts such as chlorinated arylsulfur pentafluorides are formed by side-reactions. These drawbacks cause significant cost problems in the industrial production of arylsulfur pentafluorides.",
                        "The present invention is directed toward finding more suitable methods to produce arylsulfur pentafluorides in an industrial scale and overcoming one or more of the problems discussed above."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce arylsulfur pentafluoride compounds",
                        "describe uses of arylsulfur pentafluorides",
                        "list prior synthetic methods",
                        "describe drawbacks of prior methods",
                        "motivate need for new methods",
                        "describe recent developments",
                        "highlight key step in recent methods",
                        "discuss advantages of hydrogen fluoride",
                        "describe drawbacks of using hydrogen fluoride",
                        "motivate present invention",
                        "preview present invention"
                    ],
                    "num_characters": 5630,
                    "outline_medium": [
                        "introduce arylsulfur pentafluoride compounds",
                        "describe prior art synthetic methods",
                        "limitations of prior art synthetic methods",
                        "recent developments in synthetic methods",
                        "drawbacks of recent developments"
                    ],
                    "outline_short": [
                        "summarize arylsulfur pentafluorides applications",
                        "limitations of conventional synthetic methodologies"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [
                        "Embodiments of the present invention provide a method suitable for the industrial production of arylsulfur pentafluoride, as represented by formula (I):",
                        "arylsulfur halotetrafluoride having a formula (II), shown below, is reacted with anhydrous hydrogen fluoride (HF) to form arylsulfur pentafluoride (formula I): a molar ratio of the arylsulfur halotetrafluoride to the anhydrous hydrogen fluoride (the arylsulfur halotetrafluoride/the anhydrous hydrogen fluoride) is in the range of about 1/10 to about 1/150.",
                        "Embodiments of the present invention also provide methods for producing arylsulfur pentafluoride (formula I), in which arylsulfur halotetrafluoride is reacted with hydrogen fluoride in the presence of an additive to form arylsulfur pentafluoride. The additive is selected from a group consisting of fluoride salts having a formula, M+F−(HF)n, non-fluoride salts having a formula, M+Y−, and organic compounds having one or more unsaturated bonds (in a molecule).",
                        "These and various other features as well as advantages which characterize embodiments of the invention will be apparent from a reading of the following detailed description and a review of the appended claims."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "embody method for industrial production",
                        "describe embodiments of present invention"
                    ],
                    "num_characters": 1185,
                    "outline_medium": [
                        "provide industrial method for arylsulfur pentafluoride production"
                    ],
                    "outline_short": [
                        "embodiment of industrial method for arylsulfur pentafluoride production"
                    ]
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS",
                    "paragraphs": [
                        "Embodiments of the present invention provide industrially useful methods for producing arylsulfur pentafluorides, as represented by formula (I). Prepared arylsulfur pentafluorides can be used, for among other things, to introduce one or more sulfur pentafluoride (SF5) groups into various target organic compounds. As noted in the Background of the present disclosure, these target organic molecules, after introduction of the one or more sulfur pentafluoride groups, are useful as medicines, agrochemicals or liquid crystals. The methods of the invention provide an industrial, cost-effective method for producing arylsulfur pentafluorides of high purity and in high yield. The target organic compounds for purposes of the present disclosure typically include at least one target substitution site for modification by an SF5.",
                        "Embodiments of the invention include a method which comprises reacting an arylsulfur halotetrafluoride, represented by formula (II), with hydrogen fluoride to form the arylsulfur pentafluoride having a formula (I), in which a molar ratio of an arylsulfur halotetrafluoride/hydrogen fluoride is in the range of about 1/10 to about 1/150, preferably about 1/15 to about 1/100, and furthermore, about 1/15 to about 1/50 (see for example Scheme 1, Process I).",
                        "With regard to the compounds of formulas (I) and (II): substituents R1, R2, R3, R4, and R5 each is independently a hydrogen atom; a halogen atom that is a fluorine atom, a chlorine atom, a bromine atom, or an iodine atom; a substituted or unsubstituted alkyl group having from 1 to 18 carbon atoms, preferably from 1 to 10 carbon atoms; a substituted or unsubstituted aryl group having from 6 to 30 carbon atoms, preferably from 6 to 15 carbon atoms; a nitro group; a cyano group; a substituted or unsubstituted alkanesulfonyl group having from 1 to 18 carbon atoms, preferably from 1 to 10 carbon atoms; a substituted or unsubstituted arenesulfonyl group having from 6 to 30 carbon atoms, preferably from 6 to 15 carbon atoms; a substituted or unsubstituted alkoxy group having from 1 to 18 carbon atoms, preferably from 1 to 10 carbon atoms; a substituted or unsubstituted aryloxy group having from 6 to 30 carbon atoms, preferably from 6 to 15 carbon atoms; a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atom, preferably from 1 to 10 carbon atoms; a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atom, preferably from 1 to 10 carbon atoms; a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, preferably from 6 to 15 carbon atoms; a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, preferably from 2 to 10 carbon atoms; a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, preferably from 7 to 15 carbons; a substituted carbamoyl group having 2 to 18 carbon atoms, preferably from 2 to 10 carbon atoms; a substituted amino group having 1 to 18 carbon atoms, preferably from 1 to 10 carbon atoms; or a SF5 group.",
                        "With regard to X, in a formula (II), X is a chlorine atom, a bromine atom, or an iodine atom.",
                        "The term “alkyl” as used herein is linear, branched, or cyclic alkyl. The alkyl part of alkanesulfonyl, alkoxy, alkanesulfonyloxy, or alkoxycarbonyl group as used herein is also linear, branched, or cyclic alkyl part.",
                        "The term “substituted alkyl” as used herein means an alkyl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted aryl” as used herein means an aryl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted alkanesulfonyl” as used herein means an alkanesulfonyl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted arenesulfonyl” as used herein means an arenesulfonyl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted alkoxy” as used herein means an alkoxy moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted aryloxy” as used herein means an aryloxy moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted acyloxy” as used herein means an acyloxy moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted alkanesulfonyloxy” as used herein means an alkanesulfonyloxy moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted arenesulfonyloxy” as used herein means an arenesulfonyloxy moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted alkoxycarbonyl” as used herein means an alkoxycarbonyl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted aryloxycarbonyl” as used herein means an aryloxycarbonyl moiety having one or more substituents such as a halogen atom, a substituted or unsubstituted alkyl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted carbamoyl” as used herein means a carbamoyl moiety having one or more substituents such as a substituted or unsubstituted alkyl group, a substituted or unsubstituted aryl group, and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "The term “substituted amino” as used herein means an amino moiety having one or more substituents such as a substituted or unsubstituted acyl group, a substituted or unsubstituted alkanesulfonyl group, a substituted or unsubstituted arenesulfonyl group and any other group with or without a heteroatom(s) such as an oxygen atom(s), a nitrogen atom(s), and/or a sulfur atom(s), which does not limit reactions of this invention.",
                        "Among the substitutents, R1, R2, R3, R4, and R5, as described above, a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group, a substituted or unsubstituted aryl group, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group, a substituted or unsubstituted arenesulfonyl group, a substituted or unsubstituted alkoxy group, a substituted or unsubstituted aryloxy group, a substituted or unsubstituted acyloxy group, and a substituted or unsubstituted alkoxycarbonyl group are preferable. A hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group, a substituted or unsubstituted aryl group, and a nitro group are more preferable because of their relative availability based on the starting materials.",
                        "Note that according to the nomenclature of Chemical Abstract Index Name, and in accordance with the present disclosure, for example, C6H5—SF5 is named sulfur, pentafluorophenyl-; p-C1-C6H4—SF5 is named sulfur, (4-chlorophenyl)pentafluoro-; and p-CH3—C6H4—SF5 is named sulfur, pentafluoro(4-methylphenyl)-. C6H5—SF4Cl is named sulfur, chlorotetrafluorophenyl-; p-CH3—C6H4—SF4Cl is named sulfur, chlorotetrafluoro(4-methylphenyl)-; and p-NO2—C6H4—SF4Cl is named sulfur, chlorotetrafluoro(4-nitrophenyl)-.",
                        "Arylsulfur halotetrafluorides of formula (II) include isomers such as trans-isomers and cis-isomers as shown below; arylsulfur halotetrafluoride is represented by ArSF4X:"
                    ],
                    "subsections": [
                        {
                            "title": "Process I (Scheme 1)",
                            "paragraphs": [
                                "Embodiments of Process I include reacting arylsulfur halotetrafluoride, having a formula (II), with hydrogen fluoride to form an arylsulfur pentafluoride having a formula (I), in which a molar ratio of arylsulfur halotetrafluoride/hydrogen fluoride is in the range of about 1/10 to about 1/150, preferably about 1/15 to about 1/100, and more preferably about 1/15 to about 1/50. When the amount of hydrogen fluoride is less than 10 mol against 1 mol of an arylsulfur halotetrafluoride, the product's yield is relatively low. When the amount of hydrogen fluoride is more than 150 mol against 1 mol of an arylsulfur halotetrafluoride, it leads to low effectiveness in production cost.",
                                "In some embodiments of the present invention the hydrogen fluoride is anhydrous or hydrous hydrogen fluoride. One particular embodiment that utilizes anhydrous hydrogen fluoride is shown in Process I. When hydrous hydrogen fluoride is used herein, the content of water must be minimized, as water may produce arylsulfonyl fluoride or arylsulfonyl chloride as byproducts, and hence the yields of the products are decreased and the separation from the byproducts becomes an issue.",
                                "The substituent(s), R1, R2, R3, R4, and R5, of the products represented by the formula (I) may be different from the substituent(s), R1, R2, R3, R4, and R5, of the starting materials represented by the formula (II). Thus, embodiments of this invention include transformation of the R1, R2, R3, R4, and R5 to different R1, R2, R3, R4, and R5 which may take place during the reaction of the present invention or under the reaction conditions, as long as the —SF4X moiety is transformed to a —SF5 group.",
                                "Illustrative arylsulfur halotetrafluorides, as represented by formula (II), of the invention include, but are not limited to: phenylsulfur chlorotetrafluoride, each isomer (o-, m-, or p-isomer) of fluorophenylsulfur chlorotetrafluoride, each isomer of difluorophenylsulfur chlorotetrafluoride, each isomer of trifluorophenylsulfur chlorotetrafluoride, each isomer of tetrafluorophenylsulfur chlorotetrafluoride, pentafluorophenylsulfur chlorotetrafluoride, each isomer of chlorophenylsulfur chlorotetrafluoride, each isomer of dichlorophenylsulfur chlorotetrafluoride, each isomer of trichlorophenylsulfur chlorotetrafluoride, each isomer of bromophenylsulfur chlorotetrafluoride, each isomer of dibromophenylsulfur chlorotetrafluoride, each isomer of iodophenylsulfur chlorotetrafluoride, each isomer of chlorofluorophenylsulfur chlorotetrafluoride, each isomer of bromofluorophenylsulfur chlorotetrafluoride, each isomer of bromochlorophenylsulfur chlorotetrafluoride, each isomer of fluoroiodophenylsulfur chlorotetrafluoride, each isomer of methylphenylsulfur chlorotetrafluoride, each isomer of chloro(methyl)phenylsulfur chlorotetrafluoride, each isomer of dimethylphenylsulfur chlorotetrafluoride, each isomer of bromo(methyl)phenylsulfur chlorotetrafluoride, each isomer of bromo(dimethyl)phenylsulfur chlorotetrafluoride, each isomer of (trifluoromethyl)phenylsulfur chlorotetrafluoride, each isomer of bis(trifluoromethyl)phenylsulfur chlorotetrafluoride, each isomer of biphenylsulfur chlorotetrafluoride, each isomer of (methanesulfonyl)phenylsulfur chlorotetrafluoride, each isomer of (benzenesulfonyl)phenylsulfur chorotetrafluoride, each isomer of (trifluoromethoxy)phenylsulfur chlorotetrafluoride, each isomer of (trifluoroethoxy)phenylsulfur chlorotetrafluoride, each isomer of (tetrafluoroethoxy)phenylsulfur chlorotetrafluoride, each isomer of phenoxyphenylsulfur chlorotetrafluoride, each isomer of bromophenoxyphenylsulfur chlorotetrafluoride, each isomer of nitrophenoxyphenylsulfur chlorotetrafluoride, each isomer of nitrophenylsulfur chlorotetrafluorides, each isomer of chloro(nitro)phenylsulfur chlorotetrafluoride, each isomer of cyanophenylsulfur chlorotetrafluoride, each isomer of acetoxyphenylsulfur chlorotetrafluoride, each isomer of (benzoyloxy)phenylsulfur chlorotetrafluoride, each isomer of (methanesulfonyloxy)phenylsulfur chlorotetrafluoride, (trifluoromethanesulfonyloxy)phenylsulfur chlorotetrafluoride, each isomer of (benzenesulfonyloxy)phenylsulfur chlorotetrafluoride, each isomer of (toluenesulfonyloxy)phenylsulfur chlorotetrafluoride, each isomer of (methoxycarbonyl)phenylsulfur chlorotetrafluoride, each isomer of (ethoxycarbonyl)phenylsulfur chlorotetrafluoride, each isomer of (phenoxycarbonyl)phenylsulfur chlorotetrafluoride, each isomer of (N,N-dimethylcarbamoyl)phenylsulfur chlorotetrafluoride, each isomer of (N,N-diphenylcarbamoyl)phenylsulfur chlorotetrafluoride, each isomer of (acetylamino)phenylsulfur chlorotetrafluoride, each isomer of (N-acetyl-N-benzylamino)phenylsulfur chlorotetrafluoride, each isomer of (pentafluorosulfanyl)phenylsulfur chlorotetrafluoride, and other like compounds. Each of the above formula (II) compounds can be prepared according to reported methods (for example, see WO 2008/118787 A1, incorporated herein by reference for all purposes).",
                                "Arylsulfur halotetrafluorides (Formula II) used for the present inventions can be obtained by the reported reactions described above. For example, arylsulfur chlorotetrafluorides (ArSF4X; X═Cl) are typically prepared by reaction of a diaryl disulfide (ArSSAr) or arylthiol (ArSH) with chlorine (Cl2) and metal fluoride such as potassium fluoride in acetonitrile solvent as shown below (Eq 1) (see WO 2008/118787 A1).",
                                "After the reaction, the reaction mixture is filtered to remove solid metal halide such as KCl and excess of solid KF, and the filtrate is concentrated under reduced pressure to give a crude product, which generally includes about 5˜80 weight % of acetonitrile. In order to purify, the crude product is distilled, preferably under reduced pressure, or the crude product is recrystallized from a suitable solvent if the product is crystalline.",
                                "The distilled or crystallized products of arylsulfur halotetrafluorides (Formula II) are used for the reactions of the present inventions. The crude products arylsulfur halotetrafluorides (Formula II) mentioned above are also usable for the reactions of the present inventions [see Example 6 (ArSF4Cl:CH3CN=71:29 weight ratio), Example 8 (ArSF4Cl:CH3CN=57:43 weight ratio), and Example 14 (ArSF4Cl:CH3CN=74:26 weight ratio)]. Thus, the crude products usable for the present inventions may be the materials obtained by the filtration process to remove the metal halide and an excess of metal fluoride followed by the concentration process to remove the solvent before the final purification process such as distillation or crystallization. Using the crude product leads to significant cost reduction since the purification process, such as a distillation or crystallization, is eliminated.",
                                "From the viewpoint of cost and yield, embodiments of Process I are preferably carried out without any other solvents. However, in the case of no or low solubility of the arylsulfur halotetrafluoride and/or its product, arylsulfur pentafluoride, in hydrogen fluoride, a solvent which dissolves the arylsulfur halotetrafluoride and/or its product may be added to increase the reaction rate and yield. The preferable solvents will not substantially react with the starting materials, the final products, and/or the hydrogen fluoride. Suitable solvents include, but are not limited to, nitriles, ethers, nitro compounds, halocarbons, aromatics, hydrocarbons, and so on, and mixtures thereof. Illustrative nitriles are acetonitrile, propionitrile, benzonitrile, and other like. Illustrative ethers are diethyl ether, dipropyl ether, dibutyl ether, dioxane, glyme, diglyme, triglyme, and other like. Illustrative nitro compounds are nitromethane, nitroethane, nitrobenzene, and so on. Illustrative halocarbons are dichloromethane, chloroform, carbon tetrachloride, dichloroethane, trichloroethane, tetrachloroethane, trichlorotrifluoroethane, and other like. Illustrative aromatics are benzene, chlorobenzene, toluene, benzotrifluoride, and other like. Illustrative hydrocarbons are linear, branched, or cyclic pentane, hexane, heptane, octane, nonane, decane, and other like. Among these solvents, acetonitrile is preferable because of the high yield of the products. The amount of the solvent used can be chosen so as to promote the reaction or at least not interfere with the reaction of the arylsulfur halotetrafluoride and hydrogen fluoride.",
                                "In order to obtain a good yield of product in Process I, the reaction temperature can be selected in the range of about −80° C. to about +250° C., and preferably about −60° C. to about +200° C. A suitable temperature can be varied depending on the electron density of the benzene ring of arylsulfur halotetrafluoride, which is caused by the substituents (R1˜R5) on arylsulfur halotetrafluoride. The electron density is changed by the electron-donating or -withdrawing effect of the substituents (R1˜R5). For example, an electron-donating group increases the electron density, while an electron-withdrawing group decreases the density. The reaction proceeds at relatively low temperature with the arylsulfur halotetrafluorides having high electron density on the benzene ring, while the reactions are smooth at relatively high temperature with arylsulfur halotetrafluorides having low electron density on the benzene ring. Therefore, the reaction temperature may be chosen in order that the desired reaction be completed preferably within a week and more preferably within a few days.",
                                "Embodiments of the invention also include a method which comprises reacting an arylsulfur halotetrafluoride having a formula (II), with hydrogen fluoride in the presence of a fluoride salt having a formula, M+F−(HF)n, to form the arylsulfur pentafluoride having a formula (I) (see Scheme 2, Process II).",
                                "For compounds of formulas (I) and (II), R1, R2, R3, R4, R5 and X are the same as defined above.",
                                "In addition, arylsulfur halotetrafluorides (Formula II) for Process II are also the same as described above in Process I.",
                                "Regarding M+F−(HF)n, M is a cationic moiety and n is 0 or a mixed number greater than 0. Preferable M is a metal atom, an ammonium moiety, or a phosphonium moiety. Preferable fluoride salts are exemplified, but are not limited to: alkali metal fluoride salts such as LiF, NaF, KF, RbF, CsF, and their hydrogen fluoride salts such as LiF(HF)n′, NaF(HF)n′, KF(HF)n′, RbF(HF)n′, CsF(HF)n′ in which n′ is a mixed number greater than 0; alkali earth metal fluoride salts such as BeF2, BeFCl, MgF2, MgFCl, CaF2, SrF2, BaF2; ammonium fluoride salts such as ammonium fluoride, methylammonium fluoride, dimethylammonium fluoride, trimethylammonium fluoride, tetramethylammonium fluoride, ethylammonium fluoride, diethylammonium fluoride, triethylammonium fluoride, tetraethylammonium fluoride, tripropylammonium fluoride, tributylammonium fluoride, tetrabutylammonium fluoride, benzyldimethylammonium fluoride, pyridinium fluoride, methylpyridinium fluoride, dimethylpyridinium fluoride, trimethylpyridinium fluoride, and other like materials, and their hydrogen fluoride salts such as NH4F(HF)n′, CH3NH3F(HF)n′, (CH3)2NH2F(HF)n′, (CH3)3NHF(HF)n′, (CH3)4NF(HF)n′, (C2H5)3NHF(HF)n′, (C2H5)4NF(HF)n′, (C3H7)4NF(HF)n′, (C4H9)4NF(HF)n′, pyridine.HF(HF)n′, and other like materials, in which n′ is a mixed number greater than 0; phosphonium fluoride salts such as tetramethylphosphonium fluoride, tetraethylphosphonium fluoride, tetrapropylphosphonum fluoride, tetrabutylphosphonium fluoride, tetraphenylphosphonium fluoride, and other like materials, and their (HF)n′ salts (n′ is a mixed number greater than 0). Mixed number herein refers to whole numbers and any fraction of a whole number, e.g., 0.1, 0.2, 0.25, 0.3, 0.4, 0.5, 0.75, 0.8, 0.9, 1, 1.1, 1.2, 1.25, 1.3, 1.5, 1.75, 2, 2.5, 3, 3.5, 4, 4.5, 5, and so on.",
                                "Among the examples of fluoride salts mentioned above, alkali metal fluoride salts and their hydrogen fluoride salts are preferable, and among them, sodium fluoride and potassium fluoride and their (HF)n′ salts are more preferable due to cost performance.",
                                "As M+F− can react with hydrogen fluoride, M+F− actually exists as M+F−(HF)n′ (n′ is a mixed number greater than 0) in hydrogen fluoride.",
                                "As a hydrogen halide, such as hydrogen chloride, is much more acidic than hydrogen fluoride, hydrogen chloride can react with the fluoride salt having a formula, M+F−(HF)n, according to the following reaction below, to form M+Cl− which is a neutral salt.",
                                "M+F−(HF)n+HClM+Cl−+(n+1) HF",
                                "Thus, the fluoride salt can neutralize gaseous and very acidic hydrogen halide, forming a neutral salt, M+X−.",
                                "Embodiments in accordance with Process II allow for the use of either anhydrous or hydrous hydrogen fluoride. In typical cases the hydrogen fluoride is anhydrous hydrogen fluoride. However, where some amount of water is present in the process reaction, it should be minimized, as water may produce arylsulfonyl fluoride or arylsulfonyl chloride byproducts. Minimizing the water content means that it is preferable less than about 5 wt % and more preferably less than about 3 wt % of water content in the hydrogen fluoride.",
                                "The amount of hydrogen fluoride used in Process II is typically selected from the range of about 1/10 to about 1/150 of a molar ratio of arylsulfur halotetrafluoride/hydrogen fluoride. A more preferable range is about 1/15 to about 1/100, and furthermore one is about 1/15 to about 1/50. When the amount of hydrogen fluoride is less than 10 mol against 1 mol of an arylsulfur halotetrafluoride, the product's yield is relatively low. When the amount of hydrogen fluoride is more than 150 mol against 1 mol of an arylsulfur halotetrafluoride, it leads to low effectiveness in production cost.",
                                "The amount of a fluoride salt, M+F−(HF)n, as an additive used for reactions herein is typically selected in the range of about 0.1 to about 5 mol, more preferably about 0.2 to about 3 mol, and furthermore preferably about 0.5 to about 2 mol against 1 mol of an arylsulfur halotetrafluoride. When the fluoride salt is less than 0.1 mol, the effect of the additive is too small. When it is more than 5 mol, the effect is limited.",
                                "From the viewpoint of cost and yields of the reactions, Process II is typically carried out without any other solvents. However, where there is little or no solubility of the arylsulfur halotetrafluoride and/or its product, arylsulfur pentafluoride, in hydrogen fluoride, a solvent, which dissolves the arylsulfur halotetrafluoride and/or its product, may be added to increase the reaction rate and yield. Suitable solvents for Process II are the same as for Process I mentioned above.",
                                "The reaction temperature and time are the same as for Process I as mentioned above.",
                                "Embodiments of the invention also include a method which comprises reacting an arylsulfur halotetrafluoride having a formula (II), with hydrogen fluoride in the presence of a non-fluoride salt having a formula, M+Y−[Y− excludes F−(HF)n], to form the arylsulfur pentafluoride having a formula (I) (see Scheme 3, Process III).",
                                "Hydrogen fluoride and its amount used in Process III is the same as for Process II, as mentioned above.",
                                "For compounds represented by formulas (I) and (II), R1, R2, R3, R4, R5, and X represent the same meaning as defined previously.",
                                "Arylsulfur halotetrafluorides (Formula II) for use in Process III is the same as described in Process I.",
                                "Regarding M+Y−, M represents the same meaning as defined above, and Y is an anionic moiety [except for F−(HF)n] whose conjugated acid HY is less than HX in acidity (for example, HCl).",
                                "Y−+H+⇄HY\n\n\n- - Y⁻; a conjugated base\n  - HY; a conjugated acid",
                                "Typical M are the same as those described for Process II. Typical Y are exemplified, but not limited to, sulfates such as OSO3Na, OSO3K, OSO3Li, OSO3NH4, OSO3Mg1/2, OSO3Ca1/2, and other like materials; benzenesulfonate (C6H5SO3), methylbenzenesulfonate, dimethylbenzenesulfonate, trimethylbenzenesulfonate, bromobenzenesulfonate, chlorobenzenesulfonate, nitrobenzenesulfonate, vinylbenzenesulfonate, methanesulfonate, ethanesulfonate, and other like compounds; carbonates such as OCO2H, OCO2Na, OCO2K, OCO2Li, OCO2NH4 and other like materials; carboxylates such as formate (HCOO), acetate (CH3COO), propionate (C2H5COO), butanoate (C3H7COO), benzoate (C6H5COO), methylbenzoate (CH3C6H4COO), dimethylbenzoate, trimethylbenzoate, (methoxy)benzoate, nitrobenzoate, bromobenzoate, chlorobenzoate, cinnamate (C6H5CH═CHCOO), acrylate (CH2═CHCOO), 1-methylacrylate, 2-methylacrylate, 1-phenylacrylate, and other like materials.",
                                "Typical M+Y− are exemplified, but not limited to, NaOSO3Na (Na2SO4), KOSO3K (K2SO4), LiOSO3Li (Li2SO4), NH4OSO3NH4 [(NH4)2SO4], MgSO4, CaSO4, C6H5SO3Na, C6H5SO3K, C6H5SO3NH4, C6H5SO3HNEt3, sodium methylbenzenesulfonate, potassium methylbenzenesulfonate, potassium dimethylbenzenesulfonate, potassium trimethylbenzenesulfonate, potassium chlorobenzenesulfonate, potassium nitrobenzenesulfonate, potassium vinylbenzenesulfonate, potassium methanesulfonate, potassium ethanesulfonate, lithium carbonate, lithium bicarbonate, sodium carbonate, sodium bicarbonate, potassium carbonate, potassium bicarbonate, lithium formate, sodium formate, potassium formate, lithium acetate, sodium acetate, potassium acetate, lithium benzoate, sodium benzoate, potassium benzoate, sodium methylbenzoate, potassium methylbenzoate, potassium dimethylbenzoate, potassium trimethylbenzoate, potassium (methoxy)benzoate, potassium nitrobenzoate, potassium bromobenzoate, potassium chlorobenzoate, potassium cinnamate, potassium propenoate (acrylate), potassium 2-methylpropenoate, potassium 2-butenoate, and other like materials.",
                                "When halogenated arylsulfur pentafluorides are formed as byproducts in the reactions of arylsulfur halotetrafluoride and hydrogen fluoride, M+Y− is typically used, in which the anionic moiety having at least one unsaturated bond in a moiety is selected among Y mentioned above, such as benzenesulfonate (C6H5SO3), methylbenzenesulfonate, dimethylbenzenesulfonate, trimethylbenzenesulfonate, bromobenzenesulfonate, chlorobenzenesulfonate, nitrobenzenesulfonate, vinylbenzenesulfonate, benzoate (C6H5COO), methylbenzoate (CH3C6H4COO), dimethylbenzoate, trimethylbenzoate, (methoxy)benzoate, bromobenzenoate, chlorobenzoate, nitrobenzoate, cinnamate (C6H5CH═CHCOO), propenoate (CH2═CHCOO), 2-methylpropenoate, 2-butenoate, and other like materials. The Y having at least one unsaturated bond may significantly decrease the formation of the byproducts, halogenated arylsulfur pentafluorides [see impurity (1a) of Example 26 in Table 6].",
                                "The amount of a non-fluoride salt, M+Y−, used for the reaction is typically selected in the range of about 0.1 to about 5 mol, more typically about 0.2 to about 3 mol, and furthermore typically about 0.5 to about 2 mol against 1 mol of an arylsulfur halotetrafluoride. When the non-fluoride salt is less than 0.1 mol, the effect of the fluoride salt is too low, and when it is more than 5 mol, the effect is limited.",
                                "As a hydrogen halide, such as hydrogen chloride (HCl), is more acidic than HY, hydrogen chloride can react with the non-fluoride salt having a formula, M+Y−, according to the following reaction below, to form M+Cl−, which is a neutral salt.",
                                "M+Y−+HClM+Cl−+HY",
                                "Thus, the non-fluoride salt can neutralize gaseous and very acidic hydrogen halide, forming a neutral salt such as M+X−.",
                                "From the viewpoint of cost and yields, Process III embodiments are typically carried out without any additional solvents. However, where there is little or no solubility of arylsulfur halotetrafluoride and/or its product, arylsulfur pentafluoride, in hydrogen fluoride, a solvent which dissolves the arylsulfur halotetrafluoride and/or its product may be added to increase the reaction rate and yield. Where appropriate, suitable solvents for Process III are the same as for Process I as mentioned above.",
                                "The reaction temperature and time for Process III are the same as for Process I, as mentioned above.",
                                "Embodiments of the invention also include a method which comprises reacting an arylsulfur halotetrafluoride having a formula (II), with hydrogen fluoride in the presence of an organic compound having one or more unsaturated bonds in a molecule to form the arylsulfur pentafluoride having a formula (I) (see Scheme 4, Process IV).",
                                "Hydrogen fluoride and its amount used for Process IV is the same as for Process II as mentioned above.",
                                "For compounds represented by formulas (I) and (II), R1, R2, R3, R4, R5, and X represent the same meaning as defined above.",
                                "Arylsulfur halotetrafluorides (Formula II) usable for Process IV are the same as described in Process I.",
                                "With regard to an organic compounds having one or more unsaturated bonds in a molecule, the organic compound is typically selected from a group consisting of arenes, alkenes, and alkynes. These organic compounds are exemplified, but not limited to, arenes such as benzene, toluene, xylene, durene, fluorobenzene, chlorobenzene, bromobenzene, phenol, anisole, cresole, naphthalene, anthracene, and other like materials; alkenes such as ethylene, vinyl chloride, vinyl bromide, vinylidene chloride, 1,2-dichloroethylene, trichloroethylene, tetrachloroethylene, propene, butene, pentene, hexene, heptene, octene, and other like materials; alkynes such as acetylene, propyne, and other like materials. Among these compounds, arenes are typical due to availability and yield of products.",
                                "When halogenated arylsulfur pentafluorides are formed as byproducts in the reactions of arylsulfur halotetrafluoride and hydrogen fluoride, the Process IV using organic compounds having one or more unsaturated bonds in a molecule are preferable because the process significantly decreases the formation of the byproducts (halogenated arylsulfur pentafluorides) [see impurity (1a) of Examples 21˜25 in Table 6].",
                                "The amount of an organic compound used for the reaction is preferably selected in the range of about 0.01 mol to a large excess, against 1 mol of an arylsulfur halotetrafluoride. This may include the case where an organic compound is used as a solvent or as one of solvents for the reaction, if the organic compounds do not effect the desired reactions and are easily removed from the reaction mixture after the reaction, for example, because of low boiling point. The amount is more preferable in the range of about 0.05 mol to about 5 mol, furthermore preferably about 0.05 mol to about 1 mol against 1 mol of an arylsulfur halotetrafluoride. When it is less than 0.01 mol, the effect of the additive is too small.",
                                "From the viewpoint of cost and yields of the reactions, Process IV is preferably carried out without any other solvents. However, in the case of little or no solubility of the arylsulfur halotetrafluoride and/or its product, arylsulfur pentafluoride, in hydrogen fluoride, a solvent which dissolves the arylsulfur halotetrafluoride and/or its product may be added to increase the reaction rate and yield. Suitable solvents for Process IV are the same as for Process I mentioned above.",
                                "The reaction temperature and time for Process IV are the same as for Process I mentioned above.",
                                "Embodiments of the invention also include a method which comprises reacting an arylsulfur halotetrafluoride having a formula (II), with hydrogen fluoride in the presence of additives to form the arylsulfur pentafluoride, having a formula (I) [see Process V (Scheme 5)], in which at least two additives are selected from a group consisting of fluoride salts having a formula, M+F−(HF)n, non-fluoride salts having a formula, M+Y− [Y− excludes F−(HF)n], and organic compounds having one or more unsaturated bonds in a molecule.",
                                "Hydrogen fluoride, and its amount used, for Process V is the same as for Process II, mentioned above.",
                                "For compounds of formulas (I) and (II), R1, R2, R3, R4, R5, and X represent the same meaning as defined above.",
                                "Arylsulfur halotetrafluorides (Formula II) usable for Process V are the same as described in Process I.",
                                "The fluoride salts, M+F−(HF)n, the non-fluoride salts, M+Y− [Y− excludes F−(HF)n], and the organic compound having one or more unsaturated bonds in a molecule, are the same meaning as defined above.",
                                "The total amount of the additives for Process V can be selected in the range of about 0.05 mol to a large excess, more preferably about 0.1 mol to about 5 mol, and furthermore preferably about 0.5 to about 3 mol against 1 mol of an arylsulfur halotetrafluoride. The ratio between or among the additives may be chosen in order to get a better yield of the product. When the total amount of additives is less than 0.05 mol, the effect of the additive is too small.",
                                "From the viewpoint of cost and yields of the reactions, Process V is preferably carried out without any other solvents. However, in the case of little or no solubility of the arylsulfur halotetrafluoride and/or its product, arylsulfur pentafluoride, in hydrogen fluoride, a solvent which dissolves the arylsulfur halotetrafluoride and/or its product may be added to increase the reaction rate and yield. Suitable solvents for Process V are the same as for Process I mentioned above.",
                                "The reaction temperature and time for Process V are the same as for Process I mentioned above.",
                                "According to the present invention, the highly pure arylsulfur pentafluorides having the formula (I) can be cost-effectively produced in commercial production. The advancement is unexpected in light of conventional production methods both in light of costs and yield. It represents a significant hurdle to overcome the industrial aspects of the present invention as other conventional methods require high cost performance due to no fluidity of solid fluoride sources, hard control on the exothermic solid-liquid phase reactions at elevated temperature, fine purification processes necessary for products of less purity, and unsatisfactory safety and environment sustainability.",
                                "The following examples will illustrate the present invention in more detail, but it should be understood that the present invention is not deemed to be limited thereto."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "define Process I",
                                "react arylsulfur halotetrafluoride with hydrogen fluoride",
                                "specify molar ratio of arylsulfur halotetrafluoride/hydrogen fluoride",
                                "describe effect of low hydrogen fluoride amount",
                                "describe effect of high hydrogen fluoride amount",
                                "specify anhydrous or hydrous hydrogen fluoride",
                                "minimize water content in hydrous hydrogen fluoride",
                                "list illustrative arylsulfur halotetrafluorides",
                                "describe preparation of arylsulfur halotetrafluorides",
                                "filter and concentrate reaction mixture",
                                "purify crude product by distillation or crystallization",
                                "use crude product without purification",
                                "describe cost reduction by using crude product",
                                "specify preferred reaction conditions without solvents",
                                "add solvents to increase reaction rate and yield",
                                "list suitable solvents",
                                "specify reaction temperature range",
                                "specify preferred reaction temperature range",
                                "describe effect of electron density on reaction temperature",
                                "choose reaction temperature based on electron density",
                                "specify reaction time",
                                "describe embodiments of Process I",
                                "introduce Process II",
                                "react arylsulfur halotetrafluoride with hydrogen fluoride and fluoride salt",
                                "specify fluoride salt formula",
                                "list illustrative fluoride salts",
                                "describe reaction of fluoride salt with hydrogen halide",
                                "introduce Process III",
                                "react arylsulfur halotetrafluoride with hydrogen fluoride and non-fluoride salt",
                                "specify non-fluoride salt formula",
                                "describe hydrogen fluoride and its amount used in Process III",
                                "define Process I (Scheme 1)",
                                "introduce reactants Y⁻ and HY",
                                "exemplify typical M and Y",
                                "describe M+Y⁻ compounds",
                                "explain use of M+Y⁻ in reactions",
                                "discuss amount of M+Y⁻ used",
                                "introduce hydrogen halide reaction",
                                "describe neutralization of hydrogen halide",
                                "discuss solvents for Process III",
                                "introduce Process IV (Scheme 4)",
                                "describe organic compounds with unsaturated bonds",
                                "exemplify arenes, alkenes, and alkynes",
                                "discuss amount of organic compound used",
                                "describe solvents for Process IV",
                                "introduce Process V (Scheme 5)",
                                "describe additives for Process V",
                                "discuss total amount of additives used",
                                "describe solvents for Process V",
                                "highlight advantages of present invention",
                                "introduce examples"
                            ],
                            "num_characters": 26105,
                            "outline_medium": [
                                "define arylsulfur pentafluoride formula (I)",
                                "define arylsulfur halotetrafluoride formula (II)",
                                "describe reaction conditions for Process I",
                                "specify molar ratio of arylsulfur halotetrafluoride/hydrogen fluoride",
                                "discuss effect of hydrogen fluoride amount on yield",
                                "describe substituent transformation during reaction",
                                "list illustrative arylsulfur halotetrafluorides",
                                "describe preparation of arylsulfur halotetrafluorides",
                                "discuss purification of arylsulfur halotetrafluorides",
                                "describe use of crude products",
                                "discuss solvents for Process I",
                                "specify suitable solvents",
                                "describe reaction temperature for Process I",
                                "discuss electron density effect on reaction temperature",
                                "describe reaction time for Process I",
                                "define Process I (Scheme 1)",
                                "describe reaction equation and components",
                                "list typical M and Y",
                                "describe use of M+Y- in reaction",
                                "introduce Process III",
                                "describe Process IV",
                                "describe organic compounds for Process IV",
                                "introduce Process V",
                                "describe additives for Process V",
                                "summarize advantages of the invention"
                            ],
                            "outline_short": [
                                "define arylsulfur pentafluoride synthesis",
                                "describe reaction conditions",
                                "specify hydrogen fluoride amount",
                                "discuss substituent transformation",
                                "list illustrative arylsulfur halotetrafluorides",
                                "describe purification methods",
                                "discuss cost reduction using crude products",
                                "define Process I (Scheme 1)",
                                "describe M and Y in Process I",
                                "outline Process III and IV",
                                "describe additives in Process V",
                                "summarize advantages of the invention"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce arylsulfur pentafluorides",
                        "motivate industrial production",
                        "describe target organic compounds",
                        "define arylsulfur halotetrafluoride reaction",
                        "specify molar ratio of reactants",
                        "describe substituents R1, R2, R3, R4, and R5",
                        "define alkyl group",
                        "define substituted alkyl group",
                        "define aryl group",
                        "define substituted aryl group",
                        "define alkanesulfonyl group",
                        "define substituted alkanesulfonyl group",
                        "define arenesulfonyl group",
                        "define substituted arenesulfonyl group",
                        "define alkoxy group",
                        "define substituted alkoxy group",
                        "describe naming conventions",
                        "describe isomers of arylsulfur halotetrafluorides"
                    ],
                    "num_characters": 9525,
                    "outline_medium": [
                        "introduce arylsulfur pentafluorides",
                        "motivate industrial production",
                        "describe method of producing arylsulfur pentafluorides",
                        "define substituents R1, R2, R3, R4, and R5",
                        "define X in formula (II)",
                        "explain terms \"alkyl\", \"substituted alkyl\", \"aryl\", and \"substituted aryl\"",
                        "define various substituted groups",
                        "specify preferable substituents",
                        "explain nomenclature of Chemical Abstract Index Name"
                    ],
                    "outline_short": [
                        "introduce arylsulfur pentafluorides",
                        "describe method of producing arylsulfur pentafluorides",
                        "define substituents R1, R2, R3, R4, and R5",
                        "provide examples of arylsulfur halotetrafluorides"
                    ]
                },
                {
                    "title": "EXAMPLES",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Example 1",
                            "paragraphs": [
                                "**Synthesis of Phenylsulfur Pentafluoride by Reaction of Phenylsulfur Chlorotetrafluoride with Anhydrous Hydrogen Fluoride**",
                                "While N2 gas was flowed through a 250 mL fluoropolymer (FEP) vessel set with a condenser (made of fluoropolymer), the vessel was cooled in a bath of −11° C. A coolant (−25° C.) was flowed through the condenser. The vessel cooled at −11° C. was charged with 72.3 g (3.62 mol) of anhydrous hydrogen fluoride which was cooled at −20° C. Into the vessel, 35.0 g (0.152 mol) of phenylsulfur chlorotetrafluoride (this purity was 96 wt % and the other 4 wt % was phenylsulfur trifluoride) was added over 90 min through a syringe using a syringe pump. The molar ratio of phenylsulfur chlorotetrafluoride and hydrogen fluoride was 1/24. After the addition, the reaction mixture was stirred at −10° C. for 20 hours. After that, the reaction mixture was warmed to 25° C. and hydrogen fluoride was removed at the temperature under atmospheric pressure. The residue was mixed with 100 mL of 10% aqueous KOH and extracted with dichloromethane. The organic layer was separated, dried over anhydrous magnesium sulfate, and filtered. The filtrate was concentrated by distilling the solvent at 70° C. under atmospheric pressure. The resulting residue was distilled under reduced pressure (bath temperature about 110° C. and 32 mmHg) to give 20.6 g (yield 66%) of phenylsulfur pentafluoride. The purity of the product was determined to be 99.7% by GC analysis. The product was identified by spectral comparison with an authentic sample."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "set up reaction vessel",
                                "add reactants and cool",
                                "stir and extract product"
                            ],
                            "num_characters": 1543,
                            "outline_medium": [
                                "synthesize phenylsulfur pentafluoride"
                            ],
                            "outline_short": [
                                "synthesize phenylsulfur pentafluoride"
                            ]
                        },
                        {
                            "title": "Examples 2˜11",
                            "paragraphs": [
                                "**Synthesis of Arylsulfur Pentafluorides (I) by Reaction of Arylsulfur Halotetrafluorides (II) with Anhydrous Hydrogen Fluoride**",
                                "Various arylsulfur pentafluorides (I) were synthesized by reaction of the corresponding arylsulfur halotetrafluorides (II) with anhydrous hydrogen fluoride. Table 1 shows the results, the starting materials and anhydrous hydrogen fluoride used for the reactions, and reaction conditions, together with those of Example 1. The procedure was conducted in a similar way as in Example 1, except for Example 7, in which 15.0 g (46.1 mmol) of compound (II) was placed in the vessel and then mixed with liquid anhydrous hydrogen fluoride cooled at −20° C., because the compound (II) was solid. In Example 11, a mixture of 33.6 g (93.1 mmol) of compound (II) and 3.0 g of dry acetonitrile was added into the reaction vessel through a syringe. The products were identified by spectral comparison with authentic samples except for Example 11, in which, product, 4-bromo-3-fluorophenylsulfur pentafluoride, was identified by spectral analysis. Physical and spectral data of 4-bromo-3-fluorophenylsulfur pentafluoride are as follows; by 74-79° C./6 mmHg; 1H NMR (CDCl3) δ 7.45 (dd, J=9.0 Hz, 1.7 Hz, 1H), 7.54 (dd, J=8.6 Hz, 2.4 Hz, 1H), 7.67 (t, J=7.9 Hz, 1H); 19F NMR (CDCl3) δ 63.03 (d, J=154 Hz, 4F), 82.07 (quintet, J=154 Hz, 1F), −102.98 (s, 1F); 13C NMR (CD3CN) δ 113.2 (d, J=21 Hz), 114.9 (doublet-quintet, J=27 Hz, 5 Hz), 123.1 (m), 134.0 (s), 152.9 (doublet-quintet, J=7 Hz, 20 Hz), 158.2 (d, J=250 Hz); GC-Mass 302 (M+), 300 (M+)."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize arylsulfur pentafluorides",
                                "vary reactants and conditions",
                                "identify products by spectral analysis"
                            ],
                            "num_characters": 1560,
                            "outline_medium": [
                                "synthesize arylsulfur pentafluorides"
                            ],
                            "outline_short": [
                                "synthesize arylsulfur pentafluorides"
                            ]
                        },
                        {
                            "title": "Example 12",
                            "paragraphs": [
                                "**Synthesis of Phenylsulfur Pentafluoride by Reaction of Phenylsulfur Chlorotetrafluoride with Anhydrous Hydrogen Fluoride in the Presence of K+F−.HF Added as an Additive**",
                                "A dried 125 mL fluoropolymer (FEP) vessel was flowed with N2 gas and charged with 48.0 g (2.40 mmol) of liquid anhydrous hydrogen fluoride which was cooled at −20° C. The vessel was set with a condenser (made of fluoropolymer) and a thermometer, and cooled in a bath of −20° C. A coolant (−15° C.) was flowed through the condenser. Into the vessel, 8.6 g (0.11 mol) of KF.HF was added. While the mixture was warmed to +15° C., 22.1 g (96.2 mmol) (purity 96 wt % and the other was phenylsulfur trifluoride) of phenylsulfur chlorotetrafluoride was added to the mixture over 1 hour through a syringe. The temperature of the reaction mixture was 3.4° C. and 13.6° C. at the starting point and completing point of the addition, respectively. After the addition, the reaction mixture was stirred at 15° C. for 18 h. After that, the reaction mixture was warmed to 25° C. and hydrogen fluoride was removed under atmospheric pressure. The residue was neutralized with about 15% aqueous KOH and extracted with dichloromethane. The organic layer was separated, dried over anhydrous magnesium sulfate, and filtered. The filtrate was concentrated by distilling the solvent at 70° C. under atmospheric pressure. The resulting residue was distilled under reduced pressure to give 14.4 g (yield 73%) of phenylsulfur pentafluoride (boiling point 57.5° C./35 mmHg). The purity of the product was determined to be 100% by GC analysis. The product was identified by spectral comparison with an authentic reference sample."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "set up reaction vessel with additive",
                                "add reactants and stir",
                                "extract and identify product"
                            ],
                            "num_characters": 1675,
                            "outline_medium": [
                                "synthesize phenylsulfur pentafluoride with additive"
                            ],
                            "outline_short": [
                                "synthesize phenylsulfur pentafluoride with additive"
                            ]
                        },
                        {
                            "title": "Examples 13˜19",
                            "paragraphs": [
                                "**Synthesis of Arylsulfur Pentafluorides (I) by Reaction of Arylsulfur Halotetrafluorides (II) with Anhydrous Hydrogen Fluoride in the Presence of a Fluoride Salt, M+F−(HF)n, Added as an Additive**",
                                "Various arylsulfur pentafluorides (I) were synthesized by reaction of the corresponding arylsulfur halotetrafluorides (II) with anhydrous hydrogen fluoride in the presence of a fluoride salt of formula, M+F−(HF)n, added as an additive. The procedure was conducted in a similar way as in Example 12. Table 2 shows the results, the starting materials, anhydrous hydrogen fluoride, and fluoride salts used for the reactions, and reaction conditions together with those of Example 12.",
                                "The products were identified by spectral comparison with reference samples, except for Example 19, in which, the product, 3,4-difluorophenylsulfur pentafluoride, was identified by spectral analysis. Physical and spectral data of 3,4-difluorophenylsulfur pentafluoride are as follows: by 75-76° C./25 mmHg; 1H NMR (CDCl3) δ 7.27 (m, 1H), 7.53-7.58 (m, 1H), 7.62-7.66 (m, 1H); 19F NMR (CDCl3) δ −133.75 (d, J=26 Hz, 1F), −130.93 (d, J=26 Hz, 1F), 63.60 (d, J=147 Hz, 4F), 82.56 (quintet, J=147 Hz, 1F); 13C NMR (CDCl3) δ 116.6 (dt, J=22 Hz, 4 Hz), 117.4 (d, J=19 Hz), 123.0 (m), 49.2 (quintet, J=20 Hz), 149.3 (dd, J=254 Hz, 13 Hz), 152.0 (dd, J=257 Hz, 12 Hz); GC-Mass 240 (M+).",
                                "As mentioned above, the fluoride salt can neutralize hydrogen chloride which is formed from the reaction. Furthermore, for examples, as seen from the comparison between Examples 3 and 12 and between Examples 10 and 15 at the same reaction temperature, the addition of a fluoride salt can make the yield and purity of the products higher than without the additive because the additive can make the reactions mild and surpress the formation of tar."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize arylsulfur pentafluorides with additive",
                                "vary reactants, conditions, and additives",
                                "identify products by spectral analysis"
                            ],
                            "num_characters": 1806,
                            "outline_medium": [
                                "synthesize arylsulfur pentafluorides with additive"
                            ],
                            "outline_short": [
                                "synthesize arylsulfur pentafluorides with additive"
                            ]
                        },
                        {
                            "title": "Example 20",
                            "paragraphs": [
                                "**Synthesis of Arylsulfur Pentafluoride (I) by Reaction of Arylsulfur Halotetrafluoride (II) with anhydrous hydrogen fluoride in the presence of a non-fluoride salt**",
                                "Liquid anhydrous hydrogen fluoride (61 g, 3.05 mol) was put in a dried 125 mL fluoropolymer vessel in the same way as in Example 12. The vessel was then set with a condenser (made of fluoropolymer) and a thermometer, and cooled in a bath of −20° C. Sodium acetate (9.0 g, 0.11 mol) was added portion by portion into a stirred liquid of hydrogen fluoride in the vessel. The mixture was homogenious. A coolant (−15° C.) was flowed through the condenser and the bath temperature was raised to −10° C. Phenylsulfur chlorotetrafluoride (23.4 g, purity 95 wt %, 0.101 mol) was added to the mixture over 30 min through a syringe using a syringe pump. The temperature of the reaction mixture was −8° C. and −6° C. at the starting point and completing point of the addition, respectively. The bath temperature was then raised to +5° C. and the reaction mixture was stirred for 70 min at +5° C. The bath temperature was then raised to +10° C. and the reaction mixture was stirred for 50 min. The bath temperature was then raised to +15° C. and the reaction mixture was stirred for 20 h at +15° C. After the reaction, the bath temperature was warmed to room temperature and hydrogen fluoride was removed by evaporation at room temperature. The residue was slowly poured into 400 g of 23% aqueous KOH solution, and the mixture was stirred for 30 min. The lower organic layer was separated and the upper aqueous layer was extracted with dichloromethane. The combined organic layer was washed with saturated aqueous NaCl solution, dried over anhydrous magnesium sulfate, and filtered. The filtrate was concentrated by distilling the solvent on an oil bath of 70° C. at atmospheric pressure. The resulting residue was distilled by heating in an oil bath of 180° C. and more at atmospheric pressure, giving 11.5 g of phenylsulfur pentafluoride which was a fraction of 145-150° C. The purity of the product was determined to be 99.6% by GC analysis. The product was identified by spectral comparison with a reference sample. Table 3 summarizes the reaction conditions and results."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "set up reaction vessel with non-fluoride salt",
                                "add reactants and stir",
                                "extract and wash product",
                                "identify product by spectral analysis"
                            ],
                            "num_characters": 2231,
                            "outline_medium": [
                                "synthesize arylsulfur pentafluoride with non-fluoride salt",
                                "describe reaction conditions and results"
                            ],
                            "outline_short": [
                                "synthesize arylsulfur pentafluoride with non-fluoride salt"
                            ]
                        },
                        {
                            "title": "Example 21",
                            "paragraphs": [
                                "**Synthesis of Arylsulfur Pentafluoride (I) by Reaction of Arylsulfur Halotetrafluoride (II) with Anhydrous Hydrogen Fluoride in the Presence of an Organic Compound**",
                                "Example 21 was conducted in a similar way as in Example 12 except that an organic compound was added in place of a fluoride salt. Table 4 shows the starting material, anhydrous hydrogen fluoride, and an aromatic compound as an additive used for the reaction, reaction conditions, and results. The product was identified by comparison with a reference sample.",
                                "A byproduct, 3-chloro-4-methylphenylsulfur pentafluoride (1a), formed in Example 21 is shown in Table 6. As a comparison (at the same reaction temperature), Example 10 without any additive is also shown in Table 6. The byproduct (1a) was 1.0% in Example 21, while byproduct (1a) was 8.1% in Example 10. This clearly indicates that an organic compound (benzene) as an additive greatly prevents the formation of byproduct (1a) by washing out the side reactions (chlorination of the product). This provides a surprising advantage over other conventional synthesis reactions."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize arylsulfur pentafluoride with organic additive",
                                "identify product and byproduct"
                            ],
                            "num_characters": 1099,
                            "outline_medium": [
                                "synthesize arylsulfur pentafluoride with organic compound"
                            ],
                            "outline_short": [
                                "synthesize arylsulfur pentafluoride with organic compound"
                            ]
                        },
                        {
                            "title": "Examples 22˜26",
                            "paragraphs": [
                                "**Synthesis of Arylsulfur Pentafluorides (I) by Reaction of Arylsulfur Halotetrafluorides (II) with Anhydrous Hydrogen Fluoride in the Presence of Two or More Additives Selected from a Group Consisting of Fluoride Salts, Non-Fluoride Salts, and Organic Compounds**",
                                "Various arylsulfur pentafluorides (I) were synthesized by reaction of the corresponding arylsulfur halotetrafluorides (II) with anhydrous hydrogen fluoride in the presence of two or more additives, which are selected from a group consisting of fluoride salts, non-fluoride salts, and organic compounds having one or more unsaturated bonds in a molecule. The reaction was conducted in a similar way as in Example 12 except that two or more additives were added in place of a fluoride salt. Examples 22˜25 were performed with a fluoride salt and an organic compound as additives, and Example 26 was performed with a fluoride salt and a non-fluoride salt as additives. The product was identified by comparison with a reference sample.",
                                "Table 5 shows the results, the starting material, anhydrous hydrogen fluoride, and additives used for the reactions, and reaction conditions. According to this method using two or more additives, products of high purity were obtained in better relative yields. At the same reaction temperature (+15° C.), the purities of the products of Examples 22˜26 (96˜99%) are much higher than those of Example 10 (90.9%) without any additive and Example 21 (90%) with one additive (benzene).",
                                "For a more detailed discussion, Table 6 shows the contents of impurity (Ia) and other byproducts (IIIa˜c) contained in the products obtained in Examples 10, 15, and 21˜26. The formation of impurity (1a) decisively hurts the yields and purity of products (I). Other byproduts (IIIa˜c) do not hurt the reaction because they depend on the additives and hence suitable reaction conditions or suitable additives can be selected for the reaction. Example 10 was conducted without any additives, Example 15 was conducted with KF.HF as one additive, Example 21 was conducted with benzene as one additive, Examples 22˜25 were conducted with KF.HF and benzene as two additives, and Example 26 was conducted with KF.HF and potassium p-methylbenzenesulfonate as two additives. The amount of impurity (1a) was 8.1% in Example 10, 1.9% in Example 15, 1.0% in Example 21, and 0.2% in Examples 22, no formation in Examples 23˜25, and 0.7% in Example 26. It is clear that KF.HF or benzene as one additive significantly prevents the formation of the impurity (1a), and that the use of both KF.HF and benzene or potassium p-methylbenzenesulfonate as two additives almost or completely eliminate the formation of the impurity (1a). Thus, the impurity is significantly decreased or completely not formed by these additives. Again, this shows the utility of the present invention.",
                                "While the invention has been particularly shown and described with reference to a number of embodiments, it would be understood by those skilled in the art that changes in the form and details may be made to the various embodiments disclosed herein without departing from the spirit and scope of the invention and that the various embodiments disclosed herein are not intended to act as limitations on the scope of the claims. All publications cited herein are hereby incorporated by reference."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "synthesize arylsulfur pentafluorides with multiple additives",
                                "vary reactants, conditions, and additives",
                                "identify products by spectral analysis",
                                "compare results with previous examples",
                                "discuss advantages of multiple additives",
                                "conclude utility of present invention"
                            ],
                            "num_characters": 3335,
                            "outline_medium": [
                                "synthesize arylsulfur pentafluorides with multiple additives",
                                "describe reaction conditions and results",
                                "compare with other examples"
                            ],
                            "outline_short": [
                                "synthesize arylsulfur pentafluorides with multiple additives"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for preparing arylsulfur pentafluoride having a formula (I) as follows:\n\ncomprising reacting arylsulfur halotetrafluoride of formula (II) with anhydrous hydrogen fluoride to form the arylsulfur pentafluoride:\n\n\nwherein a mol ratio of the arylsulfur halotetrafluoride to anhydrous hydrogen fluoride is in the range of about 1:10 to about 1:150;\nin which: R1, R2, R3, R4, and R5 each is independently a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group having 1 to 18 carbon atoms, a substituted or unsubstituted aryl group having 6 to 30 carbon atoms, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group having 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyl group having 6 to 30 carbon atoms, a substituted or unsubstituted alkoxy group having 1 to 18 carbon atoms, a substituted or unsubstituted aryloxy group having 6 to 30 carbon atoms, a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, a substituted carbamoyl group having 2 to 18 carbon atoms, a substituted amino group having 1 to 18 carbon atoms, or a SF5 group; and\nX is a chlorine atom, bromine atom, or iodine atom.",
        "2. The method of claim 1 wherein the mol ratio of the arylsulfur halotetrafluoride to the hydrogen fluoride is in the range of about 1:15 to about 1:100.",
        "3. The method of claim 1 wherein X is Cl.",
        "4. A method for preparing an arylsulfur pentafluoride having a formula (I) as follows:\n\nthe process comprising:\nreacting an arylsulfur halotetrafluoride having a formula (II):\n\n\nwith hydrogen fluoride in the presence of a fluoride salt of formula, M+F−(HF)n, to form the arylsulfur pentafluoride; wherein the mol ratio of an arylsulfur halotetrafluoride to a fluoride salt is in a range of about 1:0.1 to about 1:5 and the mol ratio of an arylsulfur halotetrafluoride to hydrogen fluoride is in a range of about 1:10 to about 1:150;\nin which: R1, R2, R3, R4, and R5 each is independently a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group having 1 to 18 carbon atoms, a substituted or unsubstituted aryl group having 6 to 30 carbon atoms, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group having 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyl group having 6 to 30 carbon atoms, a substituted or unsubstituted alkoxy group having 1 to 18 carbon atoms, a substituted or unsubstituted aryloxy group having 6 to 30 carbon atoms, a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, a substituted carbamoyl group having 2 to 18 carbon atoms, a substituted amino group having 1 to 18 carbon atoms, or a SF5 group;\nX is a chlorine atom, bromine atom, or iodine atom;\nM is a metal atom, an ammonium moiety, or a phosphonium moiety; and\nn is 0 or a mixed number greater than 0.",
        "5. The method of claim 4 wherein X is Cl.",
        "6. The method of claim 4 wherein the fluoride salt is an alkali metal fluoride which is selected from the group consisting of LiF(HF)n, NaF(HF)n, KF(HF)n, RbF(HF)n, and CsF(HF)n in which n is 0 or a mixed number which is greater than 0.",
        "7. A method for preparing an arylsulfur pentafluoride having a formula (I) as follows:\n\nthe process comprising:\nreacting an arylsulfur halotetrafluoride having a formula (II):\n\n\nwith hydrogen fluoride in the presence of a non-fluoride salt of formula, M+Y−, to form the arylsulfur pentafluoride;\nin which: R1, R2, R3, R4, and R5 each is independently a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group having 1 to 18 carbon atoms, a substituted or unsubstituted aryl group having 6 to 30 carbon atoms, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group having 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyl group having 6 to 30 carbon atoms, a substituted or unsubstituted alkoxy group having 1 to 18 carbon atoms, a substituted or unsubstituted aryloxy group having 6 to 30 carbon atoms, a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, a substituted carbamoyl group having 2 to 18 carbon atoms, a substituted amino group having 1 to 18 carbon atoms, or a SF5 group;\nX is a chlorine atom, bromine atom, or iodine atom;\nM is a metal atom, an ammonium moiety, or a phosphonium moiety;\nY is an anion moiety whose conjugated acid, HY, is less than HX in acidity, and Y excepts F(HF)n in which n is 0 or a mixed number greater than 0.",
        "8. The method of claim 7 wherein X is Cl.",
        "9. The method of claim 7 wherein the mol ratio of arylsulfur halotetrafluoride to non-fluoride salt is in a range of about 1:0.1 to about 1:5.",
        "10. The method of claim 7 wherein the mol ratio of arylsulfur halotetrafluoride to hydrogen fluoride is in the range of about 1:10 to about 1:150.",
        "11. A method for preparing an arylsulfur pentafluoride having a formula (I) as follows:\n\nthe process comprising:\nreacting an arylsulfur halotetrafluoride having a formula (II):\n\n\nwith hydrogen fluoride in the presence of an organic compound to form the arylsulfur pentafluoride, in which the organic compound has one or more unsaturated bonds in a molecule;\nin which: R1, R2, R3, R4, and R5 each is independently a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group having 1 to 18 carbon atoms, a substituted or unsubstituted aryl group having 6 to 30 carbon atoms, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group having 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyl group having 6 to 30 carbon atoms, a substituted or unsubstituted alkoxy group having 1 to 18 carbon atoms, a substituted or unsubstituted aryloxy group having 6 to 30 carbon atoms, a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, a substituted carbamoyl group having 2 to 18 carbon atoms, a substituted amino group having 1 to 18 carbon atoms, or a SF5 group; and\nX is a chlorine atom, bromine atom, or iodine atom.",
        "12. The method of claim 11 wherein X is Cl.",
        "13. The method of claim 11 wherein the mol ratio of arylsulfur halotetrafluoride to organic compound is in the range of about 1:0.05 to about 1:5.",
        "14. A method for preparing an arylsulfur pentafluoride having a formula (I) as follows:\n\nthe process comprising:\nreacting an arylsulfur halotetrafluoride having a formula (II):\n\n\nwith hydrogen fluoride in the presence of additives to form the arylsulfur pentafluoride, in which at least two additives are selected from a group consisting of fluoride salts of formula, M+F−(HF)n, non-fluoride salts of formula, M+Y−, and organic compounds that have one or more unsaturated bonds in a molecule;\nin which: R1, R2, R3, R4, and R5 each is independently a hydrogen atom, a halogen atom, a substituted or unsubstituted alkyl group having 1 to 18 carbon atoms, a substituted or unsubstituted aryl group having 6 to 30 carbon atoms, a nitro group, a cyano group, a substituted or unsubstituted alkanesulfonyl group having 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyl group having 6 to 30 carbon atoms, a substituted or unsubstituted alkoxy group having 1 to 18 carbon atoms, a substituted or unsubstituted aryloxy group having 6 to 30 carbon atoms, a substituted or unsubstituted acyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted alkanesulfonyloxy group having from 1 to 18 carbon atoms, a substituted or unsubstituted arenesulfonyloxy group having from 6 to 30 carbon atoms, a substituted or unsubstituted alkoxycarbonyl group having 2 to 18 carbon atoms, a substituted or unsubstituted aryloxycarbonyl group having 7 to 30 carbon atoms, a substituted carbamoyl group having 2 to 18 carbon atoms, a substituted amino group having 1 to 18 carbon atoms, or a SF5 group;\nX is a chlorine atom, bromine atom, or iodine atom;\nM is a metal atom, an ammonium moiety, or a phosphonium moiety;\nn is 0 or a mixed number greater than 0; and\nY is an anion moiety whose conjugated acid, HY, is less than HX in acidity, and Y is not F(HF)n.",
        "15. The method of claim 14 wherein the mol ratio of the arylsulfur halotetrafluoride to the total amount of the additives is in a range of about 1:0.1 to about 1:5."
    ]
}