{
    "id": "https://semopenalex.org/work/W2901852235",
    "authors": [
        "Onur Şahın",
        "Chunxuan Ye",
        "Fengjun Xi",
        "Sung‐Kwon Hong"
    ],
    "title": "A Simple Relaxation Scheme for Polar Codes",
    "date": "2018-10-01",
    "abstract": "In this paper, a simple relaxation scheme to reduce the encoding and decoding complexity of polar codes is introduced. Unlike the conventional relaxation schemes, the proposed technique relies on selecting relevant encoding/decoding nodes based on initialized relaxation attribute values and their extension to the remainder of the encoder and decoder stages. We show that the proposed relaxation scheme provides comparable BLER performance to the conventional polar codes by numerical simulations, while having significant complexity reduction.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "The polar codes was introduced in [1] and has been studied intensively in the literature due to its capacity achieving performance with relatively low complexity. Recently, the polar codes has been adopted as a channel coding scheme for control channel in 3GPP NR (New Radio) standardization [8]. Furthermore, its applicability as one of main channel coding candidates for the terabit per second and THz communication is also under investigation. [12] As a method to reduce complexity and latency of polar encoding and decoding, a method denoted as relaxation scheme is introduced and analyzed in [2]. The relaxation scheme has the benefit of complexity reduction without loss of performance under proper selection of relaxed nodes.",
                "In [3][4][5][6], the relaxation scheme is extended as \"irregular polar code\" and it is shown that additional complexity reduction gain can be achieved via more sophisticated procedures that are based on the calculation of mutual information.",
                "The approaches for relaxation in [2] and [3][4][5][6] are based on a similar procedure to conventional polar code construction [7] where the error probability of all nodes or union bound needs to be calculated in conjunction with the process of code construction. In this case, floating point calculation with high precision is required which incurs substantial calculation complexity, and hence limiting the practicality of these techniques.",
                "To tackle this limitation, in one approach, the information corresponding to the relaxed nodes can be stored in memory after off-line calculations, which than can be used for the underlying relaxation operations in encoding and decoding process. However, the memory requirements in this approach increases exponentially with the block length. Moreover, this approach also undermines some problems in code flexibility, as that would entail additional memory requirement for each possible code rate and block length.",
                "In this paper, a simple relaxation scheme which can be incorporated to polar encoding and decoding is introduced. In Section II, we provide the high level summary of the polar codes and its encoding operations. In Section III, the conventional relaxation methods are shortly described. The proposed relaxation scheme is provided in Section IV and the numerical results are given in Section V. Section VI concludes this paper."
            ],
            "subsections": []
        },
        {
            "title": "II. POLAR CODE",
            "paragraphs": [
                "The polar encoding operation can be defined as below (cf. [1])"
            ],
            "subsections": [
                {
                    "title": "",
                    "paragraphs": [
                        "where is a binary input vector with a length of , is a binary codeword vector generated by the multiplication of and . Here, have the same length as . A part of input bits in can be set to a fixed value (usually 0) and they are called as frozen bits. The positions of frozen bits can be represented by the set . The remaining positions of input bits with variable information bits (unfrozen bits) are denoted as the set . The number of elements in is . The code rate of polar code is .  (2)",
                        "In the original configuration of polar code in [1], and is a bit reversing matrix to interleave the input bits in a bit reversing manner, which is omitted in this paper for the sake of simplicity. This assumption is also made in the description of polar codes in 3GPP NR [8].",
                        "Polar encoding process can be described as in fig. 1 for the case of . The encoding diagram can be extended to an arbitrary integer (",
                        "). There exist nodes with stage (horizontal) indices and bit (vertical) indices. The 0-th stage stands for input bits with frozen and unfrozen bits, and the -th stage corresponds to output coded bits. The node in the diagram can be indicated by , , ."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "III. RELAXATION METHOD",
            "paragraphs": [
                "The relaxation method of polarized nodes in polar encoding process can be described as in fig. 2. In the decoding process of relaxed polar codes, the calculation of log-likelihood Ratio (LLR) values for node and are calculated from node and node . The calculation can be skipped and the same LLR values as in node and node can be assumed at the stage .",
                "In decoding of relaxed polar code, the conventional successive cancellation (SC) based decoding and belief propagation (BP) based decoding can be performed based on the described LLR transfer steps [9][10][11]."
            ],
            "subsections": [
                {
                    "title": "A relaxation attribute value",
                    "paragraphs": [
                        ", similar to the one in [2], is used in the remaining part of this paper. When and , the polarization unit (as in [3]) among nodes , , and are relaxed and the XOR operation among the nodes are skipped. When or , there is no relaxation among nodes , , and , and the conventional polarization process is applied and the XOR operation is retained. and indicates the indexes of paired nodes that go through XOR operation at the stage and under the configuration of polar code in fig. 1.",
                        "The complexity reduction gain ( ) by relaxation can be defined as the ratio between the number of XOR operations after the relaxation and the original number of XOR operation without relaxation as in [2]. The original number of nodes XOR operations without relaxation can be .",
                        "The conventional relaxation schemes developed in [2] and [3][4][5][6] are based on similar procedure to polar code construction. The schemes introduced by [2] and [3][4][5][6] are based on the calculation of error probability in each node (e.g. the nodes shown in fig. 1) and requires heavy computational load or large memory capabilities to provide flexibility depending on and .",
                        "A. Relaxed polar codes in [2] The concept of relaxation for polar codes is introduced by [2], where the so-called good channel relaxation for overly polarized nodes and the bad channel relaxation for nodes which cannot give further contribution to the code construction are proposed.",
                        "In the proposed relaxation method in [2], starting from nodes , as shown in fig. 3, the error probability of each stage is calculated and the nodes at which the relaxation operation starts are determined once the error probability of specific nodes is less than or larger than the predetermined threshold value. In the good channel relaxation, a lower threshold , whereas for the bad channel relaxation an upper threshold is applied. After determination of the first relaxation node, the nodes that are connected to the starting nodes in the subsequent stages are all applied with the relaxation operation as in fig. 2.",
                        "In [2], it is proved in lemma 5 that the union bound on the block error rate (BLER) of relaxed polar code is not less than the union bound on the BLER of polar code without relaxation. [3][4][5][6] In [3][4][5][6], the concept of relaxation in [2] is generalized and the so-called irregular polar code by inactivation is introduced. The inactivation process in irregular polar codes is the same as the relaxation in [2] for a single pair of involved nodes. However, the selection of inactivated nodes over the full polar coded block follows a different method."
                    ],
                    "subsections": [
                        {
                            "title": "B. Irregular polar codes in",
                            "paragraphs": [
                                "In [3], the mutual information for each node and corresponding union bound of error rate is calculated depending on the selection of inactivated polarization units. The group of selected polarization units that has the lowest error probability is finally determined and used for overall inactivation. The selection of inactivated polarization units by exhaustive methods are impractical as the combination of selected group can be excessive (for instance, it is combinations in case of [3]). To overcome this issue, a greedy, lower-complexity approach is proposed where code construction of selecting frozen bits can also be derived with the inactivation group selection. [3] The irregular polar code can have better complexity gain than the relaxed polar code as it includes more combinations of candidate nodes group for inactivation. In [3], a simple example that demonstrates a better error rate performance by inactivated polar codes compared with the standard polar codes is provided under BEC (Binary Erasure Channel)."
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "title": "IV. PROPOSED RELAXATION SCHEME",
            "paragraphs": [
                "In [2], the construction scheme for relaxed polar code in general binary memoryless symmetric (BMS) channel is proposed. In the proposed scheme of [2], the good channel relaxation starts from the nodes where the calculated error probability is lower than the predetermined threshold value in the process of polarization as shown in fig. 3.",
                "The relaxation operation that starts from an initial relaxed node (red colored circle) is extended to the remaining stages until the level of input bit nodes is reached. (level 0 or stage 0) The selection of initial relaxation node can be equivalent to the selection of corresponding group of input bit indices at stage 0.",
                "From this observation, the relaxation algorithm based on input domain indices and the reliabilities of input bit nodes can be developed. The proposed relaxation scheme in this paper is depicted in Algorithm 1. The algorithm involves both the good channel and the bad channel relaxation elements. The bad channel relaxation is performed by selecting most unreliable indices in the initialization step (step 1) of Algorithm 1. For the good channel relaxation, the most reliable bit indices are selected as attributes of initialization for in step 2."
            ],
            "subsections": [
                {
                    "title": "E < Eg",
                    "paragraphs": [
                        "In the proposed scheme, two relaxation attributes between two nodes involved by XOR operation should have the same value (0 or 1) and the case where different attribute combinations is excluded for the remaining steps. The steps 3-7 employ this exclusion.",
                        "The steps 8-14 describe extension of relaxation operations from the initialization stage to the remaining stages. When all from to has value of 1, all from to and from to This corresponds to the full relaxation of the component polar code starting from input bit index with a size of . The value of corresponds to full polar code and the detection of a node group with consecutive ones (attribute value for relaxed nodes) proceed until the minimum block size of 2. In the loop step , exploration of a smaller group that is already included in a selected group of relaxation is not required. After Algorithm 1, all attribute values of relaxation can be determined. for all , and 12: endif 13: endfor 14: endfor End Heuristically, for good channel relaxation can be determined for the consideration of performance and complexity gain by relaxation, , when .",
                        ", else .",
                        "In case of bad channel relaxation by , the bad channels are corresponding to starting relaxation from frozen bits. can be set to maximize complexity gain by the bad channel relaxation. Usually frozen bits are set to a value of zero and there is no actual XOR operations in the encoding process and no decoding procedures are needed for the related nodes. The special case can be called as \"full frozen bit relaxation\" where is not altered and hence no changes in the original polar decoding process is required. No performance degradation in comparison to the standard polar codes is observed in this case.",
                        "Contrary to bad channel relaxation, the good channel relaxation alters compared with the original polar coded bits obtained from the same . Also as a result, the good channel relaxation changes the error performance of the original polar code."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "V. NUMERICAL RESULTS",
            "paragraphs": [
                "The simulation conditions adopted for numerical results are summarized in TABLE I and the simulation results are shown in fig. 3, fig. 4 and fig. 5.",
                "The polar code construction in the simulation is based on the reliability sequence described in [8] and CRC polynomials used for CRC aided successive cancellation list (CA-SCL) decoding [10] is also based on 24 bit (CRC24C) polynomials defined in [8] The values of and for each code rate in TABLE I are derived from (4).",
                "In fig. 4 and fig. 6, the BLER performance of relaxed polar code by the proposed scheme with code rates ( =1/4, 1/2 and 3/4) are not degraded by relaxation and at BLER = have comparable BLER performance to the conventional polar code without relaxation.",
                "In    "
            ],
            "subsections": []
        },
        {
            "title": "VI. CONCLUSION",
            "paragraphs": [
                "In this paper, a simple relaxation scheme to provide practical implementation of polar codes is proposed and the scheme is numerically evaluated in terms of BLER performance and complexity reduction in XOR operations. For the code rates of 2/3 and 3/4, complexity reductions in the order of 20-33% are observed with no or negligible BLER performance degradation.",
                "As future work, extension of this work to achieve higher gain of error performance and complexity reduction can be studied."
            ],
            "subsections": []
        },
        {
            "title": "ACKNOWLEDGMENT",
            "paragraphs": [
                "The work has been supported by EPIC project funded by the European Union's Horizon 2020 research and innovation programme under grant agreement No 760150."
            ],
            "subsections": []
        }
    ]
}