{
    "id": "https://semopenalex.org/work/W4281913367",
    "authors": [
        "Giovanni Scabbia",
        "Ahmed Abotaleb",
        "Alessandro Sinopoli"
    ],
    "title": "Sulfur oxidative coupling of methane process development and its modeling via machine learning",
    "date": "2022-06-17",
    "abstract": "Sulfur oxidative coupling of methane (SOCM) has seen a significant improvement in catalyst design and performances, but there is still a lack of development at process level. We propose an optimized SOCM process flow diagram, with integrated waste heat recovery system and an efficient separation technique. The outcomes of the simulated process were used to design a data‐driven modeling approach, based on machine learning methods, and to evaluate its interpolation accuracy. The simultaneous multi‐input/multioutput relationship between the different parameters of the SOCM system were determined, revealing the optimum reaction conditions for the maximum benzene, toluene and xylene yield, at the minimum CH 4 and H 2 S recycling rate.",
    "sections": [
        {
            "title": "| INTRODUCTION",
            "paragraphs": [
                "Qatar is home to the world's largest single nonassociated gas reservoir, with a total recoverable gas volume of 900 trillion Sft 3 (TCF), corresponding to 20% of the currently exploitable global gas reserves. 1 Therefore, innovative technologies are needed for the optimal exploitation of these reserves, especially under fluctuating market scenarios. The target is to better utilize these reserves to meet the global demand growth, by circumventing any future oversupply or undersupply conditions, market price fluctuations, as well as producing marketable and high value products.The increase in natural gas reserves makes methane a significant hydrocarbon feedstock. However, the direct catalytic conversion of methane into liquid fuels and useful chemicals (e.g., ethylene and methanol) still remains a great challenge. Among the different catalytic processes, oxidative coupling of methane (OCM) has attracted large interest in the scientific community, at both the experimental and simulation level, as it represents one of the most promising and most investigated solutions for methane conversion to olefins and aromatics. Based on the principles of OCM, sulfur oxidative coupling of methane (SOCM) is a process based on a non-oxidative coupling of methane utilizing sulfur as radical for methane conversion to added-valuable products, specifically olefins and aromatics, as well as to remove toxic impurities (H 2 S).",
                "SOCM was first reported in 1993 2 but only over the last 10 years it has attracted the attention of the scientific community. 3 It is known that sulfur compounds including H 2 S, CH 3 SH, CS 2 , COS, and so on, always accompany the raw natural gas extracted from gas/oil wells, which therefore requires treatments using acid gas removal (AGR) plants, followed by Claus process for sulfur recovery. Usually, the treated gas contains minor amounts of contaminants such as 2-4 ppm H 2 S and 5-30 ppm total sulfur (mercaptans and carbonyl sulfide). 4 Due to always more stringent environmental regulations and the increasing of technical requirements for using natural gas in further catalytic processes (e.g., syngas fabrication), the demand for desulfurization keeps raising. On the other side, mercaptans are of great industrial interest and are widely used nowadays by the chemical industries, particularly as precursors for the synthesis of more complex organic molecules. 5 SOCM went through major developments in recent years concerning the catalyst development. In 2013, the group of Hulea, in collaboration with TOTAL S.A., presented a way to catalytically convert CH 3 SH and CH 3 SCH 3 (DMS), on protonic zeolites H-ZSM-5, H-Y and H-ferrierite, to light alkanes (C1-C3), benzene, toluene, and xylene.",
                "They found that, at 823 K, the CH 3 SH conversion is 100% on H-ZSM-5, and only partial on H-Y and H-ferrierite. These last two resulted more selective toward alkanes and produced large quantities of coke. In contrast, much less coke built up on H-ZSM-5, which was also more selective toward aromatics. 6 Later, the same group demonstrated the catalytic activity of various H-zeolite/zeotype toward the conversion of CH 3 SH into H 2 S and hydrocarbons (M2TH process), again proving the superior catalytic performances of H-ZSM-5. 7 Despite the recent catalyst development in SOCM technology, up to date, there is not a complete process for this technology indicating the process inputs (pressure, temperature, and feed ratio), mass and heat balance, heat integration system, separation technique, and so on.",
                "In this work, we focused on the process side of the SOCM technology by proposing an optimized process flow diagram, optimal process inputs, waste heat recovery system, and an efficient separation technique. We used process simulation tools for simulating all the steps of the proposed SOCM process. The corresponding simulated outcomes have been then fed as inputs to a machine learning (ML) model to reproduce the effects of each control parameter. We finally tested the modeling and interpolation accuracy of the ML model as a function of the number of training samples for revealing the optimum reaction conditions for the maximum conversion, as well as determining the minimum number of observations needed to still deliver an accurate result."
            ],
            "subsections": []
        },
        {
            "title": "| BACKGROUND",
            "paragraphs": [
                "The OCM process involves the activation of CH 4 by an oxidant, typically O 2 , to directly yield higher-valued C 2 products such as ethane C 2 H 6 and ethylene C 2 H 4 . It is worth mentioning that ethylene represents a fundamental hydrocarbon feedstock for the chemical industry, being the precursor for the synthesis of light aromatic compounds (BTX: benzene, toluene, and xylenes). The first report of OCM catalytic reactions dates back to 1982 thanks to the work of Keller and Bhasin. 8 Since then, it has attracted significant attention by the scientific and petrochemical industry communities to reveal the fundamental aspects of the reaction and elevate the process to a commercial dimension. The process involves the reaction between CH 4 and oxygen gas on the surface of a metal oxide catalyst to form gaseous methyl radicals (CH 3 ˙) via activation of a C H bond. The generated radicals then recombine in gas phase to yield C 2 H 6 . Over the same catalyst, an oxidative dehydrogenation of C 2 H 6 leads to the desired C 2 H 4 product. The overall reaction typically occurs at high temperature (700-900 C).",
                "Although the overall OCM reaction is exothermic and exergonic, it is kinetically hindered and still requires large improvements in catalyst and process development before reaching an effective and sustainable industrial scale. 9 OCM process suffers from multiple operational and scale up issues, 9 including: low reaction conversion (<10%); low selectivity to the desired products and high yield for side and by-products such as CO 2 ; highly exothermic reaction; sensitivity to CH 4 /O 2 ratio; limited operational conditions; potential explosion hazards; formation of hot spots; catalyst deactivation; utilization of pure oxygen, which is expensive and requires an air-separation plant; and finally advanced separation techniques that are expensive and complicated.Understanding and controlling catalytic reactions are considered crucial challenges in chemistry and chemical industry. Catalytic processes often involve multiple experimental factors and surface chemistries combined in a complex manner, making it difficult to represent them with a comprehensive analytical or simulation solution. ML can potentially be used as an approach to exemplify the modeling task, since it allows to treat multiple factors in higher dimensionality without the need of reproducing the physical interactions that are happening throughout the catalytic process. A chemical reaction can be simplified as a step process that includes several starting conditions (inputs) and produces one or more outputs. In general, to study the influence and importance of each reaction parameter on the target products, one would have to conduct several experimental reactions under various conditions, and then either find the optimal conditions empirically or by referring to background knowledge.",
                "Experimental research must be conducted over a long time period requiring large amounts of resources and equipment time. Furthermore, when the number of input and output parameters and their potential range of variation increases, the financial and time costs of covering such a large exploration space through experimental investigation becomes prohibitive. If ML can accurately reproduce the functional relations between the reaction conditions and the resulting effects from a subset of experimental or simulated data, then such approach can be used to derive the optimum reaction conditions from the predicted output without the need of further experiments. In recent years, the combination of efficient ML algorithms, large datasets, and the growing computing power is leading to always new and more accurate data-driven researches, with applications in catalysis [10][11][12][13][14][15][16][17] and materials science. [18][19][20] In order to overcome the aforementioned issues associated with OCM process, several studies in the last decade have used data mining and statistical techniques [21][22][23] or ML methods 24 to study and predict the catalyst performance in OCM reactions using published experimental data. Effective analysis of literature data by ML methods revealed indeed the capability to provide valuable information.",
                "One of the first most relevant example of the use of ML modeling for methane conversion dates back to 2017, by the Yildirim group.",
                "They used decision trees to extract correlation and trends out of a dataset of 5508 experimental data points from 81 publications on steam reforming of CH 4 (SRM), published over a 10 years span. 25 The analysis derived the most frequently used catalysts and their supports, together with the best operational conditions adopted to yield high methane conversion. More recently, the same group applied decision trees and artificial neural networks to a dataset of 5521 experimental data points, from scientific literature based on dry reforming of CH 4 (DRM). 26 In 2019, the group of Shimizu and Takigawa developed a ML predictive protocol for experimental heterogeneous catalytic processes including OCM, using literature data. 27 This protocol treats the elemental features of a catalyst as inputs, without the need of directly inputting the catalyst, resulting in high prediction accuracy. Over the last lustrum, the group of Takahashi have published several papers on ML applied to OCM. 24,[28][29][30][31] For example, they used different ML techniques to predict the effect of the OCM reaction conditions on the C 2 yield, revealing the nonlinearity between experimental conditions and C 2 yield. 31 In particular, the authors found that extreme tree regression models accurately reproduced the experimental data. In 2019, this group reported the use of a random forest regression model to describe the dependence of the C 2 yield on reaction conditions using a OCM dataset, constructed by high-throughput experimental screening of the performance of 20 catalysts in 216 reaction conditions. 30 More recently instead, Ishioka et al. used support vector regression to fill the gap between experimental data points by interpolation to obtain a better understanding of the relation between the selectivity and CH 4 conversion against the OCM reaction conditions. 29 An approach similar to the one here reported has been recently applied by Siritanaratkul to determine the limitation of ML for yield prediction of OCM. 32 3 | RESULTS AND DISCUSSION"
            ],
            "subsections": [
                {
                    "title": "| Process development",
                    "paragraphs": [
                        "The proposed comprehensive process diagram has been realized by integrating a standard process patented by ExxonMobil Oil Corp for the conversion of mercaptan and sulfides, 33 with a more recent processes patented by the Arkema S.A. company for the preparation of carbon disulfide and its conversion to methyl mercaptan and hydrogen sulfide. 34,35 Specifically, this new method 35 comprises the reaction of methane with hydrogen sulfide (H 2 S) to form carbon disulfide (CS 2 ) and hydrogen (H 2 ). These two products further react to yield methyl mercaptan (CH 3 SH), and hydrogen sulfide. The methyl mercaptan can then be isolated and the H 2 S can be recycled to further react with methane. Catalyst materials for methyl mercaptan catalytic production generally comprise molybdenum-and potassium-based active component on hydroxyapatite-based supports. 34 The methyl mercaptan is then converted to benzene, toluene, xylene, CH 4 , and H 2 S.",
                        "In order to integrate the processes developed by Arkema S.A. and ExxonMobil Oil Corp, which comprise respectively two and one main reactions, here it is proposed a complete process that includes three reactors (Reactor-A, Reactor-B, and Reactor-C, respectively) with three different catalysts, and the addition of heat integration system, separation unit (propane cycle), and AGR unit. The proposed process flow diagram is shown in Figure 1, while the chemical reactions occurring in the individual reactors and the corresponding product distributions are reflected in Table 1. The heat of reactions used for the model are included in Table S2. The reactors were modeled using Gibbs/equilibrium reaction hypothesis using Aspen engineering software v10.",
                        "The reaction conditions and parameters used for the model, and reported in the discussion below, (e.g., heat of reaction, temperature, pressure, feed ratio, type of catalyst, etc.) were those indicated in the referenced patents. The reported outcomes of the ASPEN model, in terms of conversion percentages, have been then validated against the values disclosed in the referenced patents.",
                        "The first reactor, Reactor-A, is where methane and hydrogen sulfide react on Pt/Al 2 O 3 to yield CS 2 and H 2 . The feedstock for Reactor-A consists of recycled methane merged with makeup methane, H 2 S feed, recycled H 2 S (if any), and liquid sulfur (S 8 ). It is worth mentioning that the addition of liquid sulfur is necessary to boost the reaction and increase the formation of CS 2 . 35 The reactants are mixed together at slightly positive pressure and temperature between 25 and 50 C. Afterward, the reactants are first preheated in Economizer-1, followed by a fired heater derived with external fuel to elevate the temperature of reactants in Reactor-A to 900 C. Then, Reactor-A downstream at 711 C, will be exchanged in Economizer-2 to generate steam as waste heat recovery. The generated CS 2 and H 2 are then directed to Reactor-B, where they react on K 2 O/NiMo/ Al 2 O 3 yielding CH 3 SH. As Reactor-B downstream recorded 434 C, it will be exchanged with boiler feed water to generate low-pressure steam as waste heat recovery. At this point, the produced CH 3 SH is directed to Reactor-C at 300 C to be converted into BTX, olefins and CH 4 , thanks to reaction with protonic zeolites H-ZSM-5 catalyst.",
                        "Reactor-C downstream products can reach 287 C, therefore the generated heat will be exchanged in economizer-4 with boiler feed water to cool down the system while generating low-pressure steam as waste heat recovery.",
                        "Finally, all the products and by-products are going to be separated in propane cycle by physical separation, where the bottom products are benzene, toluene, xylene, and naphthalene, while the overhead products are the non-condensable (CH 4 and H 2 S). The typical propane cycle (set at À32 C and atmospheric pressure) is applied without adding an economizer nor a second compressor (see Figure 1). The process simulation data of the propane cycle showed high BTX separation recovery up to 97.30% benzene, 99.42% toluene, 99.90% xylene, and 100.00% naphthalene on weight basis, with 98.34% for Total BTX. Moreover, instead of using cooling towers, air coolers are proposed as cheaper cooling method with an outlet temperature set at 57 C to match the harsh summer/design conditions. Finally, the CH 4 -H 2 S mixture is now directed to the AGR unit to remove the excess H 2 S and recycle the unreacted CH 4 -H 2 S back to Reactor-A. This step reduces the feedstock cost and unit production cost as well as increasing the unit profit. Using 2-amino-2-methyl-1-propanol (AMP) as solvent, the H 2 S loading can reach 0.5534 mol-H 2 S/mol-Amine. 36 In addition, Claus process could be integrated to recover sulfur rather than flaring/incinerating the stripped H 2 S. The superheated steam will be exchanged with the combined feed, recycled stream, and liquid-sulfur in a new preheater heat exchanger (Economizer-1).To conclude, Reactor A (methane activation) recorded 100% H 2 S conversion (same as the reference reported conversion 34,35 ) and 100% selectivity toward CS 2 . Also, it was found that increasing the sulfur content will decrease the reaction temperature as the reaction between CH 4 and S 8 is endothermic, while the reaction of CH 4 and H 2 S is exothermic. Reactor B (methyl mercaptan synthesis) recorded instead 86.94% conversion, with the unreacted CS 2 accumulating in the system due to insufficient H 2 .",
                        "Thus, addition of hydrogen will enhance the synthesis reaction and ensure 100% CS 2 conversion to CH 3 SH. Here the simulated conversion differs from the 100% CS 2 conversion reported in the Arkema S.A. patented process. 34,35 Finally, Reactor C (methyl mercaptan conversion) showed different product distributions, specifically 7% unreacted CH 3 SH, 27% benzene, 21% toluene, 4% xylene, 13% naphthalene, 18% CH 4 , and 9% H 2 S. This corresponded to a 93% conversion of CH 3 SH, in perfect agreement with the process reported by ExxonMobil Oil Corp. 33 It is worth mentioning that using conventional distillation column for BTX, naphthalene, CH 4 and H 2 S separation is not recommended due to the wide temperature difference (À80 to 130 C; see Figure S10), which would affect the material mechanical properties, specifically brittleness, and thus its lifetime. Hence, physical separation is here proposed by using propane cycle as a refrigerant to condense the BTX as a bottom product and release the non-condensable gases (CH 4 and H 2 S) as top products. To remove the excess of H 2 S, and recycle unconverted CH 4 and H 2 S at the desired 10:1 ratio, an AGR unit was added after the aromatics' separation unit. The resulting CH 4 /H 2 S mass ratio, at AGR unit overhead, was 6.8:1. Therefore, thanks to the addition of propane cycle and AGR units, all methane produced in the Reactor C is recycled as feedstock of Reactor A (see Figure 1), where only 3.36% methane makeup has to be added in order to reach the desired CH 4 /H 2 S mass ratio and ensure a 100% H 2 S conversion. On the other hand, the utilization of waste-heatrecovery system saves 61% of the required fuel gas to heat the reactants up to 900 C. Additionally, Economizers 1, 2, 3, and 4 were added before and after the Reactors A, B, and C to allow heat exchanging the process streams with water to generate low-pressure superheated steam and to condition the process streams for the following operations.",
                        "Finally, parametric study on the developed process was conducted using Aspen engineering software v10 for calculating the resulting BTX products, the H 2 S formation, and the unreacted methane at different process input conditions (pressure, temperature, and CH 4 :H 2 S feed ratio). Specifically, the adopted input ranges were: reactant mass ratios CH 4 /H 2 S from 10:1 up to 1:30, reactor feed temperature from 25 C up to 1525 C, and feed pressure from 1 up to 30 bar.",
                        "The simulated data were used for developing a ML model (see Section 3.3) for deriving the process optimal conditions and testing the accuracy of this method for its use in reaction process modeling applications."
                    ],
                    "subsections": []
                },
                {
                    "title": "| Dataset",
                    "paragraphs": [
                        "The dataset consists of a total of 45,900 simulated observations of eight process outputs (H 2 S conv. %, CS 2 conv. %, naphthalene, p-xylene, toluene, benzene, H 2 S, and methane) given the variation of the three inputs of the methane upgrading system (CH 4 -H 2 S feed-ratio, temperature, and pressure). Table 2 summarizes the descriptive statistics of the database entries used for this study."
                    ],
                    "subsections": []
                },
                {
                    "title": "| Machine Learning",
                    "paragraphs": [
                        "For modeling the nonlinear relation between the simulated outputs and the factors controlling the methane-upgrading process, we used a multilayer perceptron feedforward artificial neural network (ANN).",
                        "The algorithmic structure of a conventional ANN consists of at least three different layers: the input, hidden, and output layers (example in ",
                        "Feature scaling reduces the likelihood of a potential failure of the learning process and improves the performance of the ANNs algorithms.",
                        "For the training and validation procedure we set few hyperparameters a priori. F I G U R E 2 Example of architecture of the artificial neural network method to randomly initialize the starting values of the ANN weights. The number of epochs is set accordingly to the specific validation test that we are performing, and it is specified below for each case.",
                        "In the tuning process, we validated the architecture design of the network (number of nodes per layer and number of hidden layers), the activation function used in each node, the optimization function, and the L2-regularization rate. To reach a good compromise between the ANN prediction performance and its complexity (number of parameters to be learned) we selected among the best tuned settings a network with two hidden layers and five neurons per layer, tanh activation function, adamax optimizer, and no regularization. A detailed description of the hyperparameter tuning process is reported in the Supporting Information."
                    ],
                    "subsections": []
                },
                {
                    "title": "| Modeling performance",
                    "paragraphs": [
                        "After tuning the model hyperparameters, we trained the final ANN over 600 epochs and tested its prediction accuracy on a test set of about 10% of the overall data that was not used neither for training nor for validating the model. Figure 3 "
                    ],
                    "subsections": []
                },
                {
                    "title": "| Training size effect",
                    "paragraphs": [
                        "The prediction performance of the proposed ANN could unlikely be reached when using a real experimental dataset since the number of available observations would be likely much smaller compared to our synthetic dataset. We thus tested the efficacy of the model as a function of the training set size (Figure S9). We selected several random sub-sets of the starting train set with different sizes, ranging from 100 observations (<0.5% of the train set) up to 20,000 ($50% of the train set) and we trained the model for 1000 epochs. We found that when using less than 1000 observations, which equals to the common rule of thumb for neural networks of using at least 10 observations per model's trainable parameter, the model is still able to provide acceptable performances for most of the output variables (Figure 4).",
                        "While using 100 observations the model test prediction error was >10% for all outputs, likely due to the model overfitting the training data, the average rRMSE with 500 observations was about 3.6% with only the error for CS 2 conversion rate going above 5%. When we selected at least 1000 samples, the prediction test error resulted <4% across all the outputs. This result suggests that this modeling approach can be used to interpolate the preliminary results of an experimental research to derive a better understanding of the process, paving the way for potential areas for further investigation and reducing the time and resources needed for the next phases of the experiment.",
                        "F I G U R E 3 Overall performance (rRMSE) of the tuned model"
                    ],
                    "subsections": []
                },
                {
                    "title": "| Optimization of the input conditions",
                    "paragraphs": [
                        "In line with the results described in the previous section, we also wanted to obtain a rough estimate on how accurately the proposed modeling technique can interpolate few experimental data points to find the optimal operational conditions of the overall process. By using the model to approximate the input-output relation of the system, we can retrieve the best set of input conditions that lead to the targeted desirable outputs. To do so, we formulated an illustrative fitness function φ that gives a quantitative comprehensive measure of how good the resulting output of the system is. With this formula (Equation ( 2)-all outputs normalized to [0,1] range), we search for the conditions that lead to the maximization of the ratio between the weighted sum of the resulting H 2 S and CS 2 conversion rates and the production of the different BTX, over the sum of the remaining overhead products (H 2 S and methane). The numerical coefficients multiplying the variables at the numerator represent the importance that we specifically attributed to each factor.",
                        "Furthermore, we limited our analysis to a set of realistic operational conditions typical for gas conversion processes. Thus, we constrained the pressure to a maximum of 5 bars, and we set the temperature variation between the starting point of the conversion (500 C) and 1000 C to minimize the excessive coke deposition.",
                        "Finally, the feed ratio was limited to range between 1:1 and 10:1 CH 4 :H 2 S to minimize the unreacted reactants, higher reactor volumes, and separation unit, while achieving a relatively high conversation rate. ",
                        "Three-dimensional representation of the spatial variation of the calculated φ score for the whole simulated dataset (A), for a random selection of 100 simulated points (B), and for a mesh of 1000 interpolated points produced by the artificial neural network (C)",
                        "Figure 5 gives a general overview of this analysis. For each simulation point in our boundary space, we calculated the resulting φ score (Figure 5A). In an illustrative setting, we considered a potential experimental dataset as if it originated by a random selection of N points of the simulated data (Figure 5B). If these points are used to train the ANN model, we can then interpolate the full 3D space of input conditions and generate for each point an estimate of the resulting process outputs. From this, it is possible to calculate for each of these interpolated points the resulting estimate of the φ score produced by our ML solution. Figure 5C shows an example of such method using a 3D mesh of 1000 points (10 per side), although with this approach we could potentially generate an infinite number of interpolated points.",
                        "We then analyzed how close the score estimated by these interpolated points is to the real simulated dataset, and how accurately ML can identify areas of optimal operating conditions.",
                        "Similarly to Section 3.5, we tested the effect of different sizes (N) of the subset used for training the ANN (100, 250, 500, and 1000 samples). We repeated each test 100 times to minimize the effect of the random selection of the training points on the final results. During each single run, we selected 20% of the original simulated dataset as out-of-sample testing set. We then performed a random selection of N samples among the remaining points (80% of the simulated data).",
                        "We trained the ANN on this sub-set and for each point of the test set, we estimated the corresponding predicted outputs. For these, we calculated the respective φ score and we compared it with the original simulated testing points. The left image of Figure 6 gives a summary of the median accuracy of the resulting estimate of the φ score of the ANN in terms of relative percentage error. We found that the result is in line with the outcome presented in Section 3.5, where for a sub-set size of 100 points the median error is $19%, $7.5% for 250, 5% for 500, and $3.3% when using 1000 points. Another important aspect to consider is the ability of the ANN to correctly identify the areas of optimal operational conditions over the full space of variation using only few points. To do so, we first assumed that each point with a φ score higher than the 95% percentile is considered optimal. We accordingly determined which test points were identified as optimal in both the simulated and the predicted test data. For each testing point, we finally checked if the ANN has correctly (true positive/negative) or wrongly (false positive) recognized it as optimal, and if it missed any other optimal point (false negative). Thus, we derived the median Fscore over the 100 runs as a function of the sub-set size (Figure 6, right). The F-score is the harmonic mean between the positive predictive value (or precision) and the sensitivity (also recall) of the test. In our case, precision is defined as the ratio between the number of true positives and the number of points that were predicted to be optimal, while recall is the number of true positives divided by actual number of optimal simulated points. As a result, we obtained that even when using few hundred points, despite the relatively high error in the φ score estimation (10%-20%), the process is still accurate in correctly detecting the areas of optimal operation. Median F-score resulted 0.89, 0.9, 0.92, and 0.94 for 100, 250, 500, and 1000 points, respectively. Also, the rate of false positive was almost zero, which further demonstrate the accuracy of the proposed methodology for obtaining a good characterization of the overall system performance from a very small starting dataset.",
                        "Finally, from our analysis, it resulted that the best fitness score is consistently found for temperatures around 1000 C, 1 bar of pressure, and a value of CH 4 -H 2 S mass feed-ratio between 2.6 and 6.3.",
                        "By considering these inputs, the process outputs resulted in 68% H The same analysis has been tested on the full dataset, without limiting the simulation space to the boundary conditions, and we obtained comparable results (Figures S11 andS12). While the resulting φ score improves with the increasing temperature, at certain values there might occur other side reactions that were not considered in our analysis. On the other hand, the performance of the ML approach, in the process modeling, interpolation, and indirect optimization (F-score), remains unchanged, despite a minimal higher median error (Figure S12).",
                        "A final consideration can be drawn by comparing the two methods employed to generate the simulated and interpolated data.",
                        "We just demonstrated that ML can be effectively used to generate simulated data with an acceptable level of accuracy from a few hundred starting points. On the other end, one could argue that the the SOCM process and to find its optimal operating conditions.",
                        "Though our analysis we found that the optimum process conditions are reached for temperatures around 1000 C, 1 bar of pressure, and a CH 4 -H 2 S feed-ratio between 2.6 and 6.3, resulting into in 68% H 2 S conversion, 96% CS 2 conversion. These conditions will ensure to maximize the BTX yield, while at the same time minimize the CH 4 and H 2 S recycling rate.",
                        "Overall, this work confirms the potential of ML methods in modeling the relationship between reaction conditions (potentially from both predicted and/or experimental data) and reaction outcomes, unlocking the possibility of discerning the effects of each reaction parameter and suggesting the optimum set of reaction conditions, even when the range is not investigated through experiments as in our case. Furthermore, this study indicates that ML can deliver results comparable to those generated with simulation tools, but in a relatively shorter timeframe."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "ACKNOWLEDGMENTS",
            "paragraphs": [
                "Open Access funding provided by the Qatar National Library."
            ],
            "subsections": []
        },
        {
            "title": "DATA AVAILABILITY STATEMENT",
            "paragraphs": [
                "As the authors are preparing a patent application based on this work, we would like to keep the Aspen model file confidential for the time being. However, the source codes and the simulated data for the machine learning analysis are now available on GitHub (https:// github.com/QEERI/SOCM_ML.git)."
            ],
            "subsections": []
        },
        {
            "title": "AUTHOR CONTRIBUTIONS",
            "paragraphs": [
                "Giovanni Scabbia: Methodology (equal); writingoriginal draft (equal); writingreview and editing (equal). Ahmed Abotaleb: Conceptualization (equal); methodology (equal); project administration (equal); writingoriginal draft (equal); writingreview and editing (equal). Alessandro Sinopoli: Conceptualization (equal); methodology (supporting); project administration (supporting); writingoriginal draft (supporting); writingreview and editing (lead)."
            ],
            "subsections": []
        },
        {
            "title": "SUPPORTING INFORMATION",
            "paragraphs": [
                "Additional supporting information may be found in the online version of the article at the publisher's website.",
                "How to cite this article: Scabbia G, Abotaleb A, Sinopoli A.",
                "Sulfur oxidative coupling of methane process development and its modeling via machine learning. AIChE J. 2022;68(9): e17793. doi:10.1002/aic.17793"
            ],
            "subsections": []
        }
    ]
}