{
    "id": "https://semopenalex.org/work/W2804269865",
    "authors": [
        "Seiran Khaledian",
        "Besma Smida",
        "Danilo Erricolo",
        "Farhad Farzami"
    ],
    "title": "Inherent Self-Interference Cancellation for In-Band Full-Duplex Single-Antenna Systems",
    "date": "2018-06-01",
    "abstract": "We propose a new analog self-interference cancellation (SIC) technique for in-band full-duplex transmission in single-antenna systems. We use an RF circulator to separate transmitted (Tx) and received (Rx) signals. Instead of estimating the SI signals and subtracting them from the Rx signals, we use the inherent secondary SI signals at the circulator, reflected by the antenna, to cancel the primary SI signals leaked from the Tx port to the Rx port. We modified the frequency response of the secondary SI signals using a reconfigurable impedance mismatched terminal (IMT) circuit, which consists of two varactor diodes at the antenna port. We can also adjust the frequency band and the bandwidth by controlling the varactor diodes bias voltages. The IMT adjustability makes it robust to antenna input impedance variations and fabrication errors. We analyze and fabricate a prototype of the proposed technique at 2.45 GHz. We achieved more than 40-dB cancellation over 65 MHz of bandwidth. Our technique is independent of the RF circulator and antenna type and it can be applied to any frequency band. It is also very relevant to small mobile devices because it provides a simple and low-power and low-cost adjustable analog SIC technique.",
    "sections": [
        {
            "title": "I. INTRODUCTION",
            "paragraphs": [
                "I N in-band full-duplex (IBFD) communication systems, nodes are able to transmit and receive simultaneously in the same frequency band. IBFD communications have the potential of doubling the spectrum efficiency of communication systems as well as eliminating hidden terminals and the need of duplex filters, improving fairness and network latency [?],",
                "[?], [?], [?], [?], [?]. However, IBFD systems suffer from strong self-interference (SI) signals that are imposed on the received (Rx) signals by the transmitted (Tx) signals. Thus, the major challenge that IBFD systems must confront is reducing SI signals. The amount of self-interference cancellation (SIC) value for an efficient IBFD system depends on the Tx signal power and the noise floor at the receiver. The SI signal level should be reduced to the same level as the receiver noise floor [?], [?]. The main obstacle to cancel out SI signals lies in the fact that they are random and often unpredictable. As the Tx signals go through the digital to analog converter, the upconvert mixer and power amplifier, there are harmonics, linear and nonlinear distortions, extra noise and frequency selective delays that are added to the Tx signals, making them totally different from the original Tx signals at the base-band.",
                "Up to date, many works have proposed different SIC techniques. Recently, the feasibility of a practical IBFD system has been proved [?], [?], [?]. The SIC can be accomplished in three ways: passive cancellation, digital cancellation and analog (RF) cancellation. Passive cancellation uses electromagnetic isolation between Tx and Rx antennas. This method includes physical separation of antennas, directional isolation of antennas, absorptive shielding, polarization diversity, using band-gap structures, inductive loops, wave traps and slots on the ground plane  Fewer works have studied single-antenna IBFD systems compared to multiple antennas configurations. To the best of our knowledge, the first single-antenna IBFD configuration was introduced in [?]. It used two lumped-element circulators and two 3 dB quadrature hybrids to reduce SI signals. This configuration achieved up to 40 dB of isolation between Tx and Rx channels over a 25 MHz bandwidth in the 900 MHz frequency band. Unfortunately, it is costly because it needs two RF circulators and the lumped-element microwave components are hard to implement at higher frequencies, due to low quality factor of inductors and capacitors. Recently, the authors of [?], [?], [?] used a complex feed forward network including multiple delay lines, tunable attenuator along with adaptive The main drawback of this technique is the large Tx insertion loss (half of the Tx power is lost). In [?] a simultaneous transmit and receive antenna with two arm pairs (one pair as Tx and one pair as Rx antennas) in one platform has been proposed. A 39.5 dB isolation between Rx and Tx channels has been achieved by using two 3 dB 180 • hybrids. However, the achieved isolation only applies to the proposed four-arms antenna and cannot be used for a generic IBFD system. A dual-polarized antenna has been used in [?], [?] and up to 60 dB and 47 dB isolation between Tx and Rx ports have been achieved, respectively. Exploiting orthogonal polarizations is one of the diversity schemes used to increase the capacity in multiple-input and multiple-output (MIMO) systems [?].",
                "The novelty of this article is that we use the circulator inherent secondary SI signals reflected by the antenna, to cancel the primary SI signals leaked from the Tx port to the Rx port. This is in contrast to the feed-forward technique which has been widely used in previous studies. We modified the frequency response of the secondary SI signal using an adjustable impedance mismatched terminal (IMT) circuit at the antenna port. Accordingly, our contributions are the following: 1) We introduced a novel and efficient analog SIC technique that uses the RF circulator inherent SI signals and the RF circulator rotation property. This decreases the complexity, cost and power consumption of the SIC circuit by eliminating many RF components (sampler, combiner, attenuator and phase shifter).",
                "2) We proposed a reconfigurable IMT circuit by exploiting two varactor diodes. This increases the system robustness to the antenna input impedance variations, component frequency response deviations and fabrication errors. 3) We fabricated a prototype of single-antenna IBFD system at 2.45 GHz and achieved 40 dB SIC over a 65 MHz bandwidth. Table I summarizes the comparisons between this work and some other state-of-the-art.",
                "The paper is organized as it follows: In Section II, we describe the principle of operation of the proposed inherent SIC technique. In Section III, we present how to build a robust reconfigurable IMT circuit. The simulation and measurement results of a prototype inherent SIC circuit at 2.45 GHz are presented and discussed in Section IV. The system limitation are discussed in this section. Section V concludes the paper.  "
            ],
            "subsections": []
        },
        {
            "title": "C. The Proposed Analog SIC Technique",
            "paragraphs": [
                "The new analog SIC technique is the following: we use the SI signals R A as the cancellation signals. This is different from sampling from the Tx channel as in case of previous works. In other words, we take advantage of the reflected Tx signals at the antenna interface. However, the amplitude and phase of R A must be modified to cancel out I at the receiver. To do so, we add a reconfigurable IMT circuit at the antenna interface to manipulate the amplitude and phase of R A . Fig. 2 shows the new analog cancellation technique integrated in a single-antenna IBFD system. Here, the amplitude and phase of the cancellation signals are modified through the reflection coefficient Γ T seen by the IMT circuit. Thus, the IMT circuit is an impedance mismatched circuit, designed to provide the desired Γ T . The cancellation signals are then added to the Rx channel using rotation property of the RF circulator. As a result, the cancellation signals are tapped and added to the signals at the receiver without using feed forward architecture. It should be noticed, the proposed technique is not dependent on the RF circulator isolation level. The lower isolation needs more reflection and the higher isolation needs less reflection. However, the RF circulators isolation normally are small enough to maintain the reflection portion negligible. Before investigating the possible configurations of IMT circuit, we need to determine the amplitude and phase of Γ T to provide the proper cancellation signal."
            ],
            "subsections": []
        },
        {
            "title": "D. Γ T derivation",
            "paragraphs": [
                "The reflection coefficient Γ T is derived using the signal-flow graph (SFG) of Fig. 2, illustrated in Fig. 3. The circulator SFG is obtained considering the reflection coefficient, insertion loss, and isolation at each port. S 11 , S 22 and S 33 are the return loss of port 1, 2 and 3 of the circulator, respectively. S 21 , S 32 and S 13 are the insertion loss from port 1 to 2, port 2 to 3 and port 3 to 1, respectively. S 12 , S 31 and S 23 are isolation between port 1 and 3, port 1 and 2 and port 2 and 3, respectively. Z in is the input impedance seen by the IMT circuit interface. ",
                "Now the required Γ T can be determined by setting (1) equal to zero, resulting in",
                "From the definition of the reflection coefficient, we have",
                "where Z 0 is the input impedance (characteristic impedance) of the circulator seen at the port 2. The IMT circuit is an impedance matching circuit which transfers the antenna input impedance to Z in . Since |Γ T | << 1, transmission and reception losses are negligible. "
            ],
            "subsections": [
                {
                    "title": "III. RECONFIGURABLE IMT CIRCUIT",
                    "paragraphs": [
                        "This section studies the IMT configuration that delivers the desired Z in . The value of Z in is determined using (2) and (3). However, when it comes to the antenna, the following challenges appear: a) different antennas show different values of input impedance; b) even for a specific antenna, its input impedance varies within its frequency bandwidth of operation; and, c) the input impedance may slightly change due to the fabrication errors or mounting location.",
                        "Thus, an adjustable IMT design is needed to compensate for the antenna input impedance variation and also the fabrication errors and other RF components frequency response deviations. We propose a simple impedance mismatched circuit with two degrees of freedom as: a) a variable series capacitance and, b) a variable shunt capacitance. A mismatched circuit with these two degrees of freedom can match the antenna input impedance and tune potential circuit component frequency response deviations to the desired Z in .",
                        "Fig. 4 shows the schematic of the proposed IMT circuit with one series and one parallel varactor diodes. In this figure, Z L represents the antenna input impedance and C p and C s are the parallel and series variable capacitance realized by varactor diodes. The varactor diode capacitance is a function of its dc bias voltage, C s = f (V s ) and C p = f (V p ). Furthermore, the input impedance of the IMT circuit is a function of C s and C p . Thus, we can tune Z in via V s and V p . The inductor L c is connected to the ground to close the dc current path of the series varactor. We used this technique to build a singleantenna IBFD system at 2.45 GHz, described in the next section.  "
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "A. Components",
            "paragraphs": [
                "This prototype system consists of 3 parts: the antenna, the IMT circuit and the circulator. Each part is analyzed separately.",
                "1) The antenna: We used an air filled stacked patch antenna since it shows a good matching bandwidth and it is easy to fabricate. This type of antenna is also a successful model in the Wi-Fi transmitter market. Fig. 5 shows the layout of the designed antenna at 2.45 GHz. The simulation results from HFSS and S 11 measurements of the antenna are shown in Fig. 6.",
                "2) The circulator: We used a circulator with part number CR5853 from RFCI. This circulator shows 15.5 dB isolation among its port at 2.45 GHz. The measured circulator Sparameters are substituted in ( 2) and (3) to derive Z in , which is shown in Fig. 7. 3) The Reconfigurable IMT Circuit: The layout of the IMT circuit that operates at 2.45 GHz is shown in Fig. 8 and it follows the considerations explained in Section III.",
                "The series and parallel variable capacitance is implemented using varactor diodes, which should be chosen to have small insertion loss and proper capacitance range. We used varactor diode SMV 2019 from Skyworks Inc. Its C-V curve, which shows a slightly dispersive frequency response, is shown in Fig. 9. The circuit model provided by Skyworks is used for the circuit simulation with Advanced Design Systems (ADS) from Keysight.",
                "The substrate is R04003C from Rogers with r = 3.55 and h = 0.8128 mm (32 mil). The dc bias capacitors are from Murata and the inductors are from Coilcraft. The IMT circuit simply includes microstrip transmission lines with two varactor diodes in series and parallel configuration. The dc bias lines feed the varactor diodes and have been separated from the RF signals by proper RF chokes. The meander line keeps the circuit low profile. To improve the simulation accuracy, the electromagnetic co-simulator of ADS was used. The circuit is designed by setting the dc bias voltages of the varactor diodes in the middle of their capacitance range for tuning purposes after fabrication. The simulated input impedance of the designed IMT circuit is shown in Fig. 7. The real and imaginary parts of the IMT circuit impedance are matched for the required Z in at 2.45 GHz. "
            ],
            "subsections": []
        },
        {
            "title": "B. Simulation and Measurement Results",
            "paragraphs": [
                "We evaluate the final performance of the single-antenna IBFD system by measuring the achieved SI cancellation. Thus the amount of Tx signal leaked to the receiver (S 31 ) is measured using an Agilent N5222A PNA Vector Network Analyzer. However, since the input impedance of IMT circuit is a function of the varactor diodes dc bias voltages, the proposed SIC technique provides various SIC levels for different sets of V p and V s . Based on the application, we can set the dc biases to have a high amount of SI cancellation and/or a wideband spectrum SIC. We also can adjust the operating frequency using V p and V s . For example, for V p = 6.8 V and V s = 2.2 V, a 40 dB analog SI cancellation over 60 MHz of frequency bandwidth has been achieved, as shown in Fig. 10. As discussed earlier, the input impedance of the antenna connected to the IMT circuit (Z IMT in ) should match Z in over the desired frequency bandwidth. As shown in Fig. 7, Z IMT in follows Z in at 2.45 GHz over the 60 MHz frequency bandwidth where SI cancellation occurs.",
                "The SIC performance is also measured for other dc voltage bias sets. Fig. 11 shows the achieved cancellation for three extra dc bias voltages. A 65 MHz frequency bandwidth with 40 dB SIC is achieved using V s = 2.1 V and V p = 6.8 V. We shifted the operation frequency from 2.45 GHz to 2.43 GHz using V s = 1.9 V and V p = 7 V. The measured results of Fig. 11 shows that the final performance of the single antenna IBFD system, can be controlled with V p and V s . The measured insertion loss is 0.75 dB, which is negligible compared to other analog cancellation techniques used in previous works, and applies to both the Tx to antenna path and the antenna to Rx path. The maximum dc power consumption of each varactor diode, considering the maximum reverse current of 20 nA, is around 0.15 mW. It is noteworthy that the amount of SIC achieved using this technique is sufficient to make sure that the Rx channel is not saturated by the Tx signal. This technique should be combined with a digital cancellation stage to form a practical IBFD system."
            ],
            "subsections": []
        },
        {
            "title": "C. Dynamic Algorithm for SIC in a Practical Scenario",
            "paragraphs": [
                "We provide a practical algorithm for a real time communication scenario since monitoring the SI signal level is essential for the performance of a full-duplex system. The SI Fig. 12. SI level in f ∈ (2.41, 2.47) GHz based on variable voltages 1 V < Vs < 6 V and 0 V < Vp < 6 V.",
                "signals can be monitored by sending pilot signals and detecting them at the Rx port. In addition, the SI signals level can be minimized by changing the varactor diodes bias voltages and, in particular, we apply the direct pattern search [?] to optimize them. Note that with inherent SIC technique, we use the SI signal inside the circulator. The channel propagation variation inside the circulator is very slow (compared to Tx-Rx channel propagation). Hence, the tuning of the varactor diode bias voltage should be done occasionally and may stay optimal over many transmitted packets. As an example, we consider the 60 MHz bandwidth from 2.41 GHz to 2.47 GHz. Within this bandwidth, the goal of the algorithm is to minimize the average SI (SI) level, which is shown in Fig. 12.",
                "The algorithm steps are as follows:",
                "V and the SI level goal.",
                "ii) Send pilot signals and measure SI level at the four points",
                "iii) Find the minimum SI level among four measurements and update the varactor diodes voltages.",
                "iv) Compare the minimum SI level just found with the goal. If the goal is achieved or the number of iterations has exceeded the maximum then terminate the search.",
                "v) Otherwise, if the updated voltages did not change, set δ = δ/2 or set δ = δ min if δ < δ min otherwise do not change δ and go back to step ii.",
                "Assume the goal is to achieve SI ≤ -45 dB in the target frequency band. A graphical representation of the path followed by the algorithm as it searches the optimal values is shown in Fig. 13.",
                "The initial step k 0 starts at (V 1 , V 2 ) = (1, 1) V with δ = 1 V and δ min = 0.125 V, see Fig. 13(a). By applying the algorithm, the minimum average SI level is tracked at each step (red markers in Fig. 13) and the goal is achieved at k 26 ."
            ],
            "subsections": []
        },
        {
            "title": "D. Linearity, Power Handling and Time Response Limitation",
            "paragraphs": [
                "The non-linearity effects of the varactor diode on our proposed system is discussed in this section. In the receiving mode, the Rx power level is lower than the level of the varactor diode's non-linear region. However, the Tx power is large and it may limit the linearity of the system. The third order intermodulation distortion (IMD 3 ) products (2f 1 -f 2 and 2f 2 -f 1 ) of two fundamental tones at f 1 and f 2 and its third-order intercept point IP 3 is considered as an RF device linearity figure of merit. IP 3 can be read with reference to the input power IIP 3 or to the output power OIP 3 , which are almost the same in our case. In particular, IIP 3 (dBm) = P in (dBm) -0.5IMD 3 (dBc) [?].",
                "To evaluate the varactor diode SMV 2019 linearity limitation, we simulated the diode model in ADS. The fundamental tones have 1 MHz offset from the center frequency at 2.45 GHz with 15 dBm input power. The varactor diode bias voltage is 2.5 V which is about the voltage values to achieve the maximum SIC level. The results show IMD 3 = 47 dBc and IIP 3 = 37.5 dBm.",
                "In order to validate the simulation results, we fabricated an evaluation board to measure the varactor diode IMD 3 , see the inset of Fig. 14(a). The input spectrum of the fundamental tones is monitored to see if the measurement set up is clean from harmonics, Fig. 14(a). IMD 3 = 45.6 dBc that shows a very good agreement with the simulation results and it is acceptable for wireless communication purposes, see Fig. 14(b). The measurement results for IIP 3 are around 37 dBm. Since the proposed technique is independent of the varactor diode types, other types of varactor diodes with better performance may be used. We also measured the IMD 3 level of the IMT circuit, Fig. 15. The IIP 3 level is almost the same as one varactor diode measurement result.",
                "The maximum absolute power handling capability is around  33 dBm for the varactor diode. The measurement are done with 0 dBm input power in the network analyzer. However, the varactor diode capacitance value can be altered by the high input power. The SI level at the center frequency of 2.45 GHz vs. the transmitter power measurement shows that the SI level is maintained under 40 dB up to around 18 dBm of input power with the initial bias voltages. The voltages may need to be tuned to compensate for this effect for higher input power. It should be noticed that the non-linear products from the high Tx signal power may remain an issue, since they will be above the noise level and should be considered in the digital cancellation stage.",
                "The varactor diode time response is the other limitation factor. The level of SIC is a function of the varactor capacitance value. As a result, the diode voltage settling time should be considered. We simulated the unit step response of the diode. The diode voltage variation is less than 1% for t > 1.5 ns. This time delay is very small compared to the data rate for 65 MHz bandwidth. As a result, it does not degrade the communication speed and also it makes the introduced algorithm to run fast."
            ],
            "subsections": [
                {
                    "title": "V. CONCLUSION",
                    "paragraphs": [
                        "We presented a novel analog SI cancellation technique, named inherent SIC. This technique is used in single-antenna IBFD communication systems to cancel out the strong Tx interference imposed on the Rx channel. Contrary to analog cancellation techniques used in other works, here we did not tap from the Tx chain to generate the cancellation signal. We used the secondary inherent SI signal (R A ) to cancel out the primary inherent SI signal (I).",
                        "This technique is implemented using an impedance mismatched terminal (IMT) between antenna and circulator. By using the inherent signal rotation path property of the circulator, we eliminate the RF combiner, RF attenuator and RF phase shifter, thus reducing complexity and cost. Inherent SIC circuit is simple with low profile configuration and significantly low power consumption (up to 0.2 mW).",
                        "Our design is also robust to antenna input impedance variations and can compensate for fabrication errors and component frequency response deviations by tuning the varactor diodes dc voltage biases. We experimentally showed that our design can show flexible performance depending on the application. As an example, we achieved more than 40 dB of cancellation over 65 MHz of bandwidth. The direct pattern search algorithm is introduced to optimize the SIC level in a practical communication scenario and the varactor diode limitations are discussed to address the practical implementation challenges. "
                    ],
                    "subsections": []
                }
            ]
        }
    ]
}