{
    "id": "https://semopenalex.org/work/W2070413633",
    "authors": [
        "Peng Zhang",
        "Yanxin Liu",
        "Yong Zheng",
        "Dexian Zheng",
        "Juan Shi",
        "Shilian Liu",
        "Yaxi Zhang"
    ],
    "title": "Targeting a Novel N-terminal Epitope of Death Receptor 5 Triggers Tumor Cell Death",
    "date": "2010-03-01",
    "abstract": "Tumor necrosis factor-related apoptosis-inducing ligand receptors death receptor (DR) 4 and DR5 are potential targets for antibody-based cancer therapy. Activation of the proapoptotic DR5 in various cancer cells triggers the extrinsic and/or intrinsic pathway of apoptosis. It has been shown that there are several functional domains in the DR5 extracellular domain. The cysteine-rich domains of DR5 have a conservative role in tumor necrosis factor-related apoptosis-inducing ligand-DR5-mediated apoptosis, and the pre-ligand assembly domain within the N1-cap contributes to the ligand-independent formation of receptor complexes. However, the role of the N-terminal region (NTR) preceding the N1-cap of DR5 remains unclear. In this study, we demonstrate that NTR could mediate DR5 activation that transmits an apoptotic signal when bound to a specific agonistic monoclonal antibody. A novel epitope in the NTR of DR5 was identified by peptide array. Antibodies against the antigenic determinant showed high affinities for DR5 and triggered caspase activation in a time-dependent manner, suggesting the NTR of DR5 might function as a potential death-inducing region. Moreover, permutation analysis showed that Leu6 was pivotal for the interaction of DR5 and the agonistic antibody. Synthetic wild-type epitopes eliminated the cytotoxicity of all three agonistic monoclonal antibodies, AD5-10, Adie-1, and Adie-2. These results indicate that the NTR of DR5 could be a potential target site for the development of new strategies for cancer immunotherapy. Also, our findings expand the current knowledge about DR5 extracellular functional domains and provide insights into the mechanism of DR5-mediated cell death.",
    "sections": [
        {
            "title": "EXPERIMENTAL PROCEDURES",
            "paragraphs": [
                "Reagents and Antibodies-Recombinant human TRAIL was purchased from R & D Systems (Minneapolis, MN). The homemade mouse anti-human DR5 monoclonal antibody AD5-10 was described previously by Guo et al. (17). The QuikChange II XL site-directed mutagenesis kit was purchased from Stratagene Corp. (La Jolla, CA). Antibodies were sourced as follows: anti-FLAG was from Sigma; anti-phospho-ERK1/2, anti-ERK1/2, anti-phospho-MEK1/2, anti-MEK1/2, anti-FADD, anti-caspase-3, -8, and -9, and anti-cFLIP were from Cell Signaling Technology, (Danvers, MA); anti-DR4, anti-DR5, anti-DcR1 and anti-DcR2 were from Chemicon (Temecula, CA); phycoerythrin (PE)-labeled anti-mouse DR5 was from eBioScience Inc. (San Diego); PE-conjugated mouse IgG 2B isotype and anti-human DR5 (clone FAB71908) were from R & D Systems Inc.(Minneapolis, MN); normal mouse IgG 3 control and anti-RIP1 were from Santa Cruz Biotechnology (Santa Cruz, CA); horseradish peroxidase (HRP)-conjugated and FITC/TRITC-conjugated secondary antibodies were from ZhongShan Co., Beijing, China).",
                "Cell Lines, Cell Culture, and Transfection-HeLa (human cervix carcinoma), HCT116 (human colon cancer), and HEK293T/17 (human embryonic kidney) cell lines (ATCC, Manassas, VA) were cultured in high glucose Dulbecco's modified Eagle's medium (Invitrogen) supplemented with 10% fetal bovine serum (Hyclone, Logan, UT) and penicillin/streptomycin (100 g/ml of each). The Jurkat (human T-lymphoma) and H460 (non-small-cell lung cancer) cell lines were cultured in RMPI 1640 medium (Invitrogen) containing 10% heat-inactivated fetal calf serum (Hyclone) and penicillin/streptomycin. The NIH3T3 (mouse embryonic fibroblast) cell line was cultured in high glucose Dulbecco's modified Eagle's medium supplemented with 10% calf serum (Hyclone) and penicillin/streptomycin (100 g/ml of each). All cell lines were grown in 5% CO 2 at 37 °C. Cells were transfected with appropriate plasmids using Lipofectamine 2000 (Invitrogen) according to the manufacturer's protocol. Analyses were performed 48 h after transfection unless otherwise noted.",
                "Plasmid Constructs, Retrovirus Packaging, and Transduction-Full-length DR5a cDNA in pCR3.1 (Invitrogen) was inserted into the p3ϫFLAG-cmv-14a vector (Sigma) at the EcoRI/XbaI restriction site. The extracellular domain (corresponding to 1-128 amino acids) of DR5 was ligated with the transmembrane and intracellular domains (corresponding to 657-1259 amino acids) of the rat ErbB2 receptor to generate the chimeric receptor DR5e/ErbB2i (Der, where Der is death receptor 5 extracellular domain fused with ErbB2 intracellular domain) (Fig. 4A). Briefly, PCR was used to introduce an EcoRI site into the 5Ј end of the DR5 cDNA fragment encoding the extracellular domain (hDR5-ECD) and an XhoI site into the 3Ј end of the ErbB2 cDNA fragment encoding its transmembrane and intracellular domains. The cDNA fragments were subsequently inserted into the pMSCV-IRES-GFP retroviral vector using the EcoRI/XhoI restriction site to generate the chimeric receptor DR5e/ErbB2i (Der) expression vector. Site-directed mutagenesis was conducted using the QuikChange II XL site-directed mutagenesis kit (Stratagene) according to the manufacturer's instructions to produce DR5e/ErbB2i epitope L6A (Der-L6A) and DR5e/ErbB2i-truncated (Der-⌬) mutant expression vectors. The primer sequences are listed in Table S1. The retroviral vectors encoding the chimeric receptor Der and its mutants, Der-L6A and Der-⌬, were transduced into HEK293T/17 cells to generate viral particles. NIH3T3 cells were incubated with a viral suspension containing Polybrene (8 g/ml) for 16 h and then washed with PBS and cultured in complete medium before analysis.",
                "Membrane Protein Extraction-5 ϫ 10 7 Jurkat cells were harvested and washed with 20 ml of HB buffer (20 mM Tris-HCl (pH 7.5), 4 mM EDTA, 2 mM EGTA, 10% glycerol, 1ϫ protease inhibitor mixture). Then cells were suspended in 4 ml of HB buffer containing 300 mM NaCl and 1% Triton X-100 followed by a 30-min incubation at 4 °C. The lysed cells were centrifuged at 86,000 ϫ g for 45 min at 4 °C. The membrane fraction were collected and diluted in 1ϫ HB buffer containing 150 mM NaCl and 0.5% Triton X-100 with proper concentration.",
                "OPAL and Permutation Array-The OPAL was described by Rodriguez et al. (22). The peptide arrays were generated on cellulose membranes using an Intavis Multipep instrument (Intavis, Germany) and Fmoc (N-(9-fluorenyl)methoxycarbonyl)-based chemistry according to the manufacturer's instructions. The estimated peptide yield at each spot was about 5 nmol. All peptide sequences were based on the primary structure of mature DR5a (NCB accession number NP_671716.1). The sequence of the primary structure was addressed by using an oriented peptide walking library synthe-sized and printed onto a cellulose membrane. The walking library consisted of a series of overlapping 12-amino acid peptides with a sliding window of two residues. Alanine scanning assay was used to identify the key amino acids in the epitope. Each amino acid residue of the indicated peptide was replaced by alanine. To generate a permutation array, each degenerated residue of the specific sequence was substituted with any of the 20 amino acids. The membrane was first blocked with 5% bovine serum albumin in TBST buffer (0.1 M Tris-HCl (pH 7.4), 150 nM NaCl, and 0.1% Tween 20) for 2 h at room temperature and followed by incubation with AD5-10 or an isotype control antibody of normal mouse IgG3 (0.2 g/ml) for 4 h at room temperature. The array membrane was then washed three times with TBST buffer and incubated with HRP-conjugated goat anti-mouse IgG for 2 h at room temperature. Subsequently, the membrane was washed again and peptide spots that bound AD5-10 were visualized by enhanced chemiluminescence (Millipore Corp., Danvers, MA). If a peptide in the library pool at any given residue was preferred by the antibody, the peptide would be detected by immunoblotting and would show up as a positive spot.",
                "In Vitro Neutralization Assay-A series of peptides was synthesized, partially corresponding to the amino acid sequence of DR5. Synthetic wild-type epitopes are AQI 1 TQQDLAPQQRA 12  and AI 1 TQQDLAPQQRA 12 . The mutant peptides possessed identical sequences, except at position 6 where leucine was replaced with alanine. The sequences of the control peptides were either from death receptor 5 ( 26 CPPGHHISEDGRDC 39 and GQDYSTHWNDLLFCLRC 61 ) or a random sequence (SQR-LHTPCFNKMEA). The purity of the peptides, which was judged to be approximately Ͼ95%, was confirmed by high pressure liquid chromatography and mass spectrometry. For the neutralization assay, these peptides were incubated with AD5-10 or rsTRAIL at 37 °C for 2 h. The mixture was then added to the cell culture medium. The final concentrations of the synthesized peptides, AD5-10 (or rsTRAIL), were 10 M and 500 ng/ml, respectively. After treatment, the cell viability assay was conducted.",
                "Hoechst 33258 Staining and Cell Viability Assay-Hoechst 33258 staining was performed as described previously (23). Briefly, cells were fixed with 4% paraformaldehyde for 30 min at room temperature and then washed once with PBS. Hoechst 33258 (1 g/ml) was added to the fixed cells, incubated for 15 min at room temperature, and washed with PBS. Cells were mounted and examined by fluorescence microscopy. Apoptotic cells were identified by the condensation and fragmentation of their nuclei. For cell viability assay, cells (10 4 cells/well in 96-well plates) were incubated with the indicated concentration of AD5-10 or rsTRAIL at 37 °C for the indicated time. Cell viability was assayed using the Cell Counting Kit-8 (Dojindo Laboratories, Kumamoto, Japan) according to the manufacturer's specification. Relative cell viability ϭ absorbance of treated sample/absorbance of control sample ϫ 100%.",
                "Enzyme-linked Immunosorbent Assay-Binding of antibodies to synthetic peptides or DR4/5 was carried out by an enzyme-linked immunosorbent assay in 96-well plates. Enzyme-linked immunosorbent assay plates were first coated with synthetic peptides (100 ng/well) or recombinant soluble human DR4/5-ECD (300 ng/well) in 0.1 M sodium phosphate (pH 9.6). The plates were rinsed with PBS containing 0.05% (v/v) Tween 20 (PBS/Tween) and incubated at room temperature for 2 h with 3% bovine serum albumin in PBS/Tween to block nonspecific sites, followed by three more rinses in PBS/ Tween to remove excess reagents. The plates were then incubated at 37 °C for 2 h with 100 l of the indicated concentrations of primary antibodies. Subsequently, the plates were washed three times with PBS/Tween and incubated with 100 l of HRP-conjugated secondary antibodies at 37 °C for 60 min. The excess of conjugate was removed by washing the plates three times with PBS/Tween. The amount of bound conjugate was determined by adding tetramethylbenzidine substrate solution and incubated for 30 min. The reaction was stopped by adding sulfuric acid, and absorbance was measured at 450 nm on a microplate reader.",
                "Immunofluorescence and Surface Staining-Cells were grown on glass coverslips coated with poly(L-lysine) and collagen, fixed in 4% paraformaldehyde, and blocked with 5% bovine serum albumin in PBS. Primary antibody incubation was done at 4 °C overnight, followed by incubation for 1 h at room temperature with FITC-labeled secondary antibody in the dark. The samples were washed three times with cold PBS, and then the coverslips were mounted on glass slides using mounting media with propidium iodide to allow visualization of the nuclei. Images were captured by confocal microscopy (Zeiss LSM 510, Germany). For the surface expression assay, cells (10 6 ) were washed twice with PBS and suspended in 100 l of flow cytometry staining buffer (1ϫ PBS, 3% fetal bovine serum). For direct staining, PE-conjugated antibody was added to the cell suspension and kept in the dark at 4 °C for 30 min. For indirect staining, cells were incubated with the primary antibody (1:50 to 1:100) at 4 °C for 60 min and then washed with 1 ml of cold staining buffer and incubated with FITC-or TRITClabeled secondary antibody in the dark at 4 °C for 60 min. After an additional wash with 2 ml of cold PBS, cells were suspended in 500 l of cold staining buffer, and 10 4 cells per sample were analyzed by flow cytometry (Pharmingen).",
                "Immunoprecipitation-For TRAIL-DISC analysis, 10 8 cells were stimulated with 5 g of FLAG-TRAIL cross-linked with 5 g of anti-FLAG M2 in 1 ml of medium at 37 °C for the indicated times. For antibody-DISC analysis, 10 8 cells were stimulated with 5 g of different anti-DR5 agonistic antibodies in 1 ml of medium at 37 °C for the indicated times, respectively. Cells were then washed with cold PBS and lysed in 1 ml of lysis buffer containing 1% Nonidet P-40, 20 mM Tris-HCl (pH 7.5), 150 mM NaCl, and 10% glycerol. In unstimulated control, 1 g of AD5-10 was added after lysis to immunoprecipitate death receptor 5. Lysates were pre-cleared with Sepharose 4B (GE Healthcare) and immunoprecipitated overnight at 4 °C with protein G-Sepharose beads (GE Healthcare). In both cases, beads were then washed three times with the lysis buffer before being processed for immunoblotting.",
                "Immunoblotting Analysis-After the indicated treatment, the cells (2-3 ϫ 10 6 ) were washed twice with cold PBS and lysed in SDS-PAGE loading buffer (50 -100 l). The proteins in the cell lysate were separated by 10% SDS-PAGE and transferred onto a polyvinylidene difluoride membrane (GE Healthcare). The membrane was then probed with the indicated primary antibody at 4 °C overnight, followed by incubation with horseradish peroxidase-conjugated secondary antibody for 1.5 h at room temperature. Immunoreactive proteins were visualized by enhanced chemiluminescence (Millipore Co, Danvers, MA) and autoradiography.",
                "Computational Molecular Simulation-Structures were entered into molecular operating environment 2006.08 (Chemical Computing Group, Montreal, Canada). Briefly, the \"V L ϩ V H \" fragment of AD5-10 was determined and refined using the molec-ular operating environment antibody homology modeling module. The interaction between AD5-10 and the core epitope was assessed using the ligand-receptor docking module in the CHARMM27 force field (24). After a series of models was created, a functional model was culled from the candidates by evaluating the fitness and importance of the molecular descriptors that were built interactively. All structure refinements were performed by macromolecular protonation and energy minimization. Output for the final interaction model and predictions was shown after ligand explorer modification."
            ],
            "subsections": []
        },
        {
            "title": "RESULTS",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "Novel Death-inducing Region Is Located within the DR5 N-terminal",
                    "paragraphs": [
                        "Region-Most antigenic determinants recognized by antibodies can be thought of as special three-dimensional surface features and protein structures of an antigen molecule. Antibody recognition requires a precise fit of these features. To map the epitope in DR5 recognized by AD5-10, we first identified the type of the antigenic determinant, which was considered to be either a sequential epitope or conformational one. DR5 ϩ Jurkat cells were lysed and subjected to denatured SDS-PAGE to eliminate the conformational information of DR5, followed by immunoblotting with the AD5-10 antibody. As shown in Fig. 1A, AD5-10 specifically recognized the two denatured DR5 alternative splicing variants, DR5a and DR5b, implying that both DR5a and DR5b share the same region recognized by AD5-10, and the alternative splicing region in DR5b can be excluded. Moreover, this finding suggested that AD5-10 might recognize a linear epitope instead of a conformational one. To verify this result, immunofluorescence assays were carried out in Jurkat and HeLa cells. As shown in Fig. 1, B and C, AD5-10 bound to Jurkat and HeLa cell membranes specifically (also seen in supplemental Fig. S1). These data indicated that AD5-10 recognizes not only a denatured epitope, but also a native epitope on DR5 that should be a continuous and linear sequence.",
                        "Although biochemical analysis of DR5 identified several ectodomain O-(N-acetylgalactosamine-galactose-sialic acid) structures, the precise O-glycosylation sites in DR5 and how they affected DR5-mediated signaling still remain unelucidated. There are three potential O-glycosylation regions (25). Two of them ( 19 SSPS 22 and 75 TTTRNTVCQCEEGT 88 ) are in the common ECD sequence of mature human DR5 splice variants, and the third is located within the alternatively spliced DR5 region. However, the effect of O-glycosylation modification on the DR5-AD5-10 complex can be ignored in our study because AD5-10 was generated by immunizing mice with recombinant DR5a expressed in Escherichia coli. Then an unmodified OPAL screening was applied to precisely detect the amino acid residues of the epitope in the extracellular region recognized by AD5-10.",
                        "A series of overlapping 12-amino acid peptides covering the major part of the mature human DR5 ectodomain (residues Glu Ϫ4 to Lys 126 without the signal peptide Met Ϫ55 to Ala Ϫ5 ) was synthesized and assembled on a cellulose membrane in an array format with a sliding window of two residues. A total of 60 peptides (Table 1) was generated, and each numbered peptide differed from the adjacent one by two amino acids. The cellulose membrane was immunoblotted with AD5-10 and probed with an HRP-labeled secondary antibody. As shown in Fig. 1D, strong binding spots corresponding to peptides 1-5 were observed, whereas nonspecific binding was excluded using a negative control. Inspection of the peptide sequences corresponding to the positive signals revealed that AD5-10 bound to peptides containing QDLAP residues (Fig. 1E). Due to the appearance of the strongest signal at peptides 2 ( Ϫ2 ALITQQD-LAPQQ 10 ) and 3 ( 1 ITQQDLAPQQRA 12 ), we were able to determine that AD5-10 recognizes the epitope 1 ITQQD-LAPQQ 10 with the core sequence of QDLAP in the DR5 N-terminal domain. This finding has not been reported previously.",
                        "Leu 6 in the Novel Epitope of DR5 Has a Pivotal Role in the Interaction of DR5 and AD5-10-To identify critical residues in the novel epitope of DR5, alanine scanning and permutation arrays were performed. With the purpose of keeping the maximum immunogenicity of the epitope, a 13-amino acid peptide, Ϫ1 LITQQDLAPQQRA 12 , was applied as a candidate by combining the sequences of peptides 2 and 3. As shown in Fig. 2A, substitution of any one residue in 5 DLA 7 led to either complete or partial loss of the peptide binding activity of AD5-10. By contrast, replacement of any other residues outside the \" 4 QDLAP 8 \" by Ala had no significant effect on antibody binding to the epitope. Notably, residue Leu 6 played a key part in AD5-10 binding to the epitope suggesting that the hydrophobic amino acid-rich domain around Leu 6 is important for antibody binding (Fig. 6). Permutation analysis confirmed the importance of the hydrophobic Leu 6 residue in AD5-10 binding to the epitope. As shown in Fig. 2B, substitution of isoleucine or phenylalanine residues with leucine significantly restored the binding ability as compared with the other permutations. Similarly, Asp 5 and Ala 7 were also vital for epitope binding to AD5-10. However, Leu Ϫ1 could be changed to any amino acid without incurring a notable loss in affinity. Basic residues appeared to be disfavored at the pair of glutamines near the C terminus of the epitope, whereas 3 QQ 4 could be substituted with most of the natural amino acids. Collectively, these data demonstrate at a single amino acid level that the hydrophobic amino acid residue, especially Leu 6 , has a pivotal role in the interaction between DR5 and AD5-10.",
                        "To further explore the exact binding site of AD5-10 in the whole DR5 molecule, a pCMV-FLAG plasmid encoding fulllength DR5 fused with a FLAG tag at the C terminus was constructed, and a substitution of Leu 6 with Ala was made in DR5. Wild-type and mutant DR5 were expressed in mammalian cells, immunoblotted using AD5-10, and probed with anti-FLAG antibody. As shown in Fig. 2C, both wild-type and mutant FLAG-tagged DR5 were detected, and only the wildtype molecule was recognized by AD5-10. These results reveal a crucial role for Leu 6 in the antigen-antibody recognition.",
                        "Synthetic DR5 Epitope Eliminates the Cytotoxicity of AD5-10-AD5-10 can kill a variety of tumor cells in vitro through binding with DR5. To further confirm the functionality of the epitope recognized by AD5-10, a series of peptides derived from the wild-type epitope was synthesized (Table 2). To increase water solubility of these peptides, Ala or AQ was added to the N terminus of 1 ITQQDLAPQQRA 12 . The mutant peptides possessed identical sequences, except at position 6 where leucine was replaced with alanine. Earlier reports showed that an \"50s loop\" within the cysteine-rich domain 1 (CRD1) of DR5-ECD is crucial for TRAIL-DR5 interaction (26). An N1-cap (residues 26 -39) contains a pre-ligand assembly domain that mediates death receptor-death receptor interactions (27). Thus, two peptides, N1 ( 26 CPPGHHISEDGRDC 39 ) and CRD1A ( 45 GQDYSTHWNDLLFCLRC 61 ), corresponded to the primary structure of the N1-cap, and CRD1A of DR5 were generated as negative controls. A random peptide was created to rule out nonspecific binding of AD5-10. These peptides were preincubated with AD5-10 or rsTRAIL, and the mixture was then added into DR5 ϩ Jurkat T lymphoma cells, followed by a cyto- toxicity neutralization assay. As shown in Fig. 3A, both AD5-10 and rsTRAIL triggered significant cell death in Jurkat T lymphoma cells. Wild-type epitopes 1 and 2 completely eliminated AD5-10-induced cell death, although the mutant epitopes failed to do so (Fig. 3, B, C andH). Neither the wild-type peptides nor the mutants of the epitope neutralized rsTRAIL-induced cell death in Jurkat cells (Fig. 3, D, E, andG). Moreover, none of the control peptides eradicated AD5-10 and rsTRAIL cytotoxicity, indicating that AD5-10 did not bind to other functional domains of DR5-ECD, and TRAIL failed to interact with the linear 50s loop. These data provide further evidence that AD5-10 functionally recognizes the epitope. Epitope Modulates a Signaling Pathway upon Stimulation with AD5-10-Most cancerous tissues and cells express high levels of DR5, whose overexpression always induces a caspase cascade and apoptosis. ErbB2 is a receptor tyrosine kinase belonging to the family of epidermal growth factor receptors, which is generally involved in cell differentiation, proliferation, and tumor growth (28). In an attempt to confirm the signaling capacity of the DR5 epitope in cell death, a series of chimeric receptor constructs and mutants was established. Der was a chimeric receptor containing the DR5 extracellular domain fused with the intracellular and transmembrane domains of ErbB2 (Her-2), whereas Der-L6A was the Der epitope mutant with L6A. Der-⌬ was the mutant with deletion of the tyrosine kinase domain (Fig. 4A). These constructs were transduced into mouse NIH3T3 cells with null expression of ErbB2 (29) so that the endogenous ErbB2 expression could be avoided and the signaling capacity of the DR5 epitope could be explored. The expression of Der, Der-L6A, and Der-⌬ on the cell surface was validated (Fig. 4B). Cells expressing these chimeric receptors were treated with AD5-10 and/or rsTRAIL, and the signaling pathway mediated by Der, Der-L6A, and Der-⌬ was investigated. As shown in Fig. 4C, upon stimulation with AD5-10, ERK1/2 was significantly phosphorylated over a 10 -90-min time course in cells expressing Der but not in cells expressing Der-L6A. Compared with AD5-10, rsTRAIL can activate ERK phosphorylation in both Der ϩ and Der-m ϩ cells (Fig. 4D). It indicated that AD5-10 activated the tyrosine phosphorylation of the chimeric receptor tyrosine kinase by binding to the epitope, whereas the N terminus of the DR5-ECD did not mediate the formation of TRAIL-DR5 complex. Similarly, after treatment with AD5-10, both ERK1/2 and MEK1/2 were markedly phosphorylated in cells expressing Der, but not in cells with Der-L6A or Der-⌬ expression (Fig. 4, E andF). Although bound to AD5-10 and/or TRAIL, the deletion mutant Der-⌬ failed to activate MAPK. In line with our previous findings, both AD5-10 and rsTRAIL can bind to wild-type DR5-ECD and show synergistic effect on MAPK activation (Fig. 4F). These data indicate that the epitope modulates the signaling pathway in cells stimulated with AD5-10.  Epitope Functions as a Novel Death-inducing Region-We investigated the biological function of the epitope in the death of tumor cells. The hapten-peptide \"CLITQQDLAPQQRA\" harboring the epitope core sequence was synthesized as an immunizing peptide. Keyhole limpet hemocyanin was then conjugated to the N-terminal cysteine of the synthetic peptide. The complex was subsequently used to immunize BALB/c mice to generate the monoclonal antibody against the epitope. Two monoclonal antibodies against the death-inducing epitope, Adie-1 and Adie-2, were established with specific high affinity (K d ϭ 1.153 Ϯ 5.180 nM and K d ϭ 1.202 Ϯ 6.463 nM, respectively), although not interacting with DR4. Compared with AD5-10, both Adie-1 and Adie-2 specifically bound to DR5-ECD as well (Fig. 5A). Moreover, Leu 6 still played a key part in Adie-1/2 recognition pattern (Fig. 5B and supplemental Fig. S2). As shown in Fig. 5C, the viability of Jurkat lymphoma cells and HCT116 colon cancer cells treated with the two antibodies were dramatically decreased. These data suggested these antibodies possess an ideal cell death inducing activity, which was confirmed by Hoechst 33258 staining of HCT116 cells. Significant chromatin condensation and fragmentation were visualized by fluorescence microscope (Fig. 5D). Further Western blot analysis demonstrated that caspase-8, -9, and -3 were activated by the two antibodies in a time-dependent manner within 1 h in Jurkat and HCT-116 cells (Fig. 5E). In agreement with our hypothesis, synthetic wild-type epitope neutralized the tumoricidal activity of all anti-DR5 mAbs but not rsTRAIL (Fig. 5F). These data indicate that the two antibodies against the epitope exert tumoricidal activity and the NTR of DR5 contain a novel death-inducing domain.",
                        "NTR-mediated DR5 Activation Initiates DISC Formation-To elucidate the molecular components involved in agonistic anti-DR5 mAbs signaling through DR5, we analyzed death-inducing signaling complex (DISC) associated with anti-DR5 mAbs-DR5 complex, compared with FLAG-tagged TRAIL treatment. Jurkat cells express only DR5, but not other death receptors, and can be killed by TRAIL through apoptosis (30,31). Treatment of Jurkat T cells with TRAIL led to the rapid recruitment of FADD and pro-caspase-8 to the precipitated complexes (Fig. 6A), consis- tent with the previous results (32)(33)(34). Interestingly, agonistic anti-DR5 mAbs, AD5-10 and Adie-1/2, initiated DISC assembly containing DR5, FADD, caspase-8, and RIP1 (Fig. 6A and supplemental Fig. S3).",
                        "Non-small cell lung cancer cells, even though highly expressing DR5, demonstrated more sensitivity to TRAIL than to AD5-10 (18). Cleavage of c-FLIP L was observed in H460 treated with TRAIL, and inhibition of endogenous c-FLIP L expression significantly enhanced AD5-10-induced H460 cell death. All the above findings indicated the involvement of c-FLIP in DISC formation in H460 cells, which has been described everywhere (35). As shown in Fig. 6B, anti-DR5 mAbs DISC assembly in H460 cells involved the agonistic receptor DR5, decoy receptor DcR2, the adaptor protein FADD, caspase-8, and c-FLIP. The same was true for TRAIL DISC formation, except that in addition the endogenous DR4 and DcR1 coimmunoprecipitated with DR5 in a ligand-dependent manner. RIP1 was detected in TRAIL-induced DISC in H460 cells. These data reveal differential composition of DISC in the TRAIL signaling complex and the agonistic anti-DR5 mAbs signaling complex."
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "DISCUSSION",
            "paragraphs": [
                "TRAIL attracts great research interest for its selective induction of apoptosis in malignant cells via its receptors, DR5 and DR4. Potential clinical applications of rsTRAIL or various agonistic DR5 monoclonal antibodies are being tested in various clinical stages (36 -38).",
                "Previous reports showed that there are two disulfide bridges within the mature DR5 extracellular region. These loops divide soluble DR5 into three modular compositions as follows: the N1-cap (residues 26 -39), the cysteine-rich domain 1 (residues 42-82), and the cysteine-rich domain 2 (CRD2, residues 84 -123) (39). The N-terminal cap contains a partial cysteine knot with a single noncanonical disulfide (40). Both cysteine-rich regions have \"A ϩ B\" modules, which are composed of 12-17 and 21-24 amino acids, respectively. They are defined by the consensus sequences C1-X 2 GX(Y/F)XX 4 -9 -C2 and C1-X 2 -C2-X 3-6 X 5 -C3-TX 2-5 NTV-C4 (here n in X n is the number of intervening amino acids), respectively. The A module exhibits a single FIGURE 4. MAPK pathway is investigated in chimera signaling. Before treatment, all cells were starved in serum-free medium for 24 h and then cultured in fresh assay medium. Then NIH-chimera cells were treated with 500 ng/ml AD5-10 or 500 ng/ml rsTRAIL for the indicated times. Lysates were probed for protein phosphorylation by Western blot using the respective specific antibodies. A, schematic diagram depicting DR5e/ ErbB2i and derived chimeric receptors. B, expression of surface chimeras in NIH3T3 cells. NIH3T3 cells were transfected with chimeric constructs and stained with PE-labeled anti-DR5 antibody (FAB 71908) or AD5-10 and TRITC-labeled secondary antibody followed by flow cytometry. C and D, immunoblot analysis of the activation of ERK in NIH3T3 chimeras treated with 500 ng/ml AD5-10 (C) or rsTRAIL (D) for the indicated times. E and F, analyses of phosphorylated ERK1/2 and phosphorylated MEK1/2 levels in NIH3T3 wild-type or NIH3T3 chimera-transfected cells with 500 ng/ml AD5-10 (E) and/or rsTRAIL (F) treatment for 15 min. p-, phosphorylated; ICD, intracellular domain. All experiments were repeated at least three times with similar results.",
                "disulfide bond between C1 and C2 (C1:C2), although the B module has two disulfide bonds (C1:C3 and C2:C4). The N1 module has only one disulfide bond but is structurally related to the B module. Residues 26 -32 of the N1 module, which is structurally homologous to the B module, are involved in tight backbone interactions with the A module in CRD1 of DR5 (39).",
                "Structural analysis of the TRAIL-DR5 complex suggests that the cysteine-rich regions, especially the 50s loop (residues 50 -64) and the \"90s loop\" (residues 90 -103), on the receptor have a conservative and functional role in mediating receptor function (26). It has been proposed that the molecular mechanism shared by agonistic anti-DR5 antibodies involves mimicking of the binding of TRAIL to these two sites, with subsequent receptor aggregation and apoptotic signaling cascades. This idea is supported by the evidence that binding sites for those agonists and the endogenous DR5 ligand TRAIL on DR5 are overlapping (41,42) Other regions of the DR5 extracellular domain, however, may also have their own characteristics. For instance, the N-terminal pre-ligand assembly domain is located within the partial N1-cap, which contributes to the ligand-independent formation of receptor complexes and plays a crucial role in the function and signaling of death receptors (27). This leaves us to question whether there are any other undefined regions in DR5 that can function as death triggers.",
                "We previously described a novel anti-human DR5 agonistic monoclonal antibody, AD5-10, which synergically complements the tumoricidal activity of rsTRAIL and yet shows undetectable cytotoxicity toward normal cells. Unlike other DR5 agonistic antibodies reported in the literature, where bivalency is required to trigger cell death, the monovalent scFv of AD5-10 alone induces cell death without crosslinking (43), raising the question of how AD5-10 activates DR5 and transmits the cell death signal.",
                "In this study, we used a synthetic peptide array to identify a novel death-inducing epitope within the NTR of DR5. The NTR (position 1-23) preceding the N1-cap of DR5 used to be considered structurally flexible, and its function has not been clarified yet, because the first 23 residues are disordered and not expected to have regular secondary structure (26,39). Interestingly, our experiments show that the linear and highly hydrophobic sequence \" 4 QDLAP 8 \" within this region is recognized by the agonistic antibody AD5-10. Fine mapping  12 was probed with 0.2 g/ml AD5-10, Adie-1, or Adie-2, respectively. The first and the last spot corresponded to the parental peptide, whereas the other spots represented an Ala-substituted analogue of wild-type (wt) sequence as indicated above the individual spots. C, tumoricidal function of Adie-1 and Adie-2 compared with AD5-10. Jurkat or HCT116 cells were incubated with 500 ng/ml anti-DR5 mAbs or rsTRAIL for 8 h. Cell viability was determined by a CCK-8 assay. D, Hoechst 33258 staining. HCT116 cells were cultured with 500 ng/ml anti-DR5 mAbs or rsTRAIL for 4 h. After fixation, cells were stained with Hoechst 33258 (1 g/ml), and nuclear condensation and fragmentation of chromatin were observed by fluorescence microscopy (20ϫ). The excitation wavelength was 380 nm. E, Jurkat cells and HCT116 cells were incubated with 500 ng/ml anti-DR5 mAbs or rsTRAIL for the indicated times. The activation of caspase-8, -9, and -3 was tested using the respective antibodies. F, Western blot analysis of caspase-3 activation in Jurkat cells treated with 500 ng/ml anti-DR5 mAbs or rsTRAIL in the absence or presence of synthetic wild-type epitope for 2 h. All experiments were repeated at least three times with similar results. GAPDH, glyceraldehyde-3-phosphate dehydrogenase.",
                "suggests that the Leu residue at position 6 (Leu 6 ) is vital for the antibody recognition. Replacement of Leu 6 with Ala in a synthetic peptide results in a complete loss of antibody binding activity.",
                "In the chimeric receptor assay, the DR5 extracellular domain was linked to the MAPK signaling pathway. The activated chimeric receptor results in the downstream phosphorylation of ERK and MEK as long as the intracellular tyrosine kinase domain is kept intact. However, the mutant chimeric receptor lacking the hydrophobic profile at position 6 (Ala 6 ) failed to bind to AD5-10 and prime the kinase activation of MAPK. However, the mutant chimeric receptor could still interact with TRAIL and be functional, given that the 50s and 90s loop existed. Therefore, we imagine that DR5 is simultaneously able to bind to AD5-10 and TRAIL. This might explain why there is a synergistic effect between TRAIL and AD5-10 with respect to death inducing activity.",
                "Because there is a lack of electron density in crystal structure determination, the first N-terminal 28 residues are structure-disordered and even have an irregular secondary structure (26,39). Thus, it is difficult to include this confusing part when modeling the DR5 extracellular structure. Also, it is more complicated to estimate the overall conformational switch when DR5 binds to its agonistic antibody. We showed that a linear epitope within the complicated fraction is functional when recognized by AD5-10. Together with the findings of Shi et al. (43), the core epitope of DR5 and the scFv-like fragment (V L ϩ V H ) of AD5-10 can be used to model the epitope recognition pattern. By antibody homology modeling of AD5-10, we found that the complementary-determining regions (CDRs) of the light and heavy chain variable domain formed a hydrophobic binding pocket to accommodate the \" 4 QDLAPQ 9 \" appropriately (Fig. 7A). The core sequence of the determinant is also highly hydrophobic. Moreover, Leu 6 primarily contributes to the hydrophobicity, because the side chain of Leu 6 stretches deeply into the binding pocket. When Leu 6 was replaced with Ala, the hydrophobic profile of the epitope was dramatically impaired, which may explain why the mutant epitope cannot be \"accepted\" by AD5-10 (Fig. 7B). Consistent with the results of the peptide array, the remarkable hydrophobic side chain composed of the Leu 6 residue is required, because substitution of an isoleucine or phenylalanine residue partially restored the binding ability. After modeling the ligand-receptor complex, a prediction interaction map was drawn to predict the possible interactions in the active site. As shown in Fig. 7C, besides the dominant hydrophobic interaction, other actions such as electrostatic interactions could be involved in the stabilization of the \"antibody-DR5\" complex.",
                "When bound to the TRAIL trimer complex, DR5 changes its conformation so as to initiate death signaling (44,45). Like TRAIL and other agonistic anti-death receptor antibodies, AD5-10 binds to DR5 with great affinity, and the latter may curve to an ideal shape for subsequent signal transduction. Notably, several lines of evidence have shown that an oligomeric mAb-DR5 complex forms on the cell membrane at the initiative stage (41). We propose that the agonist antibody against the NTR of DR5 may induce DR5 clustering in a con-formational way, permitting the optimal recruitment of DISC components or other distinct adaptor molecules.",
                "DISC analysis showed that agnostic mAbs against NTR of DR5 triggers tumor cell death through recruitment of FADD and caspase-8 to the anti-DR5 mAbs-DR5 complex. One interesting finding was that in H460 cells, DcR2 was coimmunoprecipitated with DR5. It was in line with the recent findings indicating the spontaneous ligand-independent interaction of DcR2 with DR5 through the pre-ligand associated domain (27,31). Another attractive finding was that in Jurkat cells, RIP1 participated in the AD5-10 signaling but not TRAIL signaling, whereas in H460 cells the result is quite the reverse. One possible explanation for this discrepancy could be that RIP1 is associated with the sensitivity of tumor cells to various treatments. Earlier findings indicate that RIP1 is a short lived anti-apoptotic protein that plays a pivotal role in TRAIL-induced JNK-NF-B activation and protects cells against TRAIL-induced apoptosis (46,47). Inhibition of RIP1 enhances TRAIL-induced apoptosis in pancreatic cancer cells (48). In contrast, recent data demonstrate that RIP1 is also required for necrotic death induced by tumor necrosis factor and TRAIL (49). Caspase inhibitor enhances the recruitment of RIP1 to the TRAIL DISC (50), and RIP1 can interact with RIP3 to initiate cellular necrotic response (51)(52)(53). Taken together, these results indicate the role of RIP1 is determined by the nature of the stimulus and certain cell type. In this study, Jurkat cells are more sensitive to AD5-10 than to TRAIL, whereas H460 cells perform in the opposite way (Fig. 3 and supplemental Fig. S4). RIP1 may have a potential role in modulating cell death type. This hypothesis, however, remains to be tested.",
                "Although there is a range of agonistic DR5 monoclonal antibodies, the interactive patterns between each antibody and DR5 are shared, and the conformational determinants recognized by the antibodies are confined to the cysteine-rich region of DR5. It requires great effort to subsequently generate an identical antibody through special three-dimensional epitope immunization. Our study, on the one hand, might facilitate the generation of therapeutic antibodies against DR5. As we report here, tumoricidal anti-DR5 antibodies can be produced in a relatively easy manner because of the linear epitope. The N terminus of DR5 can function as a deadly trigger once activated by the specific agonistic antibody, which may offer an alternative therapeutic strategy in clinical medicine to artificially activate the DR5 receptor. On the other hand, one of the major limitations in the clinical application of mouse antibody-based therapies is the human anti-mouse antibody reaction, which makes long term use infeasible in patients with chronic progressive conditions, such as cancer. Identification of the exact epitope of AD5-10 provides critical information that could allow the development of therapeutic anti-DR5 antibodies by combining the unique features of the AD5-10 antibody (high tumoricidal activity and low cytotoxicity in normal cells) with humanization. For example, we are currently screening a humanized antibody library using a synthetic peptide containing the epitope information as a hapten. Furthermore, small molecular compounds targeting this region with high affinity and tumoricidal activity might be developed in the near future through high throughput screening approaches.",
                "We previously reported that the signal transduction cascade induced by AD5-10 only partially overlaps with that stimulated by the rsTRAIL-receptor interaction. Although both TRAIL and AD5-10 are capable of activating NF-B, there are differences between the regulation of NF-B activity by TRAIL and that by AD5-10 in certain cell lines. Even the downstream active signaling in mitochondria differs in rsTRAIL-and AD5-10treated Jurkat T leukemia cells. Significant ROS accumulation and secondary activation of JNK were observed in AD5-10treated cells but not in rsTRAIL-treated cells (summarized in Fig. 8). Here, we demonstrated that AD5-10 binds to a core epitope sequence that is different from any reported sites. One possibility is that the binding of AD5-10 induces a specific conformational change in DR5 that is distinct from that induced by TRAIL binding, resulting in the activation of additional signal transduction pathways that contribute to tumor killing activity. Efforts to identify the downstream players after antibody recognition are actively being pursued. This may shed light on how DR5 transfers extracellular structural changes to its intracellular function and subsequently allows development of new strategies by targeting the novel site of DR5 for cancer immunotherapy."
            ],
            "subsections": []
        }
    ]
}