{
    "id": "US20200101200",
    "authors": [
        "Kohji Nishida",
        "Motokazu Tsujikawa",
        "Susumu Hara",
        "Satoshi Kawasaki",
        "Masahito Yoshihara",
        "Masayoshi Itoh",
        "Hideya Kawaji"
    ],
    "title": "CORNEAL ENDOTHELIAL CELL MARKER AND USE THEREOF",
    "date": "2018-06-19 00:00:00",
    "abstract": "Provided is a means for identifying cells suitable for transplantation into a cornea, or a means for producing a cell population suitable for transplantation into a cornea using the same. A method for producing a cell population suitable for transplantation into a cornea, the method comprising the steps of (1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells, and (2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "TECHNICAL FIELD",
                    "paragraphs": [
                        "Techniques relating to the identification, evaluation, and production of corneal endothelial cells are disclosed."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce corneal endothelial cells"
                    ],
                    "num_characters": 113,
                    "outline_medium": [
                        "introduce corneal endothelial cells"
                    ],
                    "outline_short": [
                        "introduce corneal endothelial cells"
                    ]
                },
                {
                    "title": "BACKGROUND ART",
                    "paragraphs": [
                        "Human corneal endothelial cells basically do not regenerate once injured in vivo, and the number of cells irreversibly decreases. A significantly reduced cell density results in bullous keratopathy, and the transparency of the cornea is lost, thereby leading to visual impairment. Corneal transplantation using donor corneas has been performed so far; however, corneal endothelial damage is the number one adaptation disease of corneal transplantation, and the lack of donor corneas is a serious problem.",
                        "Currently, corneal endothelium regeneration therapy using somatic stem cells and pluripotent stem cells has been developed. However, since there is no highly reliable corneal endothelial cell-specific marker, it is not easy to identify corneal endothelial cells, which are the final target products. Until now, some molecules have been reported to be able to serve as markers for corneal endothelial cells (PTL 1). However, no marker for identifying mature corneal endothelial cells has been reported, and molecular mechanisms relating to maturation of corneal endothelial cells have not been clear."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "describe corneal endothelial cell damage",
                        "limitations of current corneal endothelium regeneration therapy"
                    ],
                    "num_characters": 1105,
                    "outline_medium": [
                        "limitations of corneal transplantation"
                    ],
                    "outline_short": [
                        "limitations of corneal transplantation"
                    ]
                },
                {
                    "title": "SUMMARY OF INVENTION",
                    "paragraphs": [],
                    "subsections": [
                        {
                            "title": "Technical Problem",
                            "paragraphs": [
                                "An object is to provide a means for identifying cells suitable for corneal transplantation, and a means for producing cells suitable for corneal transplantation using the same."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "identify cells suitable for corneal transplantation"
                            ],
                            "num_characters": 176,
                            "outline_medium": [
                                "identify cells for corneal transplantation"
                            ],
                            "outline_short": [
                                "identify cells for corneal transplantation"
                            ]
                        },
                        {
                            "title": "Solution to Problem",
                            "paragraphs": [
                                "As a result of extensive research, the inventors found that a specific gene can be a specific marker for corneal endothelial cells. After further research and examination based on this finding, the following inventions are provided.",
                                "Item A1.",
                                "A method for producing a cell population suitable for transplantation into a cornea, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells; and",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
                                "Item A2.",
                                "The method according to Item A1, wherein the expression level of the gene in the cell population suitable for transplantation into the cornea is equal to or higher than a reference value.",
                                "Item A3.",
                                "The method according to Item A1 or A2, wherein step (1) is a step of culturing stem cells under conditions suitable for inducing differentiation into corneal endothelial cells.",
                                "Item A4.",
                                "The method according to any one of Items A1 to A3, wherein step (1) is continued until the expression level of the gene is equal to or higher than a reference value.",
                                "Item A5.",
                                "The method according to any one of Items A1 to A4, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item B1.",
                                "A method for determining whether a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells is suitable for transplantation into a cornea, the method comprising measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
                                "Item B2.",
                                "The method according to Item B1, wherein the cell population is a cell population of stem cells cultured under conditions suitable for inducing differentiation into corneal endothelial cells.",
                                "Item B3.",
                                "The method according to Item B1 or B2, wherein when the expression level of the gene is equal to or higher than a reference value, it is determined that the cell population is suitable for transplantation into the cornea.",
                                "Item B4.",
                                "The method according to any one of Items B1 to B3, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item C1.",
                                "A method for producing a cell population suitable for transplantation into a cornea, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for culturing corneal endothelial cells; and",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
                                "Item C2.",
                                "The method according to Item C1, wherein the expression level of the gene in the cell population suitable for transplantation into the cornea is equal to or higher than a reference value.",
                                "Item C3.",
                                "The method according to Item C1 or C2, wherein in step (1), the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
                                "Item C4.",
                                "The method according to any one of Items C1 to C3, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item D1.",
                                "A method for determining whether a cell population cultured under conditions suitable for culturing corneal endothelial cells is suitable for transplantation into a cornea, the method comprising measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
                                "Item D2.",
                                "The method according to Item D1, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
                                "Item D3.",
                                "The method according to Item D1 or D2, wherein when the expression level of the gene is equal to or higher than a reference value, it is determined that the cell population is suitable for transplantation into the cornea.",
                                "Item D4.",
                                "The method according to any one of Items D1 to D3, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item E1.",
                                "A method for producing a suspension, sheet, or sphere comprising a cell population, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells;",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and",
                                "(3) preparing a suspension, sheet, or sphere comprising the cell population that expresses the gene.",
                                "Item E2.",
                                "The method according to Item E1, wherein step (1) is a step of culturing stem cells under conditions suitable for inducing differentiation into corneal endothelial cells.",
                                "Item E3.",
                                "The method according to Item E1 or E2, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item F1.",
                                "A method for treating a patient in need of corneal transplantation, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells;",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and",
                                "(3) administering the cell population that expresses the gene into the patient.",
                                "Item F2.",
                                "The method according to Item F1, wherein step (1) is a step of culturing stem cells under conditions suitable for inducing differentiation into corneal endothelial cells.",
                                "Item F3.",
                                "The method according to Item F1 or F2, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item G1.",
                                "A method for producing a suspension comprising a cell population, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for culturing corneal endothelial cells;",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and",
                                "(3) preparing a suspension, sheet, or sphere comprising the cell population that expresses the gene.",
                                "Item G2",
                                "The method according to Item G1, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
                                "Item G3.",
                                "The method according to Item G1 or G2, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item H1.",
                                "A method for treating a patient in need of corneal transplantation, the method comprising the steps of:",
                                "(1) preparing a cell population cultured under conditions suitable for culturing corneal endothelial cells;",
                                "(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and",
                                "(3) administering the cell population that expresses the gene into the patient.",
                                "Item H2.",
                                "The method according to Item H1, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
                                "Item H3.",
                                "The method according to Item H1 or H2, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
                                "Item I1.",
                                "Use of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B for determining whether a cell population is suitable for transplantation into a cornea.",
                                "Item I2.",
                                "The method according to Item I1, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "provide means for identifying cells suitable for corneal transplantation",
                                "provide means for producing cells suitable for corneal transplantation",
                                "define method for producing cell population",
                                "measure gene expression",
                                "define method for determining cell population suitability",
                                "culture stem cells",
                                "continue culturing until gene expression reaches reference value",
                                "select genes for measurement",
                                "prepare cell population for transplantation",
                                "administer cell population to patient",
                                "produce suspension, sheet, or sphere",
                                "treat patient in need of corneal transplantation",
                                "use genes for determining cell population suitability",
                                "provide means for efficiently producing cell population",
                                "provide means for determining cell population suitability"
                            ],
                            "num_characters": 7749,
                            "outline_medium": [
                                "propose specific gene as marker",
                                "describe method for producing cell population",
                                "describe method for determining cell suitability",
                                "describe method for producing cell population with gene expression",
                                "describe method for treating patient with cell population",
                                "describe method for producing suspension with cell population",
                                "describe use of gene for determining cell suitability"
                            ],
                            "outline_short": [
                                "discover specific gene as marker",
                                "develop method for producing cell population",
                                "develop method for determining cell suitability"
                            ]
                        },
                        {
                            "title": "Advantageous Effects of Invention",
                            "paragraphs": [
                                "In an embodiment, a means for determining whether a cell population is suitable for corneal transplantation is provided. In an embodiment, a means for efficiently producing a cell population suitable for corneal transplantation is provided."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "summarize advantageous effects"
                            ],
                            "num_characters": 240,
                            "outline_medium": [
                                "summarize benefits of invention"
                            ],
                            "outline_short": [
                                "provide means for determining cell suitability"
                            ]
                        }
                    ],
                    "outline_long": [],
                    "num_characters": 0,
                    "outline_medium": [],
                    "outline_short": []
                },
                {
                    "title": "DESCRIPTION OF EMBODIMENTS",
                    "paragraphs": [
                        "The above representative inventions are mainly described below.",
                        "The “cell population” means a population comprising a plurality of cells. The individual cells forming the cell population may be the same type of cells or different types of cells.",
                        "The “conditions suitable for inducing differentiation into corneal endothelial cells” refer to conditions that are known (or will be developed in the future) as conditions suitable for inducing differentiation of cells into corneal endothelial cells. Examples of the conditions suitable for inducing differentiation into corneal endothelial cells include the conditions disclosed in WO2013/051722, WO2016/114242, WO2016/114285, or WO2016/035874. WO2013/051722, WO2016/114242, WO02016/114285, and WO2016/035874 are incorporated herein by reference. The “cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells” can be rephrased as “cell population induced to differentiate into corneal endothelial cells.” The cell population induced to differentiate into corneal endothelial cells can include corneal endothelial cells and/or corneal endothelial precursor cells.",
                        "The medium used for inducing differentiation into corneal endothelial cells is not limited, as long as the object thereof is achieved. In an embodiment, the medium is preferably a serum-free medium. The serum-free medium means a medium that does not contain unconditioned or unpurified serum. A medium containing purified blood-derived components or animal tissue-derived components (e.g., growth factors) corresponds to the serum-free medium.",
                        "Examples of usable media include DMEM medium, BME medium, αMEM medium, serum-free DMEM/F12 medium, BGJb medium, CMRL 1066 medium, Glasgow MEM medium, Improved MEM Zinc Option medium, IMDM medium, Medium 199 medium, Eagle MEM medium, Ham medium, RPMI 1640 medium, Fischer's medium, McCoy's medium, Williams E medium, Essential8 Medium, mTeSR1 (Stemcell Technologies), TeSR-E8 medium (Stemcell Technologies), StemSure (Wako Pure Chemical Industries), mESF medium (Wako Pure Chemical Industries), StemFit (Ajinomoto), S-medium (DS Pharma), ReproXF (Reprocell), PSGro-free Human iPSC/ESC Growth Medium (StemRD), hPSC Growth Medium (Takara Bio), ReproFF2 (Reprocell), EX-CELL 302 medium (SAFC), KnockOutTMDMEM, Medium 154, StemPro (registered trademark) hESC SFM, EX-CELL-CD-CHO (SAFC), STEMdiffAPEL Medium (Stemcell Technologies), mixtures thereof, and like media that can be used for culturing animal cells. In an embodiment, the medium is preferably a medium for stem cells.",
                        "The medium may contain a serum replacement. Examples of serum replacements include albumin (e.g., lipid-rich albumin), transferrin, fatty acid, collagen precursor, trace elements (e.g., zinc and selenium), B-27 (registered trademark) supplement, N2 supplement, knockout serum replacement (KSR: produced by Invitrogen), 2-mercaptoethanol, 3′-thiolglycerol, and the like. For example, in the case of B-27 supplement, the concentration of the serum replacement in the medium is 0.01 to 10 wt % or 0.5 to 4 wt %.",
                        "Various substances can be added to the medium for the purpose of cell maintenance and growth and/or differentiation induction. Examples of such substances include carbon sources, such as glycerol, glucose, fructose, sucrose, lactose, honey, starch, and dextrin; hydrocarbons, such as fatty acids, fats and oils, lecithin, and alcohols; nitrogen sources, such as ammonium sulfate, ammonium nitrate, ammonium chloride, urea, and sodium nitrate; inorganic salts, such as common salt, potassium salt, phosphate salt, magnesium salt, calcium salt, iron salt, and manganese salt; monopotassium phosphate, dipotassium phosphate, magnesium sulfate, sodium chloride, ferrous sulfate, sodium molybdate, sodium tungstate, manganese sulfate, various vitamins, amino acids, and the like.",
                        "The medium may or may not contain a differentiation inducer, such as BMP4 (bone morphogenetic protein 4), a transforming growth factor, and activin. In an embodiment, it is preferable that the medium is substantially free of one or more, two or more, or all of the above differentiation inducers. Here, the phrase “substantially free” means, for example, that the concentration is less than 0.5 nM or an undetectable level.",
                        "The medium may contain or may not contain differentiation induction promoters, such as high-concentration retinoic acid, BMP inhibitors, TGFβ inhibitors, and Noggin. The “high-concentration retinoic acid” refers to 1 μM retinoic acid, and particularly about 10 μM retinoic acid.",
                        "In an embodiment, it is preferable that the medium is substantially free of one or more, two or more, or all of the above differentiation induction promoters. The medium may contain or may not contain Wnt, Wnt signal activators, Chordin, etc. In an embodiment, the medium is preferably substantially free of these components.",
                        "In an embodiment, the medium preferably contains one or more, two or more, three or more, four or more, or all differentiation-inducing factors selected from the group consisting of GSK3 inhibitors, retinoic acid, TGFb2, insulin, and ROCK inhibitors.",
                        "The pH of the medium can be adjusted within a range of 5.5 to 9.0, 6.0 to 8.0, or 6.5 to 7.5. The culture temperature can be set to 36° C. to 38° C. or 36.5° C. to 37.5° C. Culture can be performed in an atmosphere of 1% to 25% O2 and 1% to 15% CO2.",
                        "The time period for culture is not particularly limited, and can be set, for example, in the range of 1 week to 8 weeks, 2 weeks to 6 weeks, or 3 weeks to 5 weeks.",
                        "For culture, any container used for cell culture can be used. Examples of such containers include microplates, microwell plates, multiplates, multiwell plates, micro slides, chamber slides, schales, flasks, tissue culture flasks, dishes, Petri dishes, tissue culture dishes, multidishes, tubes, trays, cell culture bags, and roller bottles.",
                        "The inner surface of the culture container may be coated with one or more members selected from collagen, fibronectin, laminin, laminin fragments (e.g., laminin E8 fragment and laminin 511E8 fragment), vitronectin, basement membrane matrix, gelatin, hyaluronic acid, polylysine, vitronectin, and hyaluronic acid.",
                        "There is no particular limitation on the type of cells to be cultured under conditions suitable for inducing differentiation into corneal endothelial cells. In an embodiment, the cells are preferably stem cells. Examples of stem cells include artificial pluripotent stem cells (induced pluripotent stem cells: iPS cells), embryonic stem cells (ES cells), fetal primordial germ cell-derived pluripotent stem cells (EG cells), testis-derived pluripotent stem cells (GS cells), and human somatic stem cells capable of differentiating into corneal endothelial cells (tissue stem cells). In an embodiment, the stem cells are preferably iPS cells.",
                        "iPS cells can be obtained by any methods, including known methods and methods that will be developed in the future. For example, iPS cells can be obtained by introducing DNA- or protein-form specific reprogramming factors into somatic cells. Examples of reprogramming factors include Oct3/4, Sox2, Sox1, Sox3, Sox15, Sox17, Klf4, Klf2, c-Myc, N-Myc, L-Myc, Nanog, Lin28, Fbx15, ERas, ECAT15-2, Tcl1, beta-catenin, Lin28b, Sall1, Sall4, Esrrb, Nr5a2, Tbx3, and Glis1. These reprogramming factors may be used singly or in any combination. Examples of combinations of reprogramming factors are disclosed in, for example, WO2007/069666, WO2008/118820, WO2009/007852, WO2009/032194, WO2009/058413, and WO2009/057831. The type of somatic cells is not particularly limited, and somatic cells for use include any cells that have been confirmed to produce iPS cells and any cells hereafter reported to produce iPS cells. In an embodiment, examples of preferable somatic cells include fibroblasts and white blood cells. The somatic cells are preferably derived from humans.",
                        "ES cells are obtained by any available technique. For example, ES cells can be established by removing the inner cell mass from the blastocyst of a fertilized egg from a mammal (preferably, a human), and culturing the inner cell mass on a feeder of fibroblasts. The mammal is not particularly limited, but is preferably a human. ES cells in passage culture can be maintained using a culture solution containing substances, such as a leukemia inhibitory factor (LIF) and/or a basic fibroblast growth factor (bFGF). ES cells can be selected, for example, using expression of gene markers, such as OCT-3/4, NANOG, and ECAD, as an indication.",
                        "EG cells are pluripotent cells as with ES cells, and are established from primordial germ cells in the fetal stage. EG cells are established by culturing primordial germ cells in the presence of substances, such as LIE, bFGF, and stem cell factors (Y. Matsui et al. (1992), Cell, 70: 841-847; J. L. Resnick et al. (1992), Nature, 359: 550-551).",
                        "GS cells are testis-derived pluripotent stem cells, and are the origin of sperm formation. These cells can be induced to differentiate into a variety of cell lineages like ES cells. GS cells can be self-renewed in a culture solution containing a glial cell line-derived neurotrophic factor (GDNF). Repeated passage under the same conditions as those for ES cells produces sperm stem cells (M. Kanatsu-Shinohara et al. (2003) Biol. Reprod., 69: 612-616).",
                        "Examples of somatic stem cells that can be differentiated into corneal endothelial cells include neural crest stem cells derived from the corneal stroma (COPs), mesenchymal stem cells, and skin-derived pluripotent precursor cells (skin-derived precursors: SKPs), with COPs and SKPs being preferable. COPs can be prepared, for example, by removing the epithelium and endothelium from a cornea, treating the corneal stroma with a collagenase, and culturing the separated cells in a DMEM/F12 medium containing EGF, FGF2, B27 supplements and LIE SKPs can be prepared, for example, in accordance with the procedure described in Nat Cell Biol., 2001, vol. 3, 778-784.",
                        "The “conditions suitable for culturing corneal endothelial cells” refer to conditions suitable for growing corneal endothelial cells while maintaining their characteristics. The “conditions suitable for culturing corneal endothelial cells” may or may not be conditions under which corneal endothelial cells can be grown. The “conditions suitable for culturing corneal endothelial cells” include conditions known to be suitable for growing corneal endothelial cells while maintaining their characteristics (e.g., the conditions disclosed in WO2014/104366), and conditions that will be developed in the future as such conditions. The cell population cultured under conditions suitable for culturing corneal endothelial cells can include corneal endothelial cells and/or corneal endothelial precursor cells.",
                        "Specific examples of the conditions suitable for culturing corneal endothelial cells include culture conditions in a medium generally used for culturing the animal cells described above. In an embodiment, glucose can be added to the medium. The glucose concentration of the medium can be adjusted to 2.0 g/L or less, or 0.1 to 1.0 g/L. In an embodiment, it is preferable to add to the medium a growth factor such as a hepatocyte growth factor (HGF), an epidermal growth factor (EGF), recombinant EGF (rEGF), insulin and/or fibroblast growth factor (FGF). Of these factors, a single factor or a combination of two or more factors may be added to the medium. The concentration of the growth factor(s) in the medium is typically 1 to 100 ng/mL, and preferably 2 to 5 ng/mL. From the standpoint of efficient culture of corneal endothelial cells, it is preferable to add a 5 to 1,000 μg/mL ascorbic acid derivative, such as ascorbic acid 2-phosphate, to the medium. In addition, the pH and temperature of the medium, the culture container, etc., may be as described above. The time period for culture is not particularly limited, and, for example, cells can be cultured until the stage at which the cells become confluent (steady state) (e.g., 1 to 5 days). In an embodiment, a conditioned medium of mesenchymal stem cells (MSC) is preferably used for culturing corneal endothelial cells.",
                        "There is no particular limitation on the type of cells cultured under conditions suitable for culturing corneal endothelial cells. Usable examples include corneal endothelial cells isolated from a cornea, or cells, other than corneal endothelial cells, obtained by inducing differentiation into corneal endothelial cells (e.g., cells obtained by inducing differentiation under the above-described “conditions suitable for inducing differentiation into corneal endothelial cells”).",
                        "There is no particular limitation on the means for isolating corneal endothelial cells from a cornea, and any method known or hereafter developed in the art can be suitably selected for use. For example, a Descemet's membrane is removed from human comeoscleral rim with corneal endothelial cells attached to the Descemet's membrane, and shredded, followed by culture in a medium containing about 0.2% of collagenase in 5% CO2 at 37° C. for 1 to 3 hours. A usable medium is a DME medium containing 15% fetal calf serum (FCS) and a 2 ng/mL basic fibroblast growth factor (bFGF). The fibroblasts are then removed by centrifugation wash, followed by tryptic digestion, thereby obtaining a cell population containing pellet-like corneal endothelial cells (primary culture cells).",
                        "“POU6F2” is a gene encoding a transcription factor belonging to the POU family having a POU homeodomain. Expression thereof in the central nervous system, retina ganglion cells, and amacrine cells has been reported, and POU6F2 is also referred to as “retina-derived POU-domain factor-1” (RPF-1) (Zhou H et al. J Neurosci. 1996. PMID: 8601806). Further, germline mutations have been reported in patients with Wilms' tumors, and it is suggested that POU6F2 is responsible for gene expression control in the stage of kidney development (Perotti D et al. Hum Mutat. 2004. PMID: 15459955, Fiorino A et al. Int J Biochem Cell Biol. 2016. PMID: 27425396).",
                        "“LMX1B” is a gene encoding a transcription factor belonging to the LIM homeodomain family. LMX1B is known as a causative gene for nail-patella syndrome, and has been reported to be involved not only in the development of limbs, but also in the development of the glomerular basement membrane of the kidney.",
                        "“TFAP2B” is a gene encoding a transcription factor belonging to the AP-2 family. TFAP2B has been reported as a causative gene for Char syndrome mainly with facial dysmorphism, patent ductus arteriosus, and aplasia or hypoplasia of the middle phalanges of the fifth fingers (Satoda M et al. Nat Genet. 2000. PMID: 10802654).",
                        "The step of preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells can be performed by culturing the above-described cells under the conditions suitable for inducing differentiation into corneal endothelial cells described above. In an embodiment, the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells may be a cell population sorted using the presence of a molecule known as a corneal endothelial cell marker as an indication. Examples of corneal endothelial cell markers include the molecules disclosed in WO2009/057831 (e.g., ZP4, MRGPRX3, GRIP1, GLP1R, HTR1D, CLRN1, SCNN1D, PKD1, CNTN6, NSF, CNTN3, PPIP5K1, and PCDHB7). Sorting of a cell population using a corneal endothelial cell marker as an indication can be performed using any method, such as using FACS. In an embodiment, it is preferable to further culture the cell population collected using a corneal endothelial marker as an indication under conditions suitable for inducing differentiation into corneal endothelial cells.",
                        "The form of the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells is not particularly limited. For example, the cell population can be in the form of a monolayer, a multilayer, a sheet, a sphere, or a suspension, according to a conventional method. In an embodiment, the cell population is preferably in a suspended state. When the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells is in a monolayer state, the cell population can be brought into a suspended state according to a conventional method. A suspended cell population can be obtained, for example, by suspending a cell population using a proteolytic enzyme (e.g., trypsin) and/or a chelating agent for destroying cell-cell adhesion molecules. The cell population can be prepared in any form, such as a monolayer, a multilayer, a sheet, a sphere, or a suspension, before or after measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B.",
                        "Measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells, or a cell population cultured under conditions suitable for culturing corneal endothelial cells, can be performed using any method that is known or will be developed in the future as a method for measuring intracellular gene expression. The measurement is sufficient if the presence or absence of gene expression can be determined; however, in an embodiment, quantitative measurement is preferable. For example, it is preferable to measure (preferably quantitatively measure) the intracellular mRNA of each gene by PCR or the like.",
                        "In an embodiment, at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B preferably contains POU6F2 or LMX1B, and preferably POU6F2. In an embodiment, it is preferable to measure only the expression of POU6F2. In another embodiment, it is preferable to measure the expression of a combination of POU6F2 and LMX1B, or a combination of POU6F2, LMX1B, and TFAP2B.",
                        "The genes POU6F2, LMX1B, and TFAP2B are specifically expressed in corneal endothelial cells and corneal endothelial precursor cells, as shown in the Examples, described later. Therefore, corneal endothelial cells, or a cell population suitable for transplantation into the cornea, can be obtained using the expression of these genes as an indication. Further, the expression of these genes can be used as an indication to determine whether the cell population is suitable for transplantation into the cornea. That is, if these genes are expressed in the cell population, it can be determined that the cell population is suitable for transplantation into the cornea; and if these genes are not expressed, it can be determined that the cell population is not suitable for transplantation into the cornea. Moreover, POU6F2 is expressed at high levels in relatively mature corneal endothelial cells. Therefore, relatively mature corneal endothelial cells, or a cell population suitable for transplantation into the cornea, can be obtained using the expression or expression levels of POU6F2 as an indication.",
                        "The expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B may be or may not be directly measured for all the cells constituting the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells. By measuring the gene expression level in some of the cells constituting the cell population, the gene expression level in the remaining cells constituting the cell population can be indirectly measured. In an embodiment, it is preferable that the gene expression is measured in some of the cells constituting the cell population, and that the gene expression in the remaining cells is indirectly measured. This is particularly true when a method involving cell death is employed as a method for measuring gene expression.",
                        "A high expression level of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population is an indication that the cell population is suitable for transplantation into the cornea. In an embodiment, the expression level of the gene in the cell population is preferably equal to or higher than a predetermined reference value. The reference value can be determined in any manner from the viewpoint of being suitable for transplantation into the cornea. For example, the reference value can be set equal to or higher than the expression level of the gene in in vivo corneal endothelial cells and/or cultured corneal endothelium.",
                        "When the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells does not express at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B, or when it is determined that the expression level of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cells is not sufficient, the cell population can be further cultured under conditions suitable for inducing differentiation into corneal endothelial cells. Such further culture can be continued until the cell population expresses the gene, or until it is determined that the expression level of the gene is sufficient (e.g., until it becomes equal to or higher than the reference value).",
                        "Thus, the cell population in which the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B has been confirmed can be used as a cell population suitable for transplantation into the cornea. The cell population can be used as a cell preparation for regenerating the corneal endothelium. The cell preparation comprising the cell population may contain scaffold materials, components, and other pharmaceutically acceptable carriers for assisting the maintenance or growth of the cell population, or the administration thereof to the affected area. Examples of components for maintaining or growing cells include medium components, such as carbon sources, nitrogen sources, vitamins, minerals, salts, and various cytokines; and extracellular matrix preparations, such as Matrigel™ Examples of the scaffold material or component include biodegradable polymers, such as collagen, polylactic acid, hyaluronic acid, cellulose, and derivatives thereof, and complexes composed of two or more thereof; for example, aqueous solutions for injection, such as physiological saline, media, physiological buffers such as PBS, and isotonic solutions (e.g., D-sorbitol, D-mannose, D-mannitol, and sodium chloride) containing glucose and/or other adjuvants.",
                        "The cell preparation may contain a solubilizing agent, such as an alcohol (specifically ethanol), a polyalcohol such as propylene glycol or polyethylene glycol, or a nonionic surfactant such as polysorbate 80 or HCO-50.",
                        "Other pharmaceutically acceptable carriers include pharmaceutically acceptable organic solvents, polyvinyl alcohol, polyvinyl pyrrolidone, carboxyvinyl polymer, sodium carboxymethylcellulose, sodium polyacrylate, sodium alginate, water-soluble dextran, sodium carboxymethyl starch, pectin, methylcellulose, ethylcellulose, xanthan gum, gum arabic, casein, agar, polyethylene glycol, diglycerin, glycerin, propylene glycol, petrolatum, paraffin, stearyl alcohol, stearic acid, mannitol, sorbitol, and lactose; as well as surfactants, buffers, emulsifiers, suspending agents, soothing agents, stabilizers, and the like that are acceptable as pharmaceutical additives.",
                        "The subjects (patients) to whom the cell preparation is administered are not particularly limited, as long as they are considered to be in need of the cell preparation. Examples of subjects include subjects with hereditary endothelial damage, such as Fuchs corneal endothelial dystrophy, corneal endothelial abnormalities associated with glaucoma, corneal endothelial damage after intraocular surgery, corneal endothelial damage after viral infection such as herpes, and symptoms associated with corneal endothelium reduction after corneal transplantation. In an embodiment, the subjects to whom the cell preparation is administered are patients with corneal endothelial dysfunction (e.g., patients with reduced corneal endothelial cell pump and barrier function), and are patients with bullous keratopathy, corneal edema, corneal vitiligo, and/or keratoconus. The administration form of the cell preparation is not particularly limited. For example, the cell preparation can be injected into the eyeball through an injection needle.",
                        "3. Method B for Determining Whether a Cell Population is Suitable for Transplantation into the Cornea",
                        "In an embodiment, the method for determining whether a cell population is suitable for transplantation into the cornea preferably comprises the step of measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells."
                    ],
                    "subsections": [
                        {
                            "title": "EXAMPLES",
                            "paragraphs": [
                                "The following Examples describe the present invention in more detail. However, the invention is not limited to the Examples.",
                                "Human comeoscleral rim was obtained, a Descemet's membrane was removed under a microscope, and the in vivo corneal endothelium was collected. The collected corneal endothelium was immediately put into RNAlater RNA Stabilization Reagent (QIAGEN Inc., Valencia, Calif.) and stored at −70° C. Then, using the Qiagen miRNeasy Mini Kit (QIAGEN Inc.), total RNA was extracted according to the manufacturer's protocol, and Heliscope CAGE libraries were prepared for three samples (Kanamori-Katayama M, et al. (2011), Genome Res. 21: 1150-1159). Then, sequencing was performed by SeqLL (Boston, Mass.) using the HeliScope™ Single Molecule Sequencer (Helicos BioSciences Corp., Cambridge, Mass.).",
                                "The Descemet's membrane isolated as described above was incubated in StemPro Accutase (Thermo Fisher) at 37° C. for 30 minutes, and corneal endothelial cells were isolated from the Descemet's membrane. The isolated corneal endothelial cells were gently centrifuged and collected, and then suspended in a Dulbecco's modified Eagle medium (DMEM) containing 50 U/mL penicillin, 50 μg/mL streptomycin, 10% fetal bovine serum (ICN Biomedicals, Inc., Aurora, Ohio), and 2 ng/mL basic fibroblast growth factor (bFGF; Invitrogen). The cells were seeded on dishes coated with a cell attachment reagent (FNC coating mix; Athena ES, Baltimore, Md.), and incubated at 37° C. in a humidified atmosphere of 5% CO2. Total RNA was then extracted using the Qiagen miRNeasy Mini Kit (QIAGEN Inc.) according to the manufacturer's protocol. All the cells used for RNA extraction were those harvested during the first passage. For this as well, Heliscope CAGE libraries were prepared for two samples. Then, sequencing was performed by SeqLL (Boston, Mass.) using HeliScopeT Single Molecule Sequencer (Helicos BioSciences Corp., Cambridge, Mass.).",
                                "The obtained sequence data was mapped using hg19 as a reference genome using Delve (Djebali S, et al. (2012), Nature 489, 101-108). Further, the number of tags mapped to 184,827 promoter regions identified in the FANTOM5 project was counted. For the in vivo corneal endothelium, the expression level was compared with the data of 182 human tissue samples analyzed in FANTOM5, and for the cultured corneal endothelial cells, the expression level was compared with the data of 536 human cultured cell samples analyzed in FANTOM5. Each was corrected by the total number of mapped tags, and the expression level was calculated with tpm (tags per million) as the unit. Differential expression analysis was performed using edgeR (Robinson, M. D. et al., (2010), Bioinformatics 26, 139-140.), and those that satisfied the following conditions were identified as markers for genes specifically expressed on corneal endothelial cells:",
                                "1) a false discovery rate (FDR) of less than 0.01 in the corneal endothelium samples and other samples;",
                                "2) expression at 10 tpm or more in the corneal endothelium samples;",
                                "3) the average expression level in all the samples other than the corneal endothelium was less than 3 tpm;",
                                "4) despite the highest expression in all the samples other than the corneal endothelium, the expression level was smaller than the average expression level in the corneal endothelium samples; and",
                                "5) the average expression level in corneal endothelium samples was 32 times or more higher than the average expression level in all of the other samples.",
                                "From the obtained corneal endothelium-specific gene candidates, TFAP2B, LMX1B, and POU6F2 were identified as transcription factors specifically expressed, in common, on the in vivo corneal endothelium and cultured corneal endothelial cells. As a reference for human transcription factors, a reference was made to http://fantomgsc.riken.jp/5/sstar/Browse_Transcription_Factors_hg19.",
                                "FIG. 1 shows the expression levels of TFAP2B in human tissue samples. a, b, and c show the expression levels of TFAP2B in the midbrain substantia nigra, brainstem locus coeruleus, and epididymis, respectively. It was confirmed that TFAP2B was most highly expressed in the in vivo corneal endothelium.",
                                "FIG. 2 shows the expression levels of TFAP2B in human cultured cell samples. a, b, and c show the expression levels of TFAP2B in olfactory epithelial cells, trabecular meshwork cells, and conjunctival fibroblasts, respectively. It was confirmed that TFAP2B was most highly expressed in the cultured corneal endothelial cells.",
                                "FIG. 3 shows the expression levels of LMX1B in human tissue samples. a, b, and c show the expression levels of LMX1B in the parotid gland, salivary gland, and submandibular gland, respectively. It was confirmed that LMX1B was most highly expressed in the in vivo corneal endothelium.",
                                "FIG. 4 shows the expression levels of LMX1B in human cultured cell samples. a, b, and c show the expression levels of LMX1B in trabecular meshwork cells, corneal parenchymal cells, and fibroblasts, respectively. The same level of expression as in the corneal endothelial cells was also observed in the trabecular meshwork cells. Further, expression in the corneal parenchymal cells was also confirmed. Since the corneal endothelium, corneal parenchyma, and trabecular meshwork are all periocular neural crest-derived tissues, these results suggest that LMX1B is expected to be applied not only as a corneal endothelial marker, but also as a marker for periocular neural crest-derived tissues.",
                                "FIG. 5 shows the expression levels of POU6F2 in human tissue samples. Although the expression level in the in vivo corneal endothelium is around 100 tpm, the expression level in brain tissue where expression is observed is less than 10 tpm and is very highly specific.",
                                "FIG. 6 shows the expression levels of POU6F2 in human cultured cell samples. a shows the expression level of POU6F2 in hepatocytes. The expression level in the cultured corneal endothelial cells was 100 tpm or more, whereas no expression was observed in 535 out of the 536 human cultured cell samples analyzed in FANTOM5. The expression level only observed in hepatocytes was as very low as less than 2 tpm.",
                                "From the results of FIGS. 1 to 6, POU6F2, LMX1B, and TFAP2B were all significantly highly expressed in corneal endothelial cells; thus, it is considered that they are useful as corneal endothelial cell markers, and can be used for induction of corneal endothelial cells.",
                                "The expression of the above three genes was quantitatively analyzed in the corneal endothelium and other tissues. FIG. 7 shows the results of measuring expression in cells induced from iPS cells (iPS) (e.g., neural crest cells (iNC)) and intraocular tissues by quantitative PCR. As shown in FIG. 7, it was confirmed that POU6F2, LMX1B, and TFAP2B were highly expressed in the cultured corneal endothelial cells (HCEC), corneal endothelial precursor cells (HCEP), differentiation-induced corneal endothelial precursor cells (dHCEP), and in vivo corneal endothelium (Cendo). In contrast, POU6F2 was hardly expressed in the corneal stroma (CS), iris stroma (IS), ciliary body (CB), trabecular meshwork (TM), corneal limbal epithelium (Clim), central corneal epithelium (Cepi), corneal limbal fibroblasts (LF), conjunctival epithelium (Cj), lens (LN), iris epithelium (IE), retinal pigment epithelium (RPE), retina (Retina), and optic nerve (ON). LMX1B was also expressed in the trabecular meshwork, corneal parenchyma, and iris stroma, which were neural crest-derived tissues. TFAP2B was highly expressed in the iPS-derived neural crest cells. These results suggest that POU6F2, LMX1B, and TFAP2B are useful as markers for corneal endothelial cells.",
                                "Analysis of RNA-seq data (Chen Y, et al. (2013), Hum Mol Genet 22: 1271-1279) in the human adult/fetal-derived corneal endothelium revealed no significant changes in the expression of TFAP2B and LMX1B; in contrast, the expression of POU6F2 was significantly higher in the adult-derived corneal endothelium (FIG. 8). This suggests that POU6F2 is expressed on the functional mature corneal endothelium and is related to terminal differentiation of the corneal endothelium. Therefore, POU6F2 is considered to be useful for the quality evaluation of corneal endothelial cell products, and also useful for the production of corneal endothelial cells because it is a transcription factor."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "obtain human comeoscleral rim",
                                "remove Descemet's membrane",
                                "collect in vivo corneal endothelium",
                                "extract total RNA",
                                "prepare Heliscope CAGE libraries",
                                "perform sequencing",
                                "isolate corneal endothelial cells",
                                "extract total RNA from isolated cells",
                                "prepare Heliscope CAGE libraries",
                                "perform sequencing",
                                "map sequence data to reference genome",
                                "count tags mapped to promoter regions",
                                "compare expression levels",
                                "identify markers for genes specifically expressed",
                                "analyze expression levels of TFAP2B, LMX1B, and POU6F2",
                                "quantify expression of genes in various tissues"
                            ],
                            "num_characters": 8375,
                            "outline_medium": [
                                "isolate human corneoscleral rim",
                                "extract total RNA from corneal endothelium",
                                "prepare Heliscope CAGE libraries for sequencing",
                                "analyze sequence data using Delve and FANTOM5",
                                "identify markers for genes specifically expressed on corneal endothelial cells",
                                "validate expression levels of TFAP2B, LMX1B, and POU6F2",
                                "analyze expression levels in various human tissue and cell samples",
                                "evaluate usefulness of POU6F2, LMX1B, and TFAP2B as corneal endothelial cell markers"
                            ],
                            "outline_short": [
                                "isolate and process corneal endothelium",
                                "extract and sequence RNA",
                                "analyze and identify gene markers",
                                "validate gene markers in various tissues and cells"
                            ]
                        }
                    ],
                    "outline_long": [
                        "define cell population",
                        "explain conditions for inducing differentiation into corneal endothelial cells",
                        "describe medium used for inducing differentiation",
                        "specify serum-free medium",
                        "list examples of usable media",
                        "describe serum replacement",
                        "list substances added to medium for cell maintenance and growth",
                        "describe differentiation inducers",
                        "specify substantially free of differentiation inducers",
                        "describe differentiation induction promoters",
                        "specify substantially free of differentiation induction promoters",
                        "describe preferred medium composition",
                        "specify pH and temperature of medium",
                        "describe culture time period",
                        "list examples of culture containers",
                        "describe coating of culture container inner surface",
                        "specify type of cells to be cultured",
                        "describe obtaining iPS cells",
                        "describe obtaining ES cells, EG cells, GS cells, and somatic stem cells",
                        "define conditions suitable for culturing corneal endothelial cells",
                        "specify examples of conditions suitable for culturing corneal endothelial cells",
                        "describe isolation of corneal endothelial cells from a cornea",
                        "introduce POU6F2 gene",
                        "introduce LMX1B gene",
                        "introduce TFAP2B gene",
                        "describe preparation of cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "specify forms of cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "describe measurement of gene expression in cell population",
                        "specify genes to be measured",
                        "describe quantitative measurement of gene expression",
                        "specify preferred genes to be measured",
                        "describe use of gene expression as indication of suitability for transplantation",
                        "describe determination of suitability for transplantation based on gene expression",
                        "describe further culture of cell population under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "describe use of cell population as cell preparation for regenerating corneal endothelium",
                        "specify components of cell preparation",
                        "describe scaffold materials and components",
                        "describe solubilizing agents",
                        "describe other pharmaceutically acceptable carriers",
                        "specify subjects to whom cell preparation is administered",
                        "describe administration form of cell preparation",
                        "introduce Method B for determining suitability for transplantation",
                        "describe step of measuring gene expression in Method B",
                        "specify genes to be measured in Method B",
                        "describe use of gene expression as indication of suitability for transplantation in Method B",
                        "describe determination of suitability for transplantation based on gene expression in Method B",
                        "describe further culture of cell population under conditions suitable for inducing differentiation into corneal endothelial cells in Method B",
                        "describe use of cell population as cell preparation for regenerating corneal endothelium in Method B",
                        "conclude Method B"
                    ],
                    "num_characters": 25139,
                    "outline_medium": [
                        "define cell population",
                        "define conditions for inducing differentiation into corneal endothelial cells",
                        "describe medium for inducing differentiation",
                        "list examples of usable media",
                        "describe serum replacement and additives",
                        "describe differentiation inducers and promoters",
                        "specify culture conditions",
                        "describe culture containers and coatings",
                        "describe types of cells to be cultured",
                        "define conditions suitable for culturing corneal endothelial cells",
                        "specify examples of conditions suitable for culturing corneal endothelial cells",
                        "describe isolation of corneal endothelial cells from a cornea",
                        "introduce genes POU6F2, LMX1B, and TFAP2B",
                        "describe preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "specify forms of the cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "measure expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B",
                        "describe measuring gene expression levels",
                        "determine suitability of cell population for transplantation into the cornea",
                        "further culture cell population under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "use cell population suitable for transplantation into the cornea",
                        "describe cell preparation for regenerating the corneal endothelium",
                        "specify components of the cell preparation",
                        "describe subjects to whom the cell preparation is administered",
                        "describe administration form of the cell preparation"
                    ],
                    "outline_short": [
                        "define cell population and conditions for inducing differentiation into corneal endothelial cells",
                        "describe medium composition for inducing differentiation into corneal endothelial cells",
                        "specify culture conditions and container requirements",
                        "introduce types of cells that can be cultured under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "define conditions suitable for culturing corneal endothelial cells",
                        "describe cell population cultured under conditions suitable for culturing corneal endothelial cells",
                        "introduce genes POU6F2, LMX1B, and TFAP2B",
                        "describe method for measuring gene expression in cell population",
                        "determine suitability of cell population for transplantation into cornea",
                        "describe further culture of cell population under conditions suitable for inducing differentiation into corneal endothelial cells",
                        "outline cell preparation for regenerating corneal endothelium"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method for producing a cell population suitable for transplantation into a cornea, the method comprising the steps of:\n(1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells; and\n(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
        "2. The method according to claim 1, wherein step (1) is a step of culturing stem cells under conditions suitable for inducing differentiation into corneal endothelial cells.",
        "3. A method for determining whether a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells is suitable for transplantation into a cornea, the method comprising measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
        "4. The method according to claim 3, wherein the cell population is a cell population of stem cells cultured under conditions suitable for inducing differentiation into corneal endothelial cells.",
        "5. A method for producing a cell population suitable for transplantation into a cornea, the method comprising the steps of:\n(1) preparing a cell population cultured under conditions suitable for culturing corneal endothelial cells; and\n(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
        "6. The method according to claim 5, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
        "7. A method for determining whether a cell population cultured under conditions suitable for culturing corneal endothelial cells is suitable for transplantation into a cornea, the method comprising measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population.",
        "8. The method according to claim 7, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
        "9. A method for producing a suspension, sheet, or sphere comprising a cell population, the method comprising the steps of:\n(1) preparing a cell population cultured under conditions suitable for inducing differentiation into corneal endothelial cells;\n(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and\n(3) preparing a suspension, sheet, or sphere comprising the cell population that expresses the gene.",
        "10. The method according to claim 9, wherein step (1) is a step of culturing stem cells under conditions suitable for inducing differentiation into corneal endothelial cells.",
        "11. A method for producing a suspension, sheet, or sphere comprising a cell population, the method comprising the steps of:\n(1) preparing a cell population cultured under conditions suitable for culturing corneal endothelial cells;\n(2) measuring the expression of at least one gene selected from the group consisting of POU6F2, LMX1B, and TFAP2B in the cell population; and\n(3) preparing a suspension, sheet, or sphere comprising the cell population that expresses the gene.",
        "12. The method according to claim 11, wherein the cell population cultured under conditions suitable for culturing corneal endothelial cells comprises cells obtained from a corneal endothelium.",
        "13. The method according to claim 1, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
        "14. The method according to claim 3, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
        "15. The method according to claim 5, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
        "16. The method according to claim 7, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
        "17. The method according to claim 9, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B.",
        "18. The method according to claim 11, wherein the gene is at least one gene selected from the group consisting of POU6F2 and LMX1B."
    ]
}