{
    "id": "US20150141238",
    "authors": [
        "Hongwang Wang",
        "Stefan H. Bossmann",
        "Donghai Wang",
        "Deryl L. Troyer",
        "Tej Shrestha"
    ],
    "title": "NANOPARTICLE CATALYST CAPABLE OF FORMING AROMATIC HYDROCARBONS FROM CO2 AND H2",
    "date": "2015-01-23 00:00:00",
    "abstract": "Nanocatalysts and methods of using the same to obtain aromatic hydrocarbon compounds from a source of carbon atoms and a source of hydrogen atoms in a single reaction step is provided. The catalyst comprises an Fe/Fe3O4 nanocatalyst that may be supported on a non-reactive support material such as a zeolite or alumina CO2 and H2 are preferred sources of carbon and hydrogen atoms for the reaction. The aromatic hydrocarbon compounds produced are suitable for direct usage as fuel without need for further refining.",
    "sections": [
        {
            "title": "DESCRIPTION",
            "paragraphs": [],
            "subsections": [
                {
                    "title": "BACKGROUND OF THE INVENTION",
                    "paragraphs": [
                        "1. Field of the Invention",
                        "The present invention is generally directed toward nanocatalysts and methods of using such catalysts to synthesize aromatic hydrocarbon compounds from carbon dioxide and hydrogen mixtures under relatively mild reaction conditions. Particularly, the catalyst comprises an Fe/Fe3O4 nanocatalyst that may be supported on a non-reactive support material such as a zeolite or alumina. The aromatic hydrocarbon compounds produced are suitable for direct usage as fuel without need for further refining.",
                        "2. Description of the Prior Art",
                        "The diminishing fossil fuel reserves and ever-increasing CO2 emissions have created great concern amongst the scientific community. Since the industrial revolution, a significant increase of CO2 concentration in the atmosphere has been witnessed due to the combustion of carbon-rich fossil fuels, consequently, leading to global warming and drastic climate changes. As a result, the quest for renewable and cleaner energy sources to meet the fast population and economic growth is more urgent than ever before. Being the most abundant carbon source in earth's atmosphere, CO2 can be used as a cheap and non-toxic C1 building block in many chemical processes. Hydrogenation of CO2 to produce methanol and dimethylether (DME), as well as hydrocarbons is attractive, not only because these products are excellent fuels for internal combustion engines, but also because the whole process is considered to be cleaner, sustainable, and carbon-neutral (for example, using CO2 from atmosphere, H2 from water splitting and sunlight for energy). However, their chemical and physical properties, are inferior to conventional gasoline. Our distribution systems were developed for liquid fuel. It is easier and less costly to use the existing distribution infrastructure instead of building a new distribution system for methane or hydrogen. Liquid fuels are also safer than gaseous fuels: 1000 atmospheres (14,696 psi) of CH4 or H2 have the same density than 1 L of liquid fuels at room temperature. However, liquid fuels are much less in danger of explosion during accidents.",
                        "Although methane has a high octane number (120), it is not useful for classic combustion engines. Mesitylene, octane number: 110, xylenes: 115-120, toluene: 111 make excellent components of high-octane fuel (86 to 92 in the US). Finally, whereas the long-term storage of hydrogen is very difficult, a mixture of aromatic hydrocarbons can be easily stored for fuel or synthesis application.",
                        "Iron-based heterogeneous catalysts have been intensively studied for the CO2 hydrogenation reaction. Earlier research showed that bulk iron or iron oxides catalyze CO2 hydrogenation, which mainly produce methane as product. These catalysts were rapidly deactivated due to carbon deposition. Doping of promoters such as potassium, manganese, and copper had significant effect on both the reactivity and selectivity of the iron-based catalysts. Higher olefins and aliphatic hydrocarbons, as well as improved CO2 conversion, were achieved. Al2O3 was found to be an excellent structure promoter to sustain the catalyst activity of iron-based catalysts by preventing sintering of active particles during the reaction. When using zeolites as solid supports, the product's distribution was highly dependent on the structure and acidity of the zeolites. The iron-zeolite composites were also reported as dual functional catalysts that promoted multi-step transformation for CO2 hydrogenation.",
                        "In spite of all the efforts during the last decades, the direct formation of aromatic hydrocarbons in a one-step reaction from carbon dioxide, without forming aliphatic hydrocarbons first, remains elusive."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce field of invention",
                        "describe prior art",
                        "motivate CO2 hydrogenation",
                        "discuss limitations of prior art",
                        "highlight importance of liquid fuels",
                        "summarize iron-based catalysts",
                        "emphasize need for direct formation of aromatic hydrocarbons"
                    ],
                    "num_characters": 3706,
                    "outline_medium": [
                        "introduce problem of fossil fuels",
                        "discuss prior art of CO2 hydrogenation",
                        "highlight limitations of prior art"
                    ],
                    "outline_short": [
                        "motivate CO2 hydrogenation"
                    ]
                },
                {
                    "title": "SUMMARY OF THE INVENTION",
                    "paragraphs": [
                        "According to embodiments of the present invention, aromatic hydrocarbon compounds are obtained from carbon dioxide and hydrogen mixtures using an Fe/Fe3O4 nanocatalyst at relatively low reaction vessel pressures and relatively mild reaction temperatures.",
                        "According to one embodiment of the present invention there is provided a method of synthesizing one or more aromatic hydrocarbon compounds. A quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles is provided within a reactor. A quantity of reactants comprising a source of carbon atoms and a source of hydrogen atoms is introduced into the reactor and contacted with the catalytic material. The reactants are reacted within the reactor under conditions for forming the one or more aromatic hydrocarbon compounds. The one or more aromatic hydrocarbon compounds are then recovered from the reactor.",
                        "In one particular embodiment of the present invention, the method of synthesizing one or more aromatic hydrocarbon compounds comprises providing within a reactor a quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles. A quantity of reactants comprising a source of carbon atoms and a source of hydrogen atoms are introduced into the reactor and contacted with the catalytic material. The source of carbon atoms is selected from the group consisting of lignin, CO2, CO, and combinations thereof. The source of hydrogen atoms is selected from the group consisting of H2, H2O, CH4, and combinations thereof. The reactants are reacted within the reactor under conditions for forming the one or more aromatic hydrocarbon compounds. The conditions within the reactor comprise a temperature of between about 380° C. to about 560° C., and a pressure of between about 1 to about 1.1 atm. The one or more aromatic hydrocarbon compounds are then removed from the reactor. The one or more aromatic hydrocarbon compounds recovered are selected from the group consisting of xylenes, toluene, benzene, and mixtures thereof. Moreover, the aromatic hydrocarbon compounds comprising at least 75% by weight of the total reaction products produced by the reacting step.",
                        "In another embodiment of the present invention there is provided a system for synthesizing one or more aromatic hydrocarbon compounds. The system comprises a reactor comprising a quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles, one or more reactant feed streams coupled with the reactor and operable to deliver to the reactor a source of carbon atoms and a source of hydrogen atoms, and a reaction product discharge stream coupled with the reactor and operable to remove the one or more aromatic hydrocarbon compounds from the reactor. The reactor operates under conditions for reacting the source of carbon atoms and the source of hydrogen atoms in the presence of the catalytic material for forming the one or more aromatic hydrocarbon compounds.",
                        "According to yet another embodiment of the present invention there is provided a method of synthesizing Fe/Fe3O4 core/shell nanoparticles on a non-reactive support material. A reaction mixture is provided within a reaction vessel. The reaction mixture comprises a C10-C24 alkene solvent, a C10-C24 amine having at least one ethylenically unsaturated group, a C4-C24 ammonium salt, and a non-reactive support material. The reaction mixture is heated to a temperature of between about 150° C. to about 210° C. A quantity of Fe(CO)5 is added to the reaction mixture and reacted with the C10-C24 amine and C4-C24 ammonium salt so as to form a plurality of Fe/Fe3O4 core/shell nanoparticles on the non-reactive support. The Fe/Fe3O4 nanoparticles comprise an outer organic ligand monolayer formed from at least portions of the C10-C24 amine and/or the C4-C24 ammonium salt. The Fe/Fe3O4 nanoparticles on said non-reactive support are then recovered from the reaction vessel."
                    ],
                    "subsections": [],
                    "outline_long": [
                        "introduce Fe/Fe3O4 nanocatalyst",
                        "describe method of synthesizing aromatic hydrocarbons",
                        "specify reactants and conditions",
                        "summarize reaction products",
                        "describe system for synthesizing aromatic hydrocarbons",
                        "outline method of synthesizing Fe/Fe3O4 nanoparticles",
                        "highlight features of Fe/Fe3O4 nanoparticles"
                    ],
                    "num_characters": 3903,
                    "outline_medium": [
                        "introduce Fe/Fe3O4 nanocatalyst",
                        "describe method of synthesizing aromatic hydrocarbons",
                        "outline system for synthesizing aromatic hydrocarbons"
                    ],
                    "outline_short": [
                        "describe Fe/Fe3O4 nanocatalyst"
                    ]
                },
                {
                    "title": "DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENT",
                    "paragraphs": [
                        "The present invention is concerned with novel “Fischer-Tropsch” nanocatalysts for formation of hydrocarbon compounds, and specifically aromatic hydrocarbons as the major fraction of the reaction product. Catalysts used with the present invention are capable of forming aromatic hydrocarbons directly in a single step at relatively low temperatures (300-560° C.), and without further refining or processing of the reaction product. Existing catalysts start from aliphatic hydrocarbons or other waxy semisolids and convert them to aromatic hydrocarbons at temperatures exceeding 1000° C.",
                        "The Fischer-Tropsch reaction is generally described by the following reaction:",
                        "CO+2H2→—CH2—+H2O",
                        "However, in one embodiment according to the present invention, the reaction is summarized by the following:",
                        "9CO2+24H2→C9H12+18H2O",
                        "In certain embodiments, the nanocatalysts used with the present invention comprise core/shell nanoparticles of iron cores with iron oxide shells, and have an average (mean) diameter of less than about 20 nm, preferably from about 10 to about 20 nm. Preferably, the catalysts are Fe/Fe3O4 nanoparticles. The nanoparticles have a BET surface area of from about 20 to about 75 m2/g, preferably about 23 to about 40 m2/g. The nanoparticles have highly crystalline structures formed of nanolattices and comprise both crystalline cores and crystalline shells. Before activation, the catalysts can further comprise an organic ligand monolayer adjacent the shell; however, this ligand layer is removed after the first catalytic reaction to activate the catalyst, and is not a required component for the initial or subsequent reactions. The nanoparticles are not otherwise functionalized, and are preferably free of silane coatings or the like.",
                        "In certain embodiments, the nanocatalysts are supported on a non-reactive support material. For example, the non-reactive support can be a zeolite, aluminum silicate, or α-alumina, main group element oxide, d-block element oxide and f-block element oxide particles. In certain embodiments the α-alumina particles have a surface area of between about 100 to about 400 m2/g, and preferably between about 250 to about 350 m2/g (after calcination at 600° C.). Also, the surface area of the zeolite, such as zeolite Y, is preferably between about 500 and about 700 m2/g.",
                        "Although not required, and in certain embodiments it is not present, a promoter material may be added to the nanocatalytic material in order to improve the catalyst performance and/or product selectivity. In certain embodiments the promoter comprises one or more metal ions such as potassium, manganese, zinc, or copper ions. In particular embodiments, the promoter is introduced into the nanocatalytic material as K2CO3, ZnCO3, or a mixture thereof.",
                        "In methods of synthesizing the nanocatalyst, the Fe/Fe3O4 nanoparticles are actually grown upon the support material, as opposed to first being synthesized and then deposited or impregnated into the support. According to one embodiment of the present invention, the nanocatalyst is synthesized by first providing a reaction mixture within a reaction vessel. The reaction mixture comprises a C10-C24 alkene solvent, a C10-C24 amine having at least one ethylenically unsaturated group, a C4-C24 ammonium salt, and the non-reactive support material. In preferred embodiments, the C10-C24 alkene solvent is 1-octadecene, and the C10-C24 amine is oleylamine. Further, in certain embodiments, the C4-C24 ammonium salt is selected from the group consisting of C8-C22 primary alkyl ammonium salts, C4-C24 quaternary ammonium salts, and combinations thereof. In particularly preferred embodiments, the C8-C22 primary alkyl ammonium salt is hexadecylammonium chloride ad the C4-C24 quaternary alkyl ammonium salt is tetraethylammonium chloride.",
                        "The reaction mixture may then be heated to a temperature of between about 150° C. to about 210° C., or 160° C. to about 200° C., or about 180° C., at which point a quantity of Fe(CO)5 is then added to the reaction mixture. The Fe(CO)5 may be added while maintaining the temperature of the reaction mixture within the aforementioned levels. The Fe(CO)5 may be added in multiple portions so as to avoid violent Fe(CO)5 reflux. The Fe(CO)5, amine, and ammonium salt ligands react thereby forming a plurality of Fe/Fe3O4 core/shell nanoparticles on the support. The Fe/Fe3O4 nanoparticles initially comprise an outer organic ligand monolayer formed from the ligands or portions thereof. These ligands can be removed prior to use of the nanocatalyst or during a first run of the nanocatalyst in a CO2 hydrogenation reaction. In order to remove the ligand monolayer, the nanocatalyst is heated to a temperature above 300° C., and preferably in the presence of either H2 or CO.",
                        "After the reacting step, the nanoparticles may be recovered from the reaction vessel. Typically, the nanocatalyst is permitted to cool to room temperature and then washed (such as with hexane followed by ethanol) to remove free or unattached ligands, and then dried and recovered as a fine powder. Methods of synthesizing unsupported Fe/Fe3O4 nanoparticles are very similar to that described above, except that the support material is not introduced into the initial reaction mixture.",
                        "In use, the nanocatalyst is contacted with a gas feedstock to produce a mixture of hydrocarbons wherein the majority (≧51% by weight) of the reaction product mixture is aromatic hydrocarbons, preferably C6-C9 aromatic hydrocarbon compounds such as mesitylene, xylenes, toluene, benzene, and mixtures thereof. Preferably, greater than about 75% by weight of the reaction product comprises aromatic hydrocarbons, and more preferably greater than about 85% by weight of the reaction product comprises aromatic hydrocarbons, and even more preferably greater than about 90% by weight of the reaction product comprises aromatic hydrocarbons. The reaction product preferably comprises less than about 30% by weight waxy solids or semisolids (e.g., paraffins), more preferably less than about 20% by weight, and even more preferably less than about 10% by weight waxy solids or semisolids. In addition to providing a high concentration of aromatic hydrocarbon compound reaction products, in certain embodiments of the present invention the distribution of reaction products comprising greater than 1% by weight of the overall reaction product composition is limited to fewer than 15 hydrocarbon compounds, fewer than 12 hydrocarbon compounds, fewer than 10 hydrocarbon compounds or fewer than 8 hydrocarbon compounds. In other embodiments, the aromatic hydrocarbon compound distribution is even narrower with mesitylene, o-xylene, p-xylene, m-xylene, toluene and benzene comprising the majority of aromatic hydrocarbon compounds produced. Various aliphatic hydrocarbon compounds such as propane and butane may also be produced, but each generally in amounts of less than 10%, less than 7.5%, less than 5%, or less than 3% by weight.",
                        "More specifically, a reaction vessel or reactor is provided, which contains the nanocatalyst. The nanocatalyst can be on a non-reactive support substrate, as described above, in the reaction vessel, or the nanocatalyst can be suspended in a magnetic field in the reaction vessel. A gas feedstock is introduced into the reaction vessel. The feed stream will comprise a source of carbon atoms and a source of hydrogen atoms. In certain embodiments, the feed stream may comprise CO2, H2, CO, and/or H2O, sources of CO2, Hz, CO (e.g., C1-C5 aliphatic hydrocarbon compounds), and/or H2O, and/or mixtures thereof. In some embodiments a system using separate feed streams to deliver the feedstock to the reaction vessel for some or all of the feedstock gasses (or water) can be used. Advantageously, the catalyst is not dependent on the exact ratio of CO2 and H2 (9/24 in the reaction above) in the feedstock and is able to produce principally the same (aromatic) products even when the input concentrations of CO2 and H2 vary, oscillate, etc. However, in certain embodiments the molar ratio of H2 to CO2 is from about 1:5 to about 5:1, from about 1:1 to about 4:1, or from about 1.5:1 to about 3:1. This makes this catalyst ideal for the production of fuel from syngas. If H2 is not available, the catalyst can convert CO and H2O to CO2 and H2 via the following reaction scheme:",
                        "CO+H2O→H2+CO2",
                        "9CO2+24H2→C9H12+18H2O",
                        "CO is available as a refinery by-product, or from pyrolytic reactions. This process can be used to enhance the efficiency of traditional refining by using CO by-product to form aromatic hydrocarbons.",
                        "Hydrogen can be generated by partial oxidation of methane (e.g., from shale gas, a source of H2):",
                        "CH4+H2O→3H2+CO",
                        "CH4+0.5O2→2H2+CO",
                        "Hydrogen can be also generated by thermolysis of biomass or municipal waste creating “syngas” (CO and H2). The synthesis of aromatic hydrocarbons permits more consumption of CO2 than is necessary for the hydrogen production (when using biomass or natural gas).",
                        "It will be appreciated that the feedstock can be delivered using any suitable system, including storage systems such as a gas cylinder or other container, as well as the direct or indirect product from another process. The gas feedstock will be reacted with the nanocatalyst in the reaction vessel. The reaction temperature will range from about 300° C. to about 560° C., about 380° C. to about 500° C., or from about 400° C. to 450° C. In certain embodiments, elevated pressures are not required for the reaction, which can typically be carried out at 1 to 10 atm, more preferably at 1 to 1.1 atm. However, elevated pressures from 1.1-100 atm may be used if desired. The reaction yields a product stream that can be collected from the reaction vessel. The reaction can be carried out for a time period of from about 20 to about 120 minutes, and preferably from about 30 to about 60 minutes before collecting the product stream from the reaction vessel. A continuous reaction process could also be used. Advantageously, the nanocatalyst can be used for multiple passes or runs (i.e., reactions) without losing its efficiency or needing to be regenerated. In some embodiments, the nanocatalyst can be used for at least about 10 reactions (“catalytic cycles”) before being regenerated, and more preferably at least about 15 reactions before being regenerated. It is estimated that one mol of catalyst is able to convert 10,000-50,000 moles of CO2 before the catalyst needs to regenerated.",
                        "The process is advantageous for carrying out the direct formation of aromatic hydrocarbons in a single reaction vessel via a single reaction process, without the need to further refine the reaction product to yield aromatic hydrocarbons. As disclosed herein, the reaction temperature can be adjusted to control the reaction products and target the formation of specific aromatic compounds. The aromatic hydrocarbons can be used directly as fuels or additives without the need for further refining."
                    ],
                    "subsections": [
                        {
                            "title": "Reaction Mechanism",
                            "paragraphs": [
                                "It is well accepted that the formation of aliphatic hydrocarbons from iron catalyzed CO2 hydrogenation reactions proceeds through a 2-step reaction process: first, conversion of CO2 to CO via the reverse water gas shift reaction (RWGS); and second, building up hydrocarbon chains by Fischer-Tropsch reaction (FT). See, Scheme 1.",
                                "Scheme 1: Commonly accepted mechanisms of iron catalyzed CO2 hydrogenation reactions",
                                "CO2+H2⇄CO+H2O  (1)",
                                "CO+2H2→CH2—+H2O  (2)",
                                "2CO→CO2+C  (3)",
                                "C+2CO→C3O2  (4)",
                                "The following mechanism has been proposed for the selective formation of aromatic hydrocarbons in the Fe/Fe3O4 nanoparticle catalyzed CO2 hydrogenation reaction according to certain embodiments of the present invention. In the first step, an iron nanoparticle catalyzed reverse water gas shift (RWGS) reaction produces CO from CO2. This reaction permits that either H2 or CO can be used as starting materials for the synthesis of fuels. The versatility of the catalyst is established by the fact that CO can be synthesized by incomplete combustion of basically all organic materials (including biomass and waste).",
                                "CO2+H2⇄CO+H2",
                                "In the second step, CO reacts with CO under deposition of carbon on the nanocatalyst's surface for the formation of CO2. Two molecules of carbon monoxide react with each other at the surface of Fe or Fe3O4 to form one carbon atom and one molecule of carbon dioxide. This reaction leads to the deposition of carbon onto the catalyst. However, graphite has a tendency to form planar layers, where Fe/Fe3O4 nanoparticles feature an extreme curvature that prevents the formation of carbon layers and thus the deactivation of the catalyst. It is believed that nanocatalysts possessing a diameter, which is smaller than 20 nm are protected from carbon layer formation by their size. Carbon is stored as Fe3C.",
                                "2CO→C+CO2",
                                "In the third step CO reacts with the freshly deposited carbon on the catalyst to yield carbon suboxide (C3O2). One carbon atom and two molecules of carbon monoxide form one molecule of carbon suboxide (C3O2). This molecule is the main product that is found at lower temperatures (300 to 400° C.) in the GC/MS product analysis.",
                                "C+2CO→O═C═C═C═O",
                                "As illustrated by Scheme 2, below, C3O2 then undergoes trimerization to form a precursor of trimethyl benzene. This step is supported by the lattice of the new iron-containing material, which is depicted in FIG. 2. This precursor is then stepwise reduced by H2 to mesitylene, the symmetrical trimethyl-benzene (C9H12), which is the primary initial reaction product.",
                                "Scheme 2: Proposed mechanism of the trimerization and subsequent hydrogenation of carbon suboxide (C3O2).",
                                "As illustrated by Scheme 3, below, at high temperature and in the presence of the iron nanocatalyst, mesitylene then undergoes stepwise de-methylation to form xylenes, toluene, and finally, benzene. Temperature can be used to control the liquid hydrocarbons formed. The byproduct of this reaction comprises, consists of, or consists essentially of propane (C3H8). However, the reduction of C3O2 by 6 H2 is also able to form propane.",
                                "Scheme 3: Stepwise demethylation and isomerization of mesitylene at the surface of the Fe-containing nanocatalyst.",
                                "As shown in the Example 4, below, selection of the non-reactive support material has been demonstrated to affect reaction product composition, namely product distribution. While not wishing to be bound by any theory, it is believed that the support material does not catalyze the aromatic hydrocarbon-synthesizing reactions, as in certain embodiments a relatively narrow distribution of reaction products is achieved and such would not be the case if, for example, a zeolite catalyst was employed. The hydrocarbon product mixture can be readily separated from H2 and CO2 by condensation, and various individual aromatic hydrocarbon compounds by distillation."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce commonly accepted mechanisms",
                                "describe reverse water gas shift reaction",
                                "describe Fischer-Tropsch reaction",
                                "propose mechanism for selective formation of aromatic hydrocarbons",
                                "describe formation of CO2 and carbon deposition",
                                "describe formation of carbon suboxide",
                                "describe trimerization and hydrogenation of carbon suboxide"
                            ],
                            "num_characters": 3862,
                            "outline_medium": [
                                "describe commonly accepted mechanisms of iron catalyzed CO2 hydrogenation reactions",
                                "propose mechanism for selective formation of aromatic hydrocarbons",
                                "illustrate trimerization and hydrogenation of carbon suboxide"
                            ],
                            "outline_short": [
                                "propose mechanism for selective formation of aromatic hydrocarbons"
                            ]
                        },
                        {
                            "title": "Lignin Decomposition by the Fe/Fe3O4 Nanocatalyst",
                            "paragraphs": [
                                "The nanocatalysts are also able to depolymerize lignin. Approximately 30 percent of all plant-based biomass comprises lignin, which is a crosslinked racemic macromolecule (Mm>10,000, poly-dispersity >1.5) composed via radical-radical coupling of p-coumaryl alcohol, coniferyl alcohol, sinapyl alcohol and other low molecular weight components. Lignin is a low cost abundant by-product of cellulosic biofuel production and or the paper industry. However, lignin cannot be used for anything except heating purposes, because it is chemically very stable. Example 2 below describes an experiment in which lignin is reacted with hydrogen gas in the presence of a Fe/Fe3O4 nanocatalyst in accordance with the present invention resulting in the formation of aromatic and aliphatic hydrocarbon compounds."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "describe depolymerization of lignin by Fe/Fe3O4 nanocatalyst"
                            ],
                            "num_characters": 796,
                            "outline_medium": [
                                "describe depolymerization of lignin by Fe/Fe3O4 nanocatalysts"
                            ],
                            "outline_short": [
                                "describe lignin decomposition by Fe/Fe3O4 nanocatalyst"
                            ]
                        },
                        {
                            "title": "Examples",
                            "paragraphs": [
                                "The following examples set forth materials and methods in accordance with embodiments of the present invention. It is to be understood, however, that these examples are provided by way of illustration and nothing therein should be taken as a limitation upon the overall scope of the invention.",
                                "**Example 1**",
                                "In this example, the selective formation of aromatic hydrocarbons from CO2 hydrogenation reactions catalyzed by a Fe/Fe3O4 nanocatalyst are discussed.",
                                "**Synthesis of Fe/Fe3O4 Nanoparticles**",
                                "Recently, a facile method to synthesize highly crystalline Fe/Fe3O4 nanoparticles was reported by Lacroix et al., Nano Lett 2011, 11, 1641. These nanoparticles were found to be robust against deep oxidation because of the formation of protective crystalline Fe3O4 shell upon the direct oxidation of the bcc-Fe core. The highly crystalline Fe/Fe3O4 nanoparticles were chosen as the catalyst for the CO2 hydrogenation reaction, as it was proposed that the unique “hardness” of this nano-structure would prevent the deactivation of the nanocatalyst by sintering at elevated reaction temperature. The Fe/Fe3O4 nanoparticles were synthesized according to the published procedure with some modifications. The reaction was also scaled up by a factor of three.",
                                "A 250 mL, three-necked, round-bottom flask equipped with a magnetic stir bar, one cold water cooled jacket condenser on the middle neck, one septum and one temperature probe on each of the outer necked was charged with 60 mL 1-octadecene (ODE), 0.9 mL oleylamine and 0.831 g hexadecylammonium chloride (HAD HCl). The reaction system was connected to a Schlenk line through the top of the jacket condenser. The reaction mixture was degassed at 120° C. for 30 min with vigorous stirring. After refilling with argon, the reaction mixture was heated to 180° C. To avoid violent Fe(CO)5 reflux, three portions of 0.70 mL Fe(CO)5 were added to the ligands (oleylamine and HAD HCl) and solvent (ODE) mixture via syringe every 20 min at 180° C. instead of adding the iron precursor all at one time. After the third addition, the reaction mixture was kept for 40 min at 180° C. to permit controlled nanoparticle growth, and then allowed to cool down to RT. After decanting of the supernatant, the nanoparticles that were accumulated on the magnetic stirring bar were thoroughly washed with hexane and then ethanol (sonication) to remove the free ligands. The NPs were dried in high vacuum, and the yield based on iron was found to be 95%. After synthesis, the Fe/Fe3O4 particles were found to have diameters between 10 nm and 20 nm. They also feature an organic ligand sphere. This ligand sphere is removed at temperatures above 300° C. in the presence of either hydrogen or carbon monoxide.",
                                "**Characterization of the Catalysts**",
                                "As shown in FIG. 1, the TEM image reveals that the newly synthesized Fe/Fe3O4 nanoparticles are roughly spherical with a core/shell structure. The mean core diameter is 12 nm, and the shell thickness is 2 nm. HRTEM indicate that each Fe/Fe3O4 nanoparticle assumes polycrystalline structure with rigid edges.",
                                "The XRD characterization confirmed the crystalline structure of the Fe/Fe3O4 nanoparticles. The (110) and (200) peaks corresponded to bcc-Fe. XRD characterization was repeated after exposing the nanoparticles to air at room temperature for 2 months, and no noticeable change could be discerned from the XRD patterns as compared to these of the freshly-made sample.",
                                "Whereas the nanocatalyst are comprised mainly of Fe(0) and amorphous material before reaction, as XRD indicates, Fe(0), Fe3O4, FeO and iron-oxide bound water are discernible after 10 catalytic cycles.",
                                "**CO2 Hydrogenation Reaction**",
                                "The Fe/Fe3O4 nanoparticle-catalyzed CO2 hydrogenation reaction was performed in a home-built reactor. 50 mg of Fe/Fe3O4 nanoparticles were subjected to a continuous supply of (1:1 mol/mol) CO2/H2 atmosphere at 1-1.1 atm pressure. Gas samples were withdrawn from the reactor and analyzed by GC-MS during the reaction. Upon heating from room temperature (RT) to 400° C., traces of butane (2.881 min), benzene (4.135 min) and toluene (5.819 min) were observed, together with a major peak (2.989 min) and minor peak (5.765 min) in the GC profile corresponding to 68 and 71 mass units. These two species were assigned to carbon suboxide (C3O2) and its partially reduced form (C3O2H3). Upon raising the temperature to 440° C., three new peaks at (7.915 min, 8.100 min, 8.688 min), all corresponding to 106 mass units, appeared. By comparing with commercially available standard samples, these three peaks were identified as m-xylene, p-xylene and o-xylene, respectively. The reaction temperature was raised with a rate of 1° C./min afterwards, and gas samples were subjected to GC-MS analysis every 20 mins. It was found that with the increase of reaction temperature, the intensity of the peak at 2.989 min (C3O2) decreased gradually. At the same time, the intensity of the benzene peak (4.135 min) and toluene peak (5.819 min) increased. At 480° C., the peaks at 2.989 min (C302) disappeared completely, while the peak at 5.765 min (C3O2H3) still persisted until the temperature reached 500° C. Further increasing temperature to 520° C. led to the decrease of the xylenes' peaks. The decrease of the toluene peak and the increase of the benzene peak were observed while keeping the reaction at 520° C. for 40 min.",
                                "Heating of CO2/H2 in the absence of nanocatalyst and heating of the catalyst under nitrogen did not result in the formation of detectable traces of aromatic compounds. Furthermore, aromatic hydrocarbons have been formed at a CO2 to H2 ratio of 1:1 and 2:1 mol/mol) indicating that the chemical nature of the formed reduction products of carbon dioxide is not strongly dependent on the chemical composition of the CO2/H2 mixture.",
                                "**Alternative Nanoparticle Synthesis Method Using Tetraethylammonium Chloride as Additive**",
                                "A 100 mL, three-necked, round-bottom flask equipped with a magnetic stir bar, one cold water cooled jacket condenser on the middle neck, one septum and one temperature probe on each of the outer necks was charged with 40 mL 1-octadecene (ODE), 0.6 mL oleylamine and 0.33 g tetraethylammonium chloride. The reaction system was connected to a Schlenk line through the top of the jacket condenser. The reaction mixture was degassed at 120° C. for 30 min with vigorous stirring. After refilled with argon, the reaction mixture was heated to 180° C. Next, 1.4 mL Fe(CO)5 was injected into the reaction mixture via a syringe. The reaction mixture was kept at 180° C. for 40 min, and cooled to room temperature naturally. The supernatant was decanted, and the iron nanoparticles accumulated on the magnetic stir bar were washed with hexane and ethanol. The product was dried in vacuum and stored at room temperature for further use. Based on iron, the yield of the reaction was 90%.",
                                "**Tests of the Mechanistic Paradigm**",
                                "As noted above, it has been proposed that mesitylene undergoes stepwise de-methylation to form xylenes, toluene, and finally, benzene. To verify the formation of mesitylene, the CO2 hydrogenation reaction was directly subjected to 520° C. using exactly the same conditions as described. A peak at 10.417 min, corresponding to mass unit 120 was observed in the GC-MS. This compound was identified as mesitylene by comparing with standard sample. This proved unambiguously that mesitylene is formed from CO2 and H2 at the surface of Fe/Fe3O4 nanocatalysts",
                                "**Reuse of Catalyst**",
                                "Catalyst was reused up to 18 times, with no degradation of the catalytic activity observed. This observation is based on the consumption efficiency of CO2 from the gas phase and product analysis by GC-MS. Evidence from XPS studies showed that the nanocatalysts consist of crystalline alpha-Fe before the beginning of the catalytic activity. After 18 catalytic cycles, Fe(0) disappeared and Fe3O4 is the catalytic phase. Carbon is stored as Fe3C. Its volume fraction increased from run 1 to run 18.",
                                "**Z-Potential of the Fe/Fe3O4 Catalyst**",
                                "The Zeta-potential of the Fe/Fe3O4 catalyst was measured in ethanol solution. The value was +27 mV. A range from +10 mV to +50 mV can be expected.",
                                "**BET Surface of the Fe/Fe3O4 Catalyst**",
                                "The BET surfaces for both preparations of Fe/Fe3O4 catalyst ranged from 20-25 and preferably 23-24 m2/g, for fresh catalyst, and from 50-60 m2/g, and preferably 56-57 m2/g after 10 runs (reactions). However, as noted above, despite some build up of carbon at the surface, the efficiency of the catalysts remains relatively stable even after repeated passes.",
                                "**Example 2**",
                                "In this example, lignin is reacted with Hz in the presence of a Fe/Fe3O4 catalyst prepared as described above to produce various aromatic hydrocarbon compounds. 150 mg of lignin and 20 mg Fe/Fe3O4 MNPs were mixed by grinding. The solid mixture was charged to a ceramic boat and slid into the reactor. After pulling a vacuum for 3 hours, the reactor was refilled with Hz, and then the temperature was increased to 460° C. GC-MS performed on the reaction product after 20 minutes of reaction time shows the formation of xylenes, toluene, benzene, propane, butane and other cyclic hydrocarbons.",
                                "**Example 3**",
                                "In this example, the preparation of an α-alumina supported Fe/Fe3O4 nanocatalyst and a zeolite supported Fe/Fe3O4 nanocatalyst and selective formation of aromatic hydrocarbons from CO2 hydrogenation reactions catalyzed by the nanocatalysts are discussed.",
                                "**Preparation of α-Alumina Supported Fe/Fe3O4**",
                                "A 250 mL, three-necked, round-bottom flask equipped with one mechanical stirrer, one cold water cooled jacket condenser, one temperature probe on each of the outer necks was charged with 120 mL 1-octadecene (ODE), 1.80 mL oleylamine, 1.75 g hexadecylammonium chloride (HAD HCl) and 10 g pre-dried α-alumina. The reaction system was connected to a Schlenk line through the top of the jacket condenser. The reaction mixture was degassed at 120° C. for 30 min with vigorous stirring. After being refilled with argon, the reaction mixture was heated to 180° C., and then 5 mL Fe(CO)5 was injected into the reaction mixture via a syringe. The reaction mixture was kept at 180° C. for 30 min, and cooled to room temperature naturally. After shortly applying a magnet underneath the flask, the supernatant was decanted to three 50 mL centrifuge tubes evenly. The α-alumina supported Fe/Fe3O4 particles were collected by centrifugation at 4000 RPM and washed with hexane and ethanol sequentially. After being dried under vacuum, 9.6 g of black powder was obtained.",
                                "**Preparation of Zeolite Y Supported Fe/Fe3O4**",
                                "A 250 mL, three-necked, round-bottom flask equipped with one mechanical stirrer, one cold water cooled jacket condenser, one temperature probe on each of the outer necks was charged with 120 mL 1-octadecene (ODE), 1.80 mL oleylamine, 1.75 g hexadecylammonium chloride (HAD HCl) and 4.3 g pre-dried zeolite Y. The reaction system was connected to a Schlenk line through the top of the jacket condenser. The reaction mixture was degassed at 120° C. for 30 min with vigorous stirring. After being refilled with argon, the reaction mixture was heated to 200° C., and then 3 mL Fe(CO)5 was injected into the reaction mixture via a syringe. The reaction mixture was kept at 180° C. for 30 min, and cooled to room temperature naturally. After shortly applying a magnet underneath the flask, the supernatant was decanted to three 50 mL centrifuge tubes evenly. The zeolite Y supported Fe/Fe3O4 particles were collected by centrifugation at 4000 RPM and washed with hexane and ethanol sequentially. After being dried under vacuum, 4.0 g of a black powder was obtained.",
                                "**Characterization of Solid Supported Fe/Fe3O4 Catalysts**",
                                "FIG. 3 shows representative TEM micrographs of the α-Al2O3 supported Fe/Fe3O4 both for fresh catalyst (1a, 1b, 1c) and catalyst recycled after 5 runs (2a, 2b, 2c). Homogeneous distribution of iron nanoparticles on the surface of α-Al2O3 is illustrated. The Fe/Fe3O4 particle assume rod-like shape on this support. Both the morphology and size of the supported particles did not change over 5 runs of catalytic cycles.",
                                "EDX characterization revealed that, for the fresh catalyst, 9.49% iron (by weight) was loaded on the α-Al2O3 support. After 5 runs of catalytic cycles, iron content dropped to 7.50%. The change of iron content may be due to the oxidation of the Fe(0) core over the catalytic reaction. Scanning transmission electron microscope (STEM) of the catalyst further confirmed the homogeneous distribution of iron particles on the solid support. The STEM is shown in FIG. 4 with the top row showing elemental mapping for the fresh catalyst, and the bottom row showing elemental mapping for the catalyst after 5 runs.",
                                "FIG. 5 shows representative TEM micrographs of the zeolite Y supported Fe/Fe3O4 both for before catalysis (3a, 3b, 3c) and after 5 runs (4a, 4b, 4c). Due to the porous nature of zeolite Y, Fe/Fe3O4 nanoparticles were deposited both on the surface and inside the pores of the solid support. The deposited Fe/Fe3O4 particle assumed irregular shapes on this support. Both the morphology and size of the supported particles did not change over 5 runs of catalytic cycles.",
                                "EDX characterization revealed that, for the fresh catalyst, 10.64% iron (by weight) was loaded on the zeolite Y support. After 5 runs of catalytic cycles, iron content increased to 11.70%. Scanning transmission electron microscope (STEM) demonstrated that Fe/Fe3O4 distributed on zeolite Y supported homogeneously, and the iron distribution didn't change over catalytic cycles. The STEM is shown in FIG. 6 with the top row showing elemental mapping for the fresh catalyst, and the bottom row showing elemental mapping for the catalyst after 5 runs.",
                                "**CO2 Hydrogenation Catalyzed by Solid Supported Fe/Fe3O4**",
                                "In each trial, 150 mg solid supported Fe/Fe3O4 catalyst in a ceramic boat was inserted into the reactor. The catalyst was heated to 350° C. under high vacuum for 2 hours to remove any absorbed organic molecules. After cooling to room temperature, the reactor was refilled with 120 mL of 1/1 CO2/H2 mixture at 1 atm pressure. The reactor was equipped with a magnetic-driven fan to enhance the gas flow over the solid catalysts. The circulating fan was regulated by an external magnetic stirrer. The reaction temperature was brought to 400° C. in 20 min. Gas samples were withdraw from the reactor and analyzed via GC-MS. 1,3,5-trimethylbenzene was found to be the major product with both solid supported catalysts. Within 1 hour, demethylation products, such as xylenes, toluene and benzene were observed. Each catalyst was reused for 5 runs, and no major loss of activity was observed.",
                                "**Example 4**",
                                "In this example, the effect of the support material composition on aromatic hydrocarbon product selectivity was studied. CO2 hydrogenation reactions were catalyzed with α-alumina supported Fe/Fe3O4 nanocatalyst and zeolite Y supported Fe/Fe3O4 nanocatalyst prepared as described in Example 3. Each catalyst comprised approximately 10±2% Fe/Fe3O4 content (by weight). The reactor was loaded with the respective solid-supported Fe/Fe3O4 nanocatalyst and absorbed organic molecules were removed as described in Example 3. A 1/1 CO2/H2 molar ratio mixture was introduced into the catalyst-filled reactor at 1 atm pressure and 480° C. After reacting for two hours, gas samples were withdrawn from the reactor and analyzed via GC-MS. The results are provided in Table 1.",
                                "Based on these results, the solid α-alumina support appears to enhance the formation of mesitylene and the solid zeolite Y support appears to enhance the formation of toluene and xylenes. Accordingly, product selectivity can be controlled based upon selection of the non-reactive support material. Moreover, the results demonstrate that the reaction results in formation of a fairly narrow product distribution in that greater than 90% of the reaction products, for each catalyst, were aromatic hydrocarbon compounds, and only two non-aromatic compounds were produced in meaningful quantities.",
                                "In certain embodiments, the present invention may further include a method of synthesizing Fe/Fe3O4 core/shell nanoparticles on a non-reactive support material comprising the steps of:",
                                "providing a reaction mixture within a reaction vessel, said reaction mixture comprising a C10-C24 alkene solvent, a C10-C24 amine having at least one ethylenically unsaturated group, a C4-C24 ammonium salt, and a non-reactive support material; heating said reaction mixture to a temperature of between about 150° C. to about 210° C.;",
                                "adding to said reaction mixture a quantity of Fe(CO)5;",
                                "reacting said Fe(CO)5, said C10-C24 amine, and said C4-C24 ammonium salt so as to form a plurality of Fe/Fe3O4 core/shell nanoparticles on said non-reactive support, said Fe/Fe3O4 nanoparticles comprising an outer organic ligand monolayer formed from at least portions of said C10-C24 amine and/or said C4-C24 ammonium salt; and recovering said Fe/Fe3O4 nanoparticles on said non-reactive support from said reaction vessel.",
                                "In certain embodiments, the C10-C24 alkene solvent is 1-octadecene.",
                                "In certain embodiments, the C4-C24 ammonium salt is selected from the group consisting of C8-C22 primary alkyl ammonium salts, C4-C24 quaternary alkyl ammonium salts, and combinations thereof.",
                                "In certain embodiments, the C4-C24 ammonium salt is hexadecylammonium chloride and/or tetraethylammonium chloride.",
                                "In certain embodiments, the C10-C24 amine is oleylamine",
                                "In certain embodiments, the reaction mixture is heated to about 180° C. prior to addition of said Fe(CO)5.",
                                "In certain embodiments, the reacting step is performed while maintaining said reaction mixture at a temperature of between about 150° C. to about 210° C.",
                                "In certain embodiments, after the reacting step, said Fe/Fe3O4 nanoparticles are cooled to room temperature, washed to remove free ligands, and dried.",
                                "In certain embodiments, following the recovering step, said Fe/Fe3O4 nanoparticles are heat treated at a temperature above 300° C. to remove at least a portion of said outer organic ligand monolayer.",
                                "In certain embodiments, the non-reactive support material is selected from the group consisting of zeolites and α-alumina."
                            ],
                            "subsections": [],
                            "outline_long": [
                                "introduce examples of materials and methods in accordance with embodiments of the present invention",
                                "describe Example 1, selective formation of aromatic hydrocarbons from CO2 hydrogenation reactions",
                                "synthesize Fe/Fe3O4 nanoparticles",
                                "characterize Fe/Fe3O4 nanoparticles using TEM and XRD",
                                "perform CO2 hydrogenation reaction using Fe/Fe3O4 nanoparticles",
                                "analyze reaction products using GC-MS",
                                "describe alternative nanoparticle synthesis method using tetraethylammonium chloride as additive",
                                "test mechanistic paradigm",
                                "reuse catalyst up to 18 times",
                                "measure Z-potential of Fe/Fe3O4 catalyst",
                                "measure BET surface of Fe/Fe3O4 catalyst",
                                "describe Example 2, reaction of lignin with H2 in the presence of Fe/Fe3O4 catalyst",
                                "mix lignin and Fe/Fe3O4 MNPs",
                                "perform reaction and analyze products using GC-MS",
                                "describe Example 3, preparation of α-alumina supported Fe/Fe3O4 nanocatalyst and zeolite supported Fe/Fe",
                                "prepare α-alumina supported Fe/Fe3O4",
                                "prepare zeolite Y supported Fe/Fe3O4",
                                "characterize solid supported Fe/Fe3O4 catalysts using TEM and EDX",
                                "perform CO2 hydrogenation catalyzed by solid supported Fe/Fe3O4",
                                "analyze reaction products using GC-MS",
                                "describe Example 4, effect of support material composition on aromatic hydrocarbon product selectivity",
                                "perform CO2 hydrogenation reactions using α-alumina supported Fe/Fe3O4 and zeolite Y supported Fe/Fe3O4",
                                "analyze reaction products using GC-MS",
                                "discuss results and product selectivity",
                                "describe method of synthesizing Fe/Fe3O4 core/shell nanoparticles on a non-reactive support material",
                                "provide reaction mixture within a reaction vessel",
                                "heat reaction mixture to a temperature of between about 150° C. to about 210° C.",
                                "add Fe(CO)5 to reaction mixture",
                                "react Fe(CO)5, amine, and ammonium salt to form Fe/Fe3O4 core/shell nanoparticles",
                                "recover Fe/Fe3O4 nanoparticles on non-reactive support from reaction vessel",
                                "specify C10-C24 alkene solvent as 1-octadecene",
                                "specify C4-C24 ammonium salt as hexadecylammonium chloride and/or tetraethylammonium chloride",
                                "specify C10-C24 amine as oleylamine",
                                "specify reaction mixture heating to about 180° C. prior to Fe(CO)5 addition",
                                "specify reacting step at a temperature of between about 150° C. to about 210° C.",
                                "specify post-reaction treatment of Fe/Fe3O4 nanoparticles"
                            ],
                            "num_characters": 18310,
                            "outline_medium": [
                                "introduce examples of materials and methods in accordance with embodiments of the present invention",
                                "describe synthesis of Fe/Fe3O4 nanoparticles",
                                "characterize Fe/Fe3O4 nanoparticles using TEM and XRD",
                                "perform CO2 hydrogenation reaction using Fe/Fe3O4 nanoparticles",
                                "analyze reaction products using GC-MS",
                                "describe alternative nanoparticle synthesis method using tetraethylammonium chloride",
                                "test mechanistic paradigm of CO2 hydrogenation reaction",
                                "reuse Fe/Fe3O4 nanoparticles as catalyst",
                                "measure Z-potential of Fe/Fe3O4 catalyst",
                                "measure BET surface of Fe/Fe3O4 catalyst",
                                "react lignin with H2 in presence of Fe/Fe3O4 catalyst",
                                "prepare α-alumina supported Fe/Fe3O4 nanocatalyst",
                                "prepare zeolite Y supported Fe/Fe3O4 nanocatalyst",
                                "characterize solid supported Fe/Fe3O4 catalysts using TEM and EDX",
                                "perform CO2 hydrogenation reaction using solid supported Fe/Fe3O4 catalysts",
                                "study effect of support material composition on aromatic hydrocarbon product selectivity",
                                "describe method of synthesizing Fe/Fe3O4 core/shell nanoparticles on non-reactive support material",
                                "provide specific embodiments of the method of synthesizing Fe/Fe3O4 core/shell nanoparticles"
                            ],
                            "outline_short": [
                                "introduce example 1: CO2 hydrogenation reaction catalyzed by Fe/Fe3O4 nanocatalyst",
                                "synthesize Fe/Fe3O4 nanoparticles",
                                "characterize Fe/Fe3O4 nanoparticles",
                                "perform CO2 hydrogenation reaction",
                                "test mechanistic paradigm",
                                "reuse catalyst",
                                "measure Z-potential and BET surface of Fe/Fe3O4 catalyst",
                                "introduce example 2: lignin reaction with H2 in presence of Fe/Fe3O4 catalyst",
                                "introduce examples 3 and 4: preparation and characterization of solid supported Fe/Fe3O4 catalysts and CO2 hydrogenation reactions"
                            ]
                        }
                    ],
                    "outline_long": [
                        "introduce Fischer-Tropsch nanocatalysts",
                        "describe advantages over existing catalysts",
                        "provide general reaction equation",
                        "describe specific reaction equation",
                        "introduce nanocatalyst composition",
                        "describe core/shell nanoparticles",
                        "specify average diameter and surface area",
                        "describe crystalline structure",
                        "mention organic ligand monolayer",
                        "describe non-reactive support material",
                        "specify surface area of support material",
                        "introduce promoter material",
                        "describe synthesis of nanocatalyst",
                        "specify reaction mixture components",
                        "describe heating and addition of Fe(CO)5",
                        "describe formation of Fe/Fe3O4 nanoparticles",
                        "describe removal of ligand monolayer",
                        "describe recovery of nanocatalyst",
                        "describe use of nanocatalyst in CO2 hydrogenation",
                        "specify reaction conditions and product composition",
                        "describe advantages of nanocatalyst"
                    ],
                    "num_characters": 10986,
                    "outline_medium": [
                        "introduce Fischer-Tropsch reaction",
                        "describe limitations of existing catalysts",
                        "describe novel nanocatalysts for aromatic hydrocarbon formation",
                        "specify composition and structure of Fe/Fe3O4 nanoparticles",
                        "describe synthesis of nanocatalysts on non-reactive support material",
                        "describe optional promoter materials for improved catalyst performance",
                        "outline method for synthesizing unsupported Fe/Fe3O4 nanoparticles",
                        "describe use of nanocatalysts for producing aromatic hydrocarbons",
                        "specify reaction conditions and product composition",
                        "describe advantages of the present invention"
                    ],
                    "outline_short": [
                        "introduce Fischer-Tropsch reaction",
                        "describe nanocatalysts composition and properties",
                        "outline synthesis method of nanocatalysts",
                        "describe use of nanocatalysts in CO2 hydrogenation reaction",
                        "detail reaction conditions and product composition"
                    ]
                }
            ],
            "outline_long": [],
            "num_characters": 0,
            "outline_medium": [],
            "outline_short": []
        }
    ],
    "claims": [
        "1. A method of synthesizing one or more aromatic hydrocarbon compounds comprising:\nproviding within a reactor a quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles;\nintroducing into said reactor and contacting said catalytic material with a quantity of reactants comprising a source of carbon atoms and a source of hydrogen atoms;\nreacting said reactants within said reactor under conditions for forming said one or more aromatic hydrocarbon compounds; and\nrecovering said one or more aromatic hydrocarbon compounds from said reactor.",
        "2. The method according to claim 1, wherein said source of carbon atoms is selected from the group consisting of a biomass material, CO2, CO, and combinations thereof.",
        "3. The method according to claim 2, wherein said source of carbon atoms comprises CO2 and/or CO.",
        "4. The method according to claim 2, wherein said biomass material comprises lignin.",
        "5. The method according to claim 1, wherein said source of hydrogen atoms is selected from the group consisting of H2, H2O, CH4, and combinations thereof.",
        "6. The method according to claim 1, wherein said reacting step within said reactor occurs at a pressure of between about 1 to about 100 atm.",
        "7. The method according to claim 6, wherein said reacting step within said reactor occurs at a pressure of between about 1 to about 1.1 atm.",
        "8. The method according to claim 1, wherein said reacting step within said reactor occurs at a temperature of between about 380° C. to about 560° C.",
        "9. The method according to claim 1, wherein said reactor operates as a batch reactor, said catalyst undergoing at least 10 reaction cycles prior to being regenerated.",
        "10. The method according to claim 1, wherein said one or more aromatic hydrocarbon compounds recovered from said reactor are selected from the group consisting of xylenes, toluene, benzene, and mixtures thereof.",
        "11. The method according to claim 1, wherein said one or more aromatic hydrocarbon compounds recovered from said reactor are directly usable as a fuel in an internal combustion engine upon recovery from said reactor without under going further refinement.",
        "12. The method according to claim 1, wherein said source of carbon atoms is not subjected to thermolysis prior to being introduced into said reactor.",
        "13. The method according to claim 1, wherein said nanoparticles are supported on a non-reactive support substrate.",
        "14. The method according to claim 13, wherein said non-reactive support substrate comprises a zeolite.",
        "15. A method of synthesizing one or more aromatic hydrocarbon compounds comprising:\nproviding within a reactor a quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles;\nintroducing into said reactor and contacting said catalytic material with a quantity of reactants comprising a source of carbon atoms and a source of hydrogen atoms, said source of carbon atoms being selected from the group consisting of lignin, CO2, CO, and combinations thereof, said source of hydrogen atoms being selected from the group consisting of Hz, H2O, CH4, and combinations thereof;\nreacting said reactants within said reactor under conditions for forming said one or more aromatic hydrocarbon compounds, said conditions within said reactor comprise a temperature of between about 380° C. to about 560° C., and a pressure of between about 1 to about 1.1 atm; and\nrecovering said one or more aromatic hydrocarbon compounds from said reactor, said one or more aromatic hydrocarbon compounds being selected from the group consisting of xylenes, toluene, benzene, and mixtures thereof, said aromatic hydrocarbon compounds comprising at least 75% by weight of the total reaction products produced by said reacting step.",
        "16. A system for synthesizing one or more aromatic hydrocarbon compounds comprising:\na reactor comprising a quantity of a catalytic material comprising Fe/Fe3O4 core/shell nanoparticles;\none or more reactant feed streams coupled with said reactor and operable to deliver to said reactor a source of carbon atoms and a source of hydrogen atoms;\nsaid reactor operating under conditions for reacting said source of carbon atoms and said source of hydrogen atoms in the presence of said catalytic material for forming said one or more aromatic hydrocarbon compounds; and\na reaction product discharge stream coupled with said reactor and operable to remove said one or more aromatic hydrocarbon compounds from said reactor.",
        "17. The system according to claim 16, wherein said nanoparticles are supported on a non-reactive support substrate.",
        "18. The system according to claim 16, wherein said reactor is a batch reactor, said catalytic material being capable of undergoing at least 10 reaction cycles prior to being replaced or regenerated.",
        "19. The system according to claim 16, wherein said reactor is a continuous reactor, and said source of carbon atoms comprises CO2, one mole of said catalytic material being capable of converting between 10,000 to 50,000 moles of CO2 into said one or more hydrocarbon compounds before the catalyst needs to be regenerated.",
        "20. The system according to claim 16, wherein said reactor operates at a temperature of between about 380° C. to about 560° C., and a pressure of between about 1 to about 1.1 atm.",
        "21. The system according to claim 16, wherein said source of carbon atoms delivered to said reactor by said at least one reactant feed stream is selected from the group consisting of lignin, CO2, CO, and combinations thereof.",
        "22. The system according to claim 16, wherein said source of hydrogen atoms delivered to said reactor by said at least one reactant feed stream is selected from the group consisting of Hz, H2O, CH4, and combinations thereof.",
        "23. The system according to claim 16, wherein said one or more aromatic hydrocarbon compounds removed from said reactor by said reaction product discharge stream are selected from the group consisting of xylenes, toluene, benzene, and mixtures thereof.",
        "24. A catalytic material operable to catalyze a reaction resulting in the formation of one or more aromatic hydrocarbon compounds comprising: a plurality of Fe/Fe3O4 core/shell nanoparticles having an average diameter of less than about 20 nm on a non-reactive support substrate.",
        "25. The catalytic material according to claim 24, wherein said non-reactive support substrate comprises a zeolite.",
        "26. The catalytic material according to claim 24, wherein said nanoparticles comprise crystalline core and shell structures.",
        "27. The catalytic material according to claim 24, wherein said nanoparticles comprise an organic ligand monolayer adjacent said shell.",
        "28. The catalytic material according to claim 24, wherein said nanoparticles are free of silane coatings."
    ]
}